{
  "sid": "go7jak",
  "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/",
  "title:": "Do I actually want a PhD, or is being in academia so integral to my identity that I can’t picture anything else?",
  "text": "The question in the title is rhetorical. This is more of a venting post (although insights/advice is absolutely welcome!)\n\nI’m currently finishing my 3rd year of a Sociology degree. I absolutely love this field. I also love doing research, particularly qualitative. I love the intellectual stimulation that doing research in this field has provided me thus far. \n\nWith that being said, I’m also burnt out from being in school, and I’ve begun to question if going to grad school is the right idea for me. I’ve been planning on pursuing a PhD in Sociology since my first year of college, and everything I’ve done in college since has been with that intention. A year ago, the thought of moving across the country to attend grad school was intriguing, but now it just scares me. \n\nI know being scared of change or something unfamiliar shouldn’t deter me from a particular goal, but at the same time, I value my happiness and worry about being alienated in grad school. \n\nI also think that because I’ve always been the “gifted kid” that I feel pressured to get the most advanced degree at one of the best schools. I realize that a big part of my self confidence comes from external validation by authority figures. I have a hard time seeing myself as anything more than an “intellectual,” if that makes any sense. \n\nLike I said, I love doing sociological research, but I’m also very passionate about social justice, particular in gender and education. I’m considering doing Americorps or some sort of social services position for a year or two, getting an MSW and doing macro research, and then going back to school for a master’s in either social research or education research. \n\nI absolutely could still see myself getting a PhD later in life, but I’m hesitant to go to a program straight out of college. As much as I love doing research, I also wonder if I should explore other options and develop an identity out of being a student. \n\nIf anyone has any insights or advice on this, I would love to hear :)",
  "author": "complihated",
  "created": 1590102610,
  "over_18": false,
  "upvotes": 439,
  "upvote_ratio": 0.98,
  "comments": {
    "frgiy1r": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frgiy1r/",
      "text": "This hit me right in the feels. Obligatory [Spiderman meme](https://i.redd.it/bekphnqftcb41.jpg) because are you me?!\n\nPondering my motivations for entering and staying in academia do actually keep me up at night. Like you, I've often felt that so much of my identity is bound up in this idea of academic excellence that not pursuing academia would make me fell somehow *less than*. Less than what? I can't even articulate it. I don't really have any answers for you - except maybe a little story:\n\nI was similarly burnt out when I finished my undergrad (psychology). I went to a R1-equivalent (we don't have the R1 R2 system in my country) university that pushed its student extremely hard. Like, we're talking 'a couple of hushed up suicides a year' kind of hard. By my final year, I was juggling a full course load, a thesis, working in a lab, extra-curriculars and two community volunteering positions that I needed in order to even be competitive as a candidate for grad school and/or getting a job upon graduation. My mental health was shot to hell and I decided to take a gap year.\n\nWell. One gap year turned into four gap years. I have mixed feelings about those gap years. I was fortunate enough to secure a job in my sector that paid well *and* was related to my major. I got to see what working in community health was like, and also understand macro-level considerations for health policy and research. It gave me a much more well-rounded view of psychology than what academic psychology tends to provide - which is quite micro-level. Four years away from school also gave me the breathing room I needed to build on other areas of my life that were lacking, like meaningful relationships and personal hobbies. It also obviously let me have a better lifestyle than my default 'starving student' mode.\n\nBut. *But.*\n\nDespite all of that, I found it really hard to be happy. My job was somewhat research-adjacent, meaning that I was doing academic-lite. I would present at conferences, sometimes write a policy paper or two. But no original research and no hard data-crunching. I felt incredibly unfulfilled. I was at my happiest in my job when I was focusing on the most academia-like portions of my role. I *liked* grappling with abstract research ideas. I *liked* doing literature reviews. Heck, I even liked the process of review for publication! Other than those academic-y moments, most of the time, I didn't feel challenged, and I didn't feel like I was doing the things that mattered to me.\n\nIn hindsight, I would probably have done things differently. Maybe only taken 2 years instead of four. I can now identify that indescribable malaise that I felt as a kind of existential boredom. I felt stagnant. I felt like I was living in the intermission of my life, with no real goal and nothing to work toward. Honestly, I was probably at least mildly depressed throughout.\n\nWhen I finally got off my ass to apply for grad school and eventually got in, my entire outlook changed. All of a sudden, I had *purpose*. I felt like I was getting a piece of myself back - all the fiercest, bravest, most ambitious parts of me that I cherished. Academia obviously isn't without its challenges, but I would take that any day over giving up this part of myself again.\n\nSo - I didn't really answer your question. But I think it's okay to feel that your identity and all the things you love are bound up in academia. I tried to deny those pieces of myself for years and it didn't work out that well for me. In some ways, I lost four years where I could have been pursuing the things that actually mattered to me instead of the things society told me I should want (ie. relationships, material possessions).\n\nBottomline: Do what you feel is right for *you*. Nobody else is going to understand your motivations, dreams and drives better than yourself. If exploring other sides of yourself is something you really want to do, then do it! If being an academic nerd (and that is a compliment!) makes you happy, then be proud of it! :)",
      "author": "TwoSizes",
      "created": 1590162848,
      "upvotes": 2,
      "replies": {}
    },
    "frgdafm": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frgdafm/",
      "text": "Getting a PhD isn't a sprint it is much more like a marathon. Nothing says you have to go straight from undergrad to graduate school. The people evaluating your application are not going to think less of you for taking time off from school between degrees. I had two years between undergrad and my MA and then another two off between MA and PhD. There are a lot of people who go for their PhD a little later in life and in my experience they are more well adjusted and more pleasant to be around than the people who go straight through from undergrad to advanced degrees.",
      "author": "59snomeld",
      "created": 1590159981,
      "upvotes": 2,
      "replies": {}
    },
    "frgb5cg": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frgb5cg/",
      "text": "> I love doing sociological research, but I’m also very passionate about social justice, particular in gender and education. \n\nI feel like if you can connect to what you REALLY want to do *right now*... that'll be your answer. And remember that it's never too late to reinvent yourself later on and pursue other things.\n\nFocus more on what's guiding you internally (\"what will bring *me* fulfillment and meaning right now?\") as opposed to externally (\"I'm expected to go down this path...\"). You may still decide to pursue the PhD route (or not) but it'll be based on what gives *you* fulfillment (rather than responding to external pressure).",
      "author": "InterStellarPnut",
      "created": 1590158851,
      "upvotes": 1,
      "replies": {}
    },
    "frg9vjb": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frg9vjb/",
      "text": "I'm also a sociology grad and I know what you mean about being so identified with/by academia that it's hard to see where your desire for it ends and expectations begin. \n\nYou don't have to go on into a PhD. immediately. It's ok to take a few years \"off\" to work in the industry or other fields, get a feel for what that like. I took 8 years \"off\" like this, worked in a corporate environment, burned out, then I was under-employed for a while... And now I'm finishing a second master's, planning to teach for one year, and start applying for a PhD. All in all, I'll be around 40 by the time I get my PhD. if I get there X-D. It feels almost \"too old\" but also, those years in \"the real world\", hard as they were,  were invaluable. I learned a lot about myself and what I'm willing to put up with, what makes me happy, what doesn't, and how resilient I can be when/if a time comes where I realise it's necessary to start from scratch. \n\nIt may well be you're more suited to something outside of Academia. You might decide to just have a break from studying and luck out, find a place and job that is perfect for you and never look back. It may be you hate it and realise that academia is your home after all. Who knows? You can only try and then adjust as you go.",
      "author": "Age_of_the_Penguin",
      "created": 1590158168,
      "upvotes": 2,
      "replies": {}
    },
    "frg7l30": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frg7l30/",
      "text": "It sounds like we’re having very similar problems except I’m doing psychology. \n\nI had no doubt in my mind that I wanted to get a PhD in psychology because I love research and academic and do really want to be a clinical psychologist or a professor to try to make a difference. \n\nIn the fall after a big music performance, suddenly I doubted all of my life decisions (I don’t want to pursue music). Especially now I’m still not sure if I want to go back. I’m also burnt out. I’m finishing up a five year program. Right now the idea of more school sounds terrible. I’m taking a gap year off (which now is troublesome because of this job market) but I’m hoping in a year or two I’ll feel better about school. \n\nEvery grad student, research student, and probably 98% of professors have told me that gap years are important and a lot of people who don’t take them and go straight to their PhD program after graduation, end up regretting it. \n\nSo although a gap year might change your path, I don’t know about you, but I’m looking forward to a gap year or two or three to have my brain and passion return to normal. Then crush grad school or wherever else life takes me. \n\nLong story short, like many others are saying. Take a gap year. You have so much time in your life to determine whether or not you want a PhD. I’ve seen 50 year olds get their psych or sociology PhD.",
      "author": "spro12",
      "created": 1590156909,
      "upvotes": 3,
      "replies": {}
    },
    "frg6lb0": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frg6lb0/",
      "text": "Listen to what you're feeling here, you don't need to come up with justifications and explanations for your feelings. You're feeling burned out and what was once intriguing is now scary. It doesn't matter if it's because of pressure to be high achieving, etc. You already know you don't really want to go to grad school right now, so don't. There's a difference between something feeling scary but exciting vs scary and reluctant. \n\nThere is no need to rush straight from undergrad to grad school, and honestly, getting out of academia for a bit and getting some life experience will probably end up being an advantage. Experience the world, do social justice work like you talked about, ask questions during that time and keep your critical thinking glasses on. Pay attention to what social issues you're most passionate about as you do this. Read a lot. Spend time being reflective about your experiences and try to actively apply what you've already learned from school. You want to do research, so get curious! Ask a lot of questions. You might even think of the time out of school as a prep year and not a gap year :)",
      "author": "miau_am",
      "created": 1590156347,
      "upvotes": 1,
      "replies": {}
    },
    "frg6793": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frg6793/",
      "text": "I think you are a great candidate for a PhD program now, rather than later and I will share my story to show why.\n\nI feel in love with research methods as a undergrad psychology student and wanted to get a PhD in a research field.  In the end I wound up doing a masters at UNC for educational research methods.  While my health did not allow for a PhD, I did finish the masters.  But more importantly the toolkit of research methods I knew and have experience using grow greatly, as did my ability to design, defend and promote my research.  Before my MA I did some qual research and some quant research.  Now I know several qual methods and the pros and cons of each one and have experience quantifying the results.  I also learned how to use different quant methods to systematically rip apart my data to look for what could give me false results.  Before while I did research in both areas I could not do research to the depth I do now, in particular use of triangulation or qual to quant designs (I always assumed they were exclusive methods or used in mixed methods).  The concept of using qualitative research as the input for quantitative research never occured to me.   Now this is my go to for a lot of research questions I may have.\n\nSince you are looking to do research out in the wild while on break, doing the PhD first will allow you to have a far stronger toolkit and make better use of the research you do.  If interested in almost anything else I would say take that gap year, but here it seems you would be better suited to get the degree first then go out and explore how to use it with the knowledge a PhD would give you to produce far better research.\n\nSo I say do it but do it for the knowledge it will give you.  Sure you  can get this knowledge on your own, but it will not be the same as doing it with a group of people and embedding yourself for several years into a research group.  Undergraduate research is nothing compared to graduate research and graduate school is about making research the primary focus of your day to day activity.  If you enjoy research like I do, this situation is a dream come true as you will be surrounded by people who generally share your love for research.  My life became a living hell outside of school during this time but would not trade the experience for anything and gladly walk through that hell again for it.\n\nIf you are seriously considering Educational Research feel free to drop me a line if you want to chat about my experiences.  I was in a Educational Psychology, Measurement and Evaluation masters program that merged into a Learning Science program.  I went all in on the quant side as I find qual research easier to self-teach than statistics but my program was split into a qual side and a quant side.\n\nAlso if you wish to transition research into a paying career look into program evaluation.  Not too many undergrads know what evaluation careers are, but essentially you use a mix of qual and quant research to determine if a program is actually effective at achieving its goals.  Very high paying career path as well.  If my health returns to the point of continuing education this is where I go to turn my love of research into a career outside of academia.",
      "author": "engelthefallen",
      "created": 1590156125,
      "upvotes": 2,
      "replies": {
        "frhzcu4": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frhzcu4/",
          "text": "I took an evaluation research class for sociology! It’s definitely a career path I can see myself in, maybe even more so than academia.",
          "author": "complihated",
          "created": 1590189627,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "frg43jn": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frg43jn/",
      "text": "Maybe the “burnt out” feeling is whats making you apprehensive. I had a very busy, very rough junior year of undergrad, followed by a summer of intense research as a part of a research program I partook in. I too, had the intention to pursue the phd in social science because I loved the subject matter, I wanted to contribute to the field, and I can see myself doing it as a career. \n\nHowever, by the start of senior year, I was feeling extremely burnt out and was battling depression for the majority of the year as a result. It wasn’t until recently that I was able to catch a break (winter vacation, easy second semester workload, covid) that I really felt able to relax, breathe, and rejuvenate. \n\nDuring my depression, I was so insecure about my graduate school prospects. I didn’t know if it was for me, if I should even bother trying to achieve the phd, etc. but now that I’m well rested, I can see the forest for the trees and my confidence is back to pre-depression levels and I’m happy to be embarking on my grad school journey this coming fall. I can now see why I wanted to pursue it in the first place, and while I am aware of the hardships I will face, I still feel like it’s attainable. \n\nAs others have mentioned in this post- If you need to take a break from school, do it. I wouldn’t wish that depression-fueled imposter syndrome on anyone. Being at your lowest certainly makes it hard to be motivated. It can really wreck you and derail you. Take the time to recharge if you need it. Your mental health is so important and academia will always be there if you decide you want to pursue it after all. Good luck",
      "author": "nalgononas",
      "created": 1590154897,
      "upvotes": 3,
      "replies": {}
    },
    "frfxwx5": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfxwx5/",
      "text": "I'm in this post and I don't like it, lol.\n\nNo advice as I'm in the same boat. I was accepted in an Ed.D program recently, but I'm debating on declining or postponing. I can afford it, but I don't really need it.",
      "author": "butnobodycame123",
      "created": 1590150841,
      "upvotes": 2,
      "replies": {}
    },
    "frfwzz6": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfwzz6/",
      "text": "There's nothing I can say that hasn't already been said. \n\nTake a gap year or 2. Do a job that isn't really academia and/or don't marry yourself to just one career path. You're young, explore your options.\n\nI was the same way and I took 3 years working in pharmaceuticals,  grew as a person. Decided to get my PhD. It sometimes sucks because obviously I was used to getting paid so much more and you can grow accustomed to the Independent life when you're working. Going back to school is kinda like hitting a big reset button on your life and starting over and a big pause on your career. \n\nHowever I'm still glad I did it and wrapped up my first year. I wouldn't nearly have been as successful if I had just gone straight from college. Do what you want, but that's my experience!",
      "author": "JHDog93",
      "created": 1590150157,
      "upvotes": 3,
      "replies": {}
    },
    "frfwk3h": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfwk3h/",
      "text": "It honestly sounds like you are a perfect candidate for a Ph.D. because you love research. It is okay ( and very normal) being burned out from school, but often we fall into the trap of emotional reasoning. If I feel anxious then it must be impossibly scary, or I feel uncomfortable, then this is the wrong thing for me. This does not need to be the case.  If you love research and your field is sociology, a Ph.D. is just a tool to get you to where you want. A Ph.D. (or even tenure) is never a goal in itself, but a stepping stone to position you for a job that you love. As high achieving students, we can put a lot of pressure on ourselves to hit all the \"goalposts\" or \"checkmarks\", and often we lose sight of the bigger picture of why we wanted to do this in the first place.\n\nIf you can, take a month to just relax, re-discover your love for the subject, read some amazing papers, and shift your framework to academia as just a means to an end. :) It could be that there are other professions that allow you to move towards a job that is line with your temperament and values, or it could be that academia is perfect for you.  Good luck!",
      "author": "nanon_2",
      "created": 1590149827,
      "upvotes": 3,
      "replies": {}
    },
    "frfvjeh": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfvjeh/",
      "text": ">I also think that because I’ve always been the “gifted kid” that I feel pressured to get the most advanced degree at one of the best schools.\n\nPhD degree is good at teaching humility",
      "author": "aknb",
      "created": 1590149022,
      "upvotes": 2,
      "replies": {
        "frhoj6y": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frhoj6y/",
          "text": "I watched an ASAPScience video a couple years ago that talked about the confidence decline students in Ivy-leagues experience, because every student there was the smartest student in their high school, and now they’re relatively average. \n\nI imagine getting a PhD is a very similar experience.",
          "author": "complihated",
          "created": 1590183633,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "frfviop": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfviop/",
      "text": "Agreed to others in this thread, I absolutely think exploring your options and alternatives to a PhD before committing to it is a good plan; it's very doable to spend a year or two of gap years before starting on your PhD (I did this, in fact).",
      "author": "regalalgorithm",
      "created": 1590149007,
      "upvotes": 3,
      "replies": {}
    },
    "frfq6ue": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfq6ue/",
      "text": "Allow me to be brutal for a second here - no one care's that you're an \"gifted kid\", or an \"academic\", OP.  No offense, millions of college students think they're special and \"gifted\", and the vast majority of them are still going to end up working a middle class job with a car loan and a mortgage, just like everyone else.  If you want to do a PhD because you like the material, you want to contribute to the field, or it's a personal goal, then I say go for it.  But understand that you will not be the smartest person in the room anymore and if you're whole point in doing it is to feel special, I suggest looking for the validation somewhere else, lest your bubble get popped and the illusion comes crashing down.  \n\n\nSorry for the harshness, just giving you some tough love.  I wish you all the best, but the real world can be harsh out there.",
      "author": "smmstv",
      "created": 1590144199,
      "upvotes": 6,
      "replies": {}
    },
    "frfg9bg": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfg9bg/",
      "text": "I was in the same situation as you, and made the (very hard at the time) decision NOT to pursue academia. I was always a highly achieving student, graduated cum laude from my bachelor's and master's and was on track for a PhD position. But I started noticing more and more that I felt like I had no true goal with academia, other than just continuing down the path I was already on. I had no true intrinsic research interests anymore. But at the same time I couldn't picture any thing other in my future besides academia. But what really helped me is to contact alumni from my research programs who did not pursue academia and ask them where they worked now, how they made the decision to leave academia etc. It helped me make my decision of pursing data science for non-profit companies and local governments.",
      "author": "vicster_6",
      "created": 1590134156,
      "upvotes": 2,
      "replies": {}
    },
    "frfb0ux": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfb0ux/",
      "text": "My question is:. What do you plan to do to earn money and pay back all those student loans?  Followed by: does getting a PhD make it more likely that you can do that?",
      "author": "BaschaW",
      "created": 1590129314,
      "upvotes": 0,
      "replies": {}
    },
    "frf96qv": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf96qv/",
      "text": "I always tell people that if you can get a job that would make you happy using the degree you have, don't go to grad school. However, some degrees all but require grad school if you intend to get a job in that field.\n\nI fall into the second category. I ended up taking a gap year to substitute teach in a bunch of different schools before going to grad school. That year gave me time to breathe, rest, and do my applications.\n\nPhD programs are difficult, stressful, and can set you up for a life of academia. I personally couldn't see myself stopping before achieving my dream of having a doctorate. I fully recommend the gap year. Time off from school will help you be more focused when you go back for that next degree.",
      "author": "KwhiteKnight",
      "created": 1590127728,
      "upvotes": 3,
      "replies": {}
    },
    "frf4h5r": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf4h5r/",
      "text": "have you talked yet with your graduate student instructors or professors for their opinion?",
      "author": "aznzoo123",
      "created": 1590123909,
      "upvotes": 2,
      "replies": {
        "frfepbs": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfepbs/",
          "text": "Not yet. I will probably talk to my mentor about it soon! \n\nMy school isn’t an R1 (or an R2, for that matter) and there’s no sociology grad program, so I feel like our soc department is pretty aware of the non-academic routes graduates take.",
          "author": "complihated",
          "created": 1590132668,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "frf3z5c": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf3z5c/",
      "text": "Once you get a real job youll realize that, while academia let you define yourself and your research questions, they didn’t give you anything else after that. A real job won’t necessarily be exactly what you wanted to do, but it’ll be a high percentage of what you want to do AND they’ll pay your real money and give you health care. AND you don’t have to worry after work. It’s okay to let go. In fact, it’s much better to!",
      "author": "memercopter",
      "created": 1590123527,
      "upvotes": 5,
      "replies": {}
    },
    "frf3rag": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf3rag/",
      "text": "wow did I write this? I feel this in my *bones*",
      "author": "dystopianmathgirl",
      "created": 1590123360,
      "upvotes": 7,
      "replies": {
        "frfi83y": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfi83y/",
          "text": "I came to say this, but I thought I shouldn’t depress OP by saying these doubts carry on into doing the PhD =|",
          "author": "sexy_bellsprout",
          "created": 1590136079,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "frf3lty": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf3lty/",
      "text": "The cool thing about academia is it has been around for a really really really long time! If you take some time off to pursue other interests or just to relax, it will always be an option to come back to. \n\nI just finished grad school a few weeks ago and I noticed that a big part of academia is “the stress olympics.” If you say you’re tired, you’ll be one upped by someone who hasn’t slept in days. They’ll be one upped by someone who has slept in weeks. This stupid contest of suffering is never ending.\n\nBeing well rested and focused on your goals helps to combat the inherent competitiveness of higher education. \n\nAdditionally! Your studies can continue outside of a formal setting. Just because you aren’t in a classroom or lab doesn’t mean you can’t continue to learn about a subject matter you love!",
      "author": "jh758657",
      "created": 1590123245,
      "upvotes": 12,
      "replies": {}
    },
    "frez2u5": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frez2u5/",
      "text": "You should read 12 rules for life by Jordan Peterson. You may learn a few things.",
      "author": "ztyitti",
      "created": 1590120019,
      "upvotes": -11,
      "replies": {}
    },
    "freygcd": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freygcd/",
      "text": "Going straight to the PhD is the \"default\" that a lot of people do when they get sucked into academia. If you want to make sure that you're doing it for the right reasons, take some time off to make it an active choice, not just the default.\n\nI recommend this to most people I talk to. Grad school will still be there, and your application will not get worse.",
      "author": "0102030405",
      "created": 1590119596,
      "upvotes": 12,
      "replies": {}
    },
    "fretn1i": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/fretn1i/",
      "text": "I think you know you want to do it but you're just a little burnt out and might be having cold feet. I was in denial about wanting a Masters Degree but then it eventually hit me that I needed to do it. I won't lie, the process has been stressful, but I am so glad I decided to continue my education. Don't sell yourself short, go for the motherfucking gold.",
      "author": "KamalaHarris4Prez",
      "created": 1590116516,
      "upvotes": 9,
      "replies": {
        "frf263f": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf263f/",
          "text": "I do worry that if I don’t apply now, I never will. What I’m heavily considering is getting a MS degree in applied social research at a school not too far away from my city and then working outside of academia (maybe adjuncting a bit, if I find I like teaching) for a couple years before deciding where to proceed. \n\nSo my hesitation isn’t with grad school entirely—just with getting a PhD right off the bat.",
          "author": "complihated",
          "created": 1590122179,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "freqkx6": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freqkx6/",
      "text": "Then don't, at least for now. I'm pretty sure soci is a field where people work and get masters between anyways. This isn't a decision you have to make junior year of college.",
      "author": "mediocre-spice",
      "created": 1590114624,
      "upvotes": 5,
      "replies": {}
    },
    "frekiwl": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frekiwl/",
      "text": "It never hurts to take a time out between undergrad and grad school.  Working in your field will widen your horizons and tell you whether a PhD is the direction you truly want and need to go.",
      "author": "mel_cache",
      "created": 1590110941,
      "upvotes": 6,
      "replies": {}
    },
    "freh937": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freh937/",
      "text": "[removed]",
      "author": null,
      "created": 1590108993,
      "upvotes": 93,
      "replies": {
        "frejo2g": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frejo2g/",
          "text": "Its true that you will find yourself feeling average or even dumb in graduate school, and certainly overwhelmed at times. But don't let that deter you if you decide that you want to pursue a degree because, in reality, every grad student feels this way at one time or another (especially in the beginning). If you decide that you really do want to go for a PhD then you can absolutely learn to take such feelings in stride and use them to better yourself; there is always going to be someone smarter than you, but that doesn't mean you are a failure. Life is hard, no matter what path you take and you are likely to experience feelings of inferiority no matter what you decide to do. What is important is that you understand and have confidence in yourself and your decisions. Trying things and changing your mind is absolutely part of this process, even with school:)",
          "author": "_melonball_",
          "created": 1590110426,
          "upvotes": 59,
          "replies": {
            "frek7p4": {
              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frek7p4/",
              "text": "[removed]",
              "author": null,
              "created": 1590110756,
              "upvotes": 11,
              "replies": {
                "frelwb4": {
                  "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frelwb4/",
                  "text": "Correct, that comment wasn't directed at you, just in response to what you said, which was spot on in many ways. At the same time, I felt that it would be useful to the OP to consider those issues from a different perspective as well. Honestly, your experience seems to be much more relevant to the OP than mine and your advice might suit them better. I'm sorry to hear that you had a bad experience going through your PhD, but it sounds like you were able to get something out of it in the end!",
                  "author": "_melonball_",
                  "created": 1590111761,
                  "upvotes": 16,
                  "replies": {
                    "frencxv": {
                      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frencxv/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1590112651,
                      "upvotes": 8,
                      "replies": {
                        "frf15jv": {
                          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf15jv/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1590121444,
                          "upvotes": 1,
                          "replies": {
                            "frf3bvv": {
                              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf3bvv/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1590123038,
                              "upvotes": 4,
                              "replies": {
                                "frf5zez": {
                                  "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf5zez/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1590125095,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "freyj3x": {
                  "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freyj3x/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1590119647,
                  "upvotes": 2,
                  "replies": {
                    "freyxse": {
                      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freyxse/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1590119924,
                      "upvotes": 18,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "frfrbk5": {
              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfrbk5/",
              "text": ">there is always going to be someone smarter than you\n\nI think this applies to more than just grad school.  There's also always going to be someone stronger than you, better looking than you, more witty than you, who has more money than you, who has more friends than you, etc. Just focus on yourself and what makes you happy.",
              "author": "smmstv",
              "created": 1590145290,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "frei1bz": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frei1bz/",
          "text": "I appreciate the brutal honesty of this response. \n\nWhile I do think that I’m smart, you’re totally right that pretty much everybody in grad school was the “smart kid.” Getting a PhD because it seems like something smart people do would only ruin my confidence in the long run. \n\nLike I said, I love doing research and I love the intellectual stimulation of it. But I also worry that at this point, too much of my identity is tied up in being a “high-achieving student” that graduate school would be more about fulfilling that rather than actually researching something I’m passionate about.",
          "author": "complihated",
          "created": 1590109457,
          "upvotes": 18,
          "replies": {
            "freqw4y": {
              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freqw4y/",
              "text": "Grad school is not about being a student with \"high achievement\". Classes don't matter. You're a full time researcher that happens to take additional enrichment courses. If it's not the right choice for you, it's not the right choice for you, but it's a substantially different environment and type of work than college. I was burnt out badly after college and have found my PhD a lot easier.",
              "author": "mediocre-spice",
              "created": 1590114815,
              "upvotes": 28,
              "replies": {}
            },
            "freiy50": {
              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freiy50/",
              "text": "[removed]",
              "author": null,
              "created": 1590109996,
              "upvotes": 20,
              "replies": {}
            },
            "frf5gbf": {
              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf5gbf/",
              "text": "I was exactly you. I grew up in a weird little town in the middle of nowhere but with the highest per capita number of PhDs in the nation. Academic achievement wasn't just my identity, it was my culture. I ended up going to grad school because I liked psychology, but also because I was always the smart kid and kinda wanted the degree prestige to go with it.\n\nLike others have said, grad school just about punched my teeth in on that notion. It sounds kinda silly but learning that you're not always the smartest or most capable person in the room anymore even if you try your hardest was a pretty tough evolution to go through mentally. I'm one week from my defense now, and ultimately I would choose this path again because I really do love this work and I found out I love mentoring as well. But I might have taken a gap year to develop other parts of my life too before going because straight from undergrad really burned me out on school, and I found it difficult to learn to live by myself as an adult at the same time as all the stress of grad school. \n\nI don't think it's bad to identify as a high-achieving person, but I do think you should remember that about yourself because every failure in grad school will sting more because of it - and there will be a lot of failures, you're pushing the boundaries of human knowledge. If you love this field you should go for it, but also keep your eyes open, stay grounded in other aspects of your identity that aren't tied to your academic performance, and maybe take some time in between if you can manage that.",
              "author": "smbtuckma",
              "created": 1590124671,
              "upvotes": 9,
              "replies": {
                "frg8fht": {
                  "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frg8fht/",
                  "text": "I find comments like yours fascinating. I was never the smartest person in the room because both my older brother and my best friend are substantially smarter then me. I wonder if, in some ways, those experiences of always feeling kind of dumb are making my PhD much easier? \n\nI don't particularly enjoy feeling stupid all the time (yay 3rd year), but at least I have experience feeling stupid. It makes me wonder because my PhD has been less painful on an identity/self-discovery level then a lot of posts I see here. Maybe feeling stupid as a teenager prepared me for this!",
                  "author": "IRetainKarma",
                  "created": 1590157377,
                  "upvotes": 4,
                  "replies": {
                    "frgsffp": {
                      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frgsffp/",
                      "text": "Could be! There's work in psych on how people are more resilient to failures if their identity is not wrapped up in them (e.g., \"that test was really hard,\" instead of \"I failed on that test\").",
                      "author": "smbtuckma",
                      "created": 1590167461,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "frfrurg": {
              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfrurg/",
              "text": "Hate to be brutal OP, but allow me to real-world you for a second.  You aren't special.  No one cares that you think you're high-achieving.  If you want to do a PhD because you like the material and want to better yourself, go for it, in fact I'm considering the same myself.   You will not be the most intelligent person in the room anymore, but that shouldn't matter, because you're doing it for yourself, not to impress anyone else.  However, if feeling special is that important to you, then don't do it.",
              "author": "smmstv",
              "created": 1590145799,
              "upvotes": 9,
              "replies": {
                "frho6sm": {
                  "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frho6sm/",
                  "text": "I’ve fallen victim to that damn gifted-kid curse. Once a week in elementary school, me and a small group would go to a different class for the whole day to do meaningless enrichment exercises. It gave us this false sense of superiority and security. After elementary I took the most advanced classes and centered my identity around the classroom setting and the external validation from others. \n\nBut as I’ve gone through life and in college especially, I’ve realized that intelligence only gets you so far in life, both professionally and socially. It doesn’t always translate into marketable skills, and I definitely think it’s impeded my ability to make friends (because I was admittedly cocky). \n\nToo much of my self-worth has been wrapped up in adults making me feel like I have something extraordinary to offer with my intelligence. Whether or not that’s true, I shouldn’t base my confidence (or career) around something so relative. \n\nLike I’ve said, I *love* sociology and doing research. I’m proud of the research questions I’ve come up with, the way I process information to create knowledge, etc. It’s a very beautiful and satisfying thing, as anyone on this sub (who does research) can attest to. But I think at this point in time, I can’t separate my pure love of research from feeling like a PhD is something that “smart people” do.",
                  "author": "complihated",
                  "created": 1590183451,
                  "upvotes": 1,
                  "replies": {
                    "frjm9pb": {
                      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frjm9pb/",
                      "text": "Well id recommend a gap year and see how you like being outside of the classroom.  You might find you love it, or you might find yourself yearning to go back.  Either way, it's clear to me have a lot of self awareness and a good head on your shoulders so I think by virtue of that you'll go far whatever path you take.",
                      "author": "smmstv",
                      "created": 1590237287,
                      "upvotes": 1,
                      "replies": {
                        "frl54eb": {
                          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frl54eb/",
                          "text": "Thank you!! That's very kind :,)",
                          "author": "complihated",
                          "created": 1590269760,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "frgcqjt": {
              "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frgcqjt/",
              "text": "The only real one to focus on there is number 1, do it for your self. This isn't some pissing contest about how smart you have to be to make it in grad school. Just like in undergrad, there are a number of complete idiots in pHd programs, and in post docs too. You should take a gap year, most people should and for exactly the reasons that you're laying out here. I took a gap before returning to grad school and I picked up very useful skills in programming, and a knowledge of what I could do with the degree that I had. After a few years away from the field though, I knew that I wanted to return and find a career doing something more advanced, which is why I returned. I've found that a lot of pHd's lack that clarity of direction, and are only doing it because they thought they had to and they end up miserable because of it. One last thing, people will tell you that you have to be young to make it in academia or some other type of bullshit, it's not true. It never has been. You will find people in grad school who entered at 30, or 35, and they have great skills, they've built up confidence in themselves, and they're very insightful. It can be a godsend to take a step back for a bit. Hope this helps, you got it dude!",
              "author": "B_zark",
              "created": 1590159691,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "frf0u8o": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf0u8o/",
          "text": "Damn this is dark.. but also, you just described me and so many of my colleagues.. all of these things are unfortunately true. Thank you for describing it so eloquently. My version would have had a lot more curse words.",
          "author": "DrDendrite747",
          "created": 1590121219,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "freh83p": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freh83p/",
      "text": "There's absolutely nothing wrong with taking some time off to do other things like Americorps, work, or travel, and doing these things will allow you to get to know yourself and give you perspective on how you feel about academia. Expanding your horizons is not only a good way of better understanding yourself and what you want, but also teaches you a vast array of new skills that you would probably miss out on if you go straight through from undergrad to grad school.\n\nAnd I'm not just saying this to say it. I took nine years off between high school and going to college. I traveled abroad, waited tables, read a lot, tried my hand at being a freelance musician, and eventually felt ready to go back to school. By then, I knew exactly what I wanted and how to get it. Because of that I have been able to enjoy my education and accomplish so much, with both enthusiasm and confidence. I cannot overstate how much the skillset gained by being an independent adult living in and moving through the world helped me in undergrad and now in graduate school (anthropology).\n\nSo, I guess this is all to say that if you are feeling unsure about your original goal of going for that PhD then take time off and explore some different options that intrigue you- you might be surprised at what you find. Best of luck to you!",
      "author": "_melonball_",
      "created": 1590108977,
      "upvotes": 8,
      "replies": {}
    },
    "freftvg": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/freftvg/",
      "text": "Gap years are hard because your not currently working toward the academic goal but this time is essential to grow as a person. Do not enter grad school with academics as you sole defining identity or you will have lots of stress and depression.",
      "author": "mad_neuroscientist",
      "created": 1590108157,
      "upvotes": 51,
      "replies": {
        "frfm56b": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frfm56b/",
          "text": "This is so so true. I started a PhD in particle theory straight from my masters, and being an academic in that particular field had been such a defining part of my self identity since the end of high school. I was burned out and hated the course so I dropped out fairly quickly because I didnt want to waste everyone's time. It was a really tough decision, but I knew it was the right one.\n\nI'm taking a few years out to get some experience, save some money for the future, and just refresh my passion. Working OUTSIDE of academia has actually made me realise how much I do still want to go back and do a PhD and work in research, but it has also forced me to consider other fields, and that has made me realise that theres so many more fields I'm interested in than just particle physics. Quite liberating really!",
          "author": "Ash4d",
          "created": 1590140090,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "frefkmg": {
      "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frefkmg/",
      "text": "It sounds like you're the perfect candidate for taking a gap year or two to take time off from academia. Honestly, you might just be burned out from school, which is pretty normal for people. Taking a step back and following one of your other interests sounds like it would be rewarding for you for many reasons!",
      "author": "_lets_get_this_bread",
      "created": 1590108006,
      "upvotes": 200,
      "replies": {
        "frf04mx": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frf04mx/",
          "text": "I took a gap year (2 years, actually) after my 3rd year, because I really didn't care about the PhD or academia. I ended up going back after 2 years, because I realized my job prospects were even worse than being a grad student. I'm really happy for having taken those 2 years off, and it made me appreciate the flexibility of academic work. It was nice not to have an evil petty supervisor when I was working on my dissertation.\n\nProbably won't end up having a career in academia, but being a grad student had some great moments. And it's nice to have my airplane tickets say \"Dr.\"  , although I suppose you don't actually need a diploma to set an honorific when buying your flight.",
          "author": "misanthpope",
          "created": 1590120727,
          "upvotes": 34,
          "replies": {}
        },
        "frg5ae6": {
          "link": "/r/GradSchool/comments/go7jak/do_i_actually_want_a_phd_or_is_being_in_academia/frg5ae6/",
          "text": "Also if there was any year to take a gap year, it’s this one.",
          "author": null,
          "created": 1590155600,
          "upvotes": 9,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064552
}