{
  "sid": "q3ztj2",
  "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/",
  "title:": "I feel trapped",
  "text": "So last year I applied to be enrolled in an Accelerated Masters Degree (meaning that I start my Masters in my 4th year of undergrad).\n\nI'm in my 4th year now. Here's a bit of background on what I've done up until this point. \n\n-In the summer before my 4th year, I took a graduate course. I wasn't able to finish my paper on time so they gave me until the end of this semester without any penalties. \n-This semester, I'm supposed to finish my graduate paper while also doing all my 4th year courses and working in the lab 10 hours a week. I haven't really had a chance to work on the paper whatsoever and I have little to no free time.\n\nAnd that's where I am right now. Only recently I started to realize that I'm not super passionate about the topic of my Masters (it's still within my undergraduate field but slightly different from my specialization). Furthermore I don't think in-lab work is what I want to be doing (I was excited to try it since I missed out on in-person labs due to COVID-19).\n\nHowever every once in a while I hear something that makes it hard for me to talk to anyone I know about switching out of the program. For example:\n-I heard that every Accelerated Masters student has successfully completed their program at my school. Being the first \"failure\" really doesn't sound appealing.\n-They already said that my entire degree is fully funded (which I'm grateful for, don't get me wrong), but switching out at this point probably wouldn't look good.\n\nI have no idea what I should do at this point. I'm sick of waking up every day and dreading what I have to do. I want to be able to enjoy my graduate studies experience. \n\nI'm still interested in pursuing a Masters degree (I think) but not in this particular topic. I want to go back to my actual specialization, but I'm not sure if I'm suited for grad school or not. \n\nSorry for such a long post. I just had my first mental breakdown in the lab today so I figured it was time to reach out for help. If anyone has any advice, I'd greatly appreciate it. Thanks.",
  "author": "waifu_is_my_laifu",
  "created": 1633706150,
  "updated": 1634099823,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hfv3q3x": {
      "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfv3q3x/",
      "text": "I can relate. I constantly wonder how and why the fuck I’m in grad school for mathematical statistics or have a bachelors in math… I just kept going without thinking and now I’m here. I think I’m going to leave with a masters instead of continuing onto a PhD and take time to reflect on what I like.",
      "author": "blossomsofblood",
      "created": 1633706604,
      "upvotes": 6,
      "replies": {
        "hfv44fe": {
          "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfv44fe/",
          "text": "Thanks for the reply. Is it really worth pushing forward? My undergrad is in civil engineering but I'm doing a masters in civil engineering materials. If I end up joining the workforce, I'm definitely gonna be applying for positions not related to the materials side of things. It feels like it's just a waste to continue on",
          "author": "waifu_is_my_laifu",
          "created": 1633706770,
          "upvotes": 2,
          "replies": {
            "hfv5vet": {
              "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfv5vet/",
              "text": "I really don’t know but I’m 3 classes away that I’m currently taking from my masters degree.",
              "author": "blossomsofblood",
              "created": 1633707505,
              "upvotes": 5,
              "replies": {}
            },
            "hfv5ytn": {
              "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfv5ytn/",
              "text": "Oh but you can totally work in “unrelated” fields. I liked finance for while and they liked math people",
              "author": "blossomsofblood",
              "created": 1633707544,
              "upvotes": 3,
              "replies": {
                "hfvboio": {
                  "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfvboio/",
                  "text": "That's definitely true",
                  "author": "waifu_is_my_laifu",
                  "created": 1633709934,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfvaioz": {
      "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfvaioz/",
      "text": "I'd just quit. If it's causing so much stress for you and you don't find it even slightly interesting, what's the point. You didn't even invest that much into it - you just took one course and did some lab work so far, you didn't pay anything... Dont think oh I will be the first failure etc, that's their problem (or I'd even say not a problem at all). Think what's the best for you.",
      "author": "blueflovver",
      "created": 1633709447,
      "upvotes": 5,
      "replies": {
        "hfvc164": {
          "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfvc164/",
          "text": "You're right. Mental health is much more important than keeping my school's reputation high. I wouldn't say I'm uninterested (the topic is certainly fascinating) but it's not my preferred field. I couldn't see myself making a living of it, so quitting is probably the right call. Thank you.",
          "author": "waifu_is_my_laifu",
          "created": 1633710079,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfvpswd": {
      "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfvpswd/",
      "text": "I dropped my coterminal program and never looked back. I was doing a biomedical engineering bachelor’s with master’s in chemical engineering. I hated it. Instead, I dropped the master’s and added a minor I actually enjoyed. \n\nI don’t think it shows on my transcript that I was ever a part of the coterminal program. It just shows that I took some grad classes. What’s the worst that could happen if you drop it?",
      "author": "passerem",
      "created": 1633715777,
      "upvotes": 2,
      "replies": {
        "hfvvkpx": {
          "link": "/r/GradSchool/comments/q3ztj2/i_feel_trapped/hfvvkpx/",
          "text": "That's pretty reassuring (not your situation, but the fact that you were able to do so with no repurcussions). As much as my mind wants to be pessimistic and assume the worst, I think you're right that nothing bad can come of it. Thank you.",
          "author": "waifu_is_my_laifu",
          "created": 1633718254,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}