{
  "sid": "qmk58z",
  "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/",
  "title:": "Grad school with no research experience",
  "text": "I'm interested in a M.Sc. in ecology but every ecology department website I visit mentions the need to contact a professor to work with before applying. When I go to that professor's website, most of them mention that I need to include my research experience and/or an example question that would fit with their lab.\n\nMy problem is that my B.Sc. is in biology but my plan was teaching so I did no research in undergrad, and my Master's is in Teaching Biology. \n\nI've emailed a couple professors and haven't heard back. My GPA is high for both degrees, bit I know research experience is heavily weighted since that's what I'll need to do. \n\nDo I even have a chance at grad school with no research experience?",
  "author": "vvhynaut",
  "created": 1636031192,
  "updated": 1636138122,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hja8888": {
      "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/hja8888/",
      "text": "For research degrees, it is really helpful to have demonstrated success and satisfaction doing research. Most people find out that it is a lot more frustrating than they thought, and coursework is a weak predictor of that.\n\nThere is usually a lot more latitude for MS than PhD, but you still need some indicators of potential success. Be specific about why an MS is essential for your career plans when you are already fully qualified to teach biology. \n\nThe most research-oriented ecology programs may not offer the MS at all, and put all their energy into doctoral researchers. Keep an eye out for that.",
      "author": "IkeRoberts",
      "created": 1636035130,
      "upvotes": 3,
      "replies": {
        "hjawekd": {
          "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/hjawekd/",
          "text": "Thanks for this. I'll edit my post but my intention is to leave teaching and work for a government organization such as USFWS, USFS, state forestry dept., etc.\n\nI have noticed that on the website for the school, it lists MS degrees and how to apply, but when I visit the websites for the faculty labs, they only mention spots for undergraduates or PhDs. Does this mean I shouldn't bother contacting them?",
          "author": "vvhynaut",
          "created": 1636044633,
          "upvotes": 1,
          "replies": {
            "hjbix42": {
              "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/hjbix42/",
              "text": "Contact the director of graduate studies for the program to learn the role the MS plays in their grad program. There will probably be a clear explanation that is subtler than they put on the website.",
              "author": "IkeRoberts",
              "created": 1636053438,
              "upvotes": 1,
              "replies": {}
            },
            "hjblx8g": {
              "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/hjblx8g/",
              "text": "Maybe try to work as a research assistant or field assistant (as another commenter said) to get some experience under your belt. From personal experience having a high GPA but no experience makes it much harder for professors to take an interest in. \n\nYou can always contact them and ask if they have spots for MS students, sometimes professors forget to update their website. But, if their lab website says they only have spots for undergrad or PhD students don't be surprised if the answer is no.",
              "author": "Perses_Garden",
              "created": 1636054623,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjaj360": {
      "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/hjaj360/",
      "text": "If you’re lacking in research/lab experience and you know that’s the path you want to take, try applying for research assistant positions to get experience for a year or two. The pay won’t be great, but it’s the best way to fill that gap. \n\nYou’ll get experience and you’ll have a professor that’s able to write a rec letter about your experience. \n\nI did research all through undergrad but still worked as an RA for a year after undergrad and before grad school. All of my rec letters came from that job (my boss and other PIs we worked with) and that year got me into better programs than I would have otherwise.",
      "author": "ImJustAverage",
      "created": 1636039514,
      "upvotes": 1,
      "replies": {
        "hjeyl8y": {
          "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/hjeyl8y/",
          "text": "How did you get that RA position? The ones listed at my local universities state they are open to students only. Was it because they already knew you?",
          "author": "vvhynaut",
          "created": 1636120598,
          "upvotes": 1,
          "replies": {
            "hjfci6k": {
              "link": "/r/GradSchool/comments/qmk58z/grad_school_with_no_research_experience/hjfci6k/",
              "text": "It was at a medical center affiliated with a university but separate campus in another city. You can also look for technician jobs in labs, those will be open to people other than students",
              "author": "ImJustAverage",
              "created": 1636126243,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}