{
  "sid": "q60236",
  "link": "/r/GradSchool/comments/q60236/grad_school_not_offering_ta_positions_normal/",
  "title:": "Grad school not offering TA positions normal?",
  "text": "Wanted to know how you guys feel about an engineering department not offering any TA positions to any of their grad students (Masters or PhD students, but PhDs are usually fully funded by faculty), but offering only an hourly wage instead. This is in the US and I wanted to know if this is considered an anomaly or if it's a common practice. I always thought that I could save on some tuition by being a TA, but apparently, that's not the case in my department.\n\nPS: Other engineering departments provide TA and RA positions, turns out it's only my department that does not do so.",
  "author": "enigma142",
  "created": 1633970770,
  "updated": 1634099741,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hg8yf2z": {
      "link": "/r/GradSchool/comments/q60236/grad_school_not_offering_ta_positions_normal/hg8yf2z/",
      "text": "Why bother? Unless they pay 35+/hr you're wasting your time.",
      "author": "Glarkin42",
      "created": 1633971600,
      "upvotes": 2,
      "replies": {
        "hg8zeif": {
          "link": "/r/GradSchool/comments/q60236/grad_school_not_offering_ta_positions_normal/hg8zeif/",
          "text": "Forgot to mention that I'm an international student. As international students, you can't work off campus (Unless you wanna run your CPT/OPT hours down) or work more than 20 hours a week. Not they don't pay $30+/hr, but its still the best source of income when you can't work off-campus.",
          "author": "enigma142",
          "created": 1633972007,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hgbt9xq": {
      "link": "/r/GradSchool/comments/q60236/grad_school_not_offering_ta_positions_normal/hgbt9xq/",
      "text": "Never heard of such a thing. Red flag?",
      "author": "fwafwa",
      "created": 1634022073,
      "upvotes": 2,
      "replies": {}
    },
    "hg9byh6": {
      "link": "/r/GradSchool/comments/q60236/grad_school_not_offering_ta_positions_normal/hg9byh6/",
      "text": "PhD programs should offer tuition and fee waivers, health insurance, and some form of compensation (RA, TA, or a combo). If the program you reference is offering a full RA position (meaning no TA responsibilities), then that might be great news. I like teaching...but TAing does slow down research given the time commitment. But in this situation you would still get tuition/fee waivers and health insurance.\n\nAre you saying that the only form of support offered are hourly wages, and no tuition/fee waivers or health insurance? That IS unusual, and likely problematic (unless those wages are insanely high).",
      "author": "rox_et_al",
      "created": 1633977189,
      "upvotes": 1,
      "replies": {
        "hgaogyy": {
          "link": "/r/GradSchool/comments/q60236/grad_school_not_offering_ta_positions_normal/hgaogyy/",
          "text": "For PhD students, their advisors provide funding for RA positions (They do some teaching but not as much as a TA would), so PhDs are fully funded. Masters on the other hand can only get hourly wages, no insurance, no tuition waivers.",
          "author": "enigma142",
          "created": 1633999623,
          "upvotes": 1,
          "replies": {
            "hgd33td": {
              "link": "/r/GradSchool/comments/q60236/grad_school_not_offering_ta_positions_normal/hgd33td/",
              "text": "Ok, major funding differences between PhDs and Masters is definitely a lot more common...not ideal, but common. I can't really comment on how common the specifics are (e.g. not allowing masters to TA and hourly wages). However, it's common for masters students in STEM to receive a fraction or none of the financial support afforded to PhDs. \n\nI got a masters before pursuing a PhD. I wish advisors would have pushed me to just pursue the PhD to begin with. Why spend 3 years getting a masters, and then 5 more for the PhD when you can just do the 5 year PhD from the start (with PhD funding)? Not to mention the little talked about option of \"mastering out\" of a PhD....",
              "author": "rox_et_al",
              "created": 1634051915,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}