{
  "sid": "rahlys",
  "link": "/r/GradSchool/comments/rahlys/before_grad_school_would_it_be_better_to_gain/",
  "title:": "Before grad school, would it be better to gain research experience in a variety of subfields in my field, or the subfield I'm most interested in?",
  "text": "I am in STEM, neuroscience to be more specific, if that makes a difference.",
  "author": "bioluminescent-bean",
  "created": 1638824440,
  "updated": 1639518937,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hnjibhp": {
      "link": "/r/GradSchool/comments/rahlys/before_grad_school_would_it_be_better_to_gain/hnjibhp/",
      "text": "I started off getting research experience in sub-fields of neuropsychology, neurobiology, and computational neuroscience and ended up in climate science for my PhD, so in addition to sub-fields, I got research experience in different broad fields. The answer to your question depends on your priorities IMO. \n\nI think broad research experience is great for intellectual and personal development. I was able to get a sense of what I perceived to be \"good science\" or bad/dishonest/ill-premised research across different areas, and that's helped me better detect BS at a general level and also think on commonalities of good, honest research across all areas. The line between broad and unfocused experience and perception thereof is blurry though, and there's a point where you're not spending enough time on the process of dogged pursuit of a project to learn enough about any field or the scientific process write large. Unless carefully framed in a certain way, there's definitely a big risk of broad experience hurting your graduate school applications, where admissions committees and PIs may perceive you as someone who won't be able to stick with a thesis through the grind and gruel of a PhD. I definitely erred on the side of superficially flitting from one research experience to another, and it definitely hindered me during the applications cycle.",
      "author": "hesperoyucca",
      "created": 1638843418,
      "upvotes": 2,
      "replies": {
        "hnjxl44": {
          "link": "/r/GradSchool/comments/rahlys/before_grad_school_would_it_be_better_to_gain/hnjxl44/",
          "text": "Thank you so much for sharing! I'm always learning new things I should pay attention to in a lab, and you've taught me to think about another thing. I think it's great that your experiences helped you figure out what good science is, and I bet it certainly makes you a better researcher.",
          "author": "bioluminescent-bean",
          "created": 1638850146,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnjprrf": {
      "link": "/r/GradSchool/comments/rahlys/before_grad_school_would_it_be_better_to_gain/hnjprrf/",
      "text": "I got experience by training molecular bio techniques in the industry, a short 2 month intern in a prestigious summer fellowship neuro lab, and also did a 6 month mini project in my own uni on macroalgae biosorption.\n\n&#x200B;\n\nCo-Wrote 4 (minor) publications during pandemic, none of them in neuro (immuno/plant bio, food tech, diabetic retinopathy, and that macroalgae project thing as a paper)....\n\n&#x200B;\n\nDid a project on microcephaly related proteins (it was mol bio heavy)\n\nSo not all neuro.\n\n&#x200B;\n\nJust took any and all opportunities that came my way and put my all into them.",
      "author": "bookbutterfly1999",
      "created": 1638846645,
      "upvotes": 2,
      "replies": {
        "hnjy420": {
          "link": "/r/GradSchool/comments/rahlys/before_grad_school_would_it_be_better_to_gain/hnjy420/",
          "text": "The fact that you were able to co-write so many publications recently is awesome!! All the fields you've worked in sounds really interesting. I'm totally on board with making the most of the opportunities that come your way. I hope I make the most of mine as you have with yours!",
          "author": "bioluminescent-bean",
          "created": 1638850392,
          "upvotes": 3,
          "replies": {
            "hnl1n6l": {
              "link": "/r/GradSchool/comments/rahlys/before_grad_school_would_it_be_better_to_gain/hnl1n6l/",
              "text": "Thank you! I hope you do too!",
              "author": "bookbutterfly1999",
              "created": 1638878776,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}