{
  "sid": "qnb8vb",
  "link": "/r/GradSchool/comments/qnb8vb/1_year_masters_programs_10k_or_less/",
  "title:": "1 Year Master's Programs $10K or less?",
  "text": "Hi guys, I'm an American guy who's been looking into doing a master's degree for awhile now to continue teaching at the university level abroad and have been gathering up a bunch of info on potential programs that I might apply to. I would like to know if you guys know of any 1 year master degree programs for around $10k total or less ?\n\nAlso, I just need to get a master's degree in any subject, but was wondering what subject would you guys recommend to study?\n\nI've been thinking MBA in digital marketing or M.Ed. I was thinking about MBA digital marketing since I have 2 years of experience in digital marketing and would like to also be able to teach this subject or business/marketing courses in addition to English. Also, I thought it would be good to have this instead of a M.Ed since working in digital marketing would be my plan B if for some reason I don't teach in the future. However, I got my BA in English and haven't taken business courses at a university before, so I'm not sure how difficult it is going to be.\n\nSo far, I've found these programs, which I'm really considering and would like to share with anyone in case you guys happen to be looking for potential programs as well:\n\n\\-Framingham State University > M.Ed in International Teaching $6500 total for 2 years\n\n\\-Fort Hays State University > Online MBA Digital Marketing $11,500 for 33 credits 1-1.5 years\n\nLet me know if you guys know of any possible programs or have any advice, thank you so much for your time, I appreciate it!",
  "author": "TheManWhoLovesCulo",
  "created": 1636119232,
  "updated": 1636138102,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjexiwr": {
      "link": "/r/GradSchool/comments/qnb8vb/1_year_masters_programs_10k_or_less/hjexiwr/",
      "text": "Studying in Europe is quite cheap and takes only a year as well",
      "author": "callandquestion",
      "created": 1636120121,
      "upvotes": 1,
      "replies": {
        "hjf08ya": {
          "link": "/r/GradSchool/comments/qnb8vb/1_year_masters_programs_10k_or_less/hjf08ya/",
          "text": "Which master's only takes a year? All programs I know are 1,5-2 years",
          "author": "Single_Blueberry",
          "created": 1636121319,
          "upvotes": 2,
          "replies": {
            "hjfllay": {
              "link": "/r/GradSchool/comments/qnb8vb/1_year_masters_programs_10k_or_less/hjfllay/",
              "text": "UK masters are usually a one years program",
              "author": "littolady",
              "created": 1636129758,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}