{
  "sid": "pi16js",
  "link": "/r/GradSchool/comments/pi16js/anyone_get_impostor_syndrome_after_finishing_grad/",
  "title:": "Anyone get impostor syndrome after finishing grad school?",
  "text": "All throughout college I really struggled to relate to many other students feeling impostor syndrome. I felt like I should be at college and excelled in every aspect. Graduated top of my class in both UG and Grad Program. Published Research at Vanderbilt. SGA President at one school, VP at another. \n\nHowever, while I was a top notch student, I never really bonded to a subject. I ended up picking my subject based on what I thought could get me a job. \n\nNow that I am finished up I have no desire to work in the field I graduated in and kinda just feel like taking any job and just kinda being the run of the mill person. \n\nLike I don’t want the responsibility of my degree or that I came from a bad upbringing and was only successful cause I saw it as a means out. But because of that I was just running away and not really exploring my interests? \n\nGuess it’s kind of a quarter life crisis. But I really just want to explore myself now (which Ik I should have done in college).\n\nAnyone relate?",
  "author": "zaqhhh",
  "created": 1630794892,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hbn166p": {
      "link": "/r/GradSchool/comments/pi16js/anyone_get_impostor_syndrome_after_finishing_grad/hbn166p/",
      "text": "Not finished with grad school, but interestingly I often feel similar but for kind of opposite reasons.\n\nI get worried that I’ll never find work that pays well enough to justify the cost of grad school, and that I should have gone to law school or business school. I worry that because I have had a pretty easy life generally speaking, I didn’t worry myself enough with the practicality of my studies and just focused on what I love.\n\nI don’t know the answer for myself, let alone for you, but I think we’ll figure out what we need to do as we go along.",
      "author": "ThrowawayHistory20",
      "created": 1630806889,
      "upvotes": 1,
      "replies": {
        "hbp0che": {
          "link": "/r/GradSchool/comments/pi16js/anyone_get_impostor_syndrome_after_finishing_grad/hbp0che/",
          "text": "Yeah I get that, I do really well at the finance part of grad school. Like I have no debt. \n\nBut also no drive to do what I studied.",
          "author": "zaqhhh",
          "created": 1630854612,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbmo2nz": {
      "link": "/r/GradSchool/comments/pi16js/anyone_get_impostor_syndrome_after_finishing_grad/hbmo2nz/",
      "text": "I finish my PhD in the last few months. In short, I do feel like I need to explore myself, but I also know that I'm good at (at least better than anything else I could be paid for) what I did for my PhD.  I loved the topic when I started and now somedays I don't want to be in the field and often feel like I am not good at it. Now that I am at a new and better university as a postdoc and I definitely worry if I can measure up or if I should have taken a different job. For me, I just know that I have to keep going because when someone pays me money I want to give them their money's worth. I would suggest you look into jobs that both use and don't use your degree. Academy and industry/normal jobs can be very different so you might have different and better experiences in the real world vs what you had for your degree. Good luck. I probably wasn't much help, but you are not alone.",
      "author": "Ru-tris-bpy",
      "created": 1630800120,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634065006
}