{
  "sid": "pw4rl6",
  "link": "/r/GradSchool/comments/pw4rl6/applying_to_physics_grad_school_with_an_applied/",
  "title:": "Applying to Physics Grad School with an Applied Math BS",
  "text": "I am an Applied Math Major at a very good state school for physics. \n\nI am an Applied Math Major rather than a physics major because, at my school, physics majors are required to take about 45 hours of general education classes, and I just wasn't really interested in doing that. So instead, I majored in applied math so I could replaced those courses with a few extra math courses that I was more interested in. \n\nBy the time I finish my undergrad, I'll have taken all the classic physics courses, Classical Mechanics 1&2, E&M 1&2, Quantum 1&2, Thermodynamics. \n\nI actually kinda think of myself as a physics major because I usually end up taking a few physics related classes and just one math class a semester, but at the end of the day, when I graduate, I will have a BS in applied math, not physics. \n\nDo you think this will hurt my chances of being admitted to top schools for physics grad school.",
  "author": "function_of_time",
  "created": 1632698499,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "heii8sv": {
      "link": "/r/GradSchool/comments/pw4rl6/applying_to_physics_grad_school_with_an_applied/heii8sv/",
      "text": "You can definitely get in. Do you want to do theory or experiment? Doing undergrad research with someone in the physics faculty will help a lot too",
      "author": "MiggsBoson",
      "created": 1632775257,
      "upvotes": 1,
      "replies": {
        "hek2io5": {
          "link": "/r/GradSchool/comments/pw4rl6/applying_to_physics_grad_school_with_an_applied/hek2io5/",
          "text": "I'm not exactly sure whether I am more interested in experiment or theory. I have heard before that experiment is easier to get into, so I spent all last summer emailing experimental profs about working in their lab, and this semester I am doing a sort of proto-research experience in experimental AMO physics with a professor. If I get the chance, I would like to try working in theory though. \n\nOne thing that concerns me a little about my curriculum is that I missed out on some lab classes that physics majors take. In applied Math, I only had to take one intro physics lab and one intro chemistry lab. Physics majors end up take 3 physics labs and 2 chemistry labs. Do you a lack of lab courses would be noticed if I applied to be an experimentalist in grad school?",
          "author": "function_of_time",
          "created": 1632802309,
          "upvotes": 1,
          "replies": {
            "helrac1": {
              "link": "/r/GradSchool/comments/pw4rl6/applying_to_physics_grad_school_with_an_applied/helrac1/",
              "text": "It could, but again working with a professor would help especially if they can vouch for your skills. If you want to do theory, I don’t think you should worry about which is harder to get into. In that case try working with a theorist and see if they can give you a project to work on. In that case the math major and lack of lab classes might matter less",
              "author": "MiggsBoson",
              "created": 1632842118,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "heihcqb": {
      "link": "/r/GradSchool/comments/pw4rl6/applying_to_physics_grad_school_with_an_applied/heihcqb/",
      "text": "I'm in a biomedical sciences PhD program as someone with a BS in math (minors in bio and chem, all research in bio and mathematical modeling). Totally possible to get into a school with a different undergrad degree, especially since you already have all of the prerequisites. Your interviewers may ask you about your switch from math to physics, although maybe not. I did get asked, \"why biomedical sciences?\" during my interview, but again, I come from math so it's not the field change people would expect. I feel like a switch from applied math to physics is definitely more self-explanatory. Good luck!",
      "author": "badatpizza",
      "created": 1632774857,
      "upvotes": 1,
      "replies": {}
    },
    "hef7zfn": {
      "link": "/r/GradSchool/comments/pw4rl6/applying_to_physics_grad_school_with_an_applied/hef7zfn/",
      "text": "You'll be fine. Getting into \"top schools\" is really hard, of course, but the fact that your degree says \"math\" and not \"physics\" won't be the reason for that.",
      "author": "InfanticideAquifer",
      "created": 1632707179,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634064556
}