{
  "sid": "qab9ra",
  "link": "/r/GradSchool/comments/qab9ra/lab_experience_covid_applying_this_cycle/",
  "title:": "Lab experience, Covid, & applying this cycle",
  "text": "I’m wondering if anyone’s in a similar boat as me. I’m applying to grad psychology programs, which emphasize research experience beforehand. I do have some, however, I had planned to volunteer in a lab & Covid happened.\n\nI’m not sure whether to address this in my statement as I’m concerned it might just look like an excuse.\n\nJust wondering what anyone else in a similar situation may be saying, if anything.",
  "author": "Nothingknew666",
  "created": 1634516530,
  "updated": 1634655432,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hh1v7e5": {
      "link": "/r/GradSchool/comments/qab9ra/lab_experience_covid_applying_this_cycle/hh1v7e5/",
      "text": "Not in similar situation, but grad student that had multiple conversations with people on admission committee in my department and they all acknowledge how much covid impacted basically everything for incoming students. Mentioning you wanted to do more research but covid made it impossible will definitely not look like an excuse.",
      "author": "blueflovver",
      "created": 1634517017,
      "upvotes": 6,
      "replies": {
        "hh1vrwb": {
          "link": "/r/GradSchool/comments/qab9ra/lab_experience_covid_applying_this_cycle/hh1vrwb/",
          "text": "Thank you that’s very encouraging!",
          "author": "Nothingknew666",
          "created": 1634517303,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hh1ygn7": {
      "link": "/r/GradSchool/comments/qab9ra/lab_experience_covid_applying_this_cycle/hh1ygn7/",
      "text": "I don't think mentioning how COVID derailed your plans is an excuse. EVERYBODY'S plans went out the window because of it. I used to work at a tailor shop last year, and the number of cancellations made a lot of wedding businesses go under.\n\nThe reason my wife and I moved to Raleigh was to have more opportunities for me to get into research. I didn't even realize I could volunteer at labs to get more experience! Of course COVID would have made it difficult last year.\n\nGood luck!",
      "author": "JonDCafLikeTheDrink",
      "created": 1634518638,
      "upvotes": 3,
      "replies": {}
    }
  }
}