{
  "sid": "q70lnj",
  "link": "/r/GradSchool/comments/q70lnj/should_i_submit_my_gre_score_to_programs_where_it/",
  "title:": "Should I submit my GRE score to programs where it is optional?",
  "text": "I’m applying to masters of science in epidemiology programs. I have a ~3.7 undergrad and post-bacc gpa (strong upward trend), great letter of recs, public health work and volunteer experience. \n\nI took the GRE with minimal preparation and got a score of V166, Q155.\n\nI’m not inclined to study for it and take it again. However, is it a good score for epi programs? Would it hurt my application if I submitted it for programs where it is optional? Or is it low and I should not submit since it’s not adding value to my app?\n\nI know epi is a quantitative field and my quant score is low. Any advice would be appreciated! \n\nTIA",
  "author": "ThrowRAcreamsicle",
  "created": 1634088800,
  "updated": 1634602184,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hgfr446": {
      "link": "/r/GradSchool/comments/q70lnj/should_i_submit_my_gre_score_to_programs_where_it/hgfr446/",
      "text": "It probably wouldn’t hurt to submit it. I’m not in epi but a 321 is a damn good score for most programs. The max gre score is a 340. Most programs that I applied for had a recommend minimum score of 300. 155 quant 145 verbal.\n\nEdit: I’m in civil engineering btw",
      "author": "pimpdaddyslayer",
      "created": 1634093139,
      "upvotes": 1,
      "replies": {}
    },
    "hgh7mht": {
      "link": "/r/GradSchool/comments/q70lnj/should_i_submit_my_gre_score_to_programs_where_it/hgh7mht/",
      "text": "Email the program and ask!\n\nI know at my university, the department no longer considers them for admission, but the university does use them to decide who gets first year fellowships. So it might be worth it to send them in!",
      "author": "Umbramy",
      "created": 1634129925,
      "upvotes": 1,
      "replies": {}
    },
    "hghklo1": {
      "link": "/r/GradSchool/comments/q70lnj/should_i_submit_my_gre_score_to_programs_where_it/hghklo1/",
      "text": "Not my field, but since epi is pretty quant heavy I would not submit them as your quant score is a little low.",
      "author": "ThrowawayHistory20",
      "created": 1634135913,
      "upvotes": 1,
      "replies": {}
    },
    "hgiz0wg": {
      "link": "/r/GradSchool/comments/q70lnj/should_i_submit_my_gre_score_to_programs_where_it/hgiz0wg/",
      "text": "Judging based on percentiles is usually more informative than just the GRE scoresin isolation.\n\nThe [reported percentile scores (assuming you took the test Jul 2020 - Jun 2021)](https://www.ets.org/s/gre/pdf/gre_guide_table1a.pdf) would be 97th for Verbal and 54th for Quant. [Within intended epi applicants](https://www.ets.org/s/gre/pdf/gre_table4B.pdf), the quant percentile is (surprisingly) a bit more in your favor at about 58th. Keep in mind that these numbers include people who ultimately miss the mark on grad school admissions. \n\nIf your grades in core and upper level math courses are strong, then the strong verbal score could be a boost without the quant score tanking you. If not, these scores may be more concerning than helpful.",
      "author": "aggressive-teaspoon",
      "created": 1634156191,
      "upvotes": 1,
      "replies": {}
    }
  }
}