{
  "sid": "pizlli",
  "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/",
  "title:": "I don't know what to do with my degree",
  "text": "I don't know if this post with make sense here but I really need some advice. I have just graduated from university with a degree related to Languages. I loved my degree, it was very interesting but I don't know what to do with it like what jobs to apply for. The only \"concrete\" areas I know is translation or teaching and none of those two areas are for me. I applied for a Master's degree but I don't know whether I'll get in or not since there aren't many places left. I'm just feeling extremely loss and I don't really have no one around me to ask for advice. I'm fluent with four languages: my native language (i'm from an European country), English, French and Spanish.",
  "author": "cathsxo",
  "created": 1630935546,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.66,
  "comments": {
    "hbururj": {
      "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbururj/",
      "text": "The State Department (they are accepting apps for internships right now) or interpreter. Also many bank jobs have a need for bilingual analysts . Being multi lingual will open many door even w/o a business degree. Apply for jobs even if you don’t meet all of the qualifications. Most skills you are missing can be taught, your language skills are an asset! Do a search for bilingual jobs, apply. Amazon also has jobs for bilingual candidates. Let me know and I can send you a few. Don’t be afraid to apply if you don’t have all the qualifications. Barring a say 10 year experience qualification or the like your language skills put you in a good position.",
      "author": "Expatat40something",
      "created": 1630962897,
      "upvotes": 1,
      "replies": {}
    },
    "hbtzmuf": {
      "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbtzmuf/",
      "text": "It sounds like you lack any sort of real idea of what you want to do. This is a common problem both before and after undergrad (not so much during undergrad as students tend to just enjoy the \"here and now\" and not think about the future during their undergrad studies). With that being said, unless you an essentially finish this master's degree with very little cost to yourself, I would greatly suggest to not pursue the degree unless you can picture at least 1 path to a solid career after.\n\nInstead, go and work odd jobs and internships, explore what is out there in both fields related  to and not related to your degree, and make connections with people in these industries. Talk to the other students you graduated with and see what they are doing. You're only going to know what is possible when you see the larger picture.",
      "author": "Laovvi",
      "created": 1630950394,
      "upvotes": 1,
      "replies": {}
    },
    "hbttpfh": {
      "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbttpfh/",
      "text": "Well you're in a great position to work as a translator or depending where you are, in government if you are multi-lingual in a relevant language. Honestly in some positions, your degree won't matter as much as that does.",
      "author": "ProprioCode",
      "created": 1630947841,
      "upvotes": 1,
      "replies": {
        "hbtu0vk": {
          "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbtu0vk/",
          "text": "Thank you!",
          "author": "cathsxo",
          "created": 1630947978,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbtbmop": {
      "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbtbmop/",
      "text": "You could try working at a consulting company which would let you try working on a lot of different types of projects which would let you try out a lot of different things. Somewhere like Deloitte or KPMG.",
      "author": "antihero790",
      "created": 1630939979,
      "upvotes": 1,
      "replies": {
        "hbttyvi": {
          "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbttyvi/",
          "text": "I will look into it. Thank you so much!",
          "author": "cathsxo",
          "created": 1630947952,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbtblia": {
      "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbtblia/",
      "text": "Here’s some things I’ve done with my language degree: \n\n-government work and\n-immigration law \n\nDo either of those interest you? Lots of jobs are looking for strong writers and people capable of intercultural communication, so keep that in mind and highlight those skills! I’m sure your wrote a lot to get that language degree.",
      "author": "gracias-totales",
      "created": 1630939964,
      "upvotes": 1,
      "replies": {
        "hbttvkt": {
          "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbttvkt/",
          "text": "I actually really like those areas. In fact, I thought I was going to be doing my internship at a nearby city council but for some reason, they made us do the internship at the library that belonged to the city council and it sucked because we were so limited with what we could do because of covid. Thank you so much for your comment.",
          "author": "cathsxo",
          "created": 1630947913,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbt46sd": {
      "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbt46sd/",
      "text": "Does your university have a career services type office? \n\nThey’re there to help students find careers that align with their values and desires, help identify potential careers and open positions, help get materials together, and interview prep. They are responsible for students AND recent grads. Start there. They should have career coaches specific to your major (though humanities is spread a bit thin).",
      "author": "ResponsibilityOk617",
      "created": 1630936443,
      "upvotes": 3,
      "replies": {
        "hbt4u9c": {
          "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbt4u9c/",
          "text": "We don't really have that in my country, unfortunately. But thank you for your comment!",
          "author": "cathsxo",
          "created": 1630936773,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbt354k": {
      "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbt354k/",
      "text": "What do you want to do? A degree is a ticket to a career. I would recommend looking at what you want to do as a career and getting a degree that facilitates that.",
      "author": "Waywardson74",
      "created": 1630935922,
      "upvotes": 1,
      "replies": {
        "hbt3i9a": {
          "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbt3i9a/",
          "text": "I know I want to do something related to languages but I don't know something concrete. It's a weird situation because I know better what I dislike, like translation and teaching, rather than what I like. The Master's I applied for combines languages and business which I love but I don't see how I can apply to jobs in that area without the Master's because, at the moment, I have no background in business.",
          "author": "cathsxo",
          "created": 1630936103,
          "upvotes": 2,
          "replies": {
            "hbt6p4t": {
              "link": "/r/GradSchool/comments/pizlli/i_dont_know_what_to_do_with_my_degree/hbt6p4t/",
              "text": "Maybe try out some internships to get a closer look at careers. It took me 15 years after graduating high school to find the career that I wanted and then went after the schooling. Try to find ways to get experience and exposure to more careers so you can make the decision that will put you where you want to be.",
              "author": "Waywardson74",
              "created": 1630937687,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634065065
}