{
  "sid": "rdquot",
  "link": "/r/GradSchool/comments/rdquot/grades_for_grad_school/",
  "title:": "Grades for Grad school",
  "text": "I'm currently a freshman studying computer science and am about to end my first semester with \\~3.5 GPA. This isn't terrible, but I know for top grad schools it's important to have a high GPA. Is a first semester GPA like this an issue?",
  "author": "tinytinypenguin",
  "created": 1639194622,
  "updated": 1639518514,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "ho2xavs": {
      "link": "/r/GradSchool/comments/rdquot/grades_for_grad_school/ho2xavs/",
      "text": "I don't think so. My undergrad GPA was like 3.2 or 3.1, and I still got into my top school choice and got accepted into a GA position.\n\nKeep up your good grades, but try to do some volunteer or extracurricular activities and have awesome references. I think many schools look at things like that.",
      "author": "Jaythelostboy10",
      "created": 1639196331,
      "upvotes": 3,
      "replies": {}
    },
    "ho3ceg9": {
      "link": "/r/GradSchool/comments/rdquot/grades_for_grad_school/ho3ceg9/",
      "text": "3.5 is great for a first semester. You have 11 semesters to go so as long as you stay focused, you’ll be fine. As far as getting into grad school, I got into my masters degree 1 year program with a 3.6 gpa and references. I was commuter student so I didn’t do anything besides work and go to school.\n\nIf you add extracurriculars, I believe that will allow you to stand out. When top schools see that you have a high gpa (3.5 overall or higher), great references and you participate in school, that will stick you out among the rest. Best of luck!!\n\nEdit: spelling",
      "author": "thesocialstem",
      "created": 1639204992,
      "upvotes": 2,
      "replies": {}
    },
    "ho473lw": {
      "link": "/r/GradSchool/comments/rdquot/grades_for_grad_school/ho473lw/",
      "text": "As others have said; 3.5 is not bad and you still have plenty of time to increase it. In my field at least (physics) having research experience as an undergrad helps A LOT when applying to grad programs. So sometime in your undergrad career you should do 'independent study' (or whatever the equivalent is at your university) and/or apply to summer internship programs. And cultivate relationships with your profs as recommendation letters are required for most grad programs; this can be done through your research or by just being a good student and showing interest in your field (attend office hours, attend talks by visiting profs/researchers, get your face out there so when u need a letter the prof knows who you are and knows you're committed) Those things will help you stand out from others during the grad admissions process.",
      "author": "the_physik",
      "created": 1639227652,
      "upvotes": 1,
      "replies": {}
    }
  }
}