{
  "sid": "q9x1cp",
  "link": "/r/GradSchool/comments/q9x1cp/anyone_workingworkedknow_someone_who_works_as_a/",
  "title:": "Anyone working/worked/know someone who works as a scientific editor after PhD/Postdoc? What's the experience like on the job? Is it worth pursuing?",
  "text": "After PhD and/or postdoc, one usually have three directions to go to. One leads to a tenured academic position, industry related to the field or third where one changes the field completely. However, recently, I came across other jobs that require PhDs, and specific fields but is not as a typical industrial position. \n\nScientific editor seems to be one such position. I have seen openings for this position on the Springer, Elsevier, Wiley career sites. How is it as a career path? Is it a rewarding career? By rewarding, I am referring to both intellectually and financially. \n\nPlease share your thoughts.",
  "author": "hiccupbreach",
  "created": 1634470685,
  "updated": 1634655431,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 1.0,
  "comments": {
    "hh00obq": {
      "link": "/r/GradSchool/comments/q9x1cp/anyone_workingworkedknow_someone_who_works_as_a/hh00obq/",
      "text": "Here's a blog article about a woman who made the transition out of academia and started her own scientific editing company:\n\nhttps://volcanologistsoutsideacademia.wordpress.com/2021/06/08/spotlight-sarah-henton-de-angelis/",
      "author": "mas63520",
      "created": 1634488054,
      "upvotes": 6,
      "replies": {}
    },
    "hgznx9p": {
      "link": "/r/GradSchool/comments/q9x1cp/anyone_workingworkedknow_someone_who_works_as_a/hgznx9p/",
      "text": "I've been involved a little in publishing. But not in scientific editing.\n\nAre you sure you want to work in publishing? \n\nAnd if you don't have a PhD yet, you can get involved in scientific publishing without that amount of grad school. I would guess that a master's in a scientific area, coupled with a publishing certificate program, would make you very marketable in scientific publishing.",
      "author": "raistlin65",
      "created": 1634482492,
      "upvotes": 4,
      "replies": {}
    },
    "hh1goim": {
      "link": "/r/GradSchool/comments/q9x1cp/anyone_workingworkedknow_someone_who_works_as_a/hh1goim/",
      "text": "Hi! I have my PhD in biomedical sciences and am a full time medical writer. I've also had a few years of running a decently successful freelance scientific editing gig. I'm not sure if that's what you're looking for, but I'm happy to chat if there are any questions I could answer!",
      "author": "Team_Cap",
      "created": 1634510023,
      "upvotes": 1,
      "replies": {
        "hh3jkwr": {
          "link": "/r/GradSchool/comments/q9x1cp/anyone_workingworkedknow_someone_who_works_as_a/hh3jkwr/",
          "text": "Thank you for your comment. Messaged you!",
          "author": "hiccupbreach",
          "created": 1634557917,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}