{
  "sid": "qg6tdj",
  "link": "/r/GradSchool/comments/qg6tdj/ive_decided_to_master_out_of_my_phd_program_and/",
  "title:": "I've decided to master out of my PhD program and pursue an entirely different education/career...is it even possible to ask for a LOR?",
  "text": "I took personal leave from my program and a huge cut to my workload (still doing some class/lab work) for the past year because of mental health issues and questioning if I could really finish the doctorate. \n\nWell, a year later and I don't feel much different and dread the thought of doing a dissertation, and feel less passionate and capable in my original field. I've decided that I'm going master out and pursue something different. \n\nIf I want to apply for financial aid/scholarships through the new institution I'm switching to, I need 1 to 2 letters of recommendation. Does anyone have any advice to go about this? I fear it seems insulting or strange, since the fields are extremely different from each other. \n\nThanks in advance.",
  "author": "butterfly_cooch",
  "created": 1635256155,
  "updated": 1635302954,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hi47bi8": {
      "link": "/r/GradSchool/comments/qg6tdj/ive_decided_to_master_out_of_my_phd_program_and/hi47bi8/",
      "text": "If the fields are completely different then all they can write in recommendation letter is stuff like you were hard working, always meeting deadlines, coming up with creative solutions to problems, good team player... So ask yourself if your PI (or someone from your committee?) would say that about you. If you think so, talk with them about it. Just make sure they don't write a generic LOR because you know... No one cares about those.",
      "author": "blueflovver",
      "created": 1635257609,
      "upvotes": 5,
      "replies": {
        "hi4aqyy": {
          "link": "/r/GradSchool/comments/qg6tdj/ive_decided_to_master_out_of_my_phd_program_and/hi4aqyy/",
          "text": "Thanks for your response.\n\nI have a good relationship with my PI, as well as other faculty. I've been very honest about my mental health with my PI, and she's repeatedly said things to the effect of I should do what's right for me, even if it means leaving. I'm worried that the request itself will be off-putting though, but maybe I'm overthinking it.",
          "author": "butterfly_cooch",
          "created": 1635259060,
          "upvotes": 1,
          "replies": {
            "hi4ozky": {
              "link": "/r/GradSchool/comments/qg6tdj/ive_decided_to_master_out_of_my_phd_program_and/hi4ozky/",
              "text": "The request is really normal, if you were looking for a job and not going to another school you'd probably need a LOR from PI too. And think about it this way - even if it is off-putting, why should you care? Do what's best for you.",
              "author": "blueflovver",
              "created": 1635264831,
              "upvotes": 2,
              "replies": {
                "hi4wgt9": {
                  "link": "/r/GradSchool/comments/qg6tdj/ive_decided_to_master_out_of_my_phd_program_and/hi4wgt9/",
                  "text": "those are good points, thank you for the insight",
                  "author": "butterfly_cooch",
                  "created": 1635267755,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}