{
  "sid": "qoc37i",
  "link": "/r/GradSchool/comments/qoc37i/are_you_lonely/",
  "title:": "Are you lonely?",
  "text": "I've chosen quite an isolated PhD group and it's kind of left me separated from many of the other guys in the office bacause they host private social events all the time and done generally invite non group members. Only 4 of about 12 actually introduced themselves and asked me name too (before you start yes I introduced myself to them all).\n\nI can't help but feel quite lonely both socially and (rather pathetically) romantically too. \n\nWhat's some good advice for staving off these feelings of isolation?",
  "author": "Nuclear_Fermion",
  "created": 1636241607,
  "updated": 1636656599,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.97,
  "comments": {
    "hjmn6a1": {
      "link": "/r/GradSchool/comments/qoc37i/are_you_lonely/hjmn6a1/",
      "text": "Believe it or not this can be super common. Same here, it's just an office space with isolated work. You can try and change the culture though! Compliment folks, and encourage others through compassion. Be the light ✌️",
      "author": "kennygconspiracy",
      "created": 1636252183,
      "upvotes": 16,
      "replies": {}
    },
    "hjoryf3": {
      "link": "/r/GradSchool/comments/qoc37i/are_you_lonely/hjoryf3/",
      "text": "Very common. To sit in front of a computer for 12 hours is a normal thing. I have sort of accepted this as my \"normal\" for now, at least until I get a job after PhD.",
      "author": "givemeyourdonut",
      "created": 1636301478,
      "upvotes": 3,
      "replies": {}
    },
    "hjorcku": {
      "link": "/r/GradSchool/comments/qoc37i/are_you_lonely/hjorcku/",
      "text": "I go to a private religious university and am atheist. Once the pandemic hit I stopped trying to connect with my cohort, and I never really returned because they live in a completely different world than me and view me as an alien. I miss having scientific discussions with my peers, and I do feel lonely a lot of the time. I don't have advice but you're not alone.",
      "author": "catcherofthecatbutts",
      "created": 1636301235,
      "upvotes": 2,
      "replies": {}
    },
    "hjpni1s": {
      "link": "/r/GradSchool/comments/qoc37i/are_you_lonely/hjpni1s/",
      "text": "Absolutely. My lab got shut down for Covid and I’m the only grad student there anyway. With everything moving online I lost any contact I had with my cohort. My girlfriend became one of my only real sources of outside contact, but that put too much pressure on the relationship and we broke up at the end of the summer.\n\nLately I’ve been able to start seeing friends in person again with restrictions easing. That has helped a lot. They might not understand your work, but I think most people can understand stress and loneliness, especially after this past year.\nSchool is back in person, and I’ve been trying to put myself in more positions to be social. I was lucky enough to run into a couple people I knew from my Honours, and it’s been nice to have someone to talk to there. If you can become friends with even one of the people who introduced themselves to you then that could help a lot! They might even be able to help you get to know some of the others.\nFinally, I just recently got the most adorable puppy! If you’re a pet person, that definitely helps.\n\nSo although I am still lonely, I’ve found these things have helped to mitigate it somewhat, or at least helped me with trying to get through it. I hope things get better (for both of us) and know that at the very least, you are not alone.",
      "author": "dekergs",
      "created": 1636313868,
      "upvotes": 1,
      "replies": {}
    }
  }
}