{
  "sid": "qnwgp2",
  "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/",
  "title:": "Positive PhD experiences",
  "text": "I hear a lot of negativity from people about PhDs and I find it worrisome. I’m a second year masters student, I think I want to pursue a PhD afterwards but hearing so much negativity about the process makes me wonder if I should go down that route.\n\nSo, I was wondering if there are people here who have flourished during their PhD and have enjoyed the experience? I realise it comes with stress, it’s a high pressured environment, but surely there are people who thrive in academia? \n\nI feel stressed quite often during my masters but I love the academic environment. I feel privileged to meet such inspiring researchers and to be immersed in work that is fulfilling.",
  "author": "storm_borm",
  "created": 1636189323,
  "updated": 1636656793,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.95,
  "comments": {
    "hjjy2nx": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjjy2nx/",
      "text": "Meee! Final year. It's so fun, my hours are flexible, life is good. I have three supervisors and they're all awesome in their own way. I'm lucky to be on a very good scholarship, so money isn't tight for me like it can be for many grad students. I don't have to teach or take classes either (I'm in the UK). No complaints really, actually I wish I could stay longer but postdoc-ing sounds good too. Getting to do cool science all day, at my own pace, with wonderful scientists is just excellent. There have been stressful moments but I am pretty good at treating it like a job and stepping away from it during weekends and most evenings. You absolutely have to learn to say \"no\" in various forms or it won't go like this for you. \"I don't have the capacity for that\", \"I'll have time for that in about a month\", \"sorry, I can't help with that\", etc.",
      "author": "Monsteriah",
      "created": 1636208732,
      "upvotes": 26,
      "replies": {
        "hjko6ei": {
          "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjko6ei/",
          "text": "What’s your publication record like? Aren’t European phds only 3 years?",
          "author": "animelover9595",
          "created": 1636219937,
          "upvotes": 1,
          "replies": {
            "hjktati": {
              "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjktati/",
              "text": "Yeah, UK ones are 3 years. It's not for everyone but I really didn't want all the research distractions like teaching and classes. Right now I've got 6 published (of which 4 are first or co first), 3 submitted (one first author), and another first author about to be submitted in the next few weeks. So hopefully 9-10 total by the end of my PhD, at least. Still got a year before I graduate too, and many plans, though we'll see how much of it I actually get through! I'm in mathematical genetics for reference. Worth noting that I chose my field purposefully because it's very employable, in case I don't make it in academia.",
              "author": "Monsteriah",
              "created": 1636222136,
              "upvotes": 3,
              "replies": {
                "hjkzrml": {
                  "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjkzrml/",
                  "text": "Ya I figured it was something data heavy, very envious of your success congrats!",
                  "author": "animelover9595",
                  "created": 1636224957,
                  "upvotes": 2,
                  "replies": {
                    "hjl1yad": {
                      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjl1yad/",
                      "text": "Thanks that's nice of you, I guess doing reasonably well means I enjoy it more too",
                      "author": "Monsteriah",
                      "created": 1636225920,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjkcjfx": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjkcjfx/",
      "text": "The literal only downside is not making money honestly. All the negativity people experience in a PhD can also be experienced in any other work environment. But if you’d make 150k a year in industry, you’ll be making 1/5th that as a PhD student. That’s all you really need to consider as a true negative of a PhD. The rest of it is just negatives of life in general.",
      "author": "gentleboys",
      "created": 1636215021,
      "upvotes": 15,
      "replies": {}
    },
    "hjk4kxb": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjk4kxb/",
      "text": "I think I did. It was a real struggle don't get me wrong, but the friends I made and the confidence I built I don't think I would be the same person I am without it. \n\nGraduated in 2016 so maybe I can look at with slightly rose tinted lenses but I think I would've said the same thing then.",
      "author": "threshold_voltage",
      "created": 1636211608,
      "upvotes": 6,
      "replies": {}
    },
    "hjk4lr8": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjk4lr8/",
      "text": "I loved my PhD experience, however, some components that seemed to serve as a buffer from the potential negativity/drama: \n\n1) it was designed for working professionals (but it was **not** an online program)  \n2) I didn't work as a GA or in a lab or other setting with the department faculty   \n3) Did not live in the same city as the university  \n4) I felt that the faculty were \\*really good\\* at mentoring working professionals",
      "author": "deadinhighered",
      "created": 1636211618,
      "upvotes": 5,
      "replies": {}
    },
    "hjje6ia": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjje6ia/",
      "text": "Im a first year PhD student. Loving the experience but I see it’s trade offs. Hard work and low pay for the opportunity to learn. I’ve learned a crazy amount on my topic and im passionate about the subject. That’s been amazing. Im trying to manage expectations and start working less in the future, but that doesn’t seem feasible quite yet. I think you just need to understand what you’re gaining/losing through the experience",
      "author": "fun-n-games123",
      "created": 1636198181,
      "upvotes": 9,
      "replies": {
        "hjjhzfe": {
          "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjjhzfe/",
          "text": "Ah, to be an innocent first year again…",
          "author": "thatcheekychick",
          "created": 1636200561,
          "upvotes": 4,
          "replies": {
            "hjjirpk": {
              "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjjirpk/",
              "text": "Yeah I realize my perspective isn’t whole yet! What do you think changed the most between the beginning and end?",
              "author": "fun-n-games123",
              "created": 1636201044,
              "upvotes": 1,
              "replies": {
                "hjjjy1e": {
                  "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjjjy1e/",
                  "text": "I loved my program so much in the first two years, that I cried tears of happiness sometimes because I couldn’t believe I was there, living my dream. And then classes ended and the true grind of PhD started. The first two years in my program were mostly doing classes and doing TA/RA work. That’s a glorified version of undergrad, where you learn, do assignments and get grades. You’re either a good student or a bad student and since you made it into a a good PhD program *of course* you’re a good student. That’s rewarding. Doing research on your own is totally different. Not everyone could handle the transition and we lost almost half of our cohort. Once you start working on your dissertation and sending out papers you get precious little indication that you’re doing well. All you hear is how you’re not good enough. Don’t get me wrong, I have a fabulous adviser and he always builds me up, but that’s how academia is set up. Paper workshops are oriented towards pointing out weaknesses. You get way more rejections than acceptances from journals. You’re constantly spinning in circles and no one can tell you if you’re doing it right, because it’s *your* research so *you’re* the expert. But you’re also still learning so you’re not really an expert at anything yet. I’ve been working on the same paper for three years now. It got rejected three times and is yet to be published. And that’s a good paper! I know because it got two awards. Doesn’t save you from the kick in the nuts of when it comes back with a “no” and three pages of what you should rework again and again and again. This was a long answer to your question. BUT I’m still here, still doing it, still grinding away. I love the academic community, I love my colleagues and the intellectual stimulation. I love finding patterns in new data. There are good things about doing a PhD of course, but there’s no denying that it’s a rough ride.",
                  "author": "thatcheekychick",
                  "created": 1636201749,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjlxijs": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjlxijs/",
      "text": "Oh I am  so glad that you posted and inquiring! I read my fair share of warnings. I became even more aware...and then I avoided the sub because it was too much. \n\nI am in my first year and work full-time (but tbh a lot of students do with combined PT work). I  love my program so far and just submitted my second co-written article. I don't feel stressed but have to stay organized to keep up with two competing schedules. \n\nI completed my MA 4 years ago and within these last few years (and for the first time in my life), I had savings, was able to stick to a consistent student loan repayment plan, and carved out a career for the interim.\n\nThis was the best decision I made for myself. Believe it or not, I still have time to enjoy life. I also know that I'll have highs and lows. Heck, I'm only in my first yr.\n\nThere are incredible researchers everywhere and across all disciplines ..and very few academic jobs... avoid the pyrrhic victory. Be realistic about goals and prioritize health and financial wellness.\n\nLife is hard and PhD journey is tough.. but the experience can still be positive even if there are bad weeks or months",
      "author": "fortheforms",
      "created": 1636240035,
      "upvotes": 3,
      "replies": {}
    },
    "hjjikyc": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjjikyc/",
      "text": "There’s no getting around it. PhD is rough. The publish or perish mentality kicks your butt. The constant journal rejections are brutal. Doing proper research is draining. Most of the program is very different from going to classes, doing homework and getting grades. Most of the times there is no indication of how well you’re doing. You’re just working on the same goddamn paper for years with a bunch of rejections to kick you when you’re down. You really have to know what you’re getting into. BUT this does not mean it can’t be enjoyable. Think of a marathon, where you’re so exhausted you wanna die, but you still like it. Some people get a kick out of that. Others see it as unnecessary torture. If you do any program worth doing, it will be freakin hard. Doesn’t mean it’s not worth it.",
      "author": "thatcheekychick",
      "created": 1636200930,
      "upvotes": 8,
      "replies": {}
    },
    "hjn3vll": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjn3vll/",
      "text": "I'm 100% doing better in grad school than in undergrad. I hated my undergrad classes (chose a bad major and stuck with it because of parental pressure to stick with what I started with). Ended up going into an environmental sciences/applied physics. Started off in a Masters program because I knew I wanted to work in the field but had limited experience from undergrad. Didn't intend to do a PhD but fell in love with my field and my advisors were supportive as ever so I transferred into the PhD program. I'm in my third year and still finishing up classes so I guess I haven't gotten the full experience yet. I TA'd my first two years while doing research and taking classes. It was hard but I loved TA'ing. The only hold up I have with my PhD is that I'm not doing enough. My labmate is starting work on a second subproject that likely will add to his dissertation but I'm still on my first chapter and working on my manuscript. Other than that, I'm having fun, and I love what I do. The pay is shit but I'm lucky to have a supportive partner with an actual job lmao. I've been lucky to not have a bad experience so far and things are working out thus far!",
      "author": "Anti-Itch",
      "created": 1636261504,
      "upvotes": 2,
      "replies": {}
    },
    "hjlasuk": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjlasuk/",
      "text": "I wouldn't say flourished, but one major positive thing is that I have an amazing adviser. I had to switch after my first adviser left academia, but my current adviser is incredibly kind, supportive, intelligent and a great fit for me. We have weekly meetings to check in, and they are not so hands off that I feel lost, but not a micromanager either. They were also a first generation college student themselves, so it is really helpful to have someone who understands that challenge. \n\nMy department also has a lot of really great people. I love the dean of my department, who can be an extremely critical reviewer but does it so you can improve, not to be mean. Some of the new faculty we've hired have also been great. Our director of graduate studies is also a really cool person. \n\nMy department is actually separate, but combined, with a larger department on campus and if I had been in that larger department I think I probably would have dropped out by now. I like and have good relationships with *all* of the faculty in my home department. The larger one is filled with back-stabbers, gossips, racists and creeps, and has high turnover of both faculty and students.",
      "author": "False-Guess",
      "created": 1636229813,
      "upvotes": 1,
      "replies": {}
    },
    "hjm1qzr": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjm1qzr/",
      "text": "It sucks more and more the longer you do it but when you're done feels pretty damn good",
      "author": "coolplate",
      "created": 1636241970,
      "upvotes": 1,
      "replies": {}
    },
    "hjnft5b": {
      "link": "/r/GradSchool/comments/qnwgp2/positive_phd_experiences/hjnft5b/",
      "text": "So far I have been enjoying it, especially being a TA. The research is fine right now but I feel that once I am done with classes then I can actually focus on it. My advisor is also really nice and understanding that even though classes are annoying that they deserve priority as to not get put on probation.\n\nI'll check back in a year, lol.",
      "author": "DistressedPhDStudent",
      "created": 1636271171,
      "upvotes": 1,
      "replies": {}
    }
  }
}