{
  "sid": "qwrq9f",
  "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/",
  "title:": "Work-life balance when living with your SO",
  "text": "I feel like most people figure this out by the time they are older, but I am struggling a lot.\n\nMy partner and I just moved in together, and work-life balance has been hard for me. I used to sprawl out my days, working whenever inspiration struck, sometimes late into the night. But now I'm trying to condense it to a 9-5, and sometimes it just doesn't work.\n\nHow do you all do it?\n\nAnd side note, have you ever thought the academic life wasn't for you? Right now, I feel like it's not worth it, because of all the potential quality time that I'm losing with my partner. What other jobs could I do, without a PhD yet (STEM)?",
  "author": "carefree_elf",
  "created": 1637248042,
  "updated": 1637354452,
  "over_18": false,
  "upvotes": 79,
  "upvote_ratio": 0.97,
  "comments": {
    "hl4njpw": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl4njpw/",
      "text": "I do it all by not doing it all. I have a great advisor who really believes in work-life balance, a great group who’s outside of the lab just as often as they’re in, and I don’t work more than 8 hours a day if I can avoid it. Sometimes it’s okay to push stuff off.",
      "author": "wildechem",
      "created": 1637248722,
      "upvotes": 56,
      "replies": {
        "hl99ipg": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl99ipg/",
          "text": "This makes most sense, thank you. I tried not bringing work home yesterday, and it felt loads better.",
          "author": "carefree_elf",
          "created": 1637331638,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hl4smh8": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl4smh8/",
      "text": "Being in a relationship is about compromise and working with your partner. If condensing your work into 9-5 doesn't work adjust you schedule. If your are afraid your partner is going to be upset that they have less time with you a couple of weeks just talk to them and explain that you have some bigger assignments that require more time and find other ways to spend time with them, or arrange to have a special day together when you finish the semester to make up for it.  \n\nWhen I was in grad school, because we didn't live together and my partner worked all week, we only saw each other on weekends, but I often had to do weekly readings and assignments on the weekends so we just hung out in the same space each doing our own thing but together.",
      "author": "94sHippie",
      "created": 1637250788,
      "upvotes": 34,
      "replies": {}
    },
    "hl5v26g": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl5v26g/",
      "text": "My husband and I have been in school together for roughly four years. We don’t spend a ton of time together because I also work 9-5. But a couple nights per week we will hang out and we also co-loaf where I do homework near him while he plays video games or vice versa. You’ll have to compromise in school, and personally I really don’t like devoting all my free time to another person. Sometimes I just want to sprawl out on my bed alone and watch a movie. I will bring it up, however, if we haven’t spent any time together focusing on each other in weeks. \n\nI think if you can both be understanding during this time, it will go a long way. It’s not forever and you just have to find moments to hang out (we take showers together because there are no distractions and we can just talk and fuck around, and sometimes have sex).",
      "author": "throwmedownthequarry",
      "created": 1637265899,
      "upvotes": 22,
      "replies": {}
    },
    "hl6aibj": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl6aibj/",
      "text": "I don't do really intense assignments that take up a lot of mental bandwidth after 6pm. After that point, my partner is usually coming home soon, our animals will need fed, or it will be time to cook dinner. I also devote time in the evening specifically to being present with my partner and our animals. Sometimes I do have to be reading while we're together, but I try to save \"easier\" or shorter readings for home. \n\nI also keep the rule for myself that I will not stay up past midnight on nights that I have a lot of work because I would rather wake up super early to do work than force my partner to go to bed alone with our animals. I also personally do better waking up early to finish things than I do staying up too late and I refuse to force my body to do an all nighter.",
      "author": "HumanPersonality32",
      "created": 1637272051,
      "upvotes": 8,
      "replies": {
        "hl99mdx": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl99mdx/",
          "text": "Very smart advice, thank you.",
          "author": "carefree_elf",
          "created": 1637331686,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl6dv1x": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl6dv1x/",
      "text": "My partner has a real job and works more than me lol",
      "author": "SaplingCub",
      "created": 1637273412,
      "upvotes": 9,
      "replies": {
        "hl78rt1": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl78rt1/",
          "text": "Same. This is probably just a commentary on american work/life balance in general, but sometimes when i see these posts if people realize this isn't unique to graduate school; it seems like almost every \"professional\" career will involve working nights/weekends.",
          "author": "gradthrow59",
          "created": 1637287219,
          "upvotes": 3,
          "replies": {
            "hl7c6s8": {
              "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl7c6s8/",
              "text": "I think the difference for me is that these night/weekend work sessions are temporary and they go away after certain deadlines are passed. Whereas in grad school, this feeling is constant (at least in my program). \n\nMy partner, with his regular white collar job, occasionally gets way busier than I do, but these bouts usually last at most for 1.5 weeks. Then he’s back to the 9-5 schedule, with the Summer Fridays (he gets the full day or partial day off every other Friday). He’s accumulated a lot of vacation days he hasn’t used because I can’t take time off from lab (technically we get ~30 days a year, but it’s so frowned upon to take more than 2 weeks off). All of my friends who work in various pharma positions (n=5) also have similar perks with time that my grad school friends and I do not have. \n\nPlus, the best part about working a job is the ability to quit and find a different job if you find that it’s a poor fit. With grad school, you can probably switch lab once, then you’re stuck there until you graduate or leave with nothing.\n\nDon’t even get me started on the compensation 🥲\n\nThe lack of work/life balance isn’t a problem that is unique to grad school, but IMO we do experience it worse than some working professionals because we lack the perks that would make the lack of work/life balance more bearable.",
              "author": "ktlene",
              "created": 1637288780,
              "upvotes": 5,
              "replies": {
                "hl8xquv": {
                  "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl8xquv/",
                  "text": "That’s interesting, in my relationship it’s the opposite. My wife is a healthcare provider so basically she sees patients all day and then writes notes all night, and this is a constant day in/day out process that never stops. For me, sometimes I am writing a paper or something that I have to work a ton, or have some weird experimental time points that require me to spend 18+ hours in lab, but those are sporadic. \n\nVacations are a whole different story and at least for me, a real killer. I always have something long term running and often can’t take a weekend or more away from lab without setting myself back weeks. Even when I leave I usually have something to do (I had to write some sections of a grant last vacation because deadline was coming up). This is much different from my wife who leaves work and is done.",
                  "author": "gradthrow59",
                  "created": 1637325557,
                  "upvotes": 3,
                  "replies": {
                    "hl9iwsi": {
                      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl9iwsi/",
                      "text": "Ah, I see. My industry friends work desk jobs, so they do WFH during the pandemic and ~usually the work is contained 9-5. I’m sure doctors/nurses/healthcare providers are more similar to us in terms of time starvation.\n\nI feel you on holidays/vacations. Can’t take off since my experiments are all long term and set up months in advance. That and no one to take care of my mouse colony while I’m gone. It always feels like I’m tethered to the lab while everyone else is free to travel.",
                      "author": "ktlene",
                      "created": 1637335758,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl6fm50": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl6fm50/",
      "text": "> What other jobs could I do, without a PhD yet (STEM)?\n\nWhat jobs can you do with a STEM master's or bachelors? Many jobs.",
      "author": "smokingkrills",
      "created": 1637274146,
      "upvotes": 7,
      "replies": {
        "hl99f9t": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl99f9t/",
          "text": "Gonna sound stupid, but what kind?",
          "author": "carefree_elf",
          "created": 1637331593,
          "upvotes": 1,
          "replies": {
            "hl9auwr": {
              "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl9auwr/",
              "text": "It really depends what kind of degree you have, but one basic one  that is in demand is a data scientist/data analyst, if you're good at statistics and programming. Other than that you may have to look in your specific field. I studied engineering and worked at an entry level engineering job after my Bachelors before grad school. However, I know other people with an engineering background that got into finance somehow. \n\nBut seriously, you don't need a PhD to work in a stem-adjacent field. Most people don't. \n\nI guess I should add that the calculus may be different if you live outside North America/the EU, since it may be harder to find a job that pays the bills.",
              "author": "smokingkrills",
              "created": 1637332251,
              "upvotes": 2,
              "replies": {
                "hl9eccg": {
                  "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl9eccg/",
                  "text": "Thanks. I don't have any quant skills, so that's a bit limiting. But I will look around, maybe, if I feel like I need to.",
                  "author": "carefree_elf",
                  "created": 1637333804,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl5mia0": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl5mia0/",
      "text": "When I was remote I struggled a lot, but now I'm trying really hard to keep work on campus and home at home. Of course, I still have class readings and assignments to do that I can't always finish during on-campus time, but my SO is understanding of that.\n\nThat said, I would recommend asking your SO to be honest with you when they feel you're not balancing well. We don't always mean to bring work home but sometimes we do, and it can be good to have the gentle reminder of \"hey, that's not what you should be focusing on right now.\"",
      "author": "archerbean",
      "created": 1637262531,
      "upvotes": 7,
      "replies": {
        "hl99ozb": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl99ozb/",
          "text": "Right, communication is key. I will try to be mindful.",
          "author": "carefree_elf",
          "created": 1637331719,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl71aqi": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl71aqi/",
      "text": "I do struggle with this even still. And the 9-5 really doesn’t work for me. Mine is more like a 5-3 if you know what I mean, and it does suck but I think it’s just not forever. It’s temporary. And I try to really make time for my SO at least once a week where we spend a WHOLE day with just each other. But then just appreciating the little things we get to share together like cooking and eating meals, maybe watching one episode of a show in the evening, even cleaning can be a silly bonding thing for us. It is stressful but like I said I know it’s temporary and I know getting my masters degree will be better for our overall future together.",
      "author": "Stressydepressy1998",
      "created": 1637283758,
      "upvotes": 6,
      "replies": {
        "hl99s2s": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl99s2s/",
          "text": "Yes, it's the little things. :)",
          "author": "carefree_elf",
          "created": 1637331759,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl6gq72": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl6gq72/",
      "text": "In year three, still haven't figured it out. I'm great at working, and a great partner but I can't be great at both simultaneously. I try to rotate, but inevitably my partner winds up getting more of my time and it's really killing me knowing my work is of a lower quality. I've tried setting boundaries but haven't got it to work yet.",
      "author": "DonHedger",
      "created": 1637274607,
      "upvotes": 5,
      "replies": {
        "hl99u0t": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl99u0t/",
          "text": "I understand, it is hard. Hope it gets better for the both of us.",
          "author": "carefree_elf",
          "created": 1637331784,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl9tzun": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl9tzun/",
      "text": "My partner works a full time job. I work full time and take grad school classes part time. We are busy! We try to spend the evenings together, watching tv or hanging out. We make sure to call/text each other when we can. We also have mutual friends. I try to make sure I'm free to go out with my partner, go to the gym together, see his family, and go on trips and such. Sometimes I can't swing it due to homework or projects but I know when I can it means a lot. His family is super important to him so if he says ahead of time he wants to see his parents on Thursday night, I make sure to write that paper early so I can be there. Another example is that my partner is huge football fan and we are flying out to see a game in December. I'll make sure I have my assignments done in time so I can have a stress free trip. It's a balancing act. Sometimes he \"fake\" moans and groans (but does feel ignored). I have to explain that it's not that I'm ignoring, it's that I'm super busy with school. I have found that it helps to communicate but there will be ups and downs. He has gotten a lot better with compromising over the years and I set boundaries more frequently now.",
      "author": "smpricepdx",
      "created": 1637340201,
      "upvotes": 2,
      "replies": {
        "hla0g5i": {
          "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hla0g5i/",
          "text": "Thanks so much for sharing your experience.",
          "author": "carefree_elf",
          "created": 1637342722,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl4s34n": {
      "link": "/r/GradSchool/comments/qwrq9f/worklife_balance_when_living_with_your_so/hl4s34n/",
      "text": "What jobs you can do without a PhD but in stem? Bruh if you’re in a PhD program then you should definitely know what jobs you can do. \n\nIn any case, you’d be undergoing the same problems with a job. You don’t have good scheduling ethic. You need to timeblock your day every morning. Then when 6 or 7 or whatever rolls around, you stop working. If that means you do bad on an assignment, or a presentation, or you break a promise, whatever, you say to yourself “not my problem, it’s after 6”",
      "author": "grothendieck1",
      "created": 1637250571,
      "upvotes": -15,
      "replies": {}
    }
  }
}