{
  "sid": "qvzi1u",
  "link": "/r/GradSchool/comments/qvzi1u/writing_tips/",
  "title:": "Writing tips?",
  "text": "Hi all! I’m posting in the hope that some of you might have some PhD-specific writing advice. I’m currently 8 weeks away from my submission deadline, and do not have a single chapter completed. I struggle to stick to a single section - I’ve been working on a chapter for the last month, and have probably written equal amounts of words for this chapter and other sections throughout the thesis. My ‘jumpy mind’ was great when it came to experimental design and analysis (science PhD), but it’s proving a real hindrance now. \n\nDoes anyone have any advice about how to sit down and actually get shit finished? My supervisors seem annoyed at my lack of progress, but not to the point where they’ll support a deadline extension (asked yesterday). I feel like I’ve gone slightly mad - I’m working hard, thinking hard, but at the end of each day I am no closer to actually finishing a section, they just get more detailed and longer.",
  "author": "orange_smarties",
  "created": 1637156397,
  "updated": 1637182615,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hkzsu3x": {
      "link": "/r/GradSchool/comments/qvzi1u/writing_tips/hkzsu3x/",
      "text": "It's not easy! Something that helped me is to have a clear set of deadlines (chapter by chapter) that my supervisor also knew. Then I had no choice but to be done by a certain day. I chose to do it sequentially, one chapter at a time, so then once I was done round 1 on all the chapters I could start from the beginning again with any necessary revisions. \n\nAnother thing I found that helped is to lean into the 'jumpiness'. For example, for a given chapter you need to make figures, write figure captions, get references, write intro, results, discussion etc. So, I would start with one of those things and as soon as I would hit a wall, I would switch to another part of that chapter. I found it useful to keep the momentum going instead of forcing yourself to do one specific thing.",
      "author": "CuriousAboutLife0",
      "created": 1637161333,
      "upvotes": 7,
      "replies": {}
    },
    "hl01f07": {
      "link": "/r/GradSchool/comments/qvzi1u/writing_tips/hl01f07/",
      "text": ">My supervisors seem annoyed at my lack of progress, but not to the point where they’ll support a deadline extension (asked yesterday).\n\nInstead of jumping around from chapter to chapter, I would finish the introduction and the next chapter, and send it on to your advisors so they can see that you're making progress. And so they can go ahead and give you feedback.\n\nOnce you show them some completed work and you are making progress, then they might be more open to extending the deadline.\n\nAs for writing tips? Schedule writing sessions on your calendar for every day and stick to it.",
      "author": "raistlin65",
      "created": 1637164869,
      "upvotes": 3,
      "replies": {}
    }
  }
}