{
  "sid": "r9mctb",
  "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/",
  "title:": "Do any other grad students really miss undergrad?",
  "text": "I am in a MA program right now that is graded on final papers in each of the courses and the dissertation. In the three months of my program so far, I've written a singular 1,000-word paper and done a group presentation. It sounds weird, but I really miss quizzes and tests. Test-taking is my strong suit, and I think I miss the constant anxiety of undergrad. \n\nDoes anyone else feel this way?",
  "author": "Literally_idc",
  "created": 1638730142,
  "updated": 1639518957,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 0.85,
  "comments": {
    "hncw7af": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hncw7af/",
      "text": "I'd kind of prefer more tests to papers/projects because I dislike doing \"fake\" research (for class) when I could be spending that time on \"real\" research, but I don't miss undergrad.  Grad school is way more interesting and less stressful.",
      "author": "djp_hydro",
      "created": 1638731466,
      "upvotes": 29,
      "replies": {}
    },
    "hndavrr": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hndavrr/",
      "text": "I am a PhD student, sometimes I miss the structure a lot. It's an almost brainless process from a planning/structure perspective.\n\n&#x200B;\n\nI do not miss doing tests and reports on topics I don't have an insane depth of knowledge on though. I much prefer my PhD for that reason -  I am an expert in my field, I can say things and know for sure they are correct. You don't get that much in undergrad, particularly around assignments.",
      "author": "PsychPhDBrah",
      "created": 1638736630,
      "upvotes": 34,
      "replies": {
        "hndy4yh": {
          "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hndy4yh/",
          "text": "Yeah, I get that Undergrad felt a lot more like High School. I went to an incredibly competitive high school so it wasn't uncommon to have multiple all-nighters a week so and the anxiety/ adrenaline from that is really rewarding (addictive?). So I think I internalized that and brought it to undergrad with me, even though my undergrad was a cakewalk compared to High School. So my MA is the first time that that mindset isn't helpful and I miss the adrenaline I guess.",
          "author": "Literally_idc",
          "created": 1638745526,
          "upvotes": 3,
          "replies": {
            "hnh0f9y": {
              "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnh0f9y/",
              "text": "I cruised through both undergrad and high school on very little intellectual effort on my part, most of the material came naturally. Undergrad felt because of this mostly like high school except with a much better social life, a lot more free time, and a lot more freedom to just go off and do random shit off campus. \n\nGrad school was the first time i ever hit a block of \"oh crap I can't just cruise through this like undergrad and high school\" which made it a lot more stressful and less fun. Learning study skills for the first time in grad school wasn't exactly pleasant.",
              "author": "DoctorWatchamacallit",
              "created": 1638806825,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hnh4sha": {
          "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnh4sha/",
          "text": "I recently read a paper about [mental health in labs](https://www.cell.com/neuron/fulltext/S0896-6273(21)00618-8?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0896627321006188%3Fshowall%3Dtrue) and structure was one of the first things they mentioned that is really difficult about grad school. It resonated with me, as well as the point about expectations being unclear. I think one of the most important things we as grad students can do to address this is have clear conversations with mentors about expectations and designing schedules, checkpoints/deadlines etc. to build in more structure.",
          "author": "quintessentialquince",
          "created": 1638808567,
          "upvotes": 2,
          "replies": {
            "hnpyw06": {
              "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnpyw06/",
              "text": "I think this has been my biggest struggle. I’m in my first semester doing rotations and my current PI is hardly around and only checks in on projects about once a month. It’s more independence than I’ve ever had and I’m finding i don’t do well with it. For some reason I feel like I always have to be working and stress 10x more out of the fear that my PI will assume I’m slacking since he never sees the actual time put in.",
              "author": "Hobbiesupthewazoo",
              "created": 1638974122,
              "upvotes": 1,
              "replies": {
                "hnr5ypa": {
                  "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnr5ypa/",
                  "text": "Oh my gosh yes. In my first rotation I didn’t have regular meet is with the PI either and it was very difficult. It’s harder to get guidance about things like experimental design, ideas and analysis too when you don’t see them. So I decided that I would always ask for a weekly meeting during future rotations, even if the PI doesn’t do them normally. I figured it’s such a short amount of time, I want to get as much mentorship as I can.",
                  "author": "quintessentialquince",
                  "created": 1638991183,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hngzua6": {
          "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hngzua6/",
          "text": "Yeah....i learned in grad school just how used I was to that structure and had no real idea of how to function without it. While arguably learning to create my own structure and direction is an important part of my maturation as a researcher, it takes a lot of mental energy to do so, and part of me does wish I could go back to a time when i didn't have to yet.",
          "author": "DoctorWatchamacallit",
          "created": 1638806589,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnd4igt": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnd4igt/",
      "text": "Shit loads, but that's also because my ugrad experience was a joke where I could cram for 2 days before exams and pull 95s after skipping classes and partying\n\nI really only miss the lack of responsibility, so it's a different source of pain than yours",
      "author": "ctfogo",
      "created": 1638734355,
      "upvotes": 19,
      "replies": {
        "hndvhgw": {
          "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hndvhgw/",
          "text": "Honestly that too. But my Master's program is just really easy even though I'm at like the #2 program for my field in the world. I just have waaaaay too much free time.",
          "author": "Literally_idc",
          "created": 1638744462,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hnctzbg": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnctzbg/",
      "text": "Not at all",
      "author": "Wait_you_can_see_me",
      "created": 1638730638,
      "upvotes": 29,
      "replies": {}
    },
    "hndzawg": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hndzawg/",
      "text": "I miss taking classes just because a subject interested me.\n\n\n Now any classes I take are more focused on being specifically helpful to my current research, and after the first couple of years I have to focus on research and not learning about random cool science \n\nBut I love having the freedom to do more, better wet lab work so I guess it balances",
      "author": "NaCly_sweetpea",
      "created": 1638745996,
      "upvotes": 10,
      "replies": {}
    },
    "hncv0sr": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hncv0sr/",
      "text": "My undergrad had lots of papers and like 0 quizzes. We'd have an exam where you'd write 2-3 essays once a year on top of the papers. \n\nOnly can safely say I much prefer writing to taking quizzes, but my PhD program so far has been lacking in writing, I mainly do short assignments I find i can't get as excited about. :/ I know this will change when I stop taking classes and get to candidacy when writing is a big part of your dissertation aha",
      "author": "daughtersofthefire",
      "created": 1638731025,
      "upvotes": 5,
      "replies": {
        "hndvwua": {
          "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hndvwua/",
          "text": "Mine is literally the exact opposite. Each class has one essay at the end that determines your entire grade. So that's obvs really stressful, but it also means I have nothing to do all semester before then besides general reading and participating in lectures and whatnot.",
          "author": "Literally_idc",
          "created": 1638744634,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnebmya": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnebmya/",
      "text": "If you are in grad school for the quizzes and tests, you may find another pursuit to be more satisfying both in the short and long term.",
      "author": "IkeRoberts",
      "created": 1638751130,
      "upvotes": 3,
      "replies": {}
    },
    "hnctoeq": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnctoeq/",
      "text": "No☺️",
      "author": "MotvStr",
      "created": 1638730524,
      "upvotes": 15,
      "replies": {}
    },
    "hnei5co": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnei5co/",
      "text": "I only miss undergrad in terms of the partying and easier courses lol. I most definitely have anxiety in grad school",
      "author": "mrt1416",
      "created": 1638753993,
      "upvotes": 7,
      "replies": {}
    },
    "hndma6w": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hndma6w/",
      "text": "I don’t know anymore.",
      "author": "MrUnknown1996",
      "created": 1638740873,
      "upvotes": 2,
      "replies": {}
    },
    "hnfkgz8": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnfkgz8/",
      "text": "I’m the complete opposite. I’m much better at writing and making an argument, so I don’t miss tests at all. I still have some but not that many. I really like the way grad school grades, it’s less stressful to me than managing many smaller assignments.",
      "author": "research24753",
      "created": 1638773741,
      "upvotes": 2,
      "replies": {}
    },
    "hnfmbmh": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnfmbmh/",
      "text": "Most of my Master's is based on internships. I take some courses but they are all only 2-3 weeks long with a test or assignment at the end. I also take these courses during little breaks in my internship. I miss the structure of undergrad. It didn't feel like I was working. My Master's was a head-first dive into full-on adulthood / working more than 9-5. I also miss the social life during undergrad. It is hard to maintain during my Master's, and since I live on my own and not in dorms anymore, I also have to seek out certain activities more actively.",
      "author": "AstaryaJasmin",
      "created": 1638775100,
      "upvotes": 2,
      "replies": {}
    },
    "hngs6f9": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hngs6f9/",
      "text": "I missed the effort that faculty would put in to designing their courses for undergrad. In graduate school it felt like professors put no effort into structuring their classes and instead taught whatever they remembered from their time in graduate school.",
      "author": "local_man_says",
      "created": 1638803404,
      "upvotes": 2,
      "replies": {}
    },
    "hngylmc": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hngylmc/",
      "text": "Yes. I miss the social life of undergrad (grad school can be very socially isolating), the lack of worry about my own finances (in undergrad I had a meal plan and tuition that was pre paid and I wouldn't need to worry about paying for really anything myself until after I graduated, whereas in grad school I need to budget for everything from my stipend), the structure, and relatively low pressure environment (I could breeze through undergrad relatively stress free much like high school, and didn't have to worry about major stressors like quals/comps or dissertation defenses).\n\nBut I think the biggest thing is that while I love research, I hadn't realized until i finished all my classes and passed comps *just* how much i needed the human interaction that came with classwork. When I'm doing nothing *but* research, it gets extremely lonely and isolating and I've taken to signing up for intramurals and any clubs that would let in a grad student just so my mental health can stay above water.",
      "author": "DoctorWatchamacallit",
      "created": 1638806087,
      "upvotes": 2,
      "replies": {
        "hnhj5q2": {
          "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnhj5q2/",
          "text": "Yeah, I think the loneliness is a part of it as well. I am doing my grad program in the UK but I am from the US and idk anyone here except for the few people in my program who I go out for drinks with once or twice a week or so.",
          "author": "Literally_idc",
          "created": 1638814178,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnda08d": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnda08d/",
      "text": "Absolutely not. For me it was MA > undergrad > PhD.",
      "author": "fjkfjldsls",
      "created": 1638736311,
      "upvotes": 1,
      "replies": {
        "hndxk9t": {
          "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hndxk9t/",
          "text": ">me too, but I don't miss undergrad\n\nreally? Why do you put PhD at the bottom? I am hoping to pursue a PhD after my MA",
          "author": "Literally_idc",
          "created": 1638745294,
          "upvotes": 2,
          "replies": {
            "hne6801": {
              "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hne6801/",
              "text": "Same as you really - I’m a test taker, I’m good at exams. I enjoy revising and studying more than writing. I also liked that an exam is over quickly. I thought I liked writing enough to do a PhD…I didn’t.",
              "author": "fjkfjldsls",
              "created": 1638748837,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hncuinh": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hncuinh/",
      "text": "> Test-taking is my strong suit\n\nme too, but I don't miss undergrad",
      "author": "ning7",
      "created": 1638730835,
      "upvotes": 1,
      "replies": {}
    },
    "hnftnoi": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnftnoi/",
      "text": "Nope. I hate tests and am soooo happy I don't have a single one in my MSc program. :)",
      "author": "keeper4518",
      "created": 1638781025,
      "upvotes": 1,
      "replies": {}
    },
    "hnged0z": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hnged0z/",
      "text": "God no. I hated undergrad with a passion. The more research and fewer classes the better for me - masters was better than UG, and PhD has been great as no exams or classes at all.\n\nI always hated sitting exams and honestly would never have ended up in research if I needed to keep sitting them.",
      "author": "ayeayefitlike",
      "created": 1638796682,
      "upvotes": 1,
      "replies": {}
    },
    "hngfg7e": {
      "link": "/r/GradSchool/comments/r9mctb/do_any_other_grad_students_really_miss_undergrad/hngfg7e/",
      "text": "No. I hate tests.\n\nI was a thoroughly mediocre undergrad students, until during the thesis I could do actual research. Research where I actually had to come up with the methods and protocols. I scored higher on my thesis than for any test during the rest of the Bachelor.\n\nNote that I have a deep-seated hatred for authority and even going to classes on someone else's schedule irks me on a deep instinctive level. The free-form self-planning of a PhD (and to a lesser degree; Bachelor and master thesis projects) suited me extremely well.\n\nAs others have mentioned though, the good part about undergrad is that it was two-fingers-in-the-nose easy.",
      "author": "fishnoguns",
      "created": 1638797272,
      "upvotes": 1,
      "replies": {}
    }
  }
}