{
  "sid": "qn6bzw",
  "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/",
  "title:": "How to buy an international gift card to promote my research by giving it to the participants?",
  "text": "Hello,\n\nI hope this is the right place.\n\nI would like to buy an international voucher/gift card to promote my research by giving it to the participants. I checked Netflix, Amazon etc. but they say that you can use the cards if the currencies you buy and you demand the card match. So, it seems that they are not international or did I misunderstand? Any solution?\n\nThanks in advance!",
  "author": "helloiambrain",
  "created": 1636099949,
  "updated": 1637417075,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.6,
  "comments": {
    "hjfb5fa": {
      "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/hjfb5fa/",
      "text": "I don't know why this thread says it has 6 comments but I only see 2. Anyways from those that I can see I'm assuming people don't understand that you're doing human subjects research, right? Providing participants with incentives is quite common practice. I'm assuming you've gone through the appropriate channels to authorize recruiting people internationally.\n\nIs it a survey, interview/FG, or an experiment/trial?\n\nI'm not that familiar with the technicalities of different gift cards, but it's possible either a) a compliance officer in your institution's IRB, or b) the purchasing officer in your academic department might know.",
      "author": "Bugsnatch",
      "created": 1636125710,
      "upvotes": 3,
      "replies": {}
    },
    "hjfc9q5": {
      "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/hjfc9q5/",
      "text": "Yeah I think some people are misunderstanding your post and I agree with u/bugsnatch that this is perfectly acceptable as long as it’s cleared by an IRB. One question I have is whether you’re giving everyone a gift card or you’re entering everyone into a drawing and then giving a gift card to a few winners? That would change how I’d approach this. Also, do you have the funding for this? It can get expensive very quickly! I assumed if you had a grant that they might have guidance or even requirements about how you’d have to buy those vouchers, but that might not be the be there case. I second talking to your school’s research office to see what they recommend. \n\nOh, another question: are all the international participants in one country or in various countries?",
      "author": "WitnessNo8046",
      "created": 1636126152,
      "upvotes": 2,
      "replies": {
        "hjj02sr": {
          "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/hjj02sr/",
          "text": "Thank you for your response. I have a fund and I will be able to buy one voucher/gift car that is worth 100 euros/dollars. So, not everyone, but the winner will get the price. It is a survey study open to everyone in the world. If it was in one country, that would be very easy. There are many technical problems such as I cannot give money directly, and I have a deadline to buy a voucher, but I can use in the future. So, that would be great if I could buy a gift card/or anything that can be used internationally. I was thinking Spotify, Netflix premium accounts but they limit (probably for avoiding fraud) like currencies should match...",
          "author": "helloiambrain",
          "created": 1636187263,
          "upvotes": 1,
          "replies": {
            "hjjssud": {
              "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/hjjssud/",
              "text": "Is it possible to wait to see who wins it and then look into how to buy a gift card usable in their country? It’s easier to figure out one concrete solution rather than hundreds of potential solutions.",
              "author": "WitnessNo8046",
              "created": 1636206303,
              "upvotes": 2,
              "replies": {
                "hjnnc8e": {
                  "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/hjnnc8e/",
                  "text": "Unfortunately it is not possible because even if I have a budget from the university, there is a short deadline and they force me to first buy it, then use it, yeah, it is so weird.",
                  "author": "helloiambrain",
                  "created": 1636278348,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjebsoi": {
      "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/hjebsoi/",
      "text": "I would not do this at all, but maybe I am missing some important context. If you are in the US (and maybe this is true of other countries) most of the people you want to impress have rules at their jobs about not receiving gifts due to potential conflicts of interest. In other words, if someone, especially a foreigner, gives me a cash equivalent such as a gift card, I can be in trouble at work for accepting it. (I'm an r&d scientist in industry now, for context.) Sorry if I sound harsh at all!",
      "author": "zenmaster991",
      "created": 1636107382,
      "upvotes": -7,
      "replies": {}
    },
    "hjepgaj": {
      "link": "/r/GradSchool/comments/qn6bzw/how_to_buy_an_international_gift_card_to_promote/hjepgaj/",
      "text": "What for? Is this some sort of a bribe?",
      "author": "purechampagne",
      "created": 1636116250,
      "upvotes": -9,
      "replies": {}
    }
  }
}