{
  "sid": "qtw6jg",
  "link": "/r/GradSchool/comments/qtw6jg/should_i_take_a_semester_off_to_study/",
  "title:": "Should I take a semester off to study?",
  "text": "First, sorry if this is all too much information or poorly explained. I started writing this post with the intention of getting advice/insight but it kind of turned into an \"off my chest\" post.\n\nI am in the 5th year of my PhD program and I want to take a semester off. I have already met my PI's graduation requirements and technically can graduate in May 2022 but I am really insecure about my (lack of) understanding/knowledge of topics in my research field due to a health condition.\n\nFor the past 5 years (starting in my senior year of undergrad) I have had undiagnosed hypothyroidism and suffered with the symptoms of it, one of the main symptoms being severe cognitive impairment (especially when it comes to my memory/comprehension). For years, the doctors I went to about my concerns basically told me I was a depressed hypochondriac and sent me home. My body finally broke down this year and a doctor finally took me seriously and ran the tests. Turns out I have hypothyroidism and was put on medication. After starting treatment and getting on the right dosage only 2 months ago, I feel much, much better. I feel incredible and like my old self. However, I'm starting to realize just how bad my condition was for the past 5 years. Like I said, my cognitive ability was severely impaired. I had horrible memory/comprehension during those 5 years and when I look back everything is so hazy and a blur. All the information I should have learned in my graduate courses and research is so shaky, I was basically retaining just enough to get by. It feels like I was drunk for 5 years and remember the gist of the main events,  but none of the details. \n\nDuring the past 4 years of graduate school I have been really insecure about my lack of understanding of basic concepts in my research field. My peers are very clearly way ahead of me in terms of understanding theory and concepts behind our work, even people who joined the research group after I did. My self esteem is low because the past 4 years I thought I couldn't retain anything because I was incompetent (my PI criticizing me and chastising me in front of peers definitely didn't help). But now that my memory and comprehension skills are back to normal, I have been going back to study the topics I should already know I am understanding them entirely and actually remembering all of it. Juggling my teaching load, research, getting ready to apply for jobs, and re-studying old material has been difficult to say the least. I really want to take a semester off of research (and postponing job applications) to focus on studying all the material I should already know by now. It would extend my PhD by a semester, but I think this is the only way I would feel like I actually deserve my degree. \n\nJust for some more context: My PI is emotionally immature and retaliates against students who don't follow his advice, so if he doesn't agree with me taking a semester off he will treat me worse than he already does. Currently, he frequently humiliates me in front of my group members by highlighting how little I understand topics. I told him I was recently diagnosed with hypothyroidism but haven't told him what exactly I've been going through as I did in the paragraphs above. I want to tell him but he can be really insensitive so I am obviously hesitant to be vulnerable and open about something so personal. \n\nHas anyone been through anything even vaguely similar? Any advice or insight would be helpful.",
  "author": "memeguzdorch",
  "created": 1636914943,
  "updated": 1637182720,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hkn1b7j": {
      "link": "/r/GradSchool/comments/qtw6jg/should_i_take_a_semester_off_to_study/hkn1b7j/",
      "text": "Having met the requirements for graduation and under a shit-tier PI, don't drag out a bad experience to \"deserve it\". You deserved a better doctor 5y ago, you deserve(d) a PI that isn't vindictive, and you deserve your PhD upon a successful defense.\n\nYou're much better served doing the research which is a more significant part of getting hired than just background knowledge. As you continue experimenting, teaching, and reading, you will catch up just fine.\n\nUnless your PI would be shamed into being a better person I wouldn't divulge cognitive information about yourself.",
      "author": "laziestindian",
      "created": 1636925554,
      "upvotes": 8,
      "replies": {
        "hkxpsj1": {
          "link": "/r/GradSchool/comments/qtw6jg/should_i_take_a_semester_off_to_study/hkxpsj1/",
          "text": "Thank you for saying that. I honestly didn't think of it that way and I can't tell you how much I appreciated reading this, it was something I really needed to hear.",
          "author": "memeguzdorch",
          "created": 1637115426,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkopph6": {
      "link": "/r/GradSchool/comments/qtw6jg/should_i_take_a_semester_off_to_study/hkopph6/",
      "text": "I am in a bit the same boat, but my problem is not only lack of knowledge, but also severe burnout due to lab and also a lot of clutter at home and bad note organization. So I took semester off to manage some. But my PI was quite supportive. I am also in fifth year.",
      "author": "Competitive_Tune_434",
      "created": 1636953509,
      "upvotes": 1,
      "replies": {
        "hkxpvvy": {
          "link": "/r/GradSchool/comments/qtw6jg/should_i_take_a_semester_off_to_study/hkxpvvy/",
          "text": "Sorry to hear you're going through similar to hear, but I am so glad you have a supportive PI. How do you feel after taking the semester off? Did it help?",
          "author": "memeguzdorch",
          "created": 1637115467,
          "upvotes": 2,
          "replies": {
            "hkxrtd7": {
              "link": "/r/GradSchool/comments/qtw6jg/should_i_take_a_semester_off_to_study/hkxrtd7/",
              "text": "I am actually in the process now, in the 2nd month))) of leave. Yes, it helps, but I realized maybe that is not that enough to do all I planned and maybe 1 year might be better))) So I really need to use this time wisely and productively, for what I need to fight my own laziness. Yes, PI was supportive in this, but actually he can be very toxic in the lab.",
              "author": "Competitive_Tune_434",
              "created": 1637116308,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}