{
  "sid": "q29osr",
  "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/",
  "title:": "How should I handle an advisor who wants me to keep doing graduate work after I have graduated?",
  "text": "I recently defended my Ph.D. and am planning on moving to a new city in the coming weeks. I've been so busy with benchwork, writing my dissertation, and preparing my defense that I really haven't had much time to seriously look for a postdoctoral position. In the lull between my defense date and my move date, I was planning to start the job search in earnest, and to organize a few things so it would be easier for the next graduate student to pick them up where I left off. \n\nApparently, my advisor has different plans. They've loaded me up with more than enough benchwork to keep me from getting any sleep between now and the time that I move and they gave me some extra data-analysis tasks to take with me after I leave.\n\nI feel like I would be perfectly justified to just tell them that I'll do as much bench work as I can get done with a reasonable effort before I leave, and to say that I'm not taking any work with me. However, I would really like to stay in my advisor's good graces. I want to land as competitive a postdoc as I can get and I feel like I need a good recommendation from my advisor to get that. On the other hand, I feel like if I continue capitulating to every unreasonable demand from my advisor, it'll never stop, and more importantly, it will eat up time that I should be using to search for a job. I don't want to burn a bridge if I don't have to, and I really feel like I've put up with a lot of abuse to keep this one intact. However, it's seeming more and more like I might just have to burn it if I ever want to get on with my life. I'm wondering if anyone here has any advice.",
  "author": "SatanasLucifer",
  "created": 1633481425,
  "updated": 1634099874,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.98,
  "comments": {
    "hfk30oh": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfk30oh/",
      "text": "Damn yo, that's rough. A reasonable person who also cares about your success would understand that you have to be actively working towards the future right now. Are they generally reasonably? It seems like they have a lot of faith in your skills and may be freaking out about you leaving. Does your lab have $$$? Because that could be another approach. Tell them you're sure they understand that you can't work gratis after you've defended on work that isn't your own. If that works, then set the number of hours you'll work and just work that much, regular employee style. \n\nI dunno, but I get why you would be concerned with burning a bridge. Good luck! And congrats on your defense!",
      "author": "Pr0gr3s",
      "created": 1633487283,
      "upvotes": 13,
      "replies": {
        "hfkm6cn": {
          "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfkm6cn/",
          "text": "Thanks you! I am really excited to be done. He can be reasonable about some things, but some things he is pretty consistently unreasonable about.  He would probably be reasonable about pay, though and that would definitely take some of the pressure off the job hunt.",
          "author": "SatanasLucifer",
          "created": 1633498334,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfk3zw8": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfk3zw8/",
      "text": "I'm not sure if this is applicable for your field, but have you thought of taking an industry/government position instead of a postdoc? They both lead to very fulfilling careers where you'll be respected a lot more than as a postdoc, and will also make a bit more money/have time to enjoy life. It also means that your advisor's recommendation will have less weight (since industries care less about that) in case things go sour. Also, congrats on the defense! I'll be doing mine later this month, and really looking forward to being done with it all.",
      "author": "drizdar",
      "created": 1633487760,
      "upvotes": 8,
      "replies": {
        "hfkmtq7": {
          "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfkmtq7/",
          "text": "Thanks, and good luck on your defense! To be honest, I hadn't really considered a position outside academia much until pretty recently. I really love basic research and teaching, but as I've gotten closer to moving I've really tried to make time to see friends. I hadn't realized before now how long it's been since I've seen most of my best friends. I love research, but I really don't want to have a career where my job is the only thing I have time to care about.\n\nSo, yeah, that is really something for me to consider.",
          "author": "SatanasLucifer",
          "created": 1633498800,
          "upvotes": 3,
          "replies": {
            "hflu80g": {
              "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hflu80g/",
              "text": "I finished my PhD over a year ago. Moved to a different region of the US and took a government fellowship position. I hear through the grapevine that my PI still thinks I'm going to finish a paper of mine, and yet they still haven't emailed or called in over a year. \n\nPutting some physical distance between you may help.",
              "author": "PupperMerlin",
              "created": 1633529846,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfk7ytt": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfk7ytt/",
      "text": "Ugh that is so frustrating. I mean, if you’re willing to do *some* of the work, I think I would aim for a very cordial email to try and lay out a plan so your advisor can temper his expectations. I would probably say that based on your timeline for moving, you won’t be able to get through the suggested work in the time you have left in the lab. I would suggest a very, very reasonable and attainable amount that is realistic for you to get through (and still work on your job applications). Let him know that these select projects are your goal, but you will certainly re-evaluate if you can take on more once that’s completed. Or skip that last part if you think he’ll give you a hard time. \n\nYou truly enjoy working with your advisor, but while you’re job hunting, you would rather have a plan that won’t leave him in a lurch should a opportunity pop up that limits your ability to take on additional tasks once you leave. Once your job plans solidify, you would love to revisit continuing your collaborative work if possible. \n\nIf you don’t want to do any of this additional work, let him know that you’re under a tight deadline to move soon, so you are unavailable to take on additional commitments. You’ll be able to reconnect to collaborate once you’ve settled into a new job, blah blah (if you want).\n\nHopefully a reasoned, logical approach works, but… yeah. Such an approach was not used when the work was suggested. However, you’re being totally fair here, plus you’re being complimentary and appreciative. \n\nCongrats on defending! Best of luck in the job search.",
      "author": "StringOfLights",
      "created": 1633489770,
      "upvotes": 5,
      "replies": {
        "hfknnqs": {
          "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfknnqs/",
          "text": "Thanks! This is probably the best advice. I honestly don't think it's possible for me to finish what's been laid out in the time I have left so I'm going to have to have a conversation along these lines anyway. This seems like a really reasonable approach.",
          "author": "SatanasLucifer",
          "created": 1633499425,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hfk8nxd": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfk8nxd/",
      "text": "Did your advisor sign your dissertation? I don’t know where you are, but I’ve seen advisors get months of free work out of students after their defense by saying that they can’t sign off on the their dissertation until xyz is done. I would tread lightly until you know everyone in your committee has signed off on the final version.",
      "author": "Acrobatic_Future_412",
      "created": 1633490130,
      "upvotes": 6,
      "replies": {
        "hfkndf5": {
          "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfkndf5/",
          "text": "Ugh, that's a terrifying thought! The final version hasn't been signed yet, but I don't think I have to worry about anybody not signing it once I finish the revisions that have already been laid out. So at least I have that going for me.",
          "author": "SatanasLucifer",
          "created": 1633499208,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfkkdrc": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfkkdrc/",
      "text": "I'm assuming your adviser is going to be paying you, right? Because loading you up with free work after you graduate is not okay. I think it might be helpful to discuss how much time you can reasonably devote to the tasks he's \"asking\" you to do. You're going to be busy with other things, so if you have, say, like 20 hours a week then tell him you have a maximum of 10 hours you can devote to these tasks every week. \n\nI work with someone who has a habit of assigning way more work than what is reasonable, but we have a really good relationship and I was able to just be real honest and tell them I don't have enough time, but I did have X amount of time that I was able to devote to these tasks. I then made sure I kept track of every minute I spent, both to make sure that I was keeping my promise but also to set a boundary if some \"last minute\" thing came up. Then I could diplomatically say \"I'm sorry, I've already spent my X hours this week on tasks a, b, and c. I'd be happy to do d for you, but the earliest I can do that is on Monday\".\n\nThe opportunity cost of him asking you to do this is 0, but the potential gain is greater than 0, so of course he's going to ask. In these situations, it's perfectly okay to set a boundary, and if he views setting a reasonable boundary as \"burning a bridge\" then he really wasn't going to give you a good reference anyway.",
      "author": "False-Guess",
      "created": 1633497136,
      "upvotes": 3,
      "replies": {
        "hfkoy24": {
          "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfkoy24/",
          "text": "I think you're hitting at something here. I do think my advisor wants to be reasonable and compassionate, but just doesn't have a realistic expectation of how much work what he asks for really is.\n\nOn the other hand though, I think we have competing interests and when it comes down to it his interests are more important than mine. A large part of the reason he doesn't have a realistic idea of how long things take is because he doesn't want to.\n\nI could be wrong though. I'll have to feel it out.",
          "author": "SatanasLucifer",
          "created": 1633500405,
          "upvotes": 2,
          "replies": {
            "hfl22c5": {
              "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfl22c5/",
              "text": "Yeah this sounds like the person I work with. I really like them as a person, and in their case they are not intentionally trying to overload their students but, like you said, they don't necessarily have a realistic expectation of what can be done in the time allotted. \n\nIf the situation is as I suspect, then I'm sure everything will go smoothly. It's a whole different scenario when one has a selfish adviser who purposely overloads students at the last minute. I've found that keeping careful accounting of my time helps. I used an app on my phone to basically punch in and punch out like I did when I worked in retail. In some cases, my PIs requests were accurate for the time frame given and I overestimated the amount of work that would be required. In other instances, I was right and they were mistaken. Either way, I'm sure you will find the right way to handle it!",
              "author": "False-Guess",
              "created": 1633512204,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfkfxd2": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfkfxd2/",
      "text": "Unless your advisor is offering to compensate you in some way, and assuming the thesis has been through the last set of submission, I don’t think you are under any legal obligation. I completely understand the not wanting to burn the bridge, and it would also be good if you can get a publication out of this work, but you are no longer beholden to this PI. You could negotiate and have him pay you are a post doc. My supervisor did this for me, between finishing and starting my official post doc appointment, saying that she didn’t feel it was ethical to pay me as a grad student any more. Boundaries and their implementations are an important thing we were never taught, perhaps because it’s not in the PIs’ interest to teach them to us",
      "author": "priestess-time",
      "created": 1633494237,
      "upvotes": 2,
      "replies": {
        "hfkoebp": {
          "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfkoebp/",
          "text": "Yes, I've been really bad about setting boundaries. I've always tried to think of myself as the student who does what their told without making a fuss. I'm starting to think that was really more of a way for me to frame my complete lack of a backbone in a more flattering light.",
          "author": "SatanasLucifer",
          "created": 1633499986,
          "upvotes": 1,
          "replies": {
            "hflsmzo": {
              "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hflsmzo/",
              "text": "I wouldn't categorize it as that. I was the same way, and they way I framed it was that it was the way to express gratitude and commitment to the position I had been granted and a chance to learn something. Perhaps in my own misguided way to justify not saying no and setting a boundary. My colleague and PhD student at that time was very helpful and told me that it was okay to say no. I was also fortunate that my supervisor wasn't unreasonable and did not micromanage her students. \n\nI think it might be okay to do the work, but the bottom line is you need to be compensated for your time. While you were still a student, one could argue that your compensation was being able to work towards the degree, but now, beyond the publication, which of course is important, there has to be something in it for you to make the time. You are not an indentured servant",
              "author": "priestess-time",
              "created": 1633529139,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfma6mt": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfma6mt/",
      "text": "That's perfectly fine, be polite, direct, but firm. Let them know how much you think you can reasonably get accomplished. If they dont like it, too bad. If you think they'd be petty enough to tank your reco for something reasonable like this, perhaps you could look for a reco from one of your committee members instead?",
      "author": "SquirrelOnTheDam",
      "created": 1633536544,
      "upvotes": 1,
      "replies": {}
    },
    "hfmws8e": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfmws8e/",
      "text": "Would you be getting paid for this work? Ie are you still on a stipend?",
      "author": "ktittythc",
      "created": 1633546070,
      "upvotes": 1,
      "replies": {}
    },
    "hfo1ovj": {
      "link": "/r/GradSchool/comments/q29osr/how_should_i_handle_an_advisor_who_wants_me_to/hfo1ovj/",
      "text": "Defended my work, drank champagne, went home, packed my apartment, cleaned it, slept on the floor, left the next morning for a new job. They are giving you work because they know you have no where to go. Why a post doc? Going into teaching?",
      "author": "rthomas10",
      "created": 1633564242,
      "upvotes": 1,
      "replies": {}
    }
  }
}