{
  "sid": "fmglik",
  "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/",
  "title:": "Rant: if you can't provide a detailed style guide and a Latex template, you have no business making up a custom paper format for your conference's proceedings",
  "text": "I have no reason why a conference wouldn't want to just use the templates created by the professional editorial staff of their parent organization (like IEEE), but whatever. If you do, give me the actual tools to produce a compliant paper using modern scientific publishing tools instead of requiring your authors to use an inconsistent Word template your secretary threw together in 15 minutes.",
  "author": "TheyreGoodDogsBrent",
  "created": 1584804273,
  "over_18": false,
  "upvotes": 283,
  "upvote_ratio": 0.97,
  "comments": {
    "fl5jjkt": {
      "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl5jjkt/",
      "text": "YES YES YES. A million times yes.  \n  \nWe had a first time conference In February (an amalgamation of 3 previous conferences) that had some incredibly arbitrary 2 column Microsoft word template that was required (and no LaTeX template). I spent so many fucking hours fighting with that awful template just to make all the figures and text format properly. UGH.",
      "author": "eastCoastLow",
      "created": 1584838233,
      "upvotes": 1,
      "replies": {}
    },
    "fl4oeww": {
      "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl4oeww/",
      "text": "Budget, perhaps? They can't pay someone to do it?\n\nI'm trying to be charitable and avoid the alternative of \"does not care\".",
      "author": "stolid_agnostic",
      "created": 1584817862,
      "upvotes": 3,
      "replies": {
        "fl51dpm": {
          "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl51dpm/",
          "text": "There's no reason not to use one of the many existing formats that are well documented though.",
          "author": "PityUpvote",
          "created": 1584826291,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fl4cg7c": {
      "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl4cg7c/",
      "text": "The same goes for schools with strict requirements for thesis formatting that were clearly built from a Microsoft Word template. Bleah.",
      "author": "mathuin2",
      "created": 1584810602,
      "upvotes": 11,
      "replies": {}
    },
    "fl4bc9l": {
      "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl4bc9l/",
      "text": "PREACH!\n\nMy university and doctoral school have a strict set of rules about the appearance of the front and back covers of the thesis (but no regulations about the formatting inside). The problem is that they decided to change the appearance this year and no one can tell me what it should look like exactly. After asking repeatedly I finally got a LaTeX template, which doesn't work as it is missing a few figures / logos... I defended 6 weeks ago and still cannot submit the final version of the thesis to the library, as they won't accept it without the \"proper\" covers...",
      "author": "CovekIzSenke",
      "created": 1584809942,
      "upvotes": 47,
      "replies": {
        "fl4dh3w": {
          "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl4dh3w/",
          "text": "Honestly it feels like this is a time waster to deter cramming",
          "author": "stripedpixel",
          "created": 1584811213,
          "upvotes": 15,
          "replies": {}
        },
        "fl5ccwt": {
          "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl5ccwt/",
          "text": "Screenshot all the BS they want then just \\\\includegraphics\\[width=**Eyeball It**\\]{logo.png}for the figures, just ask someone who submitted a year or two ahead of you for it. Or just spam email every department at the school until one responds with/about the template (arguably contact the PhD program coordinators/secretaries). Though I'm not certain, I can't imagine figures/tables would have changed in the template that much...",
          "author": "ECTD",
          "created": 1584833440,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fl46gg6": {
      "link": "/r/GradSchool/comments/fmglik/rant_if_you_cant_provide_a_detailed_style_guide/fl46gg6/",
      "text": "Thank you. I'm tired of such shit word templates. \"Proficient in Microsoft Word\" rarely means so and the template you produce is bad.",
      "author": "TuckerD",
      "created": 1584806953,
      "upvotes": 70,
      "replies": {}
    }
  },
  "updated": 1634064988
}