{
  "sid": "qd9w2b",
  "link": "/r/GradSchool/comments/qd9w2b/why_are_reference_letters_so_sought_after_in/",
  "title:": "Why are reference letters so sought after in academia?",
  "text": "I actually do know why reference letters are needed especially when applying for scholarships and grants as a grad students, I just find it frustrating. \n\nBecause of how competitive scholarships can be, you most likely have to apply to as many as you can, that you are eligible for, to increase you chances. However, it doesn't help that virtually all of them ask for two to three reference letters.\n\nI find it frustrating because I already feel like I'm bothering profs or individuals who are my go-to for references. It must therefore actually be bothersome if I ask for a reference like five to six times in a year (since there are other non-schorlaship applications that also require reference letters!). What makes it even worse is that you might not get the scholarship so you try again and ask again. At what point do you say okay that's enough scholarships to apply to? Whatever it might be, I can't afford to stay under that limit because I do need the money especially as a grad student.",
  "author": "stephoone",
  "created": 1634879522,
  "updated": 1635185398,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hhmlcgp": {
      "link": "/r/GradSchool/comments/qd9w2b/why_are_reference_letters_so_sought_after_in/hhmlcgp/",
      "text": "It's even worse if you take time off from academia. I started my Master's over a decade after undergrad. I don't know that I could remember a half dozen of my prof's names, let alone track them down, and that's assuming they'd remember me and be willing to write a letter. I managed to scrape together enough from supervisors I'd had since them, finding a manager that could write a coherent paragraph felt like looking for a needle in a haystack. There were definitely scholarships, programs, etc. that I missed out on because I physically couldn't get my hands on enough of them.",
      "author": "BPRoberts",
      "created": 1634914606,
      "upvotes": 3,
      "replies": {}
    },
    "hhmtn1d": {
      "link": "/r/GradSchool/comments/qd9w2b/why_are_reference_letters_so_sought_after_in/hhmtn1d/",
      "text": "Yeah it's definitely a tough conundrum because you seem very mindful of the professors time. What I like to do is to make their job darn easy for them if I am applying to multiple scholarships/internships/pracs, etc. I'll write up an outline of everything that I think would be helpful to include in the letter, a draft of the letter itself (if they are comfortable just taking what I wrote and just editing a couple things), and every instruction and link needed to submit. That way, if they don't want to do much, they can literally take my letter and submit it in to the portal - less then 2 minutes.",
      "author": "the_sleepy_student",
      "created": 1634917953,
      "upvotes": 3,
      "replies": {}
    }
  }
}