{
  "sid": "qzbsbe",
  "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/",
  "title:": "Is it even worth applying to high ranked grad schools?",
  "text": "I'm an undergrad History and Political Science major and I'm starting to apply to PhD programs, and I just wondered if you guys even think its worth it to apply for higher ranked programs? I'm a good student; good grades, research experience, etc. But I go to a small college that doesn't really have a name for itself and I just don't think I \"stand out\" that much. I've thought about applying to programs like the University of Chicago (that's really the big one I'm most seriously considering application to) but I just don't even know if its worth it. I think it is but then again I don't think it is... I don't know I just keep talking myself in circles. What do you guys think? Thanks in advance!",
  "author": "johnGOATner",
  "created": 1637551336,
  "updated": 1637689776,
  "over_18": false,
  "upvotes": 55,
  "upvote_ratio": 0.87,
  "comments": {
    "hllhgo7": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hllhgo7/",
      "text": "You can't get accepted if you don't apply.",
      "author": "offalt",
      "created": 1637551904,
      "upvotes": 202,
      "replies": {}
    },
    "hlllf9f": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlllf9f/",
      "text": "Someone is going to fill the seats there. Don't let your imposter syndrome get in the way before you even start.",
      "author": "milgrammind",
      "created": 1637553877,
      "upvotes": 87,
      "replies": {
        "hlmofup": {
          "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmofup/",
          "text": "What if I didn’t even bother applying to anywhere outside the top 15 schools?",
          "author": "Greenface1998",
          "created": 1637582585,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlllnh9": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlllnh9/",
      "text": "The worst they can do is ghost you or say no. Schools like UChicago don't care where you come from, they want to know that they can teach you to be a good researcher.",
      "author": "DontFeartheTeacher",
      "created": 1637553992,
      "upvotes": 36,
      "replies": {}
    },
    "hllle07": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hllle07/",
      "text": "Bro shoot for the stars. The way to approach applications is in 3 levels \n\n1. Dream/reach school - low chance of getting in, but you could!\n\n2. Schools that you have an okay-good chance of getting into\n\n3. Comfort schools - usually these are lower masters programs or not as competitive PhD programs. You should get into these\n\nOne thing I realized as I’m applying is that, it’s more about fit than qualification. If there is a professor or lab that really ignites passion and fits well with your prior/prospective research, reach out to them! Apply! \n\nYou got it! Good luck buddy",
      "author": "SlothTheScientist",
      "created": 1637553859,
      "upvotes": 49,
      "replies": {
        "hlmtrjm": {
          "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmtrjm/",
          "text": "Do you have any tips for determining which schools are which? I really have no idea what makes a school a reach school when it comes to grad schools besides their rank and maybe their acceptance rate (which is usually hard to find)",
          "author": "dontcry2022",
          "created": 1637586088,
          "upvotes": 3,
          "replies": {
            "hlmvgrq": {
              "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmvgrq/",
              "text": "I'm not the one you responded to, but what I did was create an excel file that listed about 60 schools I was even remotely interested in. I would then research all of these schools to find out the quantitative stuff for admitted students: GRE scores, GPA's, etc. If my scores were significantly higher, I would use conditional formatting to color the cells green. If they were within the range, they would be yellow, and red for if my scores were lower. I also listed a few professors I'd be interested in working with and looked at their recently published articles, and reached out to those professors. Acceptance rate is really hard to find for a lot of programs, because it will often be for the school as a whole, which grad students don't care about. Occasionally it will be buried deep in a department website.\n\nI would apply to mostly greens, a couple yellows, and a handful of reds if I had a good conversation with potential advisers.",
              "author": "False-Guess",
              "created": 1637587091,
              "upvotes": 7,
              "replies": {
                "hlnrdfm": {
                  "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlnrdfm/",
                  "text": "When you reached out to professors what questions did you ask them?",
                  "author": "BioAndBros",
                  "created": 1637601415,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hln2405": {
              "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hln2405/",
              "text": "Talk to faculty about it. They tend to have strong opinions about it (or at least a good lay of the land). And ideally, any professor close enough to write a letter should also be able to help you honestly assess your chances. Not that they will, and often not all of them will know you so deeply, but it's a good sign if you could approach them and ask them about this.",
              "author": "minniesnowtah",
              "created": 1637590630,
              "upvotes": 5,
              "replies": {}
            },
            "hlng9gu": {
              "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlng9gu/",
              "text": "yep yep, these other replies are great advice! I had about 15-20 schools I was interested in. The way I found these schools was simply by going on Google scholar and looking up papers that I found interesting, then finding the lead PI for those papers. I would also speak to those that were writing my LoR and ask if they had any recommendations. I’m not really applying to any reach schools like Stanford, MIT, or anything like that. I’m applying to 6 schools, for me my reach school is Georgia Tech, the program seems the most difficult and is probably the one I’m least likely to get into. But even for Georgia Tech I spoke with professors, graduate students and current researchers. Including Georgia tech I’m applying to 6 programs, 1 reach, 4 normal, and 1 safety. The 4 normal ones aren’t necessarily easier to get into that GT but my relationship with potential PI, and other professors I believe definitely improves my chances. My recommendation is to not really worry about which schools are going to be reach school, comfort schools etc, but really just rank then for yourself. GT is my reach school but is not my #1 choice. Really think about program fit, motivation, and when talking to PIs consider if you’re actually willing to be working with that person for 5+ years. One quick tip I have for talking to PI is, don’t try to use their work as a reflection of what you want to do (no one wants a copy) think about how you can build off of their work, or how your research interests are related to their work/expertise. \n\nSo for now, as you look at programs, don’t worry about reach schools and rank. Find programs that you’re interested in, talk to faculty, talk to your LoR writers, and make a list. From the list, you’ll be able to see later on which ones you consider reach schools. You got it!",
              "author": "SlothTheScientist",
              "created": 1637596919,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hlptwcp": {
          "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlptwcp/",
          "text": "This is good advice. When you decide where to apply also make sure to look at job placement (this can usually be found on department websites).",
          "author": "AdvanceImpressive158",
          "created": 1637633075,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlm001o": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlm001o/",
      "text": "Some wise advice for lots of aspects of life: don't pre-select yourself out of opportunities that you want.",
      "author": "UmiNotsuki",
      "created": 1637562587,
      "upvotes": 15,
      "replies": {
        "hlmtwf0": {
          "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmtwf0/",
          "text": "I needed this. Thank you!",
          "author": "dontcry2022",
          "created": 1637586169,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hllqqg7": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hllqqg7/",
      "text": "Let me preface this by saying I know nothing about your field or PhD programs, for that matter, but I also attended a small, seemingly irrelevant university for undergrad and just happened to apply to the second best program in the country for my field & got in. It’s definitely worth a shot!!",
      "author": "blakerz11",
      "created": 1637556676,
      "upvotes": 10,
      "replies": {}
    },
    "hlmrber": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmrber/",
      "text": "Applying to grad school is literally a crap shoot. Just apply to a number of reach, reasonable, and safety schools, with reasonable being the most.",
      "author": "scientist99",
      "created": 1637584557,
      "upvotes": 11,
      "replies": {
        "hlmu0h7": {
          "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmu0h7/",
          "text": "Tips on how to define reach vs reasonable?",
          "author": "dontcry2022",
          "created": 1637586236,
          "upvotes": 1,
          "replies": {
            "hlmudga": {
              "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmudga/",
              "text": "I can only speak for my field, which are you applying to and I may be able to give some tips. I’m STEM, molecular biology/ biomedical sciences",
              "author": "scientist99",
              "created": 1637586447,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hlqafef": {
          "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlqafef/",
          "text": "Nothing seems ‘safe’ to me 😂😂",
          "author": "Mei-GFY",
          "created": 1637641093,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hllmote": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hllmote/",
      "text": "Do it. My undergrad was at an open-admissions university. They took every student just like a community college (they are were actually a community college until about 15 years before I started). I manage to get into the number two program in my field at one of the top universities in the US (Georgia Tech). You can absolutely do it. And even if you don't? You go to a lower ranked one and still graduate with the same PhD. Overall, it is about program fit rather than program rank.",
      "author": "simonsez5",
      "created": 1637554531,
      "upvotes": 29,
      "replies": {
        "hlnaf4i": {
          "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlnaf4i/",
          "text": "The last part about fit is very important, and it goes both ways (it's important to the faculty evaluating that you are a right match). I am now faculty in a history department with a PhD program that is relatively competitive for my field. When evaluating grad admissions, the top questions for me are\n1) do they have an interesting/promising and well thought out research agenda?\n2) even if they don't seem to have solid training due to circumstance, do they seem independently motivated (personally engaged in doing research, etc)\n\nWhat school they came from is at the very bottom of my list. In fact, and this is just a personal bias,  I think given 2 students in the same ranking in terms of what I perceive as their research potential, I tend to look more closely at the one from a less prominent school because I feel they had to perhaps go more out of the way to achieve their intellectual agenda. But that's more of a personal bias to correcting elitism in academia\n\nMy experience: applied to 5 programs, got into the no. 1 ranked for my field, got rejected by all others including my backup school. \n\nThere's always a lot of randomness you are unaware of and have no control over (relevant faculty not taking students that year because they admitted someone in that area last year, someone going on sabattical, etc). Contacting faculty you want to work with might help filter out some of those cases for you.\n\nSo yea, I would say apply high BUT also apply widely. If cost of applications is a concern, always ask grad admissions at the university if they will waive the fee. They often do apparently\n\nEDIT: GRE scores are not something I care about either... It's all about do they seem to be have a good/innovative research agenda and do they seem motivated to pursue it (have worked on their field beyond classes)",
          "author": "marxist_redneck",
          "created": 1637594455,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hln22fs": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hln22fs/",
      "text": "I applied to a PhD in history at UChicago a few years ago.\n\nI am british and did my undergrad at a college in London that is specifically for mature students and doesn't admit based on school results but their own admissions process. Basically  the uk equivalent of the SAT is irrelevant to them, but if you do a good essay and interview they give you a chance. It's a good, respected college, and part of London university, but it's definitely a non-traditional school and one that, let's say, may not be as highly regarded by admissions boards as some other schools.\n\nFWIW, I didn't get into UC's PhD program, but I did get into their Social Sciences MA program, and from there reapplied to PhD and got into Northwestern (UChicago didn't have a program that suited the nature of my work/research by that stage.)\n\nI should note that this was the kind of program focused on by the big, much-discussed, recent article that talked about MA programs tending to be money spinners for the university, but I loved it, it helped me figure out what I want to do research wise, helped me prepare my PhD applications to a high standard, and was generally a good thing\n\nbut I agree with all the comments - they can't admit you if you don't try. also, with UC specifically there are these other options available. I would suggest that UC (and other schools) probably won't care much about the name of the university you're at, but about your potential. also, these are university admissions folks, they know all the universities from which people are applying to them, even if they're small, not well known.\n\none other thing I'd add is about this statement you make:\n\n>I just don't think I \"stand out\" that much\n\nSo MAKE yourself stand out! the real key to getting accepted to a program is almost certainly not the school you're at or even your GPA so much as your personal statement. yes, the GPA matters at some level, they're not going to take someone with consistent B- or whatever, but the personal statement of the application is the thing they'll focus on. they want to know how you think, what your potential for analysis is, whether your research ideas have potential, and also how well you write.\n\nAt my Northwestern interview one of the faculty pointed out a specific phrase I'd written in my writing sample and that had piqued her interest enough to want to admit me. a couple of years later, a member of my Northwestern dissertation committee told me that when they're thinking about admissions, the personal statement comes first, then the writing sample, then the GPA. so if you think you don't stand out in terms of grades, extracurriculars and so on, tailor your statement to show what you think you CAN do. show them how your mind works, show them you are excited about a particular topic, and show them you can write analytically.\n\nTL;DR: do it! you can! but there are ways to think about how you do it that can increase your chances and make yourself stand out as a good candidate - good luck!!!",
      "author": "coyotesandcrickets",
      "created": 1637590609,
      "upvotes": 6,
      "replies": {}
    },
    "hlm3hb6": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlm3hb6/",
      "text": "Yes!! I applied for a school that was #1 in my field and somehow got in. My best friend here did the same and also came from a smaller/not name-brand university. Good luck!",
      "author": "arienroach",
      "created": 1637565109,
      "upvotes": 4,
      "replies": {}
    },
    "hlmomh1": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmomh1/",
      "text": "I just had a mentor talk me into applying to more higher ranked programs and I really support it! The way she put it: all programs are hard to get into give the low number of spots vs. high number of applications. At least at prestigious schools they can offer generous funding packages if you do get accepted.",
      "author": "mickmausclubhouse",
      "created": 1637582716,
      "upvotes": 6,
      "replies": {}
    },
    "hlmudq9": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmudq9/",
      "text": "Absolutely. I didn't think I had a chance of getting into it and it ended up being the only program I was accepted in to. Moral of the story: apply to more than 4 grad schools and don't be afraid to apply to the highly ranked ones.",
      "author": "hakeemalajawan",
      "created": 1637586452,
      "upvotes": 3,
      "replies": {}
    },
    "hlm1sbx": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlm1sbx/",
      "text": "The Ivy's gave no dearth of applicants from very small schools. The trick with a social science PhD is to find the right supervisor. You need someone in the faculty interested in your ideas and the work you're doing. That's how you build your shot of getting in. Beyond just thinking about \"rank\" you want to focus on where you see your research ideas going and who might be a good person to work with to pursue those ideas. I'm not saying rank is irrelevant. Certainly going to Princeton matters more than going to NYU. But between Princeton and Chicago, it's more a function of finding the right supervisor.\n\nSo don't assume you're not viable just because you're from a smaller university. What matters is your SoP, your writing and your ideas for research. Reach out to faculty and figure out who you would be a good fit to work with.\n\nPS: Though you've left it far too late to do it this admission cycle. I'm assuming you're thinking of making these decisions for next year.",
      "author": "boringhistoryfan",
      "created": 1637563859,
      "upvotes": 6,
      "replies": {}
    },
    "hln699f": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hln699f/",
      "text": "Applied to a high ranked one, i got rejected, but i did get some feedback on my rejection, which helped me tailor my application better for a medium rank one which was due few months after. It is not just about getting in, but also the process.",
      "author": "NeuroticKnight",
      "created": 1637592600,
      "upvotes": 2,
      "replies": {}
    },
    "hlna5bl": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlna5bl/",
      "text": "Not only should you apply to top schools, but I’d recommend only applying to top schools. Frankly a PhD in history or political science (my two fields, I know your pain), from a non-top-15 or so program isn’t worth a whole lot on the academic job market these days. Read [this article](https://slate.com/human-interest/2015/02/university-hiring-if-you-didn-t-get-your-ph-d-at-an-elite-university-good-luck-finding-an-academic-job.html) if you don’t believe me. Basically a preponderance of all professors went to the same 10 or 15 grad schools. Unfortunately if you don’t go to one of those, you’ll have an extremely difficult time finding work afterward, and frankly you’ll have a hard time anyway.\n\nNow for the encouraging part. Absolutely apply!! I went to a state school with open enrollment that’s completely unknown in my undergrad field and doesn’t even offer a major in my graduate field. I got terrible grades and dropped out for several years. I got better grades, and most importantly did some really cool research, and I got into a top-10 masters program! \n\nThat’s another thing, if you’re absolutely set on doing a PhD but you don’t get into one of the top ranked programs, go for an MA at a lower ranked program. I’d advise against paying out of pocket for it, but lots of smaller state schools will offer funded MA programs in history and poli sci. That’s a great way to build your CV. One of my friends did exactly that, went to a middle tier school for undergrad in history, then went to a small state school who funded his MA, then went onto complete his PhD at the top program for his sub field. This dude turned Harvard down.",
      "author": "ThrowawayHistory20",
      "created": 1637594337,
      "upvotes": 2,
      "replies": {}
    },
    "hlnb3j2": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlnb3j2/",
      "text": "Honestly it just depends what the standard of qualifications is within your field. That’s not to be confused with what they state on their page, but rather what it is in reality behind the scenes (ie they might say that you need at least a 3.0 to apply, but in reality they won’t consider anyone below 3.6… stuff like that). Unfortunately there’s a massive lack of transparency in these processes, so unless you know someone who sits on the selection committee, you’re likely out of luck.\n\nSpeaking for myself, applying to neuroscience PhDs, the bar of standard is loosely: 3.6 gpa, at least a year of full-time research experience post-graduation, one coauthored paper _at the minimum_, essays that are so well polished and articulated that they could be published in the New York Times, and three letters of recommendation that make Jesus himself look like Satan by comparison. I’m not joking. Schools get 5-700 applications per year for 12 spots. People usually get in either because they’ve _effectively_ already done a PhD (ie their qualifications are sky high) or they know someone. It’s frankly quite demoralizing to think about. I’ve definitely lost myself more than a few times tugging too hard on that thread. As an aside, therapists can help a lot if you get to this point. If you do, please don’t be stubborn: take care of yourself and get help. Good lord, therapists help so much! \nBut I digress…\n\nMy advice: just apply. Worst thing that can happen is they say no, you lose $80, and you get experience writing about who you are, what you have done, and where you want to go (which can be quite enlightening sometimes, especially if that’s the first time you’ve laid it out explicitly). Maybe you’ll get some interview practice too! The flip side is that they judge you to be well matched to their program and you get in. Like I said, just try.\n\nBest of luck!",
      "author": "TheWiseGrasshopper",
      "created": 1637594750,
      "upvotes": 2,
      "replies": {}
    },
    "hlmdtk6": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmdtk6/",
      "text": "I spoke to a lot of grad departments when I was choosing my undergrad. Just apply, it doesn't matter as much as you might think it does.",
      "author": "catecholaminergic",
      "created": 1637573717,
      "upvotes": 1,
      "replies": {}
    },
    "hlmsqv4": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmsqv4/",
      "text": "If your worried about standing out I would recommend reaching out to the department so they know who you are when you apply, spebd a little extra time making your personal statement strong and try to make sure you are getting faculty recommendations from professors who know your work and think highly of you.",
      "author": "94sHippie",
      "created": 1637585458,
      "upvotes": 1,
      "replies": {}
    },
    "hlmuxuz": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmuxuz/",
      "text": "Some of the best advice I was ever given was from the guy who hired me for a job, who said \"don't tell yourself no, let them tell you no\". \n\nMy advice would be to spread out your applications. I applied to maybe 12 schools, 3-4 of them were kind of \"reach schools\" while the rest were, I thought, safety schools. I ended up getting rejected from all the programs I thought I could easily get into, but got into almost all of the programs I thought were a medium/long shot. It wasn't a guarantee, of course, but as other's said, if you don't even apply, then you can't attend.",
      "author": "False-Guess",
      "created": 1637586785,
      "upvotes": 1,
      "replies": {}
    },
    "hlmvzuy": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmvzuy/",
      "text": "I think a good ratio is 10 percent super reach, 60 percent reach and the rest are schools you can easily get into but you'd be happy to go.  Imo don't apply to a school if you really don't wanna go",
      "author": "SpliffMaster489",
      "created": 1637587395,
      "upvotes": 1,
      "replies": {}
    },
    "hlmz8pn": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmz8pn/",
      "text": "I'm about to do the exact same thing. Go for it, you miss 100% of the shots you don't take",
      "author": "grumpy_flareon",
      "created": 1637589170,
      "upvotes": 1,
      "replies": {}
    },
    "hlmzz2x": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlmzz2x/",
      "text": "I went to one of the smallest colleges imaginable for undergrad, like it was only two buildings, and I got into the top school in my field and literally only applied there. You should try!! Small schools rule for undergrad",
      "author": "honeybee333-",
      "created": 1637589555,
      "upvotes": 1,
      "replies": {}
    },
    "hln3558": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hln3558/",
      "text": "I thought I was being ridiculous when I applied to my reach school, but I ended up getting in, fitting in, and having a great experience.",
      "author": "MercuriousPhantasm",
      "created": 1637591137,
      "upvotes": 1,
      "replies": {}
    },
    "hln6vt2": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hln6vt2/",
      "text": "Yes. The worst they can do is say no.",
      "author": "Crazyblazy395",
      "created": 1637592883,
      "upvotes": 1,
      "replies": {}
    },
    "hlnfvme": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlnfvme/",
      "text": "I'm at an R1 (university of CA) and we have many grad students who came from smaller \"unknown\" schools",
      "author": "rawrpandasaur",
      "created": 1637596761,
      "upvotes": 1,
      "replies": {}
    },
    "hlngltw": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlngltw/",
      "text": "I went to a state school for my undergrad (political science) and went to Georgetown for my graduate program (cybersecurity). Lesser known schools are known regionally and may only get your hired in that area. Famous schools are known nationally and could possibly get you a job anywhere. The fact I graduated from Georgetown was brought up by the state school’s admission board where I got accepted for my doctorates. It was also brought up in job interviews as being “impressive.”\n\nYour mileage may vary. Good luck!",
      "author": "SirSuaSponte",
      "created": 1637597060,
      "upvotes": 1,
      "replies": {}
    },
    "hlnp4qq": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlnp4qq/",
      "text": "You gotta shoot high, but perhaps for you that's middling. I don't know your gpa or test scores so I have no idea.",
      "author": "iamjacobsparticus",
      "created": 1637600516,
      "upvotes": 1,
      "replies": {}
    },
    "hlnyvmj": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlnyvmj/",
      "text": "Yeah why not? Apply.",
      "author": "soundstragic",
      "created": 1637604362,
      "upvotes": 1,
      "replies": {}
    },
    "hlo1vyf": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlo1vyf/",
      "text": "I graduated from a little liberal arts college. I’m currently a PhD student at Harvard, and was also accepted to Berkeley and Stanford among others when I applied. There is nothing to be afraid of.",
      "author": "struggleknot",
      "created": 1637605555,
      "upvotes": 1,
      "replies": {}
    },
    "hloiu1m": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hloiu1m/",
      "text": "Many top schools have students from small schools. I’m in a top program for my specific field, and we have people working for top notch PIs who went to unknown undergrads. They are also fantastic and highly skilled researchers! They care about the person, not the pedigree.",
      "author": "cd131722",
      "created": 1637612353,
      "upvotes": 1,
      "replies": {}
    },
    "hlp5xhx": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlp5xhx/",
      "text": "You should for sure apply!!!",
      "author": "goldenmountainbork",
      "created": 1637621937,
      "upvotes": 1,
      "replies": {}
    },
    "hlpt9jw": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlpt9jw/",
      "text": "Absolutely apply, why not? If you get in, great! If not, apply to a lot of others to give yourself several options. Let your work / research and drive be the thing that makes you stand out above the rest.",
      "author": "kaywrennn",
      "created": 1637632788,
      "upvotes": 1,
      "replies": {}
    },
    "hlqekt5": {
      "link": "/r/GradSchool/comments/qzbsbe/is_it_even_worth_applying_to_high_ranked_grad/hlqekt5/",
      "text": "Sure why not. I initially didn't aim for anything beyond my undergrad but the professor I was doing research for suggested I apply to a top-5 program and I did it on a whim not thinking much of it. I got accepted there anyway. Though, I later left that program and came back to an advisor at my undergrad that I was a much better fit for and I still think I made the right decision after 5 years.",
      "author": "eng2016a",
      "created": 1637643432,
      "upvotes": 1,
      "replies": {}
    }
  }
}