{
  "sid": "r2w4nc",
  "link": "/r/GradSchool/comments/r2w4nc/personal_statement_w_mental_illnesses/",
  "title:": "Personal Statement w/ mental illnesses",
  "text": "I am in the process of writing my personal statement which includes my struggle with mental illnesses  (ADHD and ASD) that were amplified during the pandemic. However, those sentences are scattered, few, and not my main points because I wasn't self-aware or I'd forget about it instances until 2 years ago when I actively tried to figure out what was going on with me. How do you include details about this in a way that strengthens your application?\n\nMajor: Biology",
  "author": "SydJan",
  "created": 1637958708,
  "updated": 1638208007,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hm71mnh": {
      "link": "/r/GradSchool/comments/r2w4nc/personal_statement_w_mental_illnesses/hm71mnh/",
      "text": "It may vary depending on the discipline, but grad school applications aren't interested in intimate details on struggle in contrast to undergrad apps where this would belong as part of a well-balanced essay. I'd encourage you to emphasize the coursework that's prepared you to be successful, your research interests mentioning the relevant faculty there, along with a vague and very brief explanation of how the pandemic affected your academic performance. I don't mean to minimize your personal experience as I do genuinely feel for you in these strange times, I just don't know that the people reviewing your application will be so interested as all applicants have been impacted by the pandemic to some extent.",
      "author": "saturnineoranje",
      "created": 1637959791,
      "upvotes": 23,
      "replies": {}
    },
    "hm74z7h": {
      "link": "/r/GradSchool/comments/r2w4nc/personal_statement_w_mental_illnesses/hm74z7h/",
      "text": "From my experience personal statements should void away from anything personal, especially health. A tiny bit about background could be helpful but only if it’s like one sentence and leads to show how it has helped you remained disciplined and motivated",
      "author": "koala-butt",
      "created": 1637961345,
      "upvotes": 11,
      "replies": {}
    },
    "hm72zfw": {
      "link": "/r/GradSchool/comments/r2w4nc/personal_statement_w_mental_illnesses/hm72zfw/",
      "text": "Leave those out.  No one on the admissions committee gives a crap.  They want to see that you’re motivated and competent to be accepted instead of seeking sympathy.  You should be showing why they should admit you by demonstrating knowledge of their program and what you plan to do with the degree.\n\nYour problems may be unique to you but everyone has life struggles.",
      "author": "tenyearsgone28",
      "created": 1637960421,
      "upvotes": 14,
      "replies": {}
    },
    "hm79z24": {
      "link": "/r/GradSchool/comments/r2w4nc/personal_statement_w_mental_illnesses/hm79z24/",
      "text": "I think it depends on the prompt for the statement. For some schools I applied to, the prompt specifically asked me to talk about struggles I’ve faced, diverse identities etc. I would say if the prompt for yours is similar, you could bring ADHD and ASD into it, but I would be careful to do it in a way that makes it look like a strength. For every challenge you write about, write about a success story or strength. \n\nI just got diagnosed with ADHD and ASD myself, and there are a lot of strengths that we have, even though we struggle more than neurotypical people. Like other commenters have said, admissions committees can be pretty ableist at times, so just be careful about how you include this, and if it seems irrelevant to the statement prompt, maybe leave it out.",
      "author": "orvilleshrek",
      "created": 1637963649,
      "upvotes": 5,
      "replies": {}
    }
  }
}