{
  "sid": "rf765n",
  "link": "/r/GradSchool/comments/rf765n/whats_a_goodbad_gpa_for_grad_school_geology/",
  "title:": "What's a good/bad GPA for Grad school ? (Geology)",
  "text": "Hi, I am currently in my 2nd year of my MS in geology, and I am done with classes after this semester. I have a 3.96 after 25 credits which i am very proud of since my undergrad GPA (in math) was a lowly 2.82. I am worried about one class this semester: Advanced Fluid Dynamics. It's outside of my department and although i have a math background it's still quite confusing at times. Final exam still pending, I think I will end up with a B+, which would bring my GPA down to 3.9.   \n\n\nI am currently applying for a PhD Program at my school, and my advisor has indicated to me that they will be nominating me for a potential presidential fellowship, which sounds amazing. I am really worried about my fluids grade though, and if not having a 4.0 will hurt my chances of being awarded this fellowship or if it might be detrimental later on in my life. \n\nI was just wondering what's considered a \"good\" gpa for a PhD application? does my current gpa matter as much as i think it does or am i being too hard on myself ?",
  "author": "Analysis_mode27",
  "created": 1639369923,
  "updated": 1639518482,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hoce52m": {
      "link": "/r/GradSchool/comments/rf765n/whats_a_goodbad_gpa_for_grad_school_geology/hoce52m/",
      "text": "Since you’re doing your masters, your undergrad won’t matter that much, if at all, and your masters gpa is fine! That being said, your gpa certainly isn’t the most important thing for a PhD application. Your research experience, statements, and letters of recommendation are far more important. Hope this helps, and if you have any other questions feel free to pm me!",
      "author": "physics_masochist",
      "created": 1639371683,
      "upvotes": 2,
      "replies": {}
    },
    "hoddxwf": {
      "link": "/r/GradSchool/comments/rf765n/whats_a_goodbad_gpa_for_grad_school_geology/hoddxwf/",
      "text": "You’re being too hard on yourself. Did you learn useful things in the class?\n\nI think I had a 3.6 in undergrad, and 3.7 in MS. No problems at all getting into PhD. Plenty of fun to be had outside of class and writing. \n\nFellowships are a weird thing. Seemed like it was for perfect test scores and GPA, and to be honest, who wants to hang around those guys, anyway? LOL I always heard stories of guys taking a whole semester or year off to study for the GRE. Insane, and defeats the purpose.",
      "author": "cropguru357",
      "created": 1639398501,
      "upvotes": 1,
      "replies": {}
    }
  }
}