{
  "sid": "qdorzh",
  "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/",
  "title:": "Transcribing... 50 interviews help!",
  "text": "I finally completed my data collection! I did 50 interviews for my research study. The average interview length is 1.5 hours. However, some of my interviews are 4 to 6 hours in length. I tried to transcribe finished interviews in between interviews but I usually winded up exhausted after talking to someone for 1.5 hours. So now I have a bunch of audio to transcribe... Any tips or tricks on how to get through this next hurdle? What sort of programs did you use to help you transcribe? Also, how to stay motivated throughout all this without losing my mind would be greatly appreciated! Thanks ya’ll!",
  "author": "Mammoth-Management",
  "created": 1634932215,
  "updated": 1635185379,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hhny4qa": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhny4qa/",
      "text": "You can use a website like [Temi](https://www.temi.com/) to get a rough transcription so that you only have to clean up the transcripts rather than create them from scratch. You can also use [Rev](https://www.rev.com/), but that costs $1.25/minute so unless you have grant money or something, it seems like that'd get pretty pricey rather quickly. As an undergrad, I really liked using [HyperTranscribe](http://www.researchware.com/products/hypertranscribe.html) to create transcripts from scratch ($99 for a [student license](http://www.researchware.com/sales/pricing/educational-pricing.html)). Feel free to PM me if you have any questions.",
      "author": "sanityisrelative",
      "created": 1634934498,
      "upvotes": 14,
      "replies": {
        "hhpqi5n": {
          "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhpqi5n/",
          "text": "I used something similar called otter.ai. I think they have a monthly subscription for like $30.",
          "author": "srein1016",
          "created": 1634969057,
          "upvotes": 2,
          "replies": {
            "hhqunaz": {
              "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhqunaz/",
              "text": "Otter.ai is what I used, too. Granted I only had 2 30-minute ones, but it still worked decently. All I really had to clean up was acronyms and fill in if the interviewee trailed off at the end and didn't get picked up by Otter.",
              "author": "RunningDrummer",
              "created": 1634999906,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhnza7q": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhnza7q/",
      "text": "I found it worthwhile to get the Express Scribe software and a foot pedal.\n\nI was also able to work with undergraduate RAs who got course credit for helping me with research, including doing transcription. Even if that's not an option exactly for you, you might consider ways to partner with collaborators to split the work.",
      "author": "ucscpsychgrad",
      "created": 1634934992,
      "upvotes": 7,
      "replies": {
        "hhpacgw": {
          "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhpacgw/",
          "text": "Came here to say this exact thing. I'm doing this right now too!",
          "author": "seaside1508",
          "created": 1634958467,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhodkw7": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhodkw7/",
      "text": "I've had good results with Trint. Most services charge by the minute, but Trint is a flat fee monthly. I signed up for a single month subscription ($75 I think) and did all my transcriptions in one go and cancelled my sub",
      "author": "tmonday",
      "created": 1634941536,
      "upvotes": 5,
      "replies": {}
    },
    "hhqn6r2": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhqn6r2/",
      "text": "Please make sure you review the data security of the different options if your interviews are sensitive. In Europe you would have to with GDPR.",
      "author": "Slothygirl",
      "created": 1634995245,
      "upvotes": 5,
      "replies": {}
    },
    "hhoiybb": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhoiybb/",
      "text": "I don't know how much it costs but we used otter.ai in my previous lab. You have to go through and correct things, for sure, but it gives you a solid skeleton of the conversation. I also don't know if it works with a foot pedal but I would highly recommend one - I used the space bar for quick pause/play and it got old pretty quickly.",
      "author": "Lucky-Reporter-6460",
      "created": 1634944211,
      "upvotes": 3,
      "replies": {}
    },
    "hhnxa6g": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhnxa6g/",
      "text": "I've used Wreally a bit but it only works if you have good audio quality and your interviewees don't mumble like mine did lol. But it does have a 30 sec. preview option to see if it's transcribing well before you commit to paying for it. You can also let it transcribe and go back and fit bits. You could consider investing in a transcribing peddle to make it easier.\n\nIf you have the money you could also consider getting someone else to transcribe some of them professionally for you.\n\nHonestly just take it slow. Transcribing takes so much more time than you would think. I've also been coding themes/topics by color and highlighting or bolding important things I definitely want to remember in the transcript.",
      "author": null,
      "created": 1634934134,
      "upvotes": 2,
      "replies": {}
    },
    "hhodyu3": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhodyu3/",
      "text": "If you have kaltura, you can upload audio files to it and it will use the same technology that zoom uses (otter.ai) to transcribe. It's not perfect but it absolutely helps.",
      "author": "nemicolopterus",
      "created": 1634941723,
      "upvotes": 1,
      "replies": {}
    },
    "hhpogr7": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhpogr7/",
      "text": "Amazon S3 Transcribe. Upload the file, download the transcription text.",
      "author": "bornsupercharged",
      "created": 1634967442,
      "upvotes": 1,
      "replies": {}
    },
    "hhqt1vr": {
      "link": "/r/GradSchool/comments/qdorzh/transcribing_50_interviews_help/hhqt1vr/",
      "text": "If you can pay a bit, Temi saved my sanity",
      "author": "Palex9",
      "created": 1634998973,
      "upvotes": 1,
      "replies": {}
    }
  }
}