{
  "sid": "q4hv1p",
  "link": "/r/GradSchool/comments/q4hv1p/academic_conferences_during_covid_thoughts/",
  "title:": "Academic conferences during COVID. Thoughts?",
  "text": "I’m excited that two of my papers got accepted in a conference in Paris next year. This is my first time and I’m very much looking forward to presenting. However, I’m having major second thoughts about traveling and attending a big gathering (even an academic one) like this especially with the pandemic still raging. \n\nWould attending be worth the risk?",
  "author": "guacam0le_018",
  "created": 1633771364,
  "updated": 1634099804,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hg172l3": {
      "link": "/r/GradSchool/comments/q4hv1p/academic_conferences_during_covid_thoughts/hg172l3/",
      "text": "Only you and your healthcare provider can answer that.",
      "author": "Quant_Liz_Lemon",
      "created": 1633817578,
      "upvotes": 4,
      "replies": {}
    },
    "hg27olb": {
      "link": "/r/GradSchool/comments/q4hv1p/academic_conferences_during_covid_thoughts/hg27olb/",
      "text": "I'm surprised there is a (what sounds like a big) in person conference atm. I know the conference I was scheduled to present at was changed to an online format last month. \n\nIt's honestly your decision on whether you want to go. Perhaps you could discuss it with an advisor or doctor. Could you look at infection rates in Paris? It may help you make a decision",
      "author": "Perses_Garden",
      "created": 1633835831,
      "upvotes": 1,
      "replies": {}
    },
    "hg3a1vg": {
      "link": "/r/GradSchool/comments/q4hv1p/academic_conferences_during_covid_thoughts/hg3a1vg/",
      "text": "I would hope that by next year the pandemic situation will be much much better.\n\nA few in person conferences have already started again in Europe (some even without a virtual-participation option) and international travel within europe is most of the way back to normal again for vaccinated people. By now in much of europe you need a vaccine certificate to take part in everyday life - not only conferences but also restaurants, leisure facilities etc",
      "author": "nickbob00",
      "created": 1633863599,
      "upvotes": 1,
      "replies": {}
    }
  }
}