{
  "sid": "rbniw4",
  "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/",
  "title:": "How do you manage school and work without dropping your gpa?",
  "text": "This semester my college decided to let us go back to campus and there were a lot of adjustments and the exams were completely different from we used to for the last year and a half. My gpa dropped quite badly, going from 90.5% to 89% (I'd need 3As to come back to a 90%). Next year I'm starting an intership, so I was wondering how can I maintain my gpa but be working at the same time? How do you manage time? I'm afraid I won't make it to the grad school I want to.",
  "author": "asdfvbmm987",
  "created": 1638955747,
  "updated": 1639518595,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hnpo4vy": {
      "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnpo4vy/",
      "text": "“My gpa dropped quite badly, going from 90.5% to 89%”\n\nSometimes I wonder if everyone coexists with me on the same plane of reality",
      "author": "gradthrow59",
      "created": 1638968660,
      "upvotes": 15,
      "replies": {
        "hnpxws3": {
          "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnpxws3/",
          "text": "I got all Bs this semester, and the diplomas with honors go to those with 90% or more. Since I come from a third world country, I suppose that applying to a grad school abroad will be more difficult. My worry is that going back to a gpa of 90% I'll need to have A in at least 3 subjects, and I'm not sure if I'll make that.",
          "author": "asdfvbmm987",
          "created": 1638973672,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnp8xxb": {
      "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnp8xxb/",
      "text": "Set a schedule at the beginning of the week, reward and punish yourself according to schedule. Done.",
      "author": "ItsChitznGiggles",
      "created": 1638957416,
      "upvotes": 3,
      "replies": {
        "hnpy07m": {
          "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnpy07m/",
          "text": "This seems like an effective way, thank you!",
          "author": "asdfvbmm987",
          "created": 1638973717,
          "upvotes": 1,
          "replies": {
            "hnrb8mo": {
              "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnrb8mo/",
              "text": "I was a bit drunk so I don't remember posting this lol I'm still right though\n\nTake it week by week - my classes go Mondays-Sundays. Each Monday, I plan out my schedule. Everything that I have to get done each day. I include study times for classes and what \"study times\" mean. Be specific for each daily goal. Then every time I complete a specific task, I reward myself with candy. At the end of the week, I reward myself with a coffee date. If you are late to your tasks, make yourself do push-ups (that's what I do). You can even make rewards and punishments happen on different intervals, so task, hour, day, week, etc. The more you do this and consistently, you will train yourself. But you have to be consistent.",
              "author": "ItsChitznGiggles",
              "created": 1638993179,
              "upvotes": 2,
              "replies": {
                "hnscjya": {
                  "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnscjya/",
                  "text": "This is a great idea, thanks a lot!! :)",
                  "author": "asdfvbmm987",
                  "created": 1639008137,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnr4rg4": {
      "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnr4rg4/",
      "text": "Edit: sorry, I'm an idiot I realized you're an undergrad applying to grad school not, in grad school. Will leave my previous post below. Just make sure you're not killing yourself for something that doesn't matter too much. If your GPA is high enough, then losing sleep over 89 to 90% is not worth it. Your grad school application is way more than your GPA\n\nHonestly? I let it dip. It's grad school, I don't technically \"need\" an A. Life is easier that way and it means I focus on the things that are important; research and work. My early grad school grades were mostly A's, my late grad school grades were mostly B's. I got a job in industry and it's worked out well so far.",
      "author": "AMostAverageMan",
      "created": 1638990719,
      "upvotes": 3,
      "replies": {
        "hnscq0g": {
          "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnscq0g/",
          "text": "Thanks a lot for the insight! Yes, I should start thinking more about other things beyond gpa, thank you! :)",
          "author": "asdfvbmm987",
          "created": 1639008214,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnrxoel": {
      "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnrxoel/",
      "text": "The thing that's helped me the most is ensuring you start any school obligations (whether it be studying, project or assignment work, etc.) almost immediately, and progress to the point where you know for almost absolute certain how long that obligation is going to take. Guessing or assuming leads to panicked and rushed work or all-nighters at best. \n\nBalancing work and school is hard, and it's much easier to do if you 'assess' how much time you need for something up front, frequently just by getting started on it. At that stage, if you're honest with yourself and learn to get a good idea of what you can do in a set amount of time, you can choose when something can be tabled, or when you need to be working on it *now*.\n\nThis helps to avoid the worst part of working and attending school at the same time, in my opinion -- when you know (or rather, have just realized) you're behind, and have to get through the work day before you can even begin to try to catch up.\n\nEdit: Forgot a word.",
      "author": "Crimsonial",
      "created": 1639001792,
      "upvotes": 2,
      "replies": {
        "hnscvet": {
          "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnscvet/",
          "text": "This is a great advice, I'll take it into consideration, thank you!!",
          "author": "asdfvbmm987",
          "created": 1639008282,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnp9uc4": {
      "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/hnp9uc4/",
      "text": "Give up on tv and your social life.",
      "author": "Naivemlyn",
      "created": 1638958229,
      "upvotes": 0,
      "replies": {}
    },
    "ho028j3": {
      "link": "/r/GradSchool/comments/rbniw4/how_do_you_manage_school_and_work_without/ho028j3/",
      "text": "If the exams were different from those that were, then maybe you can still adapt to the new requirements and you have not had time to do this yet. With regard to work and study at the same time... it is always difficult here. You will either work poorly and / or study, or you will fizzle out very quickly and may catch depression and burnout. You should consider what is your priority. I have a subreddit where you can ask a question and join :) г / grademiners\\_essay\\_",
      "author": "ElinGerry",
      "created": 1639152849,
      "upvotes": 1,
      "replies": {}
    }
  }
}