{
  "sid": "pv2ajt",
  "link": "/r/GradSchool/comments/pv2ajt/phd/",
  "title:": "PhD?",
  "text": "I’m about to wrap up my masters this year. For some background: I did a three year undergraduate degree (a BA Honours) in the best possible public university in my home country, worked as an RA for six months (in my field of interest) immediately after and am now completing a one year MSc in the same discipline at a reputed university in Europe. \n\nThat makes 4 years of education, 6 months of relevant work experience. I do want to directly do a PhD but I realise I will not be able to do my applications simultaneously with my masters, so maybe I will finish this degree in 2022 and apply for 2023 intake. \n\nShould I wait longer? Maybe get a job or study more and then apply for a PhD? \n\nAnd what would be the process to apply for a PhD in Europe since it’s super unclear on how to go about this and how is it different from applying to the US/Canada? \n\nSorry if I sound clueless, I’m trying to figure out how to plan my academic career (if there will even be one!)",
  "author": "soangsty",
  "created": 1632556313,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "he99gtk": {
      "link": "/r/GradSchool/comments/pv2ajt/phd/he99gtk/",
      "text": "If you can get a job related to your field of interest, that might provide a slight boost for when you apply to graduate school for the PhD. And then also give you a better idea of what you want out of a PhD.",
      "author": "raistlin65",
      "created": 1632598553,
      "upvotes": 2,
      "replies": {}
    },
    "he7hihf": {
      "link": "/r/GradSchool/comments/pv2ajt/phd/he7hihf/",
      "text": "Why can you not apply during your masters?  Why do you purposely need to lay off a year?  That’s not typical and most people apply for the PhD during their masters so there is basically no gap.",
      "author": "Weekly-Ad353",
      "created": 1632567755,
      "upvotes": 4,
      "replies": {
        "he7i3z4": {
          "link": "/r/GradSchool/comments/pv2ajt/phd/he7i3z4/",
          "text": "Is that feasible? What kind of timeline are we looking at?",
          "author": "soangsty",
          "created": 1632568168,
          "upvotes": 1,
          "replies": {
            "he7ife1": {
              "link": "/r/GradSchool/comments/pv2ajt/phd/he7ife1/",
              "text": "I have no idea what field or country you’re in.\n\nMany fields have regular applications in the fall, acceptances in the spring, and start dates in the next fall.\n\nA masters program is 2 years.\n\nSo during the fall of year 2, you apply for PhDs.\n\nI don’t understand why you’d have to only apply when you’re not in school.\n\nYou apply with the “expected graduation spring XXXX” and their offer is contingent on your graduation from your masters program.",
              "author": "Weekly-Ad353",
              "created": 1632568386,
              "upvotes": 1,
              "replies": {
                "he7il60": {
                  "link": "/r/GradSchool/comments/pv2ajt/phd/he7il60/",
                  "text": "My masters is for one year and we’re cramming in a lot, but thanks very much!",
                  "author": "soangsty",
                  "created": 1632568497,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634066221
}