{
  "sid": "qv7swv",
  "link": "/r/GradSchool/comments/qv7swv/finding_inspiration_for_a_dissertation_topic/",
  "title:": "Finding inspiration for a dissertation topic?",
  "text": "Third year PhD student in a social science field here. Despite my love of being a generalist, I'm at the stage in my program where I really do need to decide on a narrow dissertation topic soon. And I'm finding this tricky\n\nMind you, I'm not a starry-eyed undergrad claiming to be interested in everything. I'm only really interested in maybe 20% of my sub-field, and many of my cohort-mates have had changing/evolving interests, too. But I feel clueless about how to create an original research agenda for myself, and I flounder when asked what my specialization is.\n\nIn my field, grad students are supposed to design and conduct their research independently, rather than extend their advisor's work or collaborate as a lab. While my program's faculty are happy to help students flesh out their ideas or talk about methods/details, my advisors aren't very helpful at the early stage of figuring out a dissertation. Asking my RA-ship supervisor how he comes up with creative ideas for projects, he shrugged and answered \"there's no special sauce\".\n\nABD grad students have been more helpful. I've been told to see research as a back-and-forth between deduction from theory/past literature and induction from evidence/ empirical \"puzzles\". I just don't know where to start. The smaller projects I've worked on so far in grad school have been fun ways to explore pet interests, but they haven't turned into a productive research agenda. Nor has some single niche topic called to me as the intellectual passion of my life. Part of my problem might be COVID-era burnout. My creativity has been limited since the pandemic started.\n\nTLDR: How do grad students figure out a narrow specialization and turn it into an actionable plan for a dissertation/early career research agenda? Especially in social/behavioral science fields",
  "author": "4-raccoons-in-a-coat",
  "created": 1637069400,
  "updated": 1637182677,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hkyx1zv": {
      "link": "/r/GradSchool/comments/qv7swv/finding_inspiration_for_a_dissertation_topic/hkyx1zv/",
      "text": "First step: \nGet hold of a textbook that summarizes recent research in your subject field (literature of literature textbooks/meta-analysis textbooks)written for MA+ students and researchers, things like Oxford Handbook of [your subject field]), skim through and if there’s a topic that interests you, try reading the relevant research paper listed in the references of the same chapter. \n\nSecond step:\nIf you come across a paper that you find really interesting, read a bit more on recently published literature cited in that paper (take notes of data, methodology, underlying theory etc). This is the point where you want to read critically, because the aim is to find gaps in the literature that you can turn into your own research.",
      "author": "knoxyal",
      "created": 1637141802,
      "upvotes": 1,
      "replies": {}
    }
  }
}