{
  "sid": "reaxk6",
  "link": "/r/GradSchool/comments/reaxk6/transferring_grad_schools/",
  "title:": "Transferring grad schools?",
  "text": "How common is it/ is it possible to transfer grad schools? I’m currently in a graduate program for Clinical Mental Health Counseling in Alabama. I just finished with my first semester. However, I’m not in love with the program and I would like to move with my partner when he most likely moves to NYC for a job. I figure I’m young and that’s probably going to be my one opportunity to live there because his parents inherited an apartment there so we get free rent. I thought about asking my professors if I could go online with the program. Even though the program is mainly in-person, I do know of one other student who moved for a job and they let her take her classes online. My other option is to transfer to a college in New York and do online. \n\nMy other option is to just postpone going and get a full time job. \n\nI have 9 credit hours right now. Any thoughts?",
  "author": "rainydayinmay9",
  "created": 1639263202,
  "updated": 1639518502,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "ho77d61": {
      "link": "/r/GradSchool/comments/reaxk6/transferring_grad_schools/ho77d61/",
      "text": "You might be good, actually, though everything depends on the institution you're moving to. How credits are carried over from institution to institution varies, and may or may not be in your favor depending on the class (i.e., if it's accepted as equivalent for your program, you're good, otherwise, you'd need to take the new university's program requirement). \n\nThe big concern is how those 9 credit hours carry over. For example, the university I work at and attend will accept a certain number of credits, but no more, and a residency requirement has to be met (essentially, the majority of program credits). For example, at 9 credit hours you'd be good, since you're under the limit, and continuation of the program would meet residency with no problem.\n\nI'd check the catalog of the institution you think you'd apply to, and if you don't find the answers you need, call the registrar's office and ask. Be sure before you apply, otherwise, you might end up in a situation where you have to make a decision about those 9 hours.",
      "author": "Crimsonial",
      "created": 1639277217,
      "upvotes": 1,
      "replies": {}
    },
    "ho7831k": {
      "link": "/r/GradSchool/comments/reaxk6/transferring_grad_schools/ho7831k/",
      "text": "It may have to do with accreditation as well. I’m assuming you’re in  CACREP accredited university, or equivalen, if you’re transferring to a program with the same accreditation it may be a non-issue?",
      "author": "Iamheno",
      "created": 1639277576,
      "upvotes": 1,
      "replies": {
        "ho7by46": {
          "link": "/r/GradSchool/comments/reaxk6/transferring_grad_schools/ho7by46/",
          "text": "Yes it’s CACREP accredited, thank you!",
          "author": "rainydayinmay9",
          "created": 1639279523,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}