{
  "sid": "q03zbi",
  "link": "/r/GradSchool/comments/q03zbi/advice_for_studying_for_quals/",
  "title:": "Advice for studying for quals?",
  "text": "I’m taking a qualifying exam in January because I didn’t want to take them online this past August. They are in person this January.\n\nWe are given a syllabus of several different topics that might show up on the exam as well as 4 (!!!) different books. I also was given all the past qualifying exams given since 2012-ish. It’s just so much, I don’t know where to start or how to parse it. It makes it a bit harder since I have to study while also doing the work in my other classes but an older graduate student in my department offered to help me study (I’m very thankful for him!) because I’m taking the exam that’s in his field.\n\nHow is the best to start? What worked for you to study for your own qualifying exams? Any other advice?\n\nThanks!",
  "author": "lesbianpearls",
  "created": 1633210528,
  "updated": 1634099975,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hf5j8gj": {
      "link": "/r/GradSchool/comments/q03zbi/advice_for_studying_for_quals/hf5j8gj/",
      "text": "My department gave us nothing. We were just told \"ask previous cohorts what they did\" but how their exams were is no indication of what ours will be (so helpful). We basically went over all the homeworks we had from all the required classes and just tried to have those down well.",
      "author": "EpiJade",
      "created": 1633214343,
      "upvotes": 5,
      "replies": {}
    },
    "hf66nez": {
      "link": "/r/GradSchool/comments/q03zbi/advice_for_studying_for_quals/hf66nez/",
      "text": "I think it really depends on your program because policies and procedures are really different.  It also can depend on whether y ou are in a humanities, social science, or STEM. I am in the social sciences, so my experiences and suggestions are based off that. \n\nIn my program, it was expected that the student was to meet with each member of their committee to discuss their prelims/quals and in those discussions they would agree on a general area about which that committee member will ask a question. But the agreed question area is not too narrow to give an exact answer, but not too broad that it would be impossible to study. However, I did have one member of my committee straight up tell me what question they were going to ask like a week before the exam date. In those discussions, they would often mention relevant articles to get me started, and I could look at those references for more guidance. We also had the option of putting together a reading list and getting the examiner to approve it, but most of my examiners ended up not doing reading lists for various reasons. The one that did do a reading list ended up not being helpful *at all*, but that was just my experience. \n\nSo that should narrow down your focus a little. What a lot of people do is create a general outline. Say, for example, that you are a psychology student interested in social media use and social identity development in adolescents. If one member of your committee is a developmental psychologist, you might create a general outline for a paper listing what we know about how social media use impacts adolescents and how adolescents use social media in constructing their sense of self. For that members question, you might want to focus on some prominent developmental theories and what impact social media might have at those stages, and what we know about identity formation through the course of development as a general outline. Then, once you get your question, you should have at least some basis to write about and you can fill in the blanks. Some people in my program basically prepared various different paper outlines for each potential question, but I thought that was a big waste of time. I ended up passing all of my prelims without reservation, aside from one minor addendum for one topic so that worked for me. \n\nI ended up creating separate folders in Mendeley for each of my examiners and started saving tons of research articles and relevant books in there and slowly going through them bit by bit. My department also kept a record of past prelim questions but I ended up not looking at them because I did not see the sense in preparing for 20 different questions that *might* be asked when I could instead focus on compiling literature that was more specifically focused to what my research interests were and how those overlapped with my committee members' expertise.",
      "author": "False-Guess",
      "created": 1633224952,
      "upvotes": 2,
      "replies": {}
    },
    "hf96s7r": {
      "link": "/r/GradSchool/comments/q03zbi/advice_for_studying_for_quals/hf96s7r/",
      "text": "Also a PhD student in math, just passed my quals a couple of months ago. I started about a month out from them, and for each exam I first worked through all the homeworks, made notecards for all the big and/or useful ideas, and worked through all the practice/class exams. I also did a handful of textbook problems for content I struggled with during the actual class.\n\nThis was enough to pass them with basically no stress.\n\nThese exams are (usually) not meant to be gotchas. There's just a  lot of content, so make sure you're not cramming for them and you'll probably be fine.\n\nEDIT: I did notice that you're studying for them while taking other classes. That might be harder; I basically took a month off during the summer to hermit study the above. How much time do you have between end of courses and the exams?",
      "author": "TrostAft",
      "created": 1633285625,
      "upvotes": 1,
      "replies": {
        "hf9bkvx": {
          "link": "/r/GradSchool/comments/q03zbi/advice_for_studying_for_quals/hf9bkvx/",
          "text": "I think it’s about 3 weeks? But, it’s notorious that January quals are easier because of this.",
          "author": "lesbianpearls",
          "created": 1633287595,
          "upvotes": 1,
          "replies": {
            "hf9cv06": {
              "link": "/r/GradSchool/comments/q03zbi/advice_for_studying_for_quals/hf9cv06/",
              "text": "Personally, I would leave all my studying to those 3 weeks. Pass my exams for the semester, take a weekend, then immerse yourself in qual studying. With a good work ethic, 3 weeks should be enough to get through homeworks + practice exams.",
              "author": "TrostAft",
              "created": 1633288109,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}