{
  "sid": "r9rvld",
  "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/",
  "title:": "How to make the most out of grad school",
  "text": "So…I got accepted into a masters program which starts in a month. So I was wondering if anyone had any advice for how to make the most out of it. That is, how can I best utilize my resources so that I can leave the program with a masters degree and a lot more confidence",
  "author": "throwawayjobseeker7",
  "created": 1638745020,
  "updated": 1639518956,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.94,
  "comments": {
    "hnetxp7": {
      "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hnetxp7/",
      "text": "Congrats on getting accepted into grad school, and welcome to the gang! \n\nSo before I can offer you useful advice, I’ll need a bit more context. What is the nature of your program? Do you need to do original research and write a thesis? Are you in STEM or humanities? Do you have a TA or RA lined up? Do you have alums from undergrad who is currently in the same program?\n\nI can share with you a [blog](https://www.kaleidoglobe.com/blog/posts) from KaleidoGlobe that contains lots of good information. Perhaps you can find something useful on it?",
      "author": "zzpsuper",
      "created": 1638759277,
      "upvotes": 3,
      "replies": {
        "hnf8prc": {
          "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hnf8prc/",
          "text": "Thank you! \n\nIt is an online masters of mass communication program with a PR specialization. It’s no thesis, it’s a capstone project I guess you call it. It’s more professional led not a research and/or doctorate leading program",
          "author": "throwawayjobseeker7",
          "created": 1638766397,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hngrpb9": {
      "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hngrpb9/",
      "text": "Figure out what you want out of graduate school. Do you want a job or a path to a PhD program.  If you want a job/career then use your time to learn the skills for the career you want. Try to use university resources to help you navigate any certifications or training that would be beneficial. If you want to get into a PhD program then talk with your professors. Take the challenging courses or excel at any  projects.  Everyone in the program is there for different reasons. Don't compare yourself to them unless you both have the same goals. \n\nFinally don't expect graduate school to be life changing in any way. Unless you put effort in  you will be the same person you are at the end as you are coming in.",
      "author": "local_man_says",
      "created": 1638803197,
      "upvotes": 2,
      "replies": {}
    },
    "hnf4m3k": {
      "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hnf4m3k/",
      "text": "Some advice that was given to me is participate in as many trainings as you can while you’re a student. I’m not sure what your area of study is but I am in a counseling psych program and I have heard that it is best to do trainings while you are a graduate student because you get a discounted cost (due to being a student) as opposed to participating in trainings after you have already graduate. Some trainings will require you to already have your master’s degree or licensure though. I’ve heard it takes some footwork to get into the trainings as a student but it is worth it in the end.",
      "author": "Fun_Emotional",
      "created": 1638764219,
      "upvotes": 1,
      "replies": {}
    },
    "hni6ejp": {
      "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hni6ejp/",
      "text": " I learned the hard to start talking with every professor I could and building connections. My first 2 months were rough finding a job but I discussed this with my advisor and they got an assistantship. Every good thing that I’ve been able to work on at graduate school, projects, research, travel, internships has all been because I maintained connections and reached out to any sort of connection with questions for guidance. At least at my university, they truly want us to succeed and want to help us and appreciated that I made time to make connections and ask.",
      "author": "missmeganmae",
      "created": 1638823265,
      "upvotes": 1,
      "replies": {
        "hni9ze1": {
          "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hni9ze1/",
          "text": "It’s sorta a weird situation with me as I’m actually going back to school for a masters at a school on the opposite side of the country. I like to think I’m good at developing relationships with people and I’ll try my hardest to network and make the connections but I’m just hoping that they can help me when it’s time to look for internships (they prefer you wait after 2 semesters before enrolling in the internship course)",
          "author": "throwawayjobseeker7",
          "created": 1638824630,
          "upvotes": 1,
          "replies": {
            "hnjbe6d": {
              "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hnjbe6d/",
              "text": "I think they can! 90% of my masters the first year was online due to COVID and in a whole new area for me. I met most everyone who helped me via telephone calls, emails, and zoom! So it’s definitely possible. I just wished I had realized I could reach out and discuss things earlier since I could have had a job much earlier if I had!",
              "author": "missmeganmae",
              "created": 1638840449,
              "upvotes": 1,
              "replies": {
                "hnjk5km": {
                  "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hnjk5km/",
                  "text": "This was the biggest thing for me tbh. I wish I had decided to go for my masters right out of college so that I could’ve been doing it online anyway. But I’m doing it now and I chose the school I chose cuz it’s online and also I didn’t need to do anything in preparation. That’s not to say I made the decision on a whim, but it was nice not having to take the GRE because it was just less stress. I just hope that if it ever comes up that my degree (which will be the same as someone not online) came from going to school online, that it doesn’t matter since a ton of people are technically getting theirs online with covid. Just an awful 2 years and still going on now. But yeah, thank you so much. I plan on taking advantage of every possible resource and talking with everyone I can. It’s about time I knew what I wanted and how to get it",
                  "author": "throwawayjobseeker7",
                  "created": 1638844204,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnlhfd8": {
      "link": "/r/GradSchool/comments/r9rvld/how_to_make_the_most_out_of_grad_school/hnlhfd8/",
      "text": "Once you get syllabi for classes, plan and set goals for study time, projects, research, TAing, etc. Create a routine or schedule to make sure you have enough time to get everything done. \n\nI learned the hard way, and you don't have to. \n\nMake sure you know how to navigate the campus before the first week: classes, printers, etc.",
      "author": "Secretninjaket",
      "created": 1638887386,
      "upvotes": 1,
      "replies": {}
    }
  }
}