{
  "sid": "r3iykz",
  "link": "/r/GradSchool/comments/r3iykz/submitting_the_same_writing_sample_with_multiple/",
  "title:": "Submitting the same writing sample with multiple applications",
  "text": "I’m applying to six masters programs and a few of them require academic writing samples. One of the schools (I’ll call it school #1) gave me a specific article to write about, so I did that, and I’m very happy with how it turned out. I’m wondering if it’s acceptable to submit this sample to other schools as well.\n\nThe only thing really holding me back is that the writing sample article and prompt is on school #1’s website, so technically an admissions counselor at school #2 could know I’m reusing a sample I wrote for school #1. Most of the programs I’m applying to are in the same city. I’m not sure if that’s something they even take note of or care about…",
  "author": "hbluemn",
  "created": 1638036001,
  "updated": 1638207985,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmbmqbi": {
      "link": "/r/GradSchool/comments/r3iykz/submitting_the_same_writing_sample_with_multiple/hmbmqbi/",
      "text": "Hmm that’s tough. I mean, technically you could submit an old paper you’re proud of as a writing sample. So considering this is something you wrote, I don’t see why it would be a problem to use it for other programs. However if you want to play it extremely safe then probably use/write another paper? This is just my opinion",
      "author": "koala-butt",
      "created": 1638049387,
      "upvotes": 1,
      "replies": {}
    },
    "hmbrhtb": {
      "link": "/r/GradSchool/comments/r3iykz/submitting_the_same_writing_sample_with_multiple/hmbrhtb/",
      "text": ">Most of the programs I’m applying to are in the same city. I’m not sure if that’s something they even take note of or care about…\n\nI doubt they care. Most people submit the same writing sample everywhere anyway if given the option.",
      "author": "raistlin65",
      "created": 1638051491,
      "upvotes": 1,
      "replies": {}
    },
    "hmd1m1i": {
      "link": "/r/GradSchool/comments/r3iykz/submitting_the_same_writing_sample_with_multiple/hmd1m1i/",
      "text": "It’s almost certainly fine to submit the same writing sample assuming it meets the prerequisite (length, topic etc.).  There is no obligation or expectation that you write unique writing samples for each application.  No one will know or care.  I’d be surprised to find out if someone didn’t provide the same sample to different schools.",
      "author": "DicaxErsatz",
      "created": 1638073339,
      "upvotes": 1,
      "replies": {}
    },
    "hmdmjec": {
      "link": "/r/GradSchool/comments/r3iykz/submitting_the_same_writing_sample_with_multiple/hmdmjec/",
      "text": "Absolutely send the same writing example. You want to make the one you send in as polished as possible. No one cares and if the programs have any similarity in ranking for your field, they will absolutely expect you to apply to multiple.",
      "author": "a-perpetual-novice",
      "created": 1638086529,
      "upvotes": 1,
      "replies": {}
    }
  }
}