{
  "sid": "rfkyvr",
  "link": "/r/GradSchool/comments/rfkyvr/how_do_you_deal_with_discouragement/",
  "title:": "How do you deal with discouragement?",
  "text": "I just did my masters thesis proposal and my 3 advisors/ committee completely demolished my ideas. They argued with every point I made and I feel so discouraged. I feel like I should just quit or completely start over. How do you all move passed this point in grad school? I’m in a special made program so I’m the only one in my department so it’s not like there’s other people to bounce ideas off of or review things.",
  "author": "YourMomsSideUp",
  "created": 1639416389,
  "updated": 1639518457,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hog1ari": {
      "link": "/r/GradSchool/comments/rfkyvr/how_do_you_deal_with_discouragement/hog1ari/",
      "text": "Did they review the proposal before you submitted it or was this the first time they've seen it? Was any of the criticism constructive? Are there changes you can make that answer their questions? It's literally their job to peer review your work. They want to make sure that your research questions will be answered by your methods.",
      "author": "IncredibleBulk2",
      "created": 1639439456,
      "upvotes": 1,
      "replies": {
        "hoh4iav": {
          "link": "/r/GradSchool/comments/rfkyvr/how_do_you_deal_with_discouragement/hoh4iav/",
          "text": "Yeah they reviewed it beforehand. Two of them were helpful with critiquing. But the other is such a dick. Like legitimately laughed at me when I didn’t understand a question and then wouldn’t let me answer the other guys questions. I have stutter from a TBI and he takes it as an opportunity to just talk over me. I almost quit my first semester because of him.",
          "author": "YourMomsSideUp",
          "created": 1639458191,
          "upvotes": 1,
          "replies": {
            "hohvrk8": {
              "link": "/r/GradSchool/comments/rfkyvr/how_do_you_deal_with_discouragement/hohvrk8/",
              "text": "That sounds awful. I'm so sorry.",
              "author": "IncredibleBulk2",
              "created": 1639478286,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hohovpa": {
      "link": "/r/GradSchool/comments/rfkyvr/how_do_you_deal_with_discouragement/hohovpa/",
      "text": "Did they give you any feedbacks (was it lack of novelty, level of complexity over the topic you chose, or maybe just personal preference?). If not, I'd suggest you find some good research proposals to get a feel how you should frame your topics. Sometimes advisor are just too busy to read through.",
      "author": "Alhazar",
      "created": 1639472401,
      "upvotes": 1,
      "replies": {}
    }
  }
}