{
  "sid": "rgo4zz",
  "link": "/r/GradSchool/comments/rgo4zz/americans_who_have_studied_in_a_european_grad/",
  "title:": "Americans who have studied in a European grad program, what are some hidden gotchas you encountered?",
  "text": "I graduated with a BS in electrical engineering 3 years ago and have been working in robotics software full-time since then. I studied in a MS computer science for a single semester before withdrawing due to the cost/benefit tradeoff. I've over the past couple years become interested in living abroad in Europe for at least a short time and my desire to return to academia has been growing (especially now that I have some savings and some of the student loans are paid off).\n\nI've decided on a terminal master's program in my field at UPC in Spain for fall 2023 and have begun planning around costs of attendance for the two years of the degree. However since the degree system and much of the living costs are a little different to the States I want to make sure I'm not missing major details:\n\n* I took my GRE in December 2017. Will I need to take the GRE again? Or a different exam entirely?\n* I've been looking at cost of rent in Barcelona, along with cost of transit and the cost to feed myself, are there other \\~monthly costs I should be considering?\n* How does health insurance work as an American studying abroad? I obviously won't carry my policy I currently receive from work, but do I need to get a local private insurance or is there an alternate arrangement for international students?\n* I can speak passable Spanish and have started picking up Catalan. The university program is taught in English, but will I need to take any kind of exam to prove proficiency in Spanish/Catalan? (couldn't find anything on the UPC website on this, unsure if maybe it was so common as to not be worth mentioning or something)\n* I have student debt from undergrad that may or may not be paid off before I'd start studying abroad. It appears there's a workflow for applying for deferment based on enrollment in grad school, and there's consideration for studying outside of the US. Any hiccups or extra steps required here?\n* Should I expect to need to apply especially early in order to have sufficient time for a visa process to clear?\n* I graduated with a high GPA. I'm anticipating being able to fund the entire 2 years myself, but it'd be good to know what resources I could consider in terms of looking at merit-based scholarships?\n* Anything I've completely missed?\n\nAppreciate it if anyone currently in the process or whose already finished could shed some light on any of my questions. I'm a first generation college student as-is, but at least as an American at an American university I couldn't really screw up too badly. This feels like its sufficiently uncommon that I can't count on that so much!",
  "author": "ssnover95x",
  "created": 1639535412,
  "updated": 1639788550,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.79,
  "comments": {
    "holn8u0": {
      "link": "/r/GradSchool/comments/rgo4zz/americans_who_have_studied_in_a_european_grad/holn8u0/",
      "text": "I can’t speak about studying in Spain exactly. But from past studying abroad experience there is the culture shock element you need to consider. Have you been to Spain before? Have you been abroad before (the students I studied in China with who’d never been abroad struggled the most). \n\nDon’t get me wrong, I LOVED my studies abroad, but culture shock can still be a challenge. But overall it was 100% the best part of my undergraduate experience.",
      "author": "FeatherTime",
      "created": 1639539470,
      "upvotes": 2,
      "replies": {
        "holqks9": {
          "link": "/r/GradSchool/comments/rgo4zz/americans_who_have_studied_in_a_european_grad/holqks9/",
          "text": "Yes, I've been to Spain for a couple weeks at a time on two occasions. I spent a more significant amount of time in the UK in 2019 and you're right; even between two countries as culturally similar as the US and UK there's definitely some adjustment required.",
          "author": "ssnover95x",
          "created": 1639541097,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "honf8jx": {
      "link": "/r/GradSchool/comments/rgo4zz/americans_who_have_studied_in_a_european_grad/honf8jx/",
      "text": "One issue a friend of mine experienced doing his MS in Spain was not having North American connections after graduating when he wanted to come back and get a job. Your network will be very different coming from a Spanish school vs a north American one.",
      "author": "No_Income6576",
      "created": 1639580247,
      "upvotes": 3,
      "replies": {
        "hori7xt": {
          "link": "/r/GradSchool/comments/rgo4zz/americans_who_have_studied_in_a_european_grad/hori7xt/",
          "text": "That's definitely an issue OP needs to think about. I did my grad program in Germany. My professional network is mostly based in Germany, France, and Belgium. I have no US connections.\n\nETA: brain is too slow, I forgot to add a word to make a sentence.",
          "author": "Advanced_Meal",
          "created": 1639649295,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "horhvlw": {
      "link": "/r/GradSchool/comments/rgo4zz/americans_who_have_studied_in_a_european_grad/horhvlw/",
      "text": "Oooh! Finally a question I can help with.\n\n>I took my GRE in December 2017. Will I need to take the GRE again? Or a different exam entirely?\n\nMost likely not. None of the schools I applied for in the EU required me to take an exam to apply. They cared more about grades and referrals.\n\n>I've been looking at cost of rent in Barcelona, along with cost of transit and the cost to feed myself, are there other \\~monthly costs I should be considering?\n\nI studied in Berlin. My monthly costs were: rent, utilities, groceries, transit (student discount), health insurance, lawyer insurance (very handy in Germany), and play money for more frivolous things.\n\n>How does health insurance work as an American studying abroad? I obviously won't carry my policy I currently receive from work, but do I need to get a local private insurance or is there an alternate arrangement for international students?\n\nThe universities usually have representatives of insurance companies who work with them and can help you. This can typically be accessed through the office that deals with international students. There's normally public or private insurance options for students.\n\n>I can speak passable Spanish and have started picking up Catalan. The university program is taught in English, but will I need to take any kind of exam to prove proficiency in Spanish/Catalan?\n\nIf the program is in English and the requirements only state the need for English, then you shouldn't need to take an exam to prove proficiency in any other language. You will only need proof of Spanish/Catalan proficiency if the specific program you're applying for lists it as a requirement. Many programs throughout the EU have English-only programs where the only requirement is sufficient English and not the local language (although knowing the local language can help with everything from day-to-day life to immigration offices).\n\n>I have student debt from undergrad that may or may not be paid off before I'd start studying abroad. It appears there's a workflow for applying for deferment based on enrollment in grad school, and there's consideration for studying outside of the US. Any hiccups or extra steps required here?\n\nI had some student loan debt before moving to Germany, but was able to get a deferment as my study program was one that participates in the US Federal Student Aid Program. You can get more information on which schools those are here: [https://studentaid.gov/understand-aid/types/international](https://studentaid.gov/understand-aid/types/international) (If your program is here, that means that you can also use US student loans to help with tuition/school costs).\n\n>Should I expect to need to apply especially early in order to have sufficient time for a visa process to clear?\n\nThis really depends on the individual and the country they want to study in. You will need to check Spain's visas for students and see if there is a visa for incoming students who need time to prepare all the paperwork. Personally, I came in to the EU on a tourist visa, gathered all the local data I needed (bank acct with proof of income/ability to pay for myself, rental contract, city registration) and then went to the immigration office within my allowed 90 days.\n\n>I graduated with a high GPA. I'm anticipating being able to fund the entire 2 years myself, but it'd be good to know what resources I could consider in terms of looking at merit-based scholarships?\n\nYou'll need to check with the program you're applying to, possibly contacting the head of the program or their assistants. My university only gave 3 full-ride merit-based scholarships for international students, which was incredibly difficult to get (I don't think any US citizens in my program got it), but they had financial aid options that was available to just about anyone who needed it.\n\n>Anything I've completely missed?\n\nDon't be afraid to contact the program you're interested with questions based on their offered program: scholarships, language requirements, how the program helps international students get settled.\n\nContact the university's international office with questions regarding: visas, insurance, services for international students struggling with visa, language, and financial issues.\n\nAlso contact the finance office for: financial aid options, scholarships offered for international students, and if they are participating in the US Federal Student Aid program.\n\nETA: topics a university's international office should be able to help with",
      "author": "Advanced_Meal",
      "created": 1639649007,
      "upvotes": 1,
      "replies": {}
    }
  }
}