{
  "sid": "q6to2s",
  "link": "/r/GradSchool/comments/q6to2s/first_conference_help/",
  "title:": "First Conference Help",
  "text": "Hi everyone, I’m a STEM PhD in my second year and I got an offer to attend a big online conference for free. I’m not presenting, just attending, but I want to make the most of my time from this. There’s going to be quite a few networking breaks, but is there going to be much of a way for me to network if I’m not presenting anything? My advisor is sick and hasn’t been available for a while, so I can’t go to her for advice right now. \n\nI guess my main question is what should I be doing during this conference? 😂",
  "author": "collegebarbros",
  "created": 1634066766,
  "updated": 1634604485,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hge8qir": {
      "link": "/r/GradSchool/comments/q6to2s/first_conference_help/hge8qir/",
      "text": "Conferences are about networking and fostering collaborations. If you’ve got cool data, you can reach out to people doing similar work and see if there’s space to work on a project together.",
      "author": "Stereoisomer",
      "created": 1634068916,
      "upvotes": 3,
      "replies": {}
    },
    "hgeall2": {
      "link": "/r/GradSchool/comments/q6to2s/first_conference_help/hgeall2/",
      "text": "Find out who is doing research most closely related to your own. See their presentations to get a feel for how they approach the problem and perhaps what direction they think is fruitful for future work.",
      "author": "IkeRoberts",
      "created": 1634069685,
      "upvotes": 2,
      "replies": {}
    },
    "hgeaqjq": {
      "link": "/r/GradSchool/comments/q6to2s/first_conference_help/hgeaqjq/",
      "text": "If it is online certainly take time to answer the interactive polls, play games and if speed networking is a thing come up with a 30 second intro.  Seek someone out to chat with.  Read who’s going to be there, and make it a point to chat them up.  Ask them for 5 minutes to talk about X. \nMy final bit of advice for ALL conferences, not just online conferences, come up with a good question for presenters.  That way you get to introduce yourself to the whole group and ask the thing that everyone would like answered.",
      "author": "ConnectKale",
      "created": 1634069742,
      "upvotes": 1,
      "replies": {}
    },
    "hgfde6r": {
      "link": "/r/GradSchool/comments/q6to2s/first_conference_help/hgfde6r/",
      "text": "Always present at conferences.",
      "author": "fwafwa",
      "created": 1634086734,
      "upvotes": 0,
      "replies": {
        "hgfe2fm": {
          "link": "/r/GradSchool/comments/q6to2s/first_conference_help/hgfe2fm/",
          "text": "Could you elaborate a bit on that? I received a free invitation to this conference by a colleague of my advisor since he knows I do research in this field. I received this invite two days ago and the conference is tomorrow morning. They had already planned the whole thing with the presentations and networking breaks. Should I have a presentation prepared in case I get the opportunity to present?",
          "author": "collegebarbros",
          "created": 1634087045,
          "upvotes": 1,
          "replies": {
            "hgik1t5": {
              "link": "/r/GradSchool/comments/q6to2s/first_conference_help/hgik1t5/",
              "text": "No, not in this case. But normally, you should aggressively seek opportunities to present your work at conferences.",
              "author": "fwafwa",
              "created": 1634150153,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}