{
  "sid": "r8x8x9",
  "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/",
  "title:": "3 people in my program have asked me to basically do their assignments for them. I’m disgusted.",
  "text": "I’m in a masters program for drug development. It’s not a hard program, honestly. We have class three times a month and and one paper per class. That’s it, no exams.\n\nI’m very involved in the class and like to participate, so everyone seems to know me. We have a WhatsApp chat that I’m really active in and like to help people out with questions they have (and ask my own too). Apparently this has an effect on people and gives them an image of me that I don’t want.\n\nI’ve had three people privately message me, saying that they think I’m really smart and know what I’m doing (I’m not, and I don’t). After a slew of compliments, try straight up ask to see my paper, or even just ask for me to write theirs for them. \n\nI’m disgusted. This is a fucking masters program, grow up and do it yourself. It’s not a long paper, between 2000-3000 words. I’m tempted to send these messages to the program director, honestly. But as the old Chinese proverb goes, snitches get stitches.\n\nThese are the same people that told me that in their home country, they just paid websites to write their essays for them and haven’t written an actual paper since high school. Like??? Am I the only one here on actual merit??",
  "author": "nadehlaaay",
  "created": 1638646530,
  "updated": 1639518968,
  "over_18": false,
  "upvotes": 145,
  "upvote_ratio": 0.96,
  "comments": {
    "hn8ftdm": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn8ftdm/",
      "text": "Those same slackers are also devaluing your degree by cheating",
      "author": "FunctionalSpinalUnit",
      "created": 1638648591,
      "upvotes": 115,
      "replies": {
        "hnd07ns": {
          "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnd07ns/",
          "text": "Exactly. I'm not judging them for *slacking* by itself, since my ADHD causes me to slack. However, if you live the slacker lifestyle, you have to pull the all-nighters and push through the hyped-up anxiety-driven manic hysteria of last minute writing. It's the price you pay.\n\nNote: I'm currently procrastinating to avoid writing a term paper due tomorrow. Got the coffee ready for tonight. Wish me luck.",
          "author": "toroidal-vortex",
          "created": 1638732868,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hn8t9cc": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn8t9cc/",
      "text": "I feel this. During my Honours year (4th year of my undergraduate degree) we took an advanced research methods class and my classmates would come find me when the written assessments were due. I use to study alone in the library and 4-5 mfers would sit with me for the week leading up to the submission of the assignment and then I'd be all alone again after submission day. Always tried to avoid just giving the answers away but was asked on several occasions to interpret the models we ran for the assessment from start to finish and provide the write-up. People suck at doing the work sometimes.\n\n&#x200B;\n\nWhen I TA'd the same course 2 years later I had **students** ask me to do their assignment for them. Imagine asking the TA to write your assignment for that very class. One student tried to bargain by increasing the amount he'd pay be for it. My brain was so stunned I didn't respond to him for like 45 seconds while he was standing in front of me.\n\n&#x200B;\n\nThese people should not be in these programs. They should not go beyond the 3-year Bachelor's. Several of these people pursue Master's and PhDs in my department. Astonishing shit.",
      "author": "PsychPhDBrah",
      "created": 1638654422,
      "upvotes": 61,
      "replies": {
        "hn8u9u8": {
          "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn8u9u8/",
          "text": "OMG I CANNOT even IMAGINE asking the TA to do my assignment for me. What kind of entitled bullshit is that???",
          "author": "sailor_em",
          "created": 1638654858,
          "upvotes": 37,
          "replies": {
            "hn98xw9": {
              "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn98xw9/",
              "text": "A couple of these students were particularly hopeless and this is likely a reflection of utter desperation. Doesn't make it any less stunning though",
              "author": "PsychPhDBrah",
              "created": 1638661113,
              "upvotes": 11,
              "replies": {}
            },
            "hna13ik": {
              "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hna13ik/",
              "text": "There's a story in my department about the parents of a student asking the professor of the course \"how much\" to get their student to pass.",
              "author": "Soulless_redhead",
              "created": 1638673714,
              "upvotes": 10,
              "replies": {
                "hnae2nk": {
                  "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnae2nk/",
                  "text": "\"3 credits will cost $ XXX dollars. You can pay the bursar next semester when they retake the class.\"\n\nGeez, that is ballsy.",
                  "author": "Elilora",
                  "created": 1638680095,
                  "upvotes": 6,
                  "replies": {
                    "hnc70gf": {
                      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnc70gf/",
                      "text": "If I remember right he said he would need his salary plus normal raises for the next 20 years, because \"if I'm going to commit that kind of fraud I will need the sum of everything I will give up doing that\"",
                      "author": "Soulless_redhead",
                      "created": 1638721722,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hnceri6": {
          "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnceri6/",
          "text": "This is Why I said last time, our education system around the world is broken, common sense, ability to think, creativity already gone done to level we ourself as TA or Lecturer can't comprehend at all. This is a systematic, broken, and crazy thing that happen on 12 years of education and we as Uni lecturer need to face this kind of shit tho.",
          "author": "BenL90",
          "created": 1638724904,
          "upvotes": 1,
          "replies": {}
        },
        "hneybtm": {
          "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hneybtm/",
          "text": "This shit is why I always studied in my room. I was safe in there from all the help requests except occasionally code help for a roommate who really struggled with the matlab for pchem",
          "author": "SeizureHamster",
          "created": 1638761260,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hn8n4f9": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn8n4f9/",
      "text": "They're not really your friends and don't deserve your help. The times I struggled in undergrad, I learned a valuable lesson that it's about who you can trust and also who to put yourself around to best succeed.  Usually people around me had a conscience to not let others copy their assignments.",
      "author": "dsli",
      "created": 1638651745,
      "upvotes": 38,
      "replies": {}
    },
    "hn9b40u": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn9b40u/",
      "text": "Have been in my grad program for nine years (two degrees) and literally have never had this happen. This almost sounds like the culture of the program that it’s happened so much already. I’d be disgusted too, that just sucks.",
      "author": "torrentialwx",
      "created": 1638662040,
      "upvotes": 17,
      "replies": {}
    },
    "hn8twps": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn8twps/",
      "text": "If you feel like being petty and punishing them without getting the university involved, tell them in person you'll do it (not in writing), and then just don't. Deadline will come up and they'll have nothing to submit.",
      "author": "PerceusJacksonius",
      "created": 1638654701,
      "upvotes": 23,
      "replies": {}
    },
    "hnbdjq1": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnbdjq1/",
      "text": "I would report this to the dean of your program. Trying to manipulate and take advantage of a colleague is really not cool.",
      "author": "nonconformistnugget",
      "created": 1638705988,
      "upvotes": 5,
      "replies": {}
    },
    "hn957ff": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn957ff/",
      "text": "Morons.\nI'd just say no and start a new what's app group with a select group of serious people.\nAnd avoid any interactions with those fools in the future.",
      "author": "Naivemlyn",
      "created": 1638659517,
      "upvotes": 5,
      "replies": {}
    },
    "hna9ucd": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hna9ucd/",
      "text": "These people are not your friends. You owe them nothing. Take it to your ethics board.",
      "author": "SephoraRothschild",
      "created": 1638677940,
      "upvotes": 5,
      "replies": {}
    },
    "hn9f8iy": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn9f8iy/",
      "text": "Feel it. I just turned in a group project (I was the group leader) where 2 of the 5 other members just fucked off, one did absolutely nothing, the other very little. We’re fucking adults in god damn Grad school, therefore when they didn’t meet their deadlines I decided to see if they’d reach out. They never did. So I did their work. Didn’t go crying to the professor, I just tore them to shreds on the peer review. If they didn’t give a fuck enough to even acknowledge they didn’t turn the work in, then hunting them down for their portions would’ve just left me with half-assed work that I’d have to heavily edit or just do myself anyway. They’ll probably throw me under the bus for not communicating with them, but the professor has access to our communication forum where I was very active. So when they try to lie to him he’ll probably drop their grades even further. What they probably don’t even realize is that while it’s a group project, it’s being graded individually. I hope the one guy who did nothing fails and tries to email me asking about why “we” did so bad on the project. I’ll send him a screenshot of my “A” and nothing else.",
      "author": "Beebus4Deebus",
      "created": 1638663813,
      "upvotes": 5,
      "replies": {}
    },
    "hna5gqe": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hna5gqe/",
      "text": "You should absolutely send the messages to the program director. These students shouldn't get the same degree as you are if they're not doing the work. Do you really want them developing drugs if they're willing to cut corners?",
      "author": "weeeee_plonk",
      "created": 1638675784,
      "upvotes": 4,
      "replies": {
        "hnaxn26": {
          "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnaxn26/",
          "text": "Or copy sections off it, and maybe change a few words for their synonyms and then submit that. It can get you both in trouble for academic integrity.",
          "author": "caspartheholyghost",
          "created": 1638692922,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hn9wjo0": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hn9wjo0/",
      "text": "I encountered this last semester too :( I just told them to go to office hours lol",
      "author": "iloveregex",
      "created": 1638671628,
      "upvotes": 2,
      "replies": {}
    },
    "hnax0s2": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnax0s2/",
      "text": "This is messed up. They're both bad, but at least asking to see your paper is slightly better than those who are straight-up asking you to write their papers, omg. Though I have heard stories of people 'asking' to see someone else's essays and then passing it off as their own work, so be careful!",
      "author": "KnifeShoe",
      "created": 1638692443,
      "upvotes": 1,
      "replies": {}
    },
    "hnb9aw0": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnb9aw0/",
      "text": "Yeah I’ve had to turn down several people for my bachelors and while working on my masters from viewing my work right before a major assignment is due. I just don’t trust em. I’m willing to share info but not just straight up send them my work",
      "author": "Dustin_Bromain",
      "created": 1638702524,
      "upvotes": 1,
      "replies": {}
    },
    "hnb9lf7": {
      "link": "/r/GradSchool/comments/r8x8x9/3_people_in_my_program_have_asked_me_to_basically/hnb9lf7/",
      "text": "Could even be flattering… sorry to ask, but how does one get into drug development? What prompted you to get into it? Thanks if you answer.",
      "author": "S0GGYS4L4DS",
      "created": 1638702771,
      "upvotes": 0,
      "replies": {}
    }
  }
}