{
  "sid": "qv12jc",
  "link": "/r/GradSchool/comments/qv12jc/is_it_ok_to_take_a_few_years_off_being_going_to/",
  "title:": "Is it ok to take a few years off being going to grad school after undergrad to avoid debt?",
  "text": "Hi, I hope this is the correct sub.\n\nSo a little background information, I want get a master’s after I finish my undergrad because there’s not much varieties or opportunities in my field without a masters. The problem is, I come from a very poor family, so I’ve had to rely on grants and financial aid as well as full-time work to help pay my tuition for undergrad. I decided to stop doing full-time work and transition to part time as my grades were dropping significantly due to how thin I was spreading myself, and in order to get into a masters program my grades need to be above a certain GPA, but I definitely don’t make enough to get by with just part-time work. I just barely can pay my tuition because of the grants and financial aid I receive but I know that for grad school, these grants will not be available to me.\n\nI’m having trouble coming up with how I can pay for grad school after undergrad. I considered working while in school but as I mentioned before, I can only do part time and it doesn’t make enough—also, starting next semester I’ll need to quit entirely because I will be commuting an hour and back for school every day (I can’t afford to dorm) and my class days start from around 9am-7pm which leaves no time to work. I most likely will not be able to work much while I’m in school which means I will not have the money to pay for tuition for grad school after my undergrad if I enter right away. I also considered taking out loans, but because my family is so poor, I’ve seen my parents take out a lot of loans and their credit and lives are ruined by it; I’ve seen my mom cry and my parents fight daily over finances and how they’re going to make that month’s mortgage and it has scared me a lot from going into debt, especially because I know that poverty is really hard to escape from and it’s not a guarantee that I’ll be able to pay it all off. \n\nSo all in all, it seems like I have no choice but to work and not attend grad school immediately, but I’m just concerned about how I would be able to get in—I need a minimum of 3 letters of recommendation for my masters program and I’m worried that my professors will not remember me nor will I know who to ask if I leave school for a while. \n\nAnyone else who’s been through this? Any advice is appreciated, thanks so much!",
  "author": "ilovecats573",
  "created": 1637042680,
  "updated": 1637182674,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hkuwxyg": {
      "link": "/r/GradSchool/comments/qv12jc/is_it_ok_to_take_a_few_years_off_being_going_to/hkuwxyg/",
      "text": "Yes, you can definitely take time to work before grad school. In terms of LORs, try to work within the field you would like to study and you can use your supervisors as recommenders (and ideally at least one prof too). I would also consider applying to funded programs, which may mean applying for a PhD. Something people don't tell you is that you can usually master out of PhDs (but you didn't hear that from me).",
      "author": "rox_et_al",
      "created": 1637074148,
      "upvotes": 2,
      "replies": {}
    },
    "hkv22ue": {
      "link": "/r/GradSchool/comments/qv12jc/is_it_ok_to_take_a_few_years_off_being_going_to/hkv22ue/",
      "text": "It's absolutely okay. In certain aspects, it might make things more difficult (getting LORs together for example) but it also may actually help you enhance your resume with a few extra years in research. I went right into grad school from undergrad but most of my cohort took some gap, and a member of my lab did as well. There's no wrong way to go about it. \n\nIf you only want a master's it may make a lot of sense to wait, though if you want a PhD that would almost certainly be funded.",
      "author": "nickyfrags69",
      "created": 1637076348,
      "upvotes": 1,
      "replies": {}
    },
    "hkvdweo": {
      "link": "/r/GradSchool/comments/qv12jc/is_it_ok_to_take_a_few_years_off_being_going_to/hkvdweo/",
      "text": "In the united states, paying back student loans starts \\~6 months after graduation.  I know plenty of people who went straight into their masters and PhD programs because you don't have to pay back your student loans until you graduate from those.  Do you have student loans?  Also, a lot of schools offer graduate assistantship jobs on campus so the grad students can work on campus and get experience in their field.  I know a girl doing a masters in english program and her GA position is teaching a first year english class and she gets a hefty stipend.",
      "author": "accidentfreefor0days",
      "created": 1637081116,
      "upvotes": 1,
      "replies": {
        "hkvfm1g": {
          "link": "/r/GradSchool/comments/qv12jc/is_it_ok_to_take_a_few_years_off_being_going_to/hkvfm1g/",
          "text": "Well currently, I don’t have any debts or loans. I have two more semesters of undergrad before I graduate and have been able to get through it without taking on loans b/c of the grants and financial aid I get (that won’t be available to me in my masters). I did consider taking out loans but my masters program will cost me almost $10k a semester at the minimum and I’m terrified of going into that much debt because I’ve seen my parents go into a lot of debt and their lives have been ruined by it, we’ve been stretched so thin for cash that we’ve been homeless several times and haven’t had food for weeks, so I desperately don’t want to borrow that much money. I did also think of working while I go to grad school but wouldn’t I need to have taken out a loan to attend anyway? Idk. I just feel like a bit of a failure if I don’t go right away because I feel like so many people do:(",
          "author": "ilovecats573",
          "created": 1637081785,
          "upvotes": 1,
          "replies": {
            "hkw92r1": {
              "link": "/r/GradSchool/comments/qv12jc/is_it_ok_to_take_a_few_years_off_being_going_to/hkw92r1/",
              "text": "There is no need to feel like a failure and honestly it shows how hardworking you are that you've worked this entire time.  Me personally, I knew I would never go back to school if i did not go right after undergrad.    \n\nJust so you know, there are also GA programs that cover graduate credits.  Where I go to school, GA programs will pay you a stipend and cover the majority of your credits because they don't want you to go into any more debt. Take your time to research schools and what GA positions they offer.  Some programs will even cover your entire tuition AND offer a stipend.  I know some of my peers would not be able to go to school if they did not get their GA position.  There are also grants and scholarships available for graduate school but they are harder to find unfortunately :/\n\nI wish you the best of luck!",
              "author": "accidentfreefor0days",
              "created": 1637093307,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkvqh1l": {
      "link": "/r/GradSchool/comments/qv12jc/is_it_ok_to_take_a_few_years_off_being_going_to/hkvqh1l/",
      "text": "I know a couple people who did it.\n\nThey also built a lot of good habits that had them looking orderly while the rest of us looked ragged.",
      "author": "c2u8n4t8",
      "created": 1637085988,
      "upvotes": 1,
      "replies": {}
    }
  }
}