{
  "sid": "qxb1xf",
  "link": "/r/GradSchool/comments/qxb1xf/should_i_withdraw_my_first_publication/",
  "title:": "Should I withdraw my first publication?",
  "text": "Hi everyone\n\nI'm 33(f), just completed my research master's, and live in New Zealand\n\nLast year I was invited to write a chapter for an edited collection. I was very excited as this would have been my very first publication, and I thought it was fantastic to be invited to publish as a master's student. \n\nI worked on the first draft of my manuscript for months, trying to follow the brief of the collection closely while keeping true to my research.  I got my first round of revisions back, with substantial edits. That was fine, I tried my best and did the revisions. Then I got my second round of revisions back...with even more substantial edits. By this time, it was clear to both the editors and myself that the focus of my manuscript was still missing the mark and what they wanted out of me was perhaps beyond my level of expertise. From there, they invited me to find a co-publisher to help me with my work. I first asked my supervisors, who (understandably) said they were too over-committed to take on another project. Plus, by then, I had nearly graduated and was no longer under their wing. I also had some help from the editors to find co-publishers, but no one could/wanted to do it. \n\nThe editors have now given me two options to go forward - continue to try to publish solo or withdraw. If I chose to publish solo, they advised me that this would take a great amount of time and effort (with multiple rounds of revisions expected). \n\nI am now stuck here, not sure what to do. To be honest, after juggling a full-time job and master's degree for years, I am completely burnt out. Even to write the two drafts took a lot of effort and caused a lot of strain. I essentially treated it like a full-time job, spending up to 40 hours a week writing this manuscript. I also recently received an ADHD diagnosis and started a new job, and feel like I am struggling to cope with publishing on top of everything. But at the same time, I worked so damn hard on this manuscript. It would be so much of a waste to just pull out and have nothing. They advised me that I could try to submit my manuscript to a journal, but I heard about how relentless the editorial process is for those. To be honest, I've been doubting whether academia is even for me. It might be due to my ADHD and the fact that I'm a first generation student, but I have always struggled with the intensive reading, writing, and the lack of work-life balance. If anything, this whole editorial process has made me second guess applying to do a PhD. \n\nHowever, I'm afraid that if I just give up on this manuscript, I might regret it down the road. Especially since the main reason I would withdraw is strictly due to burnout and not feeling capable of completing this on my own. \n\nIf anyone has any advice on how to proceed, it would be greatly appreciated! TIA.",
  "author": "Gonutsfordoughnuts",
  "created": 1637307190,
  "updated": 1637415484,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl8ljuz": {
      "link": "/r/GradSchool/comments/qxb1xf/should_i_withdraw_my_first_publication/hl8ljuz/",
      "text": "Academics spend a lot of time writing things that end up being learning exercises, not publications. If you withdrew the paper, you would still have the knowledge that came from writing it.",
      "author": "IkeRoberts",
      "created": 1637316970,
      "upvotes": 6,
      "replies": {
        "hld2tk6": {
          "link": "/r/GradSchool/comments/qxb1xf/should_i_withdraw_my_first_publication/hld2tk6/",
          "text": "That's a good way of looking at it. Thanks!",
          "author": "Gonutsfordoughnuts",
          "created": 1637394299,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl8dua3": {
      "link": "/r/GradSchool/comments/qxb1xf/should_i_withdraw_my_first_publication/hl8dua3/",
      "text": "That depends on how much time\nAnd energy you have and want to devote to publishing this.\n\nYou could just hold onto it entirely and use it for future research if you’re going that direction; maybe use it as part of a dissertation if you feel inclined.\n\nOr you could try to break it up into some smaller papers that wouldn’t take as long to publish individually. You could possibly turn it into a meta-analysis and public multiple parts.\n\nIt’s also fine to not publish it. Every now and then, you have a project that you put a lot of work and effort into and sometimes it just goes nowhere. That’s okay. Hopefully it doesn’t happen a lot. But this might just be one of those things.",
      "author": "RandyFunRuiner",
      "created": 1637310451,
      "upvotes": 2,
      "replies": {}
    }
  }
}