{
  "sid": "r6uqpo",
  "link": "/r/GradSchool/comments/r6uqpo/mental_health_resources/",
  "title:": "Mental health resources",
  "text": "Are there options through campus resources or through private options (such as better help) for a learning coach? I need someone to be responsible to. Someone to check in with weekly, that will sit and work through priorities, help me with filling out a planner or calendar, know that that person will look at my productive time later and analyze how I’m using my time, let me panic about how long something will take, someone to process achievement anxiety with. That will hold accountability but also be gentle with my ADHD ass that has literally no executive functioning skills anymore. I want to talk about feelings for moments, \n\nAnd if not, I may need to considere a change of study and just make this!",
  "author": "esplitberger",
  "created": 1638407353,
  "updated": 1638481117,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmvkq7q": {
      "link": "/r/GradSchool/comments/r6uqpo/mental_health_resources/hmvkq7q/",
      "text": "There definitely should be someone on your campus who can work with you on things like this! Does your school have a counseling center or psychology clinic? Your campus resources should also give you a reduced rate for being a student.",
      "author": "MountainScience1433",
      "created": 1638409836,
      "upvotes": 1,
      "replies": {
        "hmvl7mm": {
          "link": "/r/GradSchool/comments/r6uqpo/mental_health_resources/hmvl7mm/",
          "text": "Thanks! I so far looked into the “counseling services.” But chickened out at the last minute. Because I don’t want to shit where I eat (don’t want to do my heavy psychotherapy with someone affiliated with school-much more comfortable working through that elsewhere) but felt really dumb about being a 35 old woman who has finally realized she missed all the skills they teach in kindergarten and doesn’t want to ask the grad program for a guided tour of basic study and productivity skills. \nI will rally my bravery and just schedule the meeting and see if they can help.",
          "author": "esplitberger",
          "created": 1638410047,
          "upvotes": 1,
          "replies": {
            "hmw4tnt": {
              "link": "/r/GradSchool/comments/r6uqpo/mental_health_resources/hmw4tnt/",
              "text": "I get the stigma and all of that, but this is less pooping where you sleep and more getting support where you work. You can always check your insurance coverage and see what options you have to go off campus, but if you find on campus resources to be convenient and helpful, I wouldn’t hesitate. And honestly, setting stuff up can be the hardest part. It’s really easy to put off. Once you find someone you feel comfortable talking to, it’s a lot easier to stick with it. \n\nAlso, you can always try, and if you don’t like it, go somewhere else. The campus counseling center may even have a list of local resources for you. \n\nGood luck! And congrats on taking this step.",
              "author": "StringOfLights",
              "created": 1638418878,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}