{
  "sid": "reotos",
  "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/",
  "title:": "Does anyone have experience with contesting a final grade?",
  "text": "Hi everyone, \n\nI was wondering if anyone here could give me some advice. I'm on academic probation this term and I need two B+'s to not be removed from the program, however, I received a 76 in one class where I need a 80 for an A. There are a few points on the final exam I believe I could contest and maybe bring my grade up, but I don't want to seem like I'm just grovelling for points. Does anyone have experience with things like this? I am at a loss and really don't know what to do going forward. I don't want to be removed from the program just because of these four points. \n\nThanks so much.",
  "author": "selfishshellfish8",
  "created": 1639314940,
  "updated": 1639518480,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 0.86,
  "comments": {
    "ho8wd9m": {
      "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho8wd9m/",
      "text": "How many points are available in the course and how many points do you think you can contest on the final grade? You’re 4 percentage points away from the threshold you need, so in a 300 point class you’d need 12 extra points from the final (which sounds pretty significant). \n\nI’m now on the other side as a professor… I’ve had students fight for 2 points on a final, I’ll give it to them, and then they realize they still need like 30 points to pass because those 2 points represent only a fraction of a percentage point in their final grade. \n\nIf you’re truly close after accounting for the entire course grade, then ask. But if the final exam points still leave you 3 percentage points away from passing, then there’s no point. \n\nAnd to be clear, there’s no magic way to not come off as groveling for points. That’s what you’re doing and there’s no way around that. You’re just in a situation where you may need to do that anyway *if* there’s a reasonable reason to add points. If you just want 4% added to your grade for no particular reason then that’s unlikely to happen.",
      "author": "WitnessNo8046",
      "created": 1639317883,
      "upvotes": 63,
      "replies": {
        "ho8wtjc": {
          "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho8wtjc/",
          "text": "Thank you for your response. I totally get that you're saying. The final was out of 45 points and it's 45% of the final grade, so it's a 1:1 ratio. The first problem I truly do believe was graded a bit harshly, and I think I could successfully argue that I deserve more than what's there. I appreciate your perspective, thanks",
          "author": "selfishshellfish8",
          "created": 1639318114,
          "upvotes": 15,
          "replies": {
            "ho8x71i": {
              "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho8x71i/",
              "text": "Ok if it’s truly 4 points and your probation is on the line then absolutely go discuss it with the professor (in-person if possible). Try to identify specific questions that you think you could receive points back on and why, and maybe try to identify like 6 points worth so if they deny some there may still be 4 points elsewhere. And do be ready to explain the probation thing, but also understand that it’s not their class that would be kicking you out (it’s your past performance). The second you make it about “I’m going to get kicked out because of your class!” you put them in a defensive position and annoy them. Be honest, be accountable for your own actions, and ask for grace. Be ready to ask for extra work to gain back those 4 points.\n\nAnd finally, understand if they say no. It sucks, but it’s ultimately their discretion and you are asking for an unfair advantage.",
              "author": "WitnessNo8046",
              "created": 1639318308,
              "upvotes": 37,
              "replies": {
                "ho8xk55": {
                  "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho8xk55/",
                  "text": "Yeah, absolutely. I totally get that. Thank you again",
                  "author": "selfishshellfish8",
                  "created": 1639318499,
                  "upvotes": 8,
                  "replies": {
                    "hoadubs": {
                      "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/hoadubs/",
                      "text": "Something I did once was volunteer to do an extra assignment they created if I could get the points needed for an A. In my case it was 3 points out of a 500 points class. So she had me write a 4 page paper on a topic of my choice and I got a point per page if she considered it good quality. Not saying that will work but you can suggest it as an idea if they feel it is unfair to give you points when they don't give the rest of the class points. After you've explained the situation this may help you get some leniency.",
                      "author": "origional_esseven",
                      "created": 1639339520,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "hobhwur": {
                  "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/hobhwur/",
                  "text": "> Ok if it’s truly 4 points and your probation is on the line then absolutely go discuss it with the professor\n\nIt doesn't matter how many points it is. 4% of the points in a class is 4% of the points. Whether the class is out of 100, 300, or 10,000 points, it's the same. I've never considered 4% anywhere close to the range I'd consider adjusting someone's grade. If it's 1% maybe I'll think about it.\n\nShit, this class is already handing out an A down to 80%. 76% is a C in any other class.",
                  "author": "yerfukkinbaws",
                  "created": 1639356485,
                  "upvotes": 1,
                  "replies": {
                    "hocc592": {
                      "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/hocc592/",
                      "text": "I’d consider it if the student could point out 4 points worth of places where I could actually justify giving points back. But I’ll admit that my classes are never 100 point classes so I can see how the scaling feels different.\n\nNormally I’d tell someone not to ask their professor for more points but if you’re about to get kicked out then this is a situation where you truly have nothing to lose by asking.",
                      "author": "WitnessNo8046",
                      "created": 1639370579,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ho976ob": {
              "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho976ob/",
              "text": "I agree with the other poster. Be honest why you are seeking the extra points.",
              "author": "raistlin65",
              "created": 1639322609,
              "upvotes": 7,
              "replies": {
                "ho9ben2": {
                  "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9ben2/",
                  "text": "Thank you so much for your advice",
                  "author": "selfishshellfish8",
                  "created": 1639324369,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ho8wxrz": {
          "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho8wxrz/",
          "text": "I also just need a B+ and I'm at a B right now, so the threshold for that might be different. I'll have to ask",
          "author": "selfishshellfish8",
          "created": 1639318175,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho9e214": {
      "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9e214/",
      "text": "Search on \"grade grubbing\" in r/professors for ideas.",
      "author": "IkeRoberts",
      "created": 1639325478,
      "upvotes": 10,
      "replies": {
        "ho9i9jf": {
          "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9i9jf/",
          "text": "Oh wow, theres a lot there. Will try my best to make my case without being too annoying or irritating, seems like tensions run pretty high in those threads",
          "author": "selfishshellfish8",
          "created": 1639327212,
          "upvotes": 5,
          "replies": {
            "ho9jm89": {
              "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9jm89/",
              "text": "Don’t pay too much attention to those threads. I’m an avid poster over there. That sub is a great space for venting, but it’s not indicative about what we think about most students most of the time. Your particular professor and your particular situation matter more, and if you do annoy your professor then they can come vent with us over there!",
              "author": "WitnessNo8046",
              "created": 1639327763,
              "upvotes": 4,
              "replies": {
                "ho9zj4z": {
                  "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9zj4z/",
                  "text": "Agreed. Being aware of the background noise the professors experience, and the attitude that some students bring, can be helpful for avoiding getting an unexpected reaction to a sincere request for help.",
                  "author": "IkeRoberts",
                  "created": 1639334008,
                  "upvotes": 6,
                  "replies": {
                    "hoa5rfw": {
                      "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/hoa5rfw/",
                      "text": "Makes sense",
                      "author": "selfishshellfish8",
                      "created": 1639336369,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "ho9k3kk": {
                  "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9k3kk/",
                  "text": "Thank you so much",
                  "author": "selfishshellfish8",
                  "created": 1639327957,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho9swwv": {
      "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9swwv/",
      "text": "I had a case where I was quite literally on the borderline between a B- and a B (as in, the difference was literally just how you rounded it), and when I got a B- I asked the prof if the B- could be rounded up to a B, as the program requires a 3.0 to graduate, and that was the last course I needed to take in the curriculum before focusing on research and advancing to candidacy. I needed that B to make the 3.0 minimum, as a B- would have put my GPA at something ridiculously right below 3.0 (like a 2.96 or something). \n\nShe \\*did\\* actually bump up my grade, but \\*only\\* because it was that borderline and it was the last course I had and the difference between the graduation minimum GPA or not.",
      "author": "DoctorWatchamacallit",
      "created": 1639331445,
      "upvotes": 8,
      "replies": {}
    },
    "ho9opln": {
      "link": "/r/GradSchool/comments/reotos/does_anyone_have_experience_with_contesting_a/ho9opln/",
      "text": "I had to contest a grade in a fluid mechanics class during grad school. It was a remedial course in my program and kind of important for progress. The best I could do was to explain my situation to my professor and ask that he look at the exams and homework for partial credit. We both know they are graded in a hurry with a multi-hundred person class. I also only needed a few points to tip the scales from the score I had.... To the score I needed. He knew I went to office hours and extra exam study sessions the TAs held. I got the 3 or 4 points I needed to tip the scale to a different range. It wasn't even a full percent of the course points. I don't know about your situation.",
      "author": "NormalCriticism",
      "created": 1639329794,
      "upvotes": 4,
      "replies": {}
    }
  }
}