{
  "sid": "q62z7e",
  "link": "/r/GradSchool/comments/q62z7e/i_took_a_leave_of_absence_a_few_months_back_im/",
  "title:": "I took a leave of absence a few months back. I'm contemplating if I still want to continue my Master's here in my home country.",
  "text": "Hi I'm from South East Asia (Malaysia) and I graduated with a Bachelor's degree in Civil Engineering from the US. I was very fortunate that my parents were willing to fund me throughout my undergraduate years. I went back home at the height of the pandemic last year, because I wasn't able to find a job. \n\nI then enrolled for Master's at a local university. I took a leave of absence for one year after completed my first semester (it was online based). I feel like I wasn't quite ready for my Master's just yet. I feel inferior at myself for lacking valuable working experience. And I still isn't quite sure which topic shall I pursue for my dissertation (although I'm very interested in bridge engineering and construction). \n\nI wanted to take some time off. I tried to look for work experience elsewhere, but there were no companies willing to hire me, even in my home country, either. Fortunately, my parents were willing to let me work in their consultancy company (I'm sorry if I sounded entitled here). It was bitterwork, but I'm glad that I enjoyed working in my parent's consulting company. \n\nHowever, I still feel like I'm stuck between hard rock and hard ground. I'm not sure if I want to move out of my country for better opportunities. I fear that I wasn't being able to get hired in my home country even with a Master's degree in Structural engineering. The only reason that I applied for my Master's in my home country before was because it was super affordable, and I could form my connections from there. \n\nNow I'm not sure of that anymore. \n\nI'm planning to apply for other universities in other countries, and I will not hesitate to move out if they are willing to sponsor me with assistantships. And no, I don't think I should ask my parents to fund for my postgraduate overseas. They have done quite enough for me throughout my life. \n\nI'm not sure if this is the right sub to ask. Should I stay or should I go?\n\nEdit: Sorry for the long rant here. I guess ima go to sleep now. It feels nice for writing stuffs out.",
  "author": "ruthlessdamien2",
  "created": 1633978768,
  "updated": 1634099732,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {}
}