{
  "sid": "qis4dy",
  "link": "/r/GradSchool/comments/qis4dy/i_must_be_very_conceited_to_think_someone_else/",
  "title:": "I must be very conceited to think someone else would want to pay for me to travel.",
  "text": "Tl;dr I had three major opportunities for free travel canceled last minute, but I don’t know why I would travel for free anyway because I am just a student \n\nI was supposed to go overseas for a research trip, but the pandemic canceled it. It turned out that professor invites a female student every year then becomes a sexual predator while isolated in the wilderness during research.\n\nNext I was supposed to go overseas as a chaperone for an undergraduate trip, only for it to conflict with another contract I am under, cancelling my travels 3 weeks before we left.\n\nFinally I was supposed to go to a conference cross country, only to find out two days before the conference that I could not get the funding I was awarded unless I was presenting there. \n\nI don't know why I thought someone else would want to pay for me to travel. Clearly I had my head up my ass to think that would happen. I'm not special, why would they want me? I'm not some famous scientist, I'm just a student. Anyone can replace me.\n\nIf I want to travel, I will have to pay for it myself. I have never had the opportunity to travel and come from a low income background. The prospect of travel seems out of my reach and it breaks my heart every time I lose out on something I thought I would get to do. But what led me to think any of this would even happen? I need to stop expecting other people to care enough for my company to send me anywhere.",
  "author": "Sriracha11235",
  "created": 1635561133,
  "updated": 1635780482,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.3,
  "comments": {
    "hillwad": {
      "link": "/r/GradSchool/comments/qis4dy/i_must_be_very_conceited_to_think_someone_else/hillwad/",
      "text": "Well traveling during grad school isn't really about whether people value your company or not.... Most people don't travel for leisure during grad school. It's either for research purposes or for presentation purposes. If people do travel for leisure, then yes they pay for it themselves.\n\nAside from the first incident, which thank god you missed out on that because that professor is a creep and a criminal, the other two just sound like misunderstandings. I'm not sure how your department does things, but mine sends out emails to grad student listserv when funding for conferences is available and they're pretty clear that you can only get funded if you are presenting. This might not be something that people automatically know, especially first gen students, so your department could have made that clearer. If those restrictions were spelled out, either in email communications or the application for funding, and you applied anyway, that's your fault. \n\nHowever, I don't think any of these circumstances are really a function of people not valuing your company. It makes sense not to give you money to go to a conference if you're not presenting. People who *are* presenting need that money, so sending someone who wants to go just because would mean taking that funding from someone who needs to be there. I'm not sure how you could even apply for funding if you didn't have anything to present....\n\nAnd if you *were* a famous scientist, people still wouldn't pay for you to attend a conference since tenured faculty have to cover their own expenses.",
      "author": "False-Guess",
      "created": 1635563840,
      "upvotes": 13,
      "replies": {
        "hilpc90": {
          "link": "/r/GradSchool/comments/qis4dy/i_must_be_very_conceited_to_think_someone_else/hilpc90/",
          "text": "It wasn’t posted anywhere I could find that conference funds were only for presenters.  They made it sound as if it was for professional development and networking as well. I understand why people presenting need it more but I wish it would have been clearer",
          "author": "Sriracha11235",
          "created": 1635565663,
          "upvotes": 3,
          "replies": {
            "hina1yd": {
              "link": "/r/GradSchool/comments/qis4dy/i_must_be_very_conceited_to_think_someone_else/hina1yd/",
              "text": "Then that sounds like a case of miscommunication. Like I said, not everyone is going to know that conference travel is limited to presenters only, since it's constantly emphasized that grad students should attend conferences for professional development and networking. Your department should make that clearer in the future, because not everyone has experience in academia. They could start by simply asking people what poster, paper, or research they are presenting at what conference, or by including a line in a student-wide email clarifying that these funds are only available to presenters (or both). \n\nHowever, the way you interpret the situation I think is what needs adjusting. It sounds like you are interpreting these things internally, like you are not good enough or that nobody wants to be around you, when there is nothing to suggest that. Miscommunications happen and it sucks when they do, but it's not about you personally.",
              "author": "False-Guess",
              "created": 1635604090,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "himi8bw": {
      "link": "/r/GradSchool/comments/qis4dy/i_must_be_very_conceited_to_think_someone_else/himi8bw/",
      "text": "Stop feeling sorry for yourself! Opportunities for travel will come your way someday, and when it does it’ll be that much sweeter. Count your blessings kid.",
      "author": "turtle-bob1",
      "created": 1635586663,
      "upvotes": 2,
      "replies": {
        "himuwpm": {
          "link": "/r/GradSchool/comments/qis4dy/i_must_be_very_conceited_to_think_someone_else/himuwpm/",
          "text": "I’m more angry at myself than sorry. I shouldn’t get my hopes up for things that shouldn’t happen",
          "author": "Sriracha11235",
          "created": 1635596107,
          "upvotes": -1,
          "replies": {}
        }
      }
    }
  }
}