{
  "sid": "r46xju",
  "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/",
  "title:": "Babies and Grad School",
  "text": "Dear mothers and fathers in grad school,\n\nHow do you make thesis progress while taking care of your baby? I have an almost 5-month year old. Fortunately, my advisor allowed me to take a semester off (while working whenever I can) when the baby was born in July. But I know if I want to graduate I got to work more productive. If it’s impossible to do both baby and the school, my mind says drop out of grad school. But at the same time I’m in the 5th year of a 7-year grad program. It’s so hard for me to make up my mind to send the baby to a daycare. Were you able to be in school+take care of the baby (or you’ve seen someone do that), I’d like to hear your experience.\n\n\nCheers to all the parents in grad school! ❤️\n\n\nP.S.: I’m in the US and my family is overseas so I can’t bring them here for extra help since the US embassy is closed due to pandemic. 😢",
  "author": "daisy_stoker",
  "created": 1638113742,
  "updated": 1639879694,
  "over_18": false,
  "upvotes": 107,
  "upvote_ratio": 0.93,
  "comments": {
    "hmf1r8j": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmf1r8j/",
      "text": "I use daycare for my son (older than yours) to make any progress. He loves his time there, and it means I can be productive and enjoy my time with him when I pick him up. When his daycare shut down last year due to Covid for a few months, I got almost no work done. If you are the sole or primary caregiver for your child, it is going to be extremely hard to try to take care of them properly and do your research well. If you're feeling guilty about putting your child in daycare, don't. Both him and I benfit from his time there in so many ways. Best of luck!",
      "author": "Zbotw",
      "created": 1638118354,
      "upvotes": 36,
      "replies": {}
    },
    "hmfav8v": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmfav8v/",
      "text": "I had my son during the summer between 2nd and 3rd years of grad school. We signed up for daycare 2 months before he was born, but didn't get a spot until he was 7 months old - when the pandemic hit and closed everything anyways. Our closest family is 9 hours away, and work full-time anyways. So I had no childcare until he was 15 months.\n\nMonths 3-6 weren't too bad. I taught an undergrad class with him strapped to my chest, and got work done while he was napping. After he became mobile, it was so much more difficult. I worked during his naps when I could, but I was usually so exhausted I didn't get a lot done.\n\nHe started part-time daycare (only 30 hours/week offered) at 15 months (he's now 29 months). It's just fantastic, for BOTH of us. He gets amazing care, tons of creative activities, and socializing with kids his own age. I get time to do non-mom stuff, which includes both working on my research and taking *some* time for myself. I still get so much of his happy waking time I don't feel like I'm missing out (and daycare sends us photos of all the cool stuff they get up to). The only downside is he has had a cold basically nonstop since the local elementary schools reopened.\n\nHowever, our childcare center has taken COVID extremely seriously and has strict precautions in place. Any child with any kind of cough must get a COVID test to return to school or be out for 2 weeks. Adults are masked all the time, and they at least try to get kids 2+ to mask (they don't enforce, which is reasonable at this age). Clean all toys and surfaces daily, keep windows open, play outside rain or shine. If they didn't, I wouldn't be comfortable with it.\n\nAt this point, I've pretty much decided I'll stay in until I either graduate or am forced out for taking too long. I want this, I have wanted it for a long time, I enjoy the work I'm doing, and the jobs I want mostly require a doctorate.",
      "author": "ariyaa72",
      "created": 1638122105,
      "upvotes": 17,
      "replies": {}
    },
    "hmf0y45": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmf0y45/",
      "text": "I did it because I had family who could take the baby every afternoon and a husband who was willing to give up a semester’s worth of weekends to be a solo parent while I finished my dissertation. If I didn’t have family to help, I’d have needed at least part time daycare. Unfortunately that was spring 2020 so that option would have been gone and so I’m therefore very thankful I had family to help!\n\nI’d consider looking into childcare options. There are full time and part time daycares, and you probably get decent rates and preference for admissions at your university’s daycare. You can also hire a part time nanny (not as expensive as some people think when you compare it to daycare), look into childcare sharing arrangements, or consider options where your husband (or whomever the baby’s father is) handles things while you work.\n\nIf you decide against childcare, I think your options become working during naps and at nights when your SO is home watching the baby. I think that’s totally doable when the end is in sight but I personally couldn’t have done it for two years. You may find you work well in that situation though. It’s all about what works for you! \n\nI will say if you can carve out 3 full days you might be able to get enough done. I found that working less frequently meant I could give more effort to everything I did—so I was actually super productive during those 3-4 days I’d work each week. That’s what I’m doing now because we’ve moved away from family and I didn’t want the kids in daycare right now because of covid. It’s not for everyone but it’s working for me and hubby now.\n\nIn short there are other options but I’d definitely consider childcare because it’s probably the easiest as far as giving you a close to normal working schedule e… but yeah it can be costly.",
      "author": "WitnessNo8046",
      "created": 1638118017,
      "upvotes": 25,
      "replies": {
        "hmf9ezk": {
          "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmf9ezk/",
          "text": "Thank you! I’m glad your family was there to help you last year. May be I also can make a schedule so that I can work when my husband takes care of the baby. Even if it becomes tough long term, at least until the embassy opens back up we will be able to manage it. By then the baby will be about a year or May be even more so I won’t feel as bad it’s now to leave her with a nanny or at a daycare.",
          "author": "daisy_stoker",
          "created": 1638121521,
          "upvotes": 5,
          "replies": {
            "hmh150s": {
              "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmh150s/",
              "text": "Since you are on a college campus, there are probably a ton of undergrads around who would be able to babysit / nanny and have somewhat flexible schedules. \n\nI know some folks who connected with other new parents through the grad union. They did a babysitting exchange- having each parent take the kids 1 day per week",
              "author": "robotscantrecaptcha",
              "created": 1638147683,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmfoaqv": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmfoaqv/",
      "text": "I have a 9 month old and defend tomorrow. I’m done with classes so have been working full time while writing my dissertation. Both my husband and I WFH so we’d been switching off watching the baby throughout the day. It was great that we got so much time with our baby but my productivity dropped through the floor. We just started a part time nanny share and it has been a game changer. If I could go back I would have tried even harder to secure childcare so I had time to focus and do my best (or at least better?) work. The key is working out a system so you get quality sleep and at least 2-3 hours to write each day. Without the sleep the writing time is a slog.",
      "author": "croissantito",
      "created": 1638127411,
      "upvotes": 5,
      "replies": {}
    },
    "hmf2ulh": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmf2ulh/",
      "text": "Finish the degree. The increase in income from having the degree will make a massive difference in the quality of life for your kid.\n\nDiscipline = freedom",
      "author": "SephoraRothschild",
      "created": 1638118814,
      "upvotes": 52,
      "replies": {
        "hmfc4b9": {
          "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmfc4b9/",
          "text": "I absolutely would not paint this as a matter of lacking discipline. It's not that OP doesn't have the motivation to continue her thesis; she wants to, but has to face the very real responsibility of taking care of her new child. Academia has this unhealthy obsession with people putting research above everything else in their life -- it's horrifically common in my field (chemistry) -- and it's not viable for the vast majority of people.\n\nIf institutions really want diverse researchers (women, racial/ethnic minorities, low-income/first generation), then they need to actually make it viable for otherwise-qualified people from all walks of life to engage in research. The existing paradigm heavily favors those who don't have children, those who have inherited wealth, and those who can afford to essentially put their lives on hold for 6 years to work 80 hours a week for essentially minimum wage. Apologies for getting off topic; I want to make sure that OP doesn't feel like she's lazy or lacking discipline if her parenting responsibilities end up overtaking her ability to complete her PhD.\n\nThat all aside, I agree with /u/SephoraRothschild that you should endeavour to finish your thesis. It'll pay off for you and your family -- you just need to work with your husband and your university in order to make it all possible. Best of luck <3",
          "author": "StilleQuestioning",
          "created": 1638122616,
          "upvotes": 78,
          "replies": {
            "hmjpcgl": {
              "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmjpcgl/",
              "text": "You're so right about the current paradigm of grad school favoring the privileged! It's something I've been thinking about a lot recently, especially since realizing almost everyone else in my program grew up wealthy.",
              "author": "eimhir",
              "created": 1638203634,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hmf9uv8": {
          "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmf9uv8/",
          "text": "Agree!",
          "author": "daisy_stoker",
          "created": 1638121699,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hmg6kw5": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmg6kw5/",
      "text": "I couldn't swing it (have 2 kids). Lost funding and couldn't afford childcare. Even if I graduated and got the median wage for phds in my field I would still just barely be able to afford childcare and taxes, so I'm currently on personal leave and don't intend to return. Basically, I could finish, but finishing would be immediately financially devastating to my family and would be unlikely to pay off long-term.",
      "author": "kitten_twinkletoes",
      "created": 1638134707,
      "upvotes": 3,
      "replies": {
        "hmo3g5y": {
          "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmo3g5y/",
          "text": "I get it, you did what’s good for you and your family. I have no doubt you took the best decision. Good luck!",
          "author": "daisy_stoker",
          "created": 1638284656,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmfv3od": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmfv3od/",
      "text": "I took care of my son while working on my dissertation and working 10 hours a week for an assistantship. Every time he napped or slept, my work hours started. I graduated after two years, and he was never in daycare during that time. I also didn't have any help from family. After I found the rhythm, I was actually more productive than before kids.",
      "author": "thinking_is_living",
      "created": 1638130148,
      "upvotes": 3,
      "replies": {}
    },
    "hmgwftt": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmgwftt/",
      "text": "Both my wife and I are in grad school with a two year old while both working part-time restaurant gigs with internships on top of it. It can be done. My best advice to you is time management. Make a weekly schedule of things you have to do weekly and stick to it. Being disciplined by my schedule greatly reduces my stress. Plus, I found that when you take things a week at a time your work doesn’t seem as daunting. Feel free to ask if you have any more questions.",
      "author": "Kilgore_Of_Trout",
      "created": 1638145589,
      "upvotes": 2,
      "replies": {}
    },
    "hmh3knf": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmh3knf/",
      "text": "In my experience, you can watch them while working up to the first year. After that, they need too much attention and it becomes neglectful to try to work while watching them.\n\nMy daughter was born when I had about 2 years left. I was more or less a stay at home dad for her first year, working during her naps and once my partner came home. It was tough but doable. While my PhD is in experimental biology, I was thankfully at a point where all I was doing was analysis and my PI (shockingly bc he’s an asshole) let me work from home.\n\nI could tell that my daughter was starting to feel ignored as she approached one year old, so we put her in daycare. We had to take out a loan for the money, which really sucks, but I’m trying to be as efficient as possible so I can graduate and get a job.\n\nEdit: it’s honestly a huge relief having the work week back to myself and my daughter loves daycare, so that helps a lot",
      "author": "gallaswirl",
      "created": 1638148807,
      "upvotes": 1,
      "replies": {}
    },
    "hmiodta": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmiodta/",
      "text": "Not a parent, but I’ve seen it done with a few people (including my parents!). My dad was doing his masters when I was 3 and my sister was a newborn. He even failed a course for missing class because my sister was being born lol. My mom is a teacher and never stopped working besides maternity leave. Dad watched us during the day and worked at night, mom worked during the day and watched us at night. My grandparents lived 10 minutes away, so wed go there often too. It was tough for a few years, but over 20 years later, the financial stability it’s provided outweigh the temporary stress. \n\nRight now, I know one co-PI in my project has a toddler and his wife is finishing her PhD. They switch off care duty, and also send it to daycare that’s provided by the school. There have been a few times where his kid can’t be in daycare bc they’ve been quarantined or are otherwise sick, and it seems like they prioritize whose work is currently more important. If one person has experiments to run or a paper deadline coming up, they get to work during the day/when needed and the other person just does their work at night. Might not be all roses and sunshine all the time, but it seems like an equitable arrangement.",
      "author": "happytransformer",
      "created": 1638183511,
      "upvotes": 1,
      "replies": {}
    },
    "hmgz17f": {
      "link": "/r/GradSchool/comments/r46xju/babies_and_grad_school/hmgz17f/",
      "text": "Grad school is a full time job. Raising a child is more than a full time job.\n\nMaybe you can sustain both if you've got a flexible partner, but I did that for a couple months during the pandemic when daycare shut down and there's no way I could do that for 2 years. And my work suffered greatly, too.\n\nMost people with full time jobs and children need to arrange for childcare. But if that's not family, I have no idea how you might begin to afford that on a grad student budget (childcare at a center would have been 90% of my grad school stipend). Maybe student loans? Maybe an au pair or a nanny share? Or maybe you can get other families in similar situations together and pool parenting responsibilities, so each of you watch 5 kids one day a week? (Or something like that). Maybe your partner can quit their job? If not, as much as I hate to say it, I don't think there's a realistic path to finish your degree.",
      "author": "30kdays",
      "created": 1638146730,
      "upvotes": -1,
      "replies": {}
    }
  }
}