{
  "sid": "qqibt3",
  "link": "/r/GradSchool/comments/qqibt3/scheduled_final_exam_blocked_by_professor_at_last/",
  "title:": "Scheduled final exam blocked by professor at last minute.",
  "text": "I’ve completed all required coursework. \n\nA few months ago I scheduled my final (oral) exam. I submitted my paper for review. We all agreed on a date and time. \n\nThe day before the scheduled exam, the chairperson calls me and says there are “concerns with the paper,” that “it’s not long enough,” and other nonsensical complaints. \n\nOkay. \n\nNever was given a page length requirement. Which is a stupid way to measure paper quality. Some writers are wordy and some are stoic. \n\nMy advisor has been consistently unhelpful in answering any of my questions regarding the oral exam. He generally answers questions with a question. Not helpful. \n\nWhat are my options?",
  "author": "Disastrous-Okra8906",
  "created": 1636506575,
  "updated": 1636656537,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.56,
  "comments": {
    "hk0fzin": {
      "link": "/r/GradSchool/comments/qqibt3/scheduled_final_exam_blocked_by_professor_at_last/hk0fzin/",
      "text": "To be blunt, your options are please read your damn graduate student handbook as all programs should have one! For example, my handbook specifically gives the guidelines for the oral exam paper, seminars, proposals, defense ect. Were we told this? Nope. But were expected to have looked at the handbook and would have seen it if we did. So start there.",
      "author": "Maskedxangel",
      "created": 1636507354,
      "upvotes": 12,
      "replies": {}
    },
    "hk0f65z": {
      "link": "/r/GradSchool/comments/qqibt3/scheduled_final_exam_blocked_by_professor_at_last/hk0f65z/",
      "text": ">there are “concerns with the paper,” that “it’s not long enough,” and other nonsensical complaints. \n\nIf you're going to treat their complaints as nonsense, you're not going to get very far. Best to take it very seriously.\n\nIf your committee is not giving you written feedback regarding their concerns with the paper, then you might want to try to go to talk to each individually in their office hours. Not by email. Be humble.",
      "author": "raistlin65",
      "created": 1636506987,
      "upvotes": 25,
      "replies": {}
    },
    "hk0hbsp": {
      "link": "/r/GradSchool/comments/qqibt3/scheduled_final_exam_blocked_by_professor_at_last/hk0hbsp/",
      "text": "I don't know how your program structures it, but in mine we laid out a *clear timeline* for committee members to provide feedback or concerns prior to the exam. For me, I had to submit a short version of the proposal about 4 weeks in advance, with initial committee feedback to be returned within 1-2 weeks. At the 2-week mark, I distributed the full document. I received feedback a full week in advance. \n\nIn other words, if someone hadn't expressed concern in advance (like NOT the day before) then I feel we probably would've moved forward anyways. I'd bring this up with your chair and inquire how it got to this point",
      "author": "Jwalla83",
      "created": 1636507956,
      "upvotes": 3,
      "replies": {
        "hk0yy6q": {
          "link": "/r/GradSchool/comments/qqibt3/scheduled_final_exam_blocked_by_professor_at_last/hk0yy6q/",
          "text": "That’s the thing. I’ve followed all rules and met all deadlines and all requirements. The grad handbook is vague on final exam specifics. When I ask for specifics from my advisor I get answers in the form of a question. That’s not advising. \n\nI’ve done my part.",
          "author": "Disastrous-Okra8906",
          "created": 1636516045,
          "upvotes": 1,
          "replies": {
            "hk0zhj6": {
              "link": "/r/GradSchool/comments/qqibt3/scheduled_final_exam_blocked_by_professor_at_last/hk0zhj6/",
              "text": "Well your part isn't done though, even if you've done everything correctly, because they're not letting you take your final exam. As unfair as it may be, you now need to check back in with them about what is going on and why the committee members didn't speak up earlier.",
              "author": "Jwalla83",
              "created": 1636516317,
              "upvotes": 11,
              "replies": {
                "hk2b8f5": {
                  "link": "/r/GradSchool/comments/qqibt3/scheduled_final_exam_blocked_by_professor_at_last/hk2b8f5/",
                  "text": "Yes. Go ask the involved people and not random ones on the Internet.",
                  "author": "ko_nuts",
                  "created": 1636550035,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}