{
  "sid": "qnnrbu",
  "link": "/r/GradSchool/comments/qnnrbu/rejected_for_a_scholarship_i_had_high_hopes_for/",
  "title:": "Rejected for a scholarship I had high hopes for.",
  "text": "It was only open to people who have served as previous interns for my organization. Current employment did not disqualify me - I made sure of that and it was reiterated to me after. I am pretty gutted over this rejection as I know that the applicant pool was not huge. \n\nThe president of the organization said to let her know if I had any questions. I am tempted to ask if there is any feedback that I could have that I could implement next year, but I am a little worried to push that boundary since I work there. Any advice or general comforts are most appreciated - I am feeling rather low and unimpressive.",
  "author": "HomoMirificus",
  "created": 1636155805,
  "updated": 1636656894,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.88,
  "comments": {
    "hjhh3dr": {
      "link": "/r/GradSchool/comments/qnnrbu/rejected_for_a_scholarship_i_had_high_hopes_for/hjhh3dr/",
      "text": "Asking for feedback is a great idea and typical of an application process",
      "author": "CuriousGeorgeVII",
      "created": 1636155889,
      "upvotes": 21,
      "replies": {}
    },
    "hji2hms": {
      "link": "/r/GradSchool/comments/qnnrbu/rejected_for_a_scholarship_i_had_high_hopes_for/hji2hms/",
      "text": "Asking for feedback is a good idea. The last time I got rejected from an RA position I had applied for, the PI actually followed up with good feedback and then ended up putting me on another project for showing interest after we chatted some more. That’s not a common experience by any means, but you should always feel okay about getting more insight on your work.",
      "author": "set_null",
      "created": 1636165619,
      "upvotes": 4,
      "replies": {}
    },
    "hjjr0qm": {
      "link": "/r/GradSchool/comments/qnnrbu/rejected_for_a_scholarship_i_had_high_hopes_for/hjjr0qm/",
      "text": "1. Don't think of it as a rejection of YOU, but rather an acceptance of someone else. It may just be that the candidate of all box-ticking candidates applied this year. Doesn't matter who we are--there is always someone more qualified. For EVERYTHING.\n2. The president asked for questions. Trust me--your supervisors are quietly cheering you on, and would LOVE to give you some advice for the next cycle. Asking for advice in this situation is NOT boundary stomping.",
      "author": "Recovering_Librarian",
      "created": 1636205445,
      "upvotes": 3,
      "replies": {
        "hjqxw0m": {
          "link": "/r/GradSchool/comments/qnnrbu/rejected_for_a_scholarship_i_had_high_hopes_for/hjqxw0m/",
          "text": "Thank you so much for this!!",
          "author": "HomoMirificus",
          "created": 1636333366,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}