{
  "sid": "qmkacc",
  "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/",
  "title:": "Considering leaving Grad after a month in.",
  "text": "I am a biotechnology graduate with a gap year during covid where I did a pg diploma in bioinformatics. I was accepted into University of Cologne for my Masters in Biological Sciences and am contemplating leaving the course after 3 weeks. It’s mainly because of 3 reasons :\n1. My lack of motivation to study the subject. This past year has been extremely rough on me and I couldn’t do a lot besides the diploma which was pretty easy because of online classes.\n2. I think I have lost interest in Biology in general and feel like moving towards the business and managerial aspects rather than stick to the research part.\n3. I literally cannot recall anything I did in undergrad. I am feeling so dumb and useless during the lectures and I feel like I can do something else with my life. \n4. I am figuring out a backup plan since I am an international student and a lot of money is involved. I have around a week to think it over.\nI am going through a major anxiety and depressive episode and feeling extremely lost. I never considered myself suicidal but I am feeling extremely negative about everything in life right now.\n\nI want some advice from the subReddit. I feel hopeless and fearful of everything. I have a supportive family but I also want to do something meaningful.",
  "author": "Shelly9999",
  "created": 1636031631,
  "updated": 1636138105,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.91,
  "comments": {
    "hjaiff0": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjaiff0/",
      "text": "This is a great reason and time to leave. No sunk-cost fallacy because you really haven't sunk that much time into this. You will only kick yourself for staying with something you already know you don't like if you continue. Grad school doesn't get *more* enjoyable as you continue (this from a 4th year PhD candidate). If you already know you don't want to do this, and have something in mind you would rather be doing, GO DO THAT! This isn't a competition to see who can survive grad school, and frankly, grad school is super toxic. Don't stay in a toxic environment because you thought you might want to do something when now you know you don't.",
      "author": "hiagha",
      "created": 1636039260,
      "upvotes": 25,
      "replies": {
        "hjajawd": {
          "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjajawd/",
          "text": "I'm taking a weekend to figure it out! The people are really nice! But I am already dreading thinking about the Thesis that'll be looming over me next year knowing full well my capabilities don't lie there. I have a job I can take back here and work until I can sort myself out.",
          "author": "Shelly9999",
          "created": 1636039598,
          "upvotes": 6,
          "replies": {
            "hjamny4": {
              "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjamny4/",
              "text": "I mean, it also wouldn't be the worst thing in the world to take a year leave and see how you feel. Your program *should* let you do this at the end of the semester, but they might try to push you out of the program because you are so new. If you think that you might want to come back, I would *really* advocate for leave instead of leaving the program entirely. It costs them nothing and makes it so you wouldn't have to reapply if you were to change your mind.",
              "author": "hiagha",
              "created": 1636040892,
              "upvotes": 4,
              "replies": {
                "hjay74m": {
                  "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjay74m/",
                  "text": "I am dreading the entire subject. So I'm not sure. I want go progress in my career. I just need to figure out the HOW. without having proper biological research involved.",
                  "author": "Shelly9999",
                  "created": 1636045324,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hja8ub9": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hja8ub9/",
      "text": "Someone more experienced please correct me if you disagree with what I've written here.\n\nI just started my PhD so don't expect accrued wisdom from me, but general advice I've been seeing is not to force yourself to work on a subject at this level. I can't imagine forcing myself doing that.\n\nAs a relevant anecdote, I did my undergrad in Physics which is a subject I really enjoy and would pursue it further from interest alone. Alas, I didn't want to base my career in a pure STEM field which brought me to a good compromise of going into energy engineering, which I love now! Was it a a great career choice? I hope so, but I know it's not optimal, and for a long time I considered branching into stats and finance or an economics MSc as a career starting alternative.\n\nBut as for my own opinion, I wouldn't force myself into a specialisation course in a subject that I wouldn't want to base my career on. Business/finance based courses at a masters level sound like great alternatives if you think you'll enjoy it, and look to me like good qualifications to have under your belt if you want to leave uni soon while not being constrained to a job market opened by your biotech degrees.\n\nAs for forgetting stuff from your undergrad, that's absolutely normal. The way I see it, after you learn the material well once, it leaves your working memory but makes it much easier to recollect/relearn when necessary.",
      "author": "yeast_revived",
      "created": 1636035397,
      "upvotes": 12,
      "replies": {
        "hja9l12": {
          "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hja9l12/",
          "text": "Yes. I am looking for management alternatives.\nIt's not just the forgetting part. It's more of Why am I still forcing myself to stay in this field. I can't understand that. I am trying to give myself a week to see if I study regularly and try to improve maybe I'll get my motivation back?\nI used to love the subject during bachelor's...Idk what happened",
          "author": "Shelly9999",
          "created": 1636035712,
          "upvotes": 4,
          "replies": {
            "hjaapk8": {
              "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjaapk8/",
              "text": "When it came to my subject choices, I treated my BSc as studying my hobby subject, with further qualifications being there to give me a grounding in a career path. I figured that I can always study more maths and physics in my own time (which I am yet to see!). \n\nMost courses have just started across universities so I'd like to imagine that it's still early enough to change paths. I'm sure that in a uni such as yours you should have someone to talk to about switching subjects. Do you have a personal tutor to talk to about your studies?",
              "author": "yeast_revived",
              "created": 1636036180,
              "upvotes": 5,
              "replies": {
                "hjak652": {
                  "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjak652/",
                  "text": "I have a course coordinator I am trying to get in contact with. The courses are extremely varied. I can try to generalize my subjects but then again I'm ending up with a MSc in Biology which doesn't have a lot of good job prospects without a PhD",
                  "author": "Shelly9999",
                  "created": 1636039935,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjajj2m": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjajj2m/",
      "text": ">I think I have lost interest in Biology in general and feel like moving towards the business and managerial aspects rather than stick to the research part.\n\nThere are two main reasons to get a graduate degree\n\nYou love learning the knowledge of the discipline.\n\nIt will help with your future career path.\n\nSo if some kind of business degree would be better for your career path, and you're no longer wanting to study biology, then switching seems like the right thing to do.",
      "author": "raistlin65",
      "created": 1636039686,
      "upvotes": 10,
      "replies": {}
    },
    "hjb53z3": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjb53z3/",
      "text": "If you are not interested in the subject matter then get out now. Grad programs are rough and you should enjoy the material which helps with the stress. If you don't enjoy it then it is twice are hard. The beginning is a perfect time.",
      "author": "Brohozombie",
      "created": 1636048006,
      "upvotes": 5,
      "replies": {}
    },
    "hjag75d": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjag75d/",
      "text": "Honestly, I don't think 3 weeks is even half the time required to come to this decision. A full-blown graduate degree is a much different beast than an undergraduate one or short postgrad diploma. I'd give it maybe a full semester before making the choice.",
      "author": "EtTuD2",
      "created": 1636038389,
      "upvotes": 11,
      "replies": {
        "hjaiu9t": {
          "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjaiu9t/",
          "text": "I know that. I actually had much different plans for my master's. I really didn't want a thesis based program in the first place. Under certain circumstances I had to end up choosing this line. There's a lot of money involved and visa as well so I have around a week or two to make my decision",
          "author": "Shelly9999",
          "created": 1636039420,
          "upvotes": 6,
          "replies": {}
        },
        "hje8ihc": {
          "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hje8ihc/",
          "text": "A Master's program in Germany is expected to take 2 years and works much the same as getting a Bachelor's degree (no general education in undergrad, no research in Master's programs).",
          "author": "No-Heart-1454",
          "created": 1636104602,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjb4sae": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjb4sae/",
      "text": "Whatever you do decide, please start reading the bylaws of your school and program.\n\nIn my opinion, you need to prepare for the logistics of the worst-case scenario, which is you leaving the program at this moment: how much is this going to cost you? Is it early enough so you can still drop classes and not pay full tuition? If you are on a scolarship, what are the logistics? If you leave now, how much is that going to cost you on the short term?\n\nI got stuck on a very stressful academic situation because of a scolarship and decided to stay because I could not afford to quit. See if there's a point in which you can do so in a way you can afford. If you can do it now, listen to your gut and do it.",
      "author": "docindeleite",
      "created": 1636047882,
      "upvotes": 3,
      "replies": {
        "hjb7pj6": {
          "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjb7pj6/",
          "text": "I am from India, and the program has no tuition fees but the living costs in Germany are high for me and that is what is costing me the most. I had previously looked into the course and deemed it manageable due to certain restrictions I thought I had. I didn’t know my parents would be supportive of me leaving the field. Now that I know better and am seeing that even if I finish this program….the prospects are very low.",
          "author": "Shelly9999",
          "created": 1636049021,
          "upvotes": 3,
          "replies": {
            "hjc5g6f": {
              "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjc5g6f/",
              "text": "In this case, the earlier you decide, the better for your living/financial situation, because you'd be saving money. Someone mentioned the sunk cost in the other comments and you're in a situation where this sunk cost is still low. It would be a different conversation if you decided to quit a few years in, instead of a few weeks.",
              "author": "docindeleite",
              "created": 1636062325,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hjdjfqd": {
          "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjdjfqd/",
          "text": "Yes , the scholarship is the only thing thats binding me. But i am scared that my grades are not going be that great. I so want to leave this program already.",
          "author": "rainofseptember",
          "created": 1636084848,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjdh7am": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjdh7am/",
      "text": "Hy, i feel like I need to connect with you because this is exactly how I am feeling right now. I started crying when I read each words. I am in molecular biology and every day seems like a never ending cycle. May be we can figure this out together. Just needed someone to talk to real bad.",
      "author": "rainofseptember",
      "created": 1636083618,
      "upvotes": 3,
      "replies": {}
    },
    "hjc9tmx": {
      "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjc9tmx/",
      "text": "My advice is to stay in the program until the end of the semester. See what your final results are.",
      "author": "grothendieck1",
      "created": 1636064120,
      "upvotes": 1,
      "replies": {
        "hjdsksv": {
          "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hjdsksv/",
          "text": "It's not even about the results at this point? I know I can manage it. It's more of I don't want to do this program in the first place",
          "author": "Shelly9999",
          "created": 1636090737,
          "upvotes": 1,
          "replies": {
            "hje10bh": {
              "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hje10bh/",
              "text": "A few more months won’t kill ya. You put so much work in to get to where you are, you may as well give it a shot.",
              "author": "grothendieck1",
              "created": 1636097733,
              "upvotes": 1,
              "replies": {
                "hje3bo3": {
                  "link": "/r/GradSchool/comments/qmkacc/considering_leaving_grad_after_a_month_in/hje3bo3/",
                  "text": "I'm considering that. I'm giving it a week at first. I have an accepted visa looming over me. That might turn into rejection if I don't decide. So there's a lot of financial problems I can't elaborate on",
                  "author": "Shelly9999",
                  "created": 1636099817,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}