{
  "sid": "qx080r",
  "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/",
  "title:": "am I expecting too much ??",
  "text": "My PI and the PI of the lab that's literally  next to mine through a connecting door are pretty close to each other, so students including I share lab equipment quite frequently. Some of the lab equipment in the neighbor lab are outdated and frequently break, and whenever I ask the lab's post-doc, his answer is always \"I don't know.\" It frustrates me to no end because there is no lab tech in either lab and my experiment schedule get stunted often.\n\nIs it normal that a post-doc that has been here over 5+ years have no clue how to fix something or even fail to try to find out what's going on? Or maybe I m having unusual expectations because in my lab, I am a de-facto second-in-command when it comes to lab equipment handling?",
  "author": "articlesarestupid",
  "created": 1637271279,
  "updated": 1637354604,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "hl6jasn": {
      "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl6jasn/",
      "text": "An important lesson you will learn in grad school- \n\nIf you want something done, do it yourself.",
      "author": "rustyfinna",
      "created": 1637275691,
      "upvotes": 44,
      "replies": {}
    },
    "hl6aths": {
      "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl6aths/",
      "text": "have you tried fixing this equipment yourself? You could learn a lot about how to keep things running. Keep in mind some equipment really should be looked at by the company’s service technician.",
      "author": "redditknees",
      "created": 1637272177,
      "upvotes": 15,
      "replies": {
        "hl6bsy5": {
          "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl6bsy5/",
          "text": "It's not mine so I have no authority.",
          "author": "articlesarestupid",
          "created": 1637272574,
          "upvotes": 2,
          "replies": {
            "hl6l4xr": {
              "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl6l4xr/",
              "text": "Sweet summer child, everything standing between you and leaving this liminal hellscape with your degree is your problem. You should talk to the advisors about it and work out a plan for keeping shit running, which may mean you are the one who keeps it running. I didn’t come into my PhD thinking I’d be a plumber, or an electrician, and yet here I am. It fucking sucks if you don’t have adequate support staff to do it, but you need to play the hand you’re dealt.",
              "author": "BoostMobileAlt",
              "created": 1637276476,
              "upvotes": 35,
              "replies": {
                "hl72jn0": {
                  "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl72jn0/",
                  "text": ">I didn’t come into my PhD thinking I’d be a plumber, or an electrician, and yet here I am. \n\nIt really is like that though 😂 I joke that I should have just become a plumber instead of going to grad school. I would probably make more money, feel less useless, and use a lot of the same skills 🤷‍♀️I think this is pretty normal, especially if you're using very specialized equipment or you don't have a lab manager or other support staff.",
                  "author": "imitationpeaches",
                  "created": 1637284344,
                  "upvotes": 10,
                  "replies": {
                    "hl7edji": {
                      "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl7edji/",
                      "text": "I could probably drop out and make a killing being a freelance lab equipment repairman. We should start a company and employ grad students part time that can fix specialized equipment. I’m a whiz at repairing spin coaters, ebeam and thermal deposition tools, all things glovebox, wire bonders, AFMs, vacuum pumps, PID controllers, tube hearths, and electrical connections. I’ve never listed it out before, holy crap! No wonder why this paper is taking so long to write!",
                      "author": "Funkybeatzzz",
                      "created": 1637289779,
                      "upvotes": 7,
                      "replies": {
                        "hl7h27o": {
                          "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl7h27o/",
                          "text": "Only in my masters right now, but I feel the same way.\n\nSomewhere over the last year I became the person to ask about anything going wrong with computers or GIS stuff even though my focus is geomorphology. Picked up surveying, graphic design, 3D modeling and CNC machining (a carry over from high school when I was interested in engineering), wood working, IT... the list keeps going...",
                          "author": "the_Q_spice",
                          "created": 1637290999,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hl7a6pu": {
                  "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl7a6pu/",
                  "text": "This reply is poetry in motion.",
                  "author": "Milch_und_Paprika",
                  "created": 1637287875,
                  "upvotes": 7,
                  "replies": {}
                },
                "hl76y6y": {
                  "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl76y6y/",
                  "text": "I guess. Lolz",
                  "author": "articlesarestupid",
                  "created": 1637286378,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hl6to9s": {
              "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl6to9s/",
              "text": "I know it feels like that but sometimes you got to do what you got to do to get your data",
              "author": "Ru-tris-bpy",
              "created": 1637280251,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hl6ecbf": {
      "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl6ecbf/",
      "text": "Depending on the equipment I don't think it's fair to expect a post-doc (or anyone) to know how to fix it. It's definitely an added bonus but it's not an expectation. I took 6 years to do my PhD and I wouldn't know how to fix any piece of equipment. We were fortunate enough during my PhD to have support staff who would help. If we ever ran into issues we just called the company. As a matter of fact, I'd be scared to tanker with any equipment in case I broke it more.\n\nEdit: I've actually only ever known 2 people who fixed things. One was an RA who later took a job with the support staff and one PI. No one else.",
      "author": "adnamanda",
      "created": 1637273612,
      "upvotes": 10,
      "replies": {}
    },
    "hl6tlcc": {
      "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl6tlcc/",
      "text": "A lot of post docs suck. Some are great some are not. And some scientists are good at fixing stuff and others are not. He may be lazy or just really have no idea how to fix it. Sounds like it’s time to either figure it out yourself or find someone else in the department to help you",
      "author": "Ru-tris-bpy",
      "created": 1637280216,
      "upvotes": 5,
      "replies": {
        "hl76w3k": {
          "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl76w3k/",
          "text": "It's fine if he can't fix it. What I don't get is how passive he is about the whole thing. I don't think he even bothered to call the technician for three weeks.",
          "author": "articlesarestupid",
          "created": 1637286352,
          "upvotes": 3,
          "replies": {
            "hl9rfki": {
              "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl9rfki/",
              "text": "He's just dead inside. Once you've had the stuffing kicked out of you a few times it becomes a lot harder to give a shit. I had something that in first year would have led me to panic email my supervisor, then spend the night trying to fix the problem. Instead I emailed her, gave a potential solution, and said If she liked the solution I'd implement it by next friday. I'm a little less passive as I still need to graduate (Finish this damnable PhD) but I get paid less than minimum wage so I'm not going to beat myself up cause it's not really my problem. I'll help people when I can, but I no longer get worked up about problems that don't lie in my path directly.",
              "author": "dmatkin",
              "created": 1637339186,
              "upvotes": 2,
              "replies": {
                "hl9yvsv": {
                  "link": "/r/GradSchool/comments/qx080r/am_i_expecting_too_much/hl9yvsv/",
                  "text": "It's true that we don't get paid well but the said post doc gets paid 50k+ per year.  Which is still not great IMO but far higher than minmum wage",
                  "author": "articlesarestupid",
                  "created": 1637342107,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}