{
  "sid": "pm7fc5",
  "link": "/r/GradSchool/comments/pm7fc5/course_based_ms_or_thesis_based_ms_in_computer/",
  "title:": "Course based MS or Thesis based MS in Computer Science?",
  "text": "Hi,I’m planning to apply for grad schools in Canada for Fall’22.My target is to stay in the industry even though I plan to get a PhD in USA after some time after MS,but want to get back to industry.In this case which should be the appropriate degree to get? Course based MS or Thesis based MS? Another concern is funding,the funding seems to be scarce and I heard the Canadian tech industry prefers people having done a course based MS to thesis based MS,can you guys shed some light about it?",
  "author": "GoddessaOfChaos",
  "created": 1631366868,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.76,
  "comments": {
    "hcgab9l": {
      "link": "/r/GradSchool/comments/pm7fc5/course_based_ms_or_thesis_based_ms_in_computer/hcgab9l/",
      "text": "To answer your question, you need to figure out what career path you want. Knowing that you want to work in the industry is a good first step towards that, but you also need to determine the type of position you want.\n\n\nIf you are not aiming for R&D roles, then a 100% taught based master is fine. If you are aiming for industrial R&D roles or roles outside of R&D that will ultimately require a PhD to avoid a soft progression cap, then it's preferable to have a master that includes a research portion (even if it's not a 100% research based master).\n\nIn Canada, many taught masters in engineering related fields are not purely course based (hybrid master), they have a thesis portion near the end. These types of masters are ideal for those who want to have an industrial job that requires a master or a PhD.\n\nIf you plan to do a PhD, you also need to consider that research experience is required to get into good programs, which you can acquire in the industry through R&D roles and/or in academia through a research/hybrid master. So if the universities you are aiming for do not offer a research component to their master programs, then it is better IMO to do a research master over a 100% taught master. This way, you will have the research experience required to get into good PhD programs and most industrial R&D roles. \n\nRegarding funding, research based master usually receive some funding, but it's not common for taught/hybrid master. You can always ask about TA or RAship opportunities to pay for your tuition. \n\nAlso, just FYI here are the reasons to do a PhD:\n1. You want to go into academia \n2. You want yo go into industrial R&D and the positions you want require a PhD\n3. You want an industrial position that require a PhD\n\nIf you are not in any of these positions, then you should worry less about any PhD program requirements and more about what the jobs you are aiming for requires. If you want a job that doesn't involve research but requires you to get specialized through grad studies, then a 100% taught master will be fine. \n\nAlso keep in mind that in the US, PhD programs are built differently to accommodate the fact that many students are coming directly from undergrad. They have hidden \"master\" requirements to complete inside of the PhD program (course work, exams, etc.), which is why PhDs in the US are 5-7 years compared to 3-4 years outside of the US. It's very hard to reduce the length of PhDs in the US since the master requirements are \" hidden\", so you would still be looking at completing 2 additional years compared to elsewhere even if you already have a master. Considering you want an industrial career, it might be worth looking at doing your PhD in Canada or EU/UK as well to reduce the time that you'll be spending away from the industry.",
      "author": "methomz",
      "created": 1631378462,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634067466
}