{
  "sid": "pytduc",
  "link": "/r/GradSchool/comments/pytduc/working_vs_being_in_school_where_do_you_thrive/",
  "title:": "Working vs Being in School: where do you thrive?",
  "text": "Hello all. Longtime reader, firsttime poster.\n\nI always knew I wanted to pursue graduate school, and for a bit I considered going straight from undergrad, but by the end of my BS, I was so burnt out that diving straight into a Master's program seemed impossible. I found a research associate position at a biotechnology start-up in my college town and found that I thrived in the industry environment. It was easier to get into a solid routine that promoted healthy habits, I was interacting with a more diverse array of people and though there was pressure to perform well in my role, it wasn't anywhere near what I felt in undergrad. I worked long hours, definitely 40+ hour weeks but I really didn't mind. Now, I'm a couple weeks into my MS program, and though I'm only a parttime student, I find myself facing the same struggles I encountered in undergrad. I know certain types of people just thrive more in certain circumstances. I have good friends who preferred studying/researching for their MS rather than going into lab for a company every day. \n\nSo I was wondering, where do you feel you thrive most: industry/the workforce or academia/school?",
  "author": "lastredcabin",
  "created": 1633037441,
  "updated": 1634100224,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hewijo4": {
      "link": "/r/GradSchool/comments/pytduc/working_vs_being_in_school_where_do_you_thrive/hewijo4/",
      "text": "I am not in grad school yet, but I have been working for the past 10 years as a software dev. I am Japanese - if you know anything of the work culture in Japan, for us it is extremely common to work very long hours and no overtime pay, so 50-60 hrs a week is my current norm while in industry. Also my company is very competitive so there is constant pressure to perform, constant external pressures from customers, constant rush to not fall behind for promotion, etc. \n\nI remember being in undergraduate and feeling entirely wiped out on something like 40 hrs of work on a busy semester when taking 20 credits. I feel that going back to that will actually be a relaxation compared to what I've got going on now lol",
      "author": "SnakesOnAllThePlanes",
      "created": 1633038857,
      "upvotes": 2,
      "replies": {}
    },
    "hexg45y": {
      "link": "/r/GradSchool/comments/pytduc/working_vs_being_in_school_where_do_you_thrive/hexg45y/",
      "text": "Kind of a different situation here since I work in concert/tour production but... alas, I have found myself in grad school!\n\nI've always been a pretty good student since I absorb things well in a classroom environment but, ultimately, I like what I'm learning in the classroom to translate to something I'd like to accomplish later. I couldn't wait to finish high school then managed to finish undergrad a semester early to be able to throw myself into working full time.\n\nNow in grad school, the work hasn't come to a complete halt since I'm doing productions within my MFA program. What has changed is that in an academic context, the stakes are lower. I can take more chances and mess up more than if I were setting up for something in an arena in Vegas. I can also continue networking through forming relationships with other students and teachers.\n\nWhile I'd say I \"thrive\" equally in both environments, I do tend to get jittery being held in one place for too long which school tends to do. But I also didn't realize how truly burnt out I was until COVID shut down my industry opening up the space for me to get my MFA. When I do go back to working full time, I want to take care of myself more than I did before.",
      "author": "Chiss_Navigator",
      "created": 1633055072,
      "upvotes": 1,
      "replies": {}
    },
    "hexskzc": {
      "link": "/r/GradSchool/comments/pytduc/working_vs_being_in_school_where_do_you_thrive/hexskzc/",
      "text": "In general, I do not thrive without structure, but at the same time love the freedom that grad school gives... well, I have mixed feelings. I think I would be happiest in a school-like situation if I had someone imposing hard deadlines for my work. I'm in my 5th year of a PhD and honestly it feels like i've gotten only marginally better at dealing with the lack of structure/ learning how to create my own structure. For example, I told my advisor last week I would have a paper to him today. Yesterday I confirmed it with him. This evening, I'm realizing I still have a few days of work left ahead of me and that everything I've been trying to get written in the last couple days should have slowly been happening over the last 4 months. Working consistently without external motivators is just not gonna happen for me, and I still don't know how to create those motivators. That's my argument for why I would do better in a more typical work environment.\n\nAll this said, I don't like the idea of getting back to a 9-5 schedule. It really bums me out thinking about it. I still value the flexibility of grad school. I think I'd thrive in some sort of a happy-medium situation.",
      "author": "theguiri",
      "created": 1633061706,
      "upvotes": 1,
      "replies": {}
    }
  }
}