{
  "sid": "r8sszw",
  "link": "/r/GradSchool/comments/r8sszw/applying_to_multiple_departments_in_the_same/",
  "title:": "Applying to multiple departments in the same school",
  "text": "I'm applying to schools for an MS degree hoping to start in Fall 2022. My area of interest is stream ecology and restoration. My career goal is government land and resource management work with USFWS, USFS, or the state level affiliates.\n\nMy state school has an extensive forestry program, a huge fish and wildlife department, and some microbiology professors studying fish disease with regards to dam removal. All of these intersect with my research interest. Is it weird to apply to 3-4 departments in the same school?\n\nIn addition, the school also offers an interdisciplinary environmental science MS, and advisors can be chosen from a any department. Would it be weird to apply here but also to Fish & Wildlife and list the same PI on both applications? The specific degree title doesn't make a difference for my career goal.",
  "author": "vvhynaut",
  "created": 1638634155,
  "updated": 1639518987,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hn7hqb8": {
      "link": "/r/GradSchool/comments/r8sszw/applying_to_multiple_departments_in_the_same/hn7hqb8/",
      "text": "It is not based on my experience. I applied to 2 departments in the same school and I registered different accounts for each application because they are actually in different portals. Also the application and judgements are indeed done by different people and no crossing. You should be fine.",
      "author": "lamyjet",
      "created": 1638634445,
      "upvotes": 4,
      "replies": {}
    },
    "hna6e9k": {
      "link": "/r/GradSchool/comments/r8sszw/applying_to_multiple_departments_in_the_same/hna6e9k/",
      "text": "I applied to multiple programs at the same university (I actually did this at two universities). At one university I got accepted to two programs and ended up having to decide between them, I luckily could still haggle for betting funding from one program who gave me less compared to the other program, even though they were at the same university, but bare in mind this isn't always the case.",
      "author": "daughtersofthefire",
      "created": 1638676233,
      "upvotes": 3,
      "replies": {}
    },
    "hncctze": {
      "link": "/r/GradSchool/comments/r8sszw/applying_to_multiple_departments_in_the_same/hncctze/",
      "text": "You are likely a very good fit for this school. \n\nYour best bet is to talk with the faculty advisor for the overall grad program to determine which exact thing to apply for. They have good routes for particular career goals, and certain advisor-department combiniations that are especially strong. Find the right one with their help and you are in great shape. \n\n If you just apply for a bunch of things without checking, you'll look as if you can't figure things out.",
      "author": "IkeRoberts",
      "created": 1638724134,
      "upvotes": 3,
      "replies": {}
    }
  }
}