{
  "sid": "r7eh2i",
  "link": "/r/GradSchool/comments/r7eh2i/i_quit_my_phd_todaybut_i_am_not_sure_how_to_feel/",
  "title:": "I quit my PhD today...but I am not sure how to feel about my supervisor's reaction.",
  "text": "I decided to quit my Phd. \n\nAbout a year ago, after finishing my master degree in my home country (Italy) I accepted a temporary research assistant position in Germany. I thought it was a good way to see if research suited me. I took over a project and then decided to start a PhD for which I wrote a proposal (that hasn't been accepted). However, after some time (I'll keep it short) I started struggling with self esteem, motivation and impostore syndrome. I was working on the project completely alone and got to a point where I started feeling depressed, maybe also because of the combined factors of adjusting to a new country and the lockdown. Point is I realized there are so many aspects I don't like about academia and to continue would mean to push my mental health to the limit. I nearly drove myself crazy over this decision because acknowledging that research isn't for me means to question so much I thought I knew about what I wanted in life and what would make me happy (and now I am pretty clueless).\n\nIn two weeks my contract ends and today I told my supervisor that I've decided to leave the PhD...it's been the thoughest words I ever had to say. He was very understanding in a way and I thanked him for it. \nBut then he also said that it would be quite unfair towards him if I would leave without publishing anything because \"he paid me for so long\" through this research assistant position which is basically a part-time teaching position.\nNow, I am not sure how to feel about this. During the last year I gathered data for the project, did some basic descriptive analysis and started trying out some more complex analysis. I am aware that in scientific research your productivity and work are only  valued once you actually get something published (which, in my experience, rarely happens in the first year), so I understand his point of view and already feel guilty and ashamed because of it. But I also feel blackmailed somehow: the only way I can leave on good terms and with my self esteem and dignity half-intact is if I get something published, which means working on this without any income and while trying to figure out what I will do next in my life. And all because I should have realized earlier that a PhD wasn't for me. \nI am applying to other jobs and got my fair share of rejections, I am under pressure to learn the language and if it all fails and I finish my money I also have to consider moving back home. I have no idea how to do this now.\n\nI would like to receive some insights and opinions regarding this. I am not sure how to feel about my supervisor's words and reaction. \n\nThank you so much in advance!",
  "author": "cladg92",
  "created": 1638471480,
  "updated": 1638481090,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hmytb5o": {
      "link": "/r/GradSchool/comments/r7eh2i/i_quit_my_phd_todaybut_i_am_not_sure_how_to_feel/hmytb5o/",
      "text": "You don't owe him anything - this kind of thing is shockingly common. The beauty of quitting is that you are not beholden your supervisor in any way. If you are feeling like you're close to publishing and you want to *do him a favor* then you could keep working and try to wrap it up in your free time, but to me it sounds like you don't want to do that and that is totally fine. That's why you're quitting. The best feeling in the world for me once I finished my PhD was politely explaining that I was no longer in the lab to my old supervisor and then ignoring his emails (this is probably only advisable if you're leaving academia like I did). But yeah, don't let yourself be guilt tripped into continuing to do the work you don't want to do after you've quit. You don't have to do that.",
      "author": "drz112",
      "created": 1638471885,
      "upvotes": 10,
      "replies": {}
    },
    "hmyu9h1": {
      "link": "/r/GradSchool/comments/r7eh2i/i_quit_my_phd_todaybut_i_am_not_sure_how_to_feel/hmyu9h1/",
      "text": "So, what you have to do is give them the data. That's it. Maybe don't be an ass about it and sort and organize and comment it. Maaaaybe offer to eyplain the details to someone.\n\nThe only reason for you to actually analyze the data and write something is if you were to want to stay in research/academia. If you don't, don't do it. Not sure if you ever published something, but if you only got some data and some analysis you would have a ton of work ahead of you! Given how you describe your situation with said supervisor so far, I'll be inclined to say that you will be miserable. It will frustrate you to no end to start this endeavor alone and drain a lot of energy that you can probably better direct to something else.",
      "author": "sneleoparden",
      "created": 1638472252,
      "upvotes": 4,
      "replies": {}
    },
    "hmyue0h": {
      "link": "/r/GradSchool/comments/r7eh2i/i_quit_my_phd_todaybut_i_am_not_sure_how_to_feel/hmyue0h/",
      "text": "Don’t feel pressured to do anything. See it as any other job - you tried it, you didn’t like it, you quit. Yeah it sucks if someone quits mid project or leaves some work unfinished but that’s how it is. If he wants to get a paper he can hire another RA to pick up where you left off and they can write it. You do you and don’t give this project a second thought.",
      "author": "fjkfjldsls",
      "created": 1638472301,
      "upvotes": 3,
      "replies": {}
    }
  }
}