{
  "sid": "rf3jjt",
  "link": "/r/GradSchool/comments/rf3jjt/what_do_you_do_when_you_lose_interest_in_your/",
  "title:": "What do you do when you lose interest in your research?",
  "text": "So, here's the story: I'm on a master's program and currently trying to write my thesis. This degree has been full of ups and downs (from having to switch my supervisor, struggling to find the exact topic I could research during this pandemic, and managing it with a full time job). But throughout the whole thing, I've always been motivated and interested in the program and in the research that I wanted to do. It was hard, but I've always wanted to keep going. \n\nBut now, I've hit another setback (and had to switch my entire research design & methods) and I feel like I just really don't have the motivation anymore. I was planning on finishing my degree by April, but now I feel like I don't have enough time, and even when I do sit down to try to work on my research, I just can't focus on it and everything seems extremely boring (even though it is something that I've been interested in for a long time). It doesn't help that I have ADHD, and am incapable of getting myself to do things I don't want, which makes it impossible to write this thesis when I'm not in the mood for it.\n\nI know other people in grad school also struggle with losing interest from time to time, so I guess I'm looking for strategies on how to get back on track. How do you stay motivated?",
  "author": "cancanm",
  "created": 1639358643,
  "updated": 1639518474,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.85,
  "comments": {
    "hobtmfg": {
      "link": "/r/GradSchool/comments/rf3jjt/what_do_you_do_when_you_lose_interest_in_your/hobtmfg/",
      "text": "Let me guess: youve largely finished the bench work and you are primarily doing the writing now? If so I was in your EXACT shoes. I thought everything was meaningless, I hated the thought of writing my research, etc. I hadnt been diagnosed ADHD so I got on Adderall and that helped a LOT but a lot of it is just powering through it. You really wont find some magical motivation to make you love writing. \n\nSome advice might be to do one section (materials and methods is easy) and ask your PI to give you some feedback. Once you have one section of one part of your thesis completely done, it makes it so much easier to stomach the rest because it gives you some confidence that you can do the rest. If your PI gives you some criticism, at least you didnt write the whole thing just to have to edit it all! You get some guidance on one part to apply to the rest to avoid major changes later. Try to write one section a day after that and it really will come together. Its gonna suck but it just has to get done. It will feel euphoric once its done though.\n\nI think a lot of it (for a MS/MA student) is never having written a piece of research lit like this before so its kind of scary - you dont know if you will do it right and its the culmination of your grad school experience. For a PhD student, there are more opportunities to write over a longer period of time with feedback. \n\nYou got it though.",
      "author": "GayMedic69",
      "created": 1639361835,
      "upvotes": 11,
      "replies": {
        "hoc25dh": {
          "link": "/r/GradSchool/comments/rf3jjt/what_do_you_do_when_you_lose_interest_in_your/hoc25dh/",
          "text": "That is good advice :)\n\nI'm not at the writing stage yet, still collecting data. I think part of why I lost my motivation was because I basically had to redesign my research almost from scratch after about 4 months. I know it's pretty common for people to have to redo things and restart, but damn it's hard lol\n\nBut I like what you said about doing it a bit at a time! I feel like that's been super helpful for me while I'm writing my lit review.",
          "author": "cancanm",
          "created": 1639365722,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hoctz1y": {
      "link": "/r/GradSchool/comments/rf3jjt/what_do_you_do_when_you_lose_interest_in_your/hoctz1y/",
      "text": "To be honest, I hate my project, the school, location, etc. so motivation is incredibly hard and I have struggled with it a lot. I try to set mini deadlines for myself to break up the work. Even if I don’t meet the deadline I then feel guilty about slacking so I get it done. I also motivate myself by thinking about the ways the degree is going to help me. I’m a year into a 2 year program so I’m halfway done and at this point I’ve done too much work to leave now. So I also use the motivation of moving to a state I actually like and doing work I actually like to get the degree done as well.",
      "author": "JustTheFishGirl",
      "created": 1639382426,
      "upvotes": 6,
      "replies": {}
    }
  }
}