{
  "sid": "r4wpo7",
  "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/",
  "title:": "Does research always have to be long?",
  "text": "I am thinking about going to grad school next year after I graduate this December, but I’ve never done research before. My girlfriend just finished her honors thesis and it took her a year and a half to finish it. I was wondering if all research is this long or big. Or is it just some? Or most? Or your choice? Sorry for the ignorance!",
  "author": "GaryAbusivPaulaTeeks",
  "created": 1638195211,
  "updated": 1639877058,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hmj73pj": {
      "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmj73pj/",
      "text": "Most research based masters will probably take at least a year and a half, often at least 2 years. For PhD, at least in the us, most programs are going to take 5+ years, though some people are able to finish in 4. Id recommend trying to find some sort of research experience before you apply however, and taking a year or so to do that, both to figure out if you enjoy research and to boost your application, especially if you’re interested in a PhD, if you’re interested in a masters that may not be necessary.",
      "author": "wondererererer",
      "created": 1638195444,
      "upvotes": 6,
      "replies": {
        "hmjcxwm": {
          "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmjcxwm/",
          "text": "What are some ways that I could get research experience after I graduate (but before attending grad school)?",
          "author": "GaryAbusivPaulaTeeks",
          "created": 1638198258,
          "upvotes": 1,
          "replies": {
            "hmjelzs": {
              "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmjelzs/",
              "text": "It would depend slightly on your field. Research assistantships are pretty common, post-bacc positions are also good, and seem especially common in biomedical-leaning research. Research leaning industry experience can also work, and I think is more common in fields like computer science or engineering.",
              "author": "wondererererer",
              "created": 1638199016,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hmjpsds": {
          "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmjpsds/",
          "text": "But MSc (not MRes) are like undergrad right? A semester of study and a semester of thesis?",
          "author": "Sadrien6",
          "created": 1638203816,
          "upvotes": 1,
          "replies": {
            "hmjrcos": {
              "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmjrcos/",
              "text": "There’s a huge variance in programs. There are masters with and without a thesis option, the former tends to be designed for those who hope to continue in academia, where as the latter tends to be a good option for science educators or those wishing to go into industry or other professional programs. Length will also vary by program, though I haven’t really heard of many under a year and a half in biological sciences. If you plan to do a thesis based masters it will likely take up to two years, especially if you need to either work as a research assistant or TA for funding.",
              "author": "wondererererer",
              "created": 1638204457,
              "upvotes": 1,
              "replies": {
                "hmkfzmf": {
                  "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmkfzmf/",
                  "text": "Thanks for the help!\n\nI study in the UK, and majority of bioscience masters are 1 year full time (for both MRes and MSc). The differences are rather confusing when you also look at PGCert and PGDip.",
                  "author": "Sadrien6",
                  "created": 1638214327,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmjkybg": {
      "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmjkybg/",
      "text": "My PhD directly out of undergrad will take just a smidge over the 4 year mark (4 years being the minimum time for my university given no prior masters degree). It's really a matter of how self organized you are. I am following up form a masters student who took  4 years for his degree cause he let my supervisor run him around the garden path with random other projects which weren't enough to graduate on according to her. It's really a matter of if you're able to say, okay this is my project, and stick to it without flitching for the needed time how long it'll take. \n\n&#x200B;\n\nP.S. break yourself out of the habit of feeling sorry for ignorance, nobody knows these things until they're either told or learn through experience. Learning academic jargon gets annoying but you need to make sure you ask as soon as it comes up or you'll be wondering what X actually means forever.",
      "author": "dmatkin",
      "created": 1638201792,
      "upvotes": 3,
      "replies": {}
    },
    "hmjk18j": {
      "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmjk18j/",
      "text": "My program is 2 years. Couldn’t graduate earlier even if you tried as you’re supposed to follow the timeline. Taking longer is common, taking less time is not.",
      "author": "ThePoliteCanadian",
      "created": 1638201404,
      "upvotes": 1,
      "replies": {}
    },
    "hmkn3g0": {
      "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmkn3g0/",
      "text": "It depends on what you mean by research but it generally does take a long time. You first have to read (almost) everything that was done by other researchers on the same topic. After that you have to find a question that you can answer. Finally you have to actually find a way of answering that question and answer it.",
      "author": "local_man_says",
      "created": 1638217191,
      "upvotes": 3,
      "replies": {
        "hmkqldr": {
          "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmkqldr/",
          "text": "How much research do you typically do in a masters and PhD program?",
          "author": "GaryAbusivPaulaTeeks",
          "created": 1638218597,
          "upvotes": 1,
          "replies": {
            "hmks6tk": {
              "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmks6tk/",
              "text": "In a masters program it might only be a semester's worth of research, not including any smaller projects. For a PhD research can be 2-5 years, but that is because the questions you try to answer during a PhD are more difficult to answer.",
              "author": "local_man_says",
              "created": 1638219229,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hmkxe6d": {
      "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmkxe6d/",
      "text": "Yo that totally depends on your field and research. Ive done an experiment in one week and ive had experiments involve 7 day weeks for several months at a stretch.",
      "author": "Pr0gr3s",
      "created": 1638221290,
      "upvotes": 2,
      "replies": {}
    },
    "hmm367x": {
      "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmm367x/",
      "text": "Totally depends on the subject matter and scope of what you’re investigating. If you’re just looking for experience, find a university faculty member and ask them for help making a literature review of a topic that interests you. You can crank out a quality paper (low impact obviously but again, experience) in a couple months that way.",
      "author": "grilledsneeze420",
      "created": 1638239681,
      "upvotes": 2,
      "replies": {}
    },
    "hmkebwf": {
      "link": "/r/GradSchool/comments/r4wpo7/does_research_always_have_to_be_long/hmkebwf/",
      "text": "In most cases, PhD takes 4+ years (even in Europe and even after Masters). It takes longer if the project idea is very fresh and nobody was working on it before. You can be limited in time due to funding, but then you can apply extent. There are few examples, when people could get PhD after 3 years, but they worked 24/7 :)",
      "author": "cozy-scholar",
      "created": 1638213662,
      "upvotes": 1,
      "replies": {}
    }
  }
}