{
  "sid": "rh9l1v",
  "link": "/r/GradSchool/comments/rh9l1v/winston_churchill_suffered_from_imposter_syndrome/",
  "title:": "Winston Churchill suffered from imposter syndrome.",
  "text": "I’m currently listening to to the audio version of Andrew Robert’s biography of Winston Churchill. Based upon his account it seems that when Churchill was a young man, he suffered from imposter syndrome. He always felt like he was no good, or never good enough. Even though his school records demonstrate he did very well in school. \n\nI guess the point I’m trying to make is, all great people often don’t know how great they are.",
  "author": "MrUnknown1996",
  "created": 1639602988,
  "updated": 1639788542,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hopcvoy": {
      "link": "/r/GradSchool/comments/rh9l1v/winston_churchill_suffered_from_imposter_syndrome/hopcvoy/",
      "text": "I'd be wary of any account that claims to retroactively diagnose someone, and wouldn't do that myself either. Unprofessional and unacademic. Also, Churchill was responsible for some pretty horrendous stuff. But in terms of sheer, unmerciful ambition to gain and hold onto power, yeah, he did that. \n\nHistorical accounts, including actual quotes from Churchill, inform us that he believed he was destined for greatness rather than that he was just working super hard to fulfill a dream he didn't believe he could achieve. He had his insecurities just like any of us, but he certainly did not have the self-reflection or self-imposed limitation that your average grad student puts on themselves.",
      "author": "ProprioCode",
      "created": 1639607472,
      "upvotes": 5,
      "replies": {
        "hopgd3j": {
          "link": "/r/GradSchool/comments/rh9l1v/winston_churchill_suffered_from_imposter_syndrome/hopgd3j/",
          "text": "I came to say the same thing. Churchill is often looked at the for the good he did for Britain during WW2. That is true but you should also realize that he purposely allowed a giant famine in India that killed thousands of people.",
          "author": "Dm_Glacial_Gatorade",
          "created": 1639608917,
          "upvotes": 2,
          "replies": {}
        },
        "hopdeby": {
          "link": "/r/GradSchool/comments/rh9l1v/winston_churchill_suffered_from_imposter_syndrome/hopdeby/",
          "text": "It’s true that Churchill wasn’t perfect. But nobody complained when he took down someone who was even worse than himself.",
          "author": "MrUnknown1996",
          "created": 1639607687,
          "upvotes": 1,
          "replies": {
            "hopdvct": {
              "link": "/r/GradSchool/comments/rh9l1v/winston_churchill_suffered_from_imposter_syndrome/hopdvct/",
              "text": "What? Who? Nobody... complained? Yes, yes there was absolutely a lot of negative commentary about Winston Churchill, throughout his career. He was in politics - nobody stays in politics without fighting dirty. Nobody.",
              "author": "ProprioCode",
              "created": 1639607881,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hoqfhdy": {
      "link": "/r/GradSchool/comments/rh9l1v/winston_churchill_suffered_from_imposter_syndrome/hoqfhdy/",
      "text": "He was also anxious about public speaking. Which you would never know from listening to some of his speeches. \n\nOne trick he used was to write out his speeches in poetic form rather than paragraphs. So he would know where to pause. Never tried it myself, but it sounds like a great technique.",
      "author": "raistlin65",
      "created": 1639624535,
      "upvotes": 2,
      "replies": {
        "hos0sdt": {
          "link": "/r/GradSchool/comments/rh9l1v/winston_churchill_suffered_from_imposter_syndrome/hos0sdt/",
          "text": "I might have to try that too.",
          "author": "MrUnknown1996",
          "created": 1639661605,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}