{
  "sid": "q04ugd",
  "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/",
  "title:": "I only have 4 classes to go but I can’t stop thinking of dropping out",
  "text": "I started my MS in clinical mental health counseling at Johns Hopkins in 2020. A few weeks in we switched to online because of the pandemic. Since then, I have felt constant burnout, fatigue, anxiety, stress and haven’t felt like myself. The demands are so high, and despite having a 4.0 gpa, I never feel like I am doing things right. Now that I have started my field work experience with clients, I constantly feel like I am exposed to secondhand trauma. I have good supervision and a therapist, but I feel so emotionally drained from school & internship. I don’t want to give up because I am so close to graduating and everybody is so proud of me, but honestly the thought of another week, month, or semester makes me want to retreat into a cave and disappear. I’m so tired I just want it to be over",
  "author": "cuteliluf0",
  "created": 1633213499,
  "updated": 1637416719,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.88,
  "comments": {
    "hf5vjqt": {
      "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/hf5vjqt/",
      "text": "Have you looked at your program’s policy on leave? I was in a similar (though not identical) place last year and knowing I had the option to take up to a certain number of semesters off without having to start over was a relief. I ended up not utilizing the option (not yet, anyway!), but  it has helped me feel less trapped.",
      "author": "mikgub",
      "created": 1633219864,
      "upvotes": 6,
      "replies": {}
    },
    "hf5zdap": {
      "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/hf5zdap/",
      "text": "Hey, fellow counseling student here. If you’re already feeling this impacted by secondary traumatic stress you might want to think about a career change. I also thought about dropping out during lockdown when classes were all virtual, but seeing my clients has invigorated me and I can’t wait to graduate and do this full time. If that’s not how you feel, this may not be right for you. My DMs are open if you ever wanna talk",
      "author": "Prize-Salamander-789",
      "created": 1633221588,
      "upvotes": 6,
      "replies": {
        "hf6l57t": {
          "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/hf6l57t/",
          "text": "I disagree, things are hard for everyone, it doesn’t mean they need a new career. It sounds like they just need a break, an internship and classes at the same time are already stressful, way more stressful than when they go into their career.",
          "author": "artteacherthailand",
          "created": 1633232213,
          "upvotes": 4,
          "replies": {
            "hf6lspi": {
              "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/hf6lspi/",
              "text": "The experience of secondary traumatic stress in the counseling profession is very different than just being burnt out on school and work. Many people leave this profession over it. In their career, OP will be working with far more people and exposed to much more pain than they are right now. It is just not comparable to regular overwhelm and burnout.",
              "author": "Prize-Salamander-789",
              "created": 1633232579,
              "upvotes": 1,
              "replies": {
                "hf6newx": {
                  "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/hf6newx/",
                  "text": "I understand that secondary traumatic stress is not the same as general burnout, which is why I mentioned breaks. Experiencing STS is not a write-off for a career. It means that the individual will have to take care in how they work, in how they care for themselves. People leave their profession over it because they don't prioritize that care, and we don't have good systems of that kind of care being utilized without stigma. And to dismiss that there are other factors that can contribute to this stress isn't considering the whole picture. It's fine that you are invigorated by your work and future, but not feeling that same level of invigoration doesn't mean someone is in the wrong profession.",
                  "author": "artteacherthailand",
                  "created": 1633233470,
                  "upvotes": 2,
                  "replies": {
                    "hf6pjfh": {
                      "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/hf6pjfh/",
                      "text": "Which is why I used the wording “might want to think about” and “may not”. A break and a better support system might help, or it might just not be a professional fit, and that’s okay.",
                      "author": "Prize-Salamander-789",
                      "created": 1633234648,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hknai8x": {
      "link": "/r/GradSchool/comments/q04ugd/i_only_have_4_classes_to_go_but_i_cant_stop/hknai8x/",
      "text": "a short update: I am feeling much better, and although I am still towing the line between burnout and productivity, I think some of the clients I was working with were just not a great fit. The last internship site I worked at didn’t allow me to select my own clients, so I was just taking whoever I got. Now that I have an established caseload I am able to tailor who I work with and have been able to identify what goodness of fit feels like for me, I notice when a client consistently drains me, vs a client who I work with who I actually feel my energy is sustained by. I also think transitioning from IRL to online back to IRL and moving across the country 3 times since the start of the pandemic was contributing. \n\nTLDR; I’m feeling much better",
      "author": "cuteliluf0",
      "created": 1636929263,
      "upvotes": 1,
      "replies": {}
    }
  }
}