{
  "sid": "kyxjju",
  "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/",
  "title:": "Oof, alcoholism and grad school",
  "text": "I've had a not so hot relationship with alcohol and many members of my family have struggled with alcoholism. Obviously, being a good neurosci student I would take precautionary measures.  But I'm not a good neurosci student and I thought I had a handle on things. For a while I was a \"functioning\" alcoholic and then, well, I wasn't functioning. I'm 12 days sober, not long I know but it's a milestone for me, trying to pick up the pieces of how I could be so stupid. But our lab is highly social and everyone likes to drink. I want to raise the opinion of not doing social outings (allowed where I am, to a limited party #) at bars, without raising massive red flags that I'm struggling. We don't have these outings often at all anymore, last one was months ago, but I want to be prepared for when things start opening up more. I'm extremely embarrassed and frustrated with myself so trust me when I say I know how unprofessional this is. I'm a nontraditional grad student (worked for many years after undergrad before going back to school) and that makes the pressure to be a good role model that much more intense because I'm like the \"mom\" of the lab group. I want to do good science, I love my science, and I want to be a good role model for my younger cohort, or at the very least, not be a bad one. I can't do that if I'm struggling with alcoholism. I have to do better than this.",
  "author": "International_Bat768",
  "created": 1610851277,
  "over_18": false,
  "upvotes": 447,
  "upvote_ratio": 0.99,
  "comments": {
    "gjpenxr": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjpenxr/",
      "text": "Congratulations on recognizing something important in yourself that needs to be addressed. While I don't have this particular challenge I have struggled with opioids. Doing what you did isn't easy but recognizing you need to address it is a huge step.\n\nMy only real advice is to think before you act. Ask yourself why you crave things. Why your triggers exist. What about them makes them tempting and how you recognize them early on, before you have a chance to act on them. To me it felt like learning to look further down the road when I was driving. I could anticipate my needs by anticipating what I was going to encounter at the next bend in the road. Life keeps giving you bends in the road but you can learn to look for them and anticipate them with *help and practice.* Seek out help from alcohol recovery groups.\n\nBest wishes brother or sister. You will still get your degree and you will have some really valuable life experience to share when the time is right.",
      "author": "NormalCriticism",
      "created": 1610961441,
      "upvotes": 1,
      "replies": {}
    },
    "gjop0as": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjop0as/",
      "text": "I wish I had better advice to give you. I honestly was in a very, very similar family, personal and social situation as you when in I was in grad school, with the notable exception that I didn’t check myself before I wrecked myself. It wasn’t until I ended up leaving the lab environment that I stopped drinking and feeling the pressure to. I’ve started getting Virgin drinks or mocktails when we go out, but tbh, a lot of the time I find I just drifted away from the full social scene of drinking with lab mates. I realized it was a super toxic coping strategy for me and many others, and I’m far happier without it than with. \n\nPlease feel free to reach out if ever you want to talk, or have a support for the hardships of grad school. I’m also happy to help you find any resources in your area you might find helpful while working through getting to a safer and healthier place.",
      "author": "liz-can-too",
      "created": 1610941835,
      "upvotes": 1,
      "replies": {}
    },
    "gjo2qwm": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjo2qwm/",
      "text": "Just say you are on a diet. No one will think any different.",
      "author": "Quakermystic",
      "created": 1610929889,
      "upvotes": 1,
      "replies": {}
    },
    "gjnxj51": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjnxj51/",
      "text": "Hit the nail on the head with this topic for me today.  I've been girl drink drunk with my chocolate choos choos since quarantine forced my hand to become a novice apartment bartender.  Fuck I'm writing this from the pub.  Not sure how bad I really am but there's no real equation for this lol.  Made my day to think I'm on a ship with many others.",
      "author": "Used1Car1Salesman",
      "created": 1610927155,
      "upvotes": 1,
      "replies": {}
    },
    "gjnx2i8": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjnx2i8/",
      "text": "High five for recognizing that there's a problem. A lot of programs/cohorts enable this kind of stuff, honestly. There was a particular program at the school I did my MA at that was NOTORIOUS for creating drinking problems.",
      "author": "mormoerotic",
      "created": 1610926912,
      "upvotes": 1,
      "replies": {}
    },
    "gjnmeqs": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjnmeqs/",
      "text": "Lots of good advice here! Something I didn't see mentioned is that neuroscientists are especially well- positioned to understand addiction as a biological problem, not a personal problem, and you might be surprised by the support they can offer you. Additionally, at least in my (generally mid- late twenties) circles, non- alcoholic but fun drinks are fairly widely embraced, and people who choose not to drink because it messes up their sleep or they have a long day in lab or are Muslim are accepted at face value.",
      "author": "_Medea_",
      "created": 1610921863,
      "upvotes": 1,
      "replies": {}
    },
    "gjnh9cm": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjnh9cm/",
      "text": "You could tell people you're trying to cut back (make up an excuse like it's making it harder to do your work or something) so please don't offer you anything. If they can't accept this, then they're probably not people you want to socialize with anyway.",
      "author": "smmstv",
      "created": 1610919625,
      "upvotes": 1,
      "replies": {}
    },
    "gjn57w5": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjn57w5/",
      "text": "There could probably be entire papers written about alcoholism and other forms of substance abuse among grad students. Heck, enire volumes could be written about that.",
      "author": "MrUnknown1996",
      "created": 1610914020,
      "upvotes": 2,
      "replies": {}
    },
    "gjmzhqc": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmzhqc/",
      "text": "Hey, good on you for recognizing that you have a problem. I, too, have had to take a step back and examine my relationship with alcohol recently - especially in the wake of COVID stress added on top of grad school stress. Here are my go-to \"excuses\" for not drinking when out with friends or coworkers:\n\n* \"I've got to wake up early tomorrow to get going on this manuscript/project/etc. and I notice my sleep just isn't that great if I have even one drink.\"\n* \"I'm trying to only drink on weekends.\"\n* \"Alcohol hasn't been reacting well with my medication.\" (This is true even with tylenol and other OTC pain relievers)\n* Or, my real go-to: Getting up to go to the bathroom before drinks are ordered and then just getting a soda water with lime from the bar on my way back to the table. Looks like alcohol and keeps everyone from asking all those annoying questions.",
      "author": "diskprept",
      "created": 1610911579,
      "upvotes": 2,
      "replies": {}
    },
    "gjmzerw": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmzerw/",
      "text": "Everyone else has had great advice on handling alcoholism in grad school, but I can speak to the social element-- you don't have to lose that!\n\n\nIn my program, we had a few folks who weren't comfortable in bars, so the grad student association set up afternoon coffee hours. It ended up being really great for the commuters, too, who didn't feel like driving back into the city just for an evening happy hour.",
      "author": "carlaacat",
      "created": 1610911548,
      "upvotes": 1,
      "replies": {}
    },
    "gjmrli4": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmrli4/",
      "text": "Hey, I am a fellow neurosci grad student and recovering alcoholic.   Let me start by saying that any # of days sober is a big accomplishment and don't ever let anyone discount your achievement.  They don't know what you are going through.  They can screw themselves. \n\nI am 5 yrs. sober this April.  I was lucky enough to have quit drinking well before starting my program, but I feel for you.  I feel like it is the culture of grad school to \"have drinks\" with colleagues.  For my interview, my advisor and the post doc in the lab took my now lab mate and I out to drinks before the big cohort reception.  On several other occasions, I have gone out to lunch with the lab at breweries and such.  \n\nMy recommendation is that at first, just make up some excuse not to go out with them.  Eventually, you will get more comfortable going out to a bar and not drinking, but until then, it is too risky.  When I finally started going out to bars with people again I would order club soda with a lime because it looks like a cocktail and they are usually free, so you can drink all night for $5 (tip the bartender).  \n\n&#x200B;\n\nFeel free to DM me if you want to talk to someone who has gone through what you are going through.",
      "author": "james-macavoy",
      "created": 1610908506,
      "upvotes": 3,
      "replies": {}
    },
    "gjmid65": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmid65/",
      "text": "Really easy: hey, I'm trying to avoid bars to cut back on my alcohol consumption, can we grab a coffee tomorrow or (insert day that works for you). Coffee can be substituted for boba, tea, smoothie or whatever sweet drinks are popular near you.",
      "author": "Horace_P_Mctits",
      "created": 1610906078,
      "upvotes": 1,
      "replies": {}
    },
    "gjmgqut": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmgqut/",
      "text": "Fyi, please seek support outside this sub and outside the grad school community.\nMost of the people here are barely older than 22 and have no idea about alcoholism and how serious it is.\n\nBeing a grad student isn't some special circumstance that makes you any different than other alcoholics. There are more wise and experienced communities you could join that aren't filled with 23 year olds that think life as a grad student is some special feat. And you can get serious help and advice there.\n\nStay safe and hope you can find serious support and help from legit people",
      "author": "BerserkFuryKitty",
      "created": 1610905571,
      "upvotes": 2,
      "replies": {}
    },
    "gjmb1nf": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmb1nf/",
      "text": "Grad student here. 22 days sober. I live in a city filled with breweries and we love to gather there when we can. There are a few folks in my cohort that are sober. I also am in an online community of sober folks via the I am sober app- nice folks. Helps to have community and support. Learning that a)you can say no to going out and b) you can order a tonic water with lime or whatever other AF drink you want will help with the social awkwardness of not holding a drink. I also frame the conversation when asked as “I don’t drink” rather than “I can’t drink”",
      "author": "AdiDevjotiKaur",
      "created": 1610903853,
      "upvotes": 2,
      "replies": {}
    },
    "gjm5x8w": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjm5x8w/",
      "text": "Head over to r/stopdrinking. It's a sub dedicated to its namesake where you will find a community of individuals who have chosen to stop drinking for every reason under the sun (e.g. alcoholism, other health effects, family history, wasted time, wasted money, wasted opportunities).\n\nIt is a supportive group that might prove useful in a time when you can't easily find similar support groups.\n\nI know what you mean about wanting to walk a delicate line with your research group. In my field, social drinks are expected more than even in my circle of friends (which says a lot), but I gave up drinking a long while ago. I find that in the professional sphere a polite No Thank You  with a kind smile has been enough. I deliberately don't lead about not drinking at all like some vegans with being veganism (you know what I mean). I simply decline and don't act like not drinking is a defining feature of my character. Thus far, it has worked and I haven't lost face with those whom I work.\n\nThe change from drinking to not drinking was gradual for me. I am not sure how similar it is or isn't compared to your binary, overnight flip, but I suggest finding tea in some form.\n\nI've also picked up sparkling water (La Croix, baby!). A colleague who noticed I don't drink discretely told me he doesn't like alcohol either. He's the one who introduced me to La Croix. We now refer to ourselves as the Sparkle Boys.",
      "author": "ValleyForge",
      "created": 1610902535,
      "upvotes": 2,
      "replies": {}
    },
    "gjm5hmj": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjm5hmj/",
      "text": "Soda water bitters with lemon. Order it right when you arrive. Bartender will understand you're not there to drink liquor.\n\nOrder a snack.\n\nIf they offer CBD drinks order one. Order another if you hanker for sauce.",
      "author": "binchlette",
      "created": 1610902429,
      "upvotes": 1,
      "replies": {}
    },
    "gjm277v": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjm277v/",
      "text": "Your family has a similar pattern to my husbands. In reality they weren’t so much alcoholics as they were genetically predisposed to depression that they were self medicating with alcohol. \n\nYou may wish to dig deeper into the underlying causes of your alcoholism in addition to quitting (congratulations by the way!).",
      "author": "ImperiousMage",
      "created": 1610901579,
      "upvotes": 1,
      "replies": {}
    },
    "gjly8en": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjly8en/",
      "text": "Go to an AA or NA meeting. You can get support from people IRL, so that you have an ongoing support system.",
      "author": "LuminousApsana",
      "created": 1610900574,
      "upvotes": 1,
      "replies": {}
    },
    "gjlv2uh": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjlv2uh/",
      "text": "Hey there, fellow non-trad grad student in recovery! It can be difficult, especially if you’re in a program where drinking is more or less a part of the culture. I’m pretty open about why I don’t drink, but I know that’s not an option for everyone. I will say this, though: you are putting way too much pressure on yourself to be exemplary. You don’t have to be anyone’s role model, you don’t have to go for drinks, you don’t have to be the cohort mom. It’s okay to take care of yourself, do your work, and call it a day. \n\nBest of luck, and if you have any questions/want to talk, feel free to send me a PM!",
      "author": "pantyhose_twatpatch",
      "created": 1610899766,
      "upvotes": 1,
      "replies": {}
    },
    "gjlv2rx": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjlv2rx/",
      "text": "If you're in an alcohol-rich environment (at a bar or restaurant, and someone's ordering the next round) you can simply say you're taking a medication where you can't drink (there's a number of hepatotoxic meds). Later on this can morph into \"I don't really like the taste of alcohol since I stopped drinking for so long.\" \n\nTo avoid alcohol/temptation overall, our lab started doing activities that didn't by default exclude our undergrad students and muslim/potential other religion-following students. In hindsight, we should have been doing so all along. Escape rooms, bowling, bbqs, soup and cake exchanges (as long as dietary restrictions aren't complicated), sober karaoke (!)... We picked a TV show to follow (Ru Paul's Drag Race) and went to someone's house/apartment weekly to order delivery and watch. Nowadays, we can play JackBox games online (one person shares the screen on Zoom, everyone plays on their phones) or other board game sites - Codenames is a good one... There, you're in your own home and can control what you consume. Obviously one can mix alcohol into a lot of these situations, but it's not the default and you can explicitly make them alcohol-free without too much effort or conversation.\n\nI wish you all the best in your journey. Grad school is a tough place to learn to be kind and forgiving to yourself. I hope you can find support in your colleagues too - you don't always have to be the perfect \"mom\" figure to be a good role model, and being vulnerable gives others permission to share their problems too.",
      "author": "sanity_incarnate",
      "created": 1610899765,
      "upvotes": 2,
      "replies": {}
    },
    "gjlknfn": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjlknfn/",
      "text": "If you want to keep the social aspect of drinking, without the alcohol, you could look for alcohol-free beers. It's extremely common here in Germany, where people want to participate in the cultural aspects of drinking without the alcohol. Some taste alright",
      "author": "JackJack65",
      "created": 1610896940,
      "upvotes": 1,
      "replies": {}
    },
    "gjlj8sb": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjlj8sb/",
      "text": "It is definitely not unprofessional to recognize your needs and still want to engage in social outings! I wish people were more accepting of not drinking because there are all sorts of reasons people don’t drink.\n\nYou don’t need to put pressure on yourself of being a good role model; it’s a great goal but remember, these people are adults, too, and can control their own actions.\n\nI haven’t been in this position (I’ve been in situations where a medication or health problem has made me temporarily unable to drink) , but I know that if someone in my social group was like, “hey can we go to X restaurant or coffee shop instead of Y bar?” I wouldn’t feel a need to pressure them about why. If there’s a person in the group you trust, you could always talk to them and ask them to back you up in these situations, too.",
      "author": "smolderbyboi",
      "created": 1610896575,
      "upvotes": 2,
      "replies": {}
    },
    "gjl5ih0": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjl5ih0/",
      "text": "I almost dropped out of my grad program due to alcoholism. I even took a good year off to get a handle on things and luckily my advisors were sensitive to my needs as a human. I never flat out said what my problem was, but I was clear there was something going on in my life that was affecting my work.\n\nLike you I worked during and after my undergrad a good amount of time before applying for school again. I feel that being in my program is helping push the habit out of me somewhat, but what's been really nice is also having a job where I was upfront with my coworkers immediately that I was sober (and touched on why, even). I think they appreciated that, and some even came out and said they were having similar problems. It helps to be \"out in the open\" with at least a few people. \n\nI would absolutely tell no one in my cohort about my alcoholism, but they don't need to know. However, if you aren't able to go out with your cohort without taking part in drinks, absolutely don't feel bad about not going. I was nervous about my first outing after starting sobriety but made it by ordering root beers and virgin margaritas (as many as I wanted!). Do you think you might be able to make it through a social night that way?",
      "author": "pixlkiss",
      "created": 1610891913,
      "upvotes": 1,
      "replies": {}
    },
    "gjkjclm": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjkjclm/",
      "text": "Hey friend, I struggled with alcoholism big time during my fist attempt at grad school. I got sober with the help of a collegiate recovery program at my school, and started going to peer support meetings both on and off campus (obviously in person ones aren’t happening but there are tons of online options from all sorts of different fellowships). Does your school have a collegiate recovery program? Might be good to connect there. I was really happy to see I wasn’t the only grad student who had this issue, and it really helped to be with other students in recovery regularly. \n\nThere are also a ton of recovery subs on this site. r/redditorsinrecovery is pretty active. Not everyone needs help with their addiction, but a lot of people do. It’s really hard to get sober and it’s a lot easier with some help, so I hope you find a good source of support! Asking for help is a pretty powerful way to be a role model, IMO. \nAnyway just wanted to share that I’ve been there! Getting sober was the best decision I ever made, and it’s made this round of grad school much better. Feel free to pm if I can be helpful.",
      "author": "thallomys",
      "created": 1610883096,
      "upvotes": 9,
      "replies": {}
    },
    "gjkflai": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjkflai/",
      "text": "Don't be too hard on yourself. It's good that you're getting your life back on track.  You only recently stopped. I'm sure the idea of being in a setting where everyone else is drinking but you're not won't seem so pressuring after you've been dry for a little while longer. There's a member of my cohort who also doesn't drink, but he still came out with us (before everything closed down of course) and nobody paid any mind to what's in his glass. You can still have fun and comradery without alcohol.\n\nAnd suggesting a group outing other than a bar isn't unprofessional at all.",
      "author": "frickin_laser_beam",
      "created": 1610881100,
      "upvotes": 1,
      "replies": {}
    },
    "gjk9iro": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjk9iro/",
      "text": "No idea if it's helpful or not in your situation but have you thought about sharing some information about your plan/issue with a trusted colleague? If you have someone you feel you can absolutely trust with this information then perhaps have them as an ally in this they could help with the social orchestration of events which don't include alcohol consumption.",
      "author": "tfburns",
      "created": 1610877364,
      "upvotes": 1,
      "replies": {}
    },
    "gjk93av": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjk93av/",
      "text": "Congrats on 12 days of sobriety. Keep it up! Alcohol has seeped its way into grad school for me too and I’m going to cut it out now.",
      "author": "Neondiode45",
      "created": 1610876907,
      "upvotes": 2,
      "replies": {}
    },
    "gjk79yo": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjk79yo/",
      "text": "There are some good suggestions here, but if you have no choice but to go to a bar with them in the future, here's some excuses: \n\n1) I'm driving (though if you do this \\*too\\* often, you may be roped into being everyone's 'designated driver'.\n\n2) I've got \\[activity\\] to do later...something like working, exercising...something that's not conducive to having any alcohol in you.\n\n3) You can always joke about being 'older' by saying things like \"I'm old, alcohol/hangovers are worse for me now...\n\nCongrats on your sobriety!",
      "author": "imnewhere19",
      "created": 1610874962,
      "upvotes": 27,
      "replies": {
        "gjlswid": {
          "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjlswid/",
          "text": "I also like to use the \"medical reasons\" excuse that I can't/shouldn't be drinking. It's vague enough to be true for basically everyone (even if the medical reason is just \"alcohol addiction\", your labmates don't have to know that) and it will get people to (hopefully) stop asking questions or offering you drinks.\n\nAlso don't be afraid to say \"no\" if you don't feel ready to go to a bar yet! Missing out on a few social events won't make or break your relationship with your labmates-- but going to the bar before you're ready could have serious consequences. No one will be upset if you're just \"not feeling well enough to go out tonight\"!",
          "author": "forbiddentransition",
          "created": 1610899066,
          "upvotes": 14,
          "replies": {
            "gjmcwti": {
              "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmcwti/",
              "text": "I find no one asks too many questions if you say you're on antibiotics!",
              "author": "casualselfimmolation",
              "created": 1610904364,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gjk6bnn": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjk6bnn/",
      "text": "I had an unhealthy relationship with alcohol in high school. Since then I have drunk maybe twice a year and it'll be like one at a wedding or a milestone birthday. I just say I don't really drink and people accept that. If you're not comfortable saying that, could you get away with \"I have to drive\"? Definitely something to talk to a therapist/counsellor about before you go to an event so you can be comfortable.",
      "author": "antihero790",
      "created": 1610873950,
      "upvotes": 2,
      "replies": {}
    },
    "gjk1mz3": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjk1mz3/",
      "text": "[deleted]",
      "author": null,
      "created": 1610869461,
      "upvotes": -4,
      "replies": {
        "gjoibfs": {
          "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjoibfs/",
          "text": "> My go-to strategy is to say that my doctor has advised me to stay away from xxxx because of few of your health markers.\n\nYou could also say that you are taking a medication for something, like acne or something else, that interferes with the metabolism of alcohol.",
          "author": "specific_account_",
          "created": 1610938060,
          "upvotes": 2,
          "replies": {}
        },
        "gjmhed4": {
          "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmhed4/",
          "text": "The fact that you're getting downvoted despite having experience and better suggestions than half the comments in here tells me that OP posted in the wrong sub and shouldn't be asking for help from 22 year old grad students who have never actually experienced life outside academia.\n\nOP seek support in other communities that are more mature and experienced.",
          "author": "BerserkFuryKitty",
          "created": 1610905773,
          "upvotes": 1,
          "replies": {
            "gjmpc1i": {
              "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmpc1i/",
              "text": "I think people sometimes perceive one disorder is worse than other. Like eating disorder is less important or severe than drinking disorder. But more often than not addictions are very similar in characteristics and can be managed using the same tricks. I tried to share my experience but for many it might seem irrelevant or unimportant. Yet I do see some of the comments that are along the same line as my advice too. Then I presume that talking about food in this context was the reason of downvotes. Funny enough, diet is a trigger topic in today's world and I totally get it! I do not mind the downvotes. I posted it with the hope that OP might find it helpful. If not, that's ok too. I am not here to proselytize anybody. \n\nAnyways, good wishes to you internet stranger for having my back on this :)",
              "author": "troy_lc",
              "created": 1610907936,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gjk139d": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjk139d/",
      "text": "What's the average age and how does yours compare? It would be really hard if you're in grad school with a bunch of 25 year olds and you're 35. They're just going to be in a completely different headspace when it comes to \"normal\" social activities. I'm a 33 year old grad student and I have some younger early/mid 20s friends from intramural sports -- I skip out on a lot of activities with them just because I absolutely cannot go to a music festival and drink for 3 days. Just nope.\n\nIs there anyone in the lab or in your program that is older, that you could be social with instead? Do you feel like you can't go to a bar because you will feel compelled to drink? Perhaps you could suggest you all get dinner first and then skip out on the drinks afterwards? I imagine they'll be sympathetic and try to accommodate you, but I also imagine they'd still like to be able to go to bars to hang out. I bet you could find a middle ground where you get dinner first and then you head home while they go out for drinks at a bar.\n\nAnd like others have said - congrats on sobriety!  And, I definitely recommend therapy as well.",
      "author": "mymatrix8",
      "created": 1610868969,
      "upvotes": 2,
      "replies": {}
    },
    "gjjzuan": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjzuan/",
      "text": "be proud of your 12 days. wish u all the best.",
      "author": "jyow13",
      "created": 1610867868,
      "upvotes": 2,
      "replies": {}
    },
    "gjjwn47": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjwn47/",
      "text": "The book This Naked Mind: Control Alcohol by Annie Grace helped me kick the drink now for 3 years. I am also the elder of my cohort, so I just want to let you know that you are not alone. In my experience, people were very supportive when I let them know that I was no longer drinking because it was ruining my life. Well done!!",
      "author": "Moon_In_Scorpio",
      "created": 1610865244,
      "upvotes": 2,
      "replies": {}
    },
    "gjjum9s": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjum9s/",
      "text": "You are so awesome and you don't even know it! I'm a young grad student, have struggled with alcohol since I was a kid and am six months sober now and have been feeling a lot of the same feelings in regards to my cohort and the social pressures of drinking, which the pandemic has allowed me to avoid so far, and you sharing this made me feel a lot better. So, you never know!",
      "author": "cpbivins28",
      "created": 1610863719,
      "upvotes": 1,
      "replies": {}
    },
    "gjjrz67": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjrz67/",
      "text": "To make non-bar lab outings happen it really helps to just make “extra” events that aren’t at bars rather than trying to see place the bar trips. Its great if you can be the person putting them together, especially if that’s a “group job” in your group.",
      "author": "johnnydaggers",
      "created": 1610861844,
      "upvotes": 2,
      "replies": {}
    },
    "gjjqs1g": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjqs1g/",
      "text": "That you recognize and take ownership of it is tremendously important and I wish you the best.",
      "author": "orangeblackteal",
      "created": 1610861048,
      "upvotes": 3,
      "replies": {}
    },
    "gjjop1i": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjop1i/",
      "text": "Hey, grad school is rough. Alcohol is rough. Together they are a nightmare. Let me know if you'd like to chat.",
      "author": "Intelligent-Rock-642",
      "created": 1610859677,
      "upvotes": 21,
      "replies": {}
    },
    "gjjmck8": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjmck8/",
      "text": "Congratulations to you. I struggled with alcohol dependency. That urge to drink can be hard to ignore when out with friends. Think of your own well being before what others will think of you. You deserve that. If it’s too much don’t go. Honestly people think way less about us than we assume. One tip I have is to maybe order a lacroix or a similar drink- it really tames the urge and hydrates you as well. Breaking the habit is hard and do whatever empowers you to take care your health.",
      "author": "nanon_2",
      "created": 1610858206,
      "upvotes": 2,
      "replies": {}
    },
    "gjjm2e2": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjm2e2/",
      "text": "r/stopdrinking and r/dryalcoholics are really good communities you should check them out!",
      "author": "_kleido",
      "created": 1610858038,
      "upvotes": 45,
      "replies": {
        "gjjvldt": {
          "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjvldt/",
          "text": "Fellow grad student (M.S., soon to be PhD) that swears by r/stopdrinking. Most supportive and understanding online community this side or the other of the Mississippi.",
          "author": null,
          "created": 1610864434,
          "upvotes": 29,
          "replies": {
            "gjjvm86": {
              "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjvm86/",
              "text": "Here's a sneak peek of /r/stopdrinking using the [top posts](https://np.reddit.com/r/stopdrinking/top/?sort=top&t=year) of the year!\n\n\\#1: [My Beloved Wife (long post - but I need to get this out)](https://np.reddit.com/r/stopdrinking/comments/kalcjm/my_beloved_wife_long_post_but_i_need_to_get_this/)  \n\\#2: [I did it! Today, I officially tie Bill Wilson, co-founder of A.A. in total days of sobriety: 13,193 or 36.15 years. I have to say I’m pretty proud of myself. HAD to share THIS birthday!](https://np.reddit.com/r/stopdrinking/comments/f6s5re/i_did_it_today_i_officially_tie_bill_wilson/)  \n\\#3: [My boss sat me down when I walked in and told me she knew I had been drinking at work, and that the night before I had been clearly drunk.](https://np.reddit.com/r/stopdrinking/comments/ksibdb/my_boss_sat_me_down_when_i_walked_in_and_told_me/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)",
              "author": "sneakpeekbot",
              "created": 1610864452,
              "upvotes": 5,
              "replies": {
                "gjmy6ln": {
                  "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmy6ln/",
                  "text": "Good bot",
                  "author": "BoomBoomMeow1986",
                  "created": 1610911104,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gjjzhde": {
          "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjzhde/",
          "text": "Absolutely. It's hard enough with support, and nearly impossible alone.",
          "author": "SheafyHom",
          "created": 1610867560,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gjjl8zs": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjl8zs/",
      "text": "Congrats on 12 days of sobriety!\n\nEdit to add my tangential personal experience: It might help to know that there are lots of people who might share your same sentiment in wanting a different social outlet. In my personal experience in a place with a predominantly alcohol related social scene, I found many people were not on board (and there were lots of reasons! Eating disorders, previous traumatic encounters in bars, family/personal history of alcoholism, financial stress, straight up not liking to drink). For what it's worth, I don't think you'd raise massive red flags about your personal situation by wanting to find an alternative social activity.",
      "author": "civil-ian",
      "created": 1610857555,
      "upvotes": 8,
      "replies": {}
    },
    "gjjl8wb": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjl8wb/",
      "text": "First, I want to say that you’ve done an amazing thing in recognizing you have a problem and by making steps to address it. I imagine that each of those 12 days was incredibly hard fought and it’s wonderful that you’re doing this. \n\nHave you considered reaching out to the other members of your group? It seems like you don’t want them to know that you’re struggling, which is understandable, but it might help you to have a group around you that understands you’re going through a tough time and you need help, even just to not have social time in bars. If this makes you uncomfortable, maybe reaching out to groups on campus would give you some support and help guide you through these situations. \n\nYou have my best wishes going forward. Good luck!",
      "author": "unicornsanshorn",
      "created": 1610857553,
      "upvotes": 1,
      "replies": {}
    },
    "gjjktrq": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjktrq/",
      "text": "First of all, go you for recognizing a problem and tackling it head on. Congrats on 12 days of sobriety! \n\nSecond, don't be so hard on yourself. You can (and will) do good science and be a good role model, even if you struggle with alcoholism. This is not a death sentence. It is simply another obstacle you have to work with. \n\nYou can always try to suggest other outings that are not triggering to you that other members of the lab would enjoy. Is there a good restaurant that isn't a huge bar scene? Can you go bowling or to a park? Working through the beginning of your sobriety journey during a pandemic is a blessing and a curse. On the one hand, you have plenty of time to get yourself to a stable place with alcohol while its still pretty much a no-no on group outings. On the other, you aren't getting as much exposure to places and events that could be your triggers. Pay attention to when your cravings come around- can you be around someone who is drinking if it isn't in a bar setting? Are there certain places you used to drink regularly that you need to avoid? If you can be in the room with drinking, you can always just say you're trying to save money and/or lose weight by not drinking alcohol, order something else, and call it a day. If you can't, and your lab is really into the bar scene and nothing else, you can always tell someone you trust and see if they can suggest doing something else too. \n\nYou're starting a super difficult journey, but you are a scientist, so difficult is likely something you can handle! Good luck!",
      "author": "Uncreative_cal",
      "created": 1610857313,
      "upvotes": 92,
      "replies": {}
    },
    "gjjkreu": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjkreu/",
      "text": "I struggled with alcohol for a while during my Master's. It looks like you're pretty self-aware. What I recommend is getting *to the root of the problem.* Why do you drink? Get thee into therapy and don't give up on your program. You say you're not a good student, but all I see is humility, vulnerability, and potential here. You are better than you think you are, you are bigger than this problem, and therapy will help you access the bigger and stronger parts of you that will help you heal. If you've got bad influences around you, you either gotta access that confidence and say NO to alcohol, and/or if they peer pressure you (*extremely* juvenile and disrespectful behavior), you gotta dump their toxic asses. We're here for you!",
      "author": null,
      "created": 1610857276,
      "upvotes": 57,
      "replies": {
        "gjmig6j": {
          "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjmig6j/",
          "text": "\"Get thee into therapy\" - I love it!\n\nAgreed though, get to the root of the problem. I experienced a lot of anxiety during grad school, and my decision about 2/3 of the way through my degree to cut out alcohol completely helped me in so many ways. Wish I had done so sooner! Of course I still experience anxiety and other troubles, those struggles just have less power to completely derail me now.\n\nGood luck everybody!",
          "author": "echotrain",
          "created": 1610906104,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gjjab58": {
      "link": "/r/GradSchool/comments/kyxjju/oof_alcoholism_and_grad_school/gjjab58/",
      "text": "Good on you for recognizing you had a problem and taking the first steps to making a change. I don’t have any valuable advice to share but I just wanted to say congrats & best of luck",
      "author": "lsinclaiiir",
      "created": 1610851620,
      "upvotes": 157,
      "replies": {}
    }
  },
  "updated": 1634065143
}