{
  "sid": "r8tgxm",
  "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/",
  "title:": "Withdrawing from master's to apply to other schools",
  "text": "Hello everyone! So I'll be brief, I don't have imposter syndrome or hate my lab! Basically, I'm one semester into my master's of chemistry, and I really want to goto other schools to align more with my research goals.\n\nWould it hurt my chances withdrawing from my current program when applying to other programs?",
  "author": "hungry-axolotl",
  "created": 1638636013,
  "updated": 1639518988,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hn820er": {
      "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/hn820er/",
      "text": "I was in your position years ago. In my case, I was a year into my first doctoral program before realizing that it would be easier to pursue my research goals elsewhere. I applied to the other department in the fall semester of my second year, so that I finished my M.A. and then went straight into the next program. I would advocate that approach, unless there's still time this semester to make the application deadlines. You don't hate it, so stay enrolled. It will dramatically decrease your chance for admission if you just drop out after one semester. The application committee would be likely to erroneously infer that you can't handle grad school. \n\n\n\nHaving an extra M.A.will help you, because the skills and knowledge you pick up in your current program will give you a unique perspective on your area of research. That's the case with me.",
      "author": "subjectsnamehere",
      "created": 1638642817,
      "upvotes": 3,
      "replies": {
        "hn8ee8x": {
          "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/hn8ee8x/",
          "text": "Hmm that's a fair point, I'll consider it. \n\nEdit: I'm at a Canadian uni so I can't \"master out\" even if I get all of my credits and requirements. My advisor would have to sign off on my thesis. I think I'll still apply to other schools, like I still have my old references and its not like I'm dropping out a week before submitting my thesis. So it shouldn't be too bad",
          "author": "hungry-axolotl",
          "created": 1638647982,
          "upvotes": 1,
          "replies": {
            "hn9hdpx": {
              "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/hn9hdpx/",
              "text": "Oh, I see. Look at me, assuming everyone on Reddit is in the U.S. :|",
              "author": "subjectsnamehere",
              "created": 1638664745,
              "upvotes": 1,
              "replies": {
                "hn9ic9e": {
                  "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/hn9ic9e/",
                  "text": "No worries! I saw a stat once that most Redditers are Americans so I understand. Btw as a Canadian I have never heard of the GRE before. Yesterday I did a practice GRE general test and got average scores first try is that a good sign?",
                  "author": "hungry-axolotl",
                  "created": 1638665168,
                  "upvotes": 2,
                  "replies": {
                    "hna1121": {
                      "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/hna1121/",
                      "text": "Yes, it's a good sign. I recommend taking some more practice tests, and reading up on it, to gain familiarity with it. I haven't taken it in 12 years, but back then at least, it was an adaptive test, meaning that, if you answered question correctly at the start, you'd be given more-advanced-than-average material going forward. A friend of mine had researched it, and knew the progression of difficulty in the math section. Thanks to him telling me about it, I wasn't sweating bullets and getting flustered near the end of that section, when I was having trouble solving the problems. I knew, from the question types, that I was in the highest-level of difficulty that the test had to offer, so I only felt calm and confident. Made a huge difference in my ability to finish the rest of the test.",
                      "author": "subjectsnamehere",
                      "created": 1638673681,
                      "upvotes": 2,
                      "replies": {
                        "hna265r": {
                          "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/hna265r/",
                          "text": "Thank you, that's really good to know! Then I'll try to do as many tests as possible",
                          "author": "hungry-axolotl",
                          "created": 1638674209,
                          "upvotes": 2,
                          "replies": {
                            "hnanogz": {
                              "link": "/r/GradSchool/comments/r8tgxm/withdrawing_from_masters_to_apply_to_other_schools/hnanogz/",
                              "text": "Good luck! :)",
                              "author": "subjectsnamehere",
                              "created": 1638685777,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}