{
  "sid": "ohps7k",
  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/",
  "title:": "Anecdote: homelessness rising among graduate students",
  "text": "I don't know if this is a real trend in the US, but I've learned of 6 grad students at my institution who will no longer have a place to live by the end of this year. Some are leaving school, while others are trying to tough it out. Given the upcoming lift of eviction moratoria and skyrocketing rent prices (including on-campus... my university just raised grad housing rents by 85%), I fear homelessness is set to become commonplace among grad students. \n\nFor those who think it a little suspicious that a half-dozen people would share this one particular concern with me:  I have a bit of an open secret. I've been homeless for about three years and I'm a vocal advocate for campus housing reform. People know I'm surviving grad school while living on the streets. \n\nIt began as a choice for me:  a conscientious objection to insane rent prices (even before this year!) and the total lack of consequences for many landlords' criminal behavior. The grad students who have spoken to me about their impending homelessness aren't being given a choice, however. And, unlike me, they don't have enough time to plan for what's coming. \n\nI'm posting this here to raise awareness of what might be a major wave of hardship sweeping through our shared community. There is a lot of shame and stigma around homelessness and universities have very sparse support programs outside of offering high-interest loans. A bit of social support and kindness toward your struggling colleagues can make an enormous difference.",
  "author": "impressive_neglect",
  "created": 1625947362,
  "over_18": false,
  "upvotes": 559,
  "upvote_ratio": 0.97,
  "comments": {
    "h4ud5hc": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4ud5hc/",
      "text": "Oh hey! That’s me! Lost my housing and have been floating around friends places. I’d go back to the family ranch but it’s out of state with no Internet and 1 bar of service. It’s easier to not know where I’m sleeping or camp than drive 60 miles to town for Internet each day.",
      "author": "armaduh",
      "created": 1626034604,
      "upvotes": 2,
      "replies": {
        "h4ud6cr": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4ud6cr/",
          "text": "60 miles is 96.56 km",
          "author": "converter-bot",
          "created": 1626034616,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h4u2zsw": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4u2zsw/",
      "text": "How are you dealing with the situation yourself? I've considered getting one of those vans you can live in but that's not cheap either",
      "author": "DreamWithinAMatrix",
      "created": 1626029598,
      "upvotes": 1,
      "replies": {}
    },
    "h4u2qoc": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4u2qoc/",
      "text": "Surprising!",
      "author": "Small-Button-2308",
      "created": 1626029470,
      "upvotes": 0,
      "replies": {}
    },
    "h4tp4ru": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tp4ru/",
      "text": "Housing has gotten so expensive in general and so has college that it's becoming more and more common for students to live in cars because its their only option. Even before the pandemic it wasn't common but I would occasionally see stories about \"student at so-and-so university lives out of a van\".\n\nPlus for grad programs in particular they need to realize that students need livable stipends or at the very least not force you into predatory agreements where if you take an unlivable stipend you risk losing the stipend and being dismissed from the program for also working a second job.",
      "author": "squirrel8296",
      "created": 1626022718,
      "upvotes": 2,
      "replies": {}
    },
    "h4tosgx": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tosgx/",
      "text": "I was homeless temporarily when I was dropping out of undergrad. As a grad student, I stole food from administrators on campus regularly because I had no money or food. I taught their classes and was food insecure. It was a nightmare at times.",
      "author": "biscuitman76",
      "created": 1626022546,
      "upvotes": 3,
      "replies": {}
    },
    "h4tf4si": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tf4si/",
      "text": "More than half my stipend each month goes to rent (and I'm living in one of the cheapest places). Plus the fees that aren't covered, general living and school expenses, and the cost of having a chronic illness, and then any unexpected expenses... Housing in university towns is a scam",
      "author": "AwkwardViking01",
      "created": 1626017694,
      "upvotes": 3,
      "replies": {
        "h4tlyjj": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tlyjj/",
          "text": "throughout my college experience, I chose to live in low-income apartment buildings as a way to save money.  There were times where I didn't feel safe walking around at night and some of my stuff was stolen off my patio, but living like someone in/near poverty has really helped me gain a different sort of perspective on one's socioeconomic status and how that impacts their interactions with others.  Plus I left grad school with 0$ debt (I paid off my undergrad loans)",
          "author": "murfmurf123",
          "created": 1626021127,
          "upvotes": 3,
          "replies": {
            "h4ttv2o": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4ttv2o/",
              "text": "Funny enough, I can't afford the low-income housing this area. Literally everything is priced on the premise of having roommates or multiple incomes. Good on you though for managing to get through.",
              "author": "AwkwardViking01",
              "created": 1626025083,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h4sugvs": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sugvs/",
      "text": "This was such a huge issue with international students when I went to grad school in Amsterdam. They make these bullshit rules about having to be registered at your living space but most apartments for international students are illegal and you can't register, and the ones where you can are absurdly expensive and difficult to get, so five months into the year and there were still students living out of tents in camping sites",
      "author": "bkboio",
      "created": 1626005338,
      "upvotes": 4,
      "replies": {}
    },
    "h4s3nnf": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4s3nnf/",
      "text": "What school are you at?",
      "author": "liqui_date_me",
      "created": 1625980856,
      "upvotes": 4,
      "replies": {
        "h4syf6m": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4syf6m/",
          "text": "OP hasn't said, but with rent in larger US cities I really could imagine this happening anywhere in those places.",
          "author": "secretlizardperson",
          "created": 1626008242,
          "upvotes": 3,
          "replies": {
            "h4tcxv1": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tcxv1/",
              "text": "I have a friend who just got accepted into a PhD program at UCSD and was complaining about this. So it may be UCSD. I currently live in San Diego and there’s truly no winning with rents. At this point, living on campus is no cheaper than getting your own place - both close to impossible with the stipend they offer if you don’t have outside sources of funding.",
              "author": "blackmadscientist",
              "created": 1626016555,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h4rvti7": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rvti7/",
      "text": "Everybody in my physics grad school program lived in the department building for a bit",
      "author": "lolokimono",
      "created": 1625975751,
      "upvotes": 7,
      "replies": {}
    },
    "h4rqwc3": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rqwc3/",
      "text": "85%??? what the fuck???",
      "author": "silkyhippo",
      "created": 1625972705,
      "upvotes": 6,
      "replies": {}
    },
    "h4rf54v": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rf54v/",
      "text": "I was homeless for part of undergrad. It sucks, but it's not too bad if you have a car. There are certain tricks, like showering at the gym, getting a meal plan, etc. That you can do if you need to. With that being said, the grad student wages are a joke. Mine is not too bad at 25K USD/yr in a LCOL area, but in industry I would be making 65-80K USD/yr right now.",
      "author": "immunobabe",
      "created": 1625966046,
      "upvotes": 19,
      "replies": {}
    },
    "h4re9ot": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4re9ot/",
      "text": "I'm trying to start a student housing coop for my campus to help. rents are definitely out of control in my area and I couldn't find housing for a few weeks because I had a flag on my credit score.",
      "author": "FlopperPants",
      "created": 1625965542,
      "upvotes": 5,
      "replies": {}
    },
    "h4rdqv5": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rdqv5/",
      "text": "What's worse is that most landlords require income 2.5-3 times greater than the rent and don't care if you are a student or not. As a result, even if you make enough money, you will still likely be rejected. I had to go through that this year. Fortunately, my savings, accumulated during the first few years of grad school, allowed me to circumvent this requirement.",
      "author": "n1ck6667",
      "created": 1625965251,
      "upvotes": 45,
      "replies": {
        "h4tx328": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tx328/",
          "text": "When my fiance and I were looking for our apartment together, we were told our stipends weren't enough to show we could cover the rent. Our stipends are 39k/year each. 78k per year wasn't enough for a two bedroom apartment!? Luckily we had enough savings to show that we'd cover it.\n\nBut I'm so afraid of getting a crappy place after what happened at a previous apartment: it made me so sick that I ended up in the hospital, nearly took a leave of absence, and only got better when I was out of the house. But since the inspectors couldn't find anything that proved the house was the problem, I was stuck in a lease and paying rent for a place I couldn't live. I was able to get through it because a friend let me crash in her spare room for a couple of months until my lease was up. It was incredibly scary.",
          "author": "pterencephalon",
          "created": 1626026686,
          "upvotes": 2,
          "replies": {
            "h4uazix": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4uazix/",
              "text": "Wowzers, your stipend is literally double the amount of mine in UK (£14k, although that’s just for living costs - tuition fees are paid separately)",
              "author": "ellodarknessoldfrend",
              "created": 1626033569,
              "upvotes": 1,
              "replies": {
                "h4udhqe": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4udhqe/",
                  "text": "It is in an expensive city in the US. (Cynically, I also feel like the stipend has to account for many of the students paying off undergrad student loans, as well. And if you're a parent, good luck, since the university child care costs $32k/year.)\n\nBut when I did my masters in the UK, my stipend from my fancy government fellowship barely covered my expenses, even with the £200/month top-up for being in London.",
                  "author": "pterencephalon",
                  "created": 1626034772,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h4ra1jl": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4ra1jl/",
      "text": "This is something I am wondering about too. I just got accepted into a phd program and will talk about funding monday. But I am nervous because they may or may not give a tuition waiver and if they dont I will have trouble on basic necessities like housing, food etc. and ofc the stipend isnt that high paying, but I wanna do research. sigh",
      "author": "Cherrychemicals",
      "created": 1625963184,
      "upvotes": 6,
      "replies": {
        "h4rh55p": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rh55p/",
          "text": "Your funding package should include tuition, health insurance, and a stipend large enough to live on in the university community. If you are offered less than that, you need to turn it down. It is an empty offer.",
          "author": "IkeRoberts",
          "created": 1625967181,
          "upvotes": 27,
          "replies": {
            "h4rhihd": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rhihd/",
              "text": "University community is not always the cheapest. In my university, a room without even a private shower costs as much as an entire apartment located just a few miles away from the university.",
              "author": "n1ck6667",
              "created": 1625967393,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "h4rf62w": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rf62w/",
          "text": "I personally wouldn't partake in a PhD project unless there was significant financial compensation for me attached to it.",
          "author": "murfmurf123",
          "created": 1625966062,
          "upvotes": 20,
          "replies": {
            "h4rh98r": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rh98r/",
              "text": "I dont know the exact numbers but its more than 20k and maybe full tuition waived. Dont know until monday but in general As an international student I have a better outcome completing my  PHd.",
              "author": "Cherrychemicals",
              "created": 1625967245,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "h4r9kba": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r9kba/",
      "text": "My prayers to you that you'll finish school and find stability and security",
      "author": "MAE2021JM",
      "created": 1625962910,
      "upvotes": 7,
      "replies": {
        "h4rbiic": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rbiic/",
          "text": "Many thanks! That stability & security is the end goal. I definitely don't want to be stuck in this situation forever!",
          "author": "impressive_neglect",
          "created": 1625964019,
          "upvotes": 7,
          "replies": {
            "h4rdkup": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rdkup/",
              "text": "Yes!!! That's why we fight through this crap!!",
              "author": "MAE2021JM",
              "created": 1625965157,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "h4r8ie1": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r8ie1/",
      "text": "Grad students of all people should have a home. Why? Because they have to work 50H a week (at least) to pump out papers. How in the world can they concentrate on their work/teaching/research if they don't have a place to live? Out of curiosity, what is the universities standpoint on raising stipends/ or matching the value due to inflation? Are these fully-funded Ph.D. programs with benefits like stipends/healthcare/ and a tuition waiver? What about getting some help from the graduate student union and seeing if any of the other students want a roommate, can chip in with some money? \n\nOn another note, while I do not recommend this, I know a current postdoc who took out loans while in graduate school (Ph.D. in STEM Mol Bio) to help pay the cost of living. (I believe he went to grad school in florida)",
      "author": "pikapikachuu213123",
      "created": 1625962298,
      "upvotes": 16,
      "replies": {}
    },
    "h4r8f16": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r8f16/",
      "text": "Potentially hot take:\n\nGrad homelessness is also rising as schools accept more people of color, trans people etc. Ie.... those people who are less likely to have financial support from home.\n\nIf schools want to prioritize admission of margianalized groups, they also need to be willing to support students more. Especially with housing since that's usually the biggest expense.",
      "author": "husky429",
      "created": 1625962244,
      "upvotes": 448,
      "replies": {
        "h4rdvc4": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rdvc4/",
          "text": "This is a consequence I’ve never thought about. It’s sort of like how I’ve heard low income students explain that their grad stipend that’s ~$25-30k/yr is the most stable and highest income their family has ever had. Same goes for international students I know, a lot of them send a few hundred dollars home every month. \n\nI’m lucky that my university’s city rent is about $400-$500/per room per month in almost every apartment, which is very doable on the stipend. Their grad student housing, however, is charged at like $13k/year. Why is the school, that can control their housing prices easily, charging grad students $1k for rent? I know that’s what housing for undergrads is and it would create a whole debate around housing prices for low income undergrads, but cmon. It doesn’t have to be that expensive.",
          "author": "happytransformer",
          "created": 1625965321,
          "upvotes": 136,
          "replies": {
            "h4rrur4": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rrur4/",
              "text": "Prior to grad school I was making 9k a year as an undergrad and was living off that to pay rent, get gas, and eat. 24k stipend felt like a career at first lmao.",
              "author": "NickDerpkins",
              "created": 1625973279,
              "upvotes": 47,
              "replies": {
                "h4t7mze": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4t7mze/",
                  "text": "Yeah my ugrad stipend was between $5-15k / year, so suddenly being bumped up to $20-45k felt like utter luxury. Totally adequate IME without dependents so long as you avoid lifestyle creeps like eating & drinking out or living alone without roommates.",
                  "author": "--MCMC--",
                  "created": 1626013754,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "h4shzet": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4shzet/",
              "text": "My university charges about £1000 per month for accommodation here, either for a room (sharehouse) or for an apartment (rare).\n\n But the real kicker is that some ancient rule dictates we must all live within 10 miles of a particular church in the middle of the city and they police that *hard*. You *do not* commute. Undergrads have to live within 3 miles.\n\nAnd the private landlords in the UK can be super predatory so that’s a whole landmine on its own.",
              "author": "officially_anxious",
              "created": 1625993489,
              "upvotes": 18,
              "replies": {
                "h4sunjg": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sunjg/",
                  "text": "I'm guessing this is Oxford (or Cambridge) because I've had the same thing... not allowed in normal times to just promise to be flexible at commuting and avoid eye watering prices in cities with housing issues nearly as acute as London. Mine was only a self funded masters, but knowing what graduate stipends are and what the cities cost I've always been concerned/confused about how that's doable/sustainable. Feels like the answer is either be lucky enough for family support or be one major bill away from trouble.",
                  "author": "Amazing-Ad-4364",
                  "created": 1626005488,
                  "upvotes": 5,
                  "replies": {
                    "h4swury": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4swury/",
                      "text": "Yeah not having that freedom to choose is awful. And the renters *know* that we don’t have a choice so they push up the rent. We have absolutely no power to say “the rent you’re asking is too high for a mouldy shoebox”, because we need somewhere to live, there’s a housing shortage, and you have to take what you can get.\n\nMy partner and I will be moving to an apartment that’s smaller than either of our current bedrooms. We’ll be living in a shoebox, but at least it’ll save us a tiny bit of money. And that’s already including the subsidy from the college, so it’s really truly impossible to find anything cheaper.\n\nHad either of us ticked a different random box on our application for college assignment then we wouldn’t have access to this apartment either. So much of it is luck.",
                      "author": "officially_anxious",
                      "created": 1626007159,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "h4shzuq": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4shzuq/",
                  "text": "10 miles is 16.09 km",
                  "author": "converter-bot",
                  "created": 1625993501,
                  "upvotes": 3,
                  "replies": {}
                },
                "h4sn6zr": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sn6zr/",
                  "text": "Are you at Oxbridge? That's the only place I've heard of a rule like that being enforced. \n\nThough, I know people at my Dublin uni who have 3 - 4 hour round commutes by bus. Commuting isn't necessarily easy either.",
                  "author": "amysantiagossister",
                  "created": 1625998729,
                  "upvotes": 2,
                  "replies": {
                    "h4spk83": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4spk83/",
                      "text": "Yeah but there are *a lot* of smaller villages around within 30min that are super cheap, but no one can live there because it’s more than 3/10 miles out. We’re only about an hour from London on the train, so a 1 hour commute covers a very large area. And the rule also applies to anyone with family or who owns a home. Everyone must move to be within the radius.",
                      "author": "officially_anxious",
                      "created": 1626001024,
                      "upvotes": 2,
                      "replies": {
                        "h4suryg": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4suryg/",
                          "text": "I do know of someone who's gotten away on DPhil with using a friend's address within range and just making sure they're available enough that they won't be caught outside the range - it does feel incredibly stupid, especially for grad students who operate out of the 8 week term bubble anyway.",
                          "author": "Amazing-Ad-4364",
                          "created": 1626005587,
                          "upvotes": 2,
                          "replies": {
                            "h4szfun": {
                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4szfun/",
                              "text": "That’s pretty risky - if they get caught not “keeping term”, even if it happened in first year and they’re now in third and following the rules, they can’t graduate. They can’t be awarded their degree.\n\nAnd the fact that you know shows that they’re not keeping that secret particularly well.",
                              "author": "officially_anxious",
                              "created": 1626008902,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "h4t9bs7": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4t9bs7/",
                          "text": "That's beyond ridiculous. It's so annoying when universities insist on keeping these archaic rules.",
                          "author": "amysantiagossister",
                          "created": 1626014654,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h4r9hp9": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r9hp9/",
          "text": "Yea plus international students!! Its a sad state of affairs",
          "author": "MAE2021JM",
          "created": 1625962873,
          "upvotes": 37,
          "replies": {
            "h4rcdwj": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rcdwj/",
              "text": "My department was unwilling to help me out this summer. I had to come back to my country and live with my parents for the season, they’re helping me out with the rent. \n\nI got an internship in a start up so I was excited that I could stay...but by the time they sent me the offer letter, the due date for “summer experiences” had passed for OPT/CPT so fuck me. \n\nYeah, on top of CPT being hard as fuck to get, you’re also against the clock. \n\nNeedless to say I feel less loyalty and interest for my department and institution now. I just wanna graduate and GTFO. If I can’t get any interest in me I’ll just make a run for Europe or stay home, I’m done trying to do something of myself in the US where everything is stacked against you.",
              "author": "Missapizza",
              "created": 1625964498,
              "upvotes": 28,
              "replies": {
                "h4re1zk": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4re1zk/",
                  "text": "I'm international as well and when it's time to job search I'm looking everywhere worldwide. I'm free and unattached and my biggest goal is just to be happy and comfortable. I refuse to be in an uncertain position which I see being the norm because of covid going forward",
                  "author": "MAE2021JM",
                  "created": 1625965423,
                  "upvotes": 19,
                  "replies": {
                    "h4rexhl": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rexhl/",
                      "text": "Same. I have been questioning my decision to stay in the US for quite some time. Moreover, even if I will be able to secure a good job at some point, the quality of life seems to be lower compared to my supposedly third-world home country in many aspects, such as housing, food or healthcare.",
                      "author": "n1ck6667",
                      "created": 1625965925,
                      "upvotes": 15,
                      "replies": {
                        "h4rfqq6": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rfqq6/",
                          "text": "Yesssssssss plus the academic career here looks like a death wish of stresses. In so many other countries I could be at the top of my field well paid comfortable helping improve the conditions and not having to kill myself to get tenure. The reward for good work is hard work but this is different in different contexts.",
                          "author": "MAE2021JM",
                          "created": 1625966388,
                          "upvotes": 14,
                          "replies": {
                            "h4rgwfe": {
                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rgwfe/",
                              "text": "Academic career is not for everyone, and I don't think it is different in other countries. \n\nPersonally, I never planned to stay in academia after graduation. I decided to pursue PhD because it would give me stable funding, free MSc degree and some time to recuperate after very stressful undergraduate years. It could also be beneficial in the industry, at least in the long run. I have a great supervisor and work-life balance, and hope to finish the PhD. However, I have no idea where I am going to work afterwards.",
                              "author": "n1ck6667",
                              "created": 1625967045,
                              "upvotes": 8,
                              "replies": {
                                "h4rhfod": {
                                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rhfod/",
                                  "text": "Same with me re your situation but I disagree re academic jobs from what I see many countries uni are teaching based with research on the side which is what I love while US schools that would sponsor us international students are research based which is ok for me but not my first preference.",
                                  "author": "MAE2021JM",
                                  "created": 1625967347,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "h4rg5na": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rg5na/",
                      "text": "Mine too :)! Moreover, I already know through prior experience in my home country what engineers like me do, and I didn’t like it. I studied mechanical and aerospace out of love for the profession, and back there it’s nothing like this, there’s none of the fun and challenging side, and all of the administrative and menial tasks. Plus, the growth areas are dim. \n\nI’m looking forward for my big search too, who knows maybe with a masters it’ll be easier? In any way, best of luck in your pursuit.\n\nOne point that made me loose hope in the US is the aggressiveness of those who don’t want us here. You’ll get that a lot. “You’re just cheap labor, people from x or y country just abuse the H1B because they work for lower wages, go back!” Like dude, those of us who know what the whole F-1 to H1B to PR is like are aware of the 7+ years of living in uncertainty under temporary visas, and also know that for getting a H1B the company needs to pay you as much or more than a national engineer. There’s an impressive amount of xenophobia to receive from people who don’t have the slightest clue. \n\nThen there’s insurance, healthcare, the prices of everything, and overall having to shoot for again, 7+ years of being a third grade citizen and sucking it all up until you can get some resemblance of certainty.",
                      "author": "Missapizza",
                      "created": 1625966632,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                },
                "h4tx02w": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tx02w/",
                  "text": "what is OPT/CPT in this context?",
                  "author": "doornroosje",
                  "created": 1626026645,
                  "upvotes": 1,
                  "replies": {
                    "h4visp7": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4visp7/",
                      "text": "Optional Practical Training and Curricular Practical Training. Basically permits us internationals need to file with the DHS to accept any internship and/or employment in the US. \n\nOPT after graduation allows us to work for 12 months for any US company, with an additional 24 month extension for STEM degrees. Upon completion one is done and over in the USA, unless the company filed for an H1B with and for you. \n\nBoth CPT and OPT require no sponsorship, however, companies take it as if they did, thus really avoiding anyone who’s with those visas...that’s what makes it hard.",
                      "author": "Missapizza",
                      "created": 1626055324,
                      "upvotes": 2,
                      "replies": {
                        "h4vx7ya": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4vx7ya/",
                          "text": "Thank you for the explanation, that clarifies a lot! I'm so sorry for the impossible situation you've been put in!",
                          "author": "doornroosje",
                          "created": 1626063964,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h4rros1": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rros1/",
          "text": "not really related to background, but I think schools also focusing on letting in too many students they cant properly support is the issue. Most grad schools are taking in as many students as they can while paying them the bare minimum, then those students leave to a job market that is stretched thin. \n\nThe whole thing is pretty broken from top to bottom. Going through grad school without financial support was not easy, and there are plenty of people in worse situations than I was in. I know multiple people who have taken loans that add up to 6 figures just to get through a grad program they had stipends for. Some due to supporting families, others because bad spending habits. \n\nI did my PhD in the southeast where its relatively cheap to exist. I know people in the pacific NW that went into living in a van and will be coming out with nothing more than that same van.",
          "author": "NickDerpkins",
          "created": 1625973181,
          "upvotes": 20,
          "replies": {
            "h4rs79u": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rs79u/",
              "text": "Yeah. My fiance and I pay 1200 a month rent, and she makes about 45k a year as a phd student since she adjuncts an extra class each semester... we've been unbelievably lucky.\n\nHer program only has 5 people per year (usually half drop out). I can't imagine what it would be like with the # of grad students some places have.",
              "author": "husky429",
              "created": 1625973493,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "h4rb6zb": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rb6zb/",
          "text": "This is a major issue... one I've been hammering on for years. Graduate school was traditionally only available to children of wealthy families. Political pressure has forced universities to open the doors to other demographics, but administrators continue to operate as if each and every graduate student has a trust fund for living expenses and that compensation is merely for walking-around money.",
          "author": "impressive_neglect",
          "created": 1625963846,
          "upvotes": 50,
          "replies": {}
        },
        "h4rtf4q": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rtf4q/",
          "text": "This is an *excellent* point.\n\nMy parents are not incredibly well off, but I'm definitely still privileged here. I lived in a camper on my parent's property (and paid them rent) to save money before graduate school. I cannot imagine having gone into school without the emergency fund I have from that (of which I have used a lot, between my beater car needing repairs and my dog needing emergency vet care). And I couldn't have put away any money if I couldn't find a job within an hour of them because all I was able to save was the difference between the rent in my area and the rent I was paying them. Utilities, car, etc. took up literally every other cent of the best job I was able to find with my bachelors.\n\nWhat if something worse had happened to my dog, or I didn't have that emergency fund? Where are the resources for the student who got in a car accident and has no transportation to school, no disposable income for a down payment on a new car? They live in a bad part of the city (since that's all we can afford rent-wise) and walk over an hour each way to spend 11 hours a day in the lab.... Where are the resources for the students with dependents, significant others, when they need help? Do we have to only associate ourselves with partners that are well off? I find myself jealous of my friends in my program who are married to well-off people who front the bill when something happens, like needing to move somewhere new ASAP.  I went through a breakup and lived with my abusive ex for *six months* because neither of us could afford to buy ourselves out of the lease and put the first, last, and security on a new place, and that is far from the worst I can imagine. And I picked the program with the biggest disparity between stipend and cost of living. Having to be smart with limited funds is very different than knowing you're one 'small' problem completely out of your control away from being in a very scary financial position.",
          "author": "corgibutt19",
          "created": 1625974220,
          "upvotes": 16,
          "replies": {
            "h4sgfqt": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sgfqt/",
              "text": "I honestly don't think it's a very good point. The vast majority of \"traditional\" students get no appreciable financial support either. I've noticed a lot of first gen students here put up a strawman of the typical grad student who is given a $1k per month stipend from their parents while getting a bunch of tips about how to navigate academia from their parents, and that student just doesn't exist in an appreciable quantity (in the sciences at least). If they aren't obviously doing things that they shouldn't be able to afford or coming from an academic family, chances are they aren't getting financial help from home and were flying into grad school blind too. They probably would get help if they were facing homelessness, but it should never get to that point anyway.\n\nThe problem is a lot of bad housing policy for a few decades, a little bit of real estate being a common vehicle to hide money from authoritarian regimes, and a lot of schools underpaying grad students. The first two sound like the real cause of what OP is seeing here. 85% rent increases are not remotely normal and are completely unheard of outside of a select few cities. Not making enough to start paying off your debt is one thing, but being able to afford rent and eating and utilities and a cellphone and transportation without getting into extra debt isn't asking too much.",
              "author": "Mezmorizor",
              "created": 1625991965,
              "upvotes": 13,
              "replies": {
                "h4vqmew": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4vqmew/",
                  "text": "Perhaps my program is skewed, but I don't think many people think everyone has allowance from family. More like the vast majority of the old guard of grad students can take risks. They take care of themselves, but if their car breaks down they have the ability to get help, or someone to cosign for an apartment, etc. because most have some generational wealth.",
                  "author": "corgibutt19",
                  "created": 1626059748,
                  "upvotes": 2,
                  "replies": {}
                },
                "h4xywhe": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4xywhe/",
                  "text": "Eh.  Most students that I know aren't living off of their parents money regularly... but they did get a car from their parents.  And their parents pay for half of it if their car breaks down.  Or their parents paid the security deposit for their apartment.  And their parents paid for their undergrad, so they could save money during that time.  And the domestic students I know sure as hell don't send their parents money to live. \n\nSo day-to-day expenses not really, but most of the grad students that I know do get pretty substantial help from their parents.",
                  "author": "Vermilion-red",
                  "created": 1626111320,
                  "upvotes": 1,
                  "replies": {}
                },
                "h4tx9fw": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tx9fw/",
                  "text": "Yeah I agree. While academic life is definitely hostile to the poor, it also surely does not attract the 0,01% who will be financially supported by their parents all their life because they're so flush with money. I don't know anyone who gets financial support from their parents in doing a phd.",
                  "author": "doornroosje",
                  "created": 1626026776,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h4r741t": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r741t/",
      "text": "You mentioned being open about it so I'll ask (but feel free to ignore this comment if you're not comfortable sharing)-- would you be willing to share your day-to-day experience with homelessness as a grad student? I've heard some undergrads living out of cars so I'm guessing this is something like that where you can make use of university resources?",
      "author": "secretlizardperson",
      "created": 1625961509,
      "upvotes": 14,
      "replies": {
        "h4r9ul5": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r9ul5/",
          "text": "Sure! Someone up top asked a similar question, so I'll just copy what I said there:\n\nIt's pretty much like everyone else. A major benefit of working at a   \nuniversity is that there are a ton of community showers, kitchens,   \nbathrooms, etc. It was tough during COVID lockdowns when I couldn't   \neasily get into most buildings, but things are mostly back to normal   \nnow.",
          "author": "impressive_neglect",
          "created": 1625963069,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h4r5bgn": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r5bgn/",
      "text": "85 PERCENT!?!?!?!?!?!",
      "author": "RuthlessKittyKat",
      "created": 1625960491,
      "upvotes": 55,
      "replies": {
        "h4rd6oq": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rd6oq/",
          "text": "Yup, without exaggeration. There have been some massive protests, including by faculty. Administration has responded by literally mocking anyone who can't afford the increase",
          "author": "impressive_neglect",
          "created": 1625964938,
          "upvotes": 30,
          "replies": {
            "h4rqtqf": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rqtqf/",
              "text": "Can you name and shame?",
              "author": "toss_my_potatoes",
              "created": 1625972662,
              "upvotes": 18,
              "replies": {
                "h4s44y4": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4s44y4/",
                  "text": "Did a quick google search, and it is [most likely UCSD](https://ucsdguardian.org/2021/04/25/submission-ucsd-graduate-housing-rent-increase-undermines-universitys-mission/).",
                  "author": "talllankywhiteboy",
                  "created": 1625981207,
                  "upvotes": 28,
                  "replies": {
                    "h4snqrk": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4snqrk/",
                      "text": "“The two-bedroom apartment I am renting will cost future students $1,998 per month, which, despite being one of the cheapest two-bedroom options, would be 75 percent of my salary.”\n\nYeah.. I got offered a pretty enticing postdoc at UCSD a week back but FUCK that",
                      "author": "quohr",
                      "created": 1625999268,
                      "upvotes": 22,
                      "replies": {
                        "h4tvtb9": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tvtb9/",
                          "text": "My studio (also in CA) was $2350 per month.\n\n$2K for a two-bedroom is a very good price.\n\nIdeally they should make up the rising rent costs by raising their salary. However, even this isn't so simple. These salaries are usually allocated within funds (e.g., the PI, department, university, etc.) for several years, and the extra money will need to come from somewhere. You can invoke endowments all you want... the fact is that expenses *will need to be cut* to make up for raising salaries. This may translate to job loses, budget cuts, etc.",
                          "author": "ricksteer_p333",
                          "created": 1626026054,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "h4trx5w": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4trx5w/",
                          "text": "It's a two-bedroom? That's 1000 dollars a room which is a totally normal price in like every city in the country.",
                          "author": "Beren87",
                          "created": 1626024114,
                          "upvotes": 6,
                          "replies": {
                            "h4txigj": {
                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4txigj/",
                              "text": "yeah that's expensive but not insanely so for almost all early career professionals outside those working in tech or finance. it fucking sucks though.",
                              "author": "doornroosje",
                              "created": 1626026901,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "h4rs3mj": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rs3mj/",
              "text": "Do you guys not have a union or GSA to protest that? I genuinely think that a strike would be worthwhile. I'd genuinely get another job asap / master our, or apply to another phd program that your courses could transfer over to out of spite.",
              "author": "NickDerpkins",
              "created": 1625973431,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "h4qy10w": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qy10w/",
      "text": "Maybe do your thesis on homelessness among graduate students. Should really drive the point home",
      "author": "analmangler",
      "created": 1625956375,
      "upvotes": 12,
      "replies": {}
    },
    "h4qx0uu": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qx0uu/",
      "text": "[deleted]",
      "author": null,
      "created": 1625955832,
      "upvotes": 5,
      "replies": {
        "h4r2b1l": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r2b1l/",
          "text": "This is literally nothing for a big metro area. Minimum 2x this for my area. I would say most people are looking at 60%+ of stipend going to rent (even more if you want no roommates), which is a huge problem for grad students and our schools won't do a single thing about it.",
          "author": "CooperSly",
          "created": 1625958793,
          "upvotes": 44,
          "replies": {
            "h4rhf4v": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rhf4v/",
              "text": "It’s rising in smaller cities, too. When I started my PhD 3 years ago, my rent was 775. Now it’s 1,000. So, in two rent-increase cycles, it’s increased 225 per month. No amenities at all, and not in a safe area. (I can’t even talk a walk or wait for a bus safely. Too many murders and robberies on my street). \n\nMy university increased stipends 2% for grad students for next year. Health insurance rates nearly doubled, tho. So it’s a huge loss overall.",
              "author": "BiologyPhDHopeful",
              "created": 1625967339,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "h4qypw6": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qypw6/",
          "text": "Come to California, you'll pay 3x that for an on-campus apartment!",
          "author": "SaabAero",
          "created": 1625956757,
          "upvotes": 24,
          "replies": {
            "h4tdfxa": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tdfxa/",
              "text": "Right?!? My 2 bd/1ba apartment here is $1900/mo and doesn’t even have in unit laundry! But it’s actually a good deal compared to other units currently on the market.",
              "author": "blackmadscientist",
              "created": 1626016813,
              "upvotes": 2,
              "replies": {}
            },
            "h4rgf9i": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rgf9i/",
              "text": "Normally on campus housing is way more expensive than off campus. This is not a big surprise.",
              "author": "RenegadeBevo",
              "created": 1625966779,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h4r75vz": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r75vz/",
          "text": "it is very dependent on where you are - 580 a month where I am would hardly get you a room in someone's house 30 miles away from campus",
          "author": "per-severance",
          "created": 1625961538,
          "upvotes": 19,
          "replies": {
            "h4r76q8": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r76q8/",
              "text": "30 miles is 48.28 km",
              "author": "converter-bot",
              "created": 1625961550,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h4qxllg": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qxllg/",
          "text": "It depends on where you live and how many people you live with -- most of the grad students I know had to move an hour or so out of the city their school is in, and they're still paying over $700 in rent with coin op laundry in the basement",
          "author": "sheesh-mcgeesh",
          "created": 1625956143,
          "upvotes": 16,
          "replies": {
            "h4qycpp": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qycpp/",
              "text": "[deleted]",
              "author": null,
              "created": 1625956554,
              "upvotes": 2,
              "replies": {
                "h4qykoa": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qykoa/",
                  "text": "They live with another person, at least 1 other person. But this is Massachusetts/Boston we're talking about 😂",
                  "author": "sheesh-mcgeesh",
                  "created": 1625956676,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "h4sdxx8": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sdxx8/",
          "text": "That is extraordinarily cheap. I live in a mid-sized city and currently live in the only 1 bedroom apartment within 3 miles of campus that is less than $1k/mo. I pay $975 for a tiny shitty apartment to have the luxury of being close enough to walk to work so I dont need an expensive parking pass.",
          "author": "JamesIgnatius27",
          "created": 1625989545,
          "upvotes": 4,
          "replies": {
            "h4sdyex": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sdyex/",
              "text": "3 miles is 4.83 km",
              "author": "converter-bot",
              "created": 1625989557,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h4r5krs": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r5krs/",
          "text": "CAD or USD? If it's the former, it's a little high for my current city but a pretty sweet deal for my former. If it's the latter, that's more than my current 1Br.",
          "author": "sophia_s",
          "created": 1625960639,
          "upvotes": 2,
          "replies": {}
        },
        "h4re4ua": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4re4ua/",
          "text": "It’s on average for a mid size city like my college is in. I lived off campus as an undergrad then moved home with my parents for my PhD, but back in 2019 the rent was $405 for a smallish room in a 4 bed apartment.",
          "author": "happytransformer",
          "created": 1625965468,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h4qwnz2": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qwnz2/",
      "text": "Wow this is kinda terrifying as someone looking into grad school in a year, and in expensive cities.. what is your lifestyle like as a homeless grad student?",
      "author": "maverna_c",
      "created": 1625955636,
      "upvotes": 71,
      "replies": {
        "h4rfit4": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rfit4/",
          "text": "You should look at the funding package of the school and the cost of living to decide if the school is a good match for your financials. There are lots of great programs that will come out to being cost neutral.\n\nR1 schools in very expensive cities tend to be older and have invested in subsidized housing for salaried (doctoral) graduate students, this can make attending a school feasible. Look at what cheap housing options are like, the tradeoff in commute time and quality to decide if you can live with your options. You should enter grad schools eyes wide open about what your financials will be like.\n\nNon-funded graduate programs can be ~~are often~~ a scam so buyer beware.\n\n&#x200B;\n\nJust to be clear I'm not talking about what graduate school should be like. But this is the reality we currently live in and even if you are pushing for change you should be aware what your daily life will be like.",
          "author": "entropyStable",
          "created": 1625966265,
          "upvotes": 31,
          "replies": {}
        },
        "h4r4eeq": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r4eeq/",
          "text": "Pretty much like everyone else. A major benefit of working at a university is that there are a ton of community showers, kitchens, bathrooms, etc. It was tough during COVID lockdowns when I couldn't easily get into most buildings, but things are mostly back to normal now.",
          "author": "impressive_neglect",
          "created": 1625959978,
          "upvotes": 44,
          "replies": {
            "h4s3as0": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4s3as0/",
              "text": "I am sorry, but Iam a bit curious... How exactly do things work? Do you have your own office to sleep in and store any personal items? Or do you do that in a car? How does the average day look like?",
              "author": "mechanical_fan",
              "created": 1625980607,
              "upvotes": 14,
              "replies": {
                "h4u6esm": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4u6esm/",
                  "text": "I slept in the lab during my undergrad (due to various reasons which I prefer not to tell, not financial tho) so it's something I could relate. \n\nOur group had an office space so I bring my sleeping bag there, and I take my shower at the university gym.\n\nMy labmates didnt know I slept there, so I woke up pretty early every day. If I stayed late last night and I knew I am gonna wake up late, I slept at some common area which I know few people will passby.\n\nAverage day was either attending class (Although I skipped most of my class in undergrad except those requiring artendance) / hanging out with friends/ gaming/ working in lab",
                  "author": "Xpolonia",
                  "created": 1626031309,
                  "upvotes": 2,
                  "replies": {
                    "h4u6wcr": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4u6wcr/",
                      "text": "In that case, where did you store things? Or did you manage to fit all your possessions in a backpack (all clothes, school stuff, hygiene items, the sleeping bag itself, etc)?",
                      "author": "mechanical_fan",
                      "created": 1626031555,
                      "upvotes": 1,
                      "replies": {
                        "h4um35n": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4um35n/",
                          "text": "Every group memeber has their own desk which the drawers can be locked with your own keys, that's where I hide my sleeping bag and hygiene stuff.\n\nStudents can also rent a locker from the university (like less than 10USD per year) so I put my rest of the stuff there.",
                          "author": "Xpolonia",
                          "created": 1626038898,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h4sdloe": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sdloe/",
              "text": "Where do you keep your belongings, and how do you prevent them getting stolen?\n\nWhere do you sleep, and do you feel safe sleeping there? (And if you don’t mind me asking, what is your gender?)\n\nSorry for all the questions - you’re living out something I’ve always feared, and yet to you it is something that is apparently not so bad and that you choose voluntarily… so I am extremely curious to know how you make it work.",
              "author": "tentkeys",
              "created": 1625989216,
              "upvotes": 13,
              "replies": {
                "h4u41gr": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4u41gr/",
                  "text": "Can’t speak for OP but I loved the “van life” for almost three years in graduate school in the 1990s. Got a small storage unit for anything that wouldn’t fit in the van; worked using a Mac laptop that I bought with my stash for first/last months rent; had an office.  It worked out pretty well.  Had to watch out for cops; but the lifestyle was unusual enough then and there that I was only hassled a small handful of times.",
                  "author": "drzowie",
                  "created": 1626030114,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h4qtp6l": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qtp6l/",
      "text": "I'm not sure how much this is a trend or coming national wave of hardship vs a reaction to your campus almost doubling rents. Anecdotally, most people I know are in a better position financially because our stipends stayed the same but rents dropped a ton / other expenses were down. Still it's f'd up that places aren't paying students enough to live on.",
      "author": "mediocre-spice",
      "created": 1625954072,
      "upvotes": 50,
      "replies": {
        "h4qvlrl": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qvlrl/",
          "text": "Apparently this is an undergraduate issue as well:\nhttps://www.usatoday.com/story/money/2019/06/10/homelessness-among-college-students-growing-crisis/3747117002/\n\nAnd community colleges too: https://www.nytimes.com/2020/02/20/education/learning/college-homeless-students.html",
          "author": "MycologistWise8215",
          "created": 1625955065,
          "upvotes": 29,
          "replies": {
            "h4qwhjf": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qwhjf/",
              "text": "Yeah, it's been a long-standing issue for undergrads that needs to be addressed, but I don't think the change OP is suggesting where homelessness will be common among students is coming.",
              "author": "mediocre-spice",
              "created": 1625955540,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "h4r3q3f": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r3q3f/",
          "text": "To clarify: I don't think any of these students are currently in graduate housing. Rents are skyrocketing locally, which [apparently isn't uncommon](https://www.washingtonpost.com/business/2021/07/09/rent-prices-rising/). Something I'm hearing from friends who live off-campus is that landlords are getting around rent increase controls by simply not renewing leases, as controls don't apply to new contracts. (I'm not confident in the accuracy of that.)",
          "author": "impressive_neglect",
          "created": 1625959595,
          "upvotes": 17,
          "replies": {
            "h4r5gu3": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r5gu3/",
              "text": "Yes that is usually a work around. Sadly, there are so many loopholes in rent controls it is ridiculous. And enforcement of laws well.. that's a can of worms to say the least.",
              "author": "RuthlessKittyKat",
              "created": 1625960576,
              "upvotes": 12,
              "replies": {}
            },
            "h4raehf": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4raehf/",
              "text": "I mean, that article is saying some places went up, some went down just like I am (& it would be more if they looked summer to summer, feb to may is a bad comparison). \n\nI'm not saying this isn't a real issue that needs to be taken seriously, that rent isn't too high, that landlords don't do scummy things, or that grad students aren't underpaid but homelessness isn't about to become the norm for grad students.",
              "author": "mediocre-spice",
              "created": 1625963392,
              "upvotes": 3,
              "replies": {
                "h4rcuxx": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rcuxx/",
                  "text": "You're totally right, financial hardship won't ever be the norm for graduate students... largely because graduate students typically come from very secure financial backgrounds. \n\nHowever, increasing heterogeneity in cost-of-living threatens to impact those minority of students who are most vulnerable. Even if some areas end up better-off, the overall incidence of homelessness could increase. I'm not arguing that it **will** increase! Only that it might, given current conditions, and that it would be wise for our community to be aware of the possibility",
                  "author": "impressive_neglect",
                  "created": 1625964756,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h4qpimf": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qpimf/",
      "text": "Get a job and a less useless program loser",
      "author": "calmlaundry",
      "created": 1625951912,
      "upvotes": -92,
      "replies": {
        "h4r6sf7": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r6sf7/",
          "text": "You took actual time out of your actual day to call someone a loser for being homeless, so maybe think about the irony there.\n\nAlso, a phd program _is_ a job: it is a full time paid position.",
          "author": "secretlizardperson",
          "created": 1625961326,
          "upvotes": 25,
          "replies": {
            "h4sdkf8": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sdkf8/",
              "text": "Trolling aside, they have a point. If your current job can't pay for a roof over your head, you really need to re-think your life (which isn't a bad thing).",
              "author": "psinaptix",
              "created": 1625989184,
              "upvotes": -9,
              "replies": {
                "h4syb1t": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4syb1t/",
                  "text": "Or we could blame the fact that homelessness is a problem with society, not a problem with an individual.",
                  "author": "secretlizardperson",
                  "created": 1626008162,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "h4qqp08": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qqp08/",
          "text": "Try being nicer to people.",
          "author": "MycologistWise8215",
          "created": 1625952540,
          "upvotes": 28,
          "replies": {}
        },
        "h4r3gue": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r3gue/",
          "text": "what an interesting way to announce you hate your life and have low self-esteem.",
          "author": "terraincognita360",
          "created": 1625959450,
          "upvotes": 15,
          "replies": {}
        },
        "h4r79r3": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r79r3/",
          "text": "Oh damn, so much edge here I thought I was reading about network topology for a sec",
          "author": "impressive_neglect",
          "created": 1625961597,
          "upvotes": 14,
          "replies": {}
        },
        "h4r86uu": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r86uu/",
          "text": "Ahh the neighborhood dunce is out again. Welcome!",
          "author": "husky429",
          "created": 1625962115,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h4qlfyj": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qlfyj/",
      "text": "Here is a link to another discussion on this issue from earlier this year for those interested: https://www.reddit.com/r/GradSchool/comments/l6oc1w/homeless_during_grad_school/?ref=share&ref_source=link",
      "author": "MycologistWise8215",
      "created": 1625949763,
      "upvotes": 15,
      "replies": {}
    },
    "h4qhgrb": {
      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qhgrb/",
      "text": "Nobody is entitled to grad school and people always have the option to work another job if they do not want to be homeless.",
      "author": "thetiniestsquirrel",
      "created": 1625947551,
      "upvotes": -98,
      "replies": {
        "h4r59sq": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r59sq/",
          "text": "Dang, I'd like to know where you went to grad school where you'd able to work a second job! Every GSR or fellowship contract I know of specifically forbids having additional employment.",
          "author": "impressive_neglect",
          "created": 1625960465,
          "upvotes": 31,
          "replies": {}
        },
        "h4r4vmg": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r4vmg/",
          "text": "This is ignorant. Research drives our world. You need grad students to have people who become researchers or other kinds of experts in their respective fields. If it becomes a common theme for graduate students to not be able to afford housing, the US won't have as many graduate students because it'll be a huge deterrent from entering programs here. Some students may go abroad, other students may choose other paths. Not only that, but they do work during their programs. The research they do is work, and they also usually teach classes or are teaching assistants at their university.",
          "author": "dontcry2022",
          "created": 1625960243,
          "upvotes": 24,
          "replies": {
            "h4reeuc": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4reeuc/",
              "text": "Not to mention, there’s HUGE problems in having all grad students being just wealthy kids who have parents that can support them being the only ones conduct research. Having a diverse group of folks brings many different perspectives to the table and can lead to ground breaking research that’s focused on areas not prioritized among the wealthy folk.",
              "author": "happytransformer",
              "created": 1625965624,
              "upvotes": 18,
              "replies": {}
            }
          }
        },
        "h4qhpsh": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qhpsh/",
          "text": "Housing is a human right.",
          "author": "thisismygoodangle",
          "created": 1625947694,
          "upvotes": 56,
          "replies": {
            "h4qi2qz": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qi2qz/",
              "text": "Nope. If a person is capable of having a job but refuses to work, they are not entitled to other people's labour.",
              "author": "thetiniestsquirrel",
              "created": 1625947895,
              "upvotes": -82,
              "replies": {
                "h4r2nli": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r2nli/",
                  "text": "Grad school like a PhD is a research JOB, it’s a legit 9-5 and it’s hard work. You thinking that’s it’s not a real job is honestly one of the stupidest things ever. These people are entitled to ask and protest for a living wage and stipend, this stupid comment thread that you have created is out of ignorance and/or privilege in having a living wage from a stable job something not everyone has. These people want a higher level degree to get a more secure job, it’s not that they are lazy but rather they are actually trying to get ahead and your telling them they don’t deserve a livable way to do that?",
                  "author": "Big-thiccy-Hamza",
                  "created": 1625958991,
                  "upvotes": 29,
                  "replies": {}
                },
                "h4qr62u": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qr62u/",
                  "text": "What labor are they taking from landlords? The landlord didn’t build the house with their own hands.",
                  "author": "dewitt72",
                  "created": 1625952778,
                  "upvotes": 26,
                  "replies": {
                    "h4qre1v": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qre1v/",
                      "text": "How exactly are landlords relevant to the government ensuring everyone has housing?",
                      "author": "thetiniestsquirrel",
                      "created": 1625952894,
                      "upvotes": -19,
                      "replies": {
                        "h4r5cef": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r5cef/",
                          "text": "Landlords own a ton of housing. The more people that can't afford housing due to their unreasonably high prices, the more people that the government has to provide for since *many people are already working yet can't afford rent*. Any time a living wage is not given by an employer or someone who owns majority of a resource makes it too high of a price for others to pay, that's more people the government has to worry about to keep our society running, keep crime rates low, etc.",
                          "author": "dontcry2022",
                          "created": 1625960505,
                          "upvotes": 8,
                          "replies": {}
                        },
                        "h4qs0aw": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qs0aw/",
                          "text": "I don’t know, but we could ask our friends Mao and Stalin.",
                          "author": "dewitt72",
                          "created": 1625953208,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h4qknv8": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qknv8/",
                  "text": "What a stupid statement.",
                  "author": "MycologistWise8215",
                  "created": 1625949329,
                  "upvotes": 36,
                  "replies": {
                    "h4qlrwa": {
                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qlrwa/",
                      "text": "Why?",
                      "author": "thetiniestsquirrel",
                      "created": 1625949938,
                      "upvotes": -15,
                      "replies": {
                        "h4qna88": {
                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qna88/",
                          "text": "The other poster stated: \"Housing is a human right.\" \n\nYou dismissed that statement, but by talking about labor: \"If a person is capable of having a job but refuses to work, they are not entitled to other people's labour.\"\n\nYour statement appears stupid because you did not give any sort of cohesive argument as to why housing is not a human right.  You do not explain labor's relationship to housing or whether housing or labor are related.  Whatever point you're trying to make is not clear, in other words.\n\nIt also seems like you just want to troll and belittle people on a Grad School forum for reasons that are beyond my understanding.  If this gives you pleasure or makes you feel superior, I feel sorry for you.\n\nSo, taking all that into account, what you said was, in my opinion, a stupid statement.  \n\nI award you no points and may God have mercy on your soul.",
                          "author": "MycologistWise8215",
                          "created": 1625950734,
                          "upvotes": 36,
                          "replies": {
                            "h4qo0ru": {
                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qo0ru/",
                              "text": "Let me explain it more clearly. Monkey 1 wants to play with toys all day. Monkey 1 is hungry. Monkey 2 works for bananas. Monkey 1 steals bananas from Monkey 2. This is unfair and Monkey 1 is not entitled to Monkey 2's bananas. Hopefully it's clearer for you.",
                              "author": "thetiniestsquirrel",
                              "created": 1625951131,
                              "upvotes": -15,
                              "replies": {
                                "h4qofvi": {
                                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qofvi/",
                                  "text": "All this while Monkey 3 has millions of bananas from exploiting the work of other monkeys and refuses to give up any to monkeys who need them.",
                                  "author": "FerociousPanda77",
                                  "created": 1625951358,
                                  "upvotes": 34,
                                  "replies": {}
                                },
                                "h4qojop": {
                                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qojop/",
                                  "text": "Again, what does that have to do with housing?  Now you are talking about theft.  Your logic is childish and unfocused.\n\nGo back to school.",
                                  "author": "MycologistWise8215",
                                  "created": 1625951415,
                                  "upvotes": 36,
                                  "replies": {
                                    "h4qoy57": {
                                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qoy57/",
                                      "text": "If you understand the concept of a human right, it is a right given to everyone unconditionally. The human right to housing basically means that no matter what, a person gets housing. In other words, people who work are required subsidize those who choose to not work or do activities which provide little to no value. I misunderstood you as understanding what a human right is.",
                                      "author": "thetiniestsquirrel",
                                      "created": 1625951630,
                                      "upvotes": -5,
                                      "replies": {
                                        "h4qqavc": {
                                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qqavc/",
                                          "text": "You assume that people who use subsidized housing are lazy or unproductive.  This connects back to the stunted logic of your your original argument: \"If a person is capable of having a job but refuses to work, they are not entitled to other people's labour.\"\n\nSo your point seems to be built on the assumption that a person is homeless simply because they refuse to work and are lazy or entitled.  Your logic completely avoids the socio-economic conditions a person may be born into, as well as other factors such as housing loss due to wars/conflicts or natural disasters.\n\nYou also rejected the other user's statement \"Housing is a human right\" in your earlier point, so why are you using the concept of human rights in your argument now?\n\nYou seem to simply dislike poor people and are using poor logic to defend that point. \n\nAre you sure you went to university?",
                                          "author": "MycologistWise8215",
                                          "created": 1625952330,
                                          "upvotes": 29,
                                          "replies": {
                                            "h4qqn6f": {
                                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qqn6f/",
                                              "text": "Where exactly did I assume that all people who use subsidized housing are lazy or unproductive?\n\nCan you logically explain step by step how you arrived at me rejecting human rights based on rejecting a right to housing? \n\nIt seems like you're projecting arguments which I made no implication of.",
                                              "author": "thetiniestsquirrel",
                                              "created": 1625952513,
                                              "upvotes": -5,
                                              "replies": {
                                                "h4qsp4q": {
                                                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qsp4q/",
                                                  "text": "From your earlier statement: \"The human right to housing basically means that no matter what, a person gets housing. In other words, people who work are required subsidize those who choose to not work or do activities which provide little to no value.\"\n\nI assumed based on your use of these words that those who use subsidized housing are those \"who choose not to work\" (i.e. lazy; albeit those are my words) or \"do activities which provide little to no value\" (i.e. unproductive, but again I'm just attempting to synthesize your argument).\n\nFrom my understanding, housing as a human right is recognized internationally in documents like the Universal Declaration of Human Rights, so it is very much a recognized human right.  Whether that is put into action, I guess, is another discussion.\n\nI didn't say you rejected human rights. I was just trying to follow your logic on explaining housing as a human right.\n\nAgain it just seems like you really don't like social welfare programs or poor people.",
                                                  "author": "MycologistWise8215",
                                                  "created": 1625953567,
                                                  "upvotes": 13,
                                                  "replies": {
                                                    "h4qtrpb": {
                                                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qtrpb/",
                                                      "text": "There is no logic behind your unfounded assumptions. Just because there are some people who are lazy and unproductive does not mean all people who take unsubsidized housing are categorised as that. I'm very careful with my words, and you're clearly not reading carefully, which has led to you wasting a lot of time on useless discussion.\n\nYou have no idea what a human right is. It's directly about what should be put into action. It's not some random label which means nothing. Read up on it: https://www.un.org/en/about-us/universal-declaration-of-human-rights\n\nI see no reason as to your claim that it seems like I don't like welfare programs or poor people. \n\nOverall it seems like you lack basic reading and logic skills and that you do not have an understanding of general concepts like human rights.",
                                                      "author": "thetiniestsquirrel",
                                                      "created": 1625954109,
                                                      "upvotes": -7,
                                                      "replies": {
                                                        "h4qvb4o": {
                                                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qvb4o/",
                                                          "text": "Nah my time wasn't wasted.  This was fun!\n\nCheck Article 25 of the UDHR: \n\n\"Everyone has the right to a standard of living adequate for the health and well-being of himself and of his family, including food, clothing, housing and medical care and necessary social services, and the right to security in the event of unemployment, sickness, disability, widowhood, old age or other lack of livelihood in circumstances beyond his control.\"\n\nSo I don't really get what your point is in that second paragraph. \n\nI'm just trying to interpret your words here.  The reason it seems you dislike poor people/welfare programs is the tone of a lot of your posts which seem to simply belittle people.\n\nHonestly, I'm not sure what your deal is.  \n\nBut seriously: Go back and look at some of the language of your posts and comments.  Don't you see how nasty and rude you are being to people?  Look at this conversation.  Is this who you want to be?  \n\n\nLook at your own post history and how many times you tell people to \"shut the fuck up\"\n\nDude...Like letting go of the conversation we just had I'm actually legitimately concerned for you.  You seem to have a lot of anger and insecurity and you vent it out on people over the internet.  Let that shit go.",
                                                          "author": "MycologistWise8215",
                                                          "created": 1625954913,
                                                          "upvotes": 11,
                                                          "replies": {
                                                            "h4qvwso": {
                                                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qvwso/",
                                                              "text": "Read what you sent me holy shit \"in circumstances beyond his control.\" Read before instantly hitting that post button to receive the dopamines in your head of thinking you actually made a good point.\n\nYes, there are a lot of idiots in this subreddit who deserve to be insulted. Problem?\n\nI'm not angry at all, I'm actually laughing at people's inaptitude here, including yours.",
                                                              "author": "thetiniestsquirrel",
                                                              "created": 1625955227,
                                                              "upvotes": -4,
                                                              "replies": {
                                                                "h4qxcy1": {
                                                                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qxcy1/",
                                                                  "text": " I cited an Article relevant to our discussion.  Are you sure you read it? \"Everyone has the right to a standard of living adequate for the health and well-being of himself and of his family, including food, clothing, **housing** and medical care and necessary social services...\"  \nThat was the part I was pointing out to ask what your point was, because it seems to invalidate your argument that housing isn't a human right.  \n\nI'm not really sure what you're getting at in that first sentence. \n\nAnyway man, I guess the problem is you assume everyone else is an idiot.  I assume you think you are operating from some pedestal of higher truth, I guess.  That's some narcissistic shit man.\n\nWhy do you need to laugh at a person's perceived lack of ability? That is such a small and petty thing to do.  Are you that insecure about your own intelligence?  Why do you need to belittle strangers on the internet? What intelligent person in history has ever done that?\n\nInsulting people solves nothing and simply creates pain.  Useless, pointless pain.  \n\nBut hey man, I'll keep talking to you about it if you want.  This is fascinating.",
                                                                  "author": "MycologistWise8215",
                                                                  "created": 1625956013,
                                                                  "upvotes": 6,
                                                                  "replies": {
                                                                    "h4qxnql": {
                                                                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qxnql/",
                                                                      "text": "It doesn't invalidate it read the part you just left out holy crap. It literally means if a person is capable but they choose not to work they aren't necessarily entitled to housing. \n\nIt is funny because you're desperately trying to cling to a bullshit argument which you don't even understand in the hopes of trying to be right. You're unloading so much bullshit and hope something sticks.",
                                                                      "author": "thetiniestsquirrel",
                                                                      "created": 1625956175,
                                                                      "upvotes": 0,
                                                                      "replies": {
                                                                        "h4qytzb": {
                                                                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qytzb/",
                                                                          "text": "I'm not desperately clinging to anything man.\n\nI'll break it down:\n\nSo first part\n\"Everyone has the right to a standard of living adequate for the health and well-being of himself and of his family, including food, clothing, housing and medical care and necessary social services,...\"\n\nEveryone has the right to the following things: food, clothing, housing and medical care and necessary social services.  No of this is contingent on employment.  Nothing in this article states that a person must be employed.\n\nThe second part:\n\n\"...**and** the right to security in the event of unemployment, sickness, disability, widowhood, old age or other lack of livelihood in circumstances beyond his control.\"\n\nThis part is explaining that a person has the \"right to security\" (which I'll guess means social welfare and healthcare programs) in case they become unemployed, are sick, disabled, etc. \n\n**None of this is contingent on being employed, productive, or choosing to or not to work.**\n\nThat's the point I'm trying to make.  There are two separate rights in this article: \n\n1. The right to a standard of living adequate for health and well-being (i.e. housing)\n\n1.  The right to security in the event of unemployment, sickness, disability, widowhood, old age or other lack of livelihood in circumstances beyond his control.\n\nYour point \"It literally means if a person is capable but they choose not to work they aren't necessarily entitled to housing\" does not make sense to me in this context.",
                                                                          "author": "MycologistWise8215",
                                                                          "created": 1625956822,
                                                                          "upvotes": 8,
                                                                          "replies": {
                                                                            "h4r7q1r": {
                                                                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r7q1r/",
                                                                              "text": "Wow I commend you, this whole thread was a great read.",
                                                                              "author": "dontcry2022",
                                                                              "created": 1625961848,
                                                                              "upvotes": 5,
                                                                              "replies": {}
                                                                            },
                                                                            "h4r6460": {
                                                                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r6460/",
                                                                              "text": "This was a masterclass in civil but firm discussion in the face of irrational vitriol. I would listen to a podcast of u/MycologistWise8215 debating random trolls",
                                                                              "author": "impressive_neglect",
                                                                              "created": 1625960943,
                                                                              "upvotes": 5,
                                                                              "replies": {}
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        },
                                                        "h4quz6r": {
                                                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4quz6r/",
                                                          "text": "you are on the wrong sub lol",
                                                          "author": "A_N_Kolmogorov",
                                                          "created": 1625954734,
                                                          "upvotes": 11,
                                                          "replies": {
                                                            "h4rd9fw": {
                                                              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rd9fw/",
                                                              "text": "This person is a persistent troll on here and I don't know how the mods haven't banned them yet...",
                                                              "author": "Snwussy",
                                                              "created": 1625964981,
                                                              "upvotes": 1,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        },
                                        "h4r88kb": {
                                          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r88kb/",
                                          "text": "Your points rely on the assumption that some number of people would abuse their right to housing by not being productive members of society. There is a very small number of people who abuse welfare systems by taking advantage of them when they're not needed.\n\n&#x200B;\n\nWhile many people in our society are motivated by the need to support themselves financially, in general, humans enjoy productivity. A lot of people make money pursuing their hobbies professionally, people pick their major in school often based on their interests/passions and later their careers, a lot of people enjoy structure and a sense of purpose, and people like a sense of community, which can be found at a job. I think generally, people understand that workers are needed for us to enjoy basic necessities and luxuries, and people respect that jobs have to be done. (Which is why I think a living wage should be required even for low-skilled workers. Someone has to flip the burgers, and from 6am-4pm, it can't be the teenagers in school!) \n\nNot only that, but it's kind of nonsense to assume as well that the government would be providing others some glamorous sort of housing. People really just need a place to sleep, shower, store their belongings, make food, and relax. Some people have kids and need more space for them. I personally would not mind my tax dollars going to make sure all people have a place to live. And that means whoever is building the houses, etc., is still being compensated fairly by the government through tax dollars.\n\n&#x200B;\n\nFinally, housing people actually increases people's ability to be productive. Homelessness is often connected to mental health issues and substance abuse, which are only exacerbated by inability to have ones basic needs met (eating, sleeping, bathing, safety). Homelessness also often implies the person does not have access to reliable transportation to work, which is basically a requirement for jobs. So if your goal is a more productive and fair society, you ought to be concerned with making sure everyone is equally able to participate in such a society.",
                                          "author": "dontcry2022",
                                          "created": 1625962140,
                                          "upvotes": 4,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                },
                                "h4qwqy1": {
                                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qwqy1/",
                                  "text": "So capitalism. You are against landlords being pathetic leeches in society after inheriting housing that they never earned or worked for.\n\nJust kidding. I know you are a fucking moron.",
                                  "author": "tay450",
                                  "created": 1625955681,
                                  "upvotes": 7,
                                  "replies": {
                                    "h4qxcv3": {
                                      "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qxcv3/",
                                      "text": "Hold up. Let's say it was the parent of the landlord who worked to buy that house and wants to leave it to his offspring. Why exactly do you feel entitled to the house over their offspring getting it? Let's say the house is one million dollars. So instead of consuming frivously before their death the value of their house, they purposefully saved so as to invest it into housing which could be inherited by their offspring. \n\nAll you want to do is punish people who have been financially responsible in order to push your bullshit communist agenda.",
                                      "author": "thetiniestsquirrel",
                                      "created": 1625956012,
                                      "upvotes": -2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h4tr6p4": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4tr6p4/",
                  "text": "I'm glad to see that we agree that landlords and capitalists shouldn't exist.",
                  "author": "RepoRogue",
                  "created": 1626023753,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "h4qpa6a": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qpa6a/",
              "text": "No it’s not. Build your own house or get out.",
              "author": "calmlaundry",
              "created": 1625951798,
              "upvotes": -48,
              "replies": {
                "h4qqqr2": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qqqr2/",
                  "text": "Why would you write this comment?",
                  "author": "MycologistWise8215",
                  "created": 1625952562,
                  "upvotes": 18,
                  "replies": {}
                },
                "h4qwuqa": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4qwuqa/",
                  "text": "Ok. I'll take yours then.\n\nYour entire existence is thanks to us actual taxpayers, you fucking leech.",
                  "author": "tay450",
                  "created": 1625955739,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "h4rhqp5": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4rhqp5/",
          "text": "You sound like a typical grumpy person who resent graduate students because you're not well-educated. These people don't even know how a graduate school contract works, yet love to bully graduate students to feel better about themselves (even though that doesn't make them better!).\n\nAs OP said, I've never seen a school that allows you to get a second job, and I signed that contract coming in as well. Fortunately, my school pays pretty well, so I haven't had this issue, but these schools are very few in number. If you don't know this, you're either not a graduate student or went to a grad school that's really a joke. No graduate school that's serious about academics would want their students to be distracted from research and teaching. And there you go: graduate students aren't monkeys who want to play with toys. They're employees of a university who work for them. If you don't understand this either, you really have nothing to say in this subreddit. Like, why are you even here?\n\nPerhaps you should do more research before you troll next time.",
          "author": "Kindly_Book5115",
          "created": 1625967522,
          "upvotes": 14,
          "replies": {
            "h4s6mve": {
              "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4s6mve/",
              "text": "As a masters student I didn't work for the school. I took classes and worked another job for an unrelated company to cover my living expenses and tuition.  Not all graduate degrees are research focused, mine was practical/applied. Maybe there is some variety in the graduate experience and these limitations are for the heavily research focused degrees?",
              "author": "johonnamarie",
              "created": 1625983126,
              "upvotes": 1,
              "replies": {
                "h4sjjkb": {
                  "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4sjjkb/",
                  "text": "Well, yeah. I was talking from a Ph.D. student's point of view. OP only said \"graduate school,\" but I assumed that OP is a Ph.D. student based on their comments.",
                  "author": "Kindly_Book5115",
                  "created": 1625995063,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "h4r85e6": {
          "link": "/r/GradSchool/comments/ohps7k/anecdote_homelessness_rising_among_graduate/h4r85e6/",
          "text": "Ahh the neighborhood dunce is out. Welcome!",
          "author": "husky429",
          "created": 1625962092,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634067459
}