{
  "sid": "qbdks9",
  "link": "/r/GradSchool/comments/qbdks9/should_i_go_for_a_phd/",
  "title:": "Should I go for a Ph.D?",
  "text": "Hello. I'm currently a 3rd year Mathematics undergrad in the US. I'm 20 yrs old. I'm set to graduate this school year early. Currently I'm in the process of applying to Ph.D programs in maths. I want to ask the subreddit for general advice and thoughts about getting a Ph.D \n\nI initially wasn't planning on applying to Ph.D programs, largely because I didn't think I was good enough to do so. However, with the encouragement of my professors, who apparently think I can do it, I decided to at least apply. I'm anxious/nervous of my mental health and the idea of failing and quitting halfway through a program. I already suffer pretty heavily from Imposter Syndrome. I have a 4.0 gpa from a pretty mid tier school for mathematics but I can't seem to shake the feeling that I'm not good enough. I also suffer from clinical depression and that alone has made my undergrad process almost unbearable. There's this general feeling of being alive but not really \"living\". Doing math sometimes helps me alleviate this feeling. \n\nI'm very much someone who holds myself to the standard of perfection and has a need to finish/see things through. Graduate programs have rather high attritions rates and I'm afraid that I'll obsess over being a \"failure\" if I join one and then drop out. \n\nMy reasons for considering a Ph.D is because I like mathematics and  I think it would be cool to become a professor. Career wise, I've never saw myself as someone who would be content working in industry in some kind of office. I have been sending out applications and attending career fairs for industry jobs just to try to leave the option open. However, I think it's pretty unlikely I'll land anything since my degree is in very theoretical pure mathematics. Generally speaking, I dislike the idea of most jobs with the exception of teaching math. \n\nIs going for a Ph.D the right choice? I feel like it's one of those things you need to be all in on and the fact that I'm on the edge isn't a good sign.",
  "author": "FullMetal373",
  "created": 1634656414,
  "updated": 1634750823,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hh9hc50": {
      "link": "/r/GradSchool/comments/qbdks9/should_i_go_for_a_phd/hh9hc50/",
      "text": "\n>My reasons for considering a Ph.D is because I like mathematics and I think it would be cool to become a professor.\n\nThose are the primary reasons to go to graduate school:\n\nYou love the discipline and crave learning more.\n\nGetting a graduate degree will be good for your career goals.\n\nBut why not apply to a Master's program in math? That's a two-year commitment. It doesn't have to seem as scary. Less pressure.\n\nAnd after you've completed a year of the masters, you'll be able to decide if you want to go on for the PhD and apply for PhD programs.",
      "author": "raistlin65",
      "created": 1634667928,
      "upvotes": 1,
      "replies": {}
    },
    "hh9tf4z": {
      "link": "/r/GradSchool/comments/qbdks9/should_i_go_for_a_phd/hh9tf4z/",
      "text": "Hi I'm a math PhD student and I think you should try it. If money isn't an obstical for you you can do a masters program first and see how it goes like someone suggested. But for a muth PhD especially with your GPA you should be able to get funding (if your interested in teaching ask about what you could teach as a TA some will only ever let you do labs some you can teach your own course and then some its only ever the intros like algebra and calc 1 and some will let you teach bigger classes like intro proofs or linAlg DiffEqu etc) then not need to pay for it. I would suggest making sure you apply for places that let you get your masters on the way to the PhD. Sometimes basically just paperwork and sometimes it a bit more work. For me it was doing a masters project but my course work was the same regardless. That way if you get into it and decide its not for you you can 'masters out' and just stop after ~2 years when you get the masters. It's VERY common for grad students in the field to have some amount of imposter syndrome. If you look you can find friends that know the struggle and just having them to talk to about it can really help. When your deciding I would also ask the current grad students if the environment is more collaborative or competitive. There will always be a little bit of both bit one will definatly be stronger than the other and the current grad students will have the best idea and will gladly honestly tell you. It sounds like you would do better with a collaborative enviroment but you know you best. \n\nFor context I had a worse GPA than you and from a small liberal arts college and I'm doing ok in grad school.\n\nThere are probably typos I'm on mobile and as I tell my students \"I do math not english\"",
      "author": "potterMathWho",
      "created": 1634672651,
      "upvotes": 1,
      "replies": {}
    },
    "hh9zuo0": {
      "link": "/r/GradSchool/comments/qbdks9/should_i_go_for_a_phd/hh9zuo0/",
      "text": "Hey! You sound like you've done a lot of self-reflection on this! \n\nBefore I get into anything else I want you to sincerely consider how 'burnt-out' you're feeling towards the end of this (accelerated) degree that you're currently finishing. You do not have to start a grad program right on the heels of your undergrad; you can take some time to explore options and shore up your MH. A break is a valid option.\n\nIf you do go the grad school route, I agree with the other poster that an MA is maybe a good option to start. I largely did an MA because I didn't feel 'done' with learning at that level after my undergrad, that's a valid reason. It'll give you a taste of what academia is like, is a smaller money/time investment, and can help distinguish you on the market from those with 'just' an undergrad (the over credentialing thing is real, lol). If you do go the MA route, I suggest prioritizing programs that have a lot of support for grad students (look into health and MH provisions, student unions and associations etc;), that allow opportunities to teach/TA (so you can get a taste of that), and that have some courses that contribute to transferable skills that you can use outside of academia (for example, methodological research courses on data management and/or using systems like Matlab, R, SAS, etc).\n\nI mention the transferable skills thing because of your comment about not landing something  outside of academia because of the content of your degree, and to put down the notion that academia is a 'pure' alternative to the '9-5 grind'. Sure you might not see jobs out there that ask specifically for a degree in theoretical mathematics, but postings will ask for a degree and a skill set that you may have honed over the course of your studies, you just have to work out what those transferable skills are. I have a few friends (including a few grad school drop-outs -  they are thriving these days, ppl drop out and thrive all the time!) who leveraged math/programming/data management skills to get programmer/analyst jobs at tech start-ups, video-game companies, think tanks, consulting firms, and government. A lot of those jobs have a sort of teaching component (you engage in knowledge mobilization to teach colleagues, stake-holders, clients etc). And a lot of them, while technically 9-5, afford a lot of flexibility and are dynamic and involve fieldwork outside of an office.\n\nI don't want to shut you down on the teaching thing. I love teaching, it's very rewarding! It's just, at 20 years old I had no idea how many cool jobs there were out there and I work with so many academics who have never had another job (bless your professors that are encouraging you but I bet this is true of most of them too), and don't think they 'could ever do a 9-5' and like, there are smart people doing smart rewarding things in flexible careers outside of academia. It's possible to cultivate a highly sought-after set of skills that you can take to lots of different contexts and there's, you know, some security in that and more opportunities to dictate your working conditions! I'm glad that you're going to job fairs! Consider leveraging LinkedIn and Twitter to try and find some model jobs that you do like and then reverse engineer that search - like, find companies that you think would be cool to work for on Twitter and follow them, check their job postings and see if any of the duties descriptions light you up, think about what skills you're missing from their required list, creep their employees that have jobs you're interested in on Twitter and see where they went to school and for what.\n\nYou don't have to do a PhD because profs think you're smart. You don't have to do a PhD if you think it's gonna brick your mental health. You don't have to do a PhD because you don't know what else to do.\n\nAnd you can elect to do an MA or PhD and then quit if it doesn't serve you!\n\nAnd you can do, and finish, a PhD and discover along the way that you might like industry and that's okay too!\n\nThere likely isn't one 'right' choice. That's okay! Keep looking, keep reflecting, really consider where you're at burn-out wise. Consider applying for grad school but also jobs or internships - the act of applying, how that feels and what it entails, is instructive! Don't wait until you know 'for sure' and then act; start acting and searching and see what feels right. Good luck!",
      "author": "GeekyGeese",
      "created": 1634675187,
      "upvotes": 1,
      "replies": {
        "hha2gji": {
          "link": "/r/GradSchool/comments/qbdks9/should_i_go_for_a_phd/hha2gji/",
          "text": "I appreciate the thoughtful reply! I’ve been applying mostly to analyst type positions because they seem to fit my skill set best and seem at least moderately interesting. \n\nI think my whole life I’ve been more or less on this one set track and I’m having a hard time figuring things out now that I have options and no real guidance on what to do. \n\nA part of me really wants to go for a PhD. As a naive little freshman it was my goal to go to grad school. However, throughout the pandemic, I started to feel really burnt out and changed my mind on it. Being back in person has somewhat revitalized my interest for math. I’m having a hard time deciphering whether or not I’m really burnt out/like/love math or If it has been a situational type of thing all along. \n\nI think I really just need to try to let go of the idea of a “right” path",
          "author": "FullMetal373",
          "created": 1634676234,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}