{
  "sid": "rfl2ny",
  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/",
  "title:": "How do I get rid of this toxic mentality?",
  "text": "I’m an undergrad who goes to a school in the big ten. My dream has been to go to a top 10 school for the subject of my interest. Professors at my school tell me I shouldnt go anywhere that’s not funded, which is fair, but this mentality of mine is holding me back from taking their advice. The mentality is that I’d feel like a failure in life if I didn’t achieve this dream of going to a top 10 school for my subject. How can I rid of this?",
  "author": "NoOutlandishness9892",
  "created": 1639416639,
  "updated": 1639518444,
  "over_18": false,
  "upvotes": 38,
  "upvote_ratio": 0.83,
  "comments": {
    "hoej7z0": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoej7z0/",
      "text": "Look at tuition rates/living expense rates/ and how bad loans are. That does it for most people.",
      "author": "MotvStr",
      "created": 1639417223,
      "upvotes": 96,
      "replies": {
        "hoeqyvc": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoeqyvc/",
          "text": "I agree with this. Funding as a graduate student is a big thing. When you don't have adequate funding, you spend your time worried about supporting your basic needs instead of learning more and researching your topic. Be prepared to do your homework on the state of funding at any potential school you want to attend (and actually ask current grad students about the HONEST state of funding in the program and how hard or easy it is to get and keep funding).",
          "author": "Rose_gold_starz",
          "created": 1639420294,
          "upvotes": 40,
          "replies": {}
        }
      }
    },
    "hoej9ct": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoej9ct/",
      "text": "Well, you'll break out of this mentality when you come to understand that excellent research is done all over the place and that a program's value is determined by much more than its USNews ranking. \n\nHow do you get there? That's personal, but maybe you just need to talk to more people about grad school and go through the admissions process yourself. It's certainly not unheard of for undergrads to have misconceptions about being a graduate student.",
      "author": "__Fantastic",
      "created": 1639417238,
      "upvotes": 84,
      "replies": {}
    },
    "hog0tlg": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hog0tlg/",
      "text": "'Unfunded' is basically a rejection at most grad schools.  \n\nIf you're paying for your own degree, it's because they literally do not give a shit if you are there or not, and will take your money in exchange for free labor.  That's not 'achieving a goal', that's signing up to be used to subsidize the students who they actually want there. \n\nBasically, if you're unfunded and you go anyway, that's not achieving your goal in any meaningful way.    It's failure either way, and one is a lot more expensive.  How you deal with that fact is up to you.",
      "author": "Vermilion-red",
      "created": 1639439247,
      "upvotes": 56,
      "replies": {
        "hog3bog": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hog3bog/",
          "text": "Damn that’s harsh but kinda true, the kids they want there are phd students",
          "author": "NoOutlandishness9892",
          "created": 1639440600,
          "upvotes": 14,
          "replies": {
            "hogtnoh": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hogtnoh/",
              "text": "Unethical LPT: apply for PhD programs and master out. You'll get the pay you deserve and more likely to be expected. 50% chance you change to do a PhD anyway",
              "author": "guy1254",
              "created": 1639452800,
              "upvotes": 11,
              "replies": {
                "hoh3id5": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoh3id5/",
                  "text": "I'm pretty sure Masters are much easier to get into than the equivalent PhDs for exactly this reason",
                  "author": "satin_worshipper",
                  "created": 1639457647,
                  "upvotes": 5,
                  "replies": {
                    "hoh5jwv": {
                      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoh5jwv/",
                      "text": "Depends on the program but some programs seak out more PhD students as they have a need for researchers and TAs as well as fewer applicants.",
                      "author": "guy1254",
                      "created": 1639458780,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hoh7d23": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoh7d23/",
              "text": "Yeah.  You said it was mostly an ego thing for you, so... yeah.  \n\nSincerely, the best of luck to you in getting over it.",
              "author": "Vermilion-red",
              "created": 1639459843,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hofp8as": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofp8as/",
      "text": "My advisor is one of the premier members of his field, and our institution is well known; however, the university we're associated with is by no means a 'top 10' research university. It's like others have said, it's about the project and the advisor, not the school.",
      "author": "Kimanaio",
      "created": 1639434291,
      "upvotes": 34,
      "replies": {
        "hofujot": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofujot/",
          "text": "Isnt research environment and advisor a thing for phd programs tho, I’m looking at MS programs",
          "author": "NoOutlandishness9892",
          "created": 1639436525,
          "upvotes": -23,
          "replies": {
            "hofutfh": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofutfh/",
              "text": "You're still going to be in a lab and being advised by a PI as a master's student, if you do any sort of research-based master's. If it's a coursework-based program then I'm unsure, as I only have experience in research-based fields.",
              "author": "Kimanaio",
              "created": 1639436639,
              "upvotes": 20,
              "replies": {
                "hofxah3": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofxah3/",
                  "text": "Okay, still good to know cause I may apply to thesis options",
                  "author": "NoOutlandishness9892",
                  "created": 1639437706,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hoelmzv": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoelmzv/",
      "text": "I think institution ranking does have some value, there's typically more research areas, resources, and famous people at higher ranked schools. You, of course, should only work with someone if the relationship is a good and the personalities match. However, it can't be completely ignored that a more reputable advisor will indeed be beneficial in terms of introducing you to more collaborators and may have more resources. But if you have no funding, then there's kind of no point lol. When you say top schools, do you mean you are focused on private ivy leagues that offered unfunded phd programs? Or master programs? Paying for a masters is a scam. Either do a phd, and master out, or work and have your company eventually pay for your masters.",
      "author": "coffee24",
      "created": 1639418171,
      "upvotes": 10,
      "replies": {
        "hof6xdv": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hof6xdv/",
          "text": "My PI has echoed this sentiment a lot. Unfunded grad school is basically a scam if you have to do any sort of research/put in any extra time outside of a couple classes.",
          "author": "PerceusJacksonius",
          "created": 1639426684,
          "upvotes": 10,
          "replies": {}
        },
        "hoemmzg": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoemmzg/",
          "text": "It’s an unhealthy mentality but if I wanted to get a MS and it was Harvard where I’d take student loans vs a small school which is fully funded I’d go in debt for Harvard",
          "author": "NoOutlandishness9892",
          "created": 1639418567,
          "upvotes": -6,
          "replies": {
            "hof24u4": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hof24u4/",
              "text": "You ever been in debt? Are you perhaps underestimating how detrimental large student loans can be to your life after school? You may just need to look more long term. Grad school will be a very short part of your life journey.",
              "author": "PerceusJacksonius",
              "created": 1639424754,
              "upvotes": 26,
              "replies": {
                "hof42hv": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hof42hv/",
                  "text": "I have never been in debt no. I’m 100% underestimating the student loans. And what do you mean by look more long term?. I guess my whole mentality was if I took the hit of student loans for the MS from an ivy I’d repay it with a high paying job after.",
                  "author": "NoOutlandishness9892",
                  "created": 1639425523,
                  "upvotes": 0,
                  "replies": {
                    "hof6med": {
                      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hof6med/",
                      "text": "Well for one, the farther removed you are from school, the less what school you went to will matter. It will matter most for your first job out of school and less and less as time goes on. \n\nIn my experience, jobs are much more interested in your experience, tangible skills, and personality/fit than where you went to school. If they have to choose between a person who did good research at Harvard or did good research at school X plus has more skills/seems a better fit, they'll go with option B every time.\n\nAlso, don't overestimate the quality of those schools. Your options aren't Standford or community college. There are still a lot of excellent schools that aren't considered ivy league. Imo, you'll end up going to a school that is either barely better/not better/maybe even worse in education and research quality to have a more prestigious name on your resume, AND be saddled with crippling debt. How much more do you think you can make with a Ivy degree over just a top public school? It better be tens and tens of thousands of dollars a year more or else the 100k in debt with another 50k in interest is going to take too long to get off your back for it to be worth it. And maybe not even then because of the mental impact having that sort of debt hanging over your head for years will do to you. \n\nThese were all the thoughts that I had that made it easy for me to go for a good school to do my MS. I'm going to UMich with funding for my MS. I have a small amount of loans from undergrad, much less than a lot of other people, and I don't want any more than even that.",
                      "author": "PerceusJacksonius",
                      "created": 1639426557,
                      "upvotes": 21,
                      "replies": {
                        "hofamq1": {
                          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofamq1/",
                          "text": "So you still ended up taking out loans, but only for the portion thats not being funded and can be paid off easily?",
                          "author": "NoOutlandishness9892",
                          "created": 1639428248,
                          "upvotes": 1,
                          "replies": {
                            "hofk9d2": {
                              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofk9d2/",
                              "text": "The loans were only during my undergraduate degree. My MS will be fully funded, no loans required, but I haven't started yet. I don't start until next fall semester. I was accepted for this year but needed to defer my acceptance to next year for a couple reasons, but mostly to make the sure the funding was sorted and getting ready for the big move since it's in another state.",
                              "author": "PerceusJacksonius",
                              "created": 1639432215,
                              "upvotes": 3,
                              "replies": {
                                "hofkcnt": {
                                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofkcnt/",
                                  "text": "I see. What did you apply for to get funding.",
                                  "author": "NoOutlandishness9892",
                                  "created": 1639432253,
                                  "upvotes": 1,
                                  "replies": {
                                    "hofkiys": {
                                      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofkiys/",
                                      "text": "Some semesters will be funded through TA work, others semesters RA work with the PI I will be doing research with. Both come with stipend + tuition waiver.",
                                      "author": "PerceusJacksonius",
                                      "created": 1639432327,
                                      "upvotes": 5,
                                      "replies": {
                                        "hofuagv": {
                                          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofuagv/",
                                          "text": "Gotcha. Did you apply for these before applying for the program or after you got admitted",
                                          "author": "NoOutlandishness9892",
                                          "created": 1639436418,
                                          "upvotes": 1,
                                          "replies": {
                                            "hofx5eb": {
                                              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofx5eb/",
                                              "text": "After. But you can discuss with the program coordinator for schools you're interested in as to the exact time line. Which might be a good idea in general because first dibs for TA spots will be given to PhD students that need them, so it's best to ask the program coordinator if they typically have enough spots for MS students as well.",
                                              "author": "PerceusJacksonius",
                                              "created": 1639437645,
                                              "upvotes": 2,
                                              "replies": {
                                                "hofxfd4": {
                                                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofxfd4/",
                                                  "text": "Sounds good. Thanks. I’ll aggregate some things I want to ask program coordinators and start reaching out.",
                                                  "author": "NoOutlandishness9892",
                                                  "created": 1639437765,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hogpbuh": {
                      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hogpbuh/",
                      "text": "What subject are you going to be studying?\n\nTo me, it seems like people don't care as much about a master's from a top ten school as you might expect - especially in the job market. It really depends what field you're in, but these days you can get a master's from a lot of great schools online.  Sometimes they have distinctions for their online programs, but sometimes they don't. Master's degrees are significant income for the university, even better when you're working for them for free, or when you're taking all your classes online. They love master's students.\n\nI wouldn't wager that it's worth the debt, personally. \n\nA PhD from Harvard would definitely not be a bad thing in any field. But then you *absolutely* should be getting funding. 4-5 years with no funding would be a hell no for me.",
                      "author": "bennie_jezz",
                      "created": 1639450800,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoemmfj": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoemmfj/",
      "text": "Maybe focus your dream towards more specific programs / teachers / departments. Having a broad ideal is great, but having a refined destination will help you make the choice and choose which direction to focus your efforts. I also second your professor’s opinions. I was given this piece of advice; don’t pay for your masters, and get paid for your doctorate. I only applied to schools that had funding opportunities attached to the program, so my process looked like this—\n\nStep 1: I want to study X at the graduate level\n\nStep 2: I want to study X at the graduate level BECAUSE….\n\nStep 3: I want to study X at the graduate level in THIS TYPE OF ENVIRONMENT\n\nStep 4: I want to study X at the graduate level with THIS PERSON/DEPARTMENT\n\nGood luck! Try to think about substance and environment more than clout!",
      "author": "Nukutu",
      "created": 1639418561,
      "upvotes": 7,
      "replies": {
        "hoeonbp": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoeonbp/",
          "text": "True. Maybe it’s harder because I don’t want to do my phd either. But aren’t most of the top programs the top because they have good professors and departments?",
          "author": "NoOutlandishness9892",
          "created": 1639419367,
          "upvotes": 1,
          "replies": {
            "hofwiop": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofwiop/",
              "text": "Ehhh, kinda. What makes a department \"good\" can involve many factors. One of those is outstanding faculty, but typically this has more to do with their research and publishing acumen than their ability and willingness to teach. You could end up in a lab with a superstar at an ivy, but if they're an arrogant dick who won't teach you, what good does it do?",
              "author": "parsleybutter",
              "created": 1639437374,
              "upvotes": 7,
              "replies": {
                "hofxc9o": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofxc9o/",
                  "text": "True true",
                  "author": "NoOutlandishness9892",
                  "created": 1639437727,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hoftv7z": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoftv7z/",
      "text": "I'd look for where the most exciting research environment is. Where your dream scholars are. Etc. I know nothing about ivy league, I'm not in the US (ivy league seems a bit overrated from afar, though...). But I know that inspiring academics and excellent research environments are to be found in many places, also in less poshety posh institutions.\nI work at a more or less unknown university internationally (small country - and by unknown, I mean for the general population. It's simply \"The university of City X\" ), but with some pretty shit hot researchers. Many of whom are Professor 2s at very renowned, international institutions. Their phd students seem pretty happy with their choice of supervisor, team and opportunities, although the uni itself is not famous like Oxford or Yale.",
      "author": "Naivemlyn",
      "created": 1639436240,
      "upvotes": 6,
      "replies": {
        "hofuiv6": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofuiv6/",
          "text": "Isnt research environment and advisor a thing for phd programs tho",
          "author": "NoOutlandishness9892",
          "created": 1639436515,
          "upvotes": 1,
          "replies": {
            "hoh08aj": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoh08aj/",
              "text": "Answer to you question: it’s for masters too, depending on your degree. I am not at a top 10 school but I have a good advisor, great research opportunities, and getting paid to earn an education. Everyone is different obviously, but for me I could never enjoy myself at a university that asked me to pony up ungodly sums of money every year.",
              "author": "Internal-Bear-8184",
              "created": 1639455942,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoerp40": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoerp40/",
      "text": "There's tons of fantastic graduate programs that aren't Ivy league (Harvard) schools. I don't know if your top 10 is all ivy leagues but just because you go to an ivy league doesn't mean you're going to do well there, get a good job afterwards etc. Obviously those school names carry weight and have a long history but I've met many people who've gone to those schools and I'm like ???? How did you get in there .... (money and status usually). \n\nI went to a big 10 school for both undergrad and my master's that throughly prepared me for my PhD program I am in now. I guess my whole point is just because the school might have a long history of hype behind it doesn't mean they have the best program for you.\nAlso do you really want to not get paid for going to grad school?? It's not much usually but much better than paying for graduate school",
      "author": "donnec6",
      "created": 1639420583,
      "upvotes": 4,
      "replies": {
        "hoespzs": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoespzs/",
          "text": "Well I’d like to get paid for a MS, not necessarily for a phd cause I don’t want to get a phd. But it’s just a feeling of failure I’d get cause I’d set such a high goal I’m not meeting where all the other kids who go there are going and fulfilling that dream. Do companies not favor such higher pedigree universities for MS?",
          "author": "NoOutlandishness9892",
          "created": 1639420988,
          "upvotes": 0,
          "replies": {
            "hof36nv": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hof36nv/",
              "text": "Just because you went to a higher pedigree university doesn't mean you'll be the top applicant. Again those universities do carry weight but if there are other applicants that went to smaller, less-known universities but excelled in their program they are just as competitive. \nAlso, less-known schools will to provide more benefits, better pay to grad students to compete with other bigger schools. Of course that's not always true but just something I noticed when I was looking for grad programs. \n\nAnd not trying to talk you out of anything/discourage you but trying to give you a different perspective! You can go to what ever school you want / get into but there are so many other factors to consider besides the prestige of top universities",
              "author": "donnec6",
              "created": 1639425171,
              "upvotes": 9,
              "replies": {
                "hof4962": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hof4962/",
                  "text": "I needed to hear the other perspective to it. Thanks. It’s just an ego thing for me at this point. Like I don’t feel enough if I don’t get the prestige. But that’s something I have to fix internally.",
                  "author": "NoOutlandishness9892",
                  "created": 1639425599,
                  "upvotes": 1,
                  "replies": {
                    "hofda3e": {
                      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofda3e/",
                      "text": "Of course! Just one last suggestion I have is when you are comparing grad programs make a spreadsheet! There are templetes on the internet that you can use. I did that and man did it make comparing different programs so much easier! Good luck!",
                      "author": "donnec6",
                      "created": 1639429356,
                      "upvotes": 1,
                      "replies": {
                        "hofj0jt": {
                          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofj0jt/",
                          "text": "Thanks! I started one a few hours ago",
                          "author": "NoOutlandishness9892",
                          "created": 1639431703,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hog1yx4": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hog1yx4/",
      "text": "School reputation isn’t everything. What matters much more is that you are intellectually matched to the highest possible degree with the research you will be pursuing. Seriously! If you don’t like the thing you’re spending upwards of 60+ hours per week on, with little pay, and scarce rewards - then you’re not going to make it through: you’ll look around at the industry options and see how much better they are and just drop out in favor of that.\n\nYou really need to be well matched intellectually to the lab. That should take priority over EVERYTHING. Picking schools by name is secondary. Location is secondary. Stipend amount is secondary…. You get the idea. Make sure you are intellectually matched well - it doesn’t matter where you go if you end up not completing the degree. Ideally, you also want to be behaviorally matched to the lab environment / advisor as well as that will minimize communication and expectation stress.",
      "author": "TheWiseGrasshopper",
      "created": 1639439753,
      "upvotes": 3,
      "replies": {
        "hog3gha": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hog3gha/",
          "text": "So your saying I shouldn’t value pedigree for a MS, and look at the lab or research environment instead, correct? Like don’t put prestige first.",
          "author": "NoOutlandishness9892",
          "created": 1639440685,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hogmw55": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hogmw55/",
      "text": "I go to a state school in one of the worst states for education in the country (I believe we're ranked 48th for k-12?). Nobody has ever aspired to go to my university based on prestige.\n\nIt's also a tier 1 research school with a TON of grant funding that has attracted a lot of incredible researchers. I have two PIs (lucky me 😅) that are both extremely influential and among the most cited neuroscientists in their respective areas.\n\nThe prestige of the school only matters if you're going into a field that is heavily influenced by that kind of stuff (politics? marketing maybe?). In my area of research, it's all about grants, publishing, and productivity. If it's a good lab putting out rigorous work, that's all anybody really cares about. \n\nIn my opinion, it also seems kind of generational. I find that boomers and to a lesser extent gen-xers put a lot of weight on how \"prestigious\" the school is, but younger generations just want to see your work. That's been my experience, anyway.\n\nI'd suggest assessing your motivations. Are you motivated by the prospect of doing exciting, impactful research? Or are you motivated more by financial or social success? Do the prestigious schools you want to attend actually have the kinds of research or work you'd like to do? Because if you go there, you'll be *paying them* to do work, so hopefully it's something you actually enjoy or care about.",
      "author": "bennie_jezz",
      "created": 1639449707,
      "upvotes": 4,
      "replies": {}
    },
    "hofugez": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofugez/",
      "text": "Out of college not a single job has EVER asked me where I got my degree. Just if I had one.",
      "author": "AceAttornie",
      "created": 1639436486,
      "upvotes": 10,
      "replies": {}
    },
    "hofyl1c": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofyl1c/",
      "text": "Ask yourself why you want to go to a \"top ten\" school.",
      "author": "callednotqualified",
      "created": 1639438264,
      "upvotes": 3,
      "replies": {
        "hofz68n": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofz68n/",
          "text": "To prove to myself I can and fulfill the goal I had made many years ago.",
          "author": "NoOutlandishness9892",
          "created": 1639438520,
          "upvotes": 1,
          "replies": {
            "hofzi1q": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofzi1q/",
              "text": "Is your goal to simply attend a top ten school, or do you want to achieve what (you might think) a top ten school will allow you to do? \n\nMy point is this: you need to know the deep reason you want to go to grad school, and \"I want to go to a top ten school\" isn't it. As a grad student at Princeton, trust me.",
              "author": "callednotqualified",
              "created": 1639438667,
              "upvotes": 6,
              "replies": {
                "hog396y": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hog396y/",
                  "text": "Well, I want to go get a MS period to advance my Knowledge from my undergrad major, because I enjoyed it. But I figured if I can go to a more prestigious university for that subject then it could help me achieve greater job prospects.",
                  "author": "NoOutlandishness9892",
                  "created": 1639440555,
                  "upvotes": 1,
                  "replies": {
                    "hogdb3q": {
                      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hogdb3q/",
                      "text": "> But I figured if I can go to a more prestigious university for that subject then it could help me achieve greater job prospects.\n\nNo offense but this is an extremely naïve way to look at this. Any job in your field where it might give you greater prospects to have your MS... will know the best schools for your field. When they ask you why you paid to attend \"Top 10 School\" over \"Smaller, Funded, Prestigious Institute,\" you will sound very foolish unless you can come up with a better reason than fulfilling a goal you made years before you actually understood your field.\n\nEdit: Stated another way, the best schools for your field might not actually be the Top 10 as ranked by US News, which others have also emphasized.",
                      "author": "lurkielurker",
                      "created": 1639445382,
                      "upvotes": 5,
                      "replies": {
                        "hoghjyl": {
                          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoghjyl/",
                          "text": "It’s an extreme naive way that’s true. What do you think I should do then?",
                          "author": "NoOutlandishness9892",
                          "created": 1639447319,
                          "upvotes": 1,
                          "replies": {
                            "hohl0ub": {
                              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hohl0ub/",
                              "text": "Based on your other responses in this thread, you seem to misunderstand what a master's program is. If I were you, I would research what a master's degree in your field is like. A master's program is still a research program. You seem to think that a PhD vs a masters are very different... But at least in my field, biology, a PhD or a master's thesis both still require years of novel research. If you're still an undergrad right now, speak with your current professors about what a master's program in your field is like. Speak with them about prestigious institutes for your field specifically. This Top 10 nonsense is what your aunties and uncles might talk about, but no one in your field goes by the US News and Report. That's just foolish.",
                              "author": "lurkielurker",
                              "created": 1639469269,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hogu8oj": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hogu8oj/",
      "text": "(assuming this is STEM) One problem I'm seeing here is that you're looking for top 10 schools, when you should be looking at top 10 PIs. Also top 10 schools won't make you pay for a stem grad program.",
      "author": "guy1254",
      "created": 1639453071,
      "upvotes": 2,
      "replies": {}
    },
    "hoh03z5": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoh03z5/",
      "text": "There are big ten schools that are ranked really high, top ten even.",
      "author": "idontwantyourupvotes",
      "created": 1639455880,
      "upvotes": 2,
      "replies": {}
    },
    "hoh6tvz": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoh6tvz/",
      "text": "go to therapy",
      "author": "Tiny-Equipment8335",
      "created": 1639459527,
      "upvotes": 2,
      "replies": {}
    },
    "hohtvhj": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hohtvhj/",
      "text": "Apart from whatever has already been said, I'll also point out that the undergrad rankings don't really matter all that much for grad school. For what I want to do, Stanford, NU, and Penn have probably the top 3 programs (in that order; based on my looking at what their graduates end up doing, how well funded the programs are, the research output and impact, and so on), but then you have the UCs, UTexas, UIUC, UNC Chapel Hill, Penn State, and hell even U of Minnesota that do amazing research and produce highly employable graduates–– some of these schools wouldn't fit into an overall top 10 in any kind of undergrad ranking. On the other hand, some professional graduate degrees at Harvard, Northwestern, Columbia, and elsewhere aren't that hard to get into but will kill you with all the loans. I highly recommend you read this article from the Wall Street Journal: [https://www.wsj.com/articles/financially-hobbled-for-life-the-elite-masters-degrees-that-dont-pay-off-11625752773](https://www.wsj.com/articles/financially-hobbled-for-life-the-elite-masters-degrees-that-dont-pay-off-11625752773) Hope this helps!",
      "author": "caspartheholyghost",
      "created": 1639476682,
      "upvotes": 2,
      "replies": {}
    },
    "hoihwcg": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoihwcg/",
      "text": "Just do the top ten then. I just took whatever PhD program I could and I'm very happy. But if you want top ten, then just do it. Who cares.",
      "author": "nbgblue24",
      "created": 1639491810,
      "upvotes": 2,
      "replies": {
        "hoii8c6": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoii8c6/",
          "text": "Well, I want to do an MS. And the top programs can’t offer funding to MS students",
          "author": "NoOutlandishness9892",
          "created": 1639492025,
          "upvotes": 1,
          "replies": {
            "hoiigsl": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoiigsl/",
              "text": "Then I would get a loan if possible.",
              "author": "nbgblue24",
              "created": 1639492150,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hoj6og0": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hoj6og0/",
      "text": "I’m a little confused— are you saying that you got an offer from a top 10 school that wasn’t funded? Or are you saying that you’re worried programs at highly ranked schools are unfunded? Or are you saying that programs for your specific subject is often unfunded so it’s not worth it to go to grad school?\n\nWhen funded grad programs for a certain subject area exists (so assuming your program of choice has funded versions of it out there in the world), it’s often times at highly ranked universities.",
      "author": "fuyumelon",
      "created": 1639502065,
      "upvotes": 2,
      "replies": {
        "hojde6u": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hojde6u/",
          "text": "For my field top 10 programs in MS don’t offer funding, and if any it’s 25% and they don’t even give GTA or GRA positions because it’s for phd students. So MS students are on your own. But the funded MS programs are at less known/prestigious universities, and so I’m just worried that if I get into the top schools I’d end up taking student loans for the sake of the prestigious name vs going to a smaller funded school",
          "author": "NoOutlandishness9892",
          "created": 1639504658,
          "upvotes": 1,
          "replies": {
            "hok7373": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hok7373/",
              "text": "That is very interesting. In the first place, terminal master degrees are not frequently funded, so I can see the conundrum. However, it's not often I hear that within a inconsistently funded program, that the ones that are funded are in lower ranked universities.  \n\n\nAre you interested at all in being in academia (so doing a PhD down the line)? And if you're going in industry, does your field care about your degree coming from a highly ranked university? If your answer is no to each then it really doesn't matter what the ranking of the program so as long as it's a program that teaches you the skills you need to start your job. I would try to focus on looking forward to success and \"prestige\" at the job you do later on with the knowledge gained form the degree, rather than focusing on the prestige of the degree itself. Redefine success and your pride in those metrics, of how well you progress your industry career. Focus on what you gain by going to a funded program-- you are not only saving money but avoiding opportunity costs in the future in that you won't have to worry about not having had enough money to invest or spend in x simply because you're in debt.",
              "author": "fuyumelon",
              "created": 1639516382,
              "upvotes": 2,
              "replies": {
                "hok9s04": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hok9s04/",
                  "text": "That’s a good point. For data scientist jobs I don’t think they care where the MS is from, I guess it’s just a bonus. But what you said about prestige in the career is better outlook to think about.",
                  "author": "NoOutlandishness9892",
                  "created": 1639517476,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hof4tbu": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hof4tbu/",
      "text": "You need to think about it in a grounded way. If those too 10 schools will actually be the right fit for your goals then great! If not then you have to reflect on what your priorities are and how going for those schools aligns with them.",
      "author": "SkulGurl",
      "created": 1639425823,
      "upvotes": 1,
      "replies": {
        "hofade6": {
          "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofade6/",
          "text": "Yeah, I mean I guess I don’t have concrete evidence which says the jobs I want need those top ten programs. At this point I guess it’s just me feeling bad for not achieving the goals I set for myself.",
          "author": "NoOutlandishness9892",
          "created": 1639428138,
          "upvotes": 1,
          "replies": {
            "hofeana": {
              "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofeana/",
              "text": "A lot of grad is learning that the goals you set a year or two ago were surprisingly arbitrary and it’s ok if you don’t meet them 😅\n\nDon’t give the goals undue weight unless they align with your core values.",
              "author": "SkulGurl",
              "created": 1639429769,
              "upvotes": 2,
              "replies": {
                "hofj2p7": {
                  "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofj2p7/",
                  "text": "Right. Thanks for this.",
                  "author": "NoOutlandishness9892",
                  "created": 1639431728,
                  "upvotes": 1,
                  "replies": {
                    "hofmhy5": {
                      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hofmhy5/",
                      "text": "Of course! It’s easy to lose sight of this.",
                      "author": "SkulGurl",
                      "created": 1639433147,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hogs37q": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hogs37q/",
      "text": "Dude you can’t afford it if it’s not funded. Most people can’t. It really sucks to be in student poverty.",
      "author": "ThePoliteCanadian",
      "created": 1639452066,
      "upvotes": 1,
      "replies": {}
    },
    "hohmffi": {
      "link": "/r/GradSchool/comments/rfl2ny/how_do_i_get_rid_of_this_toxic_mentality/hohmffi/",
      "text": "Read on the history of how inequitable the top 10 universities (among several others) historically have been and still are. Colleges and universities stand to gain from the fabricated idea of academic excellence while also creating a very hierarchical idea of who exactly is excellent.\n\nYour worth isn't determined through your labor or from discriminatory institutions like colleges.",
      "author": "BSWolf777",
      "created": 1639470384,
      "upvotes": 1,
      "replies": {}
    }
  }
}