{
  "sid": "qp0d5y",
  "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/",
  "title:": "Adding recent research positions for grad school applications",
  "text": "Hi all! \n\nCurrently have essentially everything done for grad school applications, but recently I started working on a couple projects for a couple new labs. It hasn’t been very long (~1 month) but would the addition of the lab work on my cv and experience part help? I currently have a year or so of work for two other labs and this would be adding two different labs on top of that. One of the labs is lead by the faculty advisor I plan on working under in grad school (if I get into the program) so I’m inclined to think that would help, plus the project is pretty big and I have a nice research role within it (it’s not only a research project). Should I added both new roles even though they’re (Oct - current)? Is there any negative aspects of doing so? \n\nThanks!",
  "author": "SlothTheScientist",
  "created": 1636326644,
  "updated": 1636656584,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hjqzgbu": {
      "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/hjqzgbu/",
      "text": "Yes. You can list research work currently in process. Much like you can list a job you're currently doing, or a course you're currently taking.",
      "author": "raistlin65",
      "created": 1636334110,
      "upvotes": 4,
      "replies": {
        "hjqznob": {
          "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/hjqznob/",
          "text": "Ah this is a good point, thank you!",
          "author": "SlothTheScientist",
          "created": 1636334207,
          "upvotes": 1,
          "replies": {
            "hjr0f6t": {
              "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/hjr0f6t/",
              "text": "You'll also want to bring it up in your personal statement / application letter where you talk about your research goals/direction. Use it to show how it informs what you want to do and/or as preparation for doing it.\n\nIn fact, any relevant academic or research experience that you might bring up in a personal statement should also fit in your CV somewhere as a line.",
              "author": "raistlin65",
              "created": 1636334566,
              "upvotes": 3,
              "replies": {
                "hjr0uw3": {
                  "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/hjr0uw3/",
                  "text": "That’s great advice, I’ll definitely keep it in mind while working on my personal statements!",
                  "author": "SlothTheScientist",
                  "created": 1636334772,
                  "upvotes": 1,
                  "replies": {
                    "hjr26kx": {
                      "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/hjr26kx/",
                      "text": "Yep. That's the trick with the personal statements.\n\nSome people claim a lot of things about themselves, but don't provide evidence.  You have to prove the things you want to claim using your experiences to show what you have done and what you might be able to do. Use the personal statement to create a portrait that shows more than just what scanning the CV can do.",
                      "author": "raistlin65",
                      "created": 1636335392,
                      "upvotes": 2,
                      "replies": {
                        "hjr2uon": {
                          "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/hjr2uon/",
                          "text": "Ah that’s a great point, I’ve been struggling to answer questions about academic preparation and plan. Any advice for that? Is that also something to allude to research for?",
                          "author": "SlothTheScientist",
                          "created": 1636335711,
                          "upvotes": 1,
                          "replies": {
                            "hjr3aun": {
                              "link": "/r/GradSchool/comments/qp0d5y/adding_recent_research_positions_for_grad_school/hjr3aun/",
                              "text": "Well, what is your plan? Graduate schools tend to like it when somebody has a research agenda of sorts. You're not expected to know exactly what you want to do, as in ready to jump in with a research experiment the first day. But if you have a general idea within a disciplinary area, that's your plan. \n\nAnd then how has everything you've done academically, including research experience, prepared you to do that?\n\nThe advantage of the personal statement is that you can also go beyond the minimal information that the CV provides about a specific bit of experience. You can explain more about that experience to better show how it has prepared you.",
                              "author": "raistlin65",
                              "created": 1636335921,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}