{
  "sid": "q5bphv",
  "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/",
  "title:": "How to react if my advisor brings this up again?",
  "text": "My advisor recently snapped at me over email because I asked if he or my fellow master's student could possibly check if there were colonies growing on some selective plates, so I wouldn't have to drive 30 minutes to the lab then 30 minutes back just to check them for 10 seconds (it was the only in-lab thing I needed to do that day). I explained I was very sleep deprived from doing overnight feedings for a baby squirrel that had fallen out of the nest, and didn't want to fall asleep while driving. He responded that this was an unacceptable excuse, and that I needed to have a better work ethic. (Though he has previously missed a scheduled experiment to bring a chicken to the vet, so I thought he would be more understanding). \n\nHe has been writing grants recently, so I understand he's stressed. He hasn't said anything about it in-person to me. We usually have a good working relationship. \n\nI'm worried that he's unhappy with the amount of in-lab time I'm spending, even though most of the work we can do right now is reading literature online, since the benchwork can't be rushed and isn't every day so I don't see the need to waste an hour of time + gas driving when I could use it for more productive things instead. I'm handling all of my responsibilities, and when I try to take on more or make decisions on my own he gets a bit upset since he wants to have final say.\n\nDo you have any advice for me on how to handle this?  What should I do if he says my work ethic isn't good enough, or that I need to be in the lab more even if there isn't anything to be done?",
  "author": "Caprina22",
  "created": 1633884337,
  "updated": 1634099758,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.81,
  "comments": {
    "hg4invf": {
      "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg4invf/",
      "text": "I've noticed a lot of PIs get nutty about hours when they're under pressure. Water off a ducks back... It's highly possible that they've already moved on/forgotten about it.\n\nIn the future I'd say offer far less detail as to why you're absent. Call it personal reasons, unexpected situations, whatever you want. But by giving reasons you let them judge whether or not your absence is valid. \n\nIf it does come back up, just accept that they want you there more. If it's just to do office work, then go in and do office work. Sometimes we just have to bite the bullet and accept it's their lab group and if they aren't demanding insane hours or being otherwise abusive, they get to set the rules.",
      "author": "XBBXBX",
      "created": 1633886680,
      "upvotes": 62,
      "replies": {
        "hg4mis1": {
          "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg4mis1/",
          "text": "That's great advice, thank you! I'll be less forthcoming in the future. \n\nI agree, I just work better from home most of the time, so it's a pain to think I'd need to waste time driving and then lose productivity too. Hopefully it won't come to that.",
          "author": "Caprina22",
          "created": 1633888245,
          "upvotes": 10,
          "replies": {
            "hg5yniv": {
              "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5yniv/",
              "text": "If it helps, you might want to think of it not as \"losing productivity\" but \"practicing at improving productivity at the office\". \n\nAt some point in the future you probably won't have a work-from-home option, and then it will be nicer if you don't have any noticeable productivity difference between home and office. Right now is a nice low-stakes times to practice different techniques for getting there.",
              "author": "pb-pretzels",
              "created": 1633908603,
              "upvotes": 11,
              "replies": {
                "hg5zzvw": {
                  "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5zzvw/",
                  "text": "That's a great point. I'll try harder from now on!",
                  "author": "Caprina22",
                  "created": 1633909229,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg5ezmm": {
      "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5ezmm/",
      "text": "It might help, if you haven't done so already, to have a frank conversation about expectations for time in office/lab. Some PIs like to see you there 8-5. \n\nAlso, while you may work better in your home setup, being on campus is part being collegial. You may need to figure out how to further transform your on campus space into what makes your home better.",
      "author": "hairynip",
      "created": 1633899879,
      "upvotes": 14,
      "replies": {
        "hg5xta9": {
          "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5xta9/",
          "text": "I had talked to him about his expectations when I joined the lab, because I have a chronic autoimmune disorder that can leave me very fatigued, and at the time he said that he was happy as long as the work was getting done. (Which it is). \n\nUnfortunately, what makes me better at home is lying on my bed, which helps me focus on my research reading/work and conserve energy. We don't even have a couch at the lab, although I snagged the most comfortable chair from my predecessor when he graduated.",
          "author": "Caprina22",
          "created": 1633908210,
          "upvotes": 2,
          "replies": {
            "hg68rnk": {
              "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg68rnk/",
              "text": "Get registered with your university's accessibility office, just in case. I had a bad experience with this and my one regret was not getting my disability registered.",
              "author": "catcherofthecatbutts",
              "created": 1633913580,
              "upvotes": 9,
              "replies": {
                "hg6c7au": {
                  "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg6c7au/",
                  "text": "That's a good idea. I'll call my physician on Monday! \n\nI'm sorry that happened to you.",
                  "author": "Caprina22",
                  "created": 1633915255,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hg60kox": {
              "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg60kox/",
              "text": "Well that sucks and definitely something he's just going to need to learn to accommodate.\n\nSome PIs are just dicks, some are dicks from time to time, and I hope it's just passing for him...",
              "author": "hairynip",
              "created": 1633909507,
              "upvotes": 2,
              "replies": {
                "hg6c579": {
                  "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg6c579/",
                  "text": "Thank you! I hope so too.",
                  "author": "Caprina22",
                  "created": 1633915228,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg5ilyk": {
      "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5ilyk/",
      "text": "Unless your PI is someone that is always working in the lab with their students I wouldn't ask them to do anything in the lab for me. That's what other grad students are for. (a lot of PIs will mess up your experiments anyways). My advice is to show up to lab and be seen. My PhD advisor once told me that if they didn't see people in the lab/lab office they assumed they weren't doing anything productive with lab work or computer-related lab work. I'm sure it's not an uncommon thought. When I started my postdoc we were having problems getting the chemicals I needed to start my project so I had very little lab work to do. I was still doing 40 h sitting at my desk reading, making plans, etc. I understand that you work better at home and live kind of far away, but being present and making your boss happy by showing them you want to work is very important",
      "author": "Ru-tris-bpy",
      "created": 1633901426,
      "upvotes": 15,
      "replies": {
        "hg5xcl6": {
          "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5xcl6/",
          "text": "That makes sense, thank you! I'm in the lab ranging from 20-40hrs a week, but most of it is very early in the morning before he comes in. (I get there around 6-7:00am, he gets there around 9-10:00am).",
          "author": "Caprina22",
          "created": 1633907993,
          "upvotes": 4,
          "replies": {
            "hg5xzc7": {
              "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5xzc7/",
              "text": "Is it normal for that program to only work 20 hr/week? I was a PhD student so maybe I was working a way more than most masters students but I was doing at least 50+ hr in grad school. Not saying you need to, but 20 hr/week would have never been enough for any boss I’ve worked for",
              "author": "Ru-tris-bpy",
              "created": 1633908291,
              "upvotes": 3,
              "replies": {
                "hg5y96p": {
                  "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5y96p/",
                  "text": "That's in-lab time. I'm doing a lot more than that, but that's the time I usually spend in the actual lab itself.",
                  "author": "Caprina22",
                  "created": 1633908421,
                  "upvotes": 3,
                  "replies": {}
                },
                "hg5ycku": {
                  "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5ycku/",
                  "text": "I'm doing about 30hrs a week on top of that, but it's all online and from home.",
                  "author": "Caprina22",
                  "created": 1633908464,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg8juiq": {
      "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg8juiq/",
      "text": "Are you close with the masters student in the lab? If so, I would just ask that person directly and not let the PI know. Usually people in the lab are more understanding about doing these types of small things. I used to passage other people's cells or check their flask if they weren't in lab.\nIf you're doing the work that you're supposed to be doing, I don't think your PI would notice that you didn't come in one day for 10 seconds to check on your colony.",
      "author": "steph0804",
      "created": 1633965548,
      "upvotes": 3,
      "replies": {}
    },
    "hg9ehh0": {
      "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg9ehh0/",
      "text": "It sounds to me like he is expecting you to be in lab more than you are, and him snapping at you about this may have just been things coming to a head. It's not uncommon for a PI to want you to be in the lab/office during working hours, even if you are doing mainly reading/computer work. Is your project moving along at an appropriate pace?",
      "author": "IncompletePenetrance",
      "created": 1633978254,
      "upvotes": 2,
      "replies": {}
    },
    "hg4xoxz": {
      "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg4xoxz/",
      "text": "How long has your PI been at your institution?",
      "author": "Yo_Jabba_Jabba",
      "created": 1633892836,
      "upvotes": 4,
      "replies": {
        "hg5x41h": {
          "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5x41h/",
          "text": "Almost 4 years now. I'm his second grad student at this institution.",
          "author": "Caprina22",
          "created": 1633907888,
          "upvotes": 3,
          "replies": {
            "hg5yuf7": {
              "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5yuf7/",
              "text": "I ask because I had an absolute monster of an advisor in my master’s. I had one meeting with them where they called me an idiot for 30 minutes before throwing me out of their office. (I did end up defending and passing.)\n\nI would routinely find other advisees crying in the bathroom down the hall from their office.\n\nYears later I met the advisor at a conference, and they were super happy to see me. “It’s my favorite master’s student!” They shouted, beaming. \n\nIt was like a totally different person. I was super confused. (Literally turned and looked behind me to see who their favorite student was.)\n\nLong story short, the semester they were advising me, they were also up for tenure review. \n\nI guess they did not handle the stress of putting together their package and waiting for the committee’s decision on tenure well. \n\nTook it out on us.\n\nI dunno. \n\nLong story short, there’s a lot more drama in academia/academic politics than most people think. Your advisor may not be upset with you at all. You may just be seeing the symptoms of something completely unrelated to you.\n\nGood luck!",
              "author": "Yo_Jabba_Jabba",
              "created": 1633908691,
              "upvotes": 8,
              "replies": {
                "hg5zv5a": {
                  "link": "/r/GradSchool/comments/q5bphv/how_to_react_if_my_advisor_brings_this_up_again/hg5zv5a/",
                  "text": "I'm sorry you had to go through that. \n\nI actually hope that's the case. I can deal with people being mean for no reason, but it would really hurt for it to be me not being a good enough grad student.",
                  "author": "Caprina22",
                  "created": 1633909168,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}