{
  "sid": "qty8ok",
  "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/",
  "title:": "Does it get better?",
  "text": "I started my PhD this semester and I feel constantly stressed and anxious. I feel dumb and unfit for the lab even though I love the research. Does it get better with time? Or some of you felt this way during the whole time of a PhD? I cannot imagine living like this for many years.",
  "author": "agua_morna",
  "created": 1636920598,
  "updated": 1637182715,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hkmybbm": {
      "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkmybbm/",
      "text": "Usually it does. If imposter syndrome is your major problem, it usually gets better. If there are issues with the lab management, your PI's attitude, etc. then it might not  but you might gain understanding over time.\n\nIn my experience, often what happens is after you're done with your first year, there will be some excitement for new students. You end up showing them the ropes and that is the moment where you feel like you are starting to know the ropes...and then it really improves. It can come in waves, as each new hurdle feels harder and you might feel stupid again, but then a little less stupid, and then smart, and then you find a new hurdle, but over all it gets easier.",
      "author": "SailorAntimony",
      "created": 1636924415,
      "upvotes": 8,
      "replies": {
        "hkowpb4": {
          "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkowpb4/",
          "text": "Well I guess I'll be hurting the whole time then... but I really think it'll be slightly better in a year when I don't feel so new to it. Thanks for your input!",
          "author": "agua_morna",
          "created": 1636958012,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hknavr1": {
      "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hknavr1/",
      "text": "It didn’t for me. But, I’m done now and have an R1 TT job. The percentage of days per month that I experience crippling jaw pain from clenching my teeth is steadily declining. So. There’s that.",
      "author": "NecessarilyPossiblyP",
      "created": 1636929416,
      "upvotes": 6,
      "replies": {
        "hkodvow": {
          "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkodvow/",
          "text": "It didn't for me either. Almost done with my degree, and I've been working for another university with much better support system and environment. Happy to say my body has been recovering rapidly since.",
          "author": "Kuschelbar",
          "created": 1636947121,
          "upvotes": 3,
          "replies": {
            "hkowl4t": {
              "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkowl4t/",
              "text": "Sad about that and hope you feel better and better!",
              "author": "agua_morna",
              "created": 1636957931,
              "upvotes": 2,
              "replies": {
                "hkp3qh8": {
                  "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkp3qh8/",
                  "text": "Thank you! I am feeling much better. I hope you will too, and remember that everyone has different experience. Hopefully yours will be a much better one than mine. Good luck :)",
                  "author": "Kuschelbar",
                  "created": 1636963250,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hkowj39": {
          "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkowj39/",
          "text": "Damn... I'm glad you're better now. And I feel the same physical symptoms. I've always been an anxious person but now it's the worse I've felt... I hope it'll be better after I'm done with this too. Hope you feel good everyday of your month soon!",
          "author": "agua_morna",
          "created": 1636957890,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkqdbyg": {
      "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkqdbyg/",
      "text": "I think the fact that you love the research is a good sign. For me, things haven't gotten better, but I also lost all interest in my research and academia in general so I didn't have that to keep me going. \n\nI do feel like my imposter syndrome went away, though. Something to keep in mind is that being \"smart\" isn't what leads to success in grad school--being driven, working hard, and staying organized are arguably the most important factors. \n\nAlso, when it comes to imposter syndrome, think of it this way: either you deserve to be where you're at (most likely), or you managed to con an entire department of intelligent and accomplished professors into granting you admission. Either way you're talented and going far ;). That rationalization helped me in my first year, and I haven't really experienced imposter syndrome specifically since then. For me, it is mostly just burn out and stress stemming from the fact that i don't feel like my research has any real world value. Since you note that you're still enjoying your research, I think there's definitely hope that things will get better for you. Good luck!",
      "author": "souperpun",
      "created": 1636991979,
      "upvotes": 3,
      "replies": {
        "hkr4b9f": {
          "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkr4b9f/",
          "text": "You're so right! I often feel like I somehow made a whole department see something in me that I don't have, but even if it were the case I should actually be proud haha but for real, thanks for your words, honestly what helped me go through undergrad and a master and now my PhD was solely that I like my research, which has been in the same line since I started studying. I hope you get better soon!  Finding no purpose for your work must be really tough but you're certainly strong for keep doing it.",
          "author": "agua_morna",
          "created": 1637002714,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkqqy60": {
      "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkqqy60/",
      "text": "Before I started my program, a doctorate student finishing up their dissertation told me that the first year and the last year are the worst. Now that I'm a couple months away from defending, I can say this definitely rang true for me as well. Obviously, I have no idea if you'll feel that same way but it was helpful for me to have in the back of my mind.",
      "author": "Palex9",
      "created": 1636997451,
      "upvotes": 2,
      "replies": {
        "hkr4sc6": {
          "link": "/r/GradSchool/comments/qty8ok/does_it_get_better/hkr4sc6/",
          "text": "Thanks for that! I usually see first and last year suffering the most really. If I can go past my first year and get better in the middle then the last year is a problem for future me. I appreciate your input and wish you feel good when you're done with your PhD!",
          "author": "agua_morna",
          "created": 1637002904,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}