{
  "sid": "qobqf7",
  "link": "/r/GradSchool/comments/qobqf7/lacking_vocabulary_and_conversation_skills/",
  "title:": "Lacking vocabulary and conversation skills",
  "text": "I read the other student’s post on discussions and their writing during class.  I honestly can’t tell you how dumb I feel Bc I lack basic vocabulary or sentence structure. I go to the writing center all the time just for help and they are the best. While they say my writing is good and just needs to polish the tenses up I still feel like I lack. This is my first semester after 5 years break and it’s hard. I’ve only spoken with moms and kids all day. When I was working I read from a script or spent most of my time alone. I’m not sure what I’m asking but has any of you felt this way. Like you’re behind because you don’t know how to talk? When I try to talk in class, the prof says he doesn’t understand my questions. It’s 6 at night and I don’t have the capacity to reframe them.",
  "author": "Ecstatic-chipmonk",
  "created": 1636240434,
  "updated": 1636656641,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.95,
  "comments": {
    "hjnh5u8": {
      "link": "/r/GradSchool/comments/qobqf7/lacking_vocabulary_and_conversation_skills/hjnh5u8/",
      "text": "I feel this way a lot. I've never been great at conversation. My advisor tells me he doesn't understand my questions sometimes. He'll ask me to rephrase but I'll have forgotten what i was trying to say because I'm so flustered trying to find the right words. It's frustrating because I can understand most of what people are talking about, and I get the intuition behind really difficult concepts. But if I have to describe what I'm thinking I get tongue tied so easily. It definitely makes me feel stupid.\n\n I have a feeling the solution is to read more, tho. Particularly recent work from your field, so you can keep up with the modern lingo and phrasing.",
      "author": "daisynets",
      "created": 1636272492,
      "upvotes": 6,
      "replies": {}
    }
  }
}