{
  "sid": "r5pt1m",
  "link": "/r/GradSchool/comments/r5pt1m/i_had_a_panic_attack_during_my_oral_exam/",
  "title:": "I had a panic attack during my oral exam.",
  "text": "So, I had a panic attack during my orals, forgot everything and could only think of one SINGLE word the whole time. It was rough. I have been replaying the particularly bad moments for weeks now. After some discussion, I was given a second chance.\n\nI went to my doctor, got some new meds (they….sort of help? It’s hard to tell), studied (as much as I can with my actual job), and brainstormed ways to stay grounded and present (writing down questions, etc). But I just don’t think well on my feet, I’m bad a whipping out answers to questions on the spot, and if I start to panic, focus is the first thing to go.\n\nI’m super super nervous and would appreciate any advice or just good thoughts. I’ve accepted that I might not be able to complete this PhD, but I’m worried about disappointing others and losing my job. Just wanted to vent to some people in similar situations. Thanks.",
  "author": "Cukytta",
  "created": 1638286359,
  "updated": 1638481151,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.9,
  "comments": {
    "hmoix68": {
      "link": "/r/GradSchool/comments/r5pt1m/i_had_a_panic_attack_during_my_oral_exam/hmoix68/",
      "text": "I’ve had similar issues. I used to get panic attacks every time I presented. I think the best thing to do is just keep at it. \nI would try and find something that you can present on that you won’t have a ton of questions, then practice it a ton.. practice giving your presentation until it’s basically memorized.. when you go in to present it, I’d your brain stops working you can hopefully rely on all your practice.\n\nOnce you’ve made it through some presentations it will get easier. A lot of the nervousness is brought on because you don’t think you can do it. Once you piece to yourself that you can present, you will be less nervous. Obviously when you get to questions, that will be harder, but trying to enter that portion but already spiraling will help.\n\nI would also say, see if you can do some mock orals, ideally in front of a group.. you just need up keep working until you can get your nerves under control.. lots of people have issues speaking, but as you do it, it gets easier.",
      "author": "runslow0148",
      "created": 1638290958,
      "upvotes": 14,
      "replies": {
        "hmuvhge": {
          "link": "/r/GradSchool/comments/r5pt1m/i_had_a_panic_attack_during_my_oral_exam/hmuvhge/",
          "text": "Thank you! I’m working to have “bases” so to speak, or point I can return to and restart if I get confused answering a question \n\n I’ve become more comfortable presenting to larger groups and less comfortable presenting to small groups. Hoping to get more practice to improve!",
          "author": "Cukytta",
          "created": 1638398756,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmq617m": {
      "link": "/r/GradSchool/comments/r5pt1m/i_had_a_panic_attack_during_my_oral_exam/hmq617m/",
      "text": "I swear I shaved off 5 years of my life with the amount of anxiety/panic I felt during the months leading up to my oral exam. So I feel for you. Since your anxiety is something that is being treated by a doctor, I wonder if there are any accommodations that you can get for your exam? Just because you have anxiety doesn't mean you're not smart or deserving of a PhD.",
      "author": "catcherofthecatbutts",
      "created": 1638314729,
      "upvotes": 7,
      "replies": {
        "hmuviy6": {
          "link": "/r/GradSchool/comments/r5pt1m/i_had_a_panic_attack_during_my_oral_exam/hmuviy6/",
          "text": "Thank you!",
          "author": "Cukytta",
          "created": 1638398773,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmuuf55": {
      "link": "/r/GradSchool/comments/r5pt1m/i_had_a_panic_attack_during_my_oral_exam/hmuuf55/",
      "text": "I just want to give you a virtual hug. This sucks.\nI don't know if this helps. But I do media training as part of my job. I work with researchers, and every now and then they have to appear in the media. They ALL freak out (they all have phds, btw). \nIt is not quite the same, but similar. A colleague actually told me today to follow my own advice when preparing for my own oral next week! So here it goes:\n\nWhat we do:\n- Talk about which 3 points are the absolutely most essential for them to get across. Focus on those 3 things. In media, it's because inexperienced interviewees tend to ramble or be too detailed, and suddenly the interview is over and they didn't get to the main thing and they losr control over the situation. Also, it really focuses the mind. What are the 3 things? Write that down.\n\n- Have a mock interview/ in this case: examination. Get a friend, partner, fellow student or somebody to pretend to be the examinator. If it's somebody outside your field, you could write a list of questions for them to ask. Take this roleplay seriously. \nBring your 3 points to the situation. Try to circulate around those when providing your answer. Let them give feedback on what you say that works, and what you should phrase differently. \n\n- Practice building bridges. I have no idea what your area is. But as an example, I work in education research, and typically one of the 3 points for my colleagues would be that we always need to help struggling primary school students, and another that teachers are in need of more knowledge about whatever area the research is in. If the question is, say, \"your research is about high achieving students. Isn't this a group that does well anyway, shouldn't the resources be spent on struggling students?\" An intuitive answer could be to go into defence and say \"high achieving students need help too!\" But a more clever answer is \"The average classroom is very heterogenous and students face complex challenges. Teachers express that they lack the resources and knowledge on how to best provide good instruction that meets the needs of all students. We believe that a good education system takes every student seriously, and our research will equip teachers to better adapt their instruction to meet these complex needs.\"\nOf course you sound a bit like a politician, but you land on your feet. The point is to turn the question around so you speak about what you have defined as important. \nIt sounds hard, and it requires a bit of practice, but I'd give it a try in the mock situation. \n\nAlso, like somebody said, practice your presentation until you know it in your sleep. And try not to give a crap if your voice shakes or you blush or whatever during the situation. You won't fail because you appear nervous. \n\nI don't have any knowledge about anxiety, mind you. If it's really brutal, perhaps see a therapist to get some quick help?",
      "author": "Naivemlyn",
      "created": 1638398321,
      "upvotes": 4,
      "replies": {
        "hmvbsfs": {
          "link": "/r/GradSchool/comments/r5pt1m/i_had_a_panic_attack_during_my_oral_exam/hmvbsfs/",
          "text": "Thank you!! Love this 3 points plan.",
          "author": "Cukytta",
          "created": 1638405950,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}