{
  "sid": "qzwqi0",
  "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/",
  "title:": "Constantly feel like I’m not good at anything/can’t do anything right",
  "text": "I found out I passed my second comp but the comments were just as bad and maybe even worse than my first comp. I’m just worried that I’m not cut out to write a dissertation. I have little to no confidence in my research project and now I have little to no confidence in my writing and critical thinking abilities. I don’t really know what I want out of this post but I just needed to vent somewhere where people would maybe understand.",
  "author": "Remarkable-One9166",
  "created": 1637617474,
  "updated": 1639879088,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlpuvbj": {
      "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hlpuvbj/",
      "text": "My impression is that most academics are trained to be critical and look for flaws in arguments rather than strengths, and that this affects how they give feedback. They tend to just focus on the stuff that needs improvement and more or less ignore what's good. Since you're passing you're probably doing just fine!",
      "author": "AdvanceImpressive158",
      "created": 1637633518,
      "upvotes": 3,
      "replies": {
        "hlx58z3": {
          "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hlx58z3/",
          "text": "You’re right, I need to remember this. I’m probably too sensitive for the constant scrutiny.",
          "author": "Remarkable-One9166",
          "created": 1637773102,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hloybc2": {
      "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hloybc2/",
      "text": "Fellow grad student having a bad day here. My advisor called my manuscript outline \"a mess\". One thing I don't understand is that we've been writing this outline for almost a semester and it ping-ponged with her more than a dozen times. I feel like it's half her fault at this point if it's that much of a mess. She just wants more and more details for even the smallest thing and then complains about it being too long. TBH it's not even an outline anymore, but rather a whole manuscript with sentences separated and bullet-pointed. I'm very confused at this point and am starting to think maybe I'm just a lousy researcher who has no right to be in research.",
      "author": "JetPlaneee",
      "created": 1637618641,
      "upvotes": 1,
      "replies": {
        "hlpwrn3": {
          "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hlpwrn3/",
          "text": ">TBH it's not even an outline anymore, but rather a whole manuscript with sentences separated and bullet-pointed.\n\nNo doubt. One long bullet list is really hard to read.\n\nHave you broken it into sections and subsections using headings and subheadings?",
          "author": "raistlin65",
          "created": 1637634411,
          "upvotes": 1,
          "replies": {}
        },
        "hlx5h31": {
          "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hlx5h31/",
          "text": "I’m sorry you had a bad day too. Sounds like your situation has a lot to do with a demanding supervisor though. I have friends in the department in similar situations who have supervisors who have ridiculous expectations and have really given them the runaround on mindless things. Hope it gets better for you soon.",
          "author": "Remarkable-One9166",
          "created": 1637773190,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlqlmd2": {
      "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hlqlmd2/",
      "text": "Your advisor is supposed to give you constructive criticism and it doesn't sound like they're doing that. That being said, take those comments with a grain of salt and look at them objectively. Perhaps there is another professor who can give you better feedback?",
      "author": "laurenwest008",
      "created": 1637647834,
      "upvotes": 1,
      "replies": {
        "hlx5kun": {
          "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hlx5kun/",
          "text": "I might reach out to my MA supervisor, they were always amazing and helpful with this sort of thing. It’s a good idea!",
          "author": "Remarkable-One9166",
          "created": 1637773231,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hltir7e": {
      "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hltir7e/",
      "text": "Ah, I was remembering your last post and wondering how you’re doing. You passed! That’s amazing! \n\nThe comments you got are meant to be feedback to make you a better researcher. I’m not a fan of all criticism all the time, but it’s definitely common in academia. I’m sorry if no one told you what you did well – after dealing with that myself, it’s been a personal goal of mine to always include strengths in feedback, not just weaknesses. When I managed people in a lab, I definitely noticed them respond better to that. We work hard, after all, and we deserve to know when our efforts are appreciated. I’d take this experience and use it to learn how to a stronger mentor and supervisor someday. \n\nAll that aside, you passed. Yes, you’re meant to be there! Take a moment to feel proud of yourself. You don’t have to have all the research figured out right now. You can tackle the dissertation one step at a time.",
      "author": "StringOfLights",
      "created": 1637703091,
      "upvotes": 2,
      "replies": {
        "hlx5qga": {
          "link": "/r/GradSchool/comments/qzwqi0/constantly_feel_like_im_not_good_at_anythingcant/hlx5qga/",
          "text": "Thank you so much, this comment made me tear up. This is really great motivation, thank you ❤️",
          "author": "Remarkable-One9166",
          "created": 1637773293,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}