{
  "sid": "promaj",
  "link": "/r/GradSchool/comments/promaj/accepting_offer_from_a_university/",
  "title:": "Accepting offer from a university",
  "text": "I have two offers of admission for Spring and I'm planning to accept one now. I have sent out a few emails to professors and still waiting on replies, from both unis. If I accept the offer from one university, do I have to reject the offer from another university? Or can I let it be and not give any answer till the deadline in the chance that I get a positive reply from one of their professors?",
  "author": "nepred97",
  "created": 1632116716,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hdkdrjz": {
      "link": "/r/GradSchool/comments/promaj/accepting_offer_from_a_university/hdkdrjz/",
      "text": "If you accept an offer, you should probably let folks at the other university know that you have already accepted a position elsewhere so they can give it to someone else who actually wants to be there. There may be students on a waitlist. \n\nI think it used to be pretty common advice that grad students should try to \"leverage\" their offers from different universities to try to get a better one, but I'm not sure that actually happens these days. Unless you're like, idk, Malala Yousafzai. Funding is generally what it is because there are so many applicants. Also, if you accept an offer from one university, and then later receive a better one from a different university, it can be kind of rude to say \"neverminded!\" to the first one. Why not just wait until you have heard back from the universities you applied to and see which has the most appealing offer?",
      "author": "False-Guess",
      "created": 1632123160,
      "upvotes": 3,
      "replies": {
        "hdke6xc": {
          "link": "/r/GradSchool/comments/promaj/accepting_offer_from_a_university/hdke6xc/",
          "text": "I want to start the process quick because the Visa interviews are very, very limited and I want to make sure I have enough time. Both my offers are deferred from last Fall, so I have heard back from them but it's just about the chance of getting assistantships..",
          "author": "nepred97",
          "created": 1632123541,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634067352
}