{
  "sid": "a5hxsd",
  "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/",
  "title:": "Asked for an extension on an assignment for the first time ever. It was granted immediately and the relief is palpable.",
  "text": "The first semester of grad school is as good a time as any for health problems to crop up, right?\n\nLast night I was given an emergency appointment with a neurologist for this morning and have reason to believe that even after the appointment I will have quite a lot on my mind.\n\nThankfully I only have one final left but I’m not too worried about that. I do, however, have a final paper for my mandatory research ethics course due that is worth 35% of my grade.\n\nI’m prideful to a fault so it took a lot to e-mail my professors explaining some about my appointment today and that I might not be able to finish the final page or two and polish it all off by the due date. I sent them my paper in its current form, which is six out of eight pages...\n\nAnd they went above and beyond by granting me until January 31st. I don’t even want to spend that long on it and hope to have it done by next week but it truly feels like such a weight has been lifted off of my shoulders.\n\nOne of the hardest things for me in grad school is going to be learning to ask for help so I am very proud of myself for reaching out and extremely grateful that they responded so kindly.",
  "author": "SecretAgentIceBat",
  "created": 1544619713,
  "over_18": false,
  "upvotes": 294,
  "upvote_ratio": 0.99,
  "comments": {
    "ebnxhci": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnxhci/",
      "text": "Yes, life is kind of like Reddit. When people are honest with each other and don't take things personally, others can really relate.",
      "author": "Cheetah_Saxophone",
      "created": 1544657413,
      "upvotes": 3,
      "replies": {}
    },
    "ebnvtgh": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnvtgh/",
      "text": "I'm glad you sought out help.",
      "author": "relocyn",
      "created": 1544656015,
      "upvotes": 2,
      "replies": {}
    },
    "ebnsnxs": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnsnxs/",
      "text": "Something that is hard to remember sometimes as a grad student is that all professors were once graduate students and understand that stuff happens. Granted some are still dicksicles,  but I have found that most are very understanding for stuff like this.\n\nGood Job OP",
      "author": "ThyOneWhoKnox",
      "created": 1544653485,
      "upvotes": 3,
      "replies": {}
    },
    "ebnofq7": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnofq7/",
      "text": "Graduate school is more flexible because it's about learning the material. If you want the extension, then you'll probably get the extension (unless you have a track record of just abusing it for no good reason..). ",
      "author": "First_Foundationeer",
      "created": 1544650328,
      "upvotes": 1,
      "replies": {}
    },
    "ebnllis": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnllis/",
      "text": "I have epilepsy and went through grad school. I can relate. People get extensions for lesser issues. Don't feel bad to ask when you really need it. I was always afraid to ask but when I did in my second year, things got better. I never asked for another but I wouldn't have hesitated if I thought I needed the time.",
      "author": "pandaeconomics",
      "created": 1544648287,
      "upvotes": 3,
      "replies": {
        "ebntjwg": {
          "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebntjwg/",
          "text": "[deleted]",
          "author": null,
          "created": 1544654187,
          "upvotes": 2,
          "replies": {
            "ebnwd7c": {
              "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnwd7c/",
              "text": "It seems unusual that they would dismiss the positive seizure activity. I would tell you to get another opinion but it seems that you did so good job on that front. I have a negative EEG and have epilepsy, which is why I think it's freezing to dismiss a positive one. The only time an EEG is positive for me is when I'm actually having a seizure. That's how crazy it is and how normal things can look on paper.\n\nFour things by way of advice:\n\n1. You can get a graduate degree even if you have epilepsy. Do NOT let this start you. A diagnosis doesn't discount your intelligence.\n\n2. If a doctor tries to prescribe you a benzodine like clonazepam/Klonopin, or others in that group, tell them you'd prefer that as the nuclear option. They are highly addictive and hell to come off of. It's not worth it, especially because you might need to experiment with a few drugs in the beginning. You don't want withdrawal symptoms confusing whether the next med works. Also benzos are sedatives so it sucks with school. There are a lot of options that aren't benzos though, so don't let this scare you or anything. It's avoidable but a handful of doctors have prescribed them like candy so those of us dealing with that feel the need to warn. Some good drugs that people tend to try first are Keppra, Lamictal, and Vimpat among many others. If/when you get meds, never stop taking them suddenly. Do your best to set a timer or something to remember them.\n\n3. Try your best to regulate your sleep and drink a ton of water throughout the day. Exercise too if you can. This is the best thing you can do for yourself and it can reduce your risk of seizure. I graduated top of my grad class because I was able to manage my seizures and stay healthy.\n\n4. Write down your questions so you remember what to ask when you go to the doctor. Reading answers online can help and r/epilepsy is great but it's always best to ask a doctor when you can. Take notes for anything you might forget.\n\n\nIf I think of anything else I'll add it but feel free to PM any specific questions. Good luck with monitoring. It's never fun and I can totally relate. Bring a book if they let you!",
              "author": "pandaeconomics",
              "created": 1544656475,
              "upvotes": 3,
              "replies": {
                "ebnxpb6": {
                  "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnxpb6/",
                  "text": "Thank you SO much! This was so encouraging.",
                  "author": "SecretAgentIceBat",
                  "created": 1544657599,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ebnlbdy": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnlbdy/",
      "text": "Yup, I tried to \"power through\" what I thought was a straightforward eye infection because I had a conference to attend. Called the nurse line and they told me to go to the emergency room. Not wanting to wait, I decided to go to the student health center on the following weekday. It turned into a full-blown ulcer. If untreated apparently they can cause blindness.\n\n6 weeks, $500 worth of co-pays, meds, and many types of eyedrops later, my eye is back to normal. **So yeah, moral of the story is to prioritize your health. It's cheaper in the long run, in more than one way.**",
      "author": "DocFood",
      "created": 1544648083,
      "upvotes": 7,
      "replies": {}
    },
    "ebni0p3": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebni0p3/",
      "text": "Good on you and your professors! Love this post.",
      "author": "letsrollwithit",
      "created": 1544645695,
      "upvotes": 3,
      "replies": {}
    },
    "ebnfox7": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebnfox7/",
      "text": "Man the number of people I know who had serious health issues pop up in grad school (almost all auto-immune), or serious injuries, or both... it’s a time when we’re pushing ourselves really hard, and that makes it more likely we get sick, and for whatever reason a lot of auto immunes pop up around this age. Glad you had a reassuring experience. Thankfully grad school usually means closer relationships with your professors, and are generally afforded more trust that you aren’t trying to skate by.  \n\nIt’s sounds like you have a tough appointment coming up - it’s okay to take a mental break if you need one. It’s not all about physically being unable to complete something. ",
      "author": "phdr_baker_cstxmkr",
      "created": 1544643967,
      "upvotes": 6,
      "replies": {
        "ebntrhl": {
          "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebntrhl/",
          "text": "[deleted]",
          "author": null,
          "created": 1544654355,
          "upvotes": 2,
          "replies": {
            "eboyooj": {
              "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/eboyooj/",
              "text": "Sadly they don’t put it in the brochure. \n\nBut thankfully you’re not alone, and I’m sure a lot of people here, including myself, can relate and provide reassurance and advice, ",
              "author": "phdr_baker_cstxmkr",
              "created": 1544703008,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ebn9jb4": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebn9jb4/",
      "text": "I hate turning things in late! I’m always the type to have it in on time, even if I have to stay up late or work myself to death until the final moment to complete it. However, a few weeks ago I had a ton of assignments due at once, plus a departmental presentation to all the faculty to prepare (data for which I was still collecting less than 24 hours before the presentation). I had multivariate statistics homework that was due the night before my presentation, and about two hours before the deadline I realized there was no way I could complete the homework and have my department presentation completed to my liking. I panicked a bit, but ended up biting the bullet and emailing my stats professor my situation, full of apologizes of course. I even said that I would take a grade penalty, but that I just wouldn’t have it in on time. She replied with “No problem! Turn it in tomorrow. I look forward to your presentation.” She attended my talk, took my late homework, and gave me an A. ",
      "author": "RustyRiley4",
      "created": 1544639512,
      "upvotes": 7,
      "replies": {}
    },
    "ebn4wto": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebn4wto/",
      "text": "As a TA, I was much more lenient when students came \\*in advance\\* and basically said \"I have identified this problem for this reason, this is my proposed solution (extension)\". The panic-stricken kids emailing me 5 minutes before class starts and the deadline due in class received no sympathy. It pays to ask in advance!",
      "author": "llikegiraffes",
      "created": 1544636121,
      "upvotes": 17,
      "replies": {}
    },
    "ebmzu04": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebmzu04/",
      "text": "I've found the professors to be significantly more flexible at master's level. I'm also in a different country than I was for my undergraduate, so I can't really tell how much is cultural difference.\n\nBest of luck getting your paper done!",
      "author": "lizardld",
      "created": 1544632298,
      "upvotes": 8,
      "replies": {
        "ebno7yg": {
          "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebno7yg/",
          "text": "I agree! We're all adults, life happens, they don't have to be like a school teacher with little kids",
          "author": null,
          "created": 1544650172,
          "upvotes": 3,
          "replies": {
            "ebq6dyd": {
              "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebq6dyd/",
              "text": "Exactly! I asked for an extension for a paper last semester, and the prof just said he thought the writing was more important than the deadline and allowed me an extra five days. No hassle at all",
              "author": "lizardld",
              "created": 1544738482,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ebmye2h": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebmye2h/",
      "text": "As much as we complain here, professors can be nice and understanding! I’ve basically told two professors I have test anxiety and both had a wonderfully kind response.",
      "author": null,
      "created": 1544631184,
      "upvotes": 12,
      "replies": {
        "ebngzwl": {
          "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebngzwl/",
          "text": "How'd you explain it to them if you don't mind me asking? I have the same problem but don't feel like profs would understand if I tried to explain it to them!",
          "author": "Starlight-x",
          "created": 1544644931,
          "upvotes": 3,
          "replies": {
            "ebno33o": {
              "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebno33o/",
              "text": "I never used the words \"test anxiety\" but I got the idea across. In both cases it was after I had done very poorly on a midterm exam. I went to them after the exam to talk about how to study etc, and that was helpful, but that's not the exact problem is it? I told them that I know the material but it doesn't come out well on tests, and that during undergrad I had decided not to go to grad school just because I did so horribly on exams. But then I realized that wanting to learn something, and actually learning it, was worth more than the awfulness that is anything testing related. Both basically ended up saying they wished they didn't have to give tests, and that in the real world if you're an economist and can't figure out an econ problem you'd just ask your colleague down the hall.\n\nI guess I emphasized that I was trying and I was actually learning. I don't remember my exact words, but I did say things along the lines of \"tend to freeze up during tests\" and \"can't reproduce all the knowledge I have in a testing environment\". I do think profs in general realize that tests aren't real world environments, and that you can certainly be good at a subject but not do well on an exam.",
              "author": null,
              "created": 1544650076,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "ebmyanj": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebmyanj/",
      "text": "Most profs would grant an extension for health emergencies. Showing that you did in fact have 75% of the paper done shows a lot of initiative and good work ethic. When I had to ask for an extension on a final paper last year (had to go home and help my parents with funeral arrangements), I hadn’t even started my paper. I just sat down the day after the funeral and slammed it out.\n\nBest of luck regarding your appointment and finals. ",
      "author": "dinosaur_apocalypse",
      "created": 1544631109,
      "upvotes": 61,
      "replies": {
        "ebo2oo6": {
          "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebo2oo6/",
          "text": "For grad students reading this, I want to emphasize that if you are having any kind of health issues (physical, mental, family, whatever!), please please please COMMUNICATE with your advisor(s). \n\nIn my experience, you don't have to give details, you don't need to give reasons and specific excuses are totally unnecessary. However, faculty can't read your mind and won't know to help you if they think you are doing hunky dory. We're going through an issue with a student right now who was too embarrassed or scared to tell us about personal issues, and we would have absolutely respected both her privacy and her need to postpone work. Instead it's turned into a huge to-do, further compounding her personal stuff. :/ WE WANT YOU TO BE HEALTHY AND SUCCEED, WE DON'T CARE ABOUT TIMELINES.",
          "author": "wookiewookiewhat",
          "created": 1544661991,
          "upvotes": 15,
          "replies": {
            "ebo3hxv": {
              "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebo3hxv/",
              "text": "Great point. Thanks for emphasizing that. \n\nToward the end of every semester, our grad coordinator sends out an email that emphasizes the need for students to put their health first. She provides resources and information and encourages students in the email too. ",
              "author": "dinosaur_apocalypse",
              "created": 1544662750,
              "upvotes": 2,
              "replies": {
                "ebo5gjv": {
                  "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebo5gjv/",
                  "text": "That's awesome, not every advisor is that good about things. ",
                  "author": "wookiewookiewhat",
                  "created": 1544664538,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ebmxy73": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebmxy73/",
      "text": "Grad school runs on extensions.\n\nI know someone on her 3rd year PhD; has had an extension for a year on a paper, and she still asked for an extra extension.",
      "author": "M4p3x",
      "created": 1544630837,
      "upvotes": 37,
      "replies": {
        "ebo1z8d": {
          "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebo1z8d/",
          "text": ">Grad school runs on extensions.\n\nAin't that the truth. There's a student in my cohort who has basically taken an incomplete in every class so far because of the final assignment - and then does them all over the summer when there's no classes, clearing the slate for the next year. I can't decide if I think it's ludicrous or kind of evil genius.\n\nFWIW, the professors/admin couldn't care less.",
          "author": "Zoethor2",
          "created": 1544661354,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "ebmq7fc": {
      "link": "/r/GradSchool/comments/a5hxsd/asked_for_an_extension_on_an_assignment_for_the/ebmq7fc/",
      "text": "Good on you for letting yourself do that! \n\nI had to do that too this semester, and was it ever hard, but necessary and worth it. Good luck to you! ",
      "author": "kissbythebrooke",
      "created": 1544624302,
      "upvotes": 25,
      "replies": {}
    }
  },
  "updated": 1634066266
}