{
  "sid": "r6oqsj",
  "link": "/r/GradSchool/comments/r6oqsj/to_the_international_grad_students_what_are_your/",
  "title:": "To the international grad students: what are your plans for the winter break?",
  "text": "Are you planning on visiting your home country? I’m asking because I’ve been planning on going o home for a while given that I haven’t seen my family for years. In the light of the new variant, I’m terrified that the travel bans will resume leaving me stranded and causing harm to my visa status. (Not to mention actually contracting and spreading the virus despite being vaccinated)\n\nIt’s too early to tell, but I’m due to travel next week and I have to make a decision fairly soon. I’m leaning towards staying though. \n\nI’m hoping to get your perspectives on this!",
  "author": "Booklover23rules",
  "created": 1638391620,
  "updated": 1638481121,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hmv9fg4": {
      "link": "/r/GradSchool/comments/r6oqsj/to_the_international_grad_students_what_are_your/hmv9fg4/",
      "text": "I managed to get a RA position with no teaching duties, made arrangements with the professor supporting me with his grant and with my advisor, and went to visit family in the beginning of November.\n\nI'm currently in a battle with the consulate to get my visa renewed (I'm eligible for an emergency appointment), and I'm planning to return to my program on the first week of January.\n\nThere were no new variants when I came home. I have no idea of what will happen next, but every time I got too pessimistic, nothing of the worst I thought could happen ever happened. So I will not stress over it, keep my travel plans back, and whatever happens, happens. I'm just too tired to care.",
      "author": "its_t94",
      "created": 1638404912,
      "upvotes": 3,
      "replies": {}
    },
    "hmvm20g": {
      "link": "/r/GradSchool/comments/r6oqsj/to_the_international_grad_students_what_are_your/hmvm20g/",
      "text": "I'm in Aus and have flights booked to go back to Canada on the 9th. Stressed because for the first time since covid started they were supposed to open the borders on Dec 1 to allow international students to enter the country, but they just pushed that back to the 15th. Obviously the 15 is another deadline they may decide to extend if the situation warrants it. So I'm worried if I go home I'll not be able to get back in to continue my PhD. Not sure what to do yet",
      "author": "Hypsochromic",
      "created": 1638410412,
      "upvotes": 2,
      "replies": {}
    },
    "hmvfut5": {
      "link": "/r/GradSchool/comments/r6oqsj/to_the_international_grad_students_what_are_your/hmvfut5/",
      "text": "I'm European but doing my PhD in the US and yes, I'm going home for winter break. Iv'e been going back to Europe twice per year since covid started and it has been fine so far, so I'm not overly worried.",
      "author": "AdvanceImpressive158",
      "created": 1638407724,
      "upvotes": 2,
      "replies": {}
    },
    "hmut8an": {
      "link": "/r/GradSchool/comments/r6oqsj/to_the_international_grad_students_what_are_your/hmut8an/",
      "text": "I decided not to go back home for the holidays. I feel kind of weird because I haven't been back since the start of the pandemic and I had already started making plans for going back for the Winter break before Omicron was announced. I guess the upside of not visiting home for almost two years is that I have the experience of the previous Christmas too and I know that I can have a good time in my current country as well. Plus I wouldn't feel safe travelling right now in any case!",
      "author": "phan801",
      "created": 1638397837,
      "upvotes": 1,
      "replies": {}
    }
  }
}