{
  "sid": "rbempd",
  "link": "/r/GradSchool/comments/rbempd/got_accepted_into_the_first_program_i_applied_for/",
  "title:": "Got accepted into the first program I applied for, having doubts if it's still a good fit.",
  "text": "To elaborate on myself I'm pursuing a master's degree in economics with a goal of going into macroeconomic research as a career field (Think national intelligence/ banking or investments). I applied to this program due to its location and how it reflects my interests. The program is in Taiwan at NCCU. Since applying I spoke to a few people at the university who informed me that the program itself isn't quite up to the quality that the website advertises. My other concern is the fact that because this is in Taiwan the program is not well known and I'm concerned as to how that would affect my ability to find jobs and internships (That and I'm not sure how getting a grad degree in a country my own nation doesn't recognize would create a lot of grey area). There are still some clear benefits to the program (Regional exposure, and the ability to throw myself into a mandarin intensive environment), but I'm concerned about the overall return on investment.\n\nI'd appreciate any insight you might have.",
  "author": "Railwayman16",
  "created": 1638925766,
  "updated": 1639518597,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hnnzlvu": {
      "link": "/r/GradSchool/comments/rbempd/got_accepted_into_the_first_program_i_applied_for/hnnzlvu/",
      "text": "If people in the university are warning you against it, that’s a big red flag and it’s a good sign you should consider other universities/programmes. Wait till you hear back from your other applications before you make a decision.",
      "author": "lightschangecolour",
      "created": 1638927404,
      "upvotes": 1,
      "replies": {
        "hnog69m": {
          "link": "/r/GradSchool/comments/rbempd/got_accepted_into_the_first_program_i_applied_for/hnog69m/",
          "text": "Good points. I've been looking at other programs both in America and abroad for a little while now.",
          "author": "Railwayman16",
          "created": 1638935900,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}