{
  "sid": "pinfdh",
  "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/",
  "title:": "Appreciative undergraduate student wanting to give thanks to all the teaching assistants and lab instructors!",
  "text": "From the bottom of my heart, I want to thank all you wonderful people!\n\nAs much as professors are great and lovely, you all CARRY the class. I have no idea where I'd be without the mentorship, education, and motivation. I really look up to you and am always so curious to hear about your research and passions.\n\nEspecially with over a year of Zoom seminars and labs, I needed some extra support. You guys were there for me when I wasn't understanding concepts, having difficulties with lab reports, and looking for advice in general. You made me feel appreciated and more confident in my abilities. You were all approachable and challenged me in the best ways possible.\n\nMany of you were on tight deadlines, struggling with completing important research due to COVID, working two jobs, and dealing with health issues. That didn't stop anyone from always showing up, making students laugh, and putting aside hours of your time to help us.\n\nYou guys rock!",
  "author": "tellmeguru",
  "created": 1630883197,
  "over_18": false,
  "upvotes": 202,
  "upvote_ratio": 0.96,
  "comments": {
    "hbs5j95": {
      "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbs5j95/",
      "text": "I've been lab manager for my research lab for a while now, recently started as a GSGA, and this made me happy. We love (any) feedback from our students. Thank you OP ❤",
      "author": "killakidz7",
      "created": 1630910602,
      "upvotes": 2,
      "replies": {}
    },
    "hbrpus7": {
      "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbrpus7/",
      "text": "I'm certain they'd love to hear it directly from you. TAs work hard 👍",
      "author": "West-Expert7591",
      "created": 1630900435,
      "upvotes": 2,
      "replies": {
        "hbru2iq": {
          "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbru2iq/",
          "text": "Oh ya I'm that student in class who always asks questions and comes to the extra help sessions even when nobody shows up. I love to see the reaction when I mention how enjoyable their lessons were.",
          "author": "tellmeguru",
          "created": 1630902881,
          "upvotes": 2,
          "replies": {
            "hbt8i1r": {
              "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbt8i1r/",
              "text": "That’s awesome! People put so much work into their lesson material, and the appreciation is nice!",
              "author": "show_me_your_graphs",
              "created": 1630938541,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hbrirsq": {
      "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbrirsq/",
      "text": "Awww, we love u too :)",
      "author": "ionic_gold",
      "created": 1630896728,
      "upvotes": 2,
      "replies": {
        "hbrubdz": {
          "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbrubdz/",
          "text": "I would literally listen to my TAs read their whole thesis/dissertation out loud. You all are the future of research and education and I'm glad!",
          "author": "tellmeguru",
          "created": 1630903029,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hbrebmo": {
      "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbrebmo/",
      "text": "Awww!  Seconding the comment that the positive feedback and appreciation from our students means A LOT!  I started as a TA last fall and it was SO MUCH to deal with, but the kind words from my students always made my day!  One of my students told me at the end of one of the semesters that they'd miss me and my memes and it warmed the cockles of my little grad student heart.",
      "author": "LadyWolfshadow",
      "created": 1630894469,
      "upvotes": 7,
      "replies": {
        "hbrtud3": {
          "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbrtud3/",
          "text": "Aw that is cute! All my TAs made my day. I miss seeing everyone's pets over Zoom, having wild seminar conversations, and all the dumb inside jokes our classes made by the end of the semester. \n\nI am 100% honest with the praise, and to tell you the truth, I often like you grad students much more than my fellow undergrads haha!",
          "author": "tellmeguru",
          "created": 1630902745,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hbr968e": {
      "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbr968e/",
      "text": "Was fortunate my TA was well before COVID. Regardless, just want to say positive feedback/appreciation from students means a lot.",
      "author": "HappyHrHero",
      "created": 1630891928,
      "upvotes": 11,
      "replies": {
        "hbrt38z": {
          "link": "/r/GradSchool/comments/pinfdh/appreciative_undergraduate_student_wanting_to/hbrt38z/",
          "text": "TAs definitely don't get enough recognition and appreciation which I hope to change :) You all deserve the positive feedback so much!",
          "author": "tellmeguru",
          "created": 1630902291,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634065600
}