{
  "sid": "qlxgu4",
  "link": "/r/GradSchool/comments/qlxgu4/are_collegesgrad_schools_required_to_share_their/",
  "title:": "Are colleges/grad schools required to share their acceptance rates?",
  "text": "Weird question, I know. I'm curious about my grad program's acceptance rate and can't find data anywhere. I've emailed someone in the administration twice but she seems to be ignoring my question, so what was a genuine curiosity is turning into something... concerning?",
  "author": "npw7321",
  "created": 1635954887,
  "updated": 1636138151,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj5uscr": {
      "link": "/r/GradSchool/comments/qlxgu4/are_collegesgrad_schools_required_to_share_their/hj5uscr/",
      "text": "No. Check grad cafe.",
      "author": "Vassukhanni",
      "created": 1635955039,
      "upvotes": 2,
      "replies": {}
    },
    "hj5uq0r": {
      "link": "/r/GradSchool/comments/qlxgu4/are_collegesgrad_schools_required_to_share_their/hj5uq0r/",
      "text": "I think I read somewhere that grad schools don't need to publish statistics. When I was applying, I was running into the same issue as you. I was just able to find one or two news articles that published rankings between similar programs. I'm in grad school now and still don't know anything like how many people applied!",
      "author": "Chiss_Navigator",
      "created": 1635955015,
      "upvotes": 1,
      "replies": {}
    },
    "hj6mtc3": {
      "link": "/r/GradSchool/comments/qlxgu4/are_collegesgrad_schools_required_to_share_their/hj6mtc3/",
      "text": "I know for my program its incredibly different every year so publishing those stats wouldn't be very useful. Some cohorts they admit 20 and some years 5. The thing is, not everyone accepts their offer, so if the department had a large cohort acceptance one year, they typically will only admit a small number the next year to ensure there will be enough TA positions to fund everyone (and vice versa, if less than expected accept offers, the next years cohort will be large so they have enough TAs for courses). \n\nAlso, because everyone is applying to work with a specific advisor, some advisors are not admitting students that year whereas others are on top of the list to admit students or might be allowed to admit one if there is enough space/an amazing candidate. So even knowing the overall acceptance rate if it could be figured out wouldn't be useful unless you knew which professors were looking for students and how many people specifically apply for them (some professors are more well known and get more applicants than others).",
      "author": "archaeob",
      "created": 1635965631,
      "upvotes": 1,
      "replies": {}
    }
  }
}