{
  "sid": "rg0yro",
  "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/",
  "title:": "My advisor doesn't get it",
  "text": "At first i thought i needed to work on my communication, but after nearly two years of beating myself up it is now clear to me that I am not the problem.\n\n I am an exceptionally productive student and my advisor doesn't understand the massive amount of work I'm churning out. They don't know the literature and they don't care to understand my work, even going as far as trying to dumb it down so I stay in their lane.\n\nI am fed up and afraid for my academic future. I had no choice in this advisor and I feel I still have no option to switch. They have the money and data. What do I do?",
  "author": "EuphoricBarracuda",
  "created": 1639462357,
  "updated": 1639518433,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.95,
  "comments": {
    "hoig8iz": {
      "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoig8iz/",
      "text": "I can 100% understand your frustration. My PI once asked me for the estimated number of hours I had worked on my grant after 2 years (for reporting purposes). I told him and he tried to tell me I was wrong and it was probably half that or less. He only believed me once he looked at the paid hours my intern had logged and realized he was trying to tell me I worked less hours on my research than she had. \n\nIf you're already at a point where you're invested in your work and can't switch advisors all I can say is keep on going. You know the effort your putting in and it will pay off. See if any of your committee members can help provide better feedback.",
      "author": "blueburrytreat",
      "created": 1639490962,
      "upvotes": 5,
      "replies": {
        "hoigyxt": {
          "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoigyxt/",
          "text": "Thank you, yes, that was my first instinct, to go to other committee members. At first that worked well but then my advisor started getting bitter and told me to stop working with them. Most likely so that they could enjoy the credit of a 2-author journal paper. But I got them to agree to me collaborating with others more often.",
          "author": "EuphoricBarracuda",
          "created": 1639491306,
          "upvotes": 2,
          "replies": {
            "hoihup0": {
              "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoihup0/",
              "text": "Do we have the same PI? Haha. \n\nMy PI also got really weird about having me go to committee members for help. I'm glad you got them to agree to let you collaborate more often. \n\nI dumbly listened to my PI and it ended up coming back around when I got called out by committee member for not knowing my statistics well enough and not coming to them sooner for help.",
              "author": "blueburrytreat",
              "created": 1639491777,
              "upvotes": 3,
              "replies": {
                "hoiw3dc": {
                  "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoiw3dc/",
                  "text": "Do you regret not switching? I'm still early in my program. I could switch, but it would have to be right now and I believe it would lengthen my stay.\n\nI'm worried about making enemies. I am wondering if it might be better to keep everyone happy to increase my chances of getting the perfect postdoc position I deserve.",
                  "author": "EuphoricBarracuda",
                  "created": 1639497934,
                  "upvotes": 1,
                  "replies": {
                    "hoj3k80": {
                      "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoj3k80/",
                      "text": "Sometimes yes. My PI can be incredibly toxic. There are a number of absolutely horrible things he's done over the years that some of my stories sound fake. My mental health spiraled out of control at one point as a result and I had to start going to counseling to get back on track. \n\nOn the flip side, I've learned so much about my feild, got to work on a really cool research project, and made a lot of professional connections. That I don't regret. I've also learned how to better deal with difficult and/ or toxic people in a workplace setting. \n\nI'd say if you're early in your program, and have someone else in mind as an advisor, you may really want to consider switching. Having a cruddy PI can make the experience miserable. It won't all be bad but it can add a lot of extra unnecessary stress to something that is already challenging. I don't see you making an enemy out of your PI by switching but if it's something your concerned about maybe you should discuss this with a trusted faculty or committee member. Bring up your concerns and see what they advise and if they can help. \n\nP.S. My reason for staying was entirely project and funding based. I really liked my research project and there wasn't an option to leave and still continue the project since the grant was under my PI.",
                      "author": "blueburrytreat",
                      "created": 1639500856,
                      "upvotes": 1,
                      "replies": {
                        "hojkean": {
                          "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hojkean/",
                          "text": "Damn are you me? I'm in the exact same boat. But I want to emphasize that I don't think my PI is toxic per se. I really like the project I am on and I am funded for the duration of my PhD doing almost exactly what I want to do. \n\nFor this reason I worry that I'm being a spoiled brat. I'm getting to do 80% of what I want to do exactly, but with little guidance and hard pressure to produce results extremely quickly. This has resulted in a lot of publications but I don't necessarily believe they are my full quality potential. \n\nFurthermore, there are frustrating hard constraints being placed by my PI on the other 20% of my interests that are newly developing and really excite me. While I am allowed to pursue them somewhat, I will not receive any support for them. Worse,  I am afraid that developing those interests could be even more important than my other interests for making an interdisciplinary name for myself in academia, and complacently neglecting them could cause me to not live up to my full potential. Especially if I had proper guidance on them. But maybe I could get that guidance in a postdoc? \n\nAlso my advisor and I disagree on a lot of ethical things like open source and open access. They won't budge. I feel like their employee more than anything.\n\nI have another advisor in mind who shares those 20% interests, but doesn't have the same kind of funding and resources for my other 80% wheelhouse interests. \n\nI really don't know what to do. It's an awful feeling.",
                          "author": "EuphoricBarracuda",
                          "created": 1639507407,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hohzkj2": {
      "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hohzkj2/",
      "text": "If you can't ditch the advisor and are trying to stay in academia, then you'll have to adapt to the advisor or try to work more independently. How and whether you can depends on the details of your research.",
      "author": "justneurostuff",
      "created": 1639481306,
      "upvotes": 3,
      "replies": {}
    },
    "hohyue2": {
      "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hohyue2/",
      "text": "I am not sure about the details, but it is very important to have an advisor that engages with and respects you. If they do not, then, you are in for just another 3 or 4 years of being underpaid, overworked, self doubt, and without work that you can speak well of. So what confidence will you have left when you go into the job market? If your advisor does not respect you, will they write you a good recommendation?",
      "author": "Riko_7456",
      "created": 1639480760,
      "upvotes": 5,
      "replies": {
        "hoih688": {
          "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoih688/",
          "text": "I don't want to give too many details but, in summary, I am probably the most productive student my advisor has ever had. I respect him immensely for bringing this skill out of me, but I have outgrown my dependence on him very quickly and he isn't happy about it. Furthermore, the technical complexity of the feedback I need has grown quickly, and he isn't willing or able to provide it, and he gets bitter when I try to get it elsewhere. He wants to keep me in his nest and slow down my growth.",
          "author": "EuphoricBarracuda",
          "created": 1639491400,
          "upvotes": 2,
          "replies": {
            "hoilm8w": {
              "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoilm8w/",
              "text": "Right. It sounds like you should switch. I had the same problem with one of my advisors.",
              "author": "Riko_7456",
              "created": 1639493588,
              "upvotes": 1,
              "replies": {
                "hoiuz6i": {
                  "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hoiuz6i/",
                  "text": "I feel that he does respect me. I'm worried that I'm just having greener grass syndrome. Maybe we're just butting heads? They are overall a kind and reasonable person. They have given me access to good resources and opportunities that I've never had before. But I've discovered new interests in grad school that they do not support. I feel like I'm being stifled. I hate how I feel like I have had no choice or freedom in this matter. I feel like a prisoner.\n\nI'm especially concerned that, if I want to remain in academia, it may be better to play along and have them on my side, and just seek independent work with other people as much as I can and try again in a postdoc.",
                  "author": "EuphoricBarracuda",
                  "created": 1639497492,
                  "upvotes": 2,
                  "replies": {
                    "hok65ql": {
                      "link": "/r/GradSchool/comments/rg0yro/my_advisor_doesnt_get_it/hok65ql/",
                      "text": "If it is not too much of a problem, maybe you should stick to this guy, get your PhD done quickly and try to put together a publication record while in Grad School. Then, you could launch to other projects where you can feel less stifled.",
                      "author": "Riko_7456",
                      "created": 1639515993,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}