{
  "sid": "qomizk",
  "link": "/r/GradSchool/comments/qomizk/grad_school_interviews_what_do_they_ask_you/",
  "title:": "Grad school interviews: what do they ask you? (Engineering) MS/PhD",
  "text": "If there are other PhD candidates out there would could help, would be amazing! \nThankyou!",
  "author": "Lost-Ad6608",
  "created": 1636283872,
  "updated": 1636656594,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.82,
  "comments": {
    "hjo5eoi": {
      "link": "/r/GradSchool/comments/qomizk/grad_school_interviews_what_do_they_ask_you/hjo5eoi/",
      "text": "It's just as much about the questions you ask and by \"they\" who do you mean? Advisers? Lab mates? Administrative assistants? Like any other interview they are trying to get a feel for you and how you will fit in to the department. Why you are here, what you are planning, how do you work, are you an asshole? Can they like you or get along with you for 5 years? Remember you are temporary really they are not. (They meaning support staff and advisers....other grad students will just screw you if you don't pull your own weight.....)",
      "author": "rthomas10",
      "created": 1636291514,
      "upvotes": 2,
      "replies": {}
    },
    "hjoaidp": {
      "link": "/r/GradSchool/comments/qomizk/grad_school_interviews_what_do_they_ask_you/hjoaidp/",
      "text": "Here was my tactic: we got our list of interviewers *the night before*; I did a bit of rushed research on the people on my list (8 total), made a few notes, and went in the next day and *I* interviewed *them*!  None of them seemed to mind, although they were a bit taken aback. But it turned into good discussion about the work, took some of the pressure off of them, and hey - I got in! To a program that only admits 4 people out of 90 interviewees per year! So apparently it worked for me.\n\nThis was for a biomedical PhD, and the interviews were all one-on-one; I can't vouch for its effectiveness in other disciplines/scenarios.",
      "author": "Ok_Tangerine_8261",
      "created": 1636294106,
      "upvotes": 3,
      "replies": {}
    }
  }
}