{
  "sid": "q34ny1",
  "link": "/r/GradSchool/comments/q34ny1/i_have_regressed_and_lost_all_my_confidence/",
  "title:": "I have regressed and lost all my confidence",
  "text": "So I am in my 2 year of grad school and my writing regressed throughout the program. I had writing problems coming into the program but I learned to write an decent looking paper. But last semester somthing happened and my writing skill has regressed back to my undergrad days (probably even worse). I tried everything I can but nothing seems to work. I feel like I peaked and now I'm just spiraling all the way down. The program has a lot of group projects,so I feel so guilty letting my group mates down  with my incompetent writing.",
  "author": "alaraidk",
  "created": 1633595679,
  "updated": 1634099854,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hfpxu74": {
      "link": "/r/GradSchool/comments/q34ny1/i_have_regressed_and_lost_all_my_confidence/hfpxu74/",
      "text": "First of all,  do other people think your writing gotten worse? It may be that you are getting better at recognizing \"good\" writing as you work longer in an academic setting.  As a result,  your writing looks worse. \n\nSecond,  if my writing sucks it is usually because I am rushing.  Can you try and slow down and focus on the techniques you learned to be a good writer? Thinks like looking at individual sentence structure and outlines before you write can be helpful.  \n\nLastly, if you've lost the real basics (e.g. spelling of simple words) you might consider seeing a doctor.  There might be issues with your sight or something else that is making it hard for your to write.",
      "author": "grounded_out",
      "created": 1633609217,
      "upvotes": 7,
      "replies": {}
    },
    "hfqv0wa": {
      "link": "/r/GradSchool/comments/q34ny1/i_have_regressed_and_lost_all_my_confidence/hfqv0wa/",
      "text": "I'm not sure if we suffer from the same thing lol but Im also going through a similar experience. I've never been a strong writer but writing is very very very subjective. To some your writing can be really good and to others it can be horrible and I'm not talking about grammar but the way you formulate ideas and tell a story. As a master student my supervisor would help me correct my writing and he would pretty much rewrite the whole thing. For me it was good in the sense that he was making my work better, but my confidence in my writing went down the drain because of how much the writing would change. My confidence kept on spiraling down the more i would get bad critics from my writing. I was always ver defensive about it and took it very personally. Now I'm doing my PhD and it's gotten so bad that it's been a year since I had to submit my proposal. I had to seek help through a counselor to over come with nonsense and for now the best thing that's helping me is to spend 30 minutes just freestyle writing. In those 30 minutes write as much as you can remember from the topic you are focusing on. Dont spell check don't rewrite is as you go. Just write for 30 minutes straight. This will get you the writing mood. Now the next step would be to continue writing a first draft and again don't pay attention to grammar or sentence structure. So finish the assignment. Don't show anyone this draft. The next step will be to take a break from it for a day or two and reread what you wrote. The first time around fix any silly mistakes. The next time around focus on the story you are telling and if it makes sense to you. Continue doing this until you think it's good. I am still practicing this method. It's hard to just finish something without looking back but at least you have something finished. I hope this helps!",
      "author": "ammrlc",
      "created": 1633624305,
      "upvotes": 1,
      "replies": {}
    }
  }
}