{
  "sid": "qko57y",
  "link": "/r/GradSchool/comments/qko57y/im_applying_to_multiple_psyd_programs_my/",
  "title:": "I’m applying to multiple PsyD programs, my professor wrote letters of recommendation for my first three applications but then got busy and now they don’t respond to my follow up emails regarding the last letter request sent to them from Psycas.",
  "text": "I’m really stressed out and I know they don’t owe me anything, but I just feel helpless and I hate that feeling. I’ve done everything I could from my end to fill out those applications, and I’m really passionate about psychology and want to pursue grad school and now i’m in a major risk of having 4 out of 7 program applications being deemed as incomplete because of something that’s completely out of my hand…",
  "author": "DrNobodyy",
  "created": 1635801674,
  "updated": 1635891391,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hixr3qu": {
      "link": "/r/GradSchool/comments/qko57y/im_applying_to_multiple_psyd_programs_my/hixr3qu/",
      "text": "When are the rest of the apps due? I’d just send a reminder email or text. I had to do a very quick one the day of to one of the recommenders and it all turned out fine",
      "author": "tinyflowersongs",
      "created": 1635804097,
      "upvotes": 1,
      "replies": {
        "hixusdx": {
          "link": "/r/GradSchool/comments/qko57y/im_applying_to_multiple_psyd_programs_my/hixusdx/",
          "text": "The rest of the apps are due on December 1st, I’ve started sending follow up emails since mid October, professor didn’t respond to my emails, proceeded with sending a text, same thing, proceeded with sending an email to her office to let her know my situation, the office told me they’d let her know and it’s been three days and I got no response. All I want to know is why? Just at least tell me you’re busy, communicate, anything…",
          "author": "DrNobodyy",
          "created": 1635805695,
          "upvotes": 1,
          "replies": {
            "hiz34mr": {
              "link": "/r/GradSchool/comments/qko57y/im_applying_to_multiple_psyd_programs_my/hiz34mr/",
              "text": "Honestly, from my experience with professors, if the deadline is December 1 then it’s currently super early for them to do anything. Most of mine submitted references the week-of (honestly more like the day become) the deadline. It sounds like you might be acting a little overbearing with your professor, which only serves to put them off.\n\nI understand your eagerness to apply, but you need to allow space for this very busy person who is doing you a favor. If your applications were due tomorrow then I’d understand your rush, but you have a whole month. Give them time before you check in again.",
              "author": "Jwalla83",
              "created": 1635826556,
              "upvotes": 2,
              "replies": {}
            },
            "hiybh38": {
              "link": "/r/GradSchool/comments/qko57y/im_applying_to_multiple_psyd_programs_my/hiybh38/",
              "text": "With a December 1st deadline you should be absolutely fine. Most of mine didn’t do it until the week of. She probably is busy and that’s why she didn’t finish/email you back.",
              "author": "tinyflowersongs",
              "created": 1635813072,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}