{
  "sid": "pq4s82",
  "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/",
  "title:": "Should I inform my professors/advisor",
  "text": "I went to the doctor recently and was diagnosed with severely low vitamin B-12. Low to the point where she wanted me to drop everything and come in the office that moment to get an injection, come in weekly for the unforeseeable future, etc. She has no idea how I've been functioning the way I have until now and haven't been making a bigger deal about it. \n\nI've had some memory issues, but I mostly attribute that to some headaches I've had over the past year and years worth of concussions. But after getting this diagnosis. Things are starting to make sense some. In classes, I mostly stay quiet due to anxiety and due to the fact I can never remember anything that happens in the books and my brain screwing up my points/words before I have a chance to say anything. Do I need to tell my professors and advisors what is going on? My only hesitation is because of my headache thing from last year, it was a big deal and I feel bad about having to make yet another excuse for myself. \n\nNo one in my department would make a major thing out of it or belittle me for it so I'm not worried about that in the least bit, I just don't know if it is something I need to bring up. Most of them already know about the anxiety + headaches as a reason for me staying mostly quiet I just don't know if I should add another \"oh by the way my blood is defective\" even though it is probably the root of most of the other problems.\n\nUPDATE: For those curious I emailed my advisor and she was way more than understanding and offered to do whatever she could including driving me to appointments if needed",
  "author": "CommonKilljoy",
  "created": 1631900102,
  "over_18": false,
  "upvotes": 209,
  "upvote_ratio": 0.96,
  "comments": {
    "hdaul9q": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hdaul9q/",
      "text": "Whoa I need to make an appointment. I've been vegan my whole life so I know this is a possibility but that really sounds like a lot of the stuff I have problems with :o",
      "author": "magnus_pyke",
      "created": 1631944394,
      "upvotes": 1,
      "replies": {}
    },
    "hdaqcqa": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hdaqcqa/",
      "text": "Hey OP, glad to hear that you are getting the accommodations for this medical concern! I worked as a teaching assistant for a while and it's very helpful for profs/TAs to know if there is something going on so they can understand the situation and provide you with any support you need. At the end of the day, profs and TAs want to see you to succeed in your classes :)",
      "author": "lindaedith",
      "created": 1631941415,
      "upvotes": 2,
      "replies": {}
    },
    "hdafdna": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hdafdna/",
      "text": "This is actually kinda serious, I also had a curtain B12 deficiency and would just randomly bleed from my lips. It's not pretty. Once you start on the shots you're gonna feel so much better. It's gonna feel hyper at first? I think my case wasn't as bad as yours, but it's pretty vital to proper functioning. Please get treatment. Your body will thank you",
      "author": "DreamWithinAMatrix",
      "created": 1631934731,
      "upvotes": 1,
      "replies": {
        "hdauzt2": {
          "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hdauzt2/",
          "text": "Thankfully I’ve never just randomly started bleeding. That sounds awful. I’m not a fan of shots but I’m somewhat looking forward to seeing if this can help",
          "author": "CommonKilljoy",
          "created": 1631944696,
          "upvotes": 2,
          "replies": {
            "hdddoor": {
              "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hdddoor/",
              "text": "It's only temporary, there's actually another option too which is a prescription high dose level of vitamin B12 pills, that's what I ended up doing, they gave me the choice cuz they said it's not terrible for me and it will just take a bit longer to see the effects. Then after 3 months you need to go back to get tested and see how it's affecting you. They determined I have problems absorbing vitamin B12, but given enough high amounts of it, the tiny proportion I do absorb eventually hits the normal level. So then they downgraded me to regular store vitamins and downgraded that some more to a letter dose after another blood test showed i was now consistently in the normal range (this whole thing was like a year or two, but now I'm fine just taking one of the B12 vitamins the lowest pill dose everyday)",
              "author": "DreamWithinAMatrix",
              "created": 1631995141,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hd9wqd0": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd9wqd0/",
      "text": "Ok I have been feeling the exact same way in my classes even though years ago I was sharp as a nail. I gotta go to the doctor.",
      "author": "le-toss",
      "created": 1631925173,
      "upvotes": 1,
      "replies": {
        "hd9yn4r": {
          "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd9yn4r/",
          "text": "I blamed myself and thought I was just dumb/dismissed it as symptoms of other things and my neurologist thought it was just my sleep schedule getting adjusted to the new semester. Neither of us were expecting this. She was actually just wanting to get a baseline for all my numbers so ran everything she possibly could since I’ve never really gotten anything done, I don’t think either of us expected anything to turn up. If you feel like something is up do get it checked out. Better safe than sorry",
          "author": "CommonKilljoy",
          "created": 1631926131,
          "upvotes": 2,
          "replies": {
            "hda04tw": {
              "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hda04tw/",
              "text": "And here I was meditating and thinking I had adhd or something. I guess you never know until you get checked out. Here’s to better health and performance for both of us.",
              "author": "le-toss",
              "created": 1631926884,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hd9smt7": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd9smt7/",
      "text": "If you aren't able to participate in class discussions, you aren't getting the full benefit of your education.  Take care of yourself and you'll be a better person and student for it.  Anyone who makes you feel otherwise is just plain wrong.",
      "author": "acceptablemadness",
      "created": 1631923134,
      "upvotes": 1,
      "replies": {}
    },
    "hd953o3": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd953o3/",
      "text": "Please take care of yourself. Also, if you can get into grad school and making basic academic progress with severely low B-12, imagine how badass your future self will be!",
      "author": "Caisenburg",
      "created": 1631912215,
      "upvotes": 6,
      "replies": {}
    },
    "hd93c3d": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd93c3d/",
      "text": "People below have left some good responses and I just want to chime in as I was supposed to start grad school this fall but had to take a medical deferral until next year…so I guess I have some personal experience with letting a university know about what’s going on with my personal medical experience. I originally worked with the accommodations office at my uni so that if I had any in or out of class medical issues my profs would be fully aware, officially. This included official letters from my physician(s) plus my personal input that was then sent to all my profs so they would know the pertinent info of my medical situation and how to help if I had an emergency situation and also accommodations I would need if certain personal situations would arise. While the deferral is specific and not what you’re asking for, it did involve a lot of communication, and I would recommend that you consider what goal you would have by telling your advisor/profs of your B12 issue. However, telling the accommodations office has no downside really. If you’re not officially enrolled there, they can’t really tell your professors, so if you go there for an info meeting, you could discuss the possible reasons for disclosing the info to your profs. Good luck and I hope your health improves!",
      "author": "CampyUke98",
      "created": 1631911453,
      "upvotes": 1,
      "replies": {}
    },
    "hd932ce": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd932ce/",
      "text": "Leave of absence?",
      "author": "a-deer-fox",
      "created": 1631911335,
      "upvotes": 1,
      "replies": {}
    },
    "hd8sp1f": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8sp1f/",
      "text": "This wouldn't be an excuse for the issues you were having, it would be a reason and an explanation. I would consider telling them if you feel comfortable. Also because if it's a diagnosed medical issue, you may be able to get a documented accommodation from your university's disability resource center if you feel like you could benefit from one.",
      "author": "False-Guess",
      "created": 1631906933,
      "upvotes": 6,
      "replies": {}
    },
    "hd8q708": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8q708/",
      "text": "Hi friend,\n\nI was diagnosed with severe Crohn's disease earlier this year, which itself caused a range of malnutrition and related issues. The best decision I ever made was to keep my advisor, my department head, and the Dean \"in-the-loop\" of how I am doing and what I need to\n\n1: Not Die\n\n2: Stay in Grad School\n\nKeep yourself in context. Most people who go to grad school crush themselves with their own self-generated pressure. The people in charge don't want to punish you for having health problems, and they won't punish you for things that are not your fault. My experience has been that academia is really reasonable and respectful towards things that are not in our control.\n\nThe net effect of talking to people has been that I no longer feel like my future is in limbo and no longer feel like I am under constant threat of getting kicked out - a really, really horrible way of being when already have other problems going on.",
      "author": "Dano3000",
      "created": 1631905863,
      "upvotes": 19,
      "replies": {}
    },
    "hd8ou0h": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8ou0h/",
      "text": "I am going to say, maybe.\n\nIs there any reason you would want to tell them? If it’s because it can answer a clear problem and offer a clear solution (you getting B-12), then yes tell them.\n\nIf you are close enough with your advisor that they would prefer to know of things that may affect your work, even temporarily, tell them. \n\nIf you have nothing to get out of this because there were no noticeable problems and they have no concerns and you aren’t close enough to tell them, then don’t. \n\nSorry - vitamin deficiencies are tough. Hope you feel better soon!",
      "author": "al_the_time",
      "created": 1631905278,
      "upvotes": 2,
      "replies": {}
    },
    "hd8niqy": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8niqy/",
      "text": "There's being irresponsible for when excuses are worthless\n\nAnd then there's medical reasons\n\nYou're in the latter",
      "author": "Asteroth555",
      "created": 1631904717,
      "upvotes": 9,
      "replies": {}
    },
    "hd8m8cc": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8m8cc/",
      "text": "If you believe this is affecting your performance, have the doctor send a letter to your university's student accessibility center (or whatever the term is your Uni uses). It is the place for students who have issues that can inhibit their learning (dyslexia, and other things). They can give you a letter or send one out to your professors that indicates you require a special accommodation without specifically indicating what condition it is.",
      "author": "FolkMetalWarrior",
      "created": 1631904166,
      "upvotes": 1,
      "replies": {}
    },
    "hd8l80r": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8l80r/",
      "text": "If you believe this has been affecting your performance, it may be worth bringing up with your advisor. However, I would ask you to consider what you want to get out of telling them. \n\nAre there accommodations that you need to help you accomplish your work? Do you want your previous work to be reevaluated or disregarded? Do you think you'll need extra help or time to complete your program? Do you just want someone to know? \n\nIf you are just telling them to tell someone, don't be surprised if the only real response you get is \"I'm sorry you're dealing with that.\"\n\nIf you need accommodations or want something to change, come to the conversation prepared with a request or at least prepared to start a discussion about what is possible.",
      "author": "readrunrescue",
      "created": 1631903729,
      "upvotes": 31,
      "replies": {
        "hd8mxp7": {
          "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8mxp7/",
          "text": "I'm not looking for accommodation  or  another evaulation of my work. None of my grades have suffered from anything  and I'm in good standing. I guess it would be more of a \"here is where I currently stand\" conversation. Even when my headaches were awful and almost putting me in the emergency room weekly, I didn't want concessions even though they all offered and I'm not big on the sympathy, I'm unfortunately a \"suffer in silence\" kind of person. I know for my advisor at least, there have been issues with my memory and comprehension and I feel like this does honestly explain a lot",
          "author": "CommonKilljoy",
          "created": 1631904467,
          "upvotes": 5,
          "replies": {
            "hd8xgvr": {
              "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8xgvr/",
              "text": ">  almost putting me in the emergency room weekly,\n\nThis is not suffering in silence, this is called slowly killing yourself by inaction",
              "author": "Benaxle",
              "created": 1631908956,
              "upvotes": 13,
              "replies": {}
            },
            "hd8sxpj": {
              "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8sxpj/",
              "text": "In my opinion this comes down to what sort of relationship you have  with your advisor. Some advisors prefer to be in touch with their students' emotional states in order to be more responsive to them, and some prefer to maintain more professional distance and afford their students their own space. Neither is better, it's up to you and them to decide together.",
              "author": "UmiNotsuki",
              "created": 1631907038,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "hd8hped": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8hped/",
      "text": "This is not “an excuse for yourself.” This could very well be a medical issue that is a REASON for some of the issues you’ve been having. I hate that we conditioned to think that these legit things make it look like we don’t want to do work. Try to be gentle with yourself and give yourself the validity you deserve.",
      "author": "crepuscularsounds",
      "created": 1631902219,
      "upvotes": 227,
      "replies": {
        "hd8kzsf": {
          "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8kzsf/",
          "text": "I hate it too. I suffered from several major health issues over my course (a couple of broken bones, bad joints, fibromyalgia, mostly) but in one year my long standing heart condition came back to bite me and I thought the people at my grad assistantship would think I was slacking if I took time off for it (I was hospitalized twice that year for heart surgery.) \n\nso I kept going even when my heart was being weird and I felt like crap and was very preoccupied with it all, and all my ptsd from childhood heart surgeries came back too. I did a horrible job at the GAship (and my own research) because of all this. It was only at the very end of the academic year I discovered medical leave was a thing. If I’d been functioning normally I’d have done ok but I was too ill to focus on the job and really messed up. \n\nNow, with hindsight, I hate that I felt that way and felt cornered into just keeping going. If I’d felt able to say “I feel like crap and should probably be taking some time off” I would’ve been in a much better place all round",
          "author": "coyotesandcrickets",
          "created": 1631903632,
          "upvotes": 24,
          "replies": {}
        },
        "hd97k5s": {
          "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd97k5s/",
          "text": "It’s nice to actually have a legit reason for the comprehension and medical issues other than “I’m just an idiot” after it all settled in that was a huge relief off my shoulders not gonna lie. My advisor got back to me and was more than understanding/helpful. I’m taking it one step and trying to get over that I have to be perfect 24/7 mindset and let myself not be okay sometimes.",
          "author": "CommonKilljoy",
          "created": 1631913303,
          "upvotes": 4,
          "replies": {}
        },
        "hd9mg1f": {
          "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd9mg1f/",
          "text": "It’s not easy to carve out space for your health in grad school. Most of the people I knew only did so after catastrophe hit and there were no other options. The system is so gross; I’m glad to hear your advisor is being supportive!",
          "author": "crepuscularsounds",
          "created": 1631920168,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hd8dd0a": {
      "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8dd0a/",
      "text": "ABSOLUTELY. If you’re in a serious medical situation you should be able to inform your advisors and get the care you need!!",
      "author": "jlpulice",
      "created": 1631900393,
      "upvotes": 64,
      "replies": {
        "hd8l9td": {
          "link": "/r/GradSchool/comments/pq4s82/should_i_inform_my_professorsadvisor/hd8l9td/",
          "text": "Agreed. Also talk to your school's accessibility office to see if they can help with accommodations/officially letting your advisors know. Might also be worth connecting with the university's mental health/counseling office to help you with managing this problem alongside your studies. Hope you are on the mend soon, op!",
          "author": "coyotesandcrickets",
          "created": 1631903751,
          "upvotes": 14,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634065354
}