{
  "sid": "8audav",
  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/",
  "title:": "It wasn't worth it.",
  "text": "I finished. 6 months ago actually. Thought about writing this many times since, but was never up to it until now.\n\nI have my PhD. Yay. I'm the most useless kind of doctor I can be. I barely remember the last year, my brain just shut down somehow. I just went somewhere else. By the time I got out I could barely eat due to ulcers, hadn't slept properly in months, couldn't hold a pencil to write my hands trembled so badly. \n\nMy PI was absent my last year and a half. Almost completely. I think I met with him twice in that time. Absolutely unreachable. Despite multiple cries for help, the department was completely useless. I finally got the head to begrudgingly agree to sign my forms since I literally couldn't get in contact with my PI. The last 3 months whether or not I was actually graduating in August changed from day to day. \n\nMy PI never read my thesis. He showed up the day I defended, though. He stood up there and glibly lied his ass off. How wonderful I was to work with, how brilliant, how promising. The man who emotionally abused and abandoned his lab, who alternated between ignoring me and screaming at me for 5 years. \n\nHe hasn't responded to a single email of mine since that day. Silence when I asked for a letter of recommendation. Silence when I asked for feedback on my papers that will never be published. We have not spoken, and at this point I have no intention of ever reaching out again.\n\nI moved home. My parents didn't want me living on my own, being the wreck that I was. I couldn't find a job, of course -- there aren't jobs in my field here, and it wasn't like I had a single thing going for me on my resume. I did eventually find something to do, a basic programming job I could have gotten straight out of undergrad. \n\nI'm almost 28. I have an Ivy League PhD. And I live at home with my parents because my doctors don't think it's a good idea for me to live independently anymore. I take a handful of pills every morning just to be the barely competent human being that I am, just so I can go work my shitty job and live my shitty pathetic life that I worked so fucking hard for.\n\nIt kind of feels like the last decade didn't even happen. I like to imagine that it didn't. \n\nI just wanted to write this, because I very nearly quit grad school during my 2nd year, my 3rd year, multiple times during my 5th year. And everybody encouraged me, tried to cheer me up, insisted, \"It'll be worth it!\" \"Don't let them win! You can beat this thing!\"\n\nI did beat it. And it broke me.\n\nI didn't need encouragement. I needed permission to quit. I needed somebody to tell me it was okay, that it wouldn't make me a failure, that I wasn't throwing anything away. \n\nSo if you're looking for a sign that it's okay to quit: here it is. It's not always worth it. It certainly wasn't worth my health. And it isn't worth yours either. ",
  "author": null,
  "created": 1523233489,
  "over_18": false,
  "upvotes": 512,
  "upvote_ratio": 0.97,
  "comments": {
    "dx40ick": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx40ick/",
      "text": "Coming from someone who has a passion for research and is currently preparing for graduate school, these kind of stories always scare the s*** out of me. Mind if I ask what your PhD was in? I'm pursuing one in Biomedical Engineering. By the sounds of your story, I am certain you have so much more you could say. No PI should ever be able to treat their PhD students this way, and I personally think you should expose him. I am sorry you had to go through all of that. Have you considered writing a book about your experiences?",
      "author": "Pride96",
      "created": 1523333885,
      "upvotes": 1,
      "replies": {}
    },
    "dx3wq78": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx3wq78/",
      "text": "It’s in the past.  You’ve let the dust settle for six months.  Wait another 2-3 years and it will feel like more and more of a distant memory, a past life.  Find some hobbies and interests that you enjoy.  Read a book that you want to read.  Focus on making yourself better and separating your mind from the negative memories.  You’re free to pursue your own dreams.  Life is short.  Seriously, enjoy the time that remains.  Good luck!",
      "author": "1wrx2subarus",
      "created": 1523329480,
      "upvotes": 2,
      "replies": {}
    },
    "dx3g425": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx3g425/",
      "text": "Your committee can make or brake you. I was very fortunate to get out of a bad relationship with my former advisor when he accepted a position at another university. \nGetting the encouragement, support, and guidance makes a huge difference. \nThe experience you had is horrible. And you still made it through. You are injured, but you are not broken, my friend. ",
      "author": "c_rivett",
      "created": 1523313020,
      "upvotes": 4,
      "replies": {}
    },
    "dx2nqhn": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2nqhn/",
      "text": "I just wanted to chime in and send my condolences. I read some of your replies as well and it seems like you're on track for the future, so I'm wishing you well.\n\nI'm nearly a decade out from a PhD that probably wasn't worth it. Feeling shitty about it will lessen... you'll have other successes in your life and you'll see how little importance most people put on academic successes/failures once you hit, say, 40. So try and stay on top of your mental health.\n\nThe one interesting thing I've found in industry is that even though a PhD isn't necessary for a lot of positions, it is taken into account as you rise in the ranks. If you want to become a manager or director you'll probably find that being introduced to the hiring manager as Dr. trucksareforgirls versus Ms. trucksareforgirls will help a bit. I always smile when people call me Dr because its such a rare thing and I know they're giving me an extra hint of respect. Anyway, it doesn't help with your first few jobs, but it will likely help later on.\n\nTake care.",
      "author": "rzr101",
      "created": 1523287532,
      "upvotes": 8,
      "replies": {}
    },
    "dx2nibb": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2nibb/",
      "text": "I'm a prospective student at the moment and would really like to avoid this kind of situation in grad school. What made you decide to work with your PI? When you first met him did he come across as someone you'd have a good professional relationship with? Did you speak with his grad students before joining his group and, if so, what were their impressions of him? Any tips for me? \n\nSorry for your experience and the barrage of questions. Best of luck moving forward.",
      "author": "Xenotoad",
      "created": 1523287327,
      "upvotes": 3,
      "replies": {
        "dx3mtii": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx3mtii/",
          "text": "He came across as incredibly charming, friendly, and welcoming. If you've ever read about narcissistic personality disorder, that was him to a T. He is fairly young so I didn't take it as a red flag that he had never had a female student before. I should have.",
          "author": null,
          "created": 1523319710,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "dx2n0oa": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2n0oa/",
      "text": "This system is really problemed. We are destroying our best and brightest because of a lack of accountability and professional structure.",
      "author": "tfburns",
      "created": 1523286874,
      "upvotes": 5,
      "replies": {}
    },
    "dx2mjeg": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2mjeg/",
      "text": "For what it’s worth, you are a good writer. Have you always been a good writer or did going throughout your PhD help with that?",
      "author": "hearty_soup",
      "created": 1523286429,
      "upvotes": 5,
      "replies": {
        "dx3n09z": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx3n09z/",
          "text": "Thank you. I've been into writing since I was young (I've written several novels). Unfortunately my writing was one of the things I got criticized most, and I've not been able to take it up again. Maybe soon I hope.",
          "author": null,
          "created": 1523319888,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "dx2la2b": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2la2b/",
      "text": "Sorry to hear about your experience, and for the pain you are experiencing now. It will get better, and maybe one day you'll see the value in your time spent and phd, even though that's hard now. Focus on simple pleasures, find yourself fulfilling hobbies again - sounds like you've been worked to the bone for too long and are overdue for some self-care!",
      "author": "spammalami",
      "created": 1523285225,
      "upvotes": 4,
      "replies": {}
    },
    "dx2jn3b": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2jn3b/",
      "text": "Fuck it, submit your papers for publication without his name on them.  That’ll get his attention, at least.",
      "author": "rykahn",
      "created": 1523283606,
      "upvotes": 17,
      "replies": {}
    },
    "dx2jj0x": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2jj0x/",
      "text": "Thank you. I've needed permission too. \n\nI hope you recover from the trauma of grad school. ",
      "author": "ImInTheFutureAlso",
      "created": 1523283491,
      "upvotes": 12,
      "replies": {
        "dx403de": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx403de/",
          "text": "[deleted]",
          "author": null,
          "created": 1523333353,
          "upvotes": 3,
          "replies": {
            "dx54fg6": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx54fg6/",
              "text": "I'm quitting! I told my advisor today. I already feel so freeeeeeeeee. ",
              "author": "ImInTheFutureAlso",
              "created": 1523387019,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "dx2j18g": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2j18g/",
      "text": "I am glad to hear you got out, I was able to escape too. I was doing my PhD in physics, but my PI would emotionally abuse his underlings and lie about it. The head of the dept wouldn't even listen when I came to him about my PI never being around and having weeks of unanswered emails.\n\nLuckily, I was able to escape before too long. If your program is healthy for you, and you are respected, I am so happy you have that in your life. For those of whom are questioning it, however, take a long look before it's too late. I did, and I'm happier than ever. \n\nThe hard part is finding the strength. Yes, you'll have it to explain to family and friends for a while, and it may be uncomfortable, but take it from OP's case, it could be so much worse.\n\nThank you for posting this.",
      "author": "Troutkid",
      "created": 1523282992,
      "upvotes": 5,
      "replies": {}
    },
    "dx287vk": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx287vk/",
      "text": "[deleted]",
      "author": null,
      "created": 1523265766,
      "upvotes": -14,
      "replies": {}
    },
    "dx267sc": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx267sc/",
      "text": "[deleted]",
      "author": null,
      "created": 1523260789,
      "upvotes": 8,
      "replies": {
        "dx2bt9p": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2bt9p/",
          "text": "Yes, that did make it harder. I live in a very small, rural town and the company I work for is small and growing. There aren't a lot of qualified locals and it's hard to attract people to move out here. My employer realized that even if I don't stick around, they're still getting a very good dev for cheap. I think it would have been a lot harder with a larger company in a more populated area with tons of new graduates to choose from.",
          "author": null,
          "created": 1523273573,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "dx264hi": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx264hi/",
      "text": "I'm sorry to read this story\nYou seem like a good person.",
      "author": null,
      "created": 1523260569,
      "upvotes": 3,
      "replies": {}
    },
    "dx20epz": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx20epz/",
      "text": "Oh honey :(\n\nIt's done, it's over, it's all behind you. Your parents seem to want to help. Rest up and let yourself heal. Don't be afraid of taking a job \"beneath you\" while you do. The rest of your life is ahead of you, you never have to go back to the hell of academia again!",
      "author": "flipflopped_plans",
      "created": 1523249710,
      "upvotes": 16,
      "replies": {}
    },
    "dx1ygoo": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1ygoo/",
      "text": "Had this same exact experience in undergrad, and I'm going to gradschool for a Masters hoping things would be different. This is all too real. I'm so sorry you went through this. ",
      "author": null,
      "created": 1523247098,
      "upvotes": 5,
      "replies": {}
    },
    "dx1szbh": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1szbh/",
      "text": "Giving myself permission to quit my graduate program was one of the best life decisions I've ever made.  But it was a hell of a ride, even then.  I was terrified that not only had my time in grad school been a giant waste of time, but that it had actually set me back.  Thankfully, after a few months of job searching, and suffering through a crappy in-between job for a couple months, I was able to find a pretty good industry job that allowed me to use the research skills I'd been developing throughout my graduate education.\n\n[This episode of the Freakonomics podcast](http://freakonomics.com/podcast/the-upside-of-quitting/) played an important role in my own journey.  It allowed me the freedom to admit that quitting is the most rational decision in some cases.  And that you should question the conventional wisdom that 'quitters never win,' etc.\n\nSorry to hear you're in a rough spot, and that you don't feel like your PhD was worth it.  Hopefully you'll be able to view it more positively some day.  \n\nIf nothing else, be glad that you're able to make a clear-minded assessment of it now.  Some people go their whole lives trapped in their effort-justifying delusions that it was all worthwhile.",
      "author": "mon_dieu",
      "created": 1523241367,
      "upvotes": 30,
      "replies": {}
    },
    "dx1rwrm": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1rwrm/",
      "text": "Do you have any interest in reporting your old PI? It sounds like you have a concrete case to take to the dean of your graduate school.\n\n[This article](http://www.sciencemag.org/careers/1999/01/what-do-when-your-advisor-goes-too-far-part-ii) might be insightful to your circumstance or to anyone currently in this situation.\n\n> \"First, let me say that there should be a clearly understood hierarchy of people with whom a graduate student can consult regarding problems with a faculty member. The names of these people and their roles should be known to all graduate students when they first arrive in the department. At my university these persons include, in ascending order of authority, the graduate coordinator, department chair, dean of the school, and provost of the university.\n\nThanks for sharing your story. And fuck that guy. Hang tough, friend.",
      "author": "bigboybanhmi",
      "created": 1523240264,
      "upvotes": 22,
      "replies": {
        "dx30s1v": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx30s1v/",
          "text": "I agree, the PI should be reported and failing that, outed. Public name and shame is probably the only way to take any kind of action, given how uncaring everyone else in the department seems to be.",
          "author": "102564",
          "created": 1523299124,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "dx1rjez": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1rjez/",
      "text": "I kind of went through your post history a bit (sorry), and I had a few questions.\n\n* Do you think your mental health condition was at all contributing to your negative experience(s)? From what I've read so far, you say you've been medicated since you were very young\n* What Ivy League did you go to (if you don't mind me asking)\n* Are you considering a post-doc? Maybe with a friendlier team/advisor?\n* What was your thesis about? Was it something you were especially passionate about?\n* You say you're a data science PhD, but you're only just learning how to code? How did that happen? (Sorry if this comes off snarky, I'm just really curious. Blame Reddit's anonymity) \n* You mention you are asexual and, again just my curiosity getting the better of me here, but do you think that lack of wanting to be intimate with someone negatively impacted you? In other words, do you think if you were sexually inclined, you'd have had a better experience (since sex/relationships help ease the stress)?\n* Are you sure you can't just apply somewhere outside of your home state? I'm from California, and there are tons of listings for PhDs in Data Science/Genetics/etc. \n\nFrom what I've read so far, it seemed like you had very limited avenues of stress-relief, which is crucial I think, shitty PIs notwithstanding. I'm really sorry you had a bad experience, and I wish people had supported what you wanted deep inside. It will take time but it will get better. Keep at the programming! And hell, you're still pretty young (27, right?), you still have some time to figure yourself out. Your whole life, to be exact. :) Sending good vibes.",
      "author": null,
      "created": 1523239901,
      "upvotes": 17,
      "replies": {
        "dx1t1vr": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1t1vr/",
          "text": "I think I was more likely to \"snap\" like i did because of preexisting mental health issues. The bad situation with my PI was not just me though-- as of today he has a single student left because everyone else has gotten out.\n\nI don't want to name the school because it becomes too easy to work out which program I was in, and it's a small program. Sorry. Suffice to say that it was exactly as stuffy, pretentious and Ivory Towered as you might imagine.\n\nI am not considering a postdoc. Academia is definitely out of my reach as a career due to my poor thesis, and to be honest I'm making more money as an entry level developer with better hours than I would as a postdoc. \n\nMy thesis was about statistical methods in genomics. I can't say I was particularly passionate about it. \n\nI'm not just learning to code, I've been programming since I was 14. Sorry if I gave the wrong impression! I majored in computer science in undergrad and I'm now working as a Python developer.\n\nOne of the biggest sources of stress other than my PI in grad school was my relationship. I was kind of harangued into in the first place without much enthusiasm on my part, and it ended very badly with him attempting suicide in my living room. Since then I've just stayed alone. Some people just aren't meant to be in relationships.\n\nThere are certainly job opportunities elsewhere, maybe even something I could actually get. But I am not well enough to live on my own right now. So moving across the country is definitely not an option. \n\nThanks for the good vibes, and thanks for taking the time.",
          "author": null,
          "created": 1523241437,
          "upvotes": 40,
          "replies": {
            "dx1zosd": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1zosd/",
              "text": "Damn, you've been through so much. Yeah, take your time man. As much time as you need",
              "author": null,
              "created": 1523248662,
              "upvotes": 11,
              "replies": {}
            },
            "dx2gjtm": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2gjtm/",
              "text": "Are you currently in therapy? You only say \"doctors\" so I wasn't sure if you meant general MD, psychologist, or psychiatrist. Given everything that you've gone through, it may be worth looking into trauma therapy and trauma-focused treatment options.\n\nI'm not a doctor, but I have been diagnosed with Complex PTSD as a result of abandonment issues and general exposure to environmental stressors when I was growing up. I would encourage you to look into CPTSD and see if any of the symptoms resonate with you. I always thought I was just depressed and anxious, but peeling back the layers in therapy and getting my CPTSD diagnosis has been incredibly enlightening (that's not to say that everything is fixed).\n\nI hope things get better for you. At least you are taking care of yourself now. It takes time and it's hard work, but healing is work. It's good that your doctors have your back and that your parents are being supportive (but that second part might be a misplaced assumption).",
              "author": "pugawugwug",
              "created": 1523280254,
              "upvotes": 5,
              "replies": {
                "dx2i9g3": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2i9g3/",
                  "text": "I am not in therapy right now, but I am under the care of a psychiatrist. I haven't found a therapist around here familiar with my disorder and therapy is just incredibly frustrating when that's the case. I hope to get back into it eventually.",
                  "author": null,
                  "created": 1523282176,
                  "upvotes": 7,
                  "replies": {
                    "dx6vka7": {
                      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx6vka7/",
                      "text": "Late response, but I know how difficult that can be. Currently in grad school in a smallish town in the midwest. It seems like everybody says they do trauma stuff, but then they just focus on CBT and not actually processing the trauma. I've considered doing Skype therapy with trauma specialists. Maybe that would be a useful resource for you as well.",
                      "author": "pugawugwug",
                      "created": 1523463118,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "dx1r2s0": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1r2s0/",
      "text": "I’ve been through it. And I don’t mean to add fuel to the fire, but yes, my Doctorate wasn’t worth it either. A phd is a pretty useless degree and I didn’t realize it until I got one! I too had a shitty experience in grad school. In the end, it took me a while, but I ended up getting a job in an unrelated field through a connection. I wanted out. And I much happier now.",
      "author": "doctor_biteme",
      "created": 1523239414,
      "upvotes": 25,
      "replies": {
        "dx2c1u1": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2c1u1/",
          "text": "Thanks. I am definitely happier now. I know my post was very negative, but things are much better now than they were for the last 5 years. I will come through it, just like you, even though my life might look a bit different than I might have hoped once.\n\nETA: Your username is perfect :D",
          "author": null,
          "created": 1523273979,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "dx1pxm8": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1pxm8/",
      "text": "First off your taking this advice from a guy with a bachelor's degree in philosophy, an unmeasurable disdain for the educational system, a reader of far too many scholarly informative articles, and as a person who has read Excellent Sheep by William Deresiewicz. According to an article i glanced at today you are already screwed. Once a person starts taking meds its impossible to get off. Now i know nothing isnt impossible, because i spend many days doing nothing. However if you are a drug addict (this is information i have gathered from several readings and i have always had a knack for connecting the dots) your fight will never be over. People with addictions develop a dependence on the substance or device to provide them with dopamine. Dopamine is a scary thing mix in a few more chemicals and you have love, mix in other chemicals and you have a concoction to commit suicide. When you take drugs, or as people prefer to call it 'prescribed medicine,' you are providing an overload of chemicals which tells your body to stop making them. Depending on the medicine you are on quitting cold turkey could kill you, so dont do that.  \n\nNow because you jumped through all the hoops that were required you got to graduate school. With no more hoops laid out plainly for you you flailed a bit and because society is literally living in the most counterintuitive way to prolong our existence. Sure Ol' Musky might have us terraforming mars in 50 years, however i dont believe we will last that long. By the Karadashev(sp?) scale we are a 0.7 civilization. Human beings are a 2.23(i think) on the trophic scale. Same level as a jellyfish, a species that has lived hundreds of million years longer than we have without a brain. Sorry lost myself... The reason you wanted to quit graduate school was because you saw options, the very thing man kind is afraid of. However society still deems academia as the highest honor, basically at this point we are beating an empty pinata hoping for candy that will never come. It's a nightmare and until someone does something we are going to be the next species caught in the sixth mass extinction, already the ring leaders of this circus. \n\nAnyway i hope this helps or raises questions from anyone/everyone. This was a sliver of my knowledge and i regret not having an answer. However in life there are no answers, only deeper questions. Haha my rant is over and i do feel your pain. But as a practicing philosopher my life's goal is to spread wisdom. ~Norman King Franklin III",
      "author": "Normelix",
      "created": 1523238239,
      "upvotes": -62,
      "replies": {
        "dx1q865": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1q865/",
          "text": "No worries, I'm not a drug addict, unless you count SNRI's. I don't even drink. I've been taking psychiatric medications since I was 12. Very unlikely I'll ever be able to go off them, you're correct. \n\nYou have a very interesting way of writing! Thanks for taking the time.",
          "author": null,
          "created": 1523238541,
          "upvotes": 22,
          "replies": {
            "dx1qq67": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1qq67/",
              "text": "Honestly, I have no idea what this person's going on about. Don't be ashamed to take medication if it helps to maintain your mental health. That kind of shaming is why people with serious mental health concerns are not getting the help they need.",
              "author": "deshypothequiez",
              "created": 1523239044,
              "upvotes": 39,
              "replies": {
                "dx1uxhe": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1uxhe/",
                  "text": "This person, name on the post, is not shaming him. But explaining the fault and reasons that i know for his problems. Its an opinion, as of the fact that i do not know this person, probably never will, and have no groundings in my post then intellect from my noggin. ",
                  "author": "Normelix",
                  "created": 1523243473,
                  "upvotes": -19,
                  "replies": {
                    "dx21aaa": {
                      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx21aaa/",
                      "text": "Are you on drugs?",
                      "author": "targetsgenes",
                      "created": 1523251050,
                      "upvotes": 20,
                      "replies": {}
                    },
                    "dx2ipg7": {
                      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2ipg7/",
                      "text": "I don't understand how you have a degree in philosophy yet have literally zero grasp of logic. Let alone how your degree in philosophy somehow makes you an expert on mental health.",
                      "author": "deshypothequiez",
                      "created": 1523282644,
                      "upvotes": 2,
                      "replies": {
                        "dx2mwbo": {
                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2mwbo/",
                          "text": "Why do I have zero grasp on logic? And i never claimed to be an expert, but appreciate the compliment. ",
                          "author": "Normelix",
                          "created": 1523286763,
                          "upvotes": -1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "dx1vkhz": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1vkhz/",
              "text": "Don't feel bad about medication. We're all a bunch of randomly mutated genes, and some of us have shitty genes that predispose us to mental health troubles in some way, shape, or form. SNRIs are a medical treatment for a partly medical problem, just like insulin for diabetics or any host of \"drugs\". If they help you to simply function day-to-day, then take them. If they're treating your condition and the side-effects aren't too bad, then take them. \n\nYour doctors are in a far better position to discuss your medication regime, so please don't listen to this person. Anyone who tries to give you medical advice like that is just irresponsible, and a crank.\n\nThere's always that saying:\n\n>If you can't make your own neurotransmitters, store-bought is fine\n\nI'm going to be on medication for the rest of my life as well. You can PM me any time you want if you want someone to talk to. ",
              "author": "NoxiousQuadrumvirate",
              "created": 1523244110,
              "upvotes": 15,
              "replies": {}
            },
            "dx1tir0": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1tir0/",
              "text": "Your welcome and I seriously mean nothing malicious about the post. But everyone is a drug addict in some form or fashion. Check out a crowded line at starbucks, or people holding hands in the park. Drugs have too much of a negative connotation. ",
              "author": "Normelix",
              "created": 1523241910,
              "upvotes": -13,
              "replies": {}
            }
          }
        },
        "dx1qltu": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1qltu/",
          "text": "are you ok",
          "author": "deshypothequiez",
          "created": 1523238923,
          "upvotes": 18,
          "replies": {}
        },
        "dx1sk8t": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1sk8t/",
          "text": ">as a practicing philosopher my life's goal is to spread wisdom\n\n>According to an article i glanced at today\n\nIf your goal is spreading wisdom, you're gonna need to actually read things.  That tends to be a prerequisite for knowing what the hell you're talking about.",
          "author": "mon_dieu",
          "created": 1523240931,
          "upvotes": 27,
          "replies": {
            "dx1sx0z": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1sx0z/",
              "text": "I believe you are confusing the terms intelligence and wisdom. Intelligence tells us that a tomato is a fruit, wisdom tells us not to put it in a fruit salad.  And glanced at is my way of saying i read an article, sorry for using a little art in my language. Hyperboles are not a crime. ",
              "author": "Normelix",
              "created": 1523241305,
              "upvotes": -26,
              "replies": {
                "dx1twoi": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1twoi/",
                  "text": "/r/iamverysmart ",
                  "author": "Soggy_Biscuit_",
                  "created": 1523242332,
                  "upvotes": 32,
                  "replies": {
                    "dx1vl2n": {
                      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1vl2n/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1523244127,
                      "upvotes": -20,
                      "replies": {
                        "dx2115l": {
                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2115l/",
                          "text": "words of advice: you know less than you think you know.",
                          "author": "nc_bound",
                          "created": 1523250655,
                          "upvotes": 21,
                          "replies": {}
                        },
                        "dx238hl": {
                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx238hl/",
                          "text": "> cum stain\n\n/r/IHaveSex",
                          "author": "anjelswhat",
                          "created": 1523254425,
                          "upvotes": 7,
                          "replies": {
                            "dx238n7": {
                              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx238n7/",
                              "text": "Here's a sneak peek of /r/ihavesex using the [top posts](https://np.reddit.com/r/ihavesex/top/?sort=top&t=all) of all time!\n\n\\#1: [Saw this on twitter this morning, can’t believe some people are actually like this.](https://i.redd.it/bbie1yhks5h01.jpg) | [495 comments](https://np.reddit.com/r/ihavesex/comments/7ym5p5/saw_this_on_twitter_this_morning_cant_believe/)  \n\\#2: [At the age of 13](https://i.redd.it/outkv4cyjtb01.jpg) | [289 comments](https://np.reddit.com/r/ihavesex/comments/7secv7/at_the_age_of_13/)  \n\\#3: [On demand!](https://i.redd.it/360rtairfb901.png) | [464 comments](https://np.reddit.com/r/ihavesex/comments/7pjax4/on_demand/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/7o7jnj/blacklist/)",
                              "author": "sneakpeekbot",
                              "created": 1523254433,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "dx2fw6c": {
                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2fw6c/",
                          "text": "Lol we got a badass over here",
                          "author": null,
                          "created": 1523279473,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "dx1tor6": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1tor6/",
                  "text": "There's more to wisdom than merely knowing how to apply knowledge.  It's more than making a good fruit salad.  It's being mindful and appreciative of all the labor and expertise that was required to get the salad's ingredients to you.  It's knowing that a meal shared with loved ones is significantly more enjoyable than one eaten alone, no matter the recipe.\n\nWisdom requires a breadth of experience -- enough experience to give you perspective and appreciation for what's most important in life.  It's also being able to connect with others as human beings, to share your perspective with them in a way that enriches both of your lives.\n\nAnd wisdom is also having the humility to know that there's much you have yet to learn.",
                  "author": "mon_dieu",
                  "created": 1523242084,
                  "upvotes": 11,
                  "replies": {
                    "dx1w7kr": {
                      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1w7kr/",
                      "text": "I am not sure, but it sounds like you are agreeing with me. Though you entangled emotions and humans newest conquest on making everyone equal. So thanks for understanding.",
                      "author": "Normelix",
                      "created": 1523244781,
                      "upvotes": -9,
                      "replies": {
                        "dx1wixd": {
                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1wixd/",
                          "text": ">it sounds like you are agreeing with me\n\nNot even close.\n\n>you entangled emotions and humans newest conquest on making everyone equal\n\nAre you high?  What are you even talking about?",
                          "author": "mon_dieu",
                          "created": 1523245087,
                          "upvotes": 14,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "dx2s0vm": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2s0vm/",
          "text": "Hey, you have some good ideas and clearly a lot to say, which is a good thing. I suggest being open to others' suggestions and feedback, which is how most of us gain wisdom intellectually and personally. \n\nYou seem like someone who could be interesting to talk to, but as it is, I think your defensiveness is standing in your way. One of Deresiewicz's points was that we are too eager to foster an environment of direct competitiveness among our youth, and that we don't provide enough collaborative opportunities. ",
          "author": "doobeedoo3",
          "created": 1523291351,
          "upvotes": 3,
          "replies": {
            "dx320q6": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx320q6/",
              "text": "Thank you. I will take that advice. ",
              "author": "Normelix",
              "created": 1523300232,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "dx1px9d": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1px9d/",
      "text": "Sorry ☹️\nThanks for contributing.",
      "author": "TakeOffYourMask",
      "created": 1523238229,
      "upvotes": 8,
      "replies": {}
    },
    "dx1odg7": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1odg7/",
      "text": "What's your field?  ",
      "author": "throw20150615",
      "created": 1523236689,
      "upvotes": 6,
      "replies": {
        "dx2bvx1": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2bvx1/",
          "text": "Statistical genomics.",
          "author": null,
          "created": 1523273704,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "dx1n508": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1n508/",
      "text": "[deleted]",
      "author": null,
      "created": 1523235461,
      "upvotes": 57,
      "replies": {
        "dx1sr2z": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1sr2z/",
          "text": "That's the exact opposite reason for obtaining a PhD. A PhD is a professional research degree, and is meant to be a training step for a specific career. If you just want to learn for the sake of learning, get a library card. It really devalues the degree, its objectives and degree holders to perpetuate that idea. ",
          "author": "wookiewookiewhat",
          "created": 1523241133,
          "upvotes": 73,
          "replies": {
            "dx1thdu": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1thdu/",
              "text": "[deleted]",
              "author": null,
              "created": 1523241870,
              "upvotes": 27,
              "replies": {
                "dx1zpt4": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1zpt4/",
                  "text": "They could assuage their consciences by not pretending that academia is the only worthwhile path. ",
                  "author": "RememberToBackupData",
                  "created": 1523248702,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            },
            "dx2ky3m": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2ky3m/",
              "text": "Ah! \"Get a library card\". I'll have to remember that answer when someone spews me the ole \"learning\" party line.",
              "author": "Minny7",
              "created": 1523284904,
              "upvotes": 10,
              "replies": {}
            },
            "dx267tu": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx267tu/",
              "text": "On the other hand, the career in question is being a scholar. Why would you be a scholar if you don't want to understand something. If you just want a good career, take a 2 year accountancy course after high school and get an entry level accountancy job. In the time it would take to get your degrees (like 10 years probably) you will have 8 years of experience.\n\nI get your point, but I am just putting forward the alternative view.",
              "author": "l_lecrup",
              "created": 1523260792,
              "upvotes": 7,
              "replies": {
                "dx2hoz3": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2hoz3/",
                  "text": "But research IS a job. We have collectively decided that research to move fields forward, from math and science to literature, has a monetary value because it contributes to society. Just because you enjoy your work doesn't mean you shouldn't be paid for it. There's no substantial devil's advocate stance here.",
                  "author": "wookiewookiewhat",
                  "created": 1523281559,
                  "upvotes": 13,
                  "replies": {
                    "dx2x94q": {
                      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2x94q/",
                      "text": "I didn't say you shouldn't get paid.. the reason for obtaining a PhD is to get a *specific* career. And I can't really see why you would get into that specific career, if you didn't really love learning all that much and had no passionate feelings about the field you are in. So they are necessary conditions for doing a PhD as far as I am concerned. I was responding to your \"that's the exact opposite reason..\" not defending \"they don't need to get a job out of it\".",
                      "author": "l_lecrup",
                      "created": 1523295979,
                      "upvotes": 1,
                      "replies": {
                        "dx48y3v": {
                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx48y3v/",
                          "text": "I feel like maybe you're coming at this from a specifically pure mathematics view?  There's some specific careers that you need a PhD for that don't aren't some variant on 'professor' or 'scholar' (at least in engineering & the physical sciences).  ",
                          "author": "BesselJZero",
                          "created": 1523349347,
                          "upvotes": 4,
                          "replies": {
                            "dx491et": {
                              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx491et/",
                              "text": "Could you give me an example? That seems absurd to me; a PhD is a research degree. Is there a job that somehow requires a PhD but involves no research? I don't understand. Like requiring that you prove you can juggle in order to get a job as a deep sea diver.",
                              "author": "l_lecrup",
                              "created": 1523349568,
                              "upvotes": 1,
                              "replies": {
                                "dx49h3x": {
                                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx49h3x/",
                                  "text": "It doesn't require *no* research, but off the top of my head Intel is doing some cool EE/semiconductor/etc. stuff right now.  Places like NASA and SpaceX (cutting edge aerospace companies) also are doing cool things  (some of which require a PhD to get into the really interesting, self-directed positions).  Same thing with biotech companies.  Used to be that Bell Labs was the place to be, but not anymore. \n\nIf you asked if I wanted to be 'a scholar' I would head for the hills.  I want to solve problems.  I need to know enough to not act like a complete idiot in the lab to do that.  Do I intend to spend the rest of my life in some abstract 'pursuit of knowledge'?  No, I just want to find cool, useful alloys and put them to good use without anyone breathing down my neck too closely. ",
                                  "author": "BesselJZero",
                                  "created": 1523350629,
                                  "upvotes": 3,
                                  "replies": {
                                    "dx4apy8": {
                                      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx4apy8/",
                                      "text": "Ok, well I used the word scholar and I hold my hands up, that is too specific. But the point was that someone said that\n\n\"love of learning\" and \"passion for your field\" are the *exact opposite* of the reason to get a PhD. \n\nThey were probably being a little hyperbolic, but I disagree even with a more temperate restatement of their comment. I would say that you wanting to find cool useful tools, and presumably writing about them or otherwise telling your colleagues and others about them, involves a pretty substantial amount of a desire to learn. Probably we are motivated quite similarly by a need to take things apart and see what makes them tick. The very fact that you describe what you are up to as cool suggests some passion.",
                                      "author": "l_lecrup",
                                      "created": 1523353694,
                                      "upvotes": 1,
                                      "replies": {
                                        "dx4h8q8": {
                                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx4h8q8/",
                                          "text": "To an extant, I agree that only people who love learning are going to put themselves through a dozen years post-secondary schooling.\n\nBut people gotta eat. I don’t know anyone who’s in grad school for kicks.",
                                          "author": null,
                                          "created": 1523364830,
                                          "upvotes": 2,
                                          "replies": {}
                                        },
                                        "dx4mj96": {
                                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx4mj96/",
                                          "text": "Yeah, that's fair. ",
                                          "author": "BesselJZero",
                                          "created": 1523370923,
                                          "upvotes": 1,
                                          "replies": {}
                                        },
                                        "dx5ebkk": {
                                          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx5ebkk/",
                                          "text": ">But the point was that someone said that \"love of learning\" and \"passion for your field\" are the exact opposite of the reason to get a PhD. \n\nAH. This is where our disconnect is. My initial response (\"opposite reason to get a PhD\") was a direct response to the statement that followed, which is: \n\n>\"People do a PhD for the love of learning and their passion for the field. **They don't need to get a job out of it - that's besides the point of doing a PhD in the first place!\"**\n\nI wasn't being hyperbolic at all. No one should be getting a PhD simply because they love the field and have no desire or intention to apply it to a job.\n\n",
                                          "author": "wookiewookiewhat",
                                          "created": 1523395125,
                                          "upvotes": 1,
                                          "replies": {
                                            "dx66ii5": {
                                              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx66ii5/",
                                              "text": "> No one should be getting a PhD *simply* because they love the field\n\nEmphasis mine in the above quote. I completely agree with this. I guess we were just talking at cross purposes!",
                                              "author": "l_lecrup",
                                              "created": 1523425842,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "dx3rsw9": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx3rsw9/",
              "text": "If you're obtaining a phd so you can get a job, you're insane. It's absolutely for the learning.",
              "author": "NoAd6",
              "created": 1523324557,
              "upvotes": -3,
              "replies": {
                "dx4h30r": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx4h30r/",
                  "text": "Interesting. Do go on?",
                  "author": null,
                  "created": 1523364633,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "dx1oje5": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1oje5/",
          "text": "I actually did get a good job out of mine (not an academic one), and I still know that line is bullshit. ",
          "author": "dr_shark_bird",
          "created": 1523236857,
          "upvotes": 32,
          "replies": {
            "dx1qh1s": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1qh1s/",
              "text": "I'm just here for the PhD. Everyone I met in industry doesn't work on the same research they did for their PhD yet it got them the industry job that they're happy about. ",
              "author": "campbell363",
              "created": 1523238791,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "dx4deei": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx4deei/",
          "text": "I think that going to grad school for any reason other than \"The only job I can imagine having that I want more than anything else in the world *requires* a PhD\" is a mistake.\n\nUnless you're, like, independently wealthy and are doing it for kicks, then sure, do it for the love of learning.",
          "author": null,
          "created": 1523359295,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "dx1moe2": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1moe2/",
      "text": "That's terrible! But you have pretty impressive resilience and drive to finish your PhD under the circumstances. Let this remind you that (once you've some well earned break and time to recover), you can do whatever you set your mind to!",
      "author": "likenzombie",
      "created": 1523235008,
      "upvotes": 61,
      "replies": {}
    },
    "dx1m2up": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1m2up/",
      "text": "Jesus.\n\nI'm half tempted to suggest you write a glowing letter for yourself in his name. What an asshole.\n\nDo you have any recourse to lodge a formal complaint? ",
      "author": "PelagianEmpiricist",
      "created": 1523234380,
      "upvotes": 110,
      "replies": {
        "dx1pxk7": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1pxk7/",
          "text": "I really don't know. My old PI is a very big name and untouchable. The department helped me out only after months of doing nothing, and even then only did the bare minimum. When I tried to talk to people in other offices, they told me to talk to the department head. Nobody seemed to care and I'm still sure I only graduated because they were all sick of me.",
          "author": null,
          "created": 1523238238,
          "upvotes": 68,
          "replies": {
            "dx1q35e": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1q35e/",
              "text": "Welp best suggestion is you use all this to motivate you to become absurdly successful so that years down the road you can casually mention in an interview how useless he was. \n\nThen show the emails when someone presses further. \n\nI mean. If you want. ",
              "author": "PelagianEmpiricist",
              "created": 1523238396,
              "upvotes": 54,
              "replies": {
                "dx3jape": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx3jape/",
                  "text": "Don't really need to spend years to get an interview.  Just give a free lecture in a college, use that lecture history to leverage either giving a free lecture in another college or writing a short article in some fancy magazine about the subject you're an expert in, and just keep snowballing publicity references for a month or two until news reporters that want to mention your topic are coming to you as the guy they know they can call an expert.  The PhD only helps accelerate this.  The goal if you want to be interviewed isn't actual knowledge in a field so much as collecting as many shorthand signallers of \"expert\" status as you can.\n\nEventually you can find yourself getting paid to talk about whatever your chosen subject is, too.\n\nHeck, in this case he could make his subject \"problems in the academic process\" or otherwise get an interview just about how bad his gradschool experience was.",
                  "author": "BlueberryPhi",
                  "created": 1523316187,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            },
            "dx2f5io": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx2f5io/",
              "text": "[deleted]",
              "author": null,
              "created": 1523278540,
              "upvotes": 9,
              "replies": {
                "dx4dbjz": {
                  "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx4dbjz/",
                  "text": "Geez, I'm sorry, running that final leg and jumping through all the hoops solo is not fun. It sounds like you're handling it and will get yourself out on time. Good luck! Stay strong!",
                  "author": null,
                  "created": 1523359155,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "dx1lx64": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1lx64/",
      "text": "Sorry friend. You are out of an abusive relationship now and you can work healing. I hope you are able to move on from your trauma.",
      "author": "spocktick",
      "created": 1523234212,
      "upvotes": 233,
      "replies": {}
    },
    "dx1lg2q": {
      "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1lg2q/",
      "text": "Jesus.\n\nI'm sorry it was so bad for you.\n\nThis sub has shown me on multiple occasions how lucky I am to have a supportive PI who makes sure to stay engaged and in contact.\n\nI hope you get better. I hope some rest and some time out of what was clearly a shitty situation will dull the pain you're feeling now.\n\nAnd hollow though it may sound, you've got the PhD now, and nobody can take that from you, doctor.",
      "author": "hixchem",
      "created": 1523233740,
      "upvotes": 113,
      "replies": {
        "dx1qkr7": {
          "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1qkr7/",
          "text": "As someone who started off in the wrong lab with a terrible, unsupportive PI and then switched to a better one, I still can't wrap my head around the fact that good or bad PI ultimately determines your success in grad school. ",
          "author": "doggiemacdonald",
          "created": 1523238894,
          "upvotes": 53,
          "replies": {
            "dx1sml6": {
              "link": "/r/GradSchool/comments/8audav/it_wasnt_worth_it/dx1sml6/",
              "text": ">I still can't wrap my head around the fact that good or bad PI ultimately determines your success in grad school. \n\nI completely agree. You can be a superstar PhD candidate and end up never publishing or defending. You can be a shit PhD candidate and get multiple pubs and defend early. People tell you this and warn you, but you think that if you work hard you'll be fine no matter who your PI is, and they're wrong. ",
              "author": "wookiewookiewhat",
              "created": 1523240999,
              "upvotes": 54,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064504
}