{
  "sid": "r5h4xn",
  "link": "/r/GradSchool/comments/r5h4xn/do_grad_schools_take_into_account_circumstances/",
  "title:": "Do grad schools take into account circumstances for GPA?",
  "text": "Undergrad GPA: 3.4. Currently working at a FAANG. 6 yoe in total\n\nBack when I was an undergrad, my family was funding my education. I was maintaining a 3.8 gpa during that time, as I had to only work part time to support myself. Unfortunately around 2014/2015, things got really bad in my homecountry, and my parents were not able to continue funding me. This required that I do both full time school and full time work for the final year, which dropped my GPA to 3.4. I did the best I can to maintain it above 3.6 but was unable to.\n\nLately I have been wanting to get into a grad school (ideally top 50 schools). But I know my chances are low with that GPA.\n\nDo grad schools take into account such as circumstances if you can show them proof?",
  "author": "OliveChatty",
  "created": 1638254791,
  "updated": 1638481175,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hmmwups": {
      "link": "/r/GradSchool/comments/r5h4xn/do_grad_schools_take_into_account_circumstances/hmmwups/",
      "text": "\nI’m not sure what kind of program you’re trying to get into but whomever told you a 3.4 gpa is a gpa to be worried about generally did you a disservice. It is a completely acceptable gpa. \n\nYou’ll find the further you get away from undergrad, the more programs looks at your overall application picture. It certainly varies by school and program, but overall you’ll be competitive.",
      "author": "sdf_cardinal",
      "created": 1638255561,
      "upvotes": 8,
      "replies": {
        "hmmxjk2": {
          "link": "/r/GradSchool/comments/r5h4xn/do_grad_schools_take_into_account_circumstances/hmmxjk2/",
          "text": "Looking to get into Financial Engineering. Ideally NYU  \nThe average GPA at some of the schools that are considered my top picks seems to be at 3.6+. So I am making an assumption that a 3.4 GPA would not be so great, and wondered whether they look at circumstances.\n\nedit: MBA is something I pondered over as well.",
          "author": "OliveChatty",
          "created": 1638256050,
          "upvotes": 1,
          "replies": {
            "hmmy0s1": {
              "link": "/r/GradSchool/comments/r5h4xn/do_grad_schools_take_into_account_circumstances/hmmy0s1/",
              "text": "Obviously if you’re limiting yourself that narrow you’re setting yourself up. I had a much lower GPA and applied for public health programs 10 years after working and ended up getting into all 4 schools I applied to (all 4 top 10) and I was worried that was too narrow. \n\nI think you should cast the net wide. Also if you are really worried you could consider taking 1-2 classes which will show your ability to do graduate level work in a program etc. \n\nI would call and talk to an admissions counselor though in the grad program. That is what I did.",
              "author": "sdf_cardinal",
              "created": 1638256405,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hmsqg92": {
          "link": "/r/GradSchool/comments/r5h4xn/do_grad_schools_take_into_account_circumstances/hmsqg92/",
          "text": "Word. 3.4 gpa. Do not sweat it. Focus on the things you can control now. \nI got into a top 25 program (MSW but still) wit <2.3. I had ducking awesome work and volunteer experience, very good gre, and what I thought was a strong personal statement. I had applied 2 yr prior without the good personal statement and volunteer work so clearly it mattered a lot more than my gpa did\n\nDon’t be afraid to apply. Rejection stings. But you won’t get in if you don’t play the game\n\nAlso, was accepted into a competitive (10-15% acceptance) doctor of public health program with a 3.5 gpa in the MSW program. Again, great work experience, strong statement, networking, and did what reviewers recommended after I was rejected the first time.\n\nBe awesome and don’t sell yourself short",
          "author": "lincoln_hawks1",
          "created": 1638368315,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmo1npc": {
      "link": "/r/GradSchool/comments/r5h4xn/do_grad_schools_take_into_account_circumstances/hmo1npc/",
      "text": "There is always some low-end GPA cutoff that the admissions board won't even look at your application, but that cutoff is 2.8 to 3.0 more often than not. The average GPA of grad admissions is always going to be high because the majority of people that want to go to grad school are people that did well in school. It's much rarer to want to do more school if you struggled.",
      "author": "downsideleft",
      "created": 1638283863,
      "upvotes": 1,
      "replies": {}
    }
  }
}