{
  "sid": "ri53z2",
  "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/",
  "title:": "First Generation College Students: How did y’all do this?",
  "text": "Howdy I’m an MS electrical engineering major at an R1 university and as title hints, a first generation. I do not have familial support anyhow. So I’ve been going solo since undergrad.\n\nI did pretty average in undergrad and did bare minimum to skate on through (3.0) but did tons of research. I love it that’s what dragged me into grad school. \n\nMy PI switched schools and offered me to join him after I do my Masters under a year. So I accepted and I can say it’s kicking my ass.\n\nI am pretty sure I failed a class already just waiting for the official “sorry try again” F. In another (and what shocked me) I was flipping between average and little below average (but never too low) and got a C. It’s very surprising because grade distribution on average that 2% of people get this grade. In my final class I am sure I got somewhere between an A or B. Nonetheless a 2.0 GPA officially puts me on academic probation.\n\nHow did you guys do it? What tips can you give me? I am honestly seriously considering putting off my PhD.",
  "author": "up-white-gold",
  "created": 1639703062,
  "updated": 1639788489,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "houvxpx": {
      "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/houvxpx/",
      "text": "I'm not in your field, but I'm a first gen student as well. \n\nMy best advice is to team up with your fellow grad students. Have study dates, share notes, work together. Think of them as comrades in the war of bullshit academia. \n\nSecond best advice is to speak with your professors. Tell them where you are struggling and see if they have alternative ways of describing complex ideas to you. Trust me, rather than looking incompetent you'll come off as dedicated to learning. \n\nBasically, don't go it alone.",
      "author": "verbatimspades",
      "created": 1639704137,
      "upvotes": 8,
      "replies": {
        "hoy8pnl": {
          "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/hoy8pnl/",
          "text": "Agreed. This is the biggest change I've personally made since undergrad and it's been paying off so far. In undergrad,  I had tunnel vision and at all times felt I was behind (even tho i probably wasnt) so i would hesitate to work with others or seek out help. Now, as soon as I spend longer than a few hours on a task/subject/concept and I still can't get it, I immediately ask for help (given I've put in the correct amount of prior work and have solid questions to ask). From my PI, the professor, other students, labmates, really anyone who is willing to help.",
          "author": "queenpeef",
          "created": 1639766354,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hov0cca": {
      "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/hov0cca/",
      "text": "I'm in the humanities, but also a first gen student with family who can't really understand the experience. \n\n\nI think it's key to develop a support system outside of your family, ideally within academia so that you don't feel as isolated and can get more pointed support. As someone suggested, having study sessions with cohort members can be one way to do that. Another way to do that is to join some campus first gen student groups if they exist, or to find other grad student organizations where you can bond with other people who are going through similar things. It can be helpful to get advice from your peers, and even if you can't get advice, it's nice to know you aren't alone. I think mentors are equally important to that. Ideally, you want someone who hasn't been in academia so long that they forgotten what it was like to be a student, or at least someone who can give you straightforward advice when you have questions.\n\n\nIt also helps to get feedback or to ask questions early on and to be really proactive about that. Reach out and see how you were doing and how you could improve. Ask questions if you are struggling with content and if needed, ask again. Faculty will often expect you to be the one to initiate those conversations, so absolutely don't hesitate to use them as a resource.\n\n\nAlso, perhaps some unconventional advice, but campus mental health services can be nice to have. Even if there isn't a background issue there, it can be nice just to have an objective party to talk to about points of struggle and strategies for managing stress. It's just one more available resource to help you troubleshoot anything that you haven't been taught to navigate, and since a lot of schools have it for free, it's worth taking full advantage of it.",
      "author": "torgoboi",
      "created": 1639706084,
      "upvotes": 3,
      "replies": {
        "hov5mc1": {
          "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/hov5mc1/",
          "text": "Thanks for advice. I’ve actually utilized my mental health services since undergrad. It’s resourceful and probably wouldn’t have made this far without it. I find it difficult since my support network/friends are not in grad school and push for actual job than grad school.",
          "author": "up-white-gold",
          "created": 1639708461,
          "upvotes": 2,
          "replies": {
            "hoviwbn": {
              "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/hoviwbn/",
              "text": "That's understandable! I've seen that with some of my friends, where not being in grad school makes it harder for them to be a support system. I've gotten to the point where I mostly go to my cohort or supervisors, along with undergrad mentors, for academic support and then just go to my family with like interpersonal or other stuff. It makes those relationships a lot easier too without the frustration a feeling like they don't understand the experience, if that makes sense. I hope things improve for you; it's definitely rough out here!",
              "author": "torgoboi",
              "created": 1639714459,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "how20wk": {
      "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/how20wk/",
      "text": "also first gen. i took advantage of everything and anything the school offered to help me. tutoring? yes. clubs for my major? yes. make friends with people who are a year above me and can help or study with me? yes. advisor conversations? yes. free counseling and therapy groups? yes! mentorship programs online or with the university? yes! do it all. obviously my major isn't the same as yours but i also had no family support or knowledge about what i do and all the free things my school offered helped me when i had the humility to seek help.",
      "author": "sspumpkaboo",
      "created": 1639725509,
      "upvotes": 2,
      "replies": {}
    },
    "hoxf1yd": {
      "link": "/r/GradSchool/comments/ri53z2/first_generation_college_students_how_did_yall_do/hoxf1yd/",
      "text": "I'm not a first gen college student (both of my parents have bachelor's degrees) but I am a first gen *grad student* as I am the first member of the family to go for an advanced degree. \n\nMy family really doesnt understand how a PhD works or what grad school is like, and I've noticed they have a tendency to view it through the lens of undergrad, because that's the highest level they went to.\n\nBut I've not really been relying on my family for a support system. We were never really that close and much of my emotional support system has been *outside* of my family for as long as i can remember.",
      "author": "DoctorWatchamacallit",
      "created": 1639754988,
      "upvotes": 1,
      "replies": {}
    }
  }
}