{
  "sid": "r6xepy",
  "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/",
  "title:": "I'm panicking over what I want to do with my life. 25 and feel like a total loser.",
  "text": "I'm in grad school (my 2nd grad program.....) and I know that I want to work in internal comms/HR, but I'm not even in the \\*technically\\* right program for it. And I'm not getting any of the internships I'm applying for. And I feel like such a loser. I'm panicking. I turn 25 next month.\n\nI missed out on 2 years bc of this stupid fucking pandemic. I did some personal/professional development and ran a satirical website but now that's over and I just have no idea where to go from here. I may be pursuing a double masters and switching into the more relevant program but it probably won't help.",
  "author": "anonymousalligator25",
  "created": 1638415206,
  "updated": 1638481091,
  "over_18": false,
  "upvotes": 92,
  "upvote_ratio": 0.9,
  "comments": {
    "hmw5j2l": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw5j2l/",
      "text": "Heyyy you don’t need to have it all figured out at 25! I’m in my mid-thirties and in a second grad program with my feet stuck in two different careers and unsure of where I want things to go. \n\nIf you don’t think you’re in the right program, take some time off and get any job that pays the bills, think for a bit, and try some things out. There’s no rush and no reward to figuring everything out by some arbitrary age.",
      "author": "SockaSockaSock",
      "created": 1638419242,
      "upvotes": 58,
      "replies": {
        "hmw5p3j": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw5p3j/",
          "text": "Thank you :) I feel in a rush because I’m a type 1 diabetic and need a job with health insurance but jobs with health insurance are pretty common these days. My program director even kindly encouraged that If I try out electives in the more HR related program and find it’s a better fit than I should switch over.",
          "author": "anonymousalligator25",
          "created": 1638419328,
          "upvotes": 10,
          "replies": {
            "hmw6nft": {
              "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw6nft/",
              "text": "If health insurance is a concern and you’re insured through your program then stay put for now - just keep applying to things and something will come up. \n\nAlso have you checked your state insurance marketplace to see what costs would be? I’ve had a number of friends be pleasantly surprised with the low cost of options when they weren’t making too much income.",
              "author": "SockaSockaSock",
              "created": 1638419815,
              "upvotes": 3,
              "replies": {
                "hmwdxme": {
                  "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwdxme/",
                  "text": "Yep! I’m in NY so we have great public healthcare (according to friends lol).",
                  "author": "anonymousalligator25",
                  "created": 1638423848,
                  "upvotes": 4,
                  "replies": {
                    "hmy4s4n": {
                      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmy4s4n/",
                      "text": "I've heard similar things about Massachusetts FYI.",
                      "author": "DoctorWatchamacallit",
                      "created": 1638462471,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmwbybq": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwbybq/",
      "text": "Twenty five feels like a milestone birthday, but it’s young and it’s a very typical age for someone to be in grad school. The pandemic is has borked up so much for everyone, so I get your frustration, but keep in mind that you’re doing really well in spite of it all. That is an accomplishment in itself, and you should be proud. \n\nI would bet that internships are similarly borked from the pandemic, so I wouldn’t take it too personally. If you’re worried, ask a friend to review your materials or reach out to your school’s career center. That might just give you a boost. This is one of those processes that sucks because you strike out over and over, but remember that it only has to work once! \n\nI know it’s easy to look forward and see some ideal vision of what you want to do in life, but the reality is that life has twists and turns and bumps. Those can take you to unexpected places, but remember that *different* isn’t always *bad*. It’s how we grow and it definitely keeps things interesting. Keep pursuing those goals but with an open mind for unexpected opportunities. And be kind to yourself, you’re doing a good job.",
      "author": "StringOfLights",
      "created": 1638422706,
      "upvotes": 13,
      "replies": {
        "hmwdvhf": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwdvhf/",
          "text": "Thank you so much. That’s very positive and kind and insightful.",
          "author": "anonymousalligator25",
          "created": 1638423813,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmw051l": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw051l/",
      "text": "You are no loser. You are literally in grad school. Something only the top few % of people in the world can say. Be proud of yourself. You will find an internship. You will find a job, and you will be happy. Sometimes the path is just a little less clear for some people.",
      "author": "HumidToku",
      "created": 1638416594,
      "upvotes": 22,
      "replies": {
        "hmw0e4x": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw0e4x/",
          "text": "Thank you. I wish I just had stayed in teaching. I hated it but maybe I should have given it a try. I feel like I was maybe running away from adulthood rather than the career itself",
          "author": "anonymousalligator25",
          "created": 1638416712,
          "upvotes": 2,
          "replies": {
            "hmw14y5": {
              "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw14y5/",
              "text": "You’re only 24. You’re more than likely not even 30% through your life. If you want to give teaching another shot go on ahead. It doesn’t have to be now or in 5 years but don’t feel like it’s a door that is permanently locked. And that feeling of running away from adulthood is something we all go through. It’s perfectly normal to feel that way. I mean we are conditioned to rely on others for close to 20 years and now they want us to do it all on our own? Haha you’d be weird if you weren’t running from adulthood",
              "author": "HumidToku",
              "created": 1638417060,
              "upvotes": 10,
              "replies": {
                "hmw5h0i": {
                  "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw5h0i/",
                  "text": "Thank you, that really helps.",
                  "author": "anonymousalligator25",
                  "created": 1638419212,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmw9tpa": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw9tpa/",
      "text": "Hey, I just gotta say, you're only 25 you have years and year and years to try out other things and find more relevant jobs to what you want to do in the future--in the end, this two years is gonna feel like seconds when you're older and it's just a blip in the timeline. I'm turning 25 and I'm only just now finishing up my undergrad, so you're not the only older person out there still in school feeling uncertainty for the future but you'll get there :)",
      "author": "kitt-cat",
      "created": 1638421520,
      "upvotes": 4,
      "replies": {
        "hmwdyvx": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwdyvx/",
          "text": "Thank you :)",
          "author": "anonymousalligator25",
          "created": 1638423868,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmwfira": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwfira/",
      "text": "You've already gotten some great advice here, but let me just start by saying that you are not a loser! Going to grad school is an impressive achievement. It's okay that it took you a few tries to figure out your ideal path - that's super normal! I'm only a little older than you and I've switched paths a couple times too, both professionally and within school.\n\nOn that note, I HIGHLY recommend reaching out to your school's career office, if you have one. They should be able to help you tweak your cover letters and resumes to showcase how your skills are applicable in your ideal field. It sounds like you have a background in education and writing? There's definitely plenty that you can transfer into HR and communications positions, you likely just need help learning how to \"market yourself\" (which is definitely unnatural for most people and imo more grad programs should focus on it but I digress).\n\nYou may find that you genuinely do have gaps in your skill set. So pick up an elective or two, consider adding a double-major if it's feasible, and/or look into post-grad certificate programs that could be done while you work. The possibilities really are endless, and you know your financial, mental, and opportunity cost (ie, how much do you value continuing education vs needing a salary) situation better than anyone.\n\nGood luck! You got this!",
      "author": "princess_lissie_",
      "created": 1638424808,
      "upvotes": 3,
      "replies": {
        "hmy1685": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmy1685/",
          "text": "Thanks! I have talked to my school’s career office and the head of my program. My resume looks good but needs more clear cut communications roles.",
          "author": "anonymousalligator25",
          "created": 1638461046,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmwhev5": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwhev5/",
      "text": "Me too! In grad school in the wrong field lol. 24F and hoping to transfer to another reprogram next year but I doubt I’ll get in. Just trying to be patient with life and enjoy the process of learning",
      "author": "yayayayayayagirl",
      "created": 1638426014,
      "upvotes": 3,
      "replies": {
        "hmwhjgc": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwhjgc/",
          "text": "I feel ya. I just had a good ol’ cry because I wished I had faith in myself and applied to the I/O Psych program… I’m grasping at straws to connect my current grad program to my new goals. It’s possible, and I’m 12 credits into the program so I don’t want to drop it and have wasted 20K. Ugh.",
          "author": "anonymousalligator25",
          "created": 1638426095,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmw3012": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw3012/",
      "text": "Just start cold emailing companies you want to intern at even if there is no spot.",
      "author": "Mini_SlyCooper",
      "created": 1638417959,
      "upvotes": 2,
      "replies": {
        "hmw5jjw": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmw5jjw/",
          "text": "Yeah. I’ve been applying to places but I need to do more. I’m waiting on my adhd meds to be approved and I feel absolutely useless",
          "author": "anonymousalligator25",
          "created": 1638419249,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmwmqgz": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwmqgz/",
      "text": "I’ll be turning 25 in a couple of weeks.",
      "author": "MrUnknown1996",
      "created": 1638429727,
      "upvotes": 2,
      "replies": {
        "hmy1780": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmy1780/",
          "text": "Happy birthday lol",
          "author": "anonymousalligator25",
          "created": 1638461058,
          "upvotes": 2,
          "replies": {
            "hmyengi": {
              "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmyengi/",
              "text": "Thanks",
              "author": "MrUnknown1996",
              "created": 1638466251,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmwy5wd": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmwy5wd/",
      "text": "I'm about to turn 26 (just completed my masters degree) and I get that there's a pressure to 'have everything figured out' when you're 25. You're definitely not alone!\n\nHave you tried meeting people who work in the field you want to go into? Does your grad school have connections or alumni that you could reach out to?\nI've personally found that just having informal chats with people (in my dream roles) is super helpful. \nThey can offer insights into how you can make your internship applications better, and tips on what skills to work on. \nI know most people hate networking but I think you have a big advantage maturity-wise (at 25+) when reaching out to people",
      "author": "AvonSulis",
      "created": 1638439132,
      "upvotes": 2,
      "replies": {
        "hmy1cp4": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmy1cp4/",
          "text": "Thank you! I still feel like I’m 21 lol. The pandemic really reverted me to a weird childlike mindset, and missing out on 2 years really made me resent suddenly feeling thrust into adulthood. This is what therapy is for lol",
          "author": "anonymousalligator25",
          "created": 1638461119,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmx39j7": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmx39j7/",
      "text": "Dude I just turned 25 in september and I defended my masters like 2 days ago lmao. 25 is prime grad school age, youre fine",
      "author": "ThePoliteCanadian",
      "created": 1638443378,
      "upvotes": 2,
      "replies": {}
    },
    "hmx7l7r": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmx7l7r/",
      "text": "I so get this. I'm 30 now but I panicked hard about 3 months before I turned 25. I did not care about turning 30 at all haha. I hadn't even started my PhD at that point, I was just finishing my honours year. I had this panic about not having done anything with my life. My partner and I had been saving for a house for a while so I decided that it was time to buy one so that I felt like I had accomplished something before turning 25. \n\nI don't necessarily have any advice regarding finding the right program or the right path but I 100% felt that for the 25 jump and then stopped caring after that haha.",
      "author": "antihero790",
      "created": 1638446587,
      "upvotes": 2,
      "replies": {}
    },
    "hmx86o9": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmx86o9/",
      "text": "Try to stop thinking linearly about basic checkpoints on society’s trend line; it’s boring and predictable in my opinion (i.e., most people are on it and won’t deviate). You’re on an arc of growth, try to figure out how to keep rising upwards.",
      "author": "ForeverRising-",
      "created": 1638446996,
      "upvotes": 2,
      "replies": {}
    },
    "hmxig7s": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmxig7s/",
      "text": "I’m 33 and won’t be done with grad school for another 2 years (3 if I take a leave of absence). I had no idea what I was doing at 25 (prereqs for second bachelors). But trust me, most don’t know what they’re doing. I have a friend who was getting a masters in elementary Ed when she was your age and now does something in a completely different field.",
      "author": "kyokogodai",
      "created": 1638452873,
      "upvotes": 2,
      "replies": {}
    },
    "hmxjhtx": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmxjhtx/",
      "text": "You definitely don’t have to have it figured out at 25.  I’m 31 and applying for grad programs.   When I was 25 I thought I was going to be a lawyer, but I’ve since realized my true passion is psychology.   25 is still pretty young.  You have time to figure it out.",
      "author": "ceeceekay",
      "created": 1638453387,
      "upvotes": 2,
      "replies": {}
    },
    "hmxk62t": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmxk62t/",
      "text": "I think by definition going to grad school is a success in itself. For some perspective, I am almost 30 and only recently finished my undergrad after working in the service industry for 8+ years, didn’t have a drivers license, and failed most of my high school classes, I felt I was doomed to work as a receptionist for the rest of my life. At 25 you’re doing fine, and it’s okay not to have all the answers. Most of the people my age just kind of fall into their jobs, and it’s rarely exactly what you set out to do anyways. You may also change a lot over the next 5-10 years and find you are interested in going a different direction. \n\nThe whole “you need to know what you want to do with your life and have everything figured out by the time you graduate” culture is bullshit and mostly a lie. I’m honestly surprised people go to college so young, considering I would’ve been in a completely different field and likely would’ve hated it if I had gone right after high school. I’m happy with how things turned out and feel my career path now (public health) suits me.\n\nI’m in the camp that young adults should work a bit before going to school. The only reason I got my internships is because I have an extensive work history.",
      "author": "throwmedownthequarry",
      "created": 1638453717,
      "upvotes": 2,
      "replies": {}
    },
    "hmxmvrp": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmxmvrp/",
      "text": "I'm defending next year - I turn 34 this month. I didn't even /start/ college until I turned 25. Don't worry about \"being behind\".",
      "author": "eng2016a",
      "created": 1638454991,
      "upvotes": 2,
      "replies": {}
    },
    "hmy4k5f": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmy4k5f/",
      "text": "I am in a physics PhD program and do computational physics, modelling, and data analysis. I have interned for NASA, the Naval Research Lab, and the Air Force Research Lab, and even held a security clearance as part of one of those internships.\n\nEvery one of those employers who I interned with rejected me at least once prior to actually taking me, and in the case of NASA it was actually \\*four\\* times before they said yes.\n\nAnd that's to say nothing of the employers who turned me down and I never got a yes from at all, including but not limited to: Los Alamos National Lab, Princeton Plasma Physics Lab, Lawrence Livermore National Lab, Fermilab, Brookhaven National Lab, Argonne National Lab, Oak Ridge National Lab, CERN, Columbia Nevis Labs, Sandia national labs, the Army Corps of Engineers, Army Research Lab, CIA, FBI, NSA, NGA, and DHS cyber/data science divisions\n\nDon't beat yourself up because of getting rejections from internships. A lot of time it really is just a perseverance/ numbers game.\n\nAs far as not being in the right program... your degree is not the end of the world. My dad had a career in being a fire investigator before he retired and his job involved a lot of physical forensics, combustion physics, and thermodynamics. He only has a degree in psychology.",
      "author": "DoctorWatchamacallit",
      "created": 1638462386,
      "upvotes": 2,
      "replies": {}
    },
    "hmya41d": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmya41d/",
      "text": "I was in my 30s before I even started college.\n\nYou are doing just fine bud.",
      "author": "Lord_Blackthorn",
      "created": 1638464523,
      "upvotes": 1,
      "replies": {}
    },
    "hmyo0us": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmyo0us/",
      "text": "Just keep applying. You'll get somewhere. 25 is young. But don't do a double masters, that's a horrible idea.",
      "author": "Has_hog",
      "created": 1638469851,
      "upvotes": 1,
      "replies": {
        "hmyo90y": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmyo90y/",
          "text": "I see your point and I really want that for myself, but my grad program is super rigorous and I need to get through it ASAP for health insurance purposes. I had a breakdown when I tried working and part time school and almost failed my classes. And next semester I’m going full time so I don’t see how it’s possible.",
          "author": "anonymousalligator25",
          "created": 1638469938,
          "upvotes": 1,
          "replies": {
            "hmyot8w": {
              "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmyot8w/",
              "text": "Wait I'm confused. You're already pursuing a double masters? Most graduate students work as full time students doing research/teaching, I wouldn't advise anyone to take on part time work at the same time unless you are at the beginning of your program/are slowly collecting data.",
              "author": "Has_hog",
              "created": 1638470155,
              "upvotes": 2,
              "replies": {
                "hmyp4pb": {
                  "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmyp4pb/",
                  "text": "Didn’t you say “get a job dude” and edited it out or was that someone else? Cause that’s what I was responding to lol. Maybe I misread; if so, I apologize.\n\nRight now I’m doing a single masters part time and even then I couldnt also handle a job. Ive been dealing with some mental/physical health issues and overloading myself took a toll. I feel like a loser and like I’m making excuses.\n\nAnyway, Next semester I am going full time. Applied to a ton of summer internships.",
                  "author": "anonymousalligator25",
                  "created": 1638470279,
                  "upvotes": 1,
                  "replies": {
                    "hmyt8w4": {
                      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmyt8w4/",
                      "text": "Yeah I said that initially but only skimmed what you wrote. Reread it and realized I came off as rude so I edited it, my apologies. What I meant is just, don't worry about staying in academia and going for another degree -- especially if it's another masters, yeah keep applying. \n\nInternships are kind of scammy, the ones around me prey on undergraduates/tell new prospects that they need to \"intern\" before they decide to hire them. I don't buy it. To me it sounds like they want to pay me almost nothing while simultaneously forcing me to be dependent on them in the hopes I land a full-time position, sus. From what I have heard, if you are looking at big multinationals -- they post their job offerings at the beginning of the financial year, for some that's January, others that's the end of June. That's the best time to look and apply for full time positions. Good luck to you, don't get too down on yourself, you've gotten this far there's a reason for it, just make sure you complete what you're doing.",
                      "author": "Has_hog",
                      "created": 1638471861,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmy0xwa": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmy0xwa/",
      "text": "I'm 35 and have been languishing ABD in English lit for a few years now. I want and need to finish this damn PhD. After that I'm getting my library science degree, which will be another grad school slog! \n\nIt took me until my 30s to get things in order, and I *still* feel like I'm figuring out a lot of things. The older and more experienced I get, the more I realize that life is all about continually figuring things out, and that you won't magically arrive at some finish line of wisdom. And that's okay!",
      "author": "oodontheloo",
      "created": 1638460951,
      "upvotes": 0,
      "replies": {}
    },
    "hmyzwd8": {
      "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmyzwd8/",
      "text": "this post is honestly toxic. you're in grad school and calling yourself a loser? what kind of precedent are you putting forth? just keep applying to internships, it's not the end of the world",
      "author": "International_Pop524",
      "created": 1638474429,
      "upvotes": 0,
      "replies": {
        "hmz45xv": {
          "link": "/r/GradSchool/comments/r6xepy/im_panicking_over_what_i_want_to_do_with_my_life/hmz45xv/",
          "text": "Ok sorry I guess I’m not allowed to have a grad school quarter life crisis induced panic attack, or be vulnerable in hopes that someone else felt the same way or had an alternate outlook which could help me?",
          "author": "anonymousalligator25",
          "created": 1638476119,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}