{
  "sid": "gqy6c6",
  "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/",
  "title:": "Does anyone feel they are becoming lazy during their PhD?",
  "text": "I started my PhD right after my undergrad and am now half way through. I have been finding it increasingly difficult to work and feel motivated about my research. I keep using lazy \"work arounds\" to avoid having to read or code. I am not sure if I am showing signs of ADHD or if I just in the wrong field. I had these problems throughout my life but never to this extent. There are aspects of the project I enjoy and I do not want to let anyone down by quitting, but I feel like I will get \"found out\" and that I am just wasting my supervisors times as I do not belong in this level.\n\nEdit: Thank you all so much for your advice and kind words! I have put together a timetable to try stick to some structure in my life. I have put regular breaks which are to be used for creative activity or exercise (some with a rule to be away from a screen completely). I hope it will help me to  keep on track. I have also reached out to a university mental health support app. I will continue to learn about impostor syndrome and the ideas you guys have mentioned. Thank you again and I hope this post has helped others feeling this way! ",
  "author": null,
  "created": 1590503718,
  "over_18": false,
  "upvotes": 619,
  "upvote_ratio": 0.99,
  "comments": {
    "fryw3xz": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fryw3xz/",
      "text": "Just finished my third year in the humanities. Unlike many of y’all, I can technically still *do* my research, even the human subjects stuff (thanks social media), I just...don’t. I remember February Me; I had 4 conferences lined up for the summer / fall, two of which were international, and I was happily working full time at my main job and burning the midnight oil for my research. Of course, I spent 10 years training myself to never work from home (and I’d do all my evening work at local coffee shops / bars), which may not have been the best plan. That feels like another world right now, because now I’m laying on the couch for 6+ hours a day eating cheez-its and watching trash-tier anime instead of doing readings. I just finished one of my 48-hour comp exams on my specialty area and I barely cracked the books to take notes. I’ve been getting a solid 1-2 hours of work in on my day job (software eng) a day, much less grad school. I’ve hit the wall to end all walls, and I *still* have to propose my diss. Halp.",
      "author": "Putter_Mayhem",
      "created": 1590579025,
      "upvotes": 3,
      "replies": {}
    },
    "fryly01": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fryly01/",
      "text": "I just finished my first year. I have felt very drained this year even before the quarantine. Miraculously I have managed to get my summer plans sorted so.",
      "author": null,
      "created": 1590569211,
      "upvotes": 1,
      "replies": {}
    },
    "fryavol": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fryavol/",
      "text": "I'm probably a lot worse that most of you right now with literally all my attention devoted to keeping my kids alive and me half-sane, but it feels fantastic to know that others are sharing some of my struggles. Knowing you're not alone is such a long-term mood-booster.",
      "author": "JenBioChem",
      "created": 1590559188,
      "upvotes": 3,
      "replies": {}
    },
    "fry6wvk": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fry6wvk/",
      "text": "Oh god. Its my brain making me feel bad even after. \n\n\nBut for real, often the pressures of a PhD program result in long hidden issues coming to the surface. In my field it is suspected that about 70% of grad students struggle with mental health during grad school. Sometimes it's grad school induced, sometimes grad school triggers something that was always there. \n\nThe key thing is to GET HELP for yourself. Talk to your peers, or an understanding faculty member. You might not be as alone as you expect!",
      "author": "blackygreen",
      "created": 1590556058,
      "upvotes": 2,
      "replies": {}
    },
    "frxohn1": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frxohn1/",
      "text": "So glad it seems to be a shared feeling. I went in all motivated and the mire I learn about academia and research, I become less motivated. I like to describe Academia as a giant “circle jerk” at times.",
      "author": "GrumpyMare",
      "created": 1590544070,
      "upvotes": 2,
      "replies": {}
    },
    "frxk7dt": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frxk7dt/",
      "text": "Try doing an internship. I just started one and it feels like I'm working 3x as much as I was at school but not learning as much. I appreciate the pace of academia now, it gives you the time to really understand things.",
      "author": "CarlFriedrichGauss",
      "created": 1590541585,
      "upvotes": 1,
      "replies": {}
    },
    "frxh3cc": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frxh3cc/",
      "text": "I echo everyone else in the thread that this is totally normal. I was doing very similar things around year 3. Project I want to do around the house? Ehh.. maybe I’ll just show up at the lab at noon. Soccer game I want to watch? Why don’t I just watch that from 3-5pm. Drink too much on a weeknight? Welp, maybe taking 20 minutes to feed cells is enough productivity for one day. \n\n\nImportantly, while everyone has their own vices and distractions, I think this is a somewhat natural cycle, and it’s one of the things that makes a PhD different than any other degree. At the end of the day, you’re only going to finish if you put in the work, and you’re only going to put in the work if you motivate yourself to do so. \n\n\nI started to come to that realization around the end of year 3 / beginning of year 4 when I realized there was no way I wanted to be a 6+ year PhD student (though absolutely no offense meant to those whose path takes that long!), so working backwards from a goal of finishing in ~5 years, I realized I had to get to work because my experiments weren’t going to do themselves. \n\n\nThis all my long winded way of saying, don’t worry about it. Your motivation will come when you start to feel urgency, and that urgency will make you independent. You’ll realize that you don’t need a professor (or anyone else) to tell you what to get done on a given day or in a given week, your productivity will pick up tremendously, you’ll graduate, and then you’ll take this “soft” skill with you for the rest of your life.",
      "author": "General_Beauregard",
      "created": 1590539817,
      "upvotes": 3,
      "replies": {}
    },
    "frxbhxf": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frxbhxf/",
      "text": "I'm in a 5th year slump and you sound like me! Also started my Ph.D. right after undergrad.",
      "author": "FewActinomycetaceae9",
      "created": 1590536659,
      "upvotes": 4,
      "replies": {}
    },
    "frx9lgr": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frx9lgr/",
      "text": "You may very well be living with adhd. Mine manifested itself in a big way after I started grad school 2 years ago. It helps to get a diagnosis and medication like concerta may help too.",
      "author": "nononononobeyonce",
      "created": 1590535611,
      "upvotes": 1,
      "replies": {}
    },
    "frx5idw": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frx5idw/",
      "text": " Currently fourth year. My mantra has been : the best dissertation is a done dissertation. It’s helped with the guilt.",
      "author": "nanon_2",
      "created": 1590533420,
      "upvotes": 5,
      "replies": {}
    },
    "frwzko3": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwzko3/",
      "text": "Are you sure these things aren’t “lazy” workarounds but rather smart things to save time/energy to accomplish the same thing?",
      "author": "marykate216",
      "created": 1590530343,
      "upvotes": 4,
      "replies": {}
    },
    "frwusi3": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwusi3/",
      "text": "Hot take: Maybe you're just getting more efficient at doing what you need to do to get by. Maybe this behavior is a useful filter to help you from taking on extra tasks and overloading yourself. What if you didn't feel guilty about it and trusted your intuition?",
      "author": "CYBER_LIBEL",
      "created": 1590527944,
      "upvotes": 1,
      "replies": {}
    },
    "frwty4t": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwty4t/",
      "text": "Judging my all the comments, you’re not the only one. \n\nI too am feeling the 3rd year slump, as too are many many others. \n\nThe whole situation with covid doesn’t help either. \n\nBut I always tell myself that a PhD is more about grit and determination, as opposed to intellectual ability. And so, it’s _supposed_ to be hard, but not just intellectually, but personally too.",
      "author": "brownbeard123",
      "created": 1590527526,
      "upvotes": 5,
      "replies": {}
    },
    "frwfd9h": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwfd9h/",
      "text": "Yup, I feel this hard. Should be writing my thesis and I'm browsing reddit and then writing 2 sentences before giving up for another 15 minutes.",
      "author": "TheCommieDuck",
      "created": 1590520440,
      "upvotes": 6,
      "replies": {}
    },
    "frwa32q": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwa32q/",
      "text": "In feel really lazy right now because I have no motivation to work from home. I’m just so distracted all the time. \n\nI work so well at school. I hope we get to go back soon 😭",
      "author": "microvan",
      "created": 1590517891,
      "upvotes": 3,
      "replies": {}
    },
    "frvzkx8": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvzkx8/",
      "text": "This definitely isn't unique. When I joined my lab during my first year there was a 5th year and a 3rd year also in my lab and they both told me \"you'll hit a wall\" but of course I was an ambitious (and scared) first year so I was working really hard. \n\nA few months ago I messaged them (they have both graduated but I am close with them) and told them I am so over my independent proposal and have no motivation and one of them responded \"yupp, she has hit her fourth year.\"  I am at the end of my fourth year and just so ready to graduate. \n\nNow I am sure the pandemic isn't helping anyone but, in my experience, and from the experiences of others in my department, losing motivation part way through is pretty common and you just need to power through, and if necessary take a break to help combat burnout.",
      "author": "PaperPhD",
      "created": 1590512922,
      "upvotes": 6,
      "replies": {}
    },
    "frvyd86": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvyd86/",
      "text": "If anything speaks to you from this post it should be the resounding camaraderie of others in this exact same situation. I highly recommend changing your perspective and think about the after grad school portion of life. Look at salaries or jobs that interest you and allow that to motivate you! Granted, this isn't exactly a \"normal\" time for grad school, so just be patient with yourself and give yourself some time to be burned out!",
      "author": "Jtronny",
      "created": 1590512342,
      "upvotes": 5,
      "replies": {}
    },
    "frvxt0a": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvxt0a/",
      "text": "The pandemic probably isn’t helping. Reevaluate when social distancing ain’t a thing",
      "author": "isaac-get-the-golem",
      "created": 1590512073,
      "upvotes": 3,
      "replies": {}
    },
    "frvwvqk": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvwvqk/",
      "text": "Don't forget, burnout is a thing... a thing that occurs when you've worked hard for a years upon years.",
      "author": "oddddoge",
      "created": 1590511632,
      "upvotes": 3,
      "replies": {}
    },
    "frvwfo2": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvwfo2/",
      "text": "The pandemic has made me feel like that, my productivity is TERRIBLE, but so far on the outside things seem normal to everyone else. So maybe it's just impostor syndrome creeping in",
      "author": "NotTheAndesMountains",
      "created": 1590511418,
      "upvotes": 3,
      "replies": {}
    },
    "frvv5am": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvv5am/",
      "text": "This entire pandemic has tanked my productivity.  I’m trying to manage my stress, my research projects, and my family, and one of the first things to go was my research.  I think everyone will understand if you’re not as productive during this time but it will be important to find ways to make small changes and small progressive steps towards completing your degree.\n\nI know, I didn’t complete my undergrad properly.  I went, flunked out, came back years later and finished.  Afterwards, I went directly to a MSc then directly into a PhD with about a week vacation between.  I’ve been in school now for ~10 years straight.",
      "author": "fiesta_sqrd",
      "created": 1590510798,
      "upvotes": 27,
      "replies": {}
    },
    "frvuxk2": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvuxk2/",
      "text": "Lol this is me but I’m quitting at the end of this quarter",
      "author": "karlymoon999",
      "created": 1590510695,
      "upvotes": 2,
      "replies": {}
    },
    "frvtsz4": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvtsz4/",
      "text": "I think everyone feels like this sometimes, I know I certainly do. Do you get feedback from your supervisor often? I tend to be hard on myself about how much work I get done or how lazy I feel, but the truth is we're always going to be harder on ourselves than others will. If you're meeting the goals and expectations set out for you then I wouldn't call you lazy. Sometimes you just have to do enough. \n\n&#x200B;\n\nA few others have mentioned taking a break. I write as a hobby and have recently started learning vector art. I find that project-oriented hobbies give me a goal to work towards on my days off that lets me still feel productive in something not work related. Maybe you could take a day off with a set goal like reading that book that's been sitting on your shelf, or getting some old friends together for a zoom call.",
      "author": "InNeedOfGoats",
      "created": 1590510151,
      "upvotes": 5,
      "replies": {
        "fs43ibr": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fs43ibr/",
          "text": "My supervisor has been very reasonable and understanding to these things in the past. However, he also expects a lot from his students and I find this intimidating. He and my research team have achieved a lot and I really feel like I don't measure up. \n\nThat's good advice, I have started writing a D&D campaign for me and my friends and painting. It has helped to have productive breaks by working on these",
          "author": null,
          "created": 1590689382,
          "upvotes": 2,
          "replies": {
            "fs45lnl": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fs45lnl/",
              "text": "That's an understandable feeling. I like to frame it as my supervisor has a lot more experience than me, so if he feels I'm meeting expectations then I probably am. It's important to remember that different projects move at different paces as well. \n\nD&D is a great hobby. Having a group that I can meet virtually on a regular basis has been a huge help to me during quarantine.",
              "author": "InNeedOfGoats",
              "created": 1590690374,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "frvsdnf": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvsdnf/",
      "text": "It's important to learn what corners you can cut to save time and energy. It's a skill you'll use for the rest of your life!",
      "author": "JerkJenkins",
      "created": 1590509451,
      "upvotes": 13,
      "replies": {
        "frwarcn": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwarcn/",
          "text": "I can it for the life of me seem to do this. Writing takes me sooooo long.",
          "author": "griddigus",
          "created": 1590518219,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "frvrhzb": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvrhzb/",
      "text": "Are you me?",
      "author": "Dr-dumb",
      "created": 1590509021,
      "upvotes": 9,
      "replies": {}
    },
    "frvqsyf": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvqsyf/",
      "text": "I'm afraid I'll have trouble getting through a PhD and your post read future-me's mind. I have no idea if I should go straight for PhD or do a master's first, I want to be a professor, but man, shit looks hard.",
      "author": "FurretsOotersMinks",
      "created": 1590508686,
      "upvotes": 6,
      "replies": {
        "fs43t8j": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fs43t8j/",
          "text": "Hold on to a goal, find a project you will be happy to do for 4 years, and most important (in my opinion) find a team who will get you through it. If you don't have a support group it will be very hard to get through",
          "author": null,
          "created": 1590689525,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "frvpjs9": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvpjs9/",
      "text": "Definitely experiencing a similar feeling on my end, especially when I compare myself to my non-academic habits when I worked in industry.",
      "author": "redlizard3",
      "created": 1590508068,
      "upvotes": 2,
      "replies": {}
    },
    "frvpgay": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvpgay/",
      "text": "Seeing my own thoughts posted to Reddit? This is wrinkling my brain!",
      "author": "thattiredgradstudent",
      "created": 1590508020,
      "upvotes": 9,
      "replies": {}
    },
    "frvp5jx": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvp5jx/",
      "text": "Maybe you're getting a little fatigued, try taking a week or 2 off (with your PI's permission of course) to give yourself a mental break!\n\nI feel for you. Just finished my first year, but because of COVID-19 my rotations are on pause and I can't commit to a lab right now even though this would be the point in time where I would choose. Classes are over and I literally have nothing to do lol",
      "author": "JHDog93",
      "created": 1590507871,
      "upvotes": 17,
      "replies": {
        "frwmzsi": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwmzsi/",
          "text": "I’m in the same boat as you, I feel so guilty cuz I think I should be doing something but I don’t know what!",
          "author": "kim448",
          "created": 1590524132,
          "upvotes": 3,
          "replies": {}
        },
        "fs42y0o": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fs42y0o/",
          "text": "I have taken time off in the past for a family emergency but I now feel guilty if I take more. Especially as everyone else seems to be getting on. I think it would be a good idea though",
          "author": null,
          "created": 1590689113,
          "upvotes": 1,
          "replies": {
            "fs4k424": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fs4k424/",
              "text": "Leaving for a family emergency is different than taking a vacation and giving yourself a mental break. If you feel bad, maybe take a three or four day weekend (friday and monday) so your only taking 2 days off but you'll be off for 4 days straight and have 2 shorten weeks!",
              "author": "JHDog93",
              "created": 1590697264,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "frvnsqs": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvnsqs/",
      "text": "OP stop reading my mind please, it's not funny.",
      "author": "kostismv",
      "created": 1590507187,
      "upvotes": 76,
      "replies": {}
    },
    "frvmkbf": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvmkbf/",
      "text": "Oh no. My thoughts can post on reddit.",
      "author": "RustyGrad",
      "created": 1590506558,
      "upvotes": 468,
      "replies": {
        "frwjepb": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwjepb/",
          "text": "Oh god, I've been cloned.",
          "author": "mabelbae",
          "created": 1590522387,
          "upvotes": 63,
          "replies": {
            "frwx4fx": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwx4fx/",
              "text": "The clones are self aware!",
              "author": "Lord_Blackthorn",
              "created": 1590529111,
              "upvotes": 31,
              "replies": {
                "frx8kxh": {
                  "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frx8kxh/",
                  "text": "Sooo relieved I’m not alone in this!! Was just talking to my ex like how did I work so hard then and why am I such a bum now??!?! If anyone can answer this you will have my eternal gratitude",
                  "author": "ellaAir",
                  "created": 1590535062,
                  "upvotes": 18,
                  "replies": {
                    "frxabck": {
                      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frxabck/",
                      "text": "It really is a beating.. And your risking a great deal to pursue it.",
                      "author": "Lord_Blackthorn",
                      "created": 1590536004,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "frxr6mr": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frxr6mr/",
          "text": ">My thoughts can post on reddit.\n\nIf you find out how this happened, maybe you'll get a high-impact paper out of it!",
          "author": "_glitchmodulator_",
          "created": 1590545672,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "frvmck9": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvmck9/",
      "text": "It sounds like you’ve got a bit of burnout and some imposter syndrome going on. \n\nWhat helps me with burnout is to take a day that’s just for me. I do what I want, but I try to indulge in hobbies that are productive (e.g. baking) and make sure I take time for self-care. I don’t think about work, or research, or anything else but what I’m doing and exercise mindfulness. \n\nNot feeling like you belong? Like you’re not doing enough to justify you being in your PhD program? That’s Imposter syndrome. I think everyone who isn’t completely full of themselves feels that way sometimes. We think we’re just doing a really good job of keeping up a charade and hoping no one pays attention to the person behind the curtain. Please know that’s not the case, and you’re not alone in that feeling.",
      "author": "rudepaladin",
      "created": 1590506448,
      "upvotes": 80,
      "replies": {
        "frvosk7": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvosk7/",
          "text": "I think I see a day off as wasted time and am filled with guilt when I don't work, which makes me avoid work more. I will try to use the a day for deliberate self care and hobbies and not just procrastination. Thank you for the reassurance",
          "author": null,
          "created": 1590507691,
          "upvotes": 65,
          "replies": {
            "frvphl5": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvphl5/",
              "text": "Having a day off is beneficial to your mental health. If nothing else, set your “work” for the day to relax or make a to-do list of things like “watch my favorite show” or something along those lines. It can help you feel productive while still practicing self-care.",
              "author": "snakesareracist",
              "created": 1590508038,
              "upvotes": 27,
              "replies": {}
            },
            "frvq69a": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvq69a/",
              "text": "I used to feel the same way, and I hope deliberate mindfulness and self-care helps you as much as it has helped me. That’s not to say I never feel that way any more, but I can at least recognize when I’m being unreasonable with myself or that I just need a break when I’m not being productive. It sounds odd, a break when you just need to get something done, but guilting yourself only harms you.\n\nCounseling has helped me in this regard. Somehow, another person giving me “permission” to not work and to take time for myself allowed me to do so, because I couldn’t do it for myself. I’m firmly of the opinion that while not everyone needs counseling, everyone can benefit.\n\nGood luck, and take care.\n\nOh, one last thing that helped me: mindfulness of the demands we place on ourselves. My counselor pointed out that, at my worst points, I used a lot of “I have/need/should have [done] X”. Stopping myself when I start to use that language, internally or talking with others, and force myself to rephrase (“I want to get X done”) or challenge myself (do I really *need* to do that, and do so *right now*?) helps with the guilt from not working. If it genuinely is something that is due immediately, I take a minute to center myself, then get to work and immediately take time for myself when I’m done.",
              "author": "rudepaladin",
              "created": 1590508374,
              "upvotes": 19,
              "replies": {}
            },
            "frwucev": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwucev/",
              "text": "I think the critical part of taking time off is that it is a planned break. If you never plan any breaks for yourself, you’ll end up taking them anyway and kicking yourself for procrastinating. This was a big part of my burnout",
              "author": "LetThereBeNick",
              "created": 1590527726,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "frvmafu": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvmafu/",
      "text": "They call it the third-year slump for a reason. You definitely aren’t alone!\nI’m almost finished with my third year and I’ve been feeling the same way for a few months now. \n\nDoesn’t help that I’m a biology PhD student and I’m not able to be in the lab full time like I normally would be, with quarantine the past couple of months.",
      "author": "overthinkitover",
      "created": 1590506418,
      "upvotes": 183,
      "replies": {
        "frvp8e4": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvp8e4/",
          "text": "I have found the quarantine to be difficult as I am away from my lab work. The practical work was the only part I enjoyed so it is understandable to miss it. However, I feel ashamed that I am not using this time to work on the areas I am not good and and improve myself. It seems everyone in my group is just getting on as normal. I hope you are able to get to your lab soon",
          "author": null,
          "created": 1590507911,
          "upvotes": 69,
          "replies": {
            "frwby74": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwby74/",
              "text": "You are seeing their highlights, not their reality.  No one is getting on as normal, but everyone is still trying to make progress. \n\nTry to reframe what you are doing:\n\n* If all you do is read a single paper (<4 pages) a day or review paper (7+) in a week, you are making very good progress. \n* If you set up a citation manager, that's progress. \n* If you doodle something in your lab notebook related to your work (like a glassware set up or and organelle), you've made progress. \n* If you set up a professional academic twitter account or a linked in account, that's progress.\n* If you take a good look at things like Skype a Scientist and consider what you have to offer as a Scientist, that's progress.\n\nAs for me, I'm sitting in on virtual seminars twice a week and mostly just trying to actually think critically about my field and what's out there. It's low effort and I'm learning about areas of my field I've never really considered before.",
              "author": "_perpetual_student_",
              "created": 1590518796,
              "upvotes": 60,
              "replies": {}
            }
          }
        },
        "frvu1pk": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvu1pk/",
          "text": "Having never heard that phrase, I just finished my third year, and it perfectly describes how I am feeling at the moment. Being locked out of my lab and working in the bedroom of a one-room apartment for the past two months aren’t helping either.",
          "author": null,
          "created": 1590510267,
          "upvotes": 42,
          "replies": {
            "frvyno9": {
              "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvyno9/",
              "text": "I spent a couple months feeling so lazy and guilty for being so unmotivated before I finally fessed up to my advisor about how I was feeling.  He’s the one who told me about it! I felt so validated, it’s a common struggle apparently.",
              "author": "overthinkitover",
              "created": 1590512483,
              "upvotes": 15,
              "replies": {}
            }
          }
        },
        "frx7amw": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frx7amw/",
          "text": "I’m in the same boat—finishing my third year as a biology PhD student. It doesn’t help that my PI went from a saint in the interview process to a complete unpredictable nightmare when I started. Quarantine returned me to a level of lower anxiety that I thought I would never achieve again. I felt like I remembered who I was before and actually enjoyed life again instead of feeling unbearable stress, exhaustion, and resentment from the moment I woke up until I went to bed. Our lab is reopening June 1st and I’m sincerely mourning the loss of this time. It’s making me question (more than usual) what I should do and if I should even be here. Because of this time, I think I want to work from home a majority of the time and I want a job that I don’t have to think about once the work is done. I don’t know if any jobs like that exist that will also allow me to afford to live AND pay off student loans. I think I’m having an existential crisis. What is the point of anything? What are you going to do when you’re done with your degree?",
          "author": "makeeveryonehappy",
          "created": 1590534370,
          "upvotes": 16,
          "replies": {}
        },
        "frvyfcg": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvyfcg/",
          "text": "What if it has been a constant 5 year long slump? *burries head in hand*",
          "author": "AnthroPluto",
          "created": 1590512370,
          "upvotes": 28,
          "replies": {}
        },
        "frx9260": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frx9260/",
          "text": "Is this a thing?! Thank fuck, cos since I came back from data collection I have really not had the motivation to do aaaanything. I need to snap out of it asap",
          "author": "sexy_bellsprout",
          "created": 1590535320,
          "upvotes": 3,
          "replies": {}
        },
        "frwssni": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwssni/",
          "text": "I felt it in my undergrad, and I feel it now in my Masters degree.",
          "author": null,
          "created": 1590526956,
          "upvotes": 2,
          "replies": {}
        },
        "frx8r4r": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frx8r4r/",
          "text": "Sammmmmmeeee",
          "author": "ellaAir",
          "created": 1590535155,
          "upvotes": 1,
          "replies": {}
        },
        "fry40m2": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/fry40m2/",
          "text": "Is there such thing for second-year too?? :/",
          "author": "chaos_66",
          "created": 1590553937,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "frvma7q": {
      "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frvma7q/",
      "text": "Stop putting my business out on the street like this.",
      "author": "quaglady",
      "created": 1590506414,
      "upvotes": 372,
      "replies": {
        "frwah7r": {
          "link": "/r/GradSchool/comments/gqy6c6/does_anyone_feel_they_are_becoming_lazy_during/frwah7r/",
          "text": "I'm not procrastinating on Reddit to be attacked like this",
          "author": "RaggedAngel",
          "created": 1590518081,
          "upvotes": 60,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064835
}