{
  "sid": "pof3d8",
  "link": "/r/GradSchool/comments/pof3d8/feeling_a_bit_overwhelmed_in_grad_school/",
  "title:": "Feeling a bit overwhelmed in Grad School",
  "text": "Basically the title.\n\nSo i just started my masters last week and I feel overwhelmed. I feel like my supervisor picked a wrong person to be part of his lab:( \n\nI tend to feel dumb sometimes whenever I ask my labmates questions.\n\nHow do you get this feeling over with?",
  "author": "sturdyalligator",
  "created": 1631665195,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hcx3y4v": {
      "link": "/r/GradSchool/comments/pof3d8/feeling_a_bit_overwhelmed_in_grad_school/hcx3y4v/",
      "text": "I’ve learned not to worry about asking seemingly dumb questions or too many questions, thus making me appear dumb. Even if my classmates think I’m dumb for this (which I doubt) who tf cares?! As long as I get the answer I’m looking for, I don’t give a crap what people think about me. Better to ask and be sure then to ever guess or make your life harder!!",
      "author": "lc1138",
      "created": 1631685431,
      "upvotes": 1,
      "replies": {}
    },
    "hcw4upk": {
      "link": "/r/GradSchool/comments/pof3d8/feeling_a_bit_overwhelmed_in_grad_school/hcw4upk/",
      "text": "It's imposter syndrome. I promise everyone in academia (including profs) feels that way. When imposter syndrome hits me hard I try to remember what my supervisor told me that grad school is competitive and they have a great selection system which guarantees if you made it you're good enough to be there. It wasn't a mistake and you're not fooling anyone. All the experiences listed in your CV are proof that you deserve to be there. \n\nI'm more then confident that you're not asking dumb questions and your lab mates are more then happy to answer. I love it when first years reach out to me and ask me questions because I'm very passionate about helping others and I'm grateful that they felt like they can trust me to open up. If you're worried anything's a dumb question - think about a year from now when a new student reaches out and askes you some of the same questions? Will you be annoyed/think they are dumb?",
      "author": "psychmajor95",
      "created": 1631666794,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634066351
}