{
  "sid": "r6urv8",
  "link": "/r/GradSchool/comments/r6urv8/anyone_here_published_their_dissertation/",
  "title:": "Anyone here published their dissertation?",
  "text": "**Warning**: huge rant incoming\n\nHi there, does anyone here know if there are any journals where you can choose to publish your dissertation or piece of work open source? Have any of you done this? I am mainly looking to publish work I've done as part of a dissertation for which I have come up with all the research, performed the research and written up my dissertation all by myself. I literally had no help or guidance from anyone because my supervisor decided to not want to speak to me for the entire year I was trying to do my research (only time I spoke to her was at the beginning where she said I could work in a vague group).\n\nI was meant to work as part of a \"team\" but everyone ignored me and would make me work on stuff they needed for their own research and I was told to come up with my own ideas and do something on my own. So I painstakingly did this, I am not exaggerating when I say that I spent more than 14 hours in the lab for about 7 months non stop. I am truly not making this up one bit (I even complained about my supervisor not helping me but I was ignored as the people I complained to are quite close with the supervisor and everyone seems to be friends here).\n\nI received the top mark on my dissertation and all the sudden everyone wants to write a paper on my work and there's about 7 people who are on this paper. People are asking for my data, files and trying to do the exact same graphs from my dissertation themselves. I've tried discussing how this is my work but there is absolutely no way I can get through to them. I was even actively discouraged and was laughed at when I mentioned what ideas I had, some people told me it'd be too much work and I can't possibly do it. But I did it, and now everyone wants credit.\n\nI am so depressed and anxious because of this and honestly they keep bringing up this paper and copying my dissertation (chunks of writing and all my figures/tables) and pasting it into a paper format and sometimes re-worded poorly (I love academic writing and I'm a huge perfectionist and this bugs me so much). I said I wanted to write the paper on my own and I was ignored for weeks until now everyone all the sudden is writing it and I was kept out of the loop. They said I can have first authorship shared with someone else - who had NEVER helped me or even talked to me, but apparently she's doing the same data analysis that I did on my data and that grants her equal authorship.\n\nI fell ill because of how hard I worked on this project and now it's being written in ways I do not agree with, people keep asking me what a certain analytical method is and method of analyzing the data is (this is a novel method that I spent weeks trying to figure out and adapt to my data, it involves a lot of mathematics and statistics which people have flat out told me they don't understand). I feel absolutely betrayed, when I begged people for help no one wanted to help me, I was laughed at and made to work on other things. Now because I got a good grade and my idea worked everyone wants to be a part of it. I am absolutely devastated, I tried to bring this up with people and I get ignored. There is absolutely nothing I can do, my supervisor is ignoring me and asking other ppl to \"help\" me publish the paper I have.\n\nAs a result, I truly feel the only way I can get some ounce of ownership over my work is to publish my dissertation open source. I truly feel that my research is worth sharing with the world and I poured my heart and soul into something that has literally cost me so much of my mental health. Does anyone know anything about publishing in an open source journal? Would it cause problems if parts of my dissertation already shared will pop up in a published paper later down the line? There is absolutely no way I can talk shit about these people, one of them is a research assistant, others are research fellows etc. They have too big of a standing, everyone knows each other and are friends, I have tried to talk to people, get advice, but there is absolutely no way I can stop them from stealing my work and putting their name on it. I'd like to also clarify that I was under no scholarship for this and I paid my way in order to study and do my dissertation.\n\nI absolutely loved science, but this experience has beaten me down so much that I will never go back to it. If anyone has any info on journals or ways to publish your own research, even just as a way to have some sort of proof out there that this is my intellectual property for my own peace of mind, it'd be much appreciated!\n\nTIA",
  "author": "S-u-n-f-l-w-r-s",
  "created": 1638407443,
  "updated": 1638481116,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmxb20z": {
      "link": "/r/GradSchool/comments/r6urv8/anyone_here_published_their_dissertation/hmxb20z/",
      "text": "Saw your post on /r/AskAcademia also.\n\nBasically I would put your dissertation on a preprint repository such as Arxiv for the sciences or SSRN for the humanities/social sciences. This will be your work for public consumption. It will not be \"published\" in the academic sense, but it will be in the public domain as \"gray literature\".\n\nI believe this will be a much better interim solution rather than re-writing your dissertation for journal publication, as article manuscripts are completely different to dissertations with their succinctness.",
      "author": "MFA_Nay",
      "created": 1638448832,
      "upvotes": 4,
      "replies": {}
    }
  }
}