{
  "sid": "q0tyde",
  "link": "/r/GradSchool/comments/q0tyde/talk_about_fear/",
  "title:": "Talk about fear?",
  "text": "This semester is my third semester of my master’s program. And now we are in the sixth week, yet I’m behind and late with my work. I distract myself with walking and listening to music/podcasts or Netflixing something ALL the time, but the moment i slow down and have a quiet moment and connect a bit with myself i realize that I’m SCARED to do anything and it is not pretty, I’m tired of running away yet I have no energy to focus on my work and actually do something. \n\nI feel like a loser, I feel like I’m failing. I feel like fear is holding me back. \nI want a day where i get things done then go to sleep feeling good about myself. I miss going to sleep in peace :( \n\nI don’t know if this is the right place to write about this but i need to get this out of my head and i need some advice on what to do next :( \n\nI feel so awful. I don’t want to say to myself that academia isn’t for me but maybe it’s true.",
  "author": "NadaKD",
  "created": 1633305570,
  "updated": 1634603831,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 0.93,
  "comments": {
    "hfb5s64": {
      "link": "/r/GradSchool/comments/q0tyde/talk_about_fear/hfb5s64/",
      "text": "I can relate to this! \n\nWhat helped me a lot is compartmentalizing my tasks. What I mean by this is fully putting your energy and attention to that one task you are doing. Set a timer if it helps so you know that for x amount of hours or minutes you are just doing that one task. Fully embody this role! If you’re focusing on writing, for instance, then believe that you are the most badasss writer out there and that your ideas are worthy! As they say fake it until you make it. 😬\n\nUsually, when I can’t seem to start my work because my anxiety kicks in or I’m facing some mental breakdown that I don’t know of, I try to bring myself to a peaceful state. I make things simple by focusing on that one task for that set time I planned myself to commit to. Take each task as an increment. You don’t have to finish EVERYTHING in one sitting. Finish a portion of that task, take a break and fully disengage yourself from the task you were working on, then continue again with the task (again fully embody it), repeat the cycle until you get the task done. \n\nYou are not a failure, my friend! Mental breakdowns happen when you push yourself to your limit. You taking the time to understand what you’re going through is necessary for growth. You are not a failure, you are learning to grow. I believe that there is growth through this pain because there is! \n\nTake care!\n\nAnd I hope this helps you in some way!",
      "author": "Oniko_2009",
      "created": 1633317576,
      "upvotes": 6,
      "replies": {
        "hglm81p": {
          "link": "/r/GradSchool/comments/q0tyde/talk_about_fear/hglm81p/",
          "text": "Thank you. That helped.",
          "author": "NadaKD",
          "created": 1634211979,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfd3xwu": {
      "link": "/r/GradSchool/comments/q0tyde/talk_about_fear/hfd3xwu/",
      "text": "This burn out feeling is very common. Keep in mind that things that are important, not necessarily are the most interesting (in short term), but they should be done.\n\nThis is what I do. I get a nice notebook, and pen, and I write down a list of tasks that should be done. Usually I split them in mini tasks, and I cross them as soon are completed. Somehow, I see progress in what I do.",
      "author": "wanabean",
      "created": 1633363231,
      "upvotes": 2,
      "replies": {
        "hglm8qw": {
          "link": "/r/GradSchool/comments/q0tyde/talk_about_fear/hglm8qw/",
          "text": "Thank you.",
          "author": "NadaKD",
          "created": 1634211991,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}