{
  "sid": "qh4mv7",
  "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/",
  "title:": "Feeling lonely and overwhelmed",
  "text": "I’m having the hardest time ever. School is so so busy. Between my house chores/cooking/cleaning, courses, work, and my thesis stuff I’m feeling like I’ve been stretched out thin. Somehow I’ve managed to do decent these first two months but god. I feel so alone. I miss my family and my SO (they’re in a different city kinda far away). They can’t visit cause of covid ( I’m in res) and I can’t visit cause of my in person classes. \n\nWhen I’m busy I’m fine. I just go on about my day… go into autopilot mode and work. But the second I get a chance to think about them that’s it. I’m done. I can’t focus on anything. \n\nIt straight up ruins a couple days for me… I go into this horrible loop where I get lonely, don’t do anything cause I can’t focus, feel bad about not doing anything, then feel lonelier cause there’s no one to hug, be intimate with, and share my feelings with.\n\nIdk what to do anymore. My roommates are extremely introverted and are mostly in their rooms.. It’s basically like I’m living alone. Some days I go without even seeing them.\n\nHelp.",
  "author": "fwds",
  "created": 1635363297,
  "updated": 1636202157,
  "over_18": false,
  "upvotes": 61,
  "upvote_ratio": 0.98,
  "comments": {
    "hiaetf2": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hiaetf2/",
      "text": "Does your school offer counseling? If they do I would highly recommend going to them.",
      "author": "SnowflakesFlame",
      "created": 1635364453,
      "upvotes": 15,
      "replies": {
        "hiafbul": {
          "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hiafbul/",
          "text": "Idk what else they would tell me to do other than going out for walks/getting air/ working out/ creating a schedule for myself/ writing my feelings down…. Alll things I already do.",
          "author": "fwds",
          "created": 1635364651,
          "upvotes": 6,
          "replies": {
            "hiag9wu": {
              "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hiag9wu/",
              "text": "They’d listen to you and help guide you through what you’re dealing with. This is a lot of stress, and it can be very helpful to navigate it with an expert.",
              "author": "StringOfLights",
              "created": 1635365012,
              "upvotes": 14,
              "replies": {}
            },
            "hiafm6e": {
              "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hiafm6e/",
              "text": "At minimum they give you a space to talk to someone. Who is trained to listen and help you work through hard times like this. Honestly it couldn't hurt to give it a try.",
              "author": "SnowflakesFlame",
              "created": 1635364759,
              "upvotes": 9,
              "replies": {}
            },
            "hiaft76": {
              "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hiaft76/",
              "text": "I personally use my university's counseling services. Idk if I'd be in as good of a place right now if I chose not to.",
              "author": "SnowflakesFlame",
              "created": 1635364833,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hibn0ab": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hibn0ab/",
      "text": "I felt similarly when I first entered my grad program. I tried going to counseling because I felt alone and was worried I wasn't making friends with my cohort. While something I'd always recommend, it didn't really help me. It took some time but eventually I got into a routine and made some friends that I could make plans with which made me feel like I had people near me to share my life with. I also made time to try exploring my new city some more (hard to do with work and covid for sure). If you're new to your program, chances are others are feeling similar and that could be a good opportunity to connect.",
      "author": "seaside1508",
      "created": 1635382940,
      "upvotes": 6,
      "replies": {
        "hibn8vr": {
          "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hibn8vr/",
          "text": "Yeah. I’ve been doing that. Thankfully I have my car so sometimes I just drive around mindlessly trying to explore ( not much cause it’s a small university town)..\n\nThe other day I also tried to talk to my other friend who is in my program about this stuff. She just said she watches Netflix and deals with it. Idk why it’s effecting me so much",
          "author": "fwds",
          "created": 1635383048,
          "upvotes": 8,
          "replies": {
            "hibp3nm": {
              "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hibp3nm/",
              "text": "I think the world is difficult and stressful (more than usual) right now, so that probably exacerbates your feelings too. I think your feelings are valid and natural. It helped me to start trying to carve out a more independent life, develop some routine, some habits, some objectives that connected me to the place I was and people I was around. I think thats different for each person. It'll be ok and things will get better. Be sure to keep reaching out to others",
              "author": "seaside1508",
              "created": 1635383877,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hibimbi": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hibimbi/",
      "text": "Sound like me lol",
      "author": "nimBROS",
      "created": 1635381016,
      "upvotes": 4,
      "replies": {}
    },
    "hic0vzh": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hic0vzh/",
      "text": "I'm in the same boat. Remember that we're still in a pandemic. Working from home, especially as a grad student where you're your own boss, is tough. I'm not sure about your living circumstances, but I'm in a one bedroom, so I feel like I can't \"turn off\" from work. You seem to be doing all the right things - exercise, cooking, cleaning, etc. It's hard to balance it all. My guess is you, like most of us grad students, have high expectations of ourselves, and put more pressure on ourselves than needed. Just like any other job, you're allowed to take some time off. \n\nAs for loneliness, I'd have to agree. Even in the best of times, grad school is hard because we're largely doing our own thing. I think with Covid in the mix, and social media distracting us from actually getting together in person with each other, that we've been further isolating from each other and almost have forgotten to be social. I'm very introverted, but I still feel like I'm lacking the social connection. \n\nIt sounds cliché, but try and get involved in something outside of your school/home. Soccer, a running club, a book club...anything. I find that quickly opens doors to other people and interests, and at least for me, it gets me out of my head and going down the spiral of thinking too much about school, loneliness, etc.\n\nHang in there. \"This too shall pass\" as the saying goes.",
      "author": "GoodOleJimmy",
      "created": 1635389148,
      "upvotes": 3,
      "replies": {}
    },
    "hicn7rn": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hicn7rn/",
      "text": "You're not alone <3",
      "author": "fireflysz",
      "created": 1635402444,
      "upvotes": 3,
      "replies": {}
    },
    "hicmx7q": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hicmx7q/",
      "text": "As a new grad student, I feel the same way. Can't connect with anyone around me, everyone I know is in a different country..it's difficult to navigate all the stress alone.",
      "author": "rainbow-cake9950",
      "created": 1635402217,
      "upvotes": 2,
      "replies": {}
    },
    "hicwvia": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hicwvia/",
      "text": "Hey I am in the same boat. Maybe we can do something v",
      "author": "Wild_Sir8813",
      "created": 1635410526,
      "upvotes": 2,
      "replies": {}
    },
    "hidix32": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hidix32/",
      "text": "I struggle with the same feelings and thought loops that you described. It’s really hard. Sending a hug",
      "author": "jemma3316",
      "created": 1635425875,
      "upvotes": 2,
      "replies": {}
    },
    "hihsmqc": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hihsmqc/",
      "text": "I just graduated from my grad program. I had plenty of times feeling like this unfortunately. For me it was always surprising how nice the people in my grad program where when I reached out. You’re definitely not alone",
      "author": "sunshine6942o",
      "created": 1635501485,
      "upvotes": 1,
      "replies": {}
    },
    "hir1vm0": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hir1vm0/",
      "text": "Me too. I live on a farm in rural Kentucky and do proofs/programming for work. My significant other is a workaholic and I’m not close with my parents. It was pretty lonely, but I got a PS4 and socialize through that platform. Made a lot of friends. Made it better.",
      "author": "blossomsofblood",
      "created": 1635677513,
      "upvotes": 1,
      "replies": {}
    },
    "hj20mcl": {
      "link": "/r/GradSchool/comments/qh4mv7/feeling_lonely_and_overwhelmed/hj20mcl/",
      "text": "Sometimes you just gotta embrace the good that comes with these phases! Really gives you a chance to figure out you! Wish you the best and things always get better :)",
      "author": "GrizzlyAccountant",
      "created": 1635884361,
      "upvotes": 1,
      "replies": {}
    }
  }
}