{
  "sid": "r5pocn",
  "link": "/r/GradSchool/comments/r5pocn/taking_too_long_with_lor/",
  "title:": "Taking too long with LOR",
  "text": "A few weeks ago, I submitted my MPH applications through SOPHAS. Everything has been sent in but literally the only thing that’s holding me up are two letters of recommendations. My former professor gave a rather speedy response and sent hers in the SAME DAY I requested it…so why is it so hard for the other two? I understand that they are busy, but surely writing a one page letter about a former student shouldn’t take up that much of their time, right? With the deadline being January 15th for all programs across the board, on top of it taking up to two weeks for my application to be processed before it’s even reviewed by the schools, I’m beginning to get irritated by how long they’re taking. I’ve emailed them multiple times already. One said they would have it sent out before thanksgiving, the other said before December 15th. I reached out to the one that hasn’t sent theirs out before thanksgiving let alone now, and I’m just giving the other one until December 15th before I reach out again. I don’t think it’s crazy of me to have everything done before Christmas. Or even better, preferably the first week of December, which is literally tomorrow. \nAm I overreacting? Does anyone else get a twinge of anxiety when they’re forced to wait a perpetual amount of time on letters of recommendation requests they sent out months ago?\n\nEDIT: they just got back to me! One sent theirs today and the other said they will finish theirs december 15th the latest! Thank you for the reasonable responses! Haha this is such a stressful time…",
  "author": "Acruxicon",
  "created": 1638286005,
  "updated": 1638481165,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmopc2g": {
      "link": "/r/GradSchool/comments/r5pocn/taking_too_long_with_lor/hmopc2g/",
      "text": "It actually takes a great deal of time to write a first letter of recommendation for a student, esp. for graduate programs. A letter of recommendation is actually an argument on your behalf. In the US, there is an unwritten rule that short ones that don't go into detail are actually perfunctory letters that show faint praise. This fact means that faculty have to put a great deal of effort to go above that baseline (which is actually a subtle non-recommendation). \n\nSo faculty might re-read old material that you've submitted to find something to talk about, link together different work you did with your CV to showcase a narrative of potential, or look at your performance in the class in comparison with others. (For example, \"Student x earned an A in my course. While these are likely common on all college transcripts, given grade inflation, it's important to know that I only gave 3 A's in this class of 55 students. Student x had the highest grade. In fact, Student X's performance in this class was in the top 5 students of the 400 students that have taken this course in the last 3 years.\") This is the best kind of letter. They are time consuming. \n\nLike anyone, profs have dozens of deadlines to hit and likely re-prioritize all of these letters based on their deadlines. Faculty know that these applications get collected until the final date and then compiled and moved to the selection committees. Also, this is the season, so your faculty member that is slower might not have one rec, but rather 10 to submit.  So while you may have asked for a letter weeks/months ago, the faculty member is being bombarded daily with breathless emails asking for letters whose due dates come before yours. Those due dates are the priority for the faculty member, not the completion of your letter by a deadline that's sooner than the actual application deadline (I hope I'm reading your concern accurately -- I'm reading that you want all your materials in by your own deadline \\[understandable: \"Whew -- that is done and everything is in early/ontime\"\\] while the actual institution deadline is a bit farther away.) Your faculty member, racing to complete a growing and never ending mountain of work, is likely looking at that institutional deadline. \n\nTL/DR:  \n1.) It's reasonable to be frustrated, but understanding it from a faculty member's perspective might dull your anger and reassure you.   \n2.) Most faculty members would welcome a friendly and kind reminder email. Also, if you're honest and kind, reaching out to say that you had hopes to get it in before the deadline, but you are uncertain if that's a reasonable expectation, they may be more clear with their capabilities. But faculty always have too much to do.   \n3.) There are also ways that faculty can get letters in late in most cases. Drives students crazy, but a behind the scenes email is not unusual.   \n4.) Good luck. I hope you get in. It's an exciting time and lord knows we need great public health folks these days.",
      "author": "stablegenius98",
      "created": 1638293450,
      "upvotes": 6,
      "replies": {
        "hmtv7uu": {
          "link": "/r/GradSchool/comments/r5pocn/taking_too_long_with_lor/hmtv7uu/",
          "text": "Honestly, reading this put a lot of things into perspective. So thank you for the insight and bringing my frazzled self back to reality. Applying to grad school programs is really stressful so I think just the anxiety behind it got the better of me. \nAnd thank you! Since this post has been made a professor submitted their recommendation..just waiting on one more now!",
          "author": "Acruxicon",
          "created": 1638384849,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmqs5x8": {
      "link": "/r/GradSchool/comments/r5pocn/taking_too_long_with_lor/hmqs5x8/",
      "text": "In my honest opinion, I don't think the profs are being unreasonable with their timelines. LOR really do take hours (if they're strong detailed letters), and this time of year is busy both for LORs, but also for grading and teaching responsibilities.\n\nJust to put it in perspective, I have an application due tomorrow. One completed their reference letter last week, and THREE completed their letters today. The day before the deadline! I was planning on sending a reminder email today at 1pm, but all 3 finished in the morning.",
      "author": "covelemon",
      "created": 1638324647,
      "upvotes": 3,
      "replies": {}
    }
  }
}