{
  "sid": "qtg9iz",
  "link": "/r/GradSchool/comments/qtg9iz/whats_playing/",
  "title:": "What's Playing?",
  "text": "Many of the posts in the sub are very relatable and it seems as if others share the amazing yet draining experiences and feelings of grad school.  I went straight from my B.S. to M.S. and now Ph.D. in comp sci., so to some degree, I see where many are coming from.  I don't want to discount the feeling of loneliness, but I've found a way *for me* to cope with it throughout the years with music, and I want to share that with you and ask for your help.  Let me explain...\n\nWhether it be waking up in the morning, starting a daunting task, reviewing literature, or even when sitting by myself I'm listening to music.  Interestingly, I don't really listen when I go for walks, eat, or when editing my writing.  My conscious self feels different when I listen to music.. at times, it's as if I'm mentally distracted but more focused on what's in front of me.  Also, there's not only genre, but many that my mind will crave, e.g. classic/hard rock when coding, electronic avant-guard when reading, blues in the morning, classical music or lofi when writing, etc. The long story short is that I feel that music has really helped me concentrate and stay positive when I'm by myself or working on projects.  \n\nI know I'm not alone with this, but I just wanted to share my appreciation for music with you all and see if you relate. And on that note, I'm genuinely curious what you are listening to.  Do you find yourself listening to different genres when doing different tasks?  Does music make you feel some type of way or is it just me? haha if anyone wants to share their favorite tracks/artists I'd love to add it to my library.",
  "author": "stockeh_",
  "created": 1636857849,
  "updated": 1637182739,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.64,
  "comments": {
    "hklk5jk": {
      "link": "/r/GradSchool/comments/qtg9iz/whats_playing/hklk5jk/",
      "text": "If I’m working on stuff where I need instrumentals only, I usually listen to lofi, retro synthwave or more metal-leaning post rock. For almost every other life scenario (chores, working out, etc.) it’s metalcore/melodic death metal.\n\nThe latter allows me to block out the world and blaze down the productivity path like no other, but I also absolutely love the sound; the guitars and drums in particular.\n\nEdit: I'm currently listening to it again so I highly recommend checking out Distant Dream's It All Starts From Pieces album (atmospheric post-rock/metal); it's beautiful.",
      "author": "ForeverRising-",
      "created": 1636904761,
      "upvotes": 3,
      "replies": {}
    },
    "hkjif7c": {
      "link": "/r/GradSchool/comments/qtg9iz/whats_playing/hkjif7c/",
      "text": "I like instrumental metal when I'm working through a lot of math (physics PhD candidate, so there was a ton of that the first couple years). Sithu Aye is one of my favorites. He has a background in physics and did an entire album about the creation of the universe (Invent the Universe). Cloudkicker is pretty good for working problems too.\n\nCoding, I usually go with more mellow stuff and usually with vocals. Lab work, I usually go with audiobooks. I'm trying a podcast right now: Behind the Bastards. Every episode is a deep dive into an awful person from history and there's some wierd facts in there. So, like, Saddam Hussein wrote romance novels. Stalin used to write funny captions on the art he had to approve (and his administration was super drunk for a few years). Hitler was a weirdo hipster (porkpie hat and trenchcoat and a dog whip when he went out). He also had terrible gas.\n\nAnyway, highly recommend Sithu and Cloudkicker if you're interested. Behind the Bastards is also really entertaining if you're doing something that doesn't require your full brain capacity.\n\nCheers.",
      "author": "DecoherentDoc",
      "created": 1636860585,
      "upvotes": 2,
      "replies": {}
    },
    "hkt0ntq": {
      "link": "/r/GradSchool/comments/qtg9iz/whats_playing/hkt0ntq/",
      "text": "I like chill Elder Scrolls instrumentals!",
      "author": "WaldenPwned",
      "created": 1637031304,
      "upvotes": 1,
      "replies": {}
    }
  }
}