{
  "sid": "q187mo",
  "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/",
  "title:": "My Zoom anxiety transforms me into a blank statue unable to string together a coherent thought… let alone participate. At a loss. Phd student in need of help.",
  "text": "In all other aspects of life, I am highly extroverted and have no social anxiety. Throw me into a zoom meeting with my cohort and two professors and I become mush for brains, unable to coherently speak. It’s so bothersome because I know I’m meant to be there and I know I’m fully capable of contributing to the discussion. But…. I just can’t. My body won’t let me. My mind goes blank. My heart nears 200 bpm. My lips tremble. My mouth goes dry. My body starts to shake. I start to panic. And only one thing crosses my mind: Escape now!\n\nThen, although I know I’m meant to be in this program, I feel like others see me as an imposter. It’s like projected imposter syndrome. I feel in the right place, but don’t think others believe I am. \n\nIm just so fucking terrified to say something stupid and give them any evidence that I’m not in the right place. \n\nIt’s a catch-22. Don’t participate and that looks bad. Participate, during a state of panic and blankness of mind, and, as a result, say something stupid… also looks bad. \n\nWhat on earth do I do here? I really do want to shine and be an essential contributor in my cohort.",
  "author": "TheEudaimonicSelf",
  "created": 1633362845,
  "updated": 1634099908,
  "over_18": false,
  "upvotes": 55,
  "upvote_ratio": 0.97,
  "comments": {
    "hfdi4jp": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdi4jp/",
      "text": "Honestly, I wish I had advice to help you. But all I can say is that you are not alone. I struggle with the same issue. Hopefully classes will be back in person in the near future because its so hard to be an feel successful via Zoom. Hang in there, imposter syndrome is hard enough without a pandemic getting in the way",
      "author": "justagooaaaat",
      "created": 1633368670,
      "upvotes": 14,
      "replies": {}
    },
    "hfdod0e": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdod0e/",
      "text": "You're not alone! The world is a mess right now and this is just what your mind has chosen to be 'the straw' and that's ok. I would reach out to your school for resources re: counseling (you don't have to be completely broken to seek out coping tips/tricks) and as a \"right now\" fix, have you tried hiding your own image so you can't see yourself? That has helped me immensely.",
      "author": "Jessers3192",
      "created": 1633370974,
      "upvotes": 6,
      "replies": {}
    },
    "hfdszcl": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdszcl/",
      "text": "This is just not an effective way to do graduate-level classes for some people, and you might be one of those people, and you should not be ashamed of that. I'm one of those people, I tried doing graduate seminar classes over Zoom last year briefly, I suffered through all the same things you've described here, and I had to seek a deferral for a year because it was just horrible for my mental state to keep trying to do something I used to love in this awful, inhuman state.\n\nI'm not you, I don't know how much it matters to you to succeed in in this situation at this exact moment, but I don't think you can ever actually replicate the spontaneity of human connection over Zoom classes like this. It may be worth trying to take a semester or a year off and hope things have calmed down by then until you can take in-person classes. It's not worth suffering through if you're not getting anything out of it.",
      "author": "thelowandtobask",
      "created": 1633372690,
      "upvotes": 5,
      "replies": {}
    },
    "hfdkxe1": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdkxe1/",
      "text": "Get in contact with your school's counseling office! They should have telephone appointments and should be able to provide you with a framework for managing this anxiety and working your way towards being the participant you want to be.",
      "author": "silversatire",
      "created": 1633369705,
      "upvotes": 11,
      "replies": {}
    },
    "hfenm51": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfenm51/",
      "text": "Lecturer here.\n\nTeleconference classes and meetings can be refreshing at first (no traffic, no aura radiation, no pants, etc.), but when we do it forever (long sessions or many sessions) it becomes extremely tiring. This can lead to the symptoms you described.\n\nI actively avoid actual participation in these activities now. I try to stay on the outside edge as much as possible.",
      "author": "lunaticneko",
      "created": 1633383948,
      "upvotes": 2,
      "replies": {}
    },
    "hff26hv": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hff26hv/",
      "text": "I have found on days when my anxiety is high, typing my thoughts/answers into my notes helps. I typically just use keywords or phrases in outline form. It gives me a scaffolding and provides me with a sense of security that I can refer to while I am speaking. Also, I split my screen so Zoom is on the right half of the screen and my notes are on the left half of my screen, that way it appears that I’m looking in the general direction of the camera even if I’m referring to my notes. On worse days, I just completely dissociate, pretend I’m someone who knows what the hell they’re talking about, and throw myself on the flames of criticism (just kidding - sort of haha)",
      "author": "AnnaEmme",
      "created": 1633390690,
      "upvotes": 2,
      "replies": {}
    },
    "hfdt117": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdt117/",
      "text": "Are you able to use comments to participate and would that be a more achievable option for you? Then you can put together your thoughts and don't have to actually speak? Or could you write/type out your thoughts and try to focus on reading them aloud? \n\nI second other commenters that you should see what kind of mental health resources your campus offers and consider pursuing some counseling if that is available for you. If it's low cost and available, might as well use it!\n\nLastly, I have a similar issue that I was dealing with both in person and on zoom meetings. My doctor recommended I stop drinking caffeine and that actually helped immensely with the heart racing feeling in particular. This was not fun (obvi we are all caffeine dependent), but has been a total game changer for me.",
      "author": "Kitty_casserole",
      "created": 1633372708,
      "upvotes": 1,
      "replies": {}
    },
    "hfdv75f": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdv75f/",
      "text": "If you really feel you are in the right place, what others think shouldn't matter. I am a TA and I have been both teaching and taking courses in Zoom for a year and a half now. It's next to impossible to judge a student's performance in a Zoom class. As a teacher, you cannot tell if or why a student is paying attention or not. It might be that they are distracted by the neighbour's dog barking, they might find that being in front of a screen for so long makes their head ache, there are a million reasons. For example, as a student, I find that I cannot focus for a long time in front of the screen, I start to feel very drowsy, regardless of how much I've slept or the time of day. So I have to study the class recordings at a later time and use the speed mode or else my mind wanders. This is why we, as teachers, do not require students to turn their camera or their mic on. We give them the benefit of the doubt, because it's impossible to tell what they are going through where they are. Not many people were used to online learning before the pandemics, so we try not to be too hard on the students or even on ourselves. You should do the same.",
      "author": "queenlorraine",
      "created": 1633373513,
      "upvotes": 1,
      "replies": {}
    },
    "hfdvph6": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdvph6/",
      "text": "Firstly, I acknowledge how much of an issue zoom/ online participation can be, even as someone who greatly benefits from them. \n\nI would suggest you write to your supervisors and let them know that you are facing an unexpectedly strong wave of anxiety during zoom sessions and that you will be trying to get help. Ask if in the meanwhile, they would be happy for you to interact via the chat feature?\n\nAnd then, please do reach out and get help. These are strange learning environments but that does not mean you have to necessarily somehow get around to it. Think of it this way: if you had severe anxiety talking in front of people (in-person), you would have got help. Reach out for help and it is good that you reached out to this community on reddit. \n\nWish you all the best :)",
      "author": "snorkgirl92",
      "created": 1633373699,
      "upvotes": 1,
      "replies": {}
    },
    "hfdwqh5": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfdwqh5/",
      "text": "I can't help much with Zoom, but are there other ways you're participating that could help to show your thoughts and work? What are the other requirements in the class? Are you submitting discussion questions, papers, or other work? If so, these are other areas where you can come through in ways that are difficult on Zoom. I have some classmates that don't say much in Zoom, or even in in-person classes, but have really insightful discussion questions that show they are engaged and helped me better understand them. \n\nAs a suggestion for Zoom, and this may only help once you've found other strategies that help with the anxiety, you could prepare some discussion points ahead of time that you could either throw into the chat or bring up in discussion. Having them planned out before the class starts could help you to have something you know is coherent to say/type and make it clear that you have insightful things to say, even if finding them in the moment on Zoom is a nightmare.",
      "author": "AgentFuzzButt",
      "created": 1633374075,
      "upvotes": 1,
      "replies": {}
    },
    "hfepccf": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfepccf/",
      "text": "Can you pre-make notecards and have them in front of you out of camera view?",
      "author": "killibee",
      "created": 1633384637,
      "upvotes": 1,
      "replies": {}
    },
    "hfesz25": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfesz25/",
      "text": "I got prescribed propranolol for public speaking, look into it. It’s very safe and super effective",
      "author": "the_freebird",
      "created": 1633386224,
      "upvotes": 1,
      "replies": {
        "hfh55gk": {
          "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfh55gk/",
          "text": "I've gotta say it really helped me for in person public speaking too, but it has next to no effect for large zoom classes.",
          "author": "KiwiTheKitty",
          "created": 1633440021,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hffx8tx": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hffx8tx/",
      "text": "That’s interesting because I’m the opposite. I’m so much better online. In person, when I even think about speaking before I do it, I get a sudden burst of adrenaline, casuarina my voice and chest to shake, a cold sweat, heart racing… aka social anxiety. \n\nPracticing mindfulness can help. Remembering no one really cares what I say or do (in a Judgmental way at least lol) and when someone does judge, it’s really just about them and their own insecurities. However being mindful is very hard in the moment.",
      "author": "aka_hopper",
      "created": 1633406720,
      "upvotes": 1,
      "replies": {}
    },
    "hfguxqo": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfguxqo/",
      "text": "Googly eyes.\n\n I'm dead serious. Buy yourself a set of googly eyes and glue dots from the craft store. Glue one eye on each side of the camera lens. Now not only will it make you smile, but you can make \"eye contact\" while in a meeting. Just remember to take them off your laptop before you close it or go anywhere in person!",
      "author": "frenzied-eccentric",
      "created": 1633434301,
      "upvotes": 1,
      "replies": {}
    },
    "hfh4z8u": {
      "link": "/r/GradSchool/comments/q187mo/my_zoom_anxiety_transforms_me_into_a_blank_statue/hfh4z8u/",
      "text": "I wish I had advice for you, but I'm the same way. I'm so thankful to be back in person because I *loathe* online stuff. I end up very fatigued from Zoom meetings and classes and I also experience paralyzing social anxiety on Zoom. My self esteem also got worse because I was constantly staring at myself in the unflattering camera view. Like honestly, it was stuff I haven't experienced since I was like 18! It's been a couple months in person and most of this stuff has evaporated like it never existed. So I guess good luck sticking it out, I hope you don't have to deal with it too much longer.",
      "author": "KiwiTheKitty",
      "created": 1633439936,
      "upvotes": 1,
      "replies": {}
    }
  }
}