{
  "sid": "q3kg1i",
  "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/",
  "title:": "My Grad Program is treating my brothers suicide not seriously. Am I overreacting?",
  "text": "My brother recently passed away about a week ago. I won't go into the details but he was very depressed for a long time and made an unfortunate decision while under drugs.  This has been a very emotional week for me and have had a lot going on. I emailed my advisor asking her what accommodations they could offer and me and what are some options for the rest of my semester. She send me a pretty generic email back saying I should reach out to my professors individually and speak about accommodations they could offer me.\n\n&#x200B;\n\nI am emailed four of my professors and ONE has gotten back to me and spoken to me. I can understand if one professor can't get back to me but 3 out of 4 is ridiculous I think. I emailed my advisor again asking her what the plans are for dropping classes, possibly withdrawing for term and recommendations for students in my position. She sends me back a generic email copy and pasting the withdrawing policies from another page.\n\n&#x200B;\n\nI think my school is putting in very little effort to help me through the most difficult time in my life. No one will speak to me and I can't just be consistently following up with professors I have a lot of other stuff going on. I am possibly thinking about maybe dropping out of the program regardless since they seem to not care at all about their individual students. This is my first semester getting my masters. Is this common, or am I overreacting?\n\n&#x200B;\n\nUpdate: Thank you for the support everyone means a lot!  I did speak with the disability offices. The person I talked to was somewhat helpful, he saif it is up to the advisors to talk to the professors and make sure that they are aware of the situation. He said I could fill out some application, I had a really busy day so I haven't done that but will do that soon. I also didn't mention to any of my professors or advisor that it was a suicide, still think they should treat it seriously regardless maybe that made a small difference.",
  "author": "mg2197",
  "created": 1633646159,
  "updated": 1634099817,
  "over_18": false,
  "upvotes": 354,
  "upvote_ratio": 0.98,
  "comments": {
    "hfscw2k": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfscw2k/",
      "text": "I'm so sorry for your loss. You are not overreacting. At the same time, I've realized you can only expect so much from professors. I would recommend reaching out to people above them or perhaps in the graduate school admin. You might also want to talk to your school's counseling center and/or disability services because they probably have more experience with your situation.",
      "author": "notsoperfect8",
      "created": 1633647143,
      "upvotes": 306,
      "replies": {
        "hftnnx4": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftnnx4/",
          "text": "Hopping on the top comment in hopes that you see this. First, I am sorry that you are going through this. I lost loved ones during my PhD process, and I am lucky to have had a supportive department. Make sure that you surround yourself with people you can count on, whether that is family, friends, cohort members, etc.\n\nI would highly recommend reaching out to the Dean of Students Office at your University. I used to work in the one at my university, and there are people who specialize in connecting you to resources and will often help you reach out to professors for accommodations. If they have trouble getting the professors to listen, they can also help to talk to department heads/advisors. Essentially they can help work as an advocate for you.\n\nI also want to echo reaching out to counseling on or off campus. They will often have one-on-one support as well as support groups if that is something you are interested in. Take care of yourself.",
          "author": "SpectralPuffin",
          "created": 1633672234,
          "upvotes": 65,
          "replies": {}
        },
        "hfsslr6": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfsslr6/",
          "text": "I agree I don't think it should be completely up to my professors the administration or advisor should at least help me. I did contact the school's counseling center but I will contact the disability services center",
          "author": "mg2197",
          "created": 1633654875,
          "upvotes": 42,
          "replies": {
            "hft98fw": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft98fw/",
              "text": "My university offers student advocates through the counseling center to help navigate these types of situations between the student and their professors. Hopefully your university offers something similar and you are able to receive the support you need.",
              "author": "BlondeNinja182",
              "created": 1633663064,
              "upvotes": 21,
              "replies": {}
            },
            "hfuwnek": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfuwnek/",
              "text": "There should be some kind of student services office that can help you. I had a serious illness during school in undergrad and they handled everything for me,  and they contacted my professors for me and worked out what I had to do to pass the semester.",
              "author": "HelpImOverthinking",
              "created": 1633703563,
              "upvotes": 5,
              "replies": {}
            },
            "hfwa4g3": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfwa4g3/",
              "text": "Honestly, contact a dean. Copy the professors. My cousin was murdered during my masters/law school. It was a big deal and made news in my area. I couldn’t work or even breathe. I tried my professors but it very much felt like “great aunt Bertha syndrome” though what the hell, she’s just as much worth of mourning. My solution was going directly to the deans like a weirdo. Phrase it as if you’re soliciting condolences and the break off for actual compassionate breaks. I had several close family members die during grad school. Worst five years of my personal life. Stand up for the time you need, even if it feels opportunistic. It’s not. A loved one has died. That is more important than a paper. Lean in.",
              "author": "thoph",
              "created": 1633724214,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hftb4em": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftb4em/",
      "text": "I went through a similar loss recently and I cannot put into words how sorry I am that you are experiencing it, too. There is so much to grieve. My heart goes out to you and your family as you navigate this. To be honest, I found that I had very little patience for manufactured issues like this when all my circuits were processing the suicide. It just… it feels very cruel. You are not overreacting. \n\nWith that said, I would not rely on individual professors to help you out on a case-by-case basis. I would reach out to your school’s disability center for an accommodation. That will lay out a plan for you and honestly probably simplify things for your profs as well, because they’ll have guidance to follow. You will likely need some sort of documentation, possibly from a mental health professional. You want this on file so that giving you an accommodation is not optional. If you’re not sure of what other options may be available to you, consider reaching out to your university’s ombuds. \n\nYou absolutely need some breathing room here. To be blunt, you’re not going to be doing your best work for awhile, and you shouldn’t be frustrated by that on top of everything else. If you have trouble focusing or anything, be kind to yourself. It’s just what happens during a trauma of this magnitude. Whatever space you need to grieve, take it. If at any point you get the impression from your university that focusing on yourself and your family is a poor work ethic or inconvenient or whatever, remember, their take is not healthy. It takes strength to get through this, and strength to ask for help when you need it. \n\nYou *will* need a support system. The counseling center is a good start, but I would suggest that a few sessions won’t be enough. I cannot recommend regular therapy strongly enough here. You should be navigating all of this with an expert, and you should have a neutral party you can talk to. Find someone you feel comfortable talking to – it’s okay to try someone new if you don’t click with your current therapist. Consider that this will be a medium- to long-term endeavor. If you need any additional suggestions on finding a therapist, don’t hesitate to reach out. \n\nI am truly sorry for the loss of your brother.\n\nEdit: I just want to add, if making any of the suggested calls sounds too daunting, PM me and I will do my best to help you. I am happy to call and ask questions to get you some more information, or to be on the phone with you when you call. And if I’m not the right person for that, ask a trusted friend. Sometimes these initial calls can feel extra overwhelming. If I can make that any easier, I am glad to. Truly, do not hesitate to reach out.",
      "author": "StringOfLights",
      "created": 1633664085,
      "upvotes": 27,
      "replies": {}
    },
    "hfsnlsq": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfsnlsq/",
      "text": "I'm sorry to hear about your brother. \n\nTheir reaction is not normal and seems unnecessarily callous and dismissive. My grandmother died in my second year of my program. It was expected and she was almost 100 years old, but my professors were very quick to respond and offer me some time if I needed it. Given that you are dealing with a much more serious issue, I think your professors should be ashamed of themselves. Especially your adviser, may she forever have meetings that consistently run 30 minutes over time, are about nothing, and do not resolve anything. \n\nInstead of contacting each professor individually, I would do what the other commenter suggested and speak with someone at your disability resource center. Contrary to it's name, they don't exclusively deal with people with disabilities. People who need accommodations for a variety of things get them through the disability resource center, at least at my university. If you can get one through them, they will email your professors and *tell* them what your accommodation is, rather than you having to ask for one. \n\nI don't blame you for wanting to withdraw given how these people behaved, but you may also consider a medical leave of absence instead of a regular withdrawal.",
      "author": "False-Guess",
      "created": 1633652440,
      "upvotes": 77,
      "replies": {
        "hfst0ol": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfst0ol/",
          "text": "I experienced the same experience as well my grandmother passed away when I was abroad taking some more easy classes and my advisors were completely understanding and let my professors know. I could also maybe consider a medical leave of absence my advisor never mentioned anything about that before but I will look into it.",
          "author": "mg2197",
          "created": 1633655068,
          "upvotes": 21,
          "replies": {
            "hftwe8p": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftwe8p/",
              "text": "I would. A leave of absence is different from a withdrawal. IIRC, a medical leave of absence means you are still a student there but you are taking a break for medical reasons (or other personal reasons). After your leave of absence ends, you can return to taking classes normally. A withdrawal means you are no longer a student there and, if you decided to return, you'd have to reapply. It's honestly pretty shocking to me that your adviser didn't bother to mention it to you and instead just forwarded information about withdrawing. That seems pretty callous and negligent to me. A good adviser would not do that.",
              "author": "False-Guess",
              "created": 1633679351,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "hftiz4o": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftiz4o/",
          "text": "Completely agree. I experienced more kindness from my employers (arguably a big, faceless hospital) when my grandmother passed than what OP is experiencing. Not a professor myself but I can't imagine not even *responding* to OP.",
          "author": "irridiumgreen",
          "created": 1633668902,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hftfkcr": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftfkcr/",
      "text": "Hi there, I’m so sorry for your loss. It’s really heartbreaking, and I don’t think it’s unreasonable to expect more from your program than they are offering you. \n\nI’ve worked in graduate education (as an administrator and adjunct faculty) for almost ten years, and when you mentioned your faculty are adjunct, their lack of response made more sense to me. In general, adjuncts are not as responsive to student emails as full time faculty. This is often because they are also working full time jobs outside of teaching, but also because they aren’t really part of the campus community and are largely unaware of the expectations for faculty (even though we relay these at orientation). They are also not going to know how to answer your questions about accommodations because this is not some adjuncts are expected to handle. That’s where administration steps in. Now, this doesn’t mean that they should ignore your emails - I think it’s awful that they haven’t responded at all with their sympathies - but they are going to have no idea how to navigate the withdrawal process at a university. \n\nI would definitely reach out to someone in student affairs and ask for help (the dean of students is a good place to start). Wishing you luck with this and lots of love and healing.",
      "author": "Nervous-Shark",
      "created": 1633666726,
      "upvotes": 11,
      "replies": {}
    },
    "hft7tfx": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft7tfx/",
      "text": "You’re not overreacting, OP. I lost my brother to suicide about a month and a half ago, a day after starting my doctoral program. I’m so sorry you’re juggling grief and starting a new program. That’s a whole lot and I feel for you immensely. \n\nI might be biased because I’m going through the same things but, no, your advisor and professors are not acting in an appropriate and supportive manner. My advisor handled all communication to my program and professors. I was only allotted 2 weeks of for funding reasons but they’ve been very accommodating. I actually had a talk with my statistics professor again and he’s open to having me go through the whole class and if I don’t pass, take an incomplete and retake it next year. \n\nYou should reach out to graduate student advocacy groups if your campus has that. See if they can help you. You can also try contacting higher ups in the department or see if the counseling center has any resources. \n\nSometimes people don’t know how to handle grief, let alone complicated or traumatic grief. Unfortunately, people with power get caught up in that as well. Hopefully they get their shit together and start prioritizing your (and other students) mental health and well-being. \n\nMy dm’s are open, internet friend, and my thoughts are with you.",
      "author": "HelloGodItsMeAnxiety",
      "created": 1633662315,
      "upvotes": 30,
      "replies": {}
    },
    "hft9eb3": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft9eb3/",
      "text": "Don't drop out of your program, not yet. There might be an official policy which would allow you to take the rest of the semester off. \n\nI would actually call the university to speak to someone (staff, not faculty...sometimes faculty know that there are policies, but don't know how to get the ball rolling to make use of them. That is the staff's function). Try the Graduate School's office, or the program director for your grad program. They might be better equipped to handle the situation from an administrative standpoint (it's been my experience that faculty aren't always familiar with to the processes the way that the student affairs staff are. It might not be that they don't care about your situation, it's just that they might not know what to do.) \n\nCalling is uncomfortable and inconvenient, but you'll likely get a response quicker and they can't just shuffle you around to other people. I know most universities have policies for leave of absence for the semester, or at the very least, can make formal accommodations for bereavement absence or something.\n\nEditted for spelling.",
      "author": "Current_North1366",
      "created": 1633663144,
      "upvotes": 9,
      "replies": {}
    },
    "hftlpvd": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftlpvd/",
      "text": "ASK FOR INCOMPLETEs. Its basically just a put a pin it. And yoh finish the coursework(for me it was within a year) and then get graded. Basically a dont lose your money, progress GPA type thing. Also go above them. This is HUGE. \n\nYou are allowed to be upset. Im sorry they are being unhelpful",
      "author": "bitetheboxer",
      "created": 1633670807,
      "upvotes": 10,
      "replies": {}
    },
    "hftelan": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftelan/",
      "text": "I think you're reacting as well as can be expected to the grief and truly awful situation,  but I'm not surprised at the response you're getting.  \nI had a student in his senior year lose a brother in a similarly tragic event. At first he just asked for a 2-week extension,  which I was happy to accommodate, but then he needed more time so he had to process a summer extension through the registrar's office using the same procedures as any other summer extension. I tried to be supportive,  but for the most part he disappeared for several weeks (understandably) and I just waited. \n\nIf you want to stay enrolled in your courses,  I would talk to each professor 1-on-1 after class or during office hours about specific requests.  The accommodations office is a good idea, too.",
      "author": "misanthpope",
      "created": 1633666119,
      "upvotes": 6,
      "replies": {}
    },
    "hftjr1n": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftjr1n/",
      "text": "Just wanted to put in a short response: when I had a loss in immediate family, I just emailed my professors and told them straight up that I was going to take two weeks off from all classes and assignments and catch up on things later. My department is small so word got around fast and department heads were nice enough to send flowers to my home address for the funeral. All my assignments were excused.\n\nInstead of asking for things off, try being more assertive for what you want (i.e. \"may I take 2 weeks off from classes?\") as opposed to asking for a vague request (i.e. \"what can you give me for time off?\")",
      "author": "someoneinsignificant",
      "created": 1633669430,
      "upvotes": 7,
      "replies": {}
    },
    "hft85a1": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft85a1/",
      "text": "In their defense, I wouldn’t know how to respond to your request either. What accommodations do you want? I think asking for specific, immediate accommodations could have possibly been met with more of a response (more time on assignment due soon, moving an exam that conflicts with bereavement). But asking for accommodations for the rest of semester feels too broad honestly, especially if you were vague. I think most schools will only do extended or more broad accommodations when approved by your universities Disability Center, which may require meeting with mental health specialist before they will help you.",
      "author": "nemesisira",
      "created": 1633662487,
      "upvotes": 35,
      "replies": {
        "hfv77mg": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfv77mg/",
          "text": "I agree maybe I was too broad, I never really been a situation like this serious before so I kind of just went based off of what my advisor told me to do.",
          "author": "mg2197",
          "created": 1633708066,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfu7bw1": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfu7bw1/",
      "text": "I am so sorry for your loss. \n\nI wouldn’t assume malice on behalf of your supervisor or other professors, they might be trying to find out themselves what are the possible accommodations they can offer to you. It’s a delicate situation and most of them (including your supervisor) may not know how to deal with. They may also lack the social skills to present that properly to you in this situation. \n\nRealize that there is help available to you and it goes far beyond your professors. I would reach out to the department dean, graduent student office or even counselling services. They have many tools on how to manage this difficult situation *with* you. \n\nEven assuming malice on behalf of your prof, there are people in the uni who will help you navigate the situation properly with your supervisor. You have “legal” protections in situations like this. \n\nThe mistake would be not to communicate this to anyone higher up and just let go.",
      "author": "serge_mamian",
      "created": 1633689190,
      "upvotes": 5,
      "replies": {}
    },
    "hft6i50": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft6i50/",
      "text": "I'm very sorry for your loss, I know that adds so much more stress.\n\nmy grandmother just passed and it's been very hard. I reached out to my advisor and specific professors, and they've been understanding. I withdrew from one course to be safe and to focus on my other work. The professor for the class I withdrew from has generally not been responsive - I've had to get my program coordinator to contact him twice due to him not reading/responding to emails. It was easier for me to just drop that one course.\n\nI've had to medically withdraw before and that whole process sucks. Coming back sucks. But sometimes you have to do what's best for your mental health and what's best for your work as well. \n\nMy advice is if your professors aren't responsive, go above them to let your program know your situation and that you're working to let people know and figure out what to do. Sometimes your program coordinator or someone that deals with grad school from the admin side can be helpful.",
      "author": "niinetails",
      "created": 1633661643,
      "upvotes": 3,
      "replies": {}
    },
    "hfthl2m": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfthl2m/",
      "text": "I am very deeply sorry about your loss. \n\nBecause of the severity of your situation, you should really discuss this either with your Disability and Accommodations Office or with the Student Dean. You will not get the support you need from your professors individually because they can’t really do much for you on their own. The university needs to help you coordinate a plan of action for the semester. I am appalled and frankly disgusted that your advisor has not offered this information to you. You need to get all of this on record with the university so you can get accommodations for your classes and other university commitments. Also, if available, please consider taking advantage of the Counseling Services at your institution.",
      "author": "SaintLoserMisery",
      "created": 1633667994,
      "upvotes": 3,
      "replies": {}
    },
    "hfui69f": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfui69f/",
      "text": "You are not overreacting. My brother commit suicide when I was a senior in undergrad. I emailed my professors that I would be out due to a family emergency, but I guess some friends had explained the situation to the department. They sent flowers and food to my house and told me to stay out as long as needed. I didn't go to school for a few weeks and was just kind of a husk of a person. It was incredibly hard and honestly took years to properly get back to normal. When I went back to school, all my professors (except one jackass) were very accommodating.\n\nI'm extremely sorry for your loss, this is such a hard thing to go through. Please, please go to therapy for this. I really wish I had.",
      "author": "idontknowwhattodo93",
      "created": 1633696508,
      "upvotes": 3,
      "replies": {}
    },
    "hfswbpd": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfswbpd/",
      "text": "I am sorry for your loss. I am the eldest of four brothers and can't begin to imagine your pain. \n\nThat being said you are leaving out alot of details and context. What are the size of your classes? Are the professors active in research and busy with their own work? Is this lack of response regular behavior or is it something new? Do they know you are in pain and are still ignoring you or are they completely unaware? You suffered a painful loss but everyone else still has a job to do.\n\nI promise you I didn't type these words lightly. My childhood best friend of 15 years died when I was preparing for my SATs and I learned a few things during that time. Everyone suffers loss but no matter the amount of pain you are in life won't stop for you, the world won't stop for you. It's unfair, unfortunate but inevitable.C'est la vie. \n\nI hope you find the strength to cherish the memories of your brother that you have left.",
      "author": "Tangent_runner",
      "created": 1633656672,
      "upvotes": 14,
      "replies": {
        "hft8f3i": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft8f3i/",
          "text": "I understand what you're saying, but I feel like there's also a basic level of human kindness OP professors should have shown. I TA for around 120+ students, and my department still expects me to respond to emails within 48 hours if they're sent during the week. If a student reached out to me about a loss, I wouldn't be able to do much but I could at least respond with my condolences and put them in contact with someone who knows more about what to do in that situation. That's on top of research and my own classes as well. \n\nEven this week, I asked my advisor about scheduling classes and he asked several detailed questions about how I'm adjusting to life at school and invited me to stop by his office sometime to check in. Life doesn't stop for a tragedy, but I do think it's odd that OP has presumably given her professors several days with no response. Part of the job is communicating with students...",
          "author": "new_eclipse",
          "created": 1633662632,
          "upvotes": 13,
          "replies": {}
        },
        "hfsx8bn": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfsx8bn/",
          "text": "My class sizes are around 20 students per class. My professors are adjunct professors who work full time jobs. I don't know if this normal I have been taking classes for less than a month. Am I in pain? Are you serious? My brother just died why the fuck do I need to demonstrate to the professors that I am in pain people should expect that. No shit the world doesn't stop for me I can expect some help from the university after a tragic event it isn't a lot to ask for.",
          "author": "mg2197",
          "created": 1633657111,
          "upvotes": 3,
          "replies": {
            "hft54e2": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft54e2/",
              "text": "I'm afraid the lack of response may have a lot to do with adjunct professors having a very limited role. It is too bad that the distinction has to affect you in such a painful way. But a lot of adjuncts are not expected to do anything at all besides teach the class. Please look for support in the university from the academic staff or the professor in charge of your graduate program. They are in a position to help.",
              "author": "IkeRoberts",
              "created": 1633660980,
              "upvotes": 18,
              "replies": {}
            },
            "hftg55v": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftg55v/",
              "text": "If they're adjuncts, they may be waiting on other people to figure out what accommodations or resources they can even offer, especially since it sounds like you need more than an assignment extension or test retake but aren't sure what you'll need. Adjuncts can be pretty separate from the department and may not really know the polices, programs, who to talk to. \n\nSorry for your loss and hoping you can find the support ton need ❤️",
              "author": "mediocre-spice",
              "created": 1633667088,
              "upvotes": 7,
              "replies": {}
            },
            "hfsykiz": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfsykiz/",
              "text": "That's not what I said. I said are the emails 'read'? Do they know your situation? Are they aware? I never said 'demonstrate'. I didn't say go in front of everyone and beat your chest.\n\nIf this is how you are acting in person and real life then you have a very, very long road ahead of you.\n\nSorry for your loss and good luck.",
              "author": "Tangent_runner",
              "created": 1633657763,
              "upvotes": 9,
              "replies": {
                "hfsz78k": {
                  "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfsz78k/",
                  "text": "I emailed them and said my brother passed away like I said in the original post. You just said that everyone else has a job to do, that is obviously true still doesn't mean they maybe shouldn't provide some sort of guidance in the situation.  How I am acting in person and in real life? Really nice of you do say that during this time, just want some basic fucking guidance from my school.",
                  "author": "mg2197",
                  "created": 1633658080,
                  "upvotes": 4,
                  "replies": {
                    "hft0d7i": {
                      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft0d7i/",
                      "text": "If they haven't replied, then don't claim they \"dismissed\" your situation. Almost every professor has a schedule that's super tight, that's what I meant when I said they have a job to do, I didn't say people don't give a shit. \n\nThey will read your email, direct you to the bursar to make a late withdrawal on the basis of extenuating circumstances. That's standard procedure in almost all universities. \n\nI was trying to empathize but you proceeded to curse at me and twist my words. I am sorry for your loss and sorry I couldn't word myself more clearly, I apologize.",
                      "author": "Tangent_runner",
                      "created": 1633658660,
                      "upvotes": 15,
                      "replies": {
                        "hft1b51": {
                          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft1b51/",
                          "text": "I understand they have a job to do but as a professor it is also your job to respond to student emails. I understand that stuff happens but when only 1 out of 4 get back to me to it seems like a lack of empathy from the department as a whole.  \n\nI wasn't trying to twist your words that is how I read it. When you said \"Do they know you were in pain?\", I thought you meant it as do they know I was grieving not how you probably meant to say it as do they know about what happened.",
                          "author": "mg2197",
                          "created": 1633659123,
                          "upvotes": -7,
                          "replies": {
                            "hft250z": {
                              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hft250z/",
                              "text": "I understand. Hope they get back to you and help you soon.\n\nOnce again, I apologize if I hurt your feelings. Rationalization is  how I dealt with the logistics of  loss when it came my way but it has been a while since I have lost someone close to me and I am sorry if the things I said caused you pain.",
                              "author": "Tangent_runner",
                              "created": 1633659527,
                              "upvotes": 9,
                              "replies": {
                                "hfwvvxr": {
                                  "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfwvvxr/",
                                  "text": "while it might’ve worked for you, rationalization can’t be expected of someone experiencing such a loss. people should be allowed to break down and be upset in these situations. it’s horribly cold of you to tell someone they have a long road ahead of them when they are upset like this. i’m sorry to OP that this sub is full of people that can’t understand or accept natural human emotion, sometimes logic must be put aside to make room for real grief and healing and it’s blatantly apparent that this is being neglected in academia.",
                                  "author": "xtremesmok",
                                  "created": 1633733621,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "hfu4ckj": {
                              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfu4ckj/",
                              "text": "Gotta say it's very very weird that so many downvoted this.\n\nI am so sorry for your loss and what you are going through.\n\nI would definitely look into taking a leave of absence. Many (most?) schools allow at least one full semester where your status is basically frozen and you can resume at the end without re-applying or doing anything like that. I took a leave of absence to deal with a loss during undergrad and to deal with health problems during grad school.\n\nIf you just google something like \"leave of absence policy \\[school name\\]\" you should be able to find out more about your options online relatively easily. Even if the policies are convoluted and you're confused by the process, etc. reviewing that information should hopefully make it a little easier to navigate contacting people because it will give you a better sense of what questions you should ask to find the answers you need. At least that was my experience anyway.",
                              "author": "wknd_worrier",
                              "created": 1633686641,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hfupa6s": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfupa6s/",
          "text": ">I promise you I didn't type these words lightly. My childhood best friend of 15 years died when I was preparing for my SATs and I learned a few things during that time. Everyone suffers loss but no matter the amount of pain you are in life won't stop for you, the world won't stop for you. It's unfair, unfortunate but inevitable.C'est la vie.\n\nDo you think this is what OP needs to hear right NOW?\n\nWhat is wrong with you? There are too many academics like you. Disgusting human.",
          "author": "Gambenis",
          "created": 1633700176,
          "upvotes": -4,
          "replies": {
            "hfv0mk8": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfv0mk8/",
              "text": "I didn't say that is what should happen, rather that is what happens. That is the open, dirty secret all of us end up having to struggle against. The one that I had to struggle with throughout my teen years. \n\nI was sharing my experience but  you are twisting my words and stereotyping me at the same time. Why? Who is more disgusting here?",
              "author": "Tangent_runner",
              "created": 1633705281,
              "upvotes": 6,
              "replies": {
                "hfv8pmm": {
                  "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfv8pmm/",
                  "text": "Yes, what you said in your post is largely true. If it is true, then it must be helpful, right? \n\nWrong.\n\nLet me explain why your post is unhelpful at best since, shockingly, it needs explaining (judging from the upvotes):\n\nOP's brother killed himself a week ago. A. Week. Ago. Your response is:\n\n* \"Everyone suffers loss.\" This is true. However, most people will go their entire lives without experiencing trauma of this magnitude. \n* \"It's unfair\"; i.e. \"Life is unfair.\" Have you had a parent tell you that before? Do you sound condescending yet?\n* \"Whelp, that's life.\" Hmm. Insightful. I'm sure this platitude will help OP navigate his trauma a week --  a **WEEK** \\-- after losing a sibling to suicide.\n* It is true that the world won't stop for OP's grief. It is likely that OP understands this already. If they don't, they will be learning it now. Either way, saying this is merely patronizing. OP can understand this while still expecting a more caring response from their professors.\n* The loss of  your childhood best friend is not relevant here. It is not remotely comparable to what OP is going through. It does not enable you to understand what OP is going through. Mentioning it at all puts the focus on you and cheapens OP's loss. \n\nI hope this explanation has been helpful for you. Consider that your capacity for empathy may be deficient. I'm going to take a wild guess and say you're in STEM, no?",
                  "author": "Gambenis",
                  "created": 1633708689,
                  "upvotes": 2,
                  "replies": {
                    "hfvltx4": {
                      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvltx4/",
                      "text": ">going to take a wild guess and say you're in STEM\n\nI'm in stem :( that one hit a little below the belt\n\nBut I agree with everything else you've said, well put.",
                      "author": "campbell363",
                      "created": 1633714137,
                      "upvotes": 2,
                      "replies": {
                        "hfvni8z": {
                          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvni8z/",
                          "text": "Haha sorry. That one was uncalled for but I couldn’t help myself. \n\nGlad there are people like you in the field, in any case.",
                          "author": "Gambenis",
                          "created": 1633714826,
                          "upvotes": 0,
                          "replies": {
                            "hfvnw0s": {
                              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvnw0s/",
                              "text": "Lol, well, there's a reason many people leave the field (including me, hopefully) but can't quite put my finger on it.... 🤔Such a mystery!",
                              "author": "campbell363",
                              "created": 1633714981,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hfvch8w": {
                      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvch8w/",
                      "text": "No, it hasn't been helpful.  I am responsible for what I say, not what you think I said.  \nNever once did I say I am 100% right and my is the only way. I shared my experiences and what helped me, OP didn't see it that way and found it hurtful and I apologized as is my responsibility. You can see if it if only you would have read out whole interaction. \n\nI have had suicide in the family, 2 cousins if you need to count. My brother is on anti-depressants right now. So, once again if you could stop assuming things about me. \n\nIt's unfair, and I said that because that is how I felt.  Biting on that helped me, I learned from OP that it didn't help him and once again I apologized because what I thought would be helpful turned out not to be.\n\non the other hand sit on your high horse and pontificate, judge, patronize and condensed and put words in my mouth.\n\nYes, I am in STEM. I am in STEM because it gives me joy and I see as my opportunity to make something meaningful. No, I am not in liberal arts but I actually love literature and art. Reading fiction is one of my favorite things.\n\nBut a judgmental clown like you would never understand this, you are too busy stereotyping and gas lighting people.",
                      "author": "Tangent_runner",
                      "created": 1633710266,
                      "upvotes": 4,
                      "replies": {
                        "hfvg0ut": {
                          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvg0ut/",
                          "text": "I didn’t assume anything about you other than that you must be in STEM. I simply analyzed the text in your post. \n\nI’m sorry that this analysis wasn’t helpful for you. I thought it very clearly showed how your response could be perceived as cold and tone deaf. Curious that you think I was gaslighting.\n\nIf it wasn’t helpful, then there’s nothing else to say. \n\nGood luck to you.\n\nEdit: Oh, I did assume you are a disgusting human. I forgot about that. It might be true, since you believe you are not responsible for the effect your words have on others.",
                          "author": "Gambenis",
                          "created": 1633711724,
                          "upvotes": -3,
                          "replies": {
                            "hfw017w": {
                              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfw017w/",
                              "text": "Lmaoooooo.\n\nWhy would I apologize multiple times if I didn't assume responsibility? What's the logic here?\n\nHonestly man, I am sorry I couldn't put it clearly and you really don't need to keep coming back with edits and expend time and brain cells here.\nIf you start out with the assumption that I am a disgusting, there is nothing I can do, you win.",
                              "author": "Tangent_runner",
                              "created": 1633720099,
                              "upvotes": 1,
                              "replies": {
                                "hfw100e": {
                                  "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfw100e/",
                                  "text": "See your above post bro. I didn’t pull it out of my ass.",
                                  "author": "Gambenis",
                                  "created": 1633720487,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hfuthsi": {
              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfuthsi/",
              "text": "Lol right, WTF? '\"my friend of 15 years died [...] c'est la vie\"",
              "author": "campbell363",
              "created": 1633702153,
              "upvotes": -2,
              "replies": {
                "hfv1zff": {
                  "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfv1zff/",
                  "text": "What's your point?",
                  "author": "Tangent_runner",
                  "created": 1633705863,
                  "upvotes": 2,
                  "replies": {
                    "hfvkk95": {
                      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvkk95/",
                      "text": "My interpretation: it reads like you're implying to just get over it, since 'the world keeps turning'. It's dismissing someone's conveyed feelings by saying c'est la vie = that's just the way it is = 'well, *I* got over it'. \n\n'I've had a friend die, but I got over it' [subtext here reads like you're saying OP should just get over it, because that's what you did].",
                      "author": "campbell363",
                      "created": 1633713613,
                      "upvotes": -1,
                      "replies": {
                        "hfvlz2v": {
                          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvlz2v/",
                          "text": "Not what I meant, sorry it sounded that way. I am just too tired to explain it for everyone who points a finger, you can read the whole interaction if you really care.",
                          "author": "Tangent_runner",
                          "created": 1633714196,
                          "upvotes": 2,
                          "replies": {
                            "hfvogb2": {
                              "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvogb2/",
                              "text": "Don't bother, these people are idiots.",
                              "author": "Swords_Not_Words",
                              "created": 1633715213,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfsx27a": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfsx27a/",
      "text": "I'm so sorry for your loss. I wonder if your professors are just embarrassed and don't want to say the wrong thing, and so they're keeping their distance. It totally doesn't justify the treatment you've gotten, but I wonder if that's what's going through their minds.\n\nA couple years ago my brother went into rehab for his drug addiction. I told my advisor about it and she clearly felt uncomfortable discussing it. She was flexible with my work for a few weeks, but she didn't give me any of the emotional support I was hoping for.\n\nIf it's getting urgent that you need academic accommodations, I would say something like the following:\n\n\"Hey, I'm not sure if you saw my last email. I'm going through [X], and I need to take a couple weeks off to grieve with my family. I'm already working through the UAC office to get official accommodations. I'll do my best to catch up on missed assignments when I get back. Let me know if this will be a problem so I can withdraw from your class.\"\n\nThat will hopefully put them in a position where it is quick and easy for them to respond. You deserve a lot more support than what they're giving you, but since they've let you down this is how I would go about getting the bare minimum amount of help out of them.",
      "author": "bandrus5",
      "created": 1633657028,
      "upvotes": 6,
      "replies": {}
    },
    "hftg5r5": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftg5r5/",
      "text": "It would be best to contact your grad coordinator, department chair or program director. Being that you have just started the program, no one knows you well enough at all yet, so that could also explain the lack of adequate empathy. You just haven't recently lost a distant relative who you might only see once a year. You have lost a *sibling* and this was also due to suicide. Eventually you are likely going to feel angry towards your deceased brother, and it may sicken you, but remember that it is a normal stage of grieving.\n\nUnfortunately, with what I am about to type here I speak from experience, as someone who attempted suicide 4 times.  Your brother was in a *lot* of pain. A suicidal person wants to *live* and *die* simultaneously and it is an emotionally excruciating Hell to be in for all concerned--the suicidal individual and his or her loved ones. The feelings of worthlessness are the worst, especially if you are a seriously judgmental person and judge *yourself* to be guilty of *failure*. I cried myself to sleep many nights. I'm sorry your brother lost his internal battle with his own mind. I keep up with depression research, and research indicates that clinical depression reduces the mind's ability to multitask, which means you just can't \"snap out of it.\" Years of therapy aided me; along with sertraline, good friends, and for certain people piling needless stress on me--complete with sudden ultimata--to stop doing that. \n\nYou have to prioritize your own mental health--this is your #1 priority. You are the best judge of what you need. It may be a prudent idea to look into available counseling resources at your school, if you are not going to take a medical leave of absence.",
      "author": "qwertyrdw",
      "created": 1633667098,
      "upvotes": 2,
      "replies": {}
    },
    "hfu76cg": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfu76cg/",
      "text": "You've gotten a lot of good advice here. So sorry for your loss. I think you should try reaching out to the university at a higher level (above your department). They should have protocols for close family loss, even including taking time off from your program.  Be gentle with yourself whatever happens. You've just been through a life changing loss, and you need time to adjust.",
      "author": "keeper4518",
      "created": 1633689064,
      "upvotes": 2,
      "replies": {}
    },
    "hfvm5w4": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvm5w4/",
      "text": "My closest friend passed to suicide and my world stopped, legit felt like I myself was dying. I went to disability resources and they became militant on my behalf but the caveat was I had to see a therapist and essentially get \"proof\" i.e. their statement, to agree that the loss impacted me so dramatically that I cannot work at the same level I was. \n\nSome professors are kind and helpful, others aren't. It isn't anything wrong with you, maybe moreso the system or their apathy but you don't have to fight them alone.",
      "author": "CoffeeCakeGod",
      "created": 1633714275,
      "upvotes": 2,
      "replies": {}
    },
    "hftf7aw": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftf7aw/",
      "text": ">I am possibly thinking about maybe dropping out of the program regardless since they seem to not care at all about their individual students\n\nWeird statement. Do you think you're punishing the program  or maybe its members by leaving? \n\nI would expect that the faculty could be understanding, maybe even let you withdraw for a term. It would appear that you can?",
      "author": "lednakashim",
      "created": 1633666500,
      "upvotes": 6,
      "replies": {
        "hfu3ud2": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfu3ud2/",
          "text": "What the fuck? What would make you assume that they would consider dropping out because they want to \"punish\" the program/its members by leaving?? \n\nThis is their first semester as a graduate student. It makes perfect sense why this experience might make one reconsider whether they want to pursue a degree at this program. They are very early stage and they probably are thinking that this could be an indicator that they will be supported in their endeavors long term, in which case it would be better for them to make a change earlier than it would be if they waited and the lack of support became too much to overcome later on. \n\nTo be clear, I'm not saying that is necessarily the case with this program given that their response could improve or there could be other indicators that suggest it is more supportive than this experience indicates. My point is that it makes sense why someone would be thinking that way and it **does not** make sense why anyone would assume they are doing so out of a desire to \"\"\"punish\"\"\" the program/members by leaving.",
          "author": "wknd_worrier",
          "created": 1633686184,
          "upvotes": -2,
          "replies": {}
        }
      }
    },
    "hfsxpur": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfsxpur/",
      "text": "I’m sorry for your loss, and it sounds like you’re getting met with nothing but bureaucracy. In my experience, there is humanity to be found, but you absolutely must seek it out and demand it. I’d consider who you know in your program who seems to have that human spark left in them. Even if they’re not precisely in the normal role for handling this, tell them your situation, express that you need an advocate and somebody who can connect with you on a human level about this, and that you feel you’re being met basically with just neutral bureaucratic response. Probably what will happen is that they’ll know what you mean, and help connect you with people who actually give a damn and can get you the resources you need. Don’t fight the bureaucrats, find the humans.",
      "author": "AllAmericanBreakfast",
      "created": 1633657346,
      "upvotes": 2,
      "replies": {}
    },
    "hftrqjz": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hftrqjz/",
      "text": "You're not overreacting.\n\nFuck that.",
      "author": "excelnotfionado",
      "created": 1633675398,
      "upvotes": -1,
      "replies": {
        "hgbf6w3": {
          "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hgbf6w3/",
          "text": "Imagine being down voted because I said eff staying in that situation lol. I said fuck that, I didn't say fuck anyone. Big difference. The people who downvote me either misunderstood or are the toxic people in academia. Please keep downvoting me if you're the latter. It only took two years of therapy and my toxic advisor getting fired for me to arrive to this point. Fuck staying in toxic situations.\nOP I hope your journey in bettering your environment is a success. It's a really tough thing that you're going through. You owe it to yourself to do what's best for you. I hope you get all the resources you need and you take it easy on yourself in this difficult time.",
          "author": "excelnotfionado",
          "created": 1634012175,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfu0r72": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfu0r72/",
      "text": "Dude … your classes should be a wash. Incompletes at worst, but really full withdrawal without penalty if that’s what you want.",
      "author": "CMRattray2020",
      "created": 1633683373,
      "upvotes": 1,
      "replies": {}
    },
    "hfudxex": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfudxex/",
      "text": "I'm so sorry about your brother. When I was doing my undergraduate degree, my brother also took his life. I had 2 years out from studying to recover. Could you possibly put things on hold?",
      "author": "Nearby_Explorer3940",
      "created": 1633693968,
      "upvotes": 1,
      "replies": {}
    },
    "hfueqgq": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfueqgq/",
      "text": "Wow, this must be so stressful. But there are some steps you can (and imho must) take:\n\nContact your school's accessibility/disability office. They can ensure that any accommodations you need can be put into an official record and liaise with profs to make sure you’re supported.\n\nContact your school's counseling service. I suspect that If you go to accessibility they will also say this. That way you can talk to someone about this and they can (a) help and (b) provide written record that you are bereaved and need accommodations. \n\nFinally, reach out to your student affairs office (they’re usually called something like that) and talk to them about possibly getting compassionate leave. I went thru some serious health issues during my phd and it was that office that helped me organize taking some time off without withdrawing.",
      "author": "coyotesandcrickets",
      "created": 1633694485,
      "upvotes": 1,
      "replies": {}
    },
    "hfuon1r": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfuon1r/",
      "text": "I'm really sorry to hear about your loss. You are absolutely right that the advisor and Profs should offer condolences and at least a response. But unfortunately, your advisor and Profs are not trained on how to handle this. They may be afraid of doing something wrong. You should seek counseling services through the school and ask for a leave of absence.",
      "author": "DeleteriousMutations",
      "created": 1633699864,
      "upvotes": 1,
      "replies": {}
    },
    "hfuy3f0": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfuy3f0/",
      "text": "Does your school have a dean of students? They can offer support and aid as necessary, and should be able to help you strategize how to handle the situation. The other person to reach out to would be the director of graduate studies in your department or school. They should be able to help prod faculty as well.",
      "author": "go_team_seaslug",
      "created": 1633704190,
      "upvotes": 1,
      "replies": {}
    },
    "hfvdzxt": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvdzxt/",
      "text": "I’m so, so sorry.\n\nSeconding all the advice to take it to a level above your professors/advisor.\n\nI went through a family suicide in undergrad and aside from emailing some professors, I was too shut down to advocate for myself. I would have failed out if the registrar at the VA hadn’t emailed me to come in, asked me what was going on, and then handed me a plan for withdrawal/rest/counseling etc. on a silver platter - which is what real support looks like- and which was ongoing resource for almost 2 yrs. My advisor on the other hand, once told me to keep my learning disability a secret because it’s no one else’s problem. Professors can be self-centered and myopic, admin that see a lot of students and situations will have more perspective/more to offer you.",
      "author": "phidippusalt",
      "created": 1633710890,
      "upvotes": 1,
      "replies": {}
    },
    "hfvqns5": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvqns5/",
      "text": "I am so so very sorry for your loss. \n\nYou’re not overreacting at all. My dad passed away unexpectedly the day that my spring semester started in my MA program. It was the semester I was supposed to graduate it. I immediately emailed our department head and my advisor saying that I wanted to take a leave of absence and explained what happened. They were so supportive. When I didn’t have it in me to collect the signatures from the profs in classes that I was enrolled to withdraw, my dept head did it for me so that I would be able to withdraw without penalties. They got me funding for the fall too. My dept head continued to check in and see how I was doing until I came back in the fall. \n\nUniversity housing was a different story 🙄",
      "author": "HistoryCat42",
      "created": 1633716141,
      "upvotes": 1,
      "replies": {}
    },
    "hfvradv": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvradv/",
      "text": "Very sorry for your loss. There is something about life that you pick up as you age, and I know I might sound cynical saying it: unless it is a blood relation or a spouse no one really cares much, and even those closest to you sometimes don't if you are unlucky.\n\nThe University will probably accommodate you the bare minimum to insure they are legally clear, and even that sometimes does not happen. Mainly because everyone is stuck in their own world trying to advance themselves and survive, so beyond value they can extract from you, your circumstances are a  nuisance or distraction.\n\nHowever, you will also notice within this depressing picture, there are people who genuinely care, who go above and beyond to help, those people are gems and are very rare. Keep them close, and be like them.\n\nTaking a break for a semester to clear your head is not  bad idea, but the department should be empathetic and ease the process for you rather than having you do all the legwork. Bereavement is the hardest thing we experience as human beings.",
      "author": "HilbertInnerSpace",
      "created": 1633716407,
      "upvotes": 1,
      "replies": {}
    },
    "hfvraos": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfvraos/",
      "text": "I'll add that you may want to consider switching programs or even institutions. If your professors aren't treating you how you want to be treated, you should find a different school. You deserve better.\n\nSo sorry for your loss, OP. Do whatever you need to, for yourself and your family❤️",
      "author": "callednotqualified",
      "created": 1633716410,
      "upvotes": 1,
      "replies": {}
    },
    "hfw3o5u": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfw3o5u/",
      "text": "I am very sorry for your loss. You deserve better. If I were you, I would fill out some kind of withdrawl (or deficit load) petition. That way, you can receive some money back and can take time to focus on your mental health. From personal experience, it can be hard to find an administrator willing to help.. and it can be ESPECIALLY frustrating when you are going through a hard time mentally",
      "author": "schoolisscary",
      "created": 1633721553,
      "upvotes": 1,
      "replies": {}
    },
    "hfw7tep": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfw7tep/",
      "text": "I would immediately go to the disability resource office and explain to them that you're under duress and ask for accommodations.",
      "author": "DJGlennW",
      "created": 1633723251,
      "upvotes": 1,
      "replies": {}
    },
    "hfwpcfv": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfwpcfv/",
      "text": "Reach out to the counseling service on campus, and to the dean of student's office. Both are places designed to help students deal with this, and honestly these resources are what your profs need to work with and refer you to use to begin with as they are not counselors (clearly by not replying...).\n\nMy condolences and best wishes to you and your family!",
      "author": "Happy-birdie-918",
      "created": 1633730699,
      "upvotes": 1,
      "replies": {}
    },
    "hfwq47p": {
      "link": "/r/GradSchool/comments/q3kg1i/my_grad_program_is_treating_my_brothers_suicide/hfwq47p/",
      "text": "I’m sorry you’re struggling with life while also dealing with your loss. \n\nI’m not sure how it is at other schools but my college had a specific team/office meant for dealing with things like this. You would email them and explain the situation (anything from a loss of a loved one to medical conditions etc) and they would reach out to your professors for you and provide you with additional resources if necessary. \n\nI would reach out to your schools disability center regarding accommodations. While they often deal with the obvious disabilities they deal with a lot of other stuff and they also hold some weight around campus in terms of getting professors to actually listen/recognize a situation.",
      "author": "Unlucky_Zone",
      "created": 1633731044,
      "upvotes": 1,
      "replies": {}
    }
  }
}