{
  "sid": "pvd4k5",
  "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/",
  "title:": "What's a nice way to ask my professor (through email) to write a recommendation letter he promised (verbally) to write for me for my PhD application?",
  "text": "\\[I'm not a native English speaker btw\\]\n\nI've worked with this professor on my research internship project and he promised (on a call) to write me a strong recommendation letter. I'm not used to calling him and I prefer to send a kind reminder through email. I don't know how to say it :)",
  "author": "cupcake-furry",
  "created": 1632596063,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "he99emj": {
      "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he99emj/",
      "text": "If you've already given the deadline, I would reach out roughly one week before the deadline like this (or an even shorter version):\n\nSUBJECT: Due 11/1, Letter of Recc for YOUR NAME\n\nBODY:\nHi Professor X,\n\nJust sending a friendly reminder that the recommendation letter for Y Program is due on November 1st at 3PM Eastern time (which is 12PM Pacific time for you).\n\nThe link to upload the letter is http://... and the email where I sent my CV and other materials has the subject line \"WHATEVER THE EARLIER SUBJECT LINE IS\".\n\nIf you could shoot me a quick reply once it's sent, it'll relieve my anxiety. Otherwise, I'll send another reminder ~24 hours before the final deadline.\n\nThank you,\nYOUR NAME",
      "author": "a-perpetual-novice",
      "created": 1632598525,
      "upvotes": 3,
      "replies": {
        "he99fts": {
          "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he99fts/",
          "text": "[Fixed formatting.](https://np.reddit.com/r/backtickbot/comments/pvdwjj/httpsnpredditcomrgradschoolcommentspvd4k5whats_a/)\n\nHello, a-perpetual-novice: code blocks using triple backticks (\\`\\`\\`) don't work on all versions of Reddit!\n\nSome users see [this](https://stalas.alm.lt/backformat/he99emj.png) / [this](https://stalas.alm.lt/backformat/he99emj.html) instead.\n\nTo fix this, **indent every line with 4 spaces** instead.\n\n[FAQ](https://www.reddit.com/r/backtickbot/wiki/index)\n\n^(You can opt out by replying with backtickopt6 to this comment.)",
          "author": "backtickbot",
          "created": 1632598541,
          "upvotes": 1,
          "replies": {}
        },
        "he9aweu": {
          "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he9aweu/",
          "text": "Yes he already knows about the deadline, Thank you for the email sample I really appreciate it!",
          "author": "cupcake-furry",
          "created": 1632599194,
          "upvotes": 1,
          "replies": {
            "he9xdod": {
              "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he9xdod/",
              "text": "It's fine to want to prof to not wait til the last minute. But oftentimes there are other more pressing or urgent deadlines, so even though it's making you anxious, unfortunately some profs will just submit things around the deadline. Doesn't mean they care any less, it just means that there's a lot going on. \n\nThe best is to remind them a week before, like the other comments have suggested and not be too worried about it.\n\nEdit: having said that, reminders are VERY helpful for profs, and you're not bugging them by sending a reminder a week before the deadline. There are lots of things going on, lots of students, lots of other deadlines, so it is perfectly fine AND encouraged to send reminders!! (But reminder a month ahead might not be super helpful).",
              "author": "tardarsource",
              "created": 1632609489,
              "upvotes": 2,
              "replies": {
                "hebfkuj": {
                  "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/hebfkuj/",
                  "text": "Thank you for the advice, That makes sense for me. If I send a reminder now he will probably forget about it, and it will be too awkward for me to send another one in the future.",
                  "author": "cupcake-furry",
                  "created": 1632637733,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "he962bs": {
      "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he962bs/",
      "text": "Have you provided your advisor with the information they need to submit your recommendation letter? Did you sign a waiver about seeing the letter, which is generally recommended when applying to grad school?\n\nIf you haven't done those things, that's a reason to contact your advisor.\n\nIf you haven't given them a copy of your CV, you could forward it to them and say you're sending it along in case it helps.",
      "author": "raistlin65",
      "created": 1632597034,
      "upvotes": 7,
      "replies": {
        "he97ybt": {
          "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he97ybt/",
          "text": "Yes, Unfortunately  my professor has all information including the latest version of my CV. Otherwise it would've been a clever way to remind him thank you!",
          "author": "cupcake-furry",
          "created": 1632597871,
          "upvotes": 2,
          "replies": {
            "he98tdi": {
              "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he98tdi/",
              "text": "Then email and say you were just checking to make sure there's not any other information you can provide.\n\nHowever, if the application deadline for when the graduate school requires the recommendation letter be submitted is months away, then you're jumping the gun worrying about it now. I would contact your professor about a month before that deadline.",
              "author": "raistlin65",
              "created": 1632598263,
              "upvotes": 5,
              "replies": {
                "he9acel": {
                  "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he9acel/",
                  "text": "I agree, it's exactly one month before the deadline (31st October). I just don't want to wait till last minute.\n\nThank you for the advice!",
                  "author": "cupcake-furry",
                  "created": 1632598949,
                  "upvotes": 2,
                  "replies": {
                    "he9aymu": {
                      "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he9aymu/",
                      "text": "So your timing is perfect. And  \"is there any more information I can provide\" is a good nudge, without having to say you're reminding your advisor :)",
                      "author": "raistlin65",
                      "created": 1632599221,
                      "upvotes": 3,
                      "replies": {
                        "he9bp6d": {
                          "link": "/r/GradSchool/comments/pvd4k5/whats_a_nice_way_to_ask_my_professor_through/he9bp6d/",
                          "text": "Haha that's exactly what I'm trying to avoid writing in the email!",
                          "author": "cupcake-furry",
                          "created": 1632599544,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634067376
}