{
  "sid": "i3pjw6",
  "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/",
  "title:": "Explaining to my family when I'll be done with grad school makes me feel like NASA explaining when Voyager left the solar system.",
  "text": "\"No, that was the defense seminar. The part where I give a public lecture about my work.\"\n\n\"No, I already wrote my thesis before that but I have to make some revisions based on committee recommendations.\"\n\n\"Nope that was just submitting it for formatting review.\"\n\n\"It seems done but I don't get the diploma until the end of the term.\"\n\n&#x200B;\n\nAnyways, I just entered the academic Oort Cloud today! My final thesis draft is out to my committee!",
  "author": "Darwins_Dog",
  "created": 1596568112,
  "over_18": false,
  "upvotes": 707,
  "upvote_ratio": 0.99,
  "comments": {
    "g0g3qar": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0g3qar/",
      "text": "\"So you've got, what, another year left?\"\n\nNo, I have 4.",
      "author": "ctfogo",
      "created": 1596637129,
      "upvotes": 1,
      "replies": {}
    },
    "g0evnsq": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0evnsq/",
      "text": "I like \"Academic Oort Cloud\". Congratulations!",
      "author": "Weaselpanties",
      "created": 1596602604,
      "upvotes": 3,
      "replies": {}
    },
    "g0eneid": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0eneid/",
      "text": "wait until you try to explain your thesis…",
      "author": "plnxx",
      "created": 1596597050,
      "upvotes": 3,
      "replies": {}
    },
    "g0elvox": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0elvox/",
      "text": "I worked in event production before switching to I/O psych and getting a Master’s in it. They didn’t know what I did before, they don’t know what I do now. Luckily now that I do research a couple family members who do medical research kinda vibe on the scientific method with me even tho I/O psych is still somehow alien to them.",
      "author": "justfreehouse",
      "created": 1596596122,
      "upvotes": 2,
      "replies": {
        "g0ftrzw": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0ftrzw/",
          "text": "This perspective is what some people here are missing. I can't fully explain the graduate level math research projects I worked on any more than I can fully explain what I do in my current job in health insurance data. \n\nLuckily, people repeatedly ask the same questions, so I can spend time improving my explanations but it's still never going to approach the understanding someone in the field has.\n\n Also, these are fundamentally just people being interested in you and your life. Their curiosity starts in a good place even if it's flawed.",
          "author": "remainderrejoinder",
          "created": 1596632163,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "g0ekm85": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0ekm85/",
      "text": "Yes! This just happened to me too (though to a lesser degree) after my candidacy exam. The number of times that I explained that \"No, this doesn't mean I have my PhD yet\" I had the explanation memorized. The concept of being a candidate but still having several years of work left was entirely foreign to them",
      "author": "therealangusbeef",
      "created": 1596595362,
      "upvotes": 2,
      "replies": {}
    },
    "g0egnp4": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0egnp4/",
      "text": "It sounds kinda harsh, but this kind of stuff is exactly why I'm pleased my family just doesn't care. And my SO's family thinks education is \"a waste\". Riight.  \n\nAnyways, congratulations on how far you've come! I know this COVID stuff sucks, but it sounds like you have a lot of moral support, so a little more adversity won't hurt ya.",
      "author": "luna_Quix",
      "created": 1596592956,
      "upvotes": 7,
      "replies": {}
    },
    "g0ebvjb": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0ebvjb/",
      "text": "My family still asks me if I'm going to classes and how my exams went.\n\nI just say they all went well.",
      "author": "goodytwoboobs",
      "created": 1596590073,
      "upvotes": 19,
      "replies": {
        "g0eki7i": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0eki7i/",
          "text": "\"How's school going?\"\n\nWell...it's not really school at this point, more like a job, and I haven't taken classes since the end of my second year sooOOo...\n\nIn one ear and out the other.",
          "author": "Doktor_Dysphoria",
          "created": 1596595293,
          "upvotes": 11,
          "replies": {
            "g0gi7tx": {
              "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0gi7tx/",
              "text": "I still call working on my dissertation and research job as \"homework\" so im not doing myself any favors",
              "author": "katiedid95",
              "created": 1596643599,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g0eau4o": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0eau4o/",
      "text": "This is so annoying. Especially explaining to people that haven't been to grad school and being the only person in my family to graduate with a masters. I feel your pain. The best thing to do is to know that they will never understand at least in my opinion. Best of luck to you.",
      "author": "HungryDragon93",
      "created": 1596589453,
      "upvotes": 1,
      "replies": {}
    },
    "g0e5niv": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0e5niv/",
      "text": "I'm going through the exact same thing now! I'm finishing up my thesis and every time I've called home for the past month I've gotten a \"congratulations\" and had to explain, \"no, not yet...\"",
      "author": "Simple_Barracuda",
      "created": 1596586414,
      "upvotes": 1,
      "replies": {}
    },
    "g0e08m2": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0e08m2/",
      "text": "This is me, but with the additional challenge of trying to translate all of it into broken Spanish so my mom can understand.",
      "author": "_mexengineer12",
      "created": 1596583405,
      "upvotes": 10,
      "replies": {}
    },
    "g0dwuc1": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0dwuc1/",
      "text": "This hits too close to home. I’ll also add on top no one having any idea what my field is nor why I’m researching what I’ve chosen to research. I’m a Medical Anthropology PhD and my family still thinks I study dinosaurs. I do field work in hospitals. I’ve since stopped correcting them because I’m convinced they forget anything I’ve said and immediately Leo DiCaprio inception themselves back to dinosaurs.",
      "author": "Brojangles1234",
      "created": 1596581617,
      "upvotes": 31,
      "replies": {
        "g0e4g37": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0e4g37/",
          "text": "\"Leo DiCaprio inception themselves back to dinosaurs\"\n\n***\\*WHEEZE\\****\n\nI don't why I found this so funny..  I feel your pain, though.  Trying to explain what you actually do without mindfucking people with the details is impossible sometimes.",
          "author": "Big-Sploosh",
          "created": 1596585720,
          "upvotes": 16,
          "replies": {}
        },
        "g0ekd4l": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0ekd4l/",
          "text": "Try being a behavioral neuroscientist, yet your family keeps telling people you're a neurologist. I too gave up correcting them.\n\nEdit: also, bonus points for unrealistic expectations of future salary!",
          "author": "Doktor_Dysphoria",
          "created": 1596595204,
          "upvotes": 9,
          "replies": {
            "g0elh3g": {
              "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0elh3g/",
              "text": "“He studies brains to understand behavior.” All they need to know.",
              "author": "justfreehouse",
              "created": 1596595884,
              "upvotes": 5,
              "replies": {
                "g0elppw": {
                  "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0elppw/",
                  "text": "I feel like I should make them some sort of reference card with simple one line answers like this for when they need to brag with their friends.",
                  "author": "Doktor_Dysphoria",
                  "created": 1596596024,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "g0edyy0": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0edyy0/",
          "text": "Scene: *back of a dinosaur's head haloed in sunlight as it squats in a jungle*\n\nCut to: *top keeps spinning*",
          "author": "PyrocumulusLightning",
          "created": 1596591332,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g0dr9r7": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0dr9r7/",
      "text": "The most frustrating exchange I had was when I told them how research wasn't going well. These are the responses I got: \"what do you mean you are struggling to solve this problem?\" \"Aren't your supervisor an expert?\" \"Shouldn't your supervisor know the answer?\" \"You just didn't study hard enough, study harder!\"",
      "author": "eScKaien",
      "created": 1596578812,
      "upvotes": 45,
      "replies": {
        "g0e9zbc": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0e9zbc/",
          "text": "I got “Why don’t you just look it up in a book?” from my dad once when I told him about a problem I was having in my research.",
          "author": "jackass_dc",
          "created": 1596588947,
          "upvotes": 38,
          "replies": {
            "g0eley7": {
              "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0eley7/",
              "text": "\"Dad I'm WRITING the book\"",
              "author": "1l1k3bac0n",
              "created": 1596595849,
              "upvotes": 34,
              "replies": {}
            }
          }
        },
        "g0dsp4c": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0dsp4c/",
          "text": "So true. I'll try to open up to my family about small roadblocks, which are really just part of research, and they think it's a crisis or something.",
          "author": "SapiosexualStargazer",
          "created": 1596579536,
          "upvotes": 18,
          "replies": {}
        },
        "g0e5hpq": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0e5hpq/",
          "text": "This, so much. Recently I was worried I wouldn't be able to publish something I had found due to a similar paper being released as I was writing it up (it's fine now though), and my parents were like \"but you have another publication already, what are you worried about??\"",
          "author": "Simple_Barracuda",
          "created": 1596586320,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "g0dlirb": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0dlirb/",
      "text": "as a planetary science grad student, this analogy is spot on. right down to the milestones being so ridiculously far apart that people who arent “in it” don’t comprehend",
      "author": "cloudyskies11",
      "created": 1596576093,
      "upvotes": 37,
      "replies": {}
    },
    "g0dhrzb": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0dhrzb/",
      "text": "This is why I resist giving any details to my family about anything to do with school. They only actually need enough details to talk to other people about me. So I have told them: my degree, my department, how many classes I'm in that semester, my estimated graduation date, and that I do not have a thesis topic yet. They will get exactly that information until I have a thesis topic at which point I'll give them the exact, high-level answer they should give to other people. As you have found, more details only confuses them and creates more hassle for you.",
      "author": "MidnightSlinks",
      "created": 1596574499,
      "upvotes": 148,
      "replies": {
        "g0ds0kw": {
          "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0ds0kw/",
          "text": "That's been my plan for a while, but once everyone sees your defense there's no more dodging the questions. Thanks to COVID I had like 100 people tuned in and they all want updates. lol \n\nI don't want to say I'm done until its truly true. I was pretty confident about being done by now, but then March happened.",
          "author": "Darwins_Dog",
          "created": 1596579190,
          "upvotes": 32,
          "replies": {
            "g0e16pp": {
              "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0e16pp/",
              "text": "I feel you. I would say \"There are a lot of little steps at the end. I'll let you know once it's all final.\" Don't explain the steps because they'll forget what you said before you're even done talking.\n\nWhat I find most annoying about all these questions is that they are basically saying to you that they think it's possible that you finished your PhD and are withholding that information from them. Unless you are the cagiest mother fucker on the planet, it's actually pretty insulting. Like, if you're not sure if someone in your immediate family has finished their PhD yet, they haven't.",
              "author": "MidnightSlinks",
              "created": 1596583912,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "g0dfuk7": {
      "link": "/r/GradSchool/comments/i3pjw6/explaining_to_my_family_when_ill_be_done_with/g0dfuk7/",
      "text": "Exactly.",
      "author": null,
      "created": 1596573687,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634066965
}