{
  "sid": "pks4wp",
  "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/",
  "title:": "Burnout? DEI service as a white woman in engineering",
  "text": "I work in the field of equity and engineering. I’m a white woman. I love working in equity and incorporating it into my research and helping move towards real change.\n\nBut I’m am SO incredibly burnt out. I spend more of my time volunteering for committees and stuff than doing actual work on my research. I feel so incredibly guilty saying no, because I know I’m the most privileged one volunteering most often in the space. \n\nI’m responding to emails until 2am right now. Emails that are telling me I need to provide times to meet next week to create a DEI newsletter. \n\nI’m so tired. And I’m so stressed. I don’t know how to say “no” without coming across as a bitch, especially because I’m the one in the room with power because of who I am.\n\nBut it is so unsustainable. It makes me want to quit doing equity work all together. I’m so torn, I’m so tired, and I always feel guilty. Help.\n\nEdit: None of this work I’m referring to is at the university level. It is national level work- national committees for a variety of organizations in my field I’ve been involved in for a couple years now.",
  "author": "river_wave",
  "created": 1631168176,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.65,
  "comments": {
    "hc6g8cq": {
      "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc6g8cq/",
      "text": "People are a complex blend of experiences, identities, baggage, and relationships so I don't want to assume why you're feeling what you are. If your guilt is driven by a feeling of \"I should do more, I am more privileged, thus I should suffer more\" then ask yourself why you feel the need to be the lone savior? That's not coherent, you're punishing yourself rather than lifting each other up, nor is it useful in building equitable, accessible, or anti racist institutions. Burned out people make for bad workers.\n\nThere are whole committees of people you work with, who, if they want to improve equity and are operating in good faith should understand one person doing a ton of work until 2AM isnt very equitable. Lean in on these people, part of community building is having people you can trust and rely on to help when things get tough. Unless you are genetically privileged to be one of those people to operate fine on 4 hours of sleep, you're hurting yourself, and won't be as effective at advancing your research goals or building more equitable academia. It takes a village, and neither your committee nor you can't expect to do this kinda thing on your own. \n\nAsk for help, be honest with the people you work with about what you need in terms of relaxing the demands, and just make sure everyone's expectations are on the same page. If they are in it to build equity and not just pad the resume and build a career in DEI (which is a real problem, lots of jaded careerists just saying the right lingo to the right people), then they'll understand.",
      "author": "Outmodeduser",
      "created": 1631194044,
      "upvotes": 5,
      "replies": {
        "hc6leyn": {
          "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc6leyn/",
          "text": "Thank you. This was really helpful. My guilt is definitely feeling like since my life is easier because of my privilege, I need to give much more. What you said makes sense in regards to that.\n\nI’m running into an issue with one very demanding person who continues to put more pressure on me to do things because of my privilege. I get why. But it isn’t working, like you said. I’ll set up a meeting with her next week to chat about what you brought up (expectations, etc.). (I’m not the only one overwhelmed by this person.) \n\nNeeded this, thanks!",
          "author": "river_wave",
          "created": 1631196508,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hc5m5x0": {
      "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc5m5x0/",
      "text": "Remember that a mentally healthy, passionate, consistent you is of more value than a burnt out you. If that means you need to scale back a bit on the extra DEI things then do it. Be kick ass at your research and the (fewer) extras that you take on. From a practical stand point a gracious way to say no may be to suggest others who could help out instead of you. You're absolutely allowed to just say no though. \n\nThis is more my two cents and maybe bad advice, idk, but have you examined why you feel so compelled to do all this work in relation to your own privilege? Guilt or shame? Anger? Desire to lift others up?  Compassion or empathy? In my experience, if there is any ounce of trying to do this out of some need for penitence you will burn out quicker. Come to terms with the privilege you do have and humbly wield it for what is good, don't run from it. Easier said than done because it sure is a lot to unpack. This may not apply to you, so I may be writing this more for me than you, but I think it's important to think about.",
      "author": "AMostAverageMan",
      "created": 1631170984,
      "upvotes": 5,
      "replies": {
        "hc6ltba": {
          "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc6ltba/",
          "text": "Thank you! Definitely need some more reflecting, as it feels like everything you mentioned applies (except anger- I get upset more than angry at it all).\n\nI’m going to try to communicate better with some folks who put the pressure on me. I think it’s also one of those things where people ask me more because they know I’ll get it done. When really they should be asking other people too. Thank you! I really needed this. I never know who to bring stuff like this up to in real life, as it sounds like I’m complaining about problems I face in diversity work as a person with a solid level of privilege.",
          "author": "river_wave",
          "created": 1631196689,
          "upvotes": 4,
          "replies": {
            "hc6t406": {
              "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc6t406/",
              "text": "Good luck! I hope you can have some patience with yourself as you figure this stuff out.",
              "author": "AMostAverageMan",
              "created": 1631199899,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hc5kjlb": {
      "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc5kjlb/",
      "text": "What a weird post. Nobody cares about your genuflecting. Do what makes you happy, even if that means only working for yourself. You only have one life to live, stop wasting it worrying about people and causes that don't care about you.",
      "author": "calmlaundry",
      "created": 1631169541,
      "upvotes": -6,
      "replies": {
        "hc6e6cx": {
          "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc6e6cx/",
          "text": "You could have just said \"I'm a self interested selfish asshole, only do things that benifit you and make you happy to extract as much pleasure before you die.\" and saved on the word count while also being more compelling.",
          "author": "Outmodeduser",
          "created": 1631192989,
          "upvotes": 2,
          "replies": {}
        },
        "hc5kx10": {
          "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc5kx10/",
          "text": "Helping others gives me purpose to life. Equity is important. You sound like someone who is even more privileged than me. Congrats.",
          "author": "river_wave",
          "created": 1631169863,
          "upvotes": -3,
          "replies": {
            "hc988vc": {
              "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc988vc/",
              "text": "Honestly, your response here is very self-telling. First, privilege is not something you can fully measure, and it's concerning that it's become this way. Take gender and race, these result in privileges that aren't fully comparable. One person could be more likely to be killed while walking around late at night while another person could be more likely to be killed during a traffic stop. The point of intersectionality is not to measure which is worse, but to say that both are bad and we are stronger together advocating for both people to be safer.\n\nAs for \"helping\"...\n\nI'm lgbtq and cis-het people trying to do dei work for us is a nightmare. So many people don't listen to our community's needs. They read one Twitter thread or listen to one vocal activist and assume that everyone in the community wants that. Take pronouns. At my grad school, our old DEI coordinator (a white cis-het woman) made everyone say pronouns each week in her DEI class. Many of us actually in the community, including me, believe that practice is unsafe. We don't think that people should have to choose between lying and outing themselves to people who might not be sympathetic or understanding. In queer spaces, we collectively understand that outing someone else is a big no-no. In a majority cis-het space, if I'm not fully out, I run a big risk coming out to the whole group because many of them don't understand that.\n\nLook around and ask yourself: do my fellow students in those communities I am trying to serve support my work? Am I ever condescending towards them, or am I listening to them? If I am amplifying a voice, and someone else from that community expresses concern, what is my reaction? Am I willing to share the stage, so to speak, with people from those communities? Who comes to my events? Am I being the \"white savior? What does my ultimate goal look like?\n\nIf your goal in these activities is actually self-serving, then of course you'll burn out. It's clearly not having the effect you desire for yourself.",
              "author": "era626",
              "created": 1631236954,
              "upvotes": 2,
              "replies": {
                "hc9pcan": {
                  "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc9pcan/",
                  "text": "I definitley what you’re saying- I’m quiet in these spaces and do the background work that needs to be done. I know to listen, I know it isn’t my space. I’m getting burnt out not because I am asked to do more things. And I’m a doer.\n\nI agree, centering your voice and perspective is not helpful when it isn’t about you. This isn’t the issue I have. Thanks for your perspective and input though! Definitely have seen that occur in spaces. I always remind folks that just because they (a white person typically) have had an experience, it doesn’t mean that’s the experience others have had.",
                  "author": "river_wave",
                  "created": 1631244802,
                  "upvotes": 1,
                  "replies": {}
                },
                "hc9pp7c": {
                  "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc9pp7c/",
                  "text": "Also this specific response you’re referring to that is downvoted (and I get now why)- it comes across as white-savior-y. Not what I meant. Just saw that person’s response and was upset and didn’t know what to say. It’s like, duh, this stuff matters.\n\nI should have said “because I have morals.” That would have been more accurate. Not “it gives me purpose” (though, I love trying to help society be better for everyone and I find it purposeful) I can see how that doesn’t come across right.",
                  "author": "river_wave",
                  "created": 1631244978,
                  "upvotes": 1,
                  "replies": {
                    "hc9qshs": {
                      "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc9qshs/",
                      "text": "I mean...your post itself was about a newsletter. What result does a newsletter create? Again, from an lgbtq perspective since that's what I know best, plenty of schools walk the walk and talk about all this stuff, but do professors and my fellow students actually treat me with respect? Are there avenues closed to me because of my minority identity? A newsletter is honestly just busy work. So to me your whole post sounds questionable.",
                      "author": "era626",
                      "created": 1631245522,
                      "upvotes": 1,
                      "replies": {
                        "hc9xw90": {
                          "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hc9xw90/",
                          "text": "It’s a newsletter for a national research committee on gender research in my field. It’s not a school newsletter. None of the DEI work I’m referring to is at my university. It’s national level work. The newsletter exists already. The meeting is to talk the newsletter again. Every committee in this organization has newsletters- they are important and we have at least 300 people who read them each time.\n\nThat was confusing, I could have been clear that it isn’t at the university level.\n\nEdit: two typos",
                          "author": "river_wave",
                          "created": 1631249475,
                          "upvotes": 1,
                          "replies": {
                            "hcb2ep6": {
                              "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hcb2ep6/",
                              "text": "Ahh, SWE? My mom was a chapter VP once. It's good to be involved in that sort of thing, but if now is not a good time for you, it's a big org and others can surely fill in. Just let them know you're overwhelmed with school. \n\nAnd 300 people reading something doesn't necessarily create change. SWE's outreach with high schoolers and support for current college students is far more valuable.",
                              "author": "era626",
                              "created": 1631279019,
                              "upvotes": 1,
                              "replies": {
                                "hcb9kud": {
                                  "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hcb9kud/",
                                  "text": "Nope. It’s a research newsletter of a national research organization, a committee part of that organization part of my specific field. Talking about research and information in regards to the state of things in research for gender and my specific field. It isn’t a professional society newsletter. I don’t know how to describe the importance of it without giving away my identity on here. But it’s critical to keep everyone informed. \n\nI said “DEI newsletter” as that is what one of the members wants to call it now/change it to that. I honestly don’t even know what they mean. I guess I’ll find out. And it was just ONE example of work for a much larger issue I’m having with my time. I’ve organized webinars, assisted with workshops- you name it. \n\nI get professional society newsletters aren’t the best. This isn’t that.\n\nEdit: I don’t think I’m describing it well to you enough. So I think I’ll end my convo here. A couple of the posts were helpful, so I’ll think and reflect on those more and leave it there.",
                                  "author": "river_wave",
                                  "created": 1631282362,
                                  "upvotes": 1,
                                  "replies": {
                                    "hcbewz1": {
                                      "link": "/r/GradSchool/comments/pks4wp/burnout_dei_service_as_a_white_woman_in/hcbewz1/",
                                      "text": "Well, if you carefully consider your own theory of change, you may find yourself realizing where your burnout issue stems from. I'd give it a shot if I were you. Look at the bigger picture and what you achieve instead of getting frustrated putting out fires. \n\nFWIW a friend of mine has been instrumental in enacting criminal justice reform in one State and reframing his actions and making conscious career and life choices have led him to be able to make such valuable contributions to society. He's been in bad spots mentally, but taking the time to reflect instead of burning himself out with newsletters, webinars, and workshops have led to the end of major racial discrimination issues and human rights violations. Every person I know who has been able to create real change helps themselves first instead of putting out small fires, so that they have the time and energy to put out the big fires.",
                                      "author": "era626",
                                      "created": 1631284658,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634065195
}