{
  "sid": "pv85su",
  "link": "/r/GradSchool/comments/pv85su/how_to_convert_a_thesis_proposal_into_a_thesis/",
  "title:": "How to convert a thesis proposal into a thesis?",
  "text": "I am currently working on my thesis for MSc. The thesis proposal was done very well in my mind. But I am stuck now not knowing what to do. The data collection and analysis are already made. the results are done. Only have no idea how to organize them into a proper thesis. Please advice.",
  "author": "Fresh-Future-3316",
  "created": 1632581300,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "he9egtg": {
      "link": "/r/GradSchool/comments/pv85su/how_to_convert_a_thesis_proposal_into_a_thesis/he9egtg/",
      "text": "Here’s the standard method that I’ve seen and did (MSCE US)\n \n1. Introduction - what is your problem/question, why is it important, and how will you answer it? \n\n2. Literature review - what have other people done in this area already? What work is your work based on. \n\n3. Methods - describe what you did. What data you collected and how. \n\n4. Results - what data did you collect and a little bit about meaning \n\n5. Analysis - what does your data mean\n\n6. Conclusion - restate your problem, and describe how what you have done solves the problem.",
      "author": "MsOctober",
      "created": 1632600785,
      "upvotes": 2,
      "replies": {}
    },
    "he8p43b": {
      "link": "/r/GradSchool/comments/pv85su/how_to_convert_a_thesis_proposal_into_a_thesis/he8p43b/",
      "text": "Basically you'll explain your hypothesis, then explain your methodology, why you think it is correct, state your findings and explain them together with your hypothesis. After that is conclusion. That's the basic structure if you are using quantitative research and analysis. It is slightly different if one is using pure qualitative analysis. Keep in mind that thesis is all about explaining your thesis proposal, and arriving at a conclusion based on findings.",
      "author": "TrySubstantial7579",
      "created": 1632589572,
      "upvotes": 10,
      "replies": {}
    }
  },
  "updated": 1634066799
}