{
  "sid": "gwr6x7",
  "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/",
  "title:": "How do you re-ignite your interest and motivation after so much burn out and imposter syndrome?",
  "text": "I'm not going to completely hate on myself for being unproductive at this time, but at some point I feel like I need to get back to normal. I can't help but feel envious of people who are able to be productive during the pandemic (and now the protests, and... just generally anxiety-inducing events). At this point I am months behind, and can't stop kicking myself for not getting anything done. I kind of just feel tiredness and anxiety. When I finally get something done, I see a colleague or other academic who has managed to publish or find a job or a fellowship during this time, and suddenly I am no longer proud of the fact that I was able to catch up on my e-mails finally or write a conference abstract.\n\nAnd this is more than just current events getting me down, I've always felt like this. This is probably a bit silly, but I've always been super envious of people who are like Leslie Knope. She has so much energy, drive, and is always on top of things. I've tried so hard to be like that kind of person, but I don't have it in me. I'm always sort of half paying attention to my work, I don't feel like any one thing gives me that much passion, and I have no sense of organization or time management. I like my work but I'd be fine if I wasn't doing it, since there isn't really anything I love enough to HAVE to do it. And I feel like that's an abnormal outlook to have for an academic. So I am really jealous of people who care that much about something. \n\nI do keep \"to do\" lists now and am getting more productive, but it never feels like quite enough. And my drive for something is very short-term. Does anyone else feel like this? What do you do to keep powering through? Is it normal to enjoy your line of work but not LOVE it?",
  "author": null,
  "created": 1591307721,
  "over_18": false,
  "upvotes": 330,
  "upvote_ratio": 0.99,
  "comments": {
    "fszofsd": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fszofsd/",
      "text": "Thank you for posting this question, and thank you to everyone for the insight and encouragement. I'm a first-year PhD student and definitely feeling the same way, but reading all of these responses has been immensely helpful. It's nice to know that just about everyone goes through periods like this. You all are the best. Stay safe and take care out there.",
      "author": "brainsick414",
      "created": 1591376855,
      "upvotes": 2,
      "replies": {}
    },
    "fsz5m9n": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsz5m9n/",
      "text": "Gosh....exact same situation here. I'm in the tail end and there is still a shitload to get done. Feel like I have no clue what I'm doing but I need to get it done anyway. It stresses me out and makes me feel depressed, anxious and inadequate!",
      "author": "Juice2003",
      "created": 1591367712,
      "upvotes": 2,
      "replies": {}
    },
    "fsymh9s": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsymh9s/",
      "text": "I don't have any advice, but I empathize. I see people in my field who are workaholics and are obviously obsessed with what we're studying. For me, getting my work done is a matter of discipline, not obsession. I wish that I had that all-consuming passion that seems to lend itself to perpetual motivation.",
      "author": "balderdash9",
      "created": 1591355387,
      "upvotes": 1,
      "replies": {}
    },
    "fsy25tm": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsy25tm/",
      "text": "I could have written your post. No advice, just solidarity.",
      "author": "sonamata",
      "created": 1591337139,
      "upvotes": 2,
      "replies": {}
    },
    "fsxnslw": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxnslw/",
      "text": "I have no advice, I just wanted to say thank you for asking this question. You have described my problems almost exactly. Reading the comments was helpful, and so was the knowledge that I’m not alone. I hope we can both get through this!",
      "author": "aprendemos",
      "created": 1591327426,
      "upvotes": 6,
      "replies": {
        "fsxyo79": {
          "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxyo79/",
          "text": "Glad to hear it was helpful, sometimes we just all need to vent and hear how others are handling their issues. Good luck with things!",
          "author": null,
          "created": 1591334549,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fsxjp04": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxjp04/",
      "text": "Im about 12 months or so out from finishing and I am extremely burned out. I have a hard time even wanting to write my paper at all. \n\nHowever on rare occasions I start working on it, make decent progress, and I feel like my old self again for a few moments.\n\nStick it out. Don't be too hard on yourself, and take one step at a time. It is all going to be fine.",
      "author": "Lord_Blackthorn",
      "created": 1591324965,
      "upvotes": 3,
      "replies": {}
    },
    "fsxijwd": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxijwd/",
      "text": "I understand what you are going through as I was facing a sense of being an imposter to my own academic success so far as a Graduate student pursuing a Masters degree in Strategic Communication. One thing to keep in mind is not to be obligated to love your work as much to the point of being overwhelmed over the fear of not being recognized. I would imagine your peers have appreciate the fact in which your contributions (i.e. collaborating with a faculty member for research opportunities in relation to your academic goals.) Another thing to reigniting your interest is finding the balance between your academic work and what you love to do in your free time. I read leisurely as much as I can, but also keep your mind busy without the excess pressure as well as obtaining new skills. All of these things could better maintain your sense of control of what you do going forward and not to place emphasis over what you can’t control.",
      "author": "gabe89san",
      "created": 1591324303,
      "upvotes": 3,
      "replies": {}
    },
    "fsxg8mn": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxg8mn/",
      "text": "I used to feel the same way whenever school isn't in session. I would start slacking off and will be lost in the holiday period. However, one of my courses during my undergrad has forced me to read a book called '7 habits of highly effective people' by Stephen Covey. This book changed my life. Even in times  like this, it has helped me to become productive, and trust me, the book has the ability to make you a better person if you allow it. I highly recommend this book to everyone, including my family members. Good luck.",
      "author": "badmintonboy888",
      "created": 1591322955,
      "upvotes": 7,
      "replies": {}
    },
    "fsxflef": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxflef/",
      "text": "Preach!!!!",
      "author": "sinfoniaba",
      "created": 1591322574,
      "upvotes": 3,
      "replies": {}
    },
    "fsxbqdv": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxbqdv/",
      "text": "Go back to your roots to see where the motivation spurred interests.\n\nIf that isn't good enough then it is good to start looking at generating motivation and understanding that by digging deep to we create better habits that are a better vision of ourselves.\n\nIf that isn't good enough is to start feeling sorry for yourself, find spite, and make yourself move forward without your consent.\n\nEither way, you are going to have to move forward.\n\nFun fact: Happened when I was transferred to new business after burned out and being surrounded by a bunch of managers willing to throw a store under for their own spite. I was able to generate the motivation needed to become a better manager.\n\nStill shut the place down after it was being run down for so long. It did not matter as I was able to keep myself kicking for a few months longer than what was originally offered and able to complete my education, too.",
      "author": null,
      "created": 1591320359,
      "upvotes": 3,
      "replies": {}
    },
    "fsxbj5o": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxbj5o/",
      "text": "Hi are you me?  I just got through my first year of PhD and have been suffering from this same feeling throughout.  I am Autistic and ADHD, with depression and some anxiety as well, so I guess I have some excuse...  But that doesn't mean I don't feel like I should be further ahead.  Instead I goof off and do nothing all day when I should be working. \n\nI love my program and my field and I've wanted to be a researcher since I was in high school.  It's hard not to wonder what's wrong with me and why I can't just do it.",
      "author": "TheMechEPhD",
      "created": 1591320243,
      "upvotes": 8,
      "replies": {}
    },
    "fsxasd3": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsxasd3/",
      "text": "I'm in an extremely similar place. I don't think I've ever felt less motivated to finish. My plan was to be done in June and now it's to finish in August.\n\nI haven't solved this whole problem and I keep getting distracted by, well *gestures broadly at everything*. \n\nBut I do know this: I'm not going to get through this hating myself. It has been a journey of 7 years (my whole PhD), but I refuse to live in endless guilt anymore. Yes, sometimes I wish I worked a little harder or was more focused, but the work is only a small part of my full humanity. The parts of me that want to do nothing but grieve for the pain in the world are valid and deserve as much attention as the part of me that obsesses over algorithms and equations.\n\nTake care of yourself. You are important and your struggles matter. Give them the space they deserve.",
      "author": "thefalse",
      "created": 1591319818,
      "upvotes": 21,
      "replies": {}
    },
    "fsx9l8j": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsx9l8j/",
      "text": "I make a list of tasks that need to be done and pick the easiest possible task to do until the list is done. Tends to give me time to build momentum and discipline when I am burnt out.",
      "author": null,
      "created": 1591319129,
      "upvotes": 3,
      "replies": {}
    },
    "fswy9qf": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fswy9qf/",
      "text": "I had a burnout as well, and I didn't really identify with my work at all. Writing my thesis was a real struggle, I had to force myself all the time, I was extremely slow, constantly stressed, and I sacrificed pretty much everything else in the process (there were ups and downs there, but everything else did suffer). Although I submitted before there was a lockdown here, I did spend most of my time at home.  But in the end I got it done, I submitted, I've defended recently and it went better than I'd expected. It's weird, my PhD was such an all-encompassing part of my life for so long, it took so much out of me, I had so many doubts that I'd make it... and now it's (almost) over. The point is, keep going, you can do it.\n\nThe two things that helped me the most during writing up were to \n\n1) make a plan for \"good enough\". You will never get it perfect, and you will have a chance to make corrections after the defense. Define the absolute minimum you need to do, and build up from there if you have the time. (Note: I had a hard deadline, so I knew I'd have to submit whatever I had by that day. I think that it's different in the US, isn't it? I ended up submitting what was pretty much a first draft, but by my deadline I was just so glad it was over that I didn't even care that it wasn't \"good\" - it was good *enough*.)\n\n2) I used a timer and set myself a goal of working for at least N hours a day. I started with 3 hours and built up from there (I'd pause the timer if I stopped working on my thesis for any reason, e.g. getting up to make a cup of tea or checking my email (including my uni email) - things you wouldn't really count as time off in a work environment). 3 hours may not sound like a lot, but it gave me a feasible goal and it allowed me to ignore/push off the oppressive guilt at the end of the day. With time, I moved my goal up to 5 hours, and as I got closer to my deadline I worked a lot more than that, but starting slow helped me a lot. \n\nAnother thing that helped was to do more difficult (for me) things earlier in the day and use the evenings to work on more pleasant or easier things (like improving graphs / figures / tables or whatever). This often allowed me to reach or go beyond my time goal, which made me feel more motivated and less guilty.\n\nFinally, this may seem counter-intuitive, but try not to feel guilty when you don't complete your goals for the day, or if you have a whole day off. Instead, try to understand your patterns, what triggers the not working, and try to work around your limitations, don't try to force them to disappear through will power (that will probably not work and it will just make you feel worse). Take a day at a time, start fresh each day - the minimum work time is the same every day and doesn't increase after you have a bad day to compensate. This is important to keep the guilt/anxiety under control. I only increased my minimum time when I was going over it consistently, and set myself a new goal that I was already achieving most days.\n\nGood luck, and I hope you get more feedback/suggestions from other people.\n\n&#x200B;\n\nPS: Focus on the goals you set for yourself and don't compare yourself to others. Everyone is different, what others seem to achieve doesn't mean anything about you. Working through a burnout is horrible, a constant battle with yourself. If you don't have a deadline that's coming up soon, try to make time for something you enjoy every day. Feeling motivated and being able to work harder for something that's not your thesis/dissertation can show to you that you *can* work hard, concentrate for longer periods, improve, etc. It's not you, it's your PhD (environment / circumstances) messing with you.",
      "author": "shaiel_miere",
      "created": 1591312876,
      "upvotes": 68,
      "replies": {
        "fsx6yrs": {
          "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsx6yrs/",
          "text": "Thanks so much, I think I need to be a bit more disciplined with how much time I work, or having \"designated work time.\" I at least don't try to overcompensate for missed work anymore, I realized it was counterproductive and actually made me feel worse and more overwhelmed (and when that happens I just kind of shut down and can't work.) \n\nI'm just in a weird spot where I don't technically have strict deadlines, other than small deadlines I set up for myself or things I've committed to that are coming up, so without that external pressure it becomes hard to be productive during a time like this. But I have obligations and am trying to explore other things that interest me outside of my dissertation at least.",
          "author": null,
          "created": 1591317647,
          "upvotes": 16,
          "replies": {}
        },
        "fswzf10": {
          "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fswzf10/",
          "text": "Thank you! This is insanely helpful!! I wish I read this post back in September.",
          "author": "jh758657",
          "created": 1591313490,
          "upvotes": 8,
          "replies": {
            "fsx139c": {
              "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsx139c/",
              "text": "Hah, so do I! In September I wasn't this wise, I was still struggling badly.\nTo be fair, I did find many good tips in this sub.\n\nOh, one more thing that made a very big difference for me was to try to focus on the positive. Instead of focusing on what I still had to write/correct/read/analyse, I made an effort to look at the progress I had made instead. This didn't come easily to me at first, and it felt scary. I mean, I had to always keep in mind what I needed to do in order to get it done, right? But paradoxically, focusing on what I had done (in the past day or week or in total) turned out to be more productive and helpful. And it became easier with time and practice.",
              "author": "shaiel_miere",
              "created": 1591314390,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fswuuih": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fswuuih/",
      "text": "You're not in need of motivation , you're in need of discipline. A to do list is only the first step. Next you need to set a schedule and stick to it. Make sure the schedule is achievable, and reward yourself when it's done, but not before. Start with what should be 4 hour days, and when you're done with all the work, even if it takes 3 hours or 6 hours instead, stop working and enjoy yourself guilt free. Rinse and repeat.",
      "author": "downsideleft",
      "created": 1591311078,
      "upvotes": 18,
      "replies": {
        "fsx8t1h": {
          "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsx8t1h/",
          "text": "[deleted]",
          "author": null,
          "created": 1591318688,
          "upvotes": 12,
          "replies": {
            "fszo3hc": {
              "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fszo3hc/",
              "text": "I appreciate the elegance of this statement. Thank you, friend.",
              "author": "brainsick414",
              "created": 1591376692,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fsyagyn": {
          "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fsyagyn/",
          "text": "This is Sparta?",
          "author": "spacekittenzzz",
          "created": 1591344076,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fswuh6d": {
      "link": "/r/GradSchool/comments/gwr6x7/how_do_you_reignite_your_interest_and_motivation/fswuh6d/",
      "text": "Hi! \"Leslie Knope\" type here. I guarantee EVERYONE has been less productive since the pandemic hit and even LESS productive with the protests. People who say they have been as productive or more productive are either lying or they are extremely privileged. I think that it's a normal response to not focus on your dissertation when the world is burning. Not to mention the students that are parents, the students that have been in social isolation, or the students that have lost funding due to COVID. \n\nAs far as your outlook- I think that this is also normal. While I love my work and would love a career on the tenure track, I absolutely will not give up other parts of my life in pursuit of the academy. Seeing recent graduates (who have done amazing work!) have their postdoc offers revoked due to COVID definitely has me building my cv in ways that could be applied in industry/'alt' careers. \n\nMy advice to power through would be to allow yourself a break. I have spent whole days sitting at the computer getting NOTHING done when I should have truly given myself a chance to relax. The awesome thing about breaks is that you allow your brain the opportunity to get creative. And honestly at this point, I give myself one goal each day (ie email this committee member, read this paper, write this paragraph) and then anything else is considered above and beyond what you needed to get done. Some productivity is better than none at the end of the day.",
      "author": "gekkogeckogirl",
      "created": 1591310891,
      "upvotes": 96,
      "replies": {}
    }
  },
  "updated": 1634066253
}