{"sid": "ptjeck", "link": "/r/GradSchool/comments/ptjeck/letters_of_recommendation_a_question/", "title:": "Letters of Recommendation: A Question", "text": "Greetings fellow graduate students and graduate student hopefuls! \n\nI was wondering if you all would be willing to help me with something that's probably rather silly? A few weeks ago I emailed one of my former professors asking if he would be willing or able to write a recommendation and he responded in the following manner: \"I am open to writing you a letter of recommendation but require more information.\" He asked for my performance throughout the remainder of the program, which was pretty good! I ended the program with a 3.5ish GPA and scored top marks on both units of my research courses - capstone included. So, I sent him all of the information he asked for and even attached two shorter writing samples to demonstrate the progression of my writing from his class to my final capstone course. However, after I sent this information, I've yet to hear anything back from him. Thus far, it's been two weeks... \n\nMy questions are pretty simple; should I email him again to check and see if he's still willing to write a letter? Or am I misreading his original email? \n\nApologies if, again, this is silly. I have the most absurd anxiety asking for these things in the first place and just wanted to check in with those more familiar with these types of things to get a few seconds opinions. \n\nThanks! \n- JH.", "author": "jhowell98", "created": 1632356212, "retrieved": 1632844051, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"hdyeudt": {"link": "/r/GradSchool/comments/ptjeck/letters_of_recommendation_a_question/hdyeudt/", "text": "Hey,\n\nI also struggle with anxiety regarding asking for things from people and just intense soul-crushing anxiety in general, so I can relate to your situation. It's definitely not silly to ask these things if you genuinely want some answers and reassurance. Reaching out for help is really difficult sometimes.\n\nNow this is just my personal opinion, so I won't say that this is what you absolutely SHOULD do because you are the ultimate decision maker. But if I were you, I would follow up with a succinct email asking if he would still be able to write the letter. Also, in that email, I might explain why I'm looking into the specific program I'm applying to and how it makes sense based on my previous experiences and academic interests (if I didn't tell him before). He seems like a vague guy so maybe straight up asking him what other information he needs to be able to write a solid letter would help this process move forward. He could probably just be busy right now, which might be why he hasn't responded. \n\nHowever, given the importance of the letter as an aspect of any application and your anxiety surrounding it, I would take action as soon as possible so you can determine if he is still the right recommender for you or if you need to switch to plan b and ask a different professor. It's certainly not wrong to want to receive proper and timely communication from people.", "author": "oceanofflavor", "created": 1632399651, "upvotes": 2}}}