{"sid": "d0jja5", "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/", "title:": "How to address inappropriate looks from a professor?", "text": "I have a weird problem I have no idea how to address.One of the  professors I am currently working on a project with has a tendency to stare at my breasts during our meetings (and before people jump in to ask: I am not wearing anything that shows cleavage or is inappropriate for professional settings in any way). When I catch him do that, it distracts me from our meeting and makes me feel uncomfortable and upset. I  go from feeling like a student having an intellectual conversation with a professor to feeling like a woman talking to a man, who is displaying inappropriate behavior for a professional setting. I know this professor well enough to know that he has no harmful intentions. He has been quite helpful with my time here at my graduate program and I am grateful for the project we are  working on now. So I keep reminding myself that this person is on my side, it might be natural for some people to get distracted like that etc but it's not really working.  I am still uncomfortable  and I get distracted by his looks in return.\n\nThe problem is, this project will continue on for at least a few more months (+ he is in my committee) and it is also very uncomfortable to point this problem out to him. So I have no idea how to address the issue but I would like to, somehow.I am sure (unfortunately) that I am not the only female graduate student who has experienced this. So my question is if someone else here has also experienced it and found a way to address it, what did you do? Any suggestions?\n\n**Edit:** I realized that this post has been getting downvoted quite a bit lately. Sorry if people think it is not fitting for the subreddit. However, this seems like an experience some female graduate students (like myself) do experience in graduate school, and given the power dynamics, it is especially hard to navigate it. \n\n**Edit 2:** Thank you very much to everyone, who proposed solutions! There were some great ideas I never thought of myself that I think might actually be effective. I will try some of them out next week and I hope they make a difference :) And if I find out that this is happening with other female students, too, I will follow u/husky54's advice on talking to the department chair about it. Note: It's been pointed out by u/LastLioness that a faculty member/department chair would better know how to handle this professionally. So I will think about directly talking to them (but will probably keep the identity anonymous at first).", "author": "Clous09", "created": 1567789979, "retrieved": 1632845945, "over_18": false, "upvotes": 346, "upvote_ratio": 0.94, "comments": {"eze4uzh": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/eze4uzh/", "text": "Title IX recently gave a training at my institute and provided some examples of how people have used their services in the past. Could you contact Title IX, ask them if they will deal with it? They can contact this professor on your behalf, sit him down, tell them there has been an anonymous concern and no formal complaint will be filed. He doesn't have to know it came from you and he won't get in trouble.", "author": "sneakypickle25", "created": 1567859101, "upvotes": 2}, "ezblipu": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezblipu/", "text": "Carry a stack of papers and hover it over your chest regions whenever his eyes start to wander perilously close.", "author": "PunchingTurtles", "created": 1567822087, "upvotes": 1}, "ezbb7yb": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezbb7yb/", "text": "How about just telling him to stop looking at your tits next time he does it? \"Umm, excuse me Professor X, would  you mind not staring at my breasts? It makes me very uncomfortable and disrupts professionalism. Thanks.\"", "author": "Monitorul", "created": 1567817288, "upvotes": -2}, "ezbayhf": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezbayhf/", "text": "Next time he does it, threaten to murder his family", "author": null, "created": 1567817108, "upvotes": 1}, "ezb9cse": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb9cse/", "text": "Please take a look at this link if you get a chance. I realize these situations are really very different from one another. However, just because you experience glancing looks doesn't mean that he isn't this way with other women. All I'm saying is use this as a cautionary tale of what can happen if this behavior escalates.\n\nThis man was a professor at the University of Tennessee where he was tenured in the geography department. He was a world leader in dendrochronology. He testified in courts as an expert witness to the validity of violins from centuries ago just by looking at the rings on the wood. But, all of that is to say that no matter how senior the professor, if they perform behavior like this professor did they need to be dealt with. Best of luck.\n\nhttps://photos.google.com/share/AF1QipMSw4JW8YI5xTfBZLA6SKp5RYlXLf3HN0ZTlAevNsirDkdHw1fyWpES-3Vb-dI2_Q?pageId=none&key=VFd1MzVwSnBhUlRsRW5POWM3VkFJemhvNFhEVWZ3", "author": "ToolBoxTad", "created": 1567815976, "upvotes": 6}, "ezb0i04": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb0i04/", "text": "everyone here has such great suggestions but maybe this requires a much simpler solution: a blanket. Whenever he stares, hold it up to cover everything but your face and keep on talking. Don't be afraid to become an amorphous blob with just a face. Plus you will be ready for naps anywhere.\n\nRemember, he's an adult who can control his eye movement and he chooses to place his eyes on your chest while you talk. He doesn't do this to everyone, just the isolated female grad student. Seems like regardless of his intentions, the message he sends out to everyone, especially you, is pretty clear.", "author": "cat_barista", "created": 1567810876, "upvotes": 6}, "ezay5j4": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezay5j4/", "text": "> I know this professor well enough to know that he has no harmful intentions. \n\nI admit that I am a cynic in these situations. However, if you're not comfortable talking about this issue with him directly, and you have no idea how he would respond if you did, then imho you do not know him well enough to have a good grasp of his intentions. He is a grown-ass man, well-educated, AND in an authority position. It's very likely he's well aware of where his eyes tend to \"drift\". \n\nThat being said, it is not your job to confront him, and it's dangerous for you to do so (I mean this primarily professionally but also personally). You need to talk to someone with authority over him, someone you trust to talk to him about this issue with the option of keeping you anonymous. I suggest getting someone to help you advocate - perhaps one of the women on your committee can go with you to talk to the department chair (the HR department would also be a good option, possibly even better). \n\nAs a side note, I would make a mental note if this only happens when you are alone with him or if he does this to you or other women in front of his colleagues and bosses.", "author": "LastLioness", "created": 1567809606, "upvotes": 3}, "ezax5f3": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezax5f3/", "text": "Can you Skype or call the person instead of meeting in person?", "author": "crazyreddmerchant", "created": 1567809033, "upvotes": 2}, "ezanv68": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezanv68/", "text": "If you otherwise get along with him and have a good rapport, I'd say bring it up to him directly. At the same time though, mention it to one or both of your female committee members. That way if he reacts badly, he can't turn it around on you and try to convince the other profs that you were in the wrong or making things up. Also then if he continues, you can let the other profs know that his behavior didn't change and maybe they can intervene. If you don't address it, it'll only continue to stress you out over these next months. \n\nHang in there, and good luck.", "author": "ConfusedCuddlefish", "created": 1567804610, "upvotes": 3}, "ezakafc": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezakafc/", "text": "I have definitely experienced this. I’ve had everything from male professors looking at my chest, to male professors staring at me from across the room at dinner parties (while their wives, female professors who I work with, are standing right beside them). \n\nI’m going to be honest. I can’t imagine saying anything about it... these sorts of situations are handled so terribly by universities, and I feel like I’d likely face backlash/retaliation and ultimately it wouldn’t be worth it. I instead deal with it by wearing high necklines, looser tops, and even a sweater/jacket on days that I’m meeting with male professors.\n\nI also will very obviously put my notebook/purse in front of my chest, zip up my jacket, block the view with my arm, etc. to let them know that I see them looking and it makes me uncomfortable. If the issue is really bad, I just avoid meeting. I’ve found that I can get away with not meeting with certain people for months, even if I have an ongoing project with them. \n\nI hate my advice to avoid/ignore, but that’s sadly all I’ve got. I hope that you can be braver then me and choose to say something to someone about it. I’m sending you strength, and hoping he will stop!", "author": "iloveteax", "created": 1567803003, "upvotes": 10}, "ezajv33": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezajv33/", "text": "Wow, this sucks, I'm sorry you have to go through that.\n\nI think the best bet would be someone else talking to him e.g. female professor. Is there someone you could reach out to?", "author": "Sonic_Pavilion", "created": 1567802824, "upvotes": 3}, "ezajaxr": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezajaxr/", "text": "Re: your edit: I think this post **is** appropriate for this sub. I've seen many other productive threads on similar topics in this sub. \n\nI think the most important question here is: how well does this professor take criticism? \n\nIf he takes criticism well, you could talk to him directly (but gently). \"Hey, sometimes I notice you looking at my chest during meetings. I'm sure you don't mean anything by it, but it's actually really distracting for me.\"  \\[and obviously completely inappropriate, but he *should* be able to figure that out by himself.....\\]\n\nIf he doesn't take criticism well, I would address it indirectly to avoid a stubborn response, or worse, retribution. Have someone who knows him very well talk to him about this (embarrassing and highly inappropriate) habit. They might not even have to mention you at all, since you said he does this to other women, and colleagues close to him will have noticed the problem at large. If the colleague you talk to is really a good friend of his, they should want to bring this up with him to protect him from more serious consequences if he continues with the habit, since this is something you and others could certainly report. \n\nYou might also get advice from your ombudsman, if yours isn't a mandatory reporter.", "author": "myristicae", "created": 1567802549, "upvotes": 39}, "ezahsth": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezahsth/", "text": "If I were in your shoes I would use vocal cues to try to snap him out of this behavior. You can do this in a way that’s not directly calling him out for looking at your breasts but still acknowledging the distraction and solving your problem.\n\nI’d play it out like this.\n\nYou: (have awesome intellectual discussion about dissertation)\nHim: *staring at your breasts*\nYou: hey! [his name] (loudly and waving a hand near his face, even smiling is fine here to make it light). I feel like you’ve been distracted, I find it difficult to gauge my progress without eye contact. (Light laugh here). Would you help me out? \nHim: Oh! Sorry about that, had a lot on my mind (gives him a face saving out). (Starts to talk to you giving you eye contact)\n\nIf he repeats the behavior, which he might depending on how much the first “calling out” impacted him\n\nTry responses like “I keep getting distracted without eye contact” or (give him very direct eye contact) or (trail off as he stares at your breasts and speak normally when he gives you eye contact) \n\nIf he still continues then you have no choice but to live with it (ugh, I wouldn’t want that from a male colleague or superior or anyone not my boyfriend for that matter!) or address it with him directly \n\nI hope these other methods work for you though! I haven’t used these tactics on a professor before but when I worked in industry it worked well and with other male grad students it worked well. I’m also a bit chesty and even if I wear extremely modest blouses, blazer, and sweaters, my breasts are large and noticeable. Not a problem we should have to deal with but hope my advice helps since it’s your situation right now", "author": "nemoflamingo", "created": 1567801735, "upvotes": 13}, "ezah9ph": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezah9ph/", "text": "[deleted]", "author": null, "created": 1567801448, "upvotes": 49}, "ezag2q5": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezag2q5/", "text": "That's a tricky one... bringing it up might make things awkward between you in a way that is harmful to you. Although Me Too has led to some progress, it would still be hard to prove he was doing it deliberately, and if you bring it up at all (even just discreetly saying something to him) you risk being labeled as \"that nasty hysterical woman over-reacting to a poor innocent guy who wasn't even doing anything wrong\" and having it screw up your degree and your career. That isn't fair, but unfortunately it is the world we live in.\n\nYou could handle it like a \"sub-tweet\" -- wear a shirt with an arrow pointing up that says something like \"my face is up there\" (they exist. And you could have just happened to wear one on the day of your meeting, it wasn't *necessarily* aimed at him, just like he wasn't *necessarily* looking deliberately...). That way you haven't actually said anything or suggested he was doing anything wrong (so it's unlikely to be held against you) but the message should get through loud and clear.\n\nOr if you don't want to be that direct then dress to minimize, eg. sports bra/baggy clothes.\n\nIt sucks. It absolutely sucks. You should just be able to say \"stop looking at my boobs\" or report it or something, but the reality is still that as women if we do anything like that we are taking a risk. For a PhD student who will be in professional networks with these people for the rest of your career, that risk is particularly dangerous. And boob-gazing (unlike more overt/demonstrably-intentional kinds of harassment) is probably not worth taking that risk over... at least, I wouldn't if I was in your situation.", "author": "tentkeys", "created": 1567800805, "upvotes": 6}, "ezabtvc": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezabtvc/", "text": "Given that you're fairly confident he doesn't have bad intentions and he's been helpful otherwise, it may be possible to talk to him directly about it. It's largely a question of how comfortable you are bringing it up like that. I'd say keep it light, try to avoid a serious half-hour meeting on the topic, so like the next time you notice him doing it say something like \"hey Bob, I've been meaning to bring something up with you, often when we're in meetings like this you seem to be looking at my breasts while we talk and it makes me really uncomfortable. Could you make an effort to look at my face instead?\" and see what response you get. This may be some horrible habit that he's developed without thinking about it, or that he thinks other people don't notice, and once you point out that you have noticed and it's not OK it may be enough to embarrass him into stopping. \n\nLike I said though, depends on your comfort level. If that sounds like a nightmarish conversation to start then /u/prettyvioletlilies' suggestion of having another professor talk to him about it is a great option, especially if it turns out he does this with other women as well and someone needs to address the full pattern of behavior with him.", "author": "eukomos", "created": 1567798476, "upvotes": 21}, "ez9yini": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ez9yini/", "text": "Are you allowed to change/drop members from your committee? At my institution, we can do that through the department chair, without having to ask the person being replaced beforehand. They simply get an email saying that their assistance is no longer needed.", "author": "squirrels33", "created": 1567791818, "upvotes": 11}, "ez9w9xp": {"link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ez9w9xp/", "text": "Is there someone else on your committee that you trust and who is female? You can try to talk to her about it (don’t be specific at first) to see if she can intervene on your behalf. I’ve been in this situation before but I was too embarrassed to do anything. I regret being silent because that year caused a lot of anxiety.", "author": "prettyvioletlilies", "created": 1567790654, "upvotes": 147}}}