{
  "sid": "qd25r7",
  "link": "/r/GradSchool/comments/qd25r7/need_advice_in_regard_to_work_and_school/",
  "title:": "Need advice in regard to work and school",
  "text": "I’m planning on getting my masters in psych online, and although I know it won’t be as difficult as a STEM field, I’m worried about my current work schedule. I work as a DSP for individuals with IDD, but my schedule is 3pm-11pm Thursday through Monday (with the chance of getting mandated every shift)….I haven’t had a weekend off in like 6 months and I’m so burnt out. I plan to start grad school in January, would it be a good idea to drop to part time? We’re so short staffed here I don’t want to risk losing my job.",
  "author": "mikerosoftpaint_",
  "created": 1634852525,
  "updated": 1635185513,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhmrr7m": {
      "link": "/r/GradSchool/comments/qd25r7/need_advice_in_regard_to_work_and_school/hhmrr7m/",
      "text": "It's definitely in your best interest to start part time and ramp it up from there. You'll find grad school classes are much more intensive than undergrad",
      "author": "ItWasntRigged",
      "created": 1634917197,
      "upvotes": 1,
      "replies": {
        "hhnasz3": {
          "link": "/r/GradSchool/comments/qd25r7/need_advice_in_regard_to_work_and_school/hhnasz3/",
          "text": "I’m definitely planning on it the only issue is I know HR is going to tell me I can’t because I’m like the only full time staff we have. I don’t know how to approach this",
          "author": "mikerosoftpaint_",
          "created": 1634924925,
          "upvotes": 1,
          "replies": {
            "hhncsoe": {
              "link": "/r/GradSchool/comments/qd25r7/need_advice_in_regard_to_work_and_school/hhncsoe/",
              "text": "I meant part time school. I wouldn't consider going part time at work. The loss of income will be too substantial. It might suck having to grind for the next couple of years, but school will always be there and you can take your time to finish",
              "author": "ItWasntRigged",
              "created": 1634925712,
              "upvotes": 1,
              "replies": {
                "hhncvtd": {
                  "link": "/r/GradSchool/comments/qd25r7/need_advice_in_regard_to_work_and_school/hhncvtd/",
                  "text": "Well luckily I live with my dad and only have a monthly bill of around 250",
                  "author": "mikerosoftpaint_",
                  "created": 1634925747,
                  "upvotes": 1,
                  "replies": {
                    "hhnda3s": {
                      "link": "/r/GradSchool/comments/qd25r7/need_advice_in_regard_to_work_and_school/hhnda3s/",
                      "text": "I think you need to evaluate what your long term goals are for the masters then are. Is the masters for advancement in this particular job, or for better opportunities elsewhere? If it's for better opportunities elsewhere, I'd do school full time and get it done as quick as possible.",
                      "author": "ItWasntRigged",
                      "created": 1634925906,
                      "upvotes": 1,
                      "replies": {
                        "hhnditj": {
                          "link": "/r/GradSchool/comments/qd25r7/need_advice_in_regard_to_work_and_school/hhnditj/",
                          "text": "Yeah definitely else where. HR told me that once I get my masters there’s a position I could potentially have BUT they’ve been pretty sly on making promises they can’t keep. I’m trying to move out of my town ASAP which is why I might bite the bullet, go part time and live frugally, and just get it done ASAP. I’m looking into the possibility of taking some summer classes too to see if I can get it done in a year and a half",
                          "author": "mikerosoftpaint_",
                          "created": 1634926002,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}