{
  "sid": "qhug5r",
  "link": "/r/GradSchool/comments/qhug5r/is_it_too_late_for_me_to_learn_how_to_take_good/",
  "title:": "Is it too late for me to learn how to take good notes in grad school?",
  "text": "In undergrad I really didn’t take very detailed notes on textbook readings or articles required for my classes. Now that I am in my first semester of grad school I’m afraid to try.  \n\nCan I get a pep talk pls",
  "author": "haloflower157",
  "created": 1635448912,
  "updated": 1635457623,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hif3xk0": {
      "link": "/r/GradSchool/comments/qhug5r/is_it_too_late_for_me_to_learn_how_to_take_good/hif3xk0/",
      "text": "Naw not too late. There’s always time to improve! Even after 2 years of doing a masters and being in a PhD now, I could even improve my note taking. You can do it! Look up some note taking strategies.",
      "author": "meowitsgabi",
      "created": 1635449131,
      "upvotes": 5,
      "replies": {}
    },
    "hif4529": {
      "link": "/r/GradSchool/comments/qhug5r/is_it_too_late_for_me_to_learn_how_to_take_good/hif4529/",
      "text": "Learning is a constant process and not something you just perfect in undergrad so no. Part of the reason you're in school in the first place is to improve yourself.",
      "author": "BSWolf777",
      "created": 1635449213,
      "upvotes": 3,
      "replies": {}
    },
    "hifnlki": {
      "link": "/r/GradSchool/comments/qhug5r/is_it_too_late_for_me_to_learn_how_to_take_good/hifnlki/",
      "text": "What are you taking notes for? So you can contribute ideas and questions to class discussion? So you have notes for writing papers? Notes to study for tests? To increase memory retention?\n\nDepending on what your goals are, you might take notes differently. Or you might not take them at all. I used to highlight or use minimal marking to note passages I thought were important before class. Note taking during readings would tend to distract me.\n\nBut I did always take extensive notes of what the professor was saying in class.",
      "author": "raistlin65",
      "created": 1635457087,
      "upvotes": 1,
      "replies": {}
    }
  }
}