{
  "sid": "fc6tdi",
  "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/",
  "title:": "PhD LPT: if your advisor's behavior depends completely on the outcome of your work (results/papers), it's a HUGE red flag.",
  "text": "Dr Jekyll/Mr Hyde depending on a good result/bad result day is a no-no. That's all.",
  "author": "miserablePhD",
  "created": 1583124289,
  "over_18": false,
  "upvotes": 380,
  "upvote_ratio": 0.99,
  "comments": {
    "fjcs7eo": {
      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fjcs7eo/",
      "text": "Fuck, can we pin this on the subs front page?",
      "author": "ducbo",
      "created": 1583234542,
      "upvotes": 2,
      "replies": {}
    },
    "fja4txz": {
      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fja4txz/",
      "text": "My advisor barely concealed the fact that she hated me for the first 2-3 years of my degree. I was totally untrained, put on a high pressure project, and many experiments failed at the beginning. (With a few years of industry experience under my belt now, I'm not sure how ANY experiments worked given how outdated and broken our equipment was.) She even brought on another professor to co-advise me because she didn't want to deal, and by that, I mean actually mentor me. I had a big breakdown around my QE, and I told her I wasn't sure I was cut out for a PhD. She said \"ok well let me know what you decide.\" \n\nOnce I switched to a new phase of my project, where we had brand new, functional equipment, things started going really well. I started getting good results. Suddenly she was friendly and started recommending me for awards. She even wanted me to stay on as a postdoc after graduation and aim for tenure track.\n\nScrew you bitch. Industry 4lyfe.",
      "author": "lionlament",
      "created": 1583166409,
      "upvotes": 8,
      "replies": {
        "fjadv6n": {
          "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fjadv6n/",
          "text": "Oh damn, advisors like this have a special place of hate in my heart. Glad you got out okay!",
          "author": "miserablePhD",
          "created": 1583171479,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fj9r49m": {
      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9r49m/",
      "text": "Yess....I didn't realize this getting into my PhD. The lab got very toxic",
      "author": "citiusaltius",
      "created": 1583157453,
      "upvotes": 1,
      "replies": {}
    },
    "fj93m0t": {
      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj93m0t/",
      "text": "Completely agree! \n\nVolatile changes in mood/mentoring/resource availability/etc. depending on whether or not you were able to deliver something is very hard to deal with, and should very much be considered a big red flag.\n\nThat said, there's no 'tip' here in this Life Pro Tip, and I earnestly want to open some dialogue on this topic. How does one **actually** deal with this? Oftentimes this sort of Dr. Jekyll/Mr. Hyde behavior is well-hidden from prospective grad students until it's far too late. Grad student friends of mine across the world have told me that the existing grad students in their respective groups either hid/downplayed/outright lied about their PI's emotionally-abusive tendencies, and by the time it came out, or by the time they realized it was something they weren't willing to put up with, it was too late. This sort of thing is a *disease* that's rampant across the entire academic industry, and it's self-perpetuating.\n\nBut say you want to change advisors, or leave your program? It's **hard**, and it's easy to say that no amount of abusive PI is worth the years you'd spend doing a grad program, but following through with potentially burning all your bridges in the department; realizing that the PI you signed up with is the only one doing the thing you came to that school for and that changing to a different PI would set you back years; that you may lose your funding/visa/etc., is very much easier said than done.\n\nReporting it? At least in the USA, tenure means that unless your PI lied about working with China or outright assaulted someone, the department isn't going to care about grad students that, from the department's perspective anyway, are 'just crying about a stressful PI.' \n\nThe hard reality for a lot of my friends in programs with PIs like this is that they simply must endure, while looking for the light at the end of the tunnel. For them, graduating is their #1 priority - with any dreams they might've had about purity-of-research or high-impact-publications given up.\n\nHow do we change the culture of academia? How do we get PIs who act like this to... well, stop?",
      "author": "opalicfire",
      "created": 1583130870,
      "upvotes": 89,
      "replies": {
        "fj963uf": {
          "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj963uf/",
          "text": "I think separating the masters from the PhD is a start. It's just such a big step to change institutions in the US because not only will you need to restart your research life, but also you'll need to go back to the phase of courses/quals.\n\nIf a PhD were 3/4 years of just research, then you could apply to a different advisor even by the end of your second year and only loose 2 years. (Even the term \"loose\" is not so appropiate anymore if you don't switch fields radically: your experience will help you on your new PhD.)\n\nI think it's also being discussed more and more openly about how abusive tenured professors can be. It's time to start taking actions, make it easier for a professor to be held accountable, lower the excessive stability of tenure.\n\nHow does one do this though? Can one do it at the level of individual institutions, or is it a legal change?",
          "author": "fuckwatergivemewine",
          "created": 1583133718,
          "upvotes": 18,
          "replies": {
            "fj9q87d": {
              "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9q87d/",
              "text": "> I think separating the masters from the PhD is a start. \n\nWhat do you mean by this? Are you suggesting all PhD students should get a masters first? I strongly disagree with that. \n\nFirstly the purpose and design of those educations is entirely different. PhD's focus on doing research, where-as masters is just another level of education. While it's obvious that there's no point in doing a PhD if you're not doing research, there's also no point in collecting degrees. People have this misconception that a PhD is something before real-life, but it's not. It's the start of a life-long learning endeavor. There's no point in delaying your life with a masters if you're going for a PhD. That'd be nothing more than a waste of time. Also, research/thesis masters are exploitative and should not be a thing. We certainly shouldn't encourage them because of the next point.\n\nSecondly, you're just adding another layer of pay-to-win education. You're far more likely to pay for a Masters than a PhD. So much so that I'm of the opinion that you should only get a masters if the industry you're working for is willing to pay for it as part of your benefits. If everyone suddenly had to get a masters before moving on to a PhD all you'd really be doing is excluding poor people from entering academia and extending the time it takes to start full-time employment. \n\ntl;dr: I think that's an extraordinarily poorly thought out idea that lacks perspective on what these degrees are actually meant for.",
              "author": null,
              "created": 1583156774,
              "upvotes": -3,
              "replies": {
                "fj9rm6s": {
                  "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9rm6s/",
                  "text": "Far from that, I think the person you’re responding to is looking at this from a non-US perspective. In a lot of places in Europe the standard is to do a 2 year masters, then apply to a PhD program which doesn’t really have the coursework component we have in the US. I don’t think this person is suggesting everyone in the US get a masters before a PhD, but rather that the US system should change to be more like higher ed in Europe, where people do shorter (3-4 year) PhDs after their masters",
                  "author": "b29superfortress",
                  "created": 1583157832,
                  "upvotes": 16,
                  "replies": {
                    "fj9xwll": {
                      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9xwll/",
                      "text": "Same here in Canada. I'm about to start my Masters, and I'm excited, because I'm not sure I want to do a full PhD but I'm glad I can do a test run and at least come out with some research experiene",
                      "author": "watson-and-crick",
                      "created": 1583162166,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "fj9vg2r": {
                      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9vg2r/",
                      "text": "I still think it'll lead to more research/thesis masters where you pay for the privilege of doing someone else's research, and I really don't want to promote that exploitative practice. How does the European system handle that?",
                      "author": null,
                      "created": 1583160545,
                      "upvotes": -2,
                      "replies": {
                        "fj9y2se": {
                          "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9y2se/",
                          "text": "At least in my upcoming masters, I'm still getting paid ~$10k/year, and no one here sees it as \"exploitative\". It means you get a trial run on research to see if it's up your alley, and we still finish PhDs at around the same time as our American counterparts",
                          "author": "watson-and-crick",
                          "created": 1583162278,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "fjag1fh": {
                          "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fjag1fh/",
                          "text": "My Masters (in Canada) is completely funded, and generally I think that's the norm outside the US system.",
                          "author": "willbell",
                          "created": 1583172749,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "fjcjlwg": {
                          "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fjcjlwg/",
                          "text": "Education in Germany is free, that also applies to the masters. In fact during my thesis I got paid (a small but much welcome amount). I also started working on the research line I now work on, so you could hardly say I was doing someone else's research.\n\nThere are some groups that exploit their students, they're not the norm though (it's easier to exploit  PhD students that already know what's up with the field). I guess in the US it's the same, as everywhere: there's always some asshole PI.",
                          "author": "fuckwatergivemewine",
                          "created": 1583222825,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fja8hq4": {
                  "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fja8hq4/",
                  "text": ">  If everyone suddenly had to get a masters before moving on to a PhD all you'd really be doing is excluding poor people from entering academia and extending the time it takes to start full-time employment. \n\nNot if you change the funding structure and reduce the time of PhDs, which is what most non-US countries do. There's no reason most history PhDs should take 8+ years, which they often do in the US.",
                  "author": "psstein",
                  "created": 1583168531,
                  "upvotes": 4,
                  "replies": {}
                },
                "fj9rr3y": {
                  "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9rr3y/",
                  "text": "Most 5 year PhD programs in the united states (specifically I can speak from the STEM perspective) has a master's embedded within it by design. The master's phase includes classes and research experiences or rotations, whereas the doctorate phase includes thesis research and much fewer classes. the person before you simply meant separating out those two phases. \n\nI don't think it's a good idea, but I don't think it's an \"extraordinarily poorly thought out idea\"",
                  "author": null,
                  "created": 1583157933,
                  "upvotes": 1,
                  "replies": {
                    "fja897s": {
                      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fja897s/",
                      "text": "The same structure is true in most humanities programs, too. The issue is that many humanities programs use the coursework as a cudgel to delay completion. My former program required you to take coursework into year 3.",
                      "author": "psstein",
                      "created": 1583168395,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "fj9va6c": {
                      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9va6c/",
                      "text": "Well firstly, the courses are often different. PhD courses usually have an extreme focus on methods under the assumption that you're already familiar with the overall theory, where-as masters only programs will re-teach you the basics and build on that into deeper theory with some but less methods talk. Admittedly, this can actually be really awful for PhDs if they don't have a strong foundation (e.g. if they're switching fields). I also wouldn't associate rotations with masters. Masters programs shouldn't have research. Those sorts of research oriented masters are almost always exploitative. I certainly wouldn't use those types of programs a model for separating the phases. From what I've seen these phases are separated based of candidacy. While people who don't gain candidacy do tend to master-out at this phase, there's a reason it's frowned upon and generally requires an entirely separate test. The course weren't really meant to give you mastery (while they might review some things, mastery was basically expected from you as the top of the top in your undergrad). The courses were meant to give you the tools to ask your own questions and do your own research. All that said, I do have to acknowledge that most univeristies don't really have their shit together enough for the differences in course work to really matter. \n\nI'm far more concerned with the finances. From the university side grad students are who are learning to do research are stupid expensive. Splitting the PhD into two degrees means students may decide to leave before the university has recovered their investment. This is why masters programs aren't usually paid. As mentioned previously this is more likely to lead to more exploitative research masters, which I really hate.",
                      "author": null,
                      "created": 1583160434,
                      "upvotes": -2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fj9khl8": {
          "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9khl8/",
          "text": "Ah, this is very interesting. Unfortunately though, with the way the system is right now, as a PhD student you have 2 options -- switch or deal with it. \n\nAbout the switching, I agree with you, it's incredibly hard but it's also extremely case-by-case. I switched and I can vouch for the fact that though all the problems you listed with switching are valid, not all of them exist in every scenario. \n\nI think the only way to stop this behavior, so to speak, is to hold professors accountable for their behavior which means departments have to care more about their students than money and fame (haha). This means they need to check-in every few years, keep tabs on the attrition rates for different professors, etc. But it's not in their self-interest so it usually doesn't happen.",
          "author": "miserablePhD",
          "created": 1583151831,
          "upvotes": 11,
          "replies": {}
        },
        "fja5vxy": {
          "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fja5vxy/",
          "text": "I've given this question plenty of thought. My advise? Make their government funding dependent on their conduct.   \n\n\nOh, you're applying for an R01? Let's see how well you've treated your students...  \n\\*opens up imaginary file full of red marks and an obituary from a student that committed suicide due to mistreatment (true story btw)\\*",
          "author": "anzara2Y5",
          "created": 1583167029,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fj92j1q": {
      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj92j1q/",
      "text": "advisor? you have such a thing? i thought it was only a legend....",
      "author": "moffedillen",
      "created": 1583129727,
      "upvotes": 6,
      "replies": {}
    },
    "fj90e35": {
      "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj90e35/",
      "text": "100% true. The opposite is also true: if nothing you do effects anything your advisor does and they basically ignore what you do, they will get bored of you and not give you any of the support you need.",
      "author": "iammaxhailme",
      "created": 1583127619,
      "upvotes": 67,
      "replies": {}
    }
  },
  "updated": 1634066315
}