{"sid": "poydoy", "link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/", "title:": "Has COVID-19 wrecked havoc on your finances too?", "text": "As grad students, we are probably one of the most sensitive groups to changes in cost of living, as our income is typically fixed. \n\nI'm sitting in my room, sick possibly because of the lack of COVID protocol at my university (although I'm not fully convinced that I have COVID), and not having eaten a real meal since Monday, with $40 in bank that is supposed to last till the first of October.\n\nIt is amazing how little the University cares about its grad students. I have 300 students and was forced to cancel class twice this week due to a possible super spreader event. Is it against University protocol? Idk but I'm not gonna subject my students to unnecessary exposure to COVID, especially when I can't even regularly eat.\n\nI'm tired.", "author": "longwiener22", "created": 1631738069, "retrieved": 1632952552, "over_18": false, "upvotes": 77, "upvote_ratio": 0.94, "comments": {"hd2zkvu": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd2zkvu/", "text": "If you haven't eaten a real meal in a while, please see if your campus has a food bank. Many do, even very small campuses, and can be very helpful during those really tight times.", "author": "Fudgypenis", "created": 1631802575, "upvotes": 1}, "hd2v77n": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd2v77n/", "text": "You, costs are way up. This shit sucks.", "author": "Pr0gr3s", "created": 1631800723, "upvotes": 1}, "hd2hz68": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd2hz68/", "text": "I've been incredibly grateful for the position I'm in; if anything Covid has improved my life, though I acknowledge I'm very fortunate and know other grad students are not doing so well.\n\nI'm at a satellite facility of my campus about 2 hours away; prior to Covid I was required 2-3 times a week to take a shuttle to attend classes in person. However, to make up for this inconvenience those of us assigned to this facility get an extra 5k a year stipend. Additionally, our cost of living is lower than if we were at the main school. I am able to rent a room in a nearby house from my research facility for 400/month which includes all utilities and internet.\n\nCovid in no way affected my income but allowed me to attend remotely which freed up my time significantly. I was able to work from home (I mostly do data analysis) for a very long time, and they also got around to making a deal with a nearby school in the same system so now we can go to their Campus Health instead of traveling to our own. Further, because Covid precautions and low recruitment numbers no new students have come here for over a year, so I've not been given a roommate- aka I've been renting a 2BR/2B house 2 minutes from my lab for 400/month.\n\nThen the stimulus checks were a cherry on top.\n\nSeveral times during the pandemic I have metaphorically looked around and realized how incredibly fortunate I was to be in the position I was at the time this hit. My heart goes out to those who are suffering.\n\n(As an added \"Dodged a bullet there\" note, I finished my comprehensives during the pandemic so will never have to go to campus again, meaning I don't have to worry about the absolute buffoonery going on up there about in-person attendance and Covid lack-of-precautions.)", "author": "Ancient_Winter", "created": 1631794148, "upvotes": 1}, "hd23ywz": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd23ywz/", "text": "No, about the same. Eating at home is more expensive, but everything was remote for almost 1,5 years now, so I save a lot of gas money and I have extra time for work.", "author": "Single_Blueberry", "created": 1631783721, "upvotes": 1}, "hd1l22u": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd1l22u/", "text": "It’s wreaked havoc on my motivation", "author": "we1sho", "created": 1631768135, "upvotes": 2}, "hd1cvbo": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd1cvbo/", "text": "Yeah Im in a similar boat. I was planning on getting a job once I got my Ms is engineering then COVID wrecked the job market so bad that once I finished in Oct 2020 I had no job prospects and was forced to live off of savings. I got accepted into a PhD program at the same university I got my masters at  and it pays decently well I just need to re adjust how much I budget but its still stressful living paycheck to paycheck. Have you considered looking into applying for income assistance programs like SNAP if you are in the US?", "author": "the_wires_dun_moved", "created": 1631763260, "upvotes": 3}, "hd137tp": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd137tp/", "text": "If you're merican please apply for food stamps", "author": "bitetheboxer", "created": 1631758376, "upvotes": 4}, "hd0xv7g": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd0xv7g/", "text": "A fellowship I would have had last summer was canceled due to Covid, so Covid made my summer 2020 really financially rough, forcing me to accrue some living expense debt. Luckily I've been able to recover a bit since then but things still feel precarious. One day at a time.", "author": "gestalt_switching", "created": 1631755857, "upvotes": 3}, "hd0xplo": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd0xplo/", "text": "Does your university have any financial help from the Covid bills passed by Congress? Through the ARPA program each PhD student at my school could apply for $7800 and MA students for $5400. Literally anyone who applied (one paragraph explaining how covid derailed your degree progress and a signed form from your advisor) got the money. That is literally what we get paid every semester so its been amazing to have. Every undergrad who was eligible for any financial aid was just automatically sent $3000 by our university. \n\nI have been incredibly lucky that covid has just meant a bunch of free money from the government for me because otherwise my finances haven't been affected. \n\nI am pretty sure every US school got ARPA money so it might be worth looking into if they have any aid for students through that.", "author": "archaeob", "created": 1631755783, "upvotes": 11}, "hd0fmwe": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd0fmwe/", "text": "It has actually been good for my finances personally, but I am lucky. I saved all my stimulus checks and my tax refund, so I have enough to pay rent for the next 10-11 months. \n\nI don't know what your university student union is like, if you even have one, but my graduate student union created a mutual support fund for folks who are struggling. I don't know the details because I haven't needed such support, but a friend of mine, who is a single mom, was able to get some money from them to pay for groceries. The Dean of Students office at my university also offers zero-interest emergency loans of up to $500, so if you had a bunch of sudden expenses and don't have enough for food, it might be worthwhile to see if your university has something similar and then you can start paying it back once your income stabilizes. I did use that program, and they were willing to work with me when I couldn't pay it back by the end of the semester so they extended the repayment by a whole semester.", "author": "False-Guess", "created": 1631747214, "upvotes": 27}, "hd0c7l3": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd0c7l3/", "text": "Personally, no, but I’m lucky.\n\nCOVID meant I was ejected out of the country (international), but my accommodation agreed not to charge rent for the time I was away, and I saved that money by having to go back to my home country. \n\nAnd I’ve been working from home more too so that means more cooking (cheaper) and fewer business trips into London (a big saving).\n\nNow I’ve moved into a flat with my partner so my share of the rent is lower than ever.\n\nThankfully there have only been a few big expenses of a few thousand each time, for (elective) medical things.", "author": "officially_anxious", "created": 1631745644, "upvotes": 5}, "hd05iiw": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd05iiw/", "text": "$40 in the savings seems like a huge money management issue to me. It is very unlikely that income and cost of living match exactly. So, either, there are ways to reduce the spending and start saving money and creating an emergency fund, or the income is simply insufficient for living without going into more and more debt each month.", "author": "n1ck6667", "created": 1631742648, "upvotes": -17}, "hd02h85": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hd02h85/", "text": "I'm fortunate to not have been laid off like some of my friends who are working.", "author": "ning7", "created": 1631741352, "upvotes": 5}, "hczv1i4": {"link": "/r/GradSchool/comments/poydoy/has_covid19_wrecked_havoc_on_your_finances_too/hczv1i4/", "text": "Yes, it feels like everything is getting more expensive and of course we don't get any cost of living wage increases. \n\nIf you don't have money for regular meals, there's absolutely no shame in visiting a food pantry. This is exactly the situation they're there for.", "author": "geosynchronousorbit", "created": 1631738284, "upvotes": 71}}}