{
  "sid": "qbp0tw",
  "link": "/r/GradSchool/comments/qbp0tw/paper_presentations_at_conferences_are_already/",
  "title:": "Paper presentations at conferences are already published, right?",
  "text": "I’m trying to figure out my first conference I’m submitting an abstract for (American Association of Geographers). I’m trying to figure out if I should do a paper or poster presentation for abstract submission. since my thesis wouldn’t be published by the time the conference comes around, I prob wouldn’t qualify for a paper presentation? Is there any real difference for career or job prospects between the two?",
  "author": "AndrewRLaws",
  "created": 1634690381,
  "updated": 1634750813,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhb1ybe": {
      "link": "/r/GradSchool/comments/qbp0tw/paper_presentations_at_conferences_are_already/hhb1ybe/",
      "text": "Hey, fellow geography grad student here! You really want to do a paper presentation in terms of career prospects. Your thesis doesn't need to be published to be presented. Will you have a decent amount written by that time? That's all you need for a paper presentation!",
      "author": "kasserolepoop",
      "created": 1634692205,
      "upvotes": 5,
      "replies": {
        "hhb57u2": {
          "link": "/r/GradSchool/comments/qbp0tw/paper_presentations_at_conferences_are_already/hhb57u2/",
          "text": "Hello fellow spatial adventurer! Thank you for the perspective. I should have my first draft submitted to my committee by then. I’m interested in what makes a paper better tor career prospects. Is that just for academia?",
          "author": "AndrewRLaws",
          "created": 1634693721,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhb3y2j": {
      "link": "/r/GradSchool/comments/qbp0tw/paper_presentations_at_conferences_are_already/hhb3y2j/",
      "text": "At least in my field they usually *aren't* published beforehand, but are some sort of draft or even a works-in-progress that you are sharing to get feedback for at the conference. Some conferences even forbid you presenting on previously published material or material that is under contract to be published. Again, it's field specific, but poster presentations aren't very common in mine and don't mean much, so that might be something you would ask your advisor or someone else. But I don't see why you couldn't do the paper presentation.",
      "author": "Haunting0fMilhouse",
      "created": 1634693132,
      "upvotes": 4,
      "replies": {
        "hhb5bu3": {
          "link": "/r/GradSchool/comments/qbp0tw/paper_presentations_at_conferences_are_already/hhb5bu3/",
          "text": "Thanks for the advice. Since I’ll be getting it ready for publishing the feedback would be great.",
          "author": "AndrewRLaws",
          "created": 1634693772,
          "upvotes": 2,
          "replies": {
            "hhb5pfd": {
              "link": "/r/GradSchool/comments/qbp0tw/paper_presentations_at_conferences_are_already/hhb5pfd/",
              "text": "Great! I should add that you still want the presentation polished, but there's no issue with having further questions you still seek to answer, or if you are still working on the conclusions, or if you want to mention it is part of a larger x project.",
              "author": "Haunting0fMilhouse",
              "created": 1634693944,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhbb50d": {
      "link": "/r/GradSchool/comments/qbp0tw/paper_presentations_at_conferences_are_already/hhbb50d/",
      "text": "Another fellow geographer.  I did a paper presentation at AAG as a grad student awhile back and didn't have anything but a half draft of a thesis chapter, and mine was probably the most polished of the papers in my session.  Most of the people I saw present seemed like they were flying by the seat of their pants, cobbled something together for the happy hour tickets and the chance to see somewhere new.  Wouldn't stress too much.",
      "author": "Boreas_of_the_PNW",
      "created": 1634696520,
      "upvotes": 1,
      "replies": {}
    }
  }
}