{"sid": "l74m1z", "link": "/r/GradSchool/comments/l74m1z/lack_of_communication/", "title:": "Lack of communication", "text": "I haven't talked to my thesis committee in months because of mental health issues, I've had an email for them in my drafts for months. But I basically just fell off the planet and never sent it. I haven't been able to make any progress on my research or writing. I'm very behind on everything and feel like everything around me is moving on without me. It finally got to the point where I had to see my doctor about it and get on some medication.\nI finally sent the email.\nAddress your mental health y'all. The sooner you can admit it to yourself, the sooner you can admit it to others and move forward. Your committee members can be surprisingly understanding.", "author": "daltosax", "created": 1611858820, "retrieved": 1632845962, "over_18": false, "upvotes": 344, "upvote_ratio": 0.99, "comments": {"gl8b9lt": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl8b9lt/", "text": "I feel this", "author": "jedgarnaut", "created": 1611925764, "upvotes": 2}, "gl80hx7": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl80hx7/", "text": "I'm really glad to see this post here\nVery often we put a shameful spin on mental health problems in our competitive community and that makes the first step (acceptance that something is wrong) really really tough.", "author": "integreats", "created": 1611918586, "upvotes": 4}, "gl7htem": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl7htem/", "text": "What medicine did they give you if you don't mind me asking? And how is it helping?", "author": "tommygibbs23", "created": 1611904443, "upvotes": 2}, "gl6v3qb": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl6v3qb/", "text": "Hey, same. I'm on year six of it for my master's sooo", "author": "stmasc", "created": 1611892210, "upvotes": 4}, "gl6jc8z": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl6jc8z/", "text": "Same thing has happened to me. The pandemic hit last spring semester and over the summer I occasionally chatted with my committee chair. When the Fall semester started I never messaged him,  didn't take any classes, and here we are nearing the end of January and I've made no thesis progress, have no talked to my chair since August, and wasted the past 6 months binging Netflix and sleeping a lot. My mental health was really bad this time last year and with covid lockdowns it's gotten so much worse. I have a meeting with a therapist next week so we can start working on this and try out some medication. \n\nI hope things go well for your. We're all rooting for you ♡", "author": "coastalsagebrush", "created": 1611886895, "upvotes": 5}, "gl6hv5c": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl6hv5c/", "text": "This was exactly me last Spring (minus the thesis). I'm sending you a virtual hug, I'm glad things are (seemingly?) getting better and that your committee seems to have been understanding about everything.", "author": "ChezJason", "created": 1611886223, "upvotes": 3}, "gl63ejd": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl63ejd/", "text": "I totally relate. I lost pretty much the whole year to university delays, mental health struggles, and other hullabaloo. I admitted very bluntly to my PI and my dean that I'm basically a year behind now. They were both incredibly supportive and are working to help me get back on track.", "author": "Left_turn_anxiety", "created": 1611879715, "upvotes": 6}, "gl5s2my": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl5s2my/", "text": "How do you separate mental health from procrastination? For me it’s really hard to gauge whether it’s just a motivation issue that I need to just “solve” myself or something else that needs to be addressed through a professional.", "author": "raspberriesp", "created": 1611874836, "upvotes": 13}, "gl55jyq": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl55jyq/", "text": "I have been in this position before. That feeling in your throat as time goes on and you still haven't seen the email is the absolute worst. I'm lucky everyone I've ever sent those too has always been supportive and has definitely helped me communicate much earlier moving forward. Glad to hear you are taking steps to take care of yourself and have some support!", "author": "amends_through_love", "created": 1611866385, "upvotes": 3}, "gl4zuym": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl4zuym/", "text": "I feel for you, I had a rough patch myself where I didn’t work on my thesis for months. This spring I’ll be 2 years over from my original graduation date - spring 19. I’m sure our circumstances are different but I just wanted to say it’ll be ok.", "author": "Kbarah1", "created": 1611864360, "upvotes": 16}, "gl4vmi7": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl4vmi7/", "text": "I recently was told by my therapist that I should consult a psychiatrist, but the thought of starting a med that will change me in the middle of my thesis terrifies me...but at the same time I am struggling very much rn", "author": "agthkho", "created": 1611862827, "upvotes": 11}, "gl4vli9": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl4vli9/", "text": "I hear you!  Since being ABD in 2019, I have yet to have one committee member reach out and ask if I am still alive.  I did send an email saying I had to stop to take care of family for COVID and the response was \"ok.\" When I tried to get back on track and was overwhelmed and trying to figure it out, I connected with my co-chairs and they basically shrugged their shoulders.  After this I fell off the emotional deep end, while I wanted to do stuff, I just couldn't for a few months.  I am now reconnecting with my work, talking with a therapist about general life stuff, and made a pact to check in with a friend weekly.", "author": null, "created": 1611862817, "upvotes": 22}, "gl4rc9q": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl4rc9q/", "text": "I am in the same spot that you are. I don’t have any advice for you but it’s good to know we aren’t alone I guess.", "author": "pony987", "created": 1611861236, "upvotes": 34}, "gl4oo7x": {"link": "/r/GradSchool/comments/l74m1z/lack_of_communication/gl4oo7x/", "text": "Congrats on recognizing it and addressing it.  I went through a similar period of non communication, then decided to reach out and reconfirm that my committee was still willing to work with me.  It went surprisingly well and wasn't worth the amount of worry that I put into it.", "author": "uuniqueusername", "created": 1611860247, "upvotes": 77}}}