{"sid": "ptvql0", "link": "/r/GradSchool/comments/ptvql0/question_regarding_resume/", "title:": "question regarding resume", "text": "I don't have a publication, so I guess I have a resume. \n\nanyway. I got an advice from my school's career center that to shrink my 4-page resume, I can cut out the descriptions of my extracurricular activities but save the descriptions for my research/teaching. is that something to do for grad school apps?", "author": "UnselectiveWilde", "created": 1632405160, "retrieved": 1632844048, "over_18": false, "upvotes": 1, "upvote_ratio": 0.99, "comments": {"hdywgo5": {"link": "/r/GradSchool/comments/ptvql0/question_regarding_resume/hdywgo5/", "text": "Look at how other professors put together their resumes (you can frequently find these on the faculty page of any department or their own website).  \n\nKey thing here is to highlight important details and get rid of useless information.  Descriptions of extracurricular activities are useless unless there's something unique about them that makes a strong argument **and** will transition to research work.  4 pages is too long.  2 pages is good.  \n\nFor example don't have descriptions for honors/awards.  I'm sure people know what Dean's List is and if there's an award that they're not familiar with, they can always google it up.  Just put award name, month, year. \n\nAlways get it reviewed by someone else before you actually send it.  Something that you might know/think is great might be taken completely differently by another person.", "author": "HalfEatenPie", "created": 1632408064, "upvotes": 1}, "hdysdsh": {"link": "/r/GradSchool/comments/ptvql0/question_regarding_resume/hdysdsh/", "text": "They’re definitely correct. Graduate programs want to see that you’ve done most of your work in the field that you want your PhD in, and don’t care as much about your extracurricular activities if they don’t relate somewhat to your field. You would keep your research/teaching descriptions because those are more relevant. Feel free to pm me if you have any other questions!", "author": "physics_masochist", "created": 1632406310, "upvotes": 6}}}