{"sid": "pxrnfb", "link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/", "title:": "Book banned from being taught at my university because the material is considered 'too sensitive' - what are your thoughts on censorship of material?", "text": "I am very torn on this one.\n\n&#x200B;\n\nWe study and research society in the social sciences, so we can generally assume not everyone we encounter/read about are happy go lucky people. My professor said he's banned from teaching/referring to a book written by one of the 'big' writers in the field. The author had written about suicide, and it's deemed too sensitive to be taught at undergraduate/postgraduate.\n\n&#x200B;\n\nNow, as someone with personal experience of suicide, I understand how even reading about it can be upsetting, disconcerting. I was surprised that although it isn't allowed as a key reading to be discussed in seminars, it's not even allowed to be on the further reading list, with a disclaimer about the content and a note to say (just for example) if you want to discuss this we can arrange this outside of the classroom, just not in front of other people.\n\n&#x200B;\n\nWhat are your thoughts on this? I feel that this is unnecessary censorship and students should be given the option to explore further texts should they wish to and if they feel comfortable. But again, is there something I'm just not getting here? \n\n&#x200B;\n\n:)", "author": "borkinghampalace", "created": 1632907067, "retrieved": 1632951804, "over_18": false, "upvotes": 104, "upvote_ratio": 0.97, "comments": {"hervpqh": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hervpqh/", "text": "Skipping Durkheim's \"Suicide\" is a disservice to students and the discipline itself. It has to be covered with care no doubt, but avoiding it altogether seems just lazy to me. It is challenging for sure, as it also was for Durkheim (on a different degree and level), but thats precisely what is worthwhile reviewing of a 100+ year old book with honestly outdated theory, data, and methods. The intellectual and sociological quest of understanding even the most grim issues of social life is what makes it a must IMHO. Boo to your institution for taking the easy way out.", "author": "Intil", "created": 1632951084, "upvotes": 1}, "herroqc": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/herroqc/", "text": "A content warning and the ability to excuse oneself should be sufficient.", "author": "RuthlessKittyKat", "created": 1632949374, "upvotes": 1}, "herr95y": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/herr95y/", "text": "One of the colleges I was out banned Vladimir Nabokov's \"Lolita.\" It didn't matter if it was for a Gen Ed, an undergraduate major course, a graduate course; no one could assign this book. \n\nAlso, academics were strongly discouraged from using this book in their research", "author": "PopCultureNerd", "created": 1632949199, "upvotes": 1}, "herkgf3": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/herkgf3/", "text": "Definitely sounds like weird and unnecessary censorship. We were assigned about half of On Suicide during my first semester of undergrad. It's a pretty important text in the history of sociology. Very odd that even talking about it would be banned.", "author": "RepoRogue", "created": 1632946469, "upvotes": 1}, "herdysu": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/herdysu/", "text": "Nothing should be censored at at the university level unless it’s illegal, like child porn", "author": "CMRattray2020", "created": 1632943853, "upvotes": 1}, "herb7gl": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/herb7gl/", "text": "Tbh I'm going to read Durkheim suicide. Ty", "author": "Anarchy_Lurker", "created": 1632942724, "upvotes": 1}, "heqxzof": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqxzof/", "text": "I hate it. Academia is one of the most important places for censorship to not invade. It's ridiculous to dangle knowledge out of someone's reach because you don't think they can handle it. It's made even worse when it's a circumstance like you're in, where it's something you relate to and have experienced and want to learn about and discuss, but they don't seem you able to handle it. I hate it I hate it I hate it. No secrets. No tricks", "author": "DoctorateInMetal", "created": 1632937266, "upvotes": 1}, "heqtssu": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqtssu/", "text": "I don't believe we should be censoring works. College students are adults, and we should trust their ability to handle sensitive content, particularly if it's fundamental literature in a discipline. Particularly in social sciences and humanities, if you strip out content that may be uncomfortable, you may miss a lot of valuable conversations about understanding human behavior and systems, which is why we're here.\n\n\nI also feel, personally, that *not* talking about something for fear of it being triggering just makes it harder for folks to openly discuss difficult topics. On a professional level, I can say that, for example, historical sites are more able to change how they represent marginalized groups since we see a shift in the discourse around that and more of a demand for it. On a more personal level, like you, I have some personal experience, and chronic (passive) suicidal thoughts are part of how I experience mental illness. Reading about it can be triggering, but it can also help me understand that aspect of myself, and having it as a thing academics talk about can help it feel like it's valid as a topic to explore and learn about, and not something that needs to stay in a box and never come out.", "author": "torgoboi", "created": 1632935567, "upvotes": 1}, "heqryfk": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqryfk/", "text": "If it's relevant to the field– especially in fields like psych, medicine, education, social work, or political science– I think it's hugely important (if not a downright responsibility) to expose undergrads to the realities of what their major and potentially future occupation looks like both realistically and intellectually. \n\nI think content/trigger warnings, a syllabus with clear dates for discussions, and having no penalty for missed attendance the day of discussion is appropriate. Maybe even a review article as an alternative so students don't have to read in-depth, but are still exposed to the material. There are certainly days I've had to look away from slides, step out of the room during discussion, and even skip class because I wasn't in a place to be present for a reading/discussion/lecture on an issue, but I'm glad it wasn't skipped altogether because of the value of encountering new perspectives and new information on sensitive topics.\n\nI'm a social scientist too. I study state violence. It wouldn't have been fair to me in undergrad to forgo readings on genocide, sexual violence, torture, etc. for the sake of my sensitivities or mental health because it's real stuff that happens. If graphic alien space porn was banned from a literature syllabus, that feels like a very different kind of censorship than a prominent academic writing on an issue that affects countless people in real life.", "author": "loloopssorry", "created": 1632934817, "upvotes": 3}, "heqql97": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqql97/", "text": "This seems odd as hell. The first person who comes to mind is Kay Redfield Jamison, whose books on bipolar disorder have been incredibly useful for those trying to understand it, and for those who have it. I can't imagine trying to ban her books.", "author": "tiptoemicrobe", "created": 1632934274, "upvotes": 1}, "heqp8cg": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqp8cg/", "text": "If anything it will ensure people seek it out to see why it was banned. People cannot wall themselves off from ideas in real life like they do online, either intentionally or by algorithmic design.", "author": "SquirrelOnTheDam", "created": 1632933739, "upvotes": 1}, "heqp3sh": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqp3sh/", "text": "Censoring at the university level is nothing but politics, frankly. I can fully understand the reasoning behind blocking books from public school students, though I don't agree with it in many cases, but it's a different story in higher education.\n\nFrankly, though, if the author is THE author on the topic and you're supposed to become practicing professionals, the university is doing a disservice to your training by preventing you from having contact with it in an academic setting.", "author": "stolid_agnostic", "created": 1632933690, "upvotes": 1}, "heqo2f3": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqo2f3/", "text": "I would take your professor with a grain of salt, TBH. We had a professor at my university for YEARS who would tell students stuff like that; that he was \"banned\" from teaching certain things, the university was \"censoring\" him, etc. but in reality it was very hyperbolic exaggeration of what really happened, which is that he was chronically pushing boundaries of appropriate behavior and curriculum, and his students kept complaining about him making them watch Joe Rogan and read shit written by his misogynist white supremacist pals. The university never really did anything about it, but they did talk to him about toning it down, which he seized on as an opportunity to claim he was being censored and oppressed.", "author": "Weaselpanties", "created": 1632933278, "upvotes": 10}, "heqn9ls": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqn9ls/", "text": "Does anyone here now, is there evidence that studying that text leads people to worse mental health and/or attempts of suicide?   \n\n\nI would be surprised if it was a pre-emptive measure only.", "author": "PeaceAndPrajna", "created": 1632932966, "upvotes": 3}, "heqlf1u": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqlf1u/", "text": "it sounds dumb but also you can still read the book yourself.\n\nSometimes when my high school showed triggering books or assignments, they would let you get an exemption and you could do something else instead. That is very understandable.\n\nBut censoring the entire book isn’t good. Not only do most students have no issue, but most will see triggering stuff outside of school. On the news, the internet, and of course in real life. It’s actually better to have a student get “triggered” in class and during university where they have a support system, then have them triggered later in real life where they might be alone.", "author": "armchairwarrior13579", "created": 1632932240, "upvotes": 1}, "heqktnt": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqktnt/", "text": "to sensitive in graduate school? wtf\n\nI don't even agree for undergrad, if it upsets a student let them opt out and provide a topic that is less upsetting. Educational settings are a place to discuss everything, even controversial things. You don't build better societies by ignoring the bad stuff that happened in the past.\n\nIs the holocaust to sensitive? We talked about that in middle school", "author": "Trakeen", "created": 1632932000, "upvotes": 1}, "heqe5ff": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqe5ff/", "text": "Are you at a private institution?", "author": "AthenianWaters", "created": 1632929330, "upvotes": 1}, "heqd9rh": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqd9rh/", "text": "That is absolutely ridiculous.\n\nDepending on the academic field, there can be valid reasons to discuss almost any book, whether it be Mein Kampf or particularly disturbing pornography.\n\nI could see avoiding sensitive topics in a mandatory class - eg. if it’s a class most undergrads will be required to take as a cognate to fulfill a humanities requirement. And maybe avoiding it in an intro-level class where a lot of the students may be inexperienced/freshmen.\n\nBut other than that, just give a warning for content, and anyone who doesn’t want to be exposed to that content can just not take that course.\n\nBanning discussion of the book in any class at any level is completely ridiculous and more than a little disturbing. Assuming your prof is tenured and can get away with it, they should be making a public stink about this in places like The Chronicle and naming the university involved.", "author": "tentkeys", "created": 1632928974, "upvotes": 1}, "heqbex6": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqbex6/", "text": "I had ro read and write an essay in response to a book defending American slavery. Teachers can choose not to teach something in a certain manner but it should still be available in the university library. If you ever want to start a riot over censorship, get the library staff involved lol", "author": "AreasofInterest", "created": 1632928210, "upvotes": 1}, "heqauot": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqauot/", "text": "Censorship should not be tolerated in academia.", "author": "CooperSly", "created": 1632927973, "upvotes": 3}, "heqa85b": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heqa85b/", "text": "Censorship has no place in a university. A professor shouldn’t be allowed to *force* students to read something like that, but banning all students from be able to read it, at their own discretion, is just baffling to me.", "author": "You_Stole_My_Hot_Dog", "created": 1632927711, "upvotes": 7}, "heq7vu3": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heq7vu3/", "text": "Tl;dr: sensitivity and flexibility when teaching sensitive topics is good and frankly necessary. Censorship in the hope of protecting people is still censorship and that's bad. The ideal is that sensitive or painful materials are available to all but behind a trigger warning that briefly explains the contents (and a formative education that focuses on giving students the tools and understanding they need to make good decisions for themselves, but that's asking a lot more). \n\nIt's one thing to not teach it in class (and assign it as mandatory reading, etc) - I think that's reasonable. As someone mentioned, maybe the line is that it's not taught in a required class but it could be taught in an elective. My view is that perhaps it is taught in a small, less-popular elective and not the elective that is technically not required but supremely popular and/or the elective of choice for different programs.\n\nOr perhaps it's taught but there is an alternative reading/assignment that could be offered. Students would be given the opportunity to opt out of that class period or two and meet on their own/have a discussion on the board on the class page, whatever.\n\nEither way, students should definitely get a warning so they can make an informed decision. Some people will say that the students need to toughen up and deal with it, since it's reality but I think that's incredibly harsh and honestly? Where the hell in the real world are they going to deal with that in a setting that they didn't ask for, can't leave to go take a breather, or otherwise manage their own needs? Counselor-types sign up for the possibility that they'll encounter suicidal people. If your friend or family member is struggling, you're not in a classroom full of people and you can go hyperventilate in the bathroom for a few minutes, wash your face, and come back.\n\nTo actually answer the question directly: not including it as required reading/teaching it in a mandatory or really popular class is absolutely reasonable and, imo, responsible. But to pretend it doesn't exist and doesn't contribute? Absolutely wrong. Label things adequately, ensure students (and thus people, since everyone was a student at some point) are equipped with the tools and skills to make good decisions, and let them free on the world.\n\nMy friend took a genocide studies course. I don't know that I have the stomach for that. That definitely doesn't mean that the course shouldn't exist! It should be labeled appropriately and understood that hey, maybe a particular topic is too much for any particular student, and the professor needs to be sensitive to that. If somebody needs to slip out of class early or tweak the response paper's scope, fine. \n\nMy thinking in terms of adequate labeling is: you pull a book off the shelf at the library and it has a little slip in the front with a warning and short description of contents. You use the online journal search and when you click on the title, there's a little popup box going \"this may have sensitive content - brief explanation yada yada. Do you wish to proceed?\" and you click yes and start reading, or you reassess and go \"oh, no that's not what I'm looking for\" or \"actually, maybe the chatty floor on the library with no privacy is not the place to read this and maybe have a strong reaction - let me move to the cubicles for this.\"", "author": "Lucky-Reporter-6460", "created": 1632926727, "upvotes": 4}, "heq61xn": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heq61xn/", "text": "Even without reading your post, censorship at this level of academia should be frowned upon. The very building ocks of academia require free discussion without blinds or removal of material considered to be insensitive.", "author": "Weekend_metalhead", "created": 1632925949, "upvotes": 7}, "heq2if2": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heq2if2/", "text": "Eh, this is a tough call. It sounds like the department chair and/or bean counters up in Old Main are rightfully concerned about triggering students who have experienced that trauma, but they’re doing the opposite of what they should be doing. Instead of requiring students to opt in, they should be allowing students to opt out. The former is censorship, and the latter is just being empathetic.", "author": "ErwinHeisenberg", "created": 1632924395, "upvotes": 1}, "hepv3uv": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepv3uv/", "text": "Life is unsettling and disconcerting. Suicide is real. Censorship is wrong.", "author": "-MrRich-", "created": 1632920916, "upvotes": 11}, "hepuu0x": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepuu0x/", "text": "That kind of content ban is banned at my school. \n\nProfessor can choose what content makes sense, and they also have to be prepared for the consequences of those choices.", "author": "IkeRoberts", "created": 1632920779, "upvotes": 1}, "heprmux": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heprmux/", "text": "While it is frustrating and sad that a college would censor the teaching of a text I think it is a reaction to the very real mental health crisis many schools have been facing. Over the past few decades rates of mental illness, especially depression, in college students has been on the rise and colleges don't want to or lack the resources to implement better mental health support. Rather than risk upsetting high risk individuals they decided to just not have them read the book, though avoiding tough subjects will likely do more harm tgan good", "author": "94sHippie", "created": 1632919107, "upvotes": 5}, "hepqxv1": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepqxv1/", "text": "Do you go to Liberty University or some other fundamentalist Christian hellhole?\n\nThat’s absurd. Universities are THE place to interact with hard ideas. I couldn’t possibly imagine a school where they ban a seminal work from being taught to ANYONE, not to mention postgrads.", "author": "kronosdev", "created": 1632918718, "upvotes": 2}, "heppl04": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/heppl04/", "text": "Seems ridiculous to me! It's almost like you're making the students more sensitive by sheltering them from learning about morbid realities! You'd think they'd acknowledge it as beneficial to teach something to help students better understand phenomena that affect humans, even themselves. \n\nWould studying genocides/serial killers also be banned for sociology/psychology/criminology students? Because if not for the gruesomeness, I don't see a consistent reason in why it's banned. After all, as I've learned in suicide prevention training, talking about suicide with depressed people (or those who have signs of self-harmful intentions) does not give them the idea to commit suicide. There is no point beating around the bush, because it's likely that they've thought about it already, and it's more important to address the issue directly.", "author": "nbachickenlover", "created": 1632917943, "upvotes": 10}, "hepoow0": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepoow0/", "text": "That sounds silly as hell - you can find \"sensitive\" materials in internet these days. We should let ADULTS decide that in their own terms", "author": "articlesarestupid", "created": 1632917421, "upvotes": 11}, "hepk6nr": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepk6nr/", "text": "Complete disservice to the students. At some point, you have to be able to approach any topic regardless of how it makes you feel.\n\nI hope that anyone considering suicide isn't matched with a mental health practitioner whose sensibilities were protected from the topic, and i hope they don't have to deal with a public that knows nothing about their condition.", "author": "c2u8n4t8", "created": 1632914583, "upvotes": 44}, "hepjz2z": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepjz2z/", "text": "It sounds like a load of codswallop to me. If the work is important academically, then it should not be censored just because someone (who, exactly?) finds the content objectionable. Unfortunately, many undergraduates struggling with mental health issues do contemplate suicide, and censoring a discussion of a mental health challenge that undergrads sometimes experience does nobody a service, particularly those who may struggle with that ideation. Refusing to acknowledge the struggles that some people go through because it makes other people uncomfortable is, imo, a manifestation of narcissism. \n\nAdministrators need to keep in mind that undergrads are *adults*. They are old enough to enlist in the army and experience PTSD after witnessing the horrors of armed conflict, and they're old enough to legally purchase and carry firearms in the United States so to say that a book is going to do them such harm that it deserves to be banned is, to me, complete and total codswallop.", "author": "False-Guess", "created": 1632914440, "upvotes": 66}, "hepj940": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepj940/", "text": "Durkheim’s work ‘Suicide’ is pretty influential in the history in my field, and we speak on it in both undergraduate and graduate level courses but I’ve never had a chapter or anything assigned as reading. The topic definitely has to be broached with caution (particularly with undergrads), or relegated to an additional reading list, but to not even name/reference it at a graduate level of education is kind of ridiculous in my opinion. I’ve found course material triggering before, but at the end of the day I can generally discern what to avoid pretty quickly and professor’s have been understanding if I can’t get through it.", "author": "floridagaytors", "created": 1632913930, "upvotes": 93}, "hepbp5r": {"link": "/r/GradSchool/comments/pxrnfb/book_banned_from_being_taught_at_my_university/hepbp5r/", "text": "I think, especially in a post secondary academic setting, there should be no censorship.", "author": "dellmaddux", "created": 1632907665, "upvotes": 231}}}