{"sid": "pjaomq", "link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/", "title:": "Writing my own letters of rec ????", "text": "Why do professors now want us to write our own letters of rec and then they will “edit” it . \n\nAlso, can I say  it’s unfair to require 3 letters of recommendations when I just moved states to go to grad school here and since covid , haven’t made any serious relationships with my faculty (,:", "author": "ClassicalConcerned3", "created": 1630969333, "retrieved": 1632952795, "over_18": false, "upvotes": 16, "upvote_ratio": 0.81, "comments": {"hc0zwtd": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hc0zwtd/", "text": "I hate doing this too, but you gotta do what you gotta do. Your three letter writers will have different working relationships with you, so you can emphasize different strengths in each letter.\n\nHot tip for making the three letters sound different: ask your friends/labmates for their letters. This gives you an idea of the verbiage and different motifs of the LOR. Take what's useful, discard what isn't, make a Frankenstein's monster of a letter. This is what I did. Alternatively, make a letter writer ring with 2 other people whose CVs you know well enough. (This is what I want to do.)", "author": "rudolfvirchowaway", "created": 1631079920, "upvotes": 1}, "hbzbiwd": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbzbiwd/", "text": "I wrote one for a prof I worked with and had a class with about 25 years ago. He remembered me but not that good. I also sent a CV and a letter discussing what I did  career/accomplishment wise since we last met. He sent a copy his edited copy back to me. I think all he changed was putting it on official letterhead so I’m glad I did a good job writing it :). The other reference I had worked with more revelry and he wrote his own. I never saw it but he told me they would be expecting me to “walk on water”.", "author": "UleeBunny", "created": 1631049567, "upvotes": 1}, "hbxatlp": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbxatlp/", "text": "This is pretty normal, especially since you said you don’t have much of a relationship with them - sorry : / - just kinda have to deal with it.", "author": "debacchatio", "created": 1631018559, "upvotes": 1}, "hbx65fk": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbx65fk/", "text": "I don’t know why everyone’s upset and downvoting me when I asked this. We were never allowed to write our own letters of recs and in fact signed a document saying we wouldn’t ever see the recs but in grad school it’s different .", "author": "ClassicalConcerned3", "created": 1631015743, "upvotes": 1}, "hbx22nr": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbx22nr/", "text": "I hate this too, but it's a huge time saver for them and allows you to decide what you want them to talk about. Your 3 people should each emphasize something different about you-- you could choose particular research skills or soft skills like teamwork, leadership, etc.", "author": "RiskyCelery", "created": 1631012960, "upvotes": 2}, "hbwc80v": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbwc80v/", "text": "It's fair - professors are extremely busy and get many requests for reference letters. Unless you've worked closely with them on a research project, they might not even really know who you are beyond looking up your grades or whether or not you actively participate in class. They need you to remind them who you are and why you deserve a reference letter. The professors who know me well and have had me do this always edit the letter into something much more impressive than the draft I write.\n\nWhy does moving states matter? I did my bachelor's, master's and now PhD all in different countries, so my references all came from countries other than the one I was applying to. References are not restricted to a particular country let alone a particular state. Ask the professors who know you best to be your referees, no matter where they are.", "author": "Interesting-Gold-720", "created": 1630991925, "upvotes": 4}, "hbvmh2m": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbvmh2m/", "text": "How do I write 3 letters of rec that will absolutely kill it for my fellowship apps without them all sounding the exact same ?!(,:", "author": "ClassicalConcerned3", "created": 1630977782, "upvotes": 0}, "hbvkydw": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbvkydw/", "text": "I think it's a weird exercise and I write letters that are personal and tailored to each student.", "author": "Ophelia550", "created": 1630977029, "upvotes": 0}, "hbv936t": {"link": "/r/GradSchool/comments/pjaomq/writing_my_own_letters_of_rec/hbv936t/", "text": "That's precisely why they have you write a draft letter for them. That way you put in the things that you want to emphasize in each letter and they can expand on it or take it out as they feel comfortable vouching in you for said trait. If you're worried about how much you can write about with no \"serious relationship with them\" how do you think they'd do any better if you gave them nothing to work with and said \"praise me\"", "author": "purdueGRADlife", "created": 1630971157, "upvotes": 33}}}