{
  "sid": "jfcdlk",
  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/",
  "title:": "Grad School, not as bas as the sub makes it seem",
  "text": "To anyone reading this and lurking the sub, especially those not yet in grad school and questioning it,\n\nFirstly, what I am about to say does not take away from any of the experiences stated on this site before and I am not saying that they are not true or anything. These experiences are definitely valid but it is just something that I have not dealt with yet. I am a graduate student at a major R1 university in the United States in Chemistry and I can honestly say that I love this program and the experience of grad school. Yes, classes are hard. Yes, TA'ing can be an absolute timesuck. Yes, research is frustrating. Yes, you actually do run out of time and it is crazy what my schedule looks like. But, I don't think that  I have ever been more fulfilled doing something in my life. I feel like I am being pushed to learn and that I am learning a lot. I have also been lucky to find a group of people in my cohort who I think have similar goals and aspirations with that have made a very good friend group for me. I found a lab whose research I love and a PI who is exactly the type of boss I want. Lastly, I think the idea of having ownership of a research project is one of the greatest things. It makes me want to go in every day to do work because it is MY project. I just feel like this is where I should be right now and it is nice to be here, after working in industry, knowing that I am furthering my knowledge, and the world's knowledge in the field that I love. I just wanted to write this as a bit of hope for anyone who has been disenchanted by the bleak posts of some of the users. I compare it to like  yelp review or something of that idea. You always hear from the people that are unhappy more than the people who are content. Hope this helps someone out.",
  "author": "NoxiousChemist",
  "created": 1603285403,
  "over_18": false,
  "upvotes": 587,
  "upvote_ratio": 0.91,
  "comments": {
    "g9mrmnk": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9mrmnk/",
      "text": "FWIW it comes with some stressors, especially as someone with lingering undergraduate debt, but I really enjoy the work that I do and find it fulfilling. I don't regret making a PhDetour from what my career path was (at least so far).",
      "author": "Cubranchacid",
      "created": 1603359311,
      "upvotes": 1,
      "replies": {}
    },
    "g9mb5xu": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9mb5xu/",
      "text": "I'm just starting out, 1st sem in a PhD program (in a US uni - as an international student on the other side of the world - online because COVID!)\nAnd although my workload wouldn't even amount to half of most people in the sub, I'm going in with exactly this mindset (and advice)!",
      "author": "11_She_knows_11",
      "created": 1603342937,
      "upvotes": 1,
      "replies": {}
    },
    "g9m5p14": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9m5p14/",
      "text": "Of course it's not bas",
      "author": "articlesarestupid",
      "created": 1603338834,
      "upvotes": 1,
      "replies": {}
    },
    "g9lsd4u": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9lsd4u/",
      "text": "I absolutely loved my masters program.",
      "author": "cheeseandbooks",
      "created": 1603330611,
      "upvotes": 1,
      "replies": {}
    },
    "g9lmnhd": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9lmnhd/",
      "text": "So happy to see this posted here! I totally agree and was just thinking the same thing a few days ago. Glad to see there are people in the same boat :)",
      "author": "miscent",
      "created": 1603327320,
      "upvotes": 1,
      "replies": {}
    },
    "g9lgo0i": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9lgo0i/",
      "text": "I have really liked grad school! It’s made a lot harder due to pandemic but for all those interested in grad school and highly motivated, I think it’s worth it! I say this with two student jobs, full time school, an internship, and dealing with pandemic related challenges and a recent Covid related death in my family. It is hard, but I’d you have a supportive and conducive learning environment it is possible to succeed and flourish in grad school! \n\n#publichealth",
      "author": null,
      "created": 1603323885,
      "upvotes": 1,
      "replies": {}
    },
    "g9le68e": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9le68e/",
      "text": "I think I've been miserable in my PhD program because I do not feel like I have any sort of ownership over my projects. I also love to learn and don't mind working hard, but every time I come up with an idea, it is either shot down for no reason or my advisor tries to steal it and pass it off as her own. That, in addition to other abuse I've dealt with from both my advisor and another committee member, is why I'm mastering the hell out as soon as I find a job. I'm in my 3rd year for what it's worth, and I think I really started getting taken advantage of by the end of my first year. \n\nIMO, the biggest factor as to whether you enjoy grad school is who your supervisor/committee is. I thought I chose well, but as it turns out, meeting someone for a day during grad school recruitment is not enough time to determine whether they are fit to be a manager of people.",
      "author": "MattSleazy",
      "created": 1603322458,
      "upvotes": 1,
      "replies": {}
    },
    "g9lcqe8": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9lcqe8/",
      "text": "You're one of the lucky ones",
      "author": "xClapThemCheeks",
      "created": 1603321644,
      "upvotes": 2,
      "replies": {}
    },
    "g9l588x": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9l588x/",
      "text": "I was contemplating doing a DHA degree after my MBA. I decided I needed a break when I realized I haven't read any books for fun in the last few years. I worked full-time and went to school. I even lost that full-time job because of the stress. I have friends that haven't seen in a long time too. It's time to enjoy life for bit.",
      "author": "someguynamedjohn13",
      "created": 1603317693,
      "upvotes": 1,
      "replies": {}
    },
    "g9kti97": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kti97/",
      "text": "[deleted]",
      "author": null,
      "created": 1603312114,
      "upvotes": 1,
      "replies": {
        "g9l1r5x": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9l1r5x/",
          "text": "Feel free to DM me, I had a 3.0 in undergrad and am in an R1 physics phd program, would be happy to chat about my experience if it may be helpful",
          "author": "ndrach",
          "created": 1603316110,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9kqbtc": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kqbtc/",
      "text": "I’m in a molecular biology PhD program at a major R1 in the US too and I also love my program. It’s different after covid, we used to have lots of program get togethers between seminars, tea time, and other random events with free food. \n\nBut it is what it is. I’m still having an amazing time and couldn’t be happier with my lab, my PI and my program.",
      "author": "microvan",
      "created": 1603310585,
      "upvotes": 1,
      "replies": {}
    },
    "g9kpsub": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kpsub/",
      "text": "I was legit scared and terrified about graduate school, because of this sub, and all of the horror stories about working 24/7, crazy advisors, professors, not meeting anyone etc.",
      "author": "Carloverguy20",
      "created": 1603310331,
      "upvotes": 1,
      "replies": {}
    },
    "g9kiqhn": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kiqhn/",
      "text": "IMO, department culture is a major part of the equation. I was in a PhD program for three years that I hated. Not because of the subject or responsibilities, but because of the professors' completely flippant attitude toward their grad students. I switched to a different PhD program in the same university and it's a 180, all because the professors care about their students, both academically and emotionally. It starts from the top; professor respect and care creates a much healthier environment. Unfortunately, I think it's not at all uncommon to have a toxic professor environment. The #1 piece of advice I give anyone looking to grad schools is to ask the really uncomfortable questions before you sign on. Straight up ask the professors and current students how many students leave, why they leave, what responsibilities you'll have, advising style, what happens if you hate your project or advisor, what the qual process is like, etc. It's never too early to ask the pointed questions, and any professor/ department worth joining won't be put off or evasive after you ask. If you get anything less than really good responses from the students, that's a bad sign too; the student responses are likely biased in favor of their department (usually the happier ones are going to be the ones talking to you, people might be afraid to say bad things, etc.) so a really good response is probably more like a good environment. A good response is okay, okay is bad, bad is horrible. Run!",
      "author": "snowpeasinapod",
      "created": 1603306938,
      "upvotes": 1,
      "replies": {
        "g9kl8kd": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kl8kd/",
          "text": "I 100% agree on the departmental culture. My bidirectional weekends switched my top choice to bottom and bottom choice to top.",
          "author": "NoxiousChemist",
          "created": 1603308143,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9kb731": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kb731/",
      "text": "Since there are studies that show that mental health problems are extremely common in academia and often higher than in comparable groups, I wouldn't chalk it up to \"complainers\". It's a very serious problem in academia.  \nYou can get lucky and have a good experience, but that doesn't change the fact that there are some things fundamentally wrong with the whole system. Academic culture fosters unhealthy behaviour (e.g. overworking to \"show that you're serious!\" and pressure towards \"publish or perish\") and has this weird system where people never learn how to be a supervisor, get their own group through other measures (e.g. scientific output) and then somehow everyone is surprised that abusive PIs or people who just don't know how to supervise exist.  \n\nAlso, don't be fooled: A lot of abusive guys know how to behave to \"outsiders\" to make you say \"I would have never imagined that!\". They also have their students in check so they won't tell you, either (assuming they weren't just gas lighted into normalizing that behaviour).  \nSome of the PIs that are most famous with the undergrads at my University are most feared by their grad students.",
      "author": "LittlePrimate",
      "created": 1603303370,
      "upvotes": 23,
      "replies": {
        "g9m353c": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9m353c/",
          "text": "Yup, this is such an important point. The culture of overwork can be terrible for mental health (particularly for anyone who is disabled, neurodivergent, etc), and it's not uncommon for departments to have a lot of other toxicity festering under the surface (racism, homophobia, sexism, ableism, cultures of normalized sexual violence, etc.). Especially if you're not a straight, white, cis man, you will likely notice this kind of stuff as you get more familiar with the department you're in. My best advice is to try and build community and solidarity with your fellow grad students. I am lucky enough to have some amazing students in my program with me, and not only have they made all of frustrating stuff more bearable, but I've also probably learned more from them overall than from faculty (even though I have been lucky enough to have some good instructors/committee members).",
          "author": "positronic-introvert",
          "created": 1603337149,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g9k9lgn": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k9lgn/",
      "text": "Glad someone enjoyed their grad school experience 😂",
      "author": "museum_hoe",
      "created": 1603302622,
      "upvotes": 1,
      "replies": {}
    },
    "g9k97vq": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k97vq/",
      "text": "I felt like this during my Master's program. PhD has been a whole different story.",
      "author": null,
      "created": 1603302445,
      "upvotes": 1,
      "replies": {}
    },
    "g9k5wlt": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k5wlt/",
      "text": "Wish I could say I agreed. I was so excited for grad school, but this first year is quite miserable.",
      "author": "whirlydirlymcflurry",
      "created": 1603300875,
      "upvotes": 1,
      "replies": {}
    },
    "g9k3vzq": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k3vzq/",
      "text": "I've had major ups and downs in grad school. Honestly, I think the most important factors are choosing an advisor who you can work with (read: like and respect) and setting boundaries with yourself and your advisor. Decide how much work is too much long term, choose how much social life you need to remain happy, etc., and stick to those goals. Grad school is not worth misery in my opinion.",
      "author": "theArtOfProgramming",
      "created": 1603299898,
      "upvotes": 3,
      "replies": {}
    },
    "g9k1y4x": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k1y4x/",
      "text": "I have often heard people say that your masters is easier than your bachelors, and I found it to be true for me in my three masters. It's not that it's \"easier\", per se, since you are really doing an incredible amount of work. Rather,  you're really focused on one topic in some depth, and are there (hopefully) due to personal motivations. This can help you get through a lot of difficult times.",
      "author": "stolid_agnostic",
      "created": 1603298966,
      "upvotes": 1,
      "replies": {}
    },
    "g9k1fhj": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k1fhj/",
      "text": "Yeah I just started and while the pandemic makes it kinda suck, I really enjoy what I’m doing. That and my cohort and advisor are all really supportive.\n\nIt’s stressful sometimes but I wouldnt change my choice",
      "author": "AfroRugbyQueen",
      "created": 1603298717,
      "upvotes": 1,
      "replies": {}
    },
    "g9jyz5w": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jyz5w/",
      "text": "Something I’ve noticed in most of the replies is how despite the difficulties of grad school, it is a *fulfilling* experience. What if that feeling of fulfillment is gone for you? You had passion going in the first year and then it slowly eroded? That’s what makes me sad and I can’t seem to bring it back. And trust me, I’ve tried. I see posts like these, and no offense to OP, but it just makes me sad and envious because I’d like to experience that again. I would love to be one of these people replying and saying how good grad school is. Instead I’m here dreading every single day and thinking of quitting (early 4th year, chemistry).",
      "author": "diozuk09",
      "created": 1603297550,
      "upvotes": 14,
      "replies": {
        "g9jz6e1": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jz6e1/",
          "text": "I don’t know if you actually read my post. I said these things are valid that people feel this way just that not EVERYONE feels this way. This was meant to show that the entirety of grad school doesn’t\nSuck for everyone and that if you’re interested you should at least try it",
          "author": "NoxiousChemist",
          "created": 1603297644,
          "upvotes": 2,
          "replies": {
            "g9jztmf": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jztmf/",
              "text": "I did read your post. I don’t think you’re dismissing other people’s experience. I was simply asking the question of what to do when your passion is now gone. It’s something I tried to control but I can’t seem to bring back despite trying. It’s more of a monologue or cry for help than a criticism of your post. Is it a useful reply to this thread for other people? Probably not. But maybe I’ll get an answer for myself that might help.",
              "author": "diozuk09",
              "created": 1603297947,
              "upvotes": 8,
              "replies": {
                "g9jzx28": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jzx28/",
                  "text": "No that’s fair. I just misread your post. My apologies",
                  "author": "NoxiousChemist",
                  "created": 1603297993,
                  "upvotes": 7,
                  "replies": {
                    "g9k04pr": {
                      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k04pr/",
                      "text": "No problem!",
                      "author": "diozuk09",
                      "created": 1603298094,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g9knk3k": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9knk3k/",
          "text": "I’m in my first semester and I feel the same way. 🙁This time last year, all I wanted was to go to graduate school to keep studying my field that I was insatiably curious about. I was so excited to keep learning and growing, and to teach. Now I’m here and I feel so disenchanted with it all. I wonder what the point of my research is, because it is a generally inaccessible topic and it honestly doesn’t really contribute much to the greater society. I wonder “why am I doing this? Why am I researching this, beyond it being ~interesting~?” \n\nI don’t know where my passion went. I wonder when my interest for this topic died, when just one year ago I loved it so much. I hope that these feelings are all just a mixture of the pandemic + moving across the country and knowing nobody. I hope that in one year’s time I’ll have fallen in love with it all again. In the meantime I’m sad 😞",
          "author": "momhasbipolar",
          "created": 1603309256,
          "upvotes": 2,
          "replies": {
            "g9kz3nw": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kz3nw/",
              "text": "I totally get you. It could definitely be the pandemic and moving. I at least had a cohort and friends to rely on my first year. You technically know who’s in your cohort but reaching out is much harder with the pandemic and everything being virtual. Keep at it, try to stay healthy (both physically and mentally) and use all the resources you can get. I hope you find your passion, science or not!",
              "author": "diozuk09",
              "created": 1603314857,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g9jysbe": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jysbe/",
      "text": "I think people need to remember that this sub has self-selection bias- of course people who are struggling are going to seek it out and post for support so it’ll appear that there’s a higher proportion of struggling people than there actually are. I’m pretty happy with grad school so there’s no need to make a post about it, but then it appears like everyone’s just miserable when that’s not really the case",
      "author": null,
      "created": 1603297460,
      "upvotes": 40,
      "replies": {
        "g9jyyze": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jyyze/",
          "text": "That’s why I made the post and acknowledged this at the end. I wasn’t trying to rag on anyone, just point this out so people interested aren’t just freaked out",
          "author": "NoxiousChemist",
          "created": 1603297547,
          "upvotes": 19,
          "replies": {
            "g9jzb2r": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jzb2r/",
              "text": "Exactly, thanks for the post! Glad to see some of the upsides of grad school on here as well",
              "author": null,
              "created": 1603297706,
              "upvotes": 3,
              "replies": {}
            },
            "g9lvszl": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9lvszl/",
              "text": "Thank you for this post. I'm currently in my first semester in a master's program. I was actually just talking to one of my advisors today about going on to a PhD. The whole reason I've been deterred is because how much I hear everyone say how horrible the experience is.",
              "author": "patientrose",
              "created": 1603332597,
              "upvotes": 1,
              "replies": {
                "g9mia0g": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9mia0g/",
                  "text": "Everyone has a different experience. Even with the same supervisor and university your experience could be different than someone else’s. Depends heavily on the project, funding, your personalities and mental health. However, there are toxic supervisors and labs out there, and it’s important to watch out for the red flags before you commit to a PhD which is not only a long degree but where your supervisor has a major impact on your career. \nDo not get discouraged, but it’s good to be aware at the same time",
                  "author": "m0onbo0ts",
                  "created": 1603349175,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9juj3u": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9juj3u/",
      "text": "Okay yeah I know my first year is pretty chill since it’s rotations and the quarter system but compared to others I have just been unexpectedly so happy? My class is impossibly hard but the grading isn’t stressful for me and I’m learning a lot. Sure I cried at the beginning of classes because it was so hard but to be fair I had been out of school for 2 years. And I like having online lectures to rewatch over and over. My rotation is mostly online so I had chill days reading for my proposal on a topic I love. It’s also all mine and I like being able to follow my own interests. Its hard to concentrate at home but also it’s a choose your adventure in terms of scheduling, having errands, cooking. I am so happy to be here and I couldn’t imagine working a job instead of having this opportunity to get paid to learn at a school I never would have afforded as undergrad lol",
      "author": "samscreen",
      "created": 1603295382,
      "upvotes": 6,
      "replies": {}
    },
    "g9ju3fz": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9ju3fz/",
      "text": "I feel the same way!! Yes it is long and hard work, but I do enjoy it. I enjoy my professors, teaching, my cohort, my research.... I love school, so naturally I’d love grad school too. All those posts about hating their program, etc make me sad for those people but are just unrelatable for me, thank god!",
      "author": "snakesareracist",
      "created": 1603295167,
      "upvotes": 4,
      "replies": {}
    },
    "g9jsak4": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jsak4/",
      "text": "Grad school is no treble at all!",
      "author": null,
      "created": 1603294276,
      "upvotes": 1,
      "replies": {}
    },
    "g9jrc2k": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jrc2k/",
      "text": "Absolutely! I tend to complain a ton during the term, but I love my program so much! I do believe I've found a great support network in my cohort. I've learned a ton - about my field and myself - since I started last June. I wouldn't trade it for anything.",
      "author": "cosmosflow3rs",
      "created": 1603293811,
      "upvotes": 2,
      "replies": {}
    },
    "g9jpmio": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jpmio/",
      "text": "I think I’m your target audience... This is somewhat encouraging. That being said, you still describe your schedule in a way that seems unhealthy I guess. Am I reading too much into that?\n\nIt’s frustrating for me because all my experience so far doing research has given me the same feeling you describe, and I have a lot of reason to think I’d enjoy the work. But I mean no job is worth sacrificing your health and so I definitely have a lot of doubts every time I read this sub.",
      "author": "Thunderplant",
      "created": 1603292971,
      "upvotes": 2,
      "replies": {
        "g9jyiks": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jyiks/",
          "text": "I have my down time. I spend time with friends. I make it a habit to be at the gym every day. But still I’m busier than I’ve ever been. I don’t have as much time to screw around anymore. I also may be a bit different in the sense that I don’t like sleep and never have. I usually get 5 ish hours a night, not by necessity but by choice. I’ve been this way ever since high school so it definitely isn’t an artifact of grad school.",
          "author": "NoxiousChemist",
          "created": 1603297332,
          "upvotes": 3,
          "replies": {
            "g9kg2u1": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kg2u1/",
              "text": "Yeah ... so you have 3-4 extra hours per day, every day, than I do just based on sleep alone and you still feel super busy. \n\nIt’s really frustrating because I’m just like ... a normal person who wants to work semi reasonable hours, and it despite having a lot of the skills needed for grad school and really wanting to do it I can’t help but feel like it’s only for people who are able to work exceptional amounts and that’s just not me.",
              "author": "Thunderplant",
              "created": 1603305695,
              "upvotes": 2,
              "replies": {
                "g9kgips": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kgips/",
                  "text": "Like i said I still Go to the gym every day which is two hours and then I play video games every day for an hour or two. I see my friends pretty much daily but take out the nonessentials and I still have plenty of time to do what I need to do. I also tutor 5-10 hours a week. I’m busy because I just continue adding to my plate out of choice, not necessity",
                  "author": "NoxiousChemist",
                  "created": 1603305902,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9jp81e": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jp81e/",
      "text": "I loved my doctoral program. The research was time-consuming and, at times, frustrating, but extremely fulfilling. I enjoyed teaching and mentoring. My advisor was pretty supportive and most of my peers were good people who I had amicable relations with. I was busy, but happy. \n\nAs a humanist, the problem was all the other stuff. The terrible job market. The alienation and loneliness when researching and writing a dissertation. The financial precarity. The lack of career support and information about how to translate your skills into a job. \n\nI enjoyed graduate school. I learned a ton and became much more skilled as a thinker, writer, and communicator. It also hurt me financially and slowed my career development. I (clearly) still have very mixed feelings about my experience, though I think it is important to note that every person doesn't have a terrible time in graduate school.",
      "author": "HighestIQInFresno",
      "created": 1603292771,
      "upvotes": 9,
      "replies": {
        "g9mql1i": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9mql1i/",
          "text": "This is pretty much the reason I've decided to just continue pursuing my K-12 teaching career rather than try for a PhD.",
          "author": "Sombersleep",
          "created": 1603358107,
          "upvotes": 2,
          "replies": {
            "g9n3bz7": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9n3bz7/",
              "text": "Yeah that's a smart move. No one should be enrolling in a humanities PhD for career advancement at this stage. There simply are not enough academic jobs and very few graduate programs have pivoted to career preparation for non-academic careers. \n\nI was in graduate school with several people who came from K-12 teaching. Many returned to the exact same jobs after graduation or had a more difficult time finding a K-12 job because some states have a higher pay scale for teachers with PhDs and schools didn't want to take an expensive swing on a teacher who hadn't been in the classroom with non-college students for a decade.",
              "author": "HighestIQInFresno",
              "created": 1603370056,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9jn1zj": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jn1zj/",
      "text": "as an undergrad who regularly lurks and panics over this sub, thank you so much for sharing your experience. it’s inspiring, and i needed to hear it",
      "author": "jack5587",
      "created": 1603291684,
      "upvotes": 28,
      "replies": {
        "g9jz0t7": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jz0t7/",
          "text": "Remember that people who are struggling are going to seek out the sub and post for support so you’re seeing a biased sample, it doesn’t mean everyone’s struggling. I really enjoy grad school, it’s not guaranteed to be miserable! Best of luck",
          "author": null,
          "created": 1603297572,
          "upvotes": 9,
          "replies": {
            "g9k60cw": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k60cw/",
              "text": "Tbh I should know that considering I want a Stats masters, but browsing this sub still makes me feel dead inside. I guess that’s just human psychology after all",
              "author": "99power",
              "created": 1603300925,
              "upvotes": 3,
              "replies": {
                "g9k6a4l": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k6a4l/",
                  "text": "Yeahhh most subs can tend to do that to you. I had to get off ones like relationship_advice because of the same problem, I know some relationships can be happy and healthy but scrolling that one made me feel like I was going to inevitably end up in a loveless abusive dead bedroom marriage",
                  "author": null,
                  "created": 1603301054,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9m7wpv": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9m7wpv/",
          "text": "This is my first semester and it’s been stressful. It’s tough connecting with other ppl in the program and the department I’m in is perpetually at risk of being scrapped due to budget cuts. But honestly, I’m working on things that are interesting and exciting to me and I feel it’s worthwhile.",
          "author": "pantyhose_twatpatch",
          "created": 1603340410,
          "upvotes": 2,
          "replies": {}
        },
        "g9mjolz": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9mjolz/",
          "text": "If you should take anything from this sub, know that your journey will be your own and that it's totally ok if it's a tough experience and totally ok if it's an enjoyable one, and everywhere in between.\n\nThe reality is that it is a crucible, but that taking care of yourself, trying to maintain a healthy work balance /attitude and communicating with your advisor +peers are all things that most grad students would say are helpful to improving the journey no matter what path yours takes you on.\n\nGood luck!",
          "author": "theCmonster22",
          "created": 1603350531,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9jmovm": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jmovm/",
      "text": "I feel the same way. Maybe because I'm only in my first semester of my master's program, but I love it so far. I love learning more about my field, going to classes, and just being back in school. Maybe that'll change as I go more into my concentration, but for now even with having periods of being stressed and tired, I'm still happy to be in grad school",
      "author": "WannabeBadGalRiri",
      "created": 1603291494,
      "upvotes": 2,
      "replies": {}
    },
    "g9jlydu": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jlydu/",
      "text": "Yeah, I used to work 70 hours a week at three jobs. I feel dumber, more tired, and busier than I ever have just from this PhD program, but I usually preface all that by saying I've also never been happier. My lab is great, my advisor is a very good person, and i feel blessed just having the opportunity to be in the building. Maybe this is the Psychology PhD talking , but I think reference points are important. I'm a first gen, low SES college graduate. My dad died when I was young, my neighborhood was rough, etc. etc. Insert more trauma porn here. My point being: I wasn't supposed to make it as far as I did, so to get hung up on these tiny details like some people is this sub is completely asinine. Don't get me wrong; I'm VERY pro-union and will call out toxic shit at the drop of a hat when it presents itself, but this \"grad school is the worst thing that's ever happened to me\" vibe is not my experience at all.",
      "author": "DonHedger",
      "created": 1603291112,
      "upvotes": 10,
      "replies": {
        "g9k0267": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k0267/",
          "text": "I think part of the problem is that the culture of grad school is that it is your whole life. If it is your whole life, every little thing is actually a big thing. \n\nI am not going to lie and say that I am particularly happy here. I will, however, say that academic is my job, not my life. I am old enough and cranky enough that my identity is separate. So, when my job sucks, it doesn't affect every part of me and my day.",
          "author": "CeeCee123456789",
          "created": 1603298060,
          "upvotes": 6,
          "replies": {
            "g9k53vh": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k53vh/",
              "text": "That's an interesting point, too. At 28, I'm a decent bit older than my average cohort member, who is 23. I've had a lot of experiences and opportunities to define myself between undergraduate and graduate, whereas most of my cohort either came straight out of undergrad or did a year in between. I've noticed folks who take this all waaaay too seriously. I mean, don't get me wrong. I put in the work. I probably dedicate 50+ hrs a week, but I'm not gonna hate myself because I want to take a day off to take my dog to the park or melt into Red Dead Redemption.",
              "author": "DonHedger",
              "created": 1603300492,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g9jjqnl": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jjqnl/",
      "text": "We’re happy to be doing what we’re doing, just need to whine about it sometimes :)",
      "author": "justalotoffeelings",
      "created": 1603289945,
      "upvotes": 3,
      "replies": {}
    },
    "g9jj6bs": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jj6bs/",
      "text": "> But, I don't think that I have ever been more fulfilled doing something in my life. I feel like I am being pushed to learn and that I am learning a lot. I have also been lucky to find a group of people in my cohort who I think have similar goals and aspirations with that have made a very good friend group for me. \n\nThis is exactly the experience I'm hoping for. It's good to hear that's not just wishful thinking. Thank you.",
      "author": "MelodyCristo",
      "created": 1603289644,
      "upvotes": 4,
      "replies": {}
    },
    "g9jj5oc": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jj5oc/",
      "text": "The only reason I find myself miserable is because of COVID. I am literally one of 5 people that visit their lab regularly (whole institution). I wake up and go to work. See/speak to no one, and then come home and work/study.",
      "author": "PaleoNimbus",
      "created": 1603289634,
      "upvotes": 192,
      "replies": {
        "g9jzosp": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jzosp/",
          "text": "Yeah for me if anything is bad its just the COVID situation",
          "author": "elatedwalrus",
          "created": 1603297885,
          "upvotes": 39,
          "replies": {}
        },
        "g9k7x7u": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k7x7u/",
          "text": "Yeah I loved grad school pre-COVID and now I'm kind of miserable but I'd probably be miserable at any remote job right now.",
          "author": "MsAggieCoffee",
          "created": 1603301838,
          "upvotes": 28,
          "replies": {}
        },
        "g9kopk8": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kopk8/",
          "text": "This x1000000",
          "author": "milhaupt",
          "created": 1603309806,
          "upvotes": 5,
          "replies": {
            "g9krl9l": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9krl9l/",
              "text": "Like, are there other students here or...? Haha",
              "author": "PaleoNimbus",
              "created": 1603311199,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g9kntv0": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kntv0/",
          "text": "I was looking forward to grad school pre-COVID since I'd worked in labs regularly but just as a grunt undergrad and I looked forward to doing more.\n\nFrom everything I've heard, my experience in my past labs is still how it's meant to go, but starting in COVID has been absolutely miserable. I've only met my advisor twice and both were due to emergency meetings because starting grad school in a pandemic has been a nightmare on my health, mental and physical",
          "author": "ConfusedCuddlefish",
          "created": 1603309384,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g9ji4cd": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9ji4cd/",
      "text": "Yes!!! \n\nI am in year 1 and I went into graduate school with the most terrible mindset because of all the posts from this and other academia related subs. \n\nBUT after a month and a lot of reflection, I realized that although I am always behind on my work, do not really understand what I want to research, and am getting bored of this pandemic, that I would not want to be anywhere but here! \n\nI literally get paid to learn and grow as a person.",
      "author": "raeee_0710",
      "created": 1603289064,
      "upvotes": 5,
      "replies": {
        "g9lb0xv": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9lb0xv/",
          "text": "[deleted]",
          "author": null,
          "created": 1603320672,
          "upvotes": 2,
          "replies": {
            "g9nxu89": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9nxu89/",
              "text": "I get that. Like I said, I’ve read a lot of posts in different subs, and I also just talk to other graduate students irl lol. I know things change, I understand the reality of this life and academia, and that’s fine. But I think I’m setting myself up for failure if I START with a negative mindset. \n\nI’m sure things will change. But starting off more positively will hopefully give me the stamina to continue IF things go downhill. \n\nI’m here though and I chose this path. As a mindful and striving-to-be-healthy person, I can only start positive and hope to stay that way.",
              "author": "raeee_0710",
              "created": 1603386226,
              "upvotes": 1,
              "replies": {
                "g9o5now": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9o5now/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1603389958,
                  "upvotes": 2,
                  "replies": {
                    "g9riuoq": {
                      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9riuoq/",
                      "text": "I totally agree!! I often talk with other grad students about how higher education functions to the detriment of its faculty and students. It’s sad. Esp when you want to be great, but feeling like being great means sacrificing a lot of urself. It’s a hard reality and part of why I was so sad when grad school first started. \n\nThank you for your reply though and I hope you are doing well or at the very least, have found ways to cope with your stress.",
                      "author": "raeee_0710",
                      "created": 1603465253,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9jhu8t": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jhu8t/",
      "text": "I am so much happier in grad school than I would be at any other job I could get with just my bachelors, and hopefully, my career options are significantly wider once I am finished. Additionally, I am really growing as a person and a professional and am coming into my niche as a scientist. I would definitely recommend grad school to others and have thoroughly enjoyed my experience thus far, even though there have definitely been some real shit times.",
      "author": "giantwashcapsfan8",
      "created": 1603288908,
      "upvotes": 17,
      "replies": {}
    },
    "g9jh6nx": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jh6nx/",
      "text": "I really enjoyed my first year and about half the second. It's after that when it became bad. But I do think this sub can exaggerate, some people enjoy the whole time",
      "author": "iammaxhailme",
      "created": 1603288547,
      "upvotes": 36,
      "replies": {
        "g9jmbwe": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jmbwe/",
          "text": "Absolutely. OP didn't say what year they are, but I could've written a similar positive post my first year. It wasn't until my third year that things started going downhill and my advisor started mistreating me.",
          "author": "geosynchronousorbit",
          "created": 1603291307,
          "upvotes": 35,
          "replies": {
            "g9jswhy": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jswhy/",
              "text": "It all depends on who your advisor is. I was fortunate to have a very nurturing and supportive advisor, but most grad students are not so lucky.",
              "author": "junkmeister9",
              "created": 1603294578,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "g9jh6ht": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jh6ht/",
      "text": "Yeah i started a masters degree in september and ive been enjoying it immensely so far!",
      "author": null,
      "created": 1603288545,
      "upvotes": 2,
      "replies": {}
    },
    "g9jh2ka": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jh2ka/",
      "text": "Grad school is very challenging.  It is also a filter -- some folks rise to (and really, really enjoy) that, and find deep fulfillment; others see it as ... an unnecessary challenge.  One reason so many folks drop out of Ph.D. programs is that nobody has yet figured out a better way to determine which kind of person \\*you\\* will turn out to be, than just applying the stress and seeing what happens.\n\nLike any stress test (of materials or people) there are outliers -- groups and/or fields that are easier or that are more stressful than they should be.  So there's an element of chance there also.  That's one reason I always advise folks to talk with existing graduate students before joining a group, and to consider the grad school search to be a search for an advisor and/or group they like, not necessarily a school that is prestigious.",
      "author": "drzowie",
      "created": 1603288484,
      "upvotes": 5,
      "replies": {
        "g9k07ad": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k07ad/",
          "text": "And I will now be taking that advice. Lol thank you",
          "author": "maiogenes",
          "created": 1603298129,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9jglwg": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jglwg/",
      "text": "Agreed, while I’m only in a masters program that I’m not paying for so I can’t speak for any doctoral candidates or anyone taking loans. But I have come to really enjoy being in grad school, regardless of all the times I want to pull my hair out and have to turn down fun social activities to get work done. I’ve found it very rewarding in so many ways. I feel like it’s what you make of it. On the flip side though, I am aware of some systemically abusive practices that take advantage of students, and my compassion goes out to people in those situations.",
      "author": "LiveNDiiirect",
      "created": 1603288223,
      "upvotes": 2,
      "replies": {}
    },
    "g9jgiuy": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jgiuy/",
      "text": "I am so happy to be in a full time doctoral program in public health. I did my MPH part time while working full time. I quit my job to do the PhD full-time (and have a baby), and in year two I am more convinced every day that it was exactly the right thing to do. Sure it was a huge pay cut, but the quality of life improvement is very much worth it. Very happy camper over here as well!",
      "author": "thallomys",
      "created": 1603288175,
      "upvotes": 54,
      "replies": {}
    },
    "g9jfuyh": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jfuyh/",
      "text": "To me, it seems people love to have competitions to see who is the most busy, classes suck, reseaearch sucks the most or whatever. \n\nI have noticed this especially with Grad students and freshman engineering students, it is unbearable to be around. \n\nI agree alot of it is peoples mindset, but I also recognize there are some truly miserable and toxic situations out there.",
      "author": "rustyfinna",
      "created": 1603287800,
      "upvotes": 95,
      "replies": {
        "g9jqjwa": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jqjwa/",
          "text": "Yeah, misery shouldn't be a competition.",
          "author": "1studlyman",
          "created": 1603293429,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "g9jfggb": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jfggb/",
      "text": "Who would have thought you'd have a good time when you're in a good lab with a good supervisor and work with other, friendly, people who do the same research as you?\n\nThis is news to me.",
      "author": "Matthew94",
      "created": 1603287570,
      "upvotes": 35,
      "replies": {
        "g9jg2u2": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jg2u2/",
          "text": "I’m just trying to show to people that there’s more than just straight hell being in grad school. I’m not saying people don’t have it tough.",
          "author": "NoxiousChemist",
          "created": 1603287923,
          "upvotes": 26,
          "replies": {
            "g9jggoc": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jggoc/",
              "text": "Everyone acknowledges that you can have a good time. The point of all the complaining is that it's very unlikely for all the stars to align as they have for you.\n\nIt's like winning the lottery and then telling people in poverty to cheer up.",
              "author": "Matthew94",
              "created": 1603288141,
              "upvotes": -12,
              "replies": {
                "g9jgo83": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jgo83/",
                  "text": "90% of my cohort feels the way I do. I wouldn’t say it’s winning the lottery to be in a good situation. I just know from reading this sub pre grad school I was HORRIFIED of what it was going to be like. And am trying to give people who are scared some hope that grad school can be good if you pick the right school/PI. I literally turned down my first choice after visitation because I thought I would’ve been miserable there whereas the school that I really wasn’t even considering for me really well and now I feel as though I am thriving here.",
                  "author": "NoxiousChemist",
                  "created": 1603288260,
                  "upvotes": 18,
                  "replies": {
                    "g9jhqzb": {
                      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jhqzb/",
                      "text": "I think you already said in your original post that you know everyone else’s experiences are valid! I am not sure what this commenter was going on about, but you were most definitely NOT saying that your experience was the common experience but that it’s just an experience that does not get talked about enough in this sub and I agree!",
                      "author": "raeee_0710",
                      "created": 1603288858,
                      "upvotes": 22,
                      "replies": {}
                    },
                    "g9jh9k8": {
                      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jh9k8/",
                      "text": "Same for me. Both departments I’ve attended had a really positive vibe, great professors, and generally happy graduate students. I can be kind of a bummer from time to time, but that relates more to personal insecurity and anxiety regarding future job prospects.",
                      "author": null,
                      "created": 1603288592,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "g9jh9bk": {
                      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jh9bk/",
                      "text": "> 90% of my cohort feels the way I do.\n\nOf course they do. You've already said you're in a good lab where everyone works on related topics that they care about. It would be stranger if you somehow thought you were in a great situation due to the listed factors yet they all thought they were going through hell.\n\nYour little enclave doesn't somehow refute the experience of what I'd say is a huge chunk of students who pass through academia. \n\nI've talked to multiple people from multiple universities across multiple fields and the majority of them had a bitter tone when discussing academia. I can't remember many who were outright positive about it.",
                      "author": "Matthew94",
                      "created": 1603288588,
                      "upvotes": 14,
                      "replies": {
                        "g9jswyz": {
                          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jswyz/",
                          "text": "OP said right off the bat that their post wasn't intended to take away from other's negative experiences.  If somebody sharing a positive experience is this triggering for you, that sounds like a personal issue.\n\nIt is unlikely that when OP says \"cohort\" they only mean the people in their lab.  It is much more likely that they mean all of the individuals who they started the program with - who all would have ended up in different labs.\n\nI'm a 4th year STEM PhD student.  There are 38 students in my cohort, all of us entered the program under an umbrella program, and then branched out to different departments and labs after the first year.  Every. Single. Person. In my cohort enjoys graduate school and feels fulfilled by what they do.  At my R1 university, this is the norm, and it is a culture that is intentionally perpetuated by faculty, administrators, etc.  That culture is the #1 reason why I applied to this University.  Program culture and work-life balance are things that prospective students NEED to be aware of when they are weighing different programs.\n\nOP's intention in their post was to provide a positive perspective on this sub for prospective graduate students.  If prospective students don't realize that Universities and programs with a positive culture exist, then they won't know that's something that they need to be looking for.",
                          "author": "Emmarae9",
                          "created": 1603294585,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g9ka8so": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9ka8so/",
                  "text": "> It's like winning the lottery and then telling people in poverty to cheer up.\n\nLikening one's probability to being a part of a non-toxic work environment to _winning the lottery_ is the very negative perception of grad school the OP is trying to change.\n\nNo one is denying that toxic work environments exist -- only that such experiences are not universal.",
                  "author": "Im_A_Quiet_Kid_AMA",
                  "created": 1603302922,
                  "upvotes": 4,
                  "replies": {
                    "g9kp61l": {
                      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9kp61l/",
                      "text": "My department chair and advisor explicitly told me that working extreme hours and sacrificing holidays etc are the expectations for a grad student before I quit the program.  The universe of that department was toxic, and only a few faculty had the ability to create bubbles to hold off the toxicity.",
                      "author": "McNoobertron",
                      "created": 1603310026,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9jfbow": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jfbow/",
      "text": "100%. I really enjoy the work I'm doing, my advisor is pretty responsive, my colleagues are helpful, and I work on what I want when I want. Everyone's experience is going to be different, and mine has been pretty good. A lot of your experience depends on the discipline and program, so make sure you do your research and reach out to faculty before you apply.",
      "author": "Dawalkingdude",
      "created": 1603287493,
      "upvotes": 3,
      "replies": {}
    },
    "g9jf28q": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jf28q/",
      "text": "It seems like the norm is for grad students to be miserable. That mindset is what keeps people miserable. I’m so grateful for the opportunity that I’ve been awarded and LOVE school, thus I stay pretty chipper despite all of the stress.",
      "author": "_johnfketamine",
      "created": 1603287338,
      "upvotes": 62,
      "replies": {
        "g9jlj6b": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jlj6b/",
          "text": "It’s great that you’re happy, but telling other people that their “mindset” is responsible for their overall mental health is a little dismissive. Furthermore, that’s not how mental health works. We’re all entitled to our own emotions.",
          "author": "lilaleidenschaft",
          "created": 1603290889,
          "upvotes": 68,
          "replies": {
            "g9jsdaz": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jsdaz/",
              "text": "I understand how mental health works. I’m not dismissing depression and anxiety, but I’m saying it shouldn’t be the norm, because why be a masochist. Mental health should be prioritized over school.",
              "author": "_johnfketamine",
              "created": 1603294313,
              "upvotes": -5,
              "replies": {
                "g9k45ki": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k45ki/",
                  "text": "still think you're missing the point a bit. many (most?) grad students having a bad experience aren't consciously choosing to prioritize school over their mental health, or choosing to be miserable. there are very real systemic reasons, specific to graduate school, that make \"just choose to be happy by working less/dropping out/etc.\" unrealistic for some people in bad situations.\n\nif you haven't had to deal with this, that's great - i haven't either, and i'm lucky to have a super supportive and reasonable advisor. but i do know people who have been through awful situations, through absolutely no fault of their own, that they needed to negotiate delicately for fear of damaging future employment prospects.",
                  "author": "kittttttens",
                  "created": 1603300029,
                  "upvotes": 24,
                  "replies": {
                    "g9k5cnw": {
                      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k5cnw/",
                      "text": "I have struggled HARD with bipolar disorder, barely graduated with my bachelors, and made some really poor decisions because of it. Ended up in the hospital 4 times. If I got stuck in the victim mindset (or to maybe sound less harsh, the “norm” of misery) and didn’t advocate for myself and my mental health, I wouldn’t be where I am today. Having a mental illness isn’t a choice, but how you manage it is.",
                      "author": "_johnfketamine",
                      "created": 1603300609,
                      "upvotes": -4,
                      "replies": {
                        "g9k7701": {
                          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k7701/",
                          "text": "ok, i think we're talking past each other a bit now. i completely agree with you that it's possible to succeed in grad school with a mental illness. i think it's admirable that you're managing yours well, and i agree that it's important to learn how to do so before starting a demanding grad program.\n\ni'm just pointing out that not everyone who's miserable in grad school is miserable because of a pre-existing mental illness. an abusive supervisor or bad lab environment isn't something you can just manage your way out of, at least not easily and not without substantial risk of professional repercussions.\n\nmaybe this is obvious to you, but i think it's important for new/prospective students to be aware of.",
                          "author": "kittttttens",
                          "created": 1603301492,
                          "upvotes": 15,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9lzvjg": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9lzvjg/",
          "text": "I dunno that's a pretty big blanket statement to apply to a wide variation of problems, a lot of which don't go away with a mindset change or just trying a little harder. Someone else mentioned mental health and I'll throw out finances as well, as things are generally a bit more difficult when you're poor. Even expecting it and being used to it, to go through all OP mentioned only to come home to a shitty room in a shitty apartment with roommates can really chip away at people, and that's not even a particularly dramatic scenario. \n\n A little bit of empathy is free and easy my friend",
          "author": "WinstonDaBeston",
          "created": 1603335064,
          "upvotes": 3,
          "replies": {}
        },
        "g9jhfxd": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jhfxd/",
          "text": ">It seems like the norm is for grad students to be miserable. That mindset is what keeps people miserable.\n\nYes, people are miserable because they feel it's expected of them. Did you actually think through what you wrote?",
          "author": "Matthew94",
          "created": 1603288691,
          "upvotes": 16,
          "replies": {
            "g9jja7x": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jja7x/",
              "text": "That's a thing that happens. Some people view joy as a distraction. I'm still unlearning that mindset myself and I'm not even in grad school yet.",
              "author": "MelodyCristo",
              "created": 1603289702,
              "upvotes": 23,
              "replies": {}
            },
            "g9jzljg": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jzljg/",
              "text": "I mean as evidence you can see the posts here that are incoming grad students freaking out about starting their program",
              "author": "elatedwalrus",
              "created": 1603297843,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g9k233i": {
          "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k233i/",
          "text": "The happiest time in my life was as a grad student. It's all been kinda <meh> since then.",
          "author": "stolid_agnostic",
          "created": 1603299034,
          "upvotes": 2,
          "replies": {
            "g9k2iqg": {
              "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k2iqg/",
              "text": "Yea, undergrad was a nightmare for me. The years in between that and grad school were a bit of a roller coaster too. I’m currently in my second semester of grad school and I’m the most stable and content that I’ve ever been.",
              "author": "_johnfketamine",
              "created": 1603299241,
              "upvotes": 5,
              "replies": {
                "g9k2so2": {
                  "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9k2so2/",
                  "text": "If I could have remained a student for life, I would be far happier.",
                  "author": "stolid_agnostic",
                  "created": 1603299371,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9jeoyq": {
      "link": "/r/GradSchool/comments/jfcdlk/grad_school_not_as_bas_as_the_sub_makes_it_seem/g9jeoyq/",
      "text": "I agree with you. I love my program and I have never been happier doing anything else.",
      "author": null,
      "created": 1603287124,
      "upvotes": 8,
      "replies": {}
    }
  },
  "updated": 1634066267
}