{"sid": "kse9je", "link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/", "title:": "Political Science graduate students - do you ever just feel like not talking about it?", "text": "There is so much going on in US & World politics. My friends think I want to talk about politics and government all of the time because it’s my area of focus - which is understandable. I mean I didn’t go into field *not* interested in how government operates or wanting to affect change meaningfully. \n\nBut holy shit. I am overwhelmed with news. It seems major political events are happening all of the time lately and I am not processing things quick enough. People treat politics as a a dinner discussion but I engage with it for my career. It feels inescapable now.\n\nI hope this doesn’t have any implications on my career. I just don’t know how to set boundaries for something that is so interwoven into my life.", "author": "athoughtbin", "created": 1610029532, "retrieved": 1632954368, "over_18": false, "upvotes": 310, "upvote_ratio": 0.99, "comments": {"gk0pn26": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gk0pn26/", "text": "Political science is a worthless degree a good luck getting a good job and paying off that student loan debt", "author": "Zombieboy066", "created": 1611197011, "upvotes": -2}, "gii6tpu": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gii6tpu/", "text": "I'm in a political science adjacent line of research and there's never a point where I want to talk about it. I often lie about my research interests because if I'm honest about what I study, random people seem to take that as an invitation to offer their two cents. I've been stuck in an Uber ride where the driver just went off about politics after I told him what I did, and I had those kinds of experiences so often I usually just make something up now. My parents also have politics on TV for at least 12 hours a day (literally). When I watch TV, it's Forensic Files, the First 48, or My 600lb Life.\n\nI always hated political science because it's the least political of the social sciences and I think more often than not is just a forum for over privileged white heterosexuals to talk dispassionately about a system they created to benefit them. Those of us who belong to marginalized groups have to live with the consequences of these systems, and therefore talking dispassionately is not often practicable when polices or systemic structures impact our ability to enjoy equal citizenship in this country. I don't really think it would have much implications for your career. I follow several political scientists on Twitter who say some very forceful things on social media and nobody really pays any mind to it. \n\nAs far as setting boundaries, my general practice is whenever someone brings up politics, I just politely let them know I'm not interested in talking about politics since I study it for a living and find it exhausting. If they keep bringing it up, I become more firm and less polite the longer they continue to disrespect my request.", "author": "False-Guess", "created": 1610077764, "upvotes": 1}, "gii6e8m": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gii6e8m/", "text": "Try being a historian for a while... almost *everyone* thinks they are experts on history and those that don't will happily tell you how much they *hated* history in high school. \n\nOn the upside, I had three media requests today to talk about past insurrections.", "author": "SnowblindAlbino", "created": 1610077529, "upvotes": 1}, "gii4noq": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gii4noq/", "text": "I am in my first year of law school and I can sympathize with this. Most weeks I don't even get a single day off from trying to learn and understand the law, and in the little free time I have I don't want to be expected to answer questions from friends/family about Trumps lawsuits.", "author": "LSATCJ", "created": 1610076586, "upvotes": 1}, "gihtih5": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gihtih5/", "text": "I want to talk politics with some people. I avoid telling people I teach politics if at all possible in most situations because I don't want to get into it. It's really weird, I was always the political kid looking for a fight but getting my PhD has made me way less likely to get into fights anymore.", "author": "DocVafli", "created": 1610070732, "upvotes": 2}, "giht1zv": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/giht1zv/", "text": "This is pretty normal. Political science isn't about keeping up with current events or understanding all things political any more than, say, history is.\n\nNot wanting to talk about current politics is not going to have any implications for your career. If anything, being too eager to opine is a risk. You can set boundaries by directing the conversation towards your particular sub-field, or simply saying that you don't feel like talking about work.", "author": "ZT205", "created": 1610070498, "upvotes": 1}, "gihr24d": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gihr24d/", "text": "[deleted]", "author": null, "created": 1610069457, "upvotes": 1}, "gihp6kl": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gihp6kl/", "text": "I'm an American/European in an IR program in Western Europe. It's become exhausting for me to be the sole voice explaining American matters/law. There are many assumptions here about American matters, which are often too complex for me to explain. I'm the 2nd person from a very rural town to make it to grad school.\n\nIt's been difficult trying to write my final papers with everything going on. My friends who work in DC have bombarded me with information that I just don't have the time to look at. I have a lot of America fatigue explaining things constantly and it's taken a hit on me.\n\nBonus points - a student called Massachusetts a Bible Belt state..... not kidding and they had studied abroad in the US.", "author": "_6varsagod615", "created": 1610068476, "upvotes": 1}, "gihp6c9": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gihp6c9/", "text": "If they don't know what they're talking about, which I don't think most do, I don't enjoy it. You either take them seriously and are arguing against poor points or are condescending by trying to explain to them why they're making poor points.\n\nNot everyone obviously. But it's often. Most people's only interaction with politics is via the news or forums like reddit so it's mostly just partisan stuff and not getting at the substance of what's going on.", "author": "Texas_Rockets", "created": 1610068472, "upvotes": 2}, "giho0gp": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/giho0gp/", "text": "I ask them what the State of Nature was, who was John Locke, in socialism who owns the means of production, etc? When they can’t answer that, I tell them I don’t want to hear their uneducated spin on politics.", "author": "SirSuaSponte", "created": 1610067866, "upvotes": 2}, "gihnh9i": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gihnh9i/", "text": "I got my undergrad in IR, in order to get there I had to do a lot of reading and studying just to get what I felt like was a passing knowledge of politics and world affairs.  \n\n\nTalking to people who not only were ignorant but also were actively hostile towards any kind of education just didn't seem worth it. I didn't spend 2 years of my life and hundreds of hours writing paper and researching those papers to debate with someone who was vehemently insisting that the Democrats are the party of the Klan, or who can't even point out Ukraine on a map tell me that Biden abused his power there.  \n\n\nArguing with people who lack even a 101 understanding but expect me to take the time to debate them as equals when they just pull shit out of their asses and their citations come from something like www.freedomeagledotcawm .", "author": "awkwardenator", "created": 1610067591, "upvotes": 1}, "gihlw1o": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gihlw1o/", "text": "I don’t like to talk about it with friends or family, since this isn’t a ‘casual conversation’ in my case - that would be like someone asking for my casual personal opinion on reading an MRI if I were an MD. This is my field, so I am responsible for speaking and acting professional when discussing it, regardless of circumstance.\n\nIf someone asks me about politics, I am going to give them a clear, accessible answer, but that is explicit and gravitational. If they aren’t understanding a concept, I’ll teach them. However, I find that most don’t want to be taught: they mistaken me as a political and policy specialist who is an appropriate sparring partner for them to debate their minimally-researched theories informed by NBC or Fox, orient it almost exclusively around their country’s politics, and then get mad when I tell them they are wrong in their methods while trying to walk them through how to find minimally biased information. \n\nI don’t say no, since it is my job to be able to reach out to all kinds of people and facilitate communication. The minute someone asks me about something in politics or policy, however, I am now working.\n\nFunny thing is I study theory and European integration - all that I know from the U.S is through studies of theories of democracy, populism, and socially sustainable political economics.", "author": "al_the_time", "created": 1610066771, "upvotes": 2}, "gihdw4p": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gihdw4p/", "text": "Yes. It is exhausting. Ever since Trump was elected, I somehow lost my will to ever *want* to talk politics. It’s not about policy anymore, it’s just batshit crazy town.", "author": "xWhiteRavenx", "created": 1610062715, "upvotes": 1}, "gih4m4z": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gih4m4z/", "text": "I rarely talk to people about politics outside of with people who have some sort of economic and political theory background. Its exhausting.", "author": null, "created": 1610058243, "upvotes": 4}, "gih231i": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gih231i/", "text": "Media studies here. I’m completely done talking about political media coverage and why Trump has such a big following. It’s been completely done to death, everything that needs to be said has already been said.  It’s not even my area of focus.", "author": "henrydavidthoreauawy", "created": 1610057049, "upvotes": 1}, "gigz9qv": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gigz9qv/", "text": "Completely understand how you feel. I did my undergrad and now am a first year grad student in environmental science/renewable energy field. People always want to talk about climate change with me. It’s an important topic but sometimes I just don’t want to discuss it. It’s all I think about and talk about almost 24/7. A lot of the time it’s pretty discouraging and depressing too because of the state of the environment and the politics surrounding it. It’s even better when people want to challenge me about climate change because they think it’s a bunch of garbage.", "author": "ThisgoddamnKitty", "created": 1610055751, "upvotes": 1}, "gigw3wl": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gigw3wl/", "text": "Totally get this. Me. It's so much and with overexposure it is hard for me to want to about what I am so passionate about because it takes over the safe spaces in your life. Especially during grad school, you want to relax and have fun. Given the balance between your studies and all that is happening this is definitely something that resonates.", "author": "AllAboutThatEd", "created": 1610054317, "upvotes": 1}, "gigumtu": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gigumtu/", "text": "PoliSci was my second major in undergrad and at this point I thank god everyday that I didn't pursue it in grad school. Nowadays I basically only talk about it to clear up misconceptions people have about how Congress works or about the incentive structures driving the politicians insane behavior. These last 5 years have destroyed any love I had for the subject, or any potential motivation to get a career as a policy advisor.", "author": "monoDK13", "created": 1610053656, "upvotes": 1}, "gignuoq": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gignuoq/", "text": "I honestly just say \"I'm not in the prediction business\" to any family member asking me if XYZ is going to happen in U.S. politics.", "author": "Valerion", "created": 1610050591, "upvotes": 2}, "gigkx54": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gigkx54/", "text": "I understand how you feel. I study an invasive species and climate change is a big part of my research interests too, but man I just don't want to think about climate change in my day to day life. It'd be overwhelming and even more depressing for me because I'm always thinking about it with my work anyway.", "author": "KiwiTheKitty", "created": 1610049268, "upvotes": 1}, "gigjeo0": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gigjeo0/", "text": "I have these feelings all the time. In a sense, you are talking with children when it comes to these topics. So I just try to keep it simple and avoid the obvious logical fallacy arguments.", "author": "Sdog1981", "created": 1610048588, "upvotes": 2}, "gigdkyj": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gigdkyj/", "text": "I find I have a hard time talking about my day most days because a majority of it has probably been dedicated to my research or studying my butt off for a course or stressing over something. I just don’t want to talk about it. Please don’t ask. \nUnfortunately this makes end-of-day time one sided when my SO comes home and I struggle to keep a conversation going.\nI can only imagine what it feels like to be bombarded with questions from people who have opinions on the subject.", "author": "string_bean_dip", "created": 1610046009, "upvotes": 1}, "giga1k8": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/giga1k8/", "text": "I'm currently doing my PhD in political science (in a subfield unrelated to US politics and much less to Trump), but when people ask me what I'm getting my PhD in, I've stopped answering \"political science\", because the conversation almost always goes like this:\n\nThem: \"What do you study?\"\n\nMe: \"Political science\"\n\nThem: \"Oh, so what's going on with Trump?\"\n\nMe: \"I don't know...\" \\*gestures vaguely\\*\n\nThem: \"Oh come on, I read something in MSNBC/Fox/New York Times/WaPo that said that...\"\n\nMe: \"...\"\n\nI think what a lot of \"Muggles\" don't know is that political science is a very diverse field. There are, of course, several people who study US politics and probably Trump, but there are many who focus on completely different stuff. We have political theory, international relations, comparative politics, methodology (which looks much more like a math PhD at times), etc. I think many people assume that we just sit around reading news articles about Trumps and provide political analysis like pundits or commentators do. Of course, several political scientists do this, but I have found that at least in my department, the emphasis is on producing scientific research for academic journals rather than the type of analysis that comes through in op eds.", "author": "caoimhin730", "created": 1610044471, "upvotes": 11}, "gig91p0": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gig91p0/", "text": "As an economist, I agree. My time was devoted to trying to graduate, not keeping up with economic news. \n\nAlso I am unwilling to talk about an issue unless I actually read a few pieces on it from sources I trust. I have no desire to provide my opinion after you rehashed your version of the news/facts.", "author": "King_Freedom", "created": 1610044036, "upvotes": 9}, "gig69w5": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gig69w5/", "text": "I think it definitely can get kinda repetitive, especially since we actually understand the intricacies of the events in the news. When people come to me actually trying to learn more about politics or something government related they don’t understand, I don’t mind it because it’s rare that people actually care to educate themselves on politics.", "author": "sieeng", "created": 1610042840, "upvotes": 3}, "gig2mu0": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gig2mu0/", "text": "I'm in Public Policy so i 100% understand. It's really hard because there's just so much going on. And you're right, our friends always assume we're always down to talk about it. Or that when they're stressed and need debrief and work through what's going on, that I'm always ready to go at any moment. Or even family members going \"oh did you hear about *blank*? What are your views on it?\". Like please leave me be.\n\nAs much as I want to be there for my friends and also help support them through all the craziness going on, sometimes I just need to let my brain be a pile of mush while I watch New Girl. It's hard between grad school and friends to constantly have your brain always on, especially with something that is changing really quickly in really difficult ways.\n\nI'm sorry OP you're having rough time right now. Sending virtual hugs your way!!", "author": "betty_deez", "created": 1610041264, "upvotes": 4}, "gig2cue": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gig2cue/", "text": "Somewhat related to this:\n\nI had a conversation with a friend recently. He was surprised that I am always up to date on hip hop beefs and rapper drama. \n\nI told him the reason is that i spend all day reading about elections, ideology, theory, genocide, war, and stuff like that (international relations major). It feels good to just shut all of that away and follow dumb celebrity drama. It is much simpler, and the stakes are much lower.", "author": null, "created": 1610041144, "upvotes": 11}, "gig1nv8": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gig1nv8/", "text": "I’ve learned to create boundaries. I’m interested in everything going on but I also need to understand that everything I see online/in the news is going to read is going to be hyperbolized. I try to get the facts and move on and not continue scrolling. \n\nIf someone asks I answer but not a lot of people do. I have friends from my program but they understand when I say I’m don’t want to talk about politics because they probably feel the same.", "author": "ap_101", "created": 1610040843, "upvotes": 1}, "gifzyot": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gifzyot/", "text": "Yes. I hate US politics. My emphasis in undergrad was international politics, specifically German. My concern is how our allies and enemies are viewing our implosion right now.", "author": "g-wenn", "created": 1610040106, "upvotes": 12}, "gifz45e": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gifz45e/", "text": "I've taken to just being blunt with people and saying  that \"I do not have the emotional or mental capacity to have this discussion right now, but I appreciate that you value my input\" and then I change the subject. Or I tell people \"that's not really my area of expertise, but if you want to talk about \\[my research area\\], I'm happy to discuss that instead.\" \n\nIt's just too much to spend all day trying to have nuanced and insightful discussions about genocide or fascism or ethnic conflict or nukes or whatever depressing topic and then turn around and have people turn to you as their own personal opinion column on the events of the world. \n\nAlso, it is totally okay to take days off from the news or miss a few major world events here and there. Like, I know what happened yesterday, but I also know that I am going to limit myself to two articles about it because that's what I currently have the capacity for.", "author": "loloopssorry", "created": 1610039728, "upvotes": 25}, "gifviug": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gifviug/", "text": "For sure. With the right discussion partner, it can be fun to share what I've learned and get an outsider's take. But others are just in their own world, where everything's black-and-white, and still others act as if Donald Trump is a comic book villain who isn't serious enough to engage in collective action over, but \"entertaining\" enough (in some fucked-up way) to spend every waking minute expressing shock over.\n\nIn fact, I remember the exact moment I just resolved never to pay attention to the man again unless I was prepared to do something. Everyone wanted to tell me about Trump being stupid with a sharpie and a hurricane map. I am intentionally foggy on the very, very unimportant details.", "author": "swampyankee22", "created": 1610038128, "upvotes": 11}, "gifu3dj": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gifu3dj/", "text": "I was in political science for my undergrad and went into grad school for something else, I got fed up with people asking for \"my take\" on current events when I wanted nothing more than to relax. People who I didn't know and wasn't sure I could be more open about my opinion suddenly put me in a position I was uncomfortable with. Idk if anyone else ever experienced that.", "author": "thelaughingmansghost", "created": 1610037491, "upvotes": 7}, "gifp0xi": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gifp0xi/", "text": "I'm not PoliSci, but I imagine the desire for \"no shop talk\" is fairly universal.\n\nAnd that's what I use when I just don't feel like discussing chemistry.  \"Sorry, no shop talk on my days off\"", "author": "hixchem", "created": 1610035172, "upvotes": 78}, "gifolru": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gifolru/", "text": "Dropped out of an IR program. \n\nSo. Damn. Much. I was interested in China/Chinese investments in Africa. \n\nI used to joke whenever I was asked for oracle-esque predictions on US elections or something, “My crystal ball is in the shop.”\n\nAlso, fuck youtube. I am sick of being talked at by Youtube Doctorate holders aka bored white male professionals that listen to another white male offering a botched melange of Jared Diamond, Peter Zeihan (sp?), Joe Rogan and other luminaries of the pop-politics/social critic bookshelf or podcast-sphere.", "author": "james_the_wanderer", "created": 1610034977, "upvotes": 66}, "gifl67r": {"link": "/r/GradSchool/comments/kse9je/political_science_graduate_students_do_you_ever/gifl67r/", "text": "It turns out that when most people want to talk politics as they understand it, they really just mean the usual blue vs red or whatever they happen to read on Twitter.  Whenever I've tried to go in depth with underlying political theory, people lose interest very quickly.  The average \"dinner discussion\" isn't going to involve subjects like how the polis can seek a particular vision of the good, the state of nature, names and context within the political sphere, etc.  This difference alone might be the boundary you are needing to implement, as hard as that might be right now.  Encourage people to discuss at length instead of surface level?", "author": "Big-Sploosh", "created": 1610033326, "upvotes": 176}}}