{
  "sid": "q5p3ul",
  "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/",
  "title:": "Dropping out of grad school (first semester)",
  "text": "Hi all,\n\nI have been extremely unhappy with my grad program that I started late August. This is my first semester, but I have a strong sense that I do not want to be here and I am wholly unmotivated to continue completing my work. I’ve talked to my parents, and they’d support me dropping out to instead pursue getting a job. \n\nI’m wondering if dropping out looks exceptionally bad? It’s not because the classes are hard. I know that I 100% could get fine grades in the classes if I tried at them. I just want to be out of school for the first time in 16 years, go and do something else for a while. If i feel the need to come back and get a Masters, then I’d do that. However, it’s not what I want to do right now.",
  "author": "_Rollins_",
  "created": 1633930504,
  "updated": 1634099746,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.99,
  "comments": {
    "hg7t7io": {
      "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/hg7t7io/",
      "text": "No worse than quitting anything else.\n\nJust make sure you have something else lined up before you leave.  Being paid steadily is nice.",
      "author": "Weekly-Ad353",
      "created": 1633951515,
      "upvotes": 6,
      "replies": {}
    },
    "hg9gyrs": {
      "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/hg9gyrs/",
      "text": "It doesn’t matter what it looks like if you don’t tell anyone.",
      "author": "lovethebee_bethebee",
      "created": 1633979306,
      "upvotes": 3,
      "replies": {}
    },
    "hg9da75": {
      "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/hg9da75/",
      "text": "Different people will have different opinions about it, but I think you could easily explain it as realizing that it just wasn't the right time for you and most people will respect that. I think if you're really sure about it, it's better to just leave instead of torturing yourself by staying!",
      "author": "KiwiTheKitty",
      "created": 1633977750,
      "upvotes": 2,
      "replies": {}
    },
    "hgbfxqu": {
      "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/hgbfxqu/",
      "text": ">I’m wondering if dropping out looks exceptionally bad? It’s not because the classes are hard. I know that I 100% could get fine grades in the classes if I tried at them.\n\nYou are halfway through the semester. So I would recommend finishing it out. It's not a long commitment. You've already paid your tuition.\n\nThen you'll always have those credits should you change your mind later. And you'll be able to tell employers that you completed the semester, and then decided you would rather go to work.\n\nPlus, you can take advantage of your institutions career center to start applying for jobs for January.\n\nSo treat the rest of the semester like a job that you need to finish before you take your next one.",
      "author": "raistlin65",
      "created": 1634012615,
      "upvotes": 2,
      "replies": {}
    },
    "hgat1ub": {
      "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/hgat1ub/",
      "text": "Why did u bother to apply and everything if you’re dropping out the first term..",
      "author": "animelover9595",
      "created": 1634001770,
      "upvotes": 0,
      "replies": {
        "hgb4i1y": {
          "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/hgb4i1y/",
          "text": "It’s a valid question, and one i’m probably going to have to answer a few times while withdrawing…\n\nSince spring semester, junior year of college, it was a one track mind. I sat down with my advisor, he instantly suggested grad school and that I do an honors project with him. I never even questioned it. It’s a STEM field. of course i’ll go get a masters to give myself better opportunities. My brother is in med school and both my parents went to grad school, so it was a no brainer. \n\nIt wasn’t until i got here that I really understood how much i didn’t want this. I want a job, sure. But i need a break from school at least. i didn’t understand this so absolutely in college, and i don’t think i really could’ve. This is the first time i really feel like i’m diverging from a pre set track, as cliche as that sounds. I think i needed to experience this first to get to my decision. I just feel bad about having possibly taken a spot from someone who would’ve presumably been more dedicated, and letting down people who gave me this opportunity… But at this point, it’s too late. And of course I can’t stay in grad school due to that guilt.",
          "author": "_Rollins_",
          "created": 1634006957,
          "upvotes": 4,
          "replies": {
            "hgczag6": {
              "link": "/r/GradSchool/comments/q5p3ul/dropping_out_of_grad_school_first_semester/hgczag6/",
              "text": "That’s all fair, I would just advise better researching your options prior, or giving it more time before u make a drastic decision.",
              "author": "animelover9595",
              "created": 1634050291,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}