{
  "sid": "qh8t2w",
  "link": "/r/GradSchool/comments/qh8t2w/smashed_my_laptop_in_a_freak_accident/",
  "title:": "Smashed my laptop in a freak accident",
  "text": "Fire alarm goes off half way through our already delayed meeting (not a problem). I place my (new) dell XPS laptop in its carry case and zip it (or so I thought). Seconds later as I'm cerrying my laptop bag down the stairs... \n\n*Smash*...\n\nDrops out of the case and hits a terrazzo floor, denting the frame and loosening the hinge. It still works but I'm furious with myself. Worked hard to afford it and my own flustered lack of attention results in that :( \n\nHas anything like that happened to you?\n\nThank God it still works and k have google cloud sync.",
  "author": "Nuclear_Fermion",
  "created": 1635375172,
  "updated": 1635457637,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hic777x": {
      "link": "/r/GradSchool/comments/qh8t2w/smashed_my_laptop_in_a_freak_accident/hic777x/",
      "text": "I felt gut fear until seeing that last bit. I came in thinking, \"Ok, the drive should be okay, there are external conversion options, and --...\"\n\nMy worst was some years ago, XPS laptop too, and while celebrating in a new apartment, I left it on the floor, and my roommate accidentally destroyed the LCD with his head. I leave the physics of that to imagination. \n\nHe was genuinely apologetic, and was an honest accident. I'm a bit of a junkyard mechanic with computers (Same roommate once came home to me with a stripped-down Xbox 360 in the kitchen oven, that was hard to explain on the spot), so until I could source a replacement screen and lid to install, my XPS was this lidless monstrosity with a jury-rigged connection to the broken-ass screen, and an HDMI connection to a nearby small TV.",
      "author": "Crimsonial",
      "created": 1635392281,
      "upvotes": 2,
      "replies": {}
    },
    "hieyew5": {
      "link": "/r/GradSchool/comments/qh8t2w/smashed_my_laptop_in_a_freak_accident/hieyew5/",
      "text": "I’ve dropped my MacBook Pro at least 3 times now in similar situations over the past 4.5 years and it still works perfectly well. It doesn’t look nice and shiny anymore, but that’s just the normal cycle of things we buy :) See if you can get the hinge fixed and don’t worry about dents/scratches. Next time something happens to it it’ll hurt less 😉 (but of course that doesn’t mean you shouldn’t still be careful!)",
      "author": "sh2os",
      "created": 1635446930,
      "upvotes": 1,
      "replies": {}
    },
    "hibilc1": {
      "link": "/r/GradSchool/comments/qh8t2w/smashed_my_laptop_in_a_freak_accident/hibilc1/",
      "text": "\\~winces\\~ Poor comp. :(\n\nReminds me of the time my dear Mother, *cleaned* a laptop I had. The ethernet cable became jammed into its port and I was forced to cut it and get a wireless card. The only time I ever screamed profanities at my Mommy.",
      "author": "qwertyrdw",
      "created": 1635381004,
      "upvotes": 0,
      "replies": {}
    }
  }
}