{
  "sid": "pjac1q",
  "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/",
  "title:": "Dating a PhD student when you're not in school?",
  "text": "I'm in my mid-20's. I finished my master's degree last year, but it was a one-year program. I currently work in a college town.\n\nI've been talking to this guy for almost a month. We've been on a few dates. We're the same age, but he's in the third year of his PhD and I am working. None of my friends pursued a PhD so I don't really know what PhD students go through. He told me that this year is the year where his program starts to get busy. He's in a STEM PhD, and I got my undergrad/masters in something very much not STEM lol.\n\nIn general, what are some things I should consider when dating a PhD student, as someone who doesn't understand PhD programs? How can I be an understanding (potential) partner to them?",
  "author": "lilyaintaG",
  "created": 1630968141,
  "over_18": false,
  "upvotes": 74,
  "upvote_ratio": 0.95,
  "comments": {
    "hbz3nk3": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbz3nk3/",
      "text": "I am dating someone who only has a high school diploma and honestly it's way better than when I dated a fellow PhD student. It helps me have work-life balance, I have a support system when things get crazy, he works in a field that exists literally everywhere so if I have to move for a job we don't have to worry about that sort of conflict (academic jobs are so few and far between that it can be hard for academic couples to end up in the same place). \n\n&#x200B;\n\nIt helps that he's an introvert who is happy to do his own thing when things get busy. I couldn't date someone who needed a LOT of attention. He played a lot of League of Legends while I was writing my dissertation and was fine with that, and he has his own group of friends he'll go off and play MTG or Warhammer with, giving me alone time in the house.\n\n&#x200B;\n\nOh and I know you're only a month in so living together is way far down the road, but if you move in together in grad school don't be offended if he wants a two bedroom place. Having my own space is vital for writing.",
      "author": "MsAggieCoffee",
      "created": 1631046320,
      "upvotes": 2,
      "replies": {}
    },
    "hbyeew1": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbyeew1/",
      "text": "As someone in a PhD in a relationship with a partner who is working, time/scheduling/personal space were all things that I appreciated. Since I don't have a 9-5, I work whenever I want and I work better in the evening as well as when everyone's asleep. That may mean that I spend time together with my partner during dinner time and weekends, possibly. We've structured weekly Wednesday evening dinner dates over a movie to spend more time but this is still something that is structured and I can work around and have that balance. Honestly, the lack of 9-5/structured work makes time management and boundaries the most important thing to work with.",
      "author": "EthanJJ",
      "created": 1631035916,
      "upvotes": 2,
      "replies": {}
    },
    "hbxljgu": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbxljgu/",
      "text": "1. Every PhD project is different. There is a huge variety even in supervisors within the same department at the same university. So if there are specifics that he tells you about the program that seem counter to what you are told here, he is probably right.\n2. Even though we call it 'PhD *student*', it really isn't being a student in any meaningful way. In your mind, model it as a 'Scientist Traineeship/apprenticeship'; hard work, low pay. Think of it as the scientist-equivalent of (medical) doctors doing hospital residencies, or fresh new lawyers joining their first firm.\n3. There will be very busy periods. Especially near the end, I've flat-out told my partner things like \"I'm not going to be available for any social activities in the coming two months\". It helped that we lived together though.\n4. Don't take it personally. With high workload and high stress comes decreased attention to our partners. It should be temporarily, but can still be weeks or a month at a time.",
      "author": "cephalord",
      "created": 1631023884,
      "upvotes": 5,
      "replies": {}
    },
    "hbxf4m5": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbxf4m5/",
      "text": "It's amazing how so many people have come forward to describe what this person might be going through and he has no fucking idea. Man, this guy is lucky!!!",
      "author": "OoculusReparo",
      "created": 1631020842,
      "upvotes": 2,
      "replies": {}
    },
    "hbx75ox": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbx75ox/",
      "text": "The two most valuable resources are time and money, and he won’t have much of both. Just be aware that his work hours will probably work long and weird hours, and won’t be able to be too wild in his spending",
      "author": "Stoic-Way",
      "created": 1631016392,
      "upvotes": 2,
      "replies": {}
    },
    "hbwo5q4": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbwo5q4/",
      "text": "He's not kidding. The 3rd year is when grad school gets really busy. It'll taper off but don't put pressure on him to come home at a certain time. Sometimes, it is not possible to know exactly when he'll be done. Be flexible with meeting times because it is NOT easy to accommodate anything outside of grad school",
      "author": "resorcinarene",
      "created": 1631001015,
      "upvotes": 3,
      "replies": {}
    },
    "hbw0h93": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbw0h93/",
      "text": "I would add to keep busy with your own interests. That way he won't feel guilty about being busy with his work, and you won't be miserable waiting around for him.\n\nAlso, there may be timeswhen you can help by letting him explain things to you. No problem if you don't understand. It's about talking it out. I used to explain things to my cat when I got stuck.",
      "author": "eleveneels",
      "created": 1630984876,
      "upvotes": 16,
      "replies": {}
    },
    "hbvlhuk": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbvlhuk/",
      "text": "As someone in a STEM PhD and dating someone is not. I would say that I am always very busy and everything I do need to be scheduled 2 weeks ahead so I can plan my experiments and why not  ahead of time. I don’t have much time, work crazy hours. If i am not working i am studying for my classes, preparing presentations. So, show sympathy when stuff doesn’t go right. Don’t get to personal when he doesn’t have time or just a little time to be with you. As someone mentioned in the comments, feed your grad student is the most kind act of compassion and caring.",
      "author": "Pitiful_March_469",
      "created": 1630977300,
      "upvotes": 3,
      "replies": {}
    },
    "hbvj5x7": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbvj5x7/",
      "text": "Time is his most valuable asset. Whenever he tells you he has to work overnight, trust him. \n\nBe there for him, try to listen to his PhD-ish stories; even if you don't understeand half of it, he actually needs to vent from time to time: A PhD third year is crazy; experiments, data analysis, papers, conferences, thesis, even some courses, and a LOT of reading. \n\nWish the best to both of you :)",
      "author": "roymustangsimp",
      "created": 1630976151,
      "upvotes": 22,
      "replies": {}
    },
    "hbveowa": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbveowa/",
      "text": "You seem like a nice person, best of luck! \n\nMy fiance is doing PhD, I don't do much for her though. Just be there if he needs to complain. \n\nWe are both from STEM fields\n, so I am able to understand her points and assist. Maybe try to understand what he does on a higher level?",
      "author": "Far_Brush_9347",
      "created": 1630973940,
      "upvotes": 10,
      "replies": {}
    },
    "hbveg1v": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbveg1v/",
      "text": "It's a lot more like having a job as a researcher than being a college student. Money and time will probably be tight. Otherwise, just talk to him about this stuff. Don't be upset if he only has limited time -- he's (probably) not avoiding you, it's just a lot of work and can be pretty high stress.",
      "author": "mediocre-spice",
      "created": 1630973817,
      "upvotes": 21,
      "replies": {}
    },
    "hbvcxb4": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbvcxb4/",
      "text": "Assuming it’s researched based because STEM: research is crazy! I literally take every day as it comes. I rarely know when I’ll be getting done in a given day, and have to play a lot of things by ear depending on how experiments go or equipment is operating. I also already know there will be a few all nighters in my future. All that to say, be flexible and understanding if they have to bail—it’s probably a very real reason. Have they taken their qualifying exam? Mine is this year so my stress is about to skyrocket and will have to layer in daily studying about 6 months out and probably lots of crying",
      "author": "hellyabruther",
      "created": 1630973059,
      "upvotes": 24,
      "replies": {
        "hbvdxrc": {
          "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbvdxrc/",
          "text": "I had no clue what qualifying exams are until I read yours and rns113's comment. I'm going to ask him about that the next time I see him! Good luck with your qualifying exam, you'll do great! What do you study?",
          "author": "lilyaintaG",
          "created": 1630973564,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hbv5hwf": {
      "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbv5hwf/",
      "text": "I'm speaking as a stem PhD student who's dating someone with a GED - just be there for your partner, feed them as often as you can, and make sympathetic noises when they complain.\n\nYou can always ask about the specifics of points in a program, but usually around 3rd year is comprehensive/qualifier exams, which are different depending on the program, but it's a stressful exam that lets you either stay in your program or get asked to leave. It generally means the end of taking classes as well, which means the rest of the program is less like school and more like a job.\n\nI think the only other thing is to respect that grad students don't really work a 9 to 5, so don't get mad if evenings/weekends are scheduled. But also, make sure to drag your grad student out of the lab sometimes for dates. They need it.",
      "author": "rns1113",
      "created": 1630969354,
      "upvotes": 117,
      "replies": {
        "hbvdsnj": {
          "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbvdsnj/",
          "text": "Oooh I might have to ask him what his favorite foods are and cook for him! I love cooking lol. Thank you for going into specifics, this helps me out a lot. I'll ask if there's any exams he has to take. I also understand that there isn't really a set schedule and that's the reality every single day. I'm trying to be understanding since I tried to think back to how things were when I was in grad school. Thanks for commenting, I appreciate it a ton!!",
          "author": "lilyaintaG",
          "created": 1630973491,
          "upvotes": 47,
          "replies": {
            "hbvejrj": {
              "link": "/r/GradSchool/comments/pjac1q/dating_a_phd_student_when_youre_not_in_school/hbvejrj/",
              "text": "Definitely cook for him! My partner hasn't worked in pandemic-times, and often had dinner waiting for me when I get home. I've never felt more loved. It helps that you were in grad school some, so you understand some of the lingo. But mostly, just be there for him to talk to, and distract him from the lab nonsense when you can.",
              "author": "rns1113",
              "created": 1630973869,
              "upvotes": 21,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634065058
}