{
  "sid": "9ljgmj",
  "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/",
  "title:": "(UPDATE) Starting a PhD thousands of miles away from your ill parent...",
  "text": "A year and some months ago, I wrote here seeking advice. This is the original post: [https://www.reddit.com/r/GradSchool/comments/6fahhf/starting\\_a\\_phd\\_thousands\\_of\\_miles\\_away\\_from\\_your/](https://www.reddit.com/r/GradSchool/comments/6fahhf/starting_a_phd_thousands_of_miles_away_from_your/)\n\nIn case someone else is in the same situation I was, I will let you know how it turned out. \n\nOne day in July 2017 or so, I felt I couldn't handle it anymore and I emailed my advisor from the E.R. while I was waiting to see what was going to happen with my mom, whom we had had to rush to the hospital for complications with her symptoms. I had read all the rules and was pretty sure, as you can see in my comments on the original thread, that deferring was not an option. However, my advisor told me I was going to defer my admission, and dealt with the Department and almost everything else for me. The Graduate School was incredibly nice to me, and told me not to worry; they would just send me an official letter I had to sign, and in the next round of admissions they would send me a new admissions package. My mom was very upset I didn't go off to school, but I got to spend her last six months of life with her. She passed away in December 2017.\n\nThe University delivered, and I'm currently in my second month of my PhD program. I didn't even have problems when I applied for my brand new visa even though I had to have the previous one cancelled. \n\nI'm now in the process of getting a therapist to deal with my grief. I'm not going to lie, studying while mourning your mother in a place where you don't really know anyone (I'm single again, because life really likes to challenge you during the hardest times) isn't easy. Insomnia is way too common. It is difficult to focus, and I know I'm always behind in my readings. But I have hope it will get better. \n\nThank you everyone for your support a year ago, it really helped me. I hope my story helps someone else, too.",
  "author": "dahliazuli",
  "created": 1538716497,
  "over_18": false,
  "upvotes": 341,
  "upvote_ratio": 0.98,
  "comments": {
    "e78se5d": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78se5d/",
      "text": "I'm sorry for your loss and just how difficult things have been. It's very heartening to hear that your advisor was willing to fight for you so you could defer for a year.  \n\nI'm dealing with a similar decision...my mom is all I have left in my family. (I'm an only child and it's been a very very bad decade and my small family is now mostly deceased). She's already had cancer ten years ago, and now she's just getting older and needing more help since she's prone to falling...meanwhile, I'm now 35, killed my career by being a caregiver for the past decade, so that I now need to go back to school to retrain, and wanting to go away to school. But how can I do that when I'm all she has?? ",
      "author": "inverseofblanche",
      "created": 1538780028,
      "upvotes": 2,
      "replies": {}
    },
    "e78b7xm": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78b7xm/",
      "text": "I am sorry for your loss. I would do the same as you did. \n\n&#x200B;",
      "author": "LifeWeekend",
      "created": 1538765066,
      "upvotes": 2,
      "replies": {
        "e78njv3": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78njv3/",
          "text": "Thank you.\n\nIt is weird because a lot of people really resisted the idea when I told them what the University was allowing me to do. People thought it was more important for me to go away than to be with her. For me, it really was a no brainer. I think I would have given up the opportunity if the deferral had not been possible (that is kind of what I had in mind when I finally emailed them, although I didn't say).\n\nI hope your PhD goes well, and thank you again for your words!",
          "author": "dahliazuli",
          "created": 1538775323,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e78a4rl": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78a4rl/",
      "text": "I don't know your mom but I feel like she would be very proud of you",
      "author": "DrLexaloo",
      "created": 1538764154,
      "upvotes": 3,
      "replies": {
        "e78ngv8": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78ngv8/",
          "text": "Thank you for your sweet words. I try to convince myself everyday that that is the case :)",
          "author": "dahliazuli",
          "created": 1538775244,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e7877at": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e7877at/",
      "text": ":'( I am so sad that such things happen, and I am very sorry you went through all that. I wish you all the strength and more. ",
      "author": "GreySkiesPinkShoes",
      "created": 1538761746,
      "upvotes": 2,
      "replies": {
        "e78n9p8": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78n9p8/",
          "text": "Thank you for your kind words. How are you doing with your PhD?",
          "author": "dahliazuli",
          "created": 1538775063,
          "upvotes": 2,
          "replies": {
            "e78pvef": {
              "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78pvef/",
              "text": ":) I am fine, thank you for asking. I'm sure we'll all emerge stronger from all this. Sometimes I feel PhD is a huge crash course in life. ",
              "author": "GreySkiesPinkShoes",
              "created": 1538777489,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "e783jkk": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e783jkk/",
      "text": "[deleted]",
      "author": null,
      "created": 1538758784,
      "upvotes": 3,
      "replies": {
        "e78nfv3": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78nfv3/",
          "text": "Thank you very much for your words. I have actually never attended any of my graduations precisely because she never wanted to travel to be there. When she was in the hospital, a few months before passing away, she expressed the wish to attend this one. It will definitely be hard. I hope I have my own family by then...\n\nI'm also a medievalist, by the way :) Although non-Western stuff... \n\nI hope you are doing well!",
          "author": "dahliazuli",
          "created": 1538775221,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e783044": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e783044/",
      "text": "Sending lots of love! Do you like to workout or do yoga! I really developed a love for both of those practices during in grad school! It helps to move the body!",
      "author": "NaimahBeeema",
      "created": 1538758338,
      "upvotes": 3,
      "replies": {
        "e78nlp5": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78nlp5/",
          "text": "You are so absolutely right--I love doing yoga, but I'm still finding it quite hard to do anything physical. I bought a yoga mat and have done a little bit here and there, but I am still far from mentally there. Baby steps :)\n\nThanks for commenting!",
          "author": "dahliazuli",
          "created": 1538775371,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e77xrwa": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77xrwa/",
      "text": "So sorry for your loss <3 my mother died this summer, between my 4th and 5th years of my PhD, and some days just getting out of bed feels like the biggest hurdle in the world, but we're gonna make it. Best of luck to you, and sending good thoughts your way.",
      "author": "Maiasaur",
      "created": 1538754052,
      "upvotes": 6,
      "replies": {
        "e78lc7z": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78lc7z/",
          "text": "I am so, so sorry to hear that. Are you ok? How long is your program, are you close to completion? (My program is 7 years). Sending you all my love!",
          "author": "dahliazuli",
          "created": 1538773301,
          "upvotes": 2,
          "replies": {
            "e7lhf0x": {
              "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e7lhf0x/",
              "text": "I'm probably going to do 5.5 years, maybe 6. I am sometimes okay, but sometimes not... and mostly that's okay, too. How are you? Still sending love, because this just isn't gonna be easy for us.",
              "author": "Maiasaur",
              "created": 1539290206,
              "upvotes": 2,
              "replies": {
                "e7s5pzl": {
                  "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e7s5pzl/",
                  "text": "I have been on a downward spiral lately. Luckily, I'm finally starting therapy on Tuesday. I hope that works. Sometimes I really don't think I'll last longer than a year here; the isolation is crazy, and trying to do social things makes me struggle even more than I already do with my coursework. Sigh. I really hope it will get better.",
                  "author": "dahliazuli",
                  "created": 1539565944,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e77vyio": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77vyio/",
      "text": "What a great story! Keep on keepin' on and the universe will reward you! ",
      "author": "mamu5304",
      "created": 1538752557,
      "upvotes": 3,
      "replies": {
        "e78lu11": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78lu11/",
          "text": "Thank you!! Will do! :)",
          "author": "dahliazuli",
          "created": 1538773739,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e77uqyc": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77uqyc/",
      "text": "I'm really sorry for your loss. My father died half way through my PhD, we were very close. It's hard working through the grief, and there were days where I'd just stare at my PC, and not achieve anything at all. Above all, you have to remember to be kind to yourself. It is possible to succeed, despite it all. Good luck.",
      "author": "mfra2",
      "created": 1538751546,
      "upvotes": 6,
      "replies": {
        "e78ltd2": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78ltd2/",
          "text": "That is exactly what I am going through. Or I read a paragraph a thousand times and I almost don't even notice there are any words there. It all becomes a massive blank thing.\n\nDid you eventually get better, how are you now? I really hope you did. Thank you so much for your comment.",
          "author": "dahliazuli",
          "created": 1538773722,
          "upvotes": 2,
          "replies": {
            "e78mhxx": {
              "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78mhxx/",
              "text": "Yeah, you have to just be patient with yourself. It does get better, and you get into more of a routine. It's been almost three years now for me and I'm mostly okay, thanks. I still have my off days though - it's a long process, definitely a marathon, and not a sprint.",
              "author": "mfra2",
              "created": 1538774342,
              "upvotes": 2,
              "replies": {
                "e78npvx": {
                  "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78npvx/",
                  "text": "I'm glad to hear you are doing better. It definitely isn't easy. Did you also find that people expected you to be fine, or over it, extremely quickly? A former friend of mine said to another friend, just 3 months after she passed away, that \"I should get over it already\". People behaving like this have made it quite difficult--no need for the marathon to have obstacles, right?",
                  "author": "dahliazuli",
                  "created": 1538775479,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e77sgkb": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77sgkb/",
      "text": "So sorry for your loss! Wishing you all the best in your program. I'm so glad that your program and school were supportive to you last year and that you got to spend that precious time with your mom. I'm sure this year will be challenging for you in lots of ways, but it sounds like you've got your ducks in a row (hella supportive supervisor, therapy, etc.). Take care!",
      "author": "sexresearchiscool",
      "created": 1538749646,
      "upvotes": 4,
      "replies": {
        "e78lplh": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78lplh/",
          "text": "Thank you! It is also quite refreshing and helpful to read my situation in someone else's words, and noticing how positive it sounds despite the loss. I appreciate it!",
          "author": "dahliazuli",
          "created": 1538773628,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e77pd21": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77pd21/",
      "text": "Sorry for your loss. You’re doing everything right. Congratulations with your new academic journey. Our loved ones are the ones on our minds those rough nights of writing, who make the work worthwhile. ",
      "author": "studyhardbree",
      "created": 1538746878,
      "upvotes": 6,
      "replies": {
        "e78la2g": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78la2g/",
          "text": "You're absolutely right, thank you. My mom had wanted to pursue a PhD herself and she ended up choosing marriage and kids when it was quite impossible for her to choose both. How far are you in your program?",
          "author": "dahliazuli",
          "created": 1538773248,
          "upvotes": 2,
          "replies": {
            "e7ayn9m": {
              "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e7ayn9m/",
              "text": "Second year masters. Still debating about PhD but we will see!",
              "author": "studyhardbree",
              "created": 1538871599,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "e77omtc": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77omtc/",
      "text": "I'm so sorry for your loss but I bet she is immensely proud of you no matter what :-)\n\nCongratulations for getting through one of the roughest years of (any)one's life! I wish you the best of luck!",
      "author": "Ce-lavi",
      "created": 1538746171,
      "upvotes": 3,
      "replies": {
        "e78lnti": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78lnti/",
          "text": "That's a really sweet comment, thank you so much!\n\nIt is indeed a really hard time to get through. I wish it had made me wiser, equipping me with some wisdom to share with those who experience the same thing. But honestly, I don't think so. I just think of how I hated being asked about it, as much as not being asked about it, and I freeze. Tough times indeed.",
          "author": "dahliazuli",
          "created": 1538773585,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e77jp1v": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77jp1v/",
      "text": "I'm glad things worked out ok for you academically. Sorry for your loss.",
      "author": "unique0130",
      "created": 1538740395,
      "upvotes": 4,
      "replies": {
        "e78l5re": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78l5re/",
          "text": "Thank you! I hope I can continue working hard. I'm always concerned I won't perform well enough, so today I actually talked to the DGS about it. He thinks I'm doing well, so I'm going to hold onto that!",
          "author": "dahliazuli",
          "created": 1538773144,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e77etp3": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77etp3/",
      "text": "I’m so sorry for your loss and wish you all the best in your PhD program. ",
      "author": "trivenefica",
      "created": 1538731427,
      "upvotes": 15,
      "replies": {
        "e78l3jc": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78l3jc/",
          "text": "Thank you very much!",
          "author": "dahliazuli",
          "created": 1538773088,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e77bhah": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77bhah/",
      "text": "I'm so simultaneously happy for you that your advisor had your back and that the school worked with you to make it work, and that you got to be with your mom and then to go to your dream program AND so unbelievably sorry that you've lost your mother.  I can't imagine how difficult it must be to study and be alone in a new city while processing your grief.  I truly hope things start getting  little easier and life stops sending you so much insanity . Congratulations for getting to where you are now ",
      "author": "firinne83",
      "created": 1538724016,
      "upvotes": 41,
      "replies": {
        "e78l322": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78l322/",
          "text": "Thank you, I do understand the conflicting feelings that this situation cause. I try to emphasize that happiness, and I have to say that the way they supported me made me believe I had made the right choice when I accepted their offer. Really, thank you <3",
          "author": "dahliazuli",
          "created": 1538773077,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e778a1c": {
      "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e778a1c/",
      "text": "Lots of affection and warmth for you. I hope this space becomes the meaningful place you need it to be.",
      "author": "chaitalis",
      "created": 1538718310,
      "upvotes": 71,
      "replies": {
        "e78l03y": {
          "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78l03y/",
          "text": "Thank you for your kind words, I really appreciate them.",
          "author": "dahliazuli",
          "created": 1538773005,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064527
}