{
  "sid": "qu2d65",
  "link": "/r/GradSchool/comments/qu2d65/how_to_overcome_the_feeling_that_youve_met_your/",
  "title:": "How to overcome the feeling that you've \"met your match\" in your program?",
  "text": "I'm referring to the idea that you've finally found a subject that is just beyond your ability to be successful at it.\n\nI think that's what I found in my theory of statistics class. I had a major exam a week ago and spent my birthday studying for it. I was so nervous during the exam, I could barely hold my pencil to write, and honestly I thought I did okay on it. But I got my score back today, and nope, bad score, below the class average, and just feeling clueless as to how I can improve (scored 67/100 and the average was 72). I spent as much time as I could studying for this exam, even reviewed it with my classmate /studied with him to make sure I wasn't missing any big stuff. I'm just really freaked out now to see that even when I thought I did well, I definitely didn't.\n\nLast exam I got 73/100 where the class average was 62, so I felt like I must be doing OKAY, but somehow I walked out of this exam feeling significantly better but then somehow did worse, AND I was below the class average too. Like what the fuck is going wrong here?\n\nI'm just really at a loss at this point. All I've got left is a few homework assignments and then the final, and then the rest is left to the fate of the universe, I guess.\n\nIt's going to be incredibly discouraging if I start my program with a C. I still have a year and a half left (I'm studying Biostatistics) and I don't want to be fighting from behind the whole time. My classes are only going to get HARDER so I really can't expect my GPA to improve. If I do this whole thing and end with a shit GPA, I won't even get a job, so what will the point of all of this have been?\n\nI just really need a hug lol. My cousin got married yesterday and my interactions with my family just made me feel like I'm still a total fucking mess where my younger cousin is just set for life now. I just want to know I actually have a future.",
  "author": "IYELLALLTHETIME",
  "created": 1636932311,
  "updated": 1637182714,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hknw65h": {
      "link": "/r/GradSchool/comments/qu2d65/how_to_overcome_the_feeling_that_youve_met_your/hknw65h/",
      "text": "Couple things here my guy. The first week of grad school we had to take 4 “proficiency exams”. All 5 of the people from the friend group I formed passed all of them. Guessed who was the only one who failed 3 of them. That’s right. Me. Felt like crap. Next come the classes. Feels like I always get a lower score than my friends. Almost always below or at the average, rarely ever did I get above average. I felt like I was giving it my all just to keep getting mediocre results. Fast forward to my third year, my research is working, I’m significantly more confident in my abilities, I’m become a better presenter and I am understanding more about my subject than I ever thought I would. It’s called graduate SCHOOL for a reason. You’re there to learn, you’re not supposed to go in knowing everything even though it feels like your peers know everything already. I promise you, it’s normal. You have not “met your match”, you’re just currently intermediate at the subject and the topics you’re learning are advanced. But that’s the only way to become an advanced professional at what you study. Push though and you will see a tipping point. That’s a guarantee from personal experience. Good luck",
      "author": "T-bewlee",
      "created": 1636938890,
      "upvotes": 10,
      "replies": {
        "hko1peb": {
          "link": "/r/GradSchool/comments/qu2d65/how_to_overcome_the_feeling_that_youve_met_your/hko1peb/",
          "text": "Thank you for this. I guess I just need to hang in there",
          "author": "IYELLALLTHETIME",
          "created": 1636941439,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkoh6dy": {
      "link": "/r/GradSchool/comments/qu2d65/how_to_overcome_the_feeling_that_youve_met_your/hkoh6dy/",
      "text": "By definition, half of every class of students gets grades below the median. That doesn't mean half of the class is a failure; some people succeed better in some places than others. As long as you're passing and progressing according to your program's requirements, you have not yet met your match. You are simply taking one of your harder classes.",
      "author": "exurl",
      "created": 1636948751,
      "upvotes": 7,
      "replies": {}
    },
    "hkq4ykt": {
      "link": "/r/GradSchool/comments/qu2d65/how_to_overcome_the_feeling_that_youve_met_your/hkq4ykt/",
      "text": "5 percentage points below the average is not catastrophic, and if last time you were 11 points above, on average you're doing better than the class average. How this affects your final grade depends on if exams are curved.\n\nWhy not go to the prof to discuss your progress? They can give you perspective, tell you if you should be worried or if this is normal performance. Plus, then you'll have built some relationship with the prof, and you'll need all the good relationships you can get as you go through this marathon.",
      "author": "pb-pretzels",
      "created": 1636988376,
      "upvotes": 2,
      "replies": {}
    },
    "hkqpb9u": {
      "link": "/r/GradSchool/comments/qu2d65/how_to_overcome_the_feeling_that_youve_met_your/hkqpb9u/",
      "text": "I spent a shit ton on tutoring. I studied for like 40 hours the week before my midterm. Tutoring helped me pass and I got a hard fought for B. My grade may have been worse if it wasn't for the homework graded by his TA.",
      "author": "schillerstone",
      "created": 1636996805,
      "upvotes": 2,
      "replies": {}
    },
    "hkojtzp": {
      "link": "/r/GradSchool/comments/qu2d65/how_to_overcome_the_feeling_that_youve_met_your/hkojtzp/",
      "text": "Remember that average is just that, an average. That means that (barring significant skew) half the class did worse than the average. Remember the statistical principal of regression to the mean: you had a bad day. That doesn’t mean your mean is low, it means you had a bad day. You could easily have an average 10 points higher than the mean of the class but that doesn’t mean you will always score above the mean.",
      "author": "hiagha",
      "created": 1636950139,
      "upvotes": 1,
      "replies": {}
    }
  }
}