{"sid": "n1grlf", "link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/", "title:": "Using a daily planner/journal changed my PhD life", "text": "Recently I decided to get a journal/planner to write down my day to day task lists and reminders. Initially I was a bit skeptical about the idea but it ended up booking my productivity because I have records of all the things I need to do and it boosts my morale on days I'm not feeling very productive. \n\nAll on all I highly recommend getting a daily planner to organise your work.", "author": "Weekend_metalhead", "created": 1619737581, "retrieved": 1632845926, "over_18": false, "upvotes": 355, "upvote_ratio": 0.99, "comments": {"gwz83k0": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwz83k0/", "text": "I credit the bullet journal I started right before everything shut down in March 2020 (US) with helping me do literally any work at all during this pandemic while teaching and working from home. The weekly, monthly, and longterm goals helped me think differently.", "author": "CarrotGratin", "created": 1620180148, "upvotes": 1}, "gwh9u1k": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwh9u1k/", "text": "So a technique I do is every morning, I plan out my day to the hour. For example, 11-12 I do this class homework, 12-1 I catch up on lecture notes for this class, 1-2 I read my textbook on this class, etc. It takes 3 minutes and it helps a lot with procrastination. If you procrastinate, you essentially have this metric telling you how much you're procrastinating. I will realize that I took an hour reading a 3-paged document, when I could've read it in 15 mins if I hadn't been procrastinating.", "author": null, "created": 1619822356, "upvotes": 1}, "gwg6z6o": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwg6z6o/", "text": "This might sound like a little much but I make my own. I design the cover, the pages, buy the binding and pay for the print job. The same for notebooks, etc. it’s a fun crafting project but it also ensures that I’m really invested in using it. Plus it’s everything I want in a journal/planner/notebook and fits my unique work style.", "author": "Neon_Black_0229", "created": 1619804278, "upvotes": 2}, "gwfkai1": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwfkai1/", "text": "It’s also important to realize which organizational style works best for your brain. I personally benefit from vertical-oriented planners because they are more apt for listing tasks and appointments. Horizontal planners never have enough space for that. \n\nI’ve had luck with Bloom (Amazon, $20) and Silk and Sonder (mixes mental health challenges with planning, $12/mo, subscription). \n\nI use Bloom for work/teaching/school and Silk + Sonder for personal, home, and social.", "author": "elvra", "created": 1619794610, "upvotes": 1}, "gweeach": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gweeach/", "text": "I've started using Trello to create to do boards. It's super visual and it is easier for me than my handwritten daily to-do lists. I still keep a day to day list of events and then my online tracker is for work to complete.", "author": "ncherry17", "created": 1619768415, "upvotes": 1}, "gwecdzj": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwecdzj/", "text": "i tried apps and planners forever but always gave up on them because they dont fit the way my brain works. if this is you, read  or listen to the book atomic habits and look into bullet journaling. changed my whole game.", "author": "antiphonic", "created": 1619766738, "upvotes": 1}, "gwea6d2": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwea6d2/", "text": "I use evernote. Not exactly a daily planner but jotting down things I do everyday helps me keep track of the changes I've made. Sometimes when I feel like the month went by fast, I just look back at my notes.", "author": "givemeyourdonut", "created": 1619764859, "upvotes": 1}, "gwea25a": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwea25a/", "text": "Notion for the win!", "author": "revolutionPanda", "created": 1619764765, "upvotes": 1}, "gwe7bb4": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwe7bb4/", "text": "I do this too but with one note, really helps with productivity, and I can search old notes", "author": "darquirius", "created": 1619762583, "upvotes": 1}, "gwe40xb": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwe40xb/", "text": "I really enjoy online notebooks, especially during covid times, and recently started using Evernote. I was previously using OneNote but found the syncing function faulty. I write out my daily tasks and meetings (including zoom info) and any other useful info. I have the app on my phone so I can add things to my list or check things off as they happen. It has definitely kept me on track during my PhD and has been super convenient to have all my records readily available.", "author": "regulardegularr", "created": 1619760054, "upvotes": 1}, "gwe2f53": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwe2f53/", "text": "One of the other PhDs of my prof started a weekly meeting (with 4 PhDs in total) where we talk about what we accomplished last week and what we plan to do in the upcoming week, we keep track of all of this in a google doc table. This is incredibly helpful in organizing my workflow and aside from that also a really good way to socialize in home office times. I could not imagine my work life without this group anymore, and I can highly recommend setting up something like this with your co-PhDs if you can.", "author": "WeirdLime", "created": 1619758886, "upvotes": 1}, "gwe1s2k": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwe1s2k/", "text": "Something which personally helps me a lot is not only write down my daily tasks, but at the end of the day, also reread it and evaluate (Did I finish everything? Great! Did I not? Maybe I overplanned, or maybe something unexpected happened that needed to be prioritized.) This helps me to plan my time more effectively and actually see how much I can get done in a day. I also try to write down the activities I would like to do the following day right after, so it is still fresh in my mind and I don’t forget to continue it the next day. It also helps me get it off my mind when I get home from the lab in the evening, because I know I won’t forget anything important.", "author": "snowwaterflower", "created": 1619758422, "upvotes": 2}, "gwe1cgj": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwe1cgj/", "text": "I spend most of my time coding; and I have found that just using Google docs with daily headers does the trick.  It serves my needs copy / pasting code / figures / links, taking notes, tracking TODOs and venting my frustration.  And I can Ctrl-Find commands that I wrote down months ago.\n\nAlthough, it is clunky as shit - I'm only 4 months into this years notebook and I'm already spilling well over 100 pages.  So if someone has a better note-taking system, I'm all ears.", "author": "todeedee", "created": 1619758123, "upvotes": 2}, "gwdzh8f": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdzh8f/", "text": "I do this in my lab notebook, make a list of all the general research tasks I have to do and the tasks I want to do daily. And then when I do stuff I take notes about it since it’s my lab notebook haha. It helps feeling like I’m building up to the larger goals.", "author": "medusawakened5", "created": 1619756869, "upvotes": 4}, "gwdxbyl": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdxbyl/", "text": "I would be so lost without a planner! I reccomend passion planner. The bound paper version is pricey, but they have a downloadable version free on their website to print out so you can see if you like it.", "author": "walruswallaroo", "created": 1619755519, "upvotes": 3}, "gwdwuoz": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdwuoz/", "text": "I couldn't agree with this more; the one semester I really felt on top of my academics was when I bought a planner *and actually used it.* I had a planner with a weekly spread of daily schedule broken down by the hour, so that I could color in the hours that I had classes or mandatory appointments. For those of you in the market, and with money to spend, I really recommend Agendio: it's upwards of $60 but you can customize almost every aspect of it. It was WELL worth it to me; I saved up for it. Not only do they have the hourly spreads for the whole week, but they also allow you to insert spare pages, which I used to insert grid pages at the beginning of each month and create habit trackers for the month. You can swap out almost everything, and really customize it to what you will remember to check the most, and where you anticipate you'll be writing info down. For example, if you prefer to write your responsibilities each day instead of making a schedule every day like mine, you can swap out the boxes so that they're empty spaces. If you work a 9-5, you can use a 8am-6pm layout, but if you have stuff to remember at 7 am and midnight, you can find an 18-hour layout. It's really incredible.", "author": "king_kingcharles", "created": 1619755239, "upvotes": 1}, "gwdwnk9": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdwnk9/", "text": "For me bullet journaling works because of how customizable it is, i found my simple style and have been using it for almost a year!", "author": "Toomanyhobbies1", "created": 1619755121, "upvotes": 2}, "gwdrwwr": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdrwwr/", "text": "If you want an app for this o have used ToDoist to plan my work and it has been incredibly helpful.", "author": "Wu-Tang_Hoplite", "created": 1619752500, "upvotes": 1}, "gwdp91x": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdp91x/", "text": "I just discovered Evernote. I have never used handwritten journals, so I am hoping that this online journal will be great.\n\nPlus, I think storing my class info & class notes virtually will be super helpful. It's not exactly a journal, but I think that it could serve the same purpose.", "author": "sweatyshambler", "created": 1619751100, "upvotes": 6}, "gwdnbn8": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdnbn8/", "text": "I actually do this in Google Docs", "author": "gtgrad93", "created": 1619750142, "upvotes": 1}, "gwdjg52": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdjg52/", "text": "My planner is my life blood!! Highly recommend the weekly planner by Papier, worth the extra coin for the quality", "author": "namewastaken11", "created": 1619748307, "upvotes": 2}, "gwdcsye": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdcsye/", "text": "I just started using a panda planner again this week. After taking a year off from academia, I fell out of the planner habit. I think especially with my adhd, planners are a must. \n\nPS: on a related note, I have a huge stack of disorganized papers as the first year of my PhD comes to a close... my lack of having systems for things is literally so frustrating.", "author": "gemmae61", "created": 1619745276, "upvotes": 13}, "gwdcg9d": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdcg9d/", "text": "A really big discovery for me during PhD - having a task list where things disappear tetris-style is not enough! \n\nHaving a record of what you GOT DONE everyday is so so important, both for advising meetings but also personal mental health. It helps a lot.", "author": "coupz", "created": 1619745112, "upvotes": 116}, "gwdb2j4": {"link": "/r/GradSchool/comments/n1grlf/using_a_daily_plannerjournal_changed_my_phd_life/gwdb2j4/", "text": "Can you describe how you use it? I've been trying to get into using a planner but fail every time :/", "author": "WeightedAnchor", "created": 1619744438, "upvotes": 68}}}