{
  "sid": "qfhwxi",
  "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/",
  "title:": "Supervisor only wants to meet two or three times in whole academic year.",
  "text": "Is this normal? My supervisor has told me she can meet two or three times for the entire academic year. I'm an MSc student in Applied Psychology doing a one year taught post-graduate MSc. I'm hesitant to send her emails because I don't want to \"overload\" her with questions about stuff.",
  "author": "VoidingTorment1998",
  "created": 1635172003,
  "updated": 1635185308,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 1.0,
  "comments": {
    "hhzo8zy": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hhzo8zy/",
      "text": "The only cases where anything near that would happen at my uni would be if you have a post doc who's doing the week to week supervision. \n\nThat said, what's the role of your supervisor for a taught MSc, is there a research component she's meant to guide you in or what? Do you know anyone else on your course to get a feel for what's normal for your particular course? I talk to my supervisor at least twice a week but we're running a lab together so it's likely very different!",
      "author": "ADPhD-hi",
      "created": 1635173100,
      "upvotes": 31,
      "replies": {}
    },
    "hhztlp3": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hhztlp3/",
      "text": "It depends. Are you doing research under this person? Then you are essentially their employee and yes, that’s very weird.\n\nIf your program is heavily classes focused with little outside work, then I don’t see that as strange. In this case, they’re more of an academic advisor.",
      "author": "banamana27",
      "created": 1635175414,
      "upvotes": 13,
      "replies": {
        "hi0emp4": {
          "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hi0emp4/",
          "text": "OP writes that it's a taught master's. To me, this sounds very much like they have an academic advisor, not a (research) supervisor, where meeting a few times throughout the year would be the norm. \n\nMost of the comments here are completely glossing over this aspect, probably because Americans aren't familiar with taught master's programmes.",
          "author": "simoncolumbus",
          "created": 1635184053,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhzm4uf": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hhzm4uf/",
      "text": "Find a new supervisor",
      "author": "yogaccounter",
      "created": 1635172174,
      "upvotes": 53,
      "replies": {}
    },
    "hhzqsjf": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hhzqsjf/",
      "text": "I meet with my adviser once a week. There have been periods of time where we haven't checked in in months, but that was due to there being nothing major going on (e.g. preparing for prelims) where I didn't have significant progress to update them on. When my adviser was on sabbatical, we still met regularly. \n\nI'm not sure what your program is like specifically and maybe this is normal, but it would be unheard of in my program. Even our department chair, who is an internationally known scholar who travels frequently, meets with their advisees multiple times a semester.",
      "author": "False-Guess",
      "created": 1635174199,
      "upvotes": 15,
      "replies": {}
    },
    "hi02u3g": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hi02u3g/",
      "text": "Red flag, huge red flag🚩",
      "author": "Icy_stars",
      "created": 1635179205,
      "upvotes": 8,
      "replies": {}
    },
    "hhzyhn6": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hhzyhn6/",
      "text": "Grads meet with advisors weekly in my program, which includes both MS and PhDs (both thesis-based). This was the case where I did my MS as well. What you describe would not be acceptable in my experience.",
      "author": "rox_et_al",
      "created": 1635177437,
      "upvotes": 2,
      "replies": {
        "hi016k2": {
          "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hi016k2/",
          "text": "I meet weekly for my thesis based MSc.",
          "author": "UleeBunny",
          "created": 1635178538,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhzs2fd": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hhzs2fd/",
      "text": "Did she specify why? I would report this to your course leader and/or director and express your concerns.",
      "author": "dalia666",
      "created": 1635174753,
      "upvotes": 2,
      "replies": {}
    },
    "hi04l0p": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hi04l0p/",
      "text": "My supervisor and I have changed frequency of our meetings based on my needs at the time. During times when things were quite straightforward, we would meet once every few months (with regular lab meetings where I saw her), and during times when I was completing my thesis or major projects, we would meet more often based on my needs.\n\nHow was the initial meeting with the supervisor? If you two seemed to get along quite well, I would just send an email letting her know you might need more guidance and ask if it is okay to request a meeting whenever you felt like you needed direction. If she seemed distant and unsupportive, then perhaps you'll need to reach out to an advisor for assistance.",
      "author": "the_sleepy_student",
      "created": 1635179940,
      "upvotes": 1,
      "replies": {}
    },
    "hi08n62": {
      "link": "/r/GradSchool/comments/qfhwxi/supervisor_only_wants_to_meet_two_or_three_times/hi08n62/",
      "text": "It seems to be different everywhere based on these comments. I met with my supervisor once a semester when I was in grad school five years ago. And even then, many of those meetings were us just shooting the shit about my topic and not doing specific work on my project.",
      "author": "Jurgioslakiv",
      "created": 1635181604,
      "upvotes": 1,
      "replies": {}
    }
  }
}