{"sid": "kwmjst", "link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/", "title:": "UPDATE: I told my PI I’m mastering out. It went well!", "text": "Sorry to add to the flurry of “quitting PhD” posts, but I wanted to give a quick update. I posted a few days ago asking for advice about how to tell my difficult PI that I’m leaving with a masters. Well, I did it this morning, and it went MUCH better than expected!\n\nI was ready for side eyes, pursed lips, and clenched fists. But, when I first told her, her response was more along the lines of “I’m sorry, that sounds like it was difficult decision. I want you to do what’s best for you. Let’s figure out what’s next.” \n\nMy PI has a tendency to be very hot and cold—if you tell her something mildly annoying on a bad day, be prepared...so I think I caught her on a good day, haha. We still have some things to discuss (how much work I have left to do, exact end date, etc) but this first meeting made me feel like it will be a smooth process rather than fraught with hurt feelings.\n\nI will also say: I would never have had the courage to do this if not for the wonderful therapy I received last semester. If I didn’t learn to be more confident and willing to stand up for myself and what is best for me, rather than just doing what is expected, I would have continued and been miserable for absolutely no reason for at least another three years. \n\nI’m so happy and relieved!", "author": "lauriceman", "created": 1610562450, "retrieved": 1632845759, "over_18": false, "upvotes": 453, "upvote_ratio": 0.99, "comments": {"gxtyy1f": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gxtyy1f/", "text": "A wonderful decision but how is your salary, if you don't mind sharing? Are there any difference between yours and a PhD assuming both starting jobs fresh straight out of the school?", "author": "Fox13_IR", "created": 1620808786, "upvotes": 1}, "gj8mq9x": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gj8mq9x/", "text": "I'm so happy it went well for you. Can I ask how long you were in your PhD program? Do you know approximately how much time you'll have left? I'm just over 2 years into a 4 year PhD and considering mastering out - but I haven't gotten any research done in the last year due to covid so I'd have to work for another year so I'd be getting a masters after 3 years instead of the usual 2 if I take that option.", "author": "Spenceyfox", "created": 1610640450, "upvotes": 1}, "gj74yxn": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gj74yxn/", "text": "Congrats! I just made the same decision and my conversation went over really well with my PI when I told him, and we left things on good terms. I started a new job today! There is indeed life after grad school. Good for you doing what is right for you!", "author": "elena_alien", "created": 1610600288, "upvotes": 2}, "gj61gw1": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gj61gw1/", "text": "What does mastering out and PI mean?", "author": "Chem_Whale2021", "created": 1610579240, "upvotes": 9}, "gj5mb87": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gj5mb87/", "text": "I'm grateful that I learned about this community to learn more about this concept. I only knew about PhDs before but am now focusing on just a Master's degree and then see if I want to continue on to a PhD rather than find myself doing the reverse.", "author": "jeredendonnar", "created": 1610572467, "upvotes": 2}, "gj5j96i": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gj5j96i/", "text": "I have specifically started a dual MA in MLIs, which only adds a year to my program and gives me the option of having a career without pursuing a Ph.D. if I don't want to at that point!", "author": "Naxek", "created": 1610571103, "upvotes": 3}, "gj5fr8i": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gj5fr8i/", "text": "Good luck! I hope the process goes smoothly", "author": "FiammaDiAgnesi", "created": 1610569537, "upvotes": 6}, "gj4zrlf": {"link": "/r/GradSchool/comments/kwmjst/update_i_told_my_pi_im_mastering_out_it_went_well/gj4zrlf/", "text": "Now, to update my flair...", "author": "lauriceman", "created": 1610562466, "upvotes": 125}}}