{
  "sid": "pyrf11",
  "link": "/r/GradSchool/comments/pyrf11/help_needed_in_choosing_a_phd_advisor/",
  "title:": "Help needed in choosing a PhD advisor",
  "text": "Hello! \n\nI'm a PhD student(duh!) In a stem field(like math-physics) who is at the stage of choosing advisor. \n\nNow I have basically two options. Let's call them A and B. \nBoth are young. \nA:  has had more students working with her in the past, almost every got a decent job. A few really good. Has more name than B in her particular area of expertise. Two of my cohort have already joined her(and no one else is with her currently) so might get comparative/competitive there. Could be described as 'somewhat' hands-off. Not totally though. Has reputation of 'really' working their students hard. Also has published papers with her students (which kinda tells me that maybe not that hands-off, especially at the later stages of PhD?). Also chill to talk to, but a current student described her as 'she only says necessary things in meetings, doesn't chit chat much.' I don't know maybe this could change with time as a student spends more time with her  in their PhD journey? \n\nB: hasn't graduated a student yet(as younger than A), currently has 3 students(1 from my cohort). So might get competitive there when applying for jobs/other things. His research is also good, and I felt that I'm more comfortable with the topics his research involves as compared to A's, whose research involves a lot of new terms/topics that I haven't seen in my past studies. \nAlso great to talk to. Seems a great person, in general in my experience with him. Also current students are happy with him, his organized approach to everything. \n\nMy confusion- I'm not sure which person I should choose as my advisor? A is clearly more established and great track record with her students so I'm more inclined to go with her. As for other graduate students, tbh, I really talk to 1 senior grad students that B has and no one in my own cohort seems friendly or helpful enough. But then, PhD is a sorta lonely journey anyway,can rely only so much on others. So I'm not taking 'what other students A and B have' in consideration. \n\nBut yes, overall, I'll appreciate if any of you have any suggestions/advices to offer to someone like me. I will highly appreciate them. \nThank you so much.",
  "author": "notinverse",
  "created": 1633031439,
  "updated": 1634100304,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hew6kfa": {
      "link": "/r/GradSchool/comments/pyrf11/help_needed_in_choosing_a_phd_advisor/hew6kfa/",
      "text": "It is probably a good time to sit down and think about what your life values and what is most important for you. Then pick the advisor that seems the most compatible with your ordered list. \n\nI personally value advisors being good people more than their publish history. Some people publish less because they put a lot more time into othere things, like being good mentors. There are perks and downsides to new PIs and established ones as you have mentioned. You could also consider being coadvised if you like both a lot.\n\nTalk to their students and ask them questions like: Who sets deadlines? What is their reaction when students don’t meet a deadline? Can you describe a lab meeting? What does the PI pay most attention to or how do they pick topics? How do they give feedback?  Does the PI seem to have a work/life balance? These are questions that can give you a lot of information. But you should curtail questions to get more information on what is important for you.\n\nCheers!\nEdit: typos lots of em",
      "author": "Coefficient_of_Var",
      "created": 1633033591,
      "upvotes": 5,
      "replies": {
        "hexnxfg": {
          "link": "/r/GradSchool/comments/pyrf11/help_needed_in_choosing_a_phd_advisor/hexnxfg/",
          "text": "I wish I knew that! \n\nTbh, in that aspect both seem fine to me. \nI'd prefer a friendly advisor but that will be of no use to me if they are not able to place me somewhere. \n\nAnyway, do you think that who else other than you is a student of that professor should matter?(just seeking different opinions). And if a professor is saying something like, 'theres no guarantee that you'll be able to get a job, so that's a risk.' should matter?(I feel they re just being honest, which is good?)",
          "author": "notinverse",
          "created": 1633059028,
          "upvotes": 1,
          "replies": {
            "hey3m7h": {
              "link": "/r/GradSchool/comments/pyrf11/help_needed_in_choosing_a_phd_advisor/hey3m7h/",
              "text": "I’m unsure of your field, but in my field advisors don’t really ever guarantee jobs. A good advisor will help you build the skill set you need to achieve the job you want. But that also depends very much on you. You could have a stellar advisor and not get anywhere. Some people have terrible advisors and still graduate and get good jobs. Right now your job is to figure out how you want your PhD experience to be.",
              "author": "Coefficient_of_Var",
              "created": 1633069545,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hexnz1z": {
          "link": "/r/GradSchool/comments/pyrf11/help_needed_in_choosing_a_phd_advisor/hexnz1z/",
          "text": "Thank you for your reply!",
          "author": "notinverse",
          "created": 1633059053,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}