{"sid": "n9jrbp", "link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/", "title:": "I don’t fit in with my cohort", "text": "I’m a first year grad student in a small MA program. My cohort is me and 4 others; we get along fine enough professionally and during class, but I’m definitely the odd man out when it comes to our social life. I am the only one not in the group chat (which I found out existed when they all laughed at an inside joke that I wasn’t in on, being told that “it was just a group chat thing”). I am never invited to hang out and just today I found out that the cohort is having an end of semester party that I wasn’t invited to either. I’ve never been openly hostile towards any of them and have expressed that I’d like to hang out with the group more. Should I just shrug it off and just try and hang out with my old friends from before grad school?", "author": "bwy97754", "created": 1620690830, "retrieved": 1632954374, "over_18": false, "upvotes": 308, "upvote_ratio": 0.99, "comments": {"gxr4fp7": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxr4fp7/", "text": "It is shitty that you’re being left out of such a small group. Does everyone else work closer physically? \n\nMy cohort is quite large, an includes students from three institutions so we mostly keep to our research groups. Maybe you’ll find better common ground with lab members - my social life is pretty much comprised of other grad students, post docs and techs that I work with.", "author": "sanctymc", "created": 1620754394, "upvotes": 1}, "gxqx7sn": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqx7sn/", "text": "Man I feel you. My cohort is about 15 kids in Microbiology and Immunology, and I was part of a much larger cohort during my first year before we all went into varying departments...I def feel like an odd one out. Tried hard to make friends, be sociable, but nothing clicked much with anyone. Still trying to navigate this situation and looking for friends outside the program but that is also equally as hard. I'm wondering if it really is okay to continue a phd with out any friends and if the next 2 to 3 years of life are worth it. Social networks during hard times, especially any grad school degree, is so important.", "author": "mishandle123", "created": 1620751437, "upvotes": 2}, "gxqs1wr": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqs1wr/", "text": "Hey, I just wanted to say that I also got left behind by my cohort of 6 (including myself, four of us pursuing the same MA, the others pursuing related MA/PhD). My cohort had a group chat and I didn’t even know about it until the end of the first semester, even though the person who made it had my number. My guess is they still use the one without me primarily, but it’s whatever. A couple people have literally stood right in front of me making plans for after class, not in an invitation way but in a “we don’t care if you overhear because we just don’t” kind of way.\n\nMy solution has been being civil with my cohort, staying in touch with friends from undergrad, and making friends with the people in other cohorts! It’s worked well for me. I’m not as close to the people in the other cohorts as they are to each other, but it’s better than just sitting around and feeling left out!", "author": "smolderbyboi", "created": 1620749277, "upvotes": 1}, "gxqr8gw": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqr8gw/", "text": "First off, sorry, that blows. What are the different demos? Like ate the only guy or girl? Did they come into the cohort together knowing each other.", "author": "MARXnLENNON", "created": 1620748935, "upvotes": 1}, "gxqps39": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqps39/", "text": "I will say in my masters cohort I brought everyone together. I included everyone by making a chat and organized study sessions and social events at my house etc. we were all the same age. It was good until 2 of them started dating and it ended poorly. Fracturing the group. People took sides I refused so I hung out with both sides separately. It sucked. Probably not missing out on anything unless you want to go drink etc. \n\nNow in my PhD program I have done kinda the same thing. All levels of PhD people I have in a group me. Anytime you want to ask subject matter questions, vent, ask about a class or organize something it’s there. Many people don’t talk but you can @ so done if you want them to respond. You could try to organize this but again I don’t gain much from it and have slowly distanced myself away anyway.", "author": "Jasquirtin", "created": 1620748338, "upvotes": 2}, "gxqpq0c": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqpq0c/", "text": "I went through this as well during my first year. But if it makes you feel any better, they were kind of cliquey and eventually fell apart and I had nothing to do with the leftover drama of it. One of them became one of my closest friends and she was the only one who was actively nice to me, the rest were cliquey and iced her and I out. I made a friend out of it and they all are left with no one. \n\nTry to take it with a grain of salt and remember that THEY are doing this to you, it’s truly showing more of who they really are and has nothing to do with you as an individual.", "author": "THelperCell", "created": 1620748314, "upvotes": 1}, "gxqpl4c": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqpl4c/", "text": "I don't fit in with my cohort *and* my lab members either... it hurts so much to be made to feel that way", "author": null, "created": 1620748258, "upvotes": 1}, "gxqnzf5": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqnzf5/", "text": "I hear ya on this!! Im halfway through my MPH and at 35 am older then most of the cohort I know of and a lot of them are MD/MPH combos and absolutely snotty about it. So I don't socialize with like any of them and the program friends I have made are graduating as Ive made more friends with the graduating class than I have my own....go make friends elsewhere and dont let this get to you", "author": "Contagin85", "created": 1620747589, "upvotes": 1}, "gxqmjkb": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqmjkb/", "text": "If they are treating you like that, you aren't missing out. Find friends outside of your cohort.", "author": "forcedtosignup86", "created": 1620746988, "upvotes": 1}, "gxqjzry": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqjzry/", "text": "Sorry to hear that, its not you, its them.", "author": "xAsianZombie", "created": 1620745909, "upvotes": 2}, "gxqepea": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqepea/", "text": "that's freaking shit-teeeee. but definitely continue on focusing on you and the friends you already have that like you for you! \n\nAlso, you may be able to find some other groups of people or small clubs that you could join and meet new people as well. good luck!", "author": "alyrose_96", "created": 1620743647, "upvotes": 1}, "gxqe9fs": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxqe9fs/", "text": "I am about to join a program with a cohort size of only 6 and am very worried about this happening to me. Since you mention friends from before grad school I advise hanging out with them. That’s what I plan to do if my cohort excludes me. Only thing I can recommend you really want to hang out with your cohort is to set something up and invite them. If they come maybe that’s your in and if they don’t at least you tried and have other friends. To me it sounds like your cohort is super toxic and wouldn’t be worth hanging out with anyway but I know it’s better/makes school easier to be socially friends with your cohort", "author": "SunRecords_51", "created": 1620743456, "upvotes": 2}, "gxq7616": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxq7616/", "text": "My cohort has no cohort. lol. We're all loose agents, covid only exasperated it. So it goes, I suppose, but a disappointment nevertheless.", "author": "nnomadic", "created": 1620740258, "upvotes": 2}, "gxq5jgr": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxq5jgr/", "text": "It's amazing how similar grad school and high school can be. Just keep your head down and get your work done. I know it's isolating and frustrating, but it's almost certainly better to just let it go if you can!", "author": "WordOrObject", "created": 1620739455, "upvotes": 7}, "gxpzkkf": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpzkkf/", "text": "same", "author": "Ayntxi", "created": 1620736304, "upvotes": 2}, "gxpzedi": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpzedi/", "text": "Time to meet real humans outside of school.  Plenty of wonderful people out there, that may align more in personality", "author": "ayaPapaya", "created": 1620736205, "upvotes": 2}, "gxpx2o2": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpx2o2/", "text": "My MA experience was a bit like this,  and I basically talked the situation by slowly talking and getting fo know each person in my cohort individually... eventually I started inviting me to things.  Most the time they cancelled due to conflicts and never really met up so I started organizing school related things like writing groups,  or a perer review weekend. We've all graduated and 4 out of the 6 us are still very close.", "author": "Kikisdoingherbest", "created": 1620734836, "upvotes": 2}, "gxpwmr7": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpwmr7/", "text": "I’m in my 50s and experienced the same in undergrad and now grad. I have my own friends outside school. I’m friendly with people at school, but am not invited to their social things (but wouldn’t go anyway, as I find drinking and chatting kind of vacuous and boring).  \n\nSo I would recommend maintaining the relationships you have, as they will probably be more long-lasting than your grad school cohort. If you can continue to interact with them individually, that would be good.  \n\nI realize this isn’t ideal, but by the luck of the draw, you wound up with these people, who sound a bit immature to me.", "author": "aqjo", "created": 1620734571, "upvotes": 6}, "gxplgaw": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxplgaw/", "text": "Anyone at least catch your eye?", "author": "MAJORMETAL84", "created": 1620725729, "upvotes": -4}, "gxpgi1z": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpgi1z/", "text": "Are you much older?", "author": "aaman2018", "created": 1620720917, "upvotes": 1}, "gxpg5xz": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpg5xz/", "text": "This definitely happened to me. To be frank, there's not much to do about it, and thus not much to spend effort worrying about. I agree with some others that you can find more meaningful people elsewhere that actually care about your time. People like this will not suddenly realize nor care that they've been excluding you because they're usually stuck in their own limited worldview. Not like this is necessarily a bad thing...but you might not want to be friends with such short sighted people anyways. :) \n\nI'm not sure if this quote really applies here, but it rings the same tone for me: \"If you wouldn't take advice from them, don't take criticism from them either.\" If they don't give you the time of day, don't take the mental baggage given to you by them either!", "author": "Gavindorf", "created": 1620720593, "upvotes": 12}, "gxpe41f": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpe41f/", "text": "i'm worried this will happen to me too, i've been told by faculty that my program accepts professionals and people already established in adjacent fields and i am neither a professional of anything or established in anything let alone an adjacent field. i'm going in straight from undergrad with nothing lol. I'm sorry this happened to you OP, it sucks!", "author": "WarningAfraid1274", "created": 1620718650, "upvotes": 6}, "gxpduhz": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpduhz/", "text": "Ouch the group chat thing! That was rude of them, even if unintended (although I don’t see how it could be w such a small group). \n\nI had a not as extreme problem, 5 ppl in my cohort and I just didn’t click w them like they did w each other. I didn’t have other friends around, so I went to all-grad events and eventually got “adopted” by another dept. I just happened to meet a group of students from the same program at an event and there was instant friend chemistry. I realize things are different w covid, but I hope something similar happens for you!", "author": "Thalassiosiren", "created": 1620718407, "upvotes": 12}, "gxpbll8": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxpbll8/", "text": "[deleted]", "author": null, "created": 1620716366, "upvotes": 114}, "gxp97m8": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxp97m8/", "text": "I am in an in between phase, I am a graduate but doing a post grad transitional certificate to change depts before I start Honours then Masters. and I am in my late 30's now so it's really hard. I have finally found one person doing something similar to me just last week. But we are a bit different and doing different classes so we dont talk much. I am at UOA in New Zealand, but if any of you want to make a new friend feel free to message me :-) Maybe we can start our own group chat on Facebook or Discord? It would be fun to chat to other post grads from other places. If you are in New Zealand feel free to message me anyway. More friends is always fun. No need to feel left out op.", "author": "rheetkd", "created": 1620714303, "upvotes": 8}, "gxp8p21": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxp8p21/", "text": "Shrug it off and find some other friends. You don't need to nor should you ever chase people who can't recognize your value.", "author": "XulaSLP07", "created": 1620713874, "upvotes": 13}, "gxp3v2o": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxp3v2o/", "text": "Wow they are shitty people.", "author": "garulous", "created": 1620710065, "upvotes": 8}, "gxow9pw": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxow9pw/", "text": "> I’ve never been openly hostile towards any of them and have expressed that I’d like to hang out with the group more. Should I just shrug it off and just try and hang out with my old friends from before grad school?\n\nDon't forget to look for opportunities to meet people in other programs at your university, too. Keep your ear to the ground and attend events other departments are hosting this fall. You may honestly be surprised by the results. I've actually made more friends outside of my department than I have inside of it.", "author": "Im_A_Quiet_Kid_AMA", "created": 1620704952, "upvotes": 24}, "gxos52k": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxos52k/", "text": "[deleted]", "author": null, "created": 1620702495, "upvotes": 42}, "gxoj059": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxoj059/", "text": "I’m sorry to hear that. I’m in my 40s in a cohort filled with 20-somethings. They’re not hostile but I know I’m not included in their big group social stuff. I got used to it and focused on chatting with them on an individual basis.\n\nIf it bothers you, could you approach one of the group? Someone who’s ‘friendlier’ that you could talk to one on one? Could you organise something and then invite them? That’s what I did and it helped me figure out which individuals I could actually be friends with.", "author": "Swirlingstar", "created": 1620697553, "upvotes": 143}, "gxociia": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxociia/", "text": "I want to add that this really sucks and I'm sorry. I'm in a similar boat with my cohort and it isn't a good feeling. I've tried to keep the collegial interactions when it comes to classes and find friends elsewhere. Not sure how successful this strategy is, but it's what I'm going with. Above all, take care of yourself!", "author": "npriest", "created": 1620694201, "upvotes": 37}, "gxoaoxp": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxoaoxp/", "text": "They're just 4 random people. It's utterly irrelevant. You can find friends through clubs or sports. Best thing would be not to care and to not give them attention.", "author": "thetiniestsquirrel", "created": 1620693254, "upvotes": 44}, "gxo9lrt": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxo9lrt/", "text": "I think this will happen to me too because I'm in my 40s and I'm not sure if there will be many older people in my cohort. I don't really care though because I'm not there to make friends. It sucks to be excluded though, that's not cool.", "author": "HelpImOverthinking", "created": 1620692696, "upvotes": 15}, "gxo8rj4": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxo8rj4/", "text": "I’m starting in the fall and I’m sure this will happen to me too.", "author": "UsErNaMe_8986", "created": 1620692267, "upvotes": 14}, "gxo8ewc": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxo8ewc/", "text": "You should show up to their party and grab their karaoke mic and just start singing. My pal Michael did that when he was in a similar situation.  Worked out pretty well for him.", "author": "Int_traveller", "created": 1620692087, "upvotes": 11}, "gxo81yd": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxo81yd/", "text": "Ah yes you remind me of me. We should make our own group chat of people left behind from their cohorts. 😂", "author": "Thecatofirvine", "created": 1620691903, "upvotes": 257}, "gxo640e": {"link": "/r/GradSchool/comments/n9jrbp/i_dont_fit_in_with_my_cohort/gxo640e/", "text": "I don’t have any real advice to offer. I merely want to say that I am sorry that this has happened. Mean kid behavior from middle school never really ends.", "author": "spookiestprincess", "created": 1620690922, "upvotes": 82}}}