{
  "sid": "mwnxbj",
  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/",
  "title:": "Is modern science just grad students writing to grad students?",
  "text": "I’ve started refereeing papers in journals, and the papers I get often sound like they were written by early-stage grad students. When we get reviews back for our work (which was written by grad students), the PI will often point out reviewer comments we can ignore because “they were probably written by students.” It made me think, is the bulk of the modern science writing industry just grad students being peer reviewed by grad students, writing for an audience of...grad students?",
  "author": "show_me_your_graphs",
  "created": 1619154596,
  "over_18": false,
  "upvotes": 561,
  "upvote_ratio": 0.98,
  "comments": {
    "gvlw9sm": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvlw9sm/",
      "text": "What kinds of things in the papers stand out to you that makes you think it’s written by a grad student?",
      "author": "bundtmuncher",
      "created": 1619209829,
      "upvotes": 3,
      "replies": {
        "gvm1vcm": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvm1vcm/",
          "text": "Good question. Usually the papers I’ve seen have solid methods sections and sloppy lit review/discussion/conclusion sections. It’s common for these papers to lack clarity as to how this paper fits in with prior literature and as to why this paper is a contribution beyond showing known results with a new dataset (I’m not referring to papers done for the sake of replication, which is important in and of itself). Often lit review sections will be long and meandering without a unifying thread and without actually securing the present study in the extant literature. Another sign is making generic statements to the tune of, “This is important with important implications, and future research should look into this more,” without providing clear implications or future directions. It makes sense that grad students spend so much of their time and learning on the data, methods, and results sections, and then tack on the lit review and conclusion as more of an after thought. It’s a skill to meaningfully tie that work into the broader literature, but it’s not a skill that’s always taught. \n\nI always give pointers to the authors and recommendations to the editor for R&R.",
          "author": "show_me_your_graphs",
          "created": 1619212411,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gvlsjml": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvlsjml/",
      "text": "As an early career, TT professor / PI, let me say that my experience is a mixed bag. Some professors / lab leaders do conduct themselves this way. Some don't. I certainly don't (and want it to remain that way).\n\n>the papers I get often sound like they were written by early-stage grad students.\n\nThis is often a combination of three things. (1) Grad students in STEM coming in with abysmal (if at all existent) writing skills and (2) Academic mentors not taking the time to teach them some basic skills, methodology and guidelines to write a decent academic paper, and (3) Senior members of the team not taking the time to proofread, edit and critique drafts of the paper before submission (I know many people who think they'll do this when the initial reviews come in).\n\n>is the bulk of the modern science writing industry just grad students  being peer reviewed by grad students, writing for an audience of...grad  students?\n\nI mean... on one hand, you do want the PI to let the students \"own\" their papers and projects, so to speak. It is a wonderful feeling to go from having no idea about a subject to become quickly immersed in it and the relevant literature. That being said, your advisor and collaborators know the field and the big picture way better than you, and should properly guide and vet the learning and the scientific process. \n\nSadly, the pressures to publish / produce is what leads a lot of PIs to take way more than they can chew, be super hands off and let their students get lost. And it is a shame.",
      "author": "vanoroce14",
      "created": 1619208133,
      "upvotes": 3,
      "replies": {
        "gvm3owc": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvm3owc/",
          "text": "That makes sense. I find myself writing reviews that parrot basic writing advice I’ve received from my PIs. I feel like a lot of work is not well-vetted by PIs—they probably make sure the analysis is alright and outsource the writing advice to the reviewers.",
          "author": "show_me_your_graphs",
          "created": 1619213282,
          "upvotes": 1,
          "replies": {
            "gvmq3bx": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvmq3bx/",
              "text": "I'll be honest... from a frequent paper or grant reviewer: this is not a good look or a great strategy. It angers the reviewer. It is unprofessional. It wastes time. It makes it harder for them to assess the paper properly. And it makes it likelier that you'll recommend for rejection or major revisions.\n\nAs I said: it is a darn shame PIs don't spend more time mentoring their students on what makes a great paper, and teaching them how to get there. I always ask my students to step back from it and try to read it like it's someone else's paper they're reading, and once again, as if it's someone else's paper they're reviewing. Are the ideas and contributions clear? Does the approach make sense? Etc. A good paper is one that makes you go 'oh wow... that makes sense. I wish I had come up with that.'",
              "author": "vanoroce14",
              "created": 1619224841,
              "upvotes": 2,
              "replies": {
                "gvmw3u4": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvmw3u4/",
                  "text": "Exactly! It is a very bad look to submit papers that are poorly written. It’s not fair to the grad student to be told by the PI to just submit it without actually vetting it first.",
                  "author": "show_me_your_graphs",
                  "created": 1619228132,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gvlob7o": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvlob7o/",
      "text": "My discipline is Education so there are a lot of individual practitioners (more common with the humanities/SS). My lab though is more science-type due to the majority of members coming from a science/engineering background. Our supervisor is mostly directing and watches the research but he does very little writing (he actually hates the writing process and would rather direct). \n\nSo in our case, yeah, most of what we're putting out is going to be written by grad students. Our supervisor edits every paper personally and won't let us release it until he's satisfied.",
      "author": "ImperiousMage",
      "created": 1619206196,
      "upvotes": 2,
      "replies": {}
    },
    "gvl2vix": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvl2vix/",
      "text": "idk, but stuff like this is why I've been contemplating leaving academia instead of becoming a professor like I always thought I wanted to be (I'm a 3rd year PhD student who's wanted to be a prof since I was in grade school). So much of what we do just feels....pointless really. Like we're just shouting into the void only to be answered by likeminded individuals who already know what we're saying. It doesn't feel productive enough. Unless I can get a position at a school that places a much greater emphasis on teaching than research, while also avoiding a post-doc, I don't think a life in academia is for me.",
      "author": "Levowitz159",
      "created": 1619196784,
      "upvotes": 2,
      "replies": {}
    },
    "gvkw3mq": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkw3mq/",
      "text": "quick answer, yes. I believe most of the papers that have been reviewed when I sent them out to a publication were graduate students or at the least young researchers just out of school",
      "author": "Weird_Surname",
      "created": 1619193864,
      "upvotes": 3,
      "replies": {}
    },
    "gvkugss": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkugss/",
      "text": "Yes, probably, but it’s not exactly like scientists are exactly the most eloquent either.",
      "author": "OneEye9",
      "created": 1619193159,
      "upvotes": 3,
      "replies": {}
    },
    "gvkbru8": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkbru8/",
      "text": "In my discipline, grad students write the papers disclosing new results and PIs review them, and then grad students read them. Which seems like that’s how it should be. That way everyone learns the same stuff at approximately the same pace. \n\nThe PIs also work together to write conglomerate reviews of new information. I will note that my field is a little less reliant on grant money (royalty money fills the gaps), so PIs have a bit more time for that.",
      "author": "Reclaimedpitcher",
      "created": 1619184748,
      "upvotes": 9,
      "replies": {
        "gvkhhmd": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkhhmd/",
          "text": "\\>  PIs review them \n\nthis step is often skipped.",
          "author": "zcleghern",
          "created": 1619187497,
          "upvotes": 7,
          "replies": {
            "gvks38z": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvks38z/",
              "text": "Depends on the journal. My experience has been that high impact journals accept about 10% and will send your publication back asking for additional data before publishing it. Also, my PIs actually review articles for high impact journals, so that’s what I’m basing this on.\n\nPlus it’s not really worth publishing if it’s not high impact IMO.\n\nETA: we are in different disciplines, so I’m sure that contributes.",
              "author": null,
              "created": 1619192134,
              "upvotes": 2,
              "replies": {}
            },
            "gvm2z6o": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvm2z6o/",
              "text": "Exactly",
              "author": "show_me_your_graphs",
              "created": 1619212939,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gvjot10": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjot10/",
      "text": "I mean, it always was researchers writing to researchers but with increasing other responsibilities modern PIs have less time to be researchers because they already need to be full-time managers.  \n\nBut generally there seems to happen a lot of ghost writing. But I also agree that this is more common with postdocs, the reason I heard for this is that people should first publish to learn that side of the process before reviewing manuscript of others.  \nI'm not sure why a lot of scientists choose to break confidentiality instead of either rejecting and suggesting their trainees as reviewer or just approaching the editor that another person will be involved, my guess would be that the editors would rarely complain and actually might be happy to know another name they can reach out to. Because while not disclosing the ghost writer might seem like a crime without victims it has moral implications as the actual reviewer never disclosed possible conflicts of interest and never officially agreed to anything. But I guess PIs just choose the approach that does not create any more paperwork.",
      "author": "LittlePrimate",
      "created": 1619167947,
      "upvotes": 17,
      "replies": {}
    },
    "gvjoatq": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjoatq/",
      "text": "We shouldn't confuse science and academia. They are two very different things.",
      "author": "CaptainCornerCamper",
      "created": 1619167454,
      "upvotes": 47,
      "replies": {
        "gvkghvk": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkghvk/",
          "text": "[deleted]",
          "author": null,
          "created": 1619187038,
          "upvotes": 8,
          "replies": {
            "gvknl3v": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvknl3v/",
              "text": "Keep an eye out for journal articles where the disclosures section says something other than “nothing to disclose”. In some fields you’ll find quite a few publications from people who either consult in industry or work there full-time.\n\n(To be clear, I’m not implying that there’s anything wrong with that - the disclosures section just happens to be a useful way to figure out how common it is for people publishing in your field to be in industry - possibly also useful for finding places *you* might one day consider doing science at!)\n\nFor other non-academia science (eg. government), look in author affiliations.",
              "author": "tentkeys",
              "created": 1619190181,
              "upvotes": 2,
              "replies": {
                "gvlgjaf": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvlgjaf/",
                  "text": "In my field there’s a ton of publishing done by government labs too.",
                  "author": "Reverie_39",
                  "created": 1619202713,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gvju97p": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvju97p/",
          "text": "[deleted]",
          "author": null,
          "created": 1619173163,
          "upvotes": 9,
          "replies": {
            "gvjukw9": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjukw9/",
              "text": "You are talking about academia here, not science which is done also outside of academia.",
              "author": "CaptainCornerCamper",
              "created": 1619173444,
              "upvotes": 14,
              "replies": {
                "gvjw1a5": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjw1a5/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1619174686,
                  "upvotes": 25,
                  "replies": {
                    "gvjwou4": {
                      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjwou4/",
                      "text": "Can't argue with any of that!",
                      "author": "CaptainCornerCamper",
                      "created": 1619175224,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gvm2wgw": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvm2wgw/",
          "text": "Haha—true!",
          "author": "show_me_your_graphs",
          "created": 1619212904,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gvjefi4": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjefi4/",
      "text": "In my experience, post-docs do an order of magnitude more writing and reviewing than grad students do, so if anything it's post-docs writing to other post-docs. Pre-tenure faculty also probably do more than grad students. It could be true that post-tenure, many senior faculty end up being primary author on fewer papers and I guess it's possible that they do fewer reviews (though most faculty I know do a lot of reviews, plus often serving as editor).\n\nThat's not really all science is, though. Maybe some grad students don't feel like their advisors contributed much that was helpful to their dissertation, but those are unfortunately just grad students who had shitty advisors. My advisor (and the rest of committee) may not have contributed much to the actual writing of my papers, but they definitely contributed a ton to the science. I'd have to be the worst kind of egotistical liar to say otherwise.\n\nMy advisor always said grad students contributed the best and most insightful reviews, by the way, because they tend to spend more time thinking about the paper than post-docs or faculty.",
      "author": "yerfukkinbaws",
      "created": 1619158734,
      "upvotes": 106,
      "replies": {
        "gvljgo2": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvljgo2/",
          "text": "Agreed. I may not have been the most fond of my advisor, but he certainly contributed a lot to the projects that wasn't ink to paper.",
          "author": "First_Foundationeer",
          "created": 1619204014,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gvjdxuv": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjdxuv/",
      "text": "Yep. Which is why when I write papers I try to go out of my way to add more context than would be needed by the average person in the field. \n\nBecause I assume the only people reading it will be other grad students who also don’t know anything.",
      "author": "SomeRandomScientist",
      "created": 1619158344,
      "upvotes": 202,
      "replies": {
        "gvjihie": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjihie/",
          "text": "> Because I assume the only people reading it will be other grad students who also don’t know anything.\n\nbless your soul.",
          "author": "liftingline27",
          "created": 1619162117,
          "upvotes": 108,
          "replies": {}
        },
        "gvjztqr": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjztqr/",
          "text": "I'm wondering if there would be more impact if we made an effort to publish a pop-media article parallel with the journal article. The added context in the journal article could be like the draft of the pop-media article. Getting messages out from behind the paywalls and into peoples' feeds seems like it could be productive.",
          "author": "NotnotNeo",
          "created": 1619177647,
          "upvotes": 26,
          "replies": {
            "gvk9g77": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvk9g77/",
              "text": "This is already being done for grad students with astrobytes and similar paper summary articles.",
              "author": "geosynchronousorbit",
              "created": 1619183544,
              "upvotes": 7,
              "replies": {
                "gvk9qf4": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvk9qf4/",
                  "text": "thats cool. would love one of these for social sciences",
                  "author": "NotnotNeo",
                  "created": 1619183692,
                  "upvotes": 4,
                  "replies": {
                    "gvkwfif": {
                      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkwfif/",
                      "text": "Yea, for the social sciences in particular, I think this should be a requirement. We study people, and it's disturbing that we're generally uninterested in making what we learn intelligible for those same people.",
                      "author": "Kaatman",
                      "created": 1619194007,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gvmjxuq": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvmjxuq/",
              "text": "tbh I don't see how this would be helpful. Some articles definitely assume way too much background, but there's a huge difference between \"what do you mean you don't know this concept that is only actually written down in some 1960s article?\" and \"pop-media\", and the former is where the problem actually is. Generally speaking grad classes fill in a lot of that void, but with that strategy you're assuming schools do things right and that nobody too far away from your subfield tries to read your articles.\n\nLike, low hanging fruit example, you cannot even begin to meaningfully talk about Jahn-Teller distortions if you don't know group theory. Basically everything in my field (molecular spectroscopy) is similar. If you don't know group theory and enough linear algebra to work with the matrix schrodinger equation, you're toast and no amount of analogies can help you understand the average paper.",
              "author": "Mezmorizor",
              "created": 1619221517,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gvkhxnu": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkhxnu/",
          "text": "That’s fantastic. I appreciate you.",
          "author": "show_me_your_graphs",
          "created": 1619187696,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gvjbt4l": {
      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjbt4l/",
      "text": "Academia is a pyramid scheme. I genuinely mean that.\n\nAnd yes, this happens. Some PIs will say that by letting their students / post docs contribute or do the reviewing process with or for them it gets those students / post docs experience.\n\nI’m not totally against that concept, but in journals that disclose the reviewers I think they should be given accreditation as well.",
      "author": "NickDerpkins",
      "created": 1619156682,
      "upvotes": 450,
      "replies": {
        "gvjo7xp": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjo7xp/",
          "text": ">And yes, this happens. Some PIs will say that by letting their students / post docs contribute or do the reviewing process with or for them it gets those students / post docs experience.\n\nAlso goes for teaching. I have known several professors who will send their PhD students and postdocs to give lectures for them or use them to prepare teaching material.",
          "author": "CaptainCornerCamper",
          "created": 1619167375,
          "upvotes": 82,
          "replies": {
            "gvjxtaf": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjxtaf/",
              "text": "Is it bad if a PhD student holds/prepares one lecture out of an entire course? I did that for my PI and I think it was a great experience. One student even said I inspired them, probably because the professor is further away from them.",
              "author": "Mephisto6",
              "created": 1619176136,
              "upvotes": 72,
              "replies": {
                "gvjy0hq": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjy0hq/",
                  "text": "Nah, that's not bad. It is good experience.",
                  "author": "CaptainCornerCamper",
                  "created": 1619176296,
                  "upvotes": 66,
                  "replies": {}
                },
                "gvkd9go": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkd9go/",
                  "text": "In my opinion, this is exactly how these things should be handled. My advisor would ask my lab group, if he wasn't available, if we would like to teach a class or two. This gave the student experience of teaching an actual course and freed up the advisor to do whatever was conflicting.",
                  "author": "WesternBruv",
                  "created": 1619185496,
                  "upvotes": 44,
                  "replies": {}
                },
                "gvl62z2": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvl62z2/",
                  "text": "Every time I’ve been a TA I have had this option. I think it’s really great for a no pressure experience at teaching. It’s not being taken advantage of like others are",
                  "author": "snakesareracist",
                  "created": 1619198163,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gvk97u7": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvk97u7/",
              "text": "Every.Fucking.Lab",
              "author": "Clozee_Tribe_Kale",
              "created": 1619183419,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "gvjsvih": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjsvih/",
          "text": "Can you elaborate on how it's a pyramid scheme? Genuinely curious",
          "author": "businessbee89",
          "created": 1619171881,
          "upvotes": 17,
          "replies": {
            "gvk4zfq": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvk4zfq/",
              "text": "Also when you write grants you put your PIs name on it and not yours because if you're listed as a co or main investigator then the grant won't fund your stipend. So you leave your name off the grant and instead are the nameless student whonthe grants will fund. This might be field specific, but the last 3 of 5 grants I've submitted and received have gone this way. Not to mention that universities take a portion of large grants you get for themselves as \"overhead\".\n\nFurther, can we talk about the bullshit that is paying tuition and fees as a post-course PhD student? I'm not taking classes, but I or my PI have to pay tuition for me to do research that is ultimately for the university to take credit for. WHY ARE WE PAYING TO BE AT WORK FOR UNIVERSITIES?!?!? \n\nThe system is broken and fucked. \n\n*** DISCLAIMER: I'm a 4th year PhD student who's fucking over it.",
              "author": "ghost_pies",
              "created": 1619181038,
              "upvotes": 96,
              "replies": {
                "gvk9u84": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvk9u84/",
                  "text": "I struggle with this thought, too. I'm only a first year PhD student, but my program doesn't require any courses. I haven't stepped foot on campus since starting. Yet I am still paying full tuition. I am paying money to have a job. It's fucked up.",
                  "author": "EnterTheDoc",
                  "created": 1619183747,
                  "upvotes": 25,
                  "replies": {}
                },
                "gvkvtju": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkvtju/",
                  "text": "Hi there, Higher Ed Admin student here, also in the same post-course situation. The reason is that by forcing the student or department to pay for the student's dissertation credits, you're basically making sure no PI gets tempted to milk a graduate student's doctorate out for just one more semester, and wait, I'd like some revisions here, so one more semester. In other words, it's a standard approach to prevent abuse of graduate students as free labor for the one person who can approve the conclusion of the free labor. This scenario makes more sense in the hard sciences as opposed to the social sciences or humanities, but such policies are usually university-wide.",
                  "author": "commodore_kiwi",
                  "created": 1619193741,
                  "upvotes": 12,
                  "replies": {
                    "gvkx14p": {
                      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkx14p/",
                      "text": "That makes sense, thanks for the info!\n\nI think there some other ways this could be accomplished via committees, Graduate school and student reps, etc. Obviously, that's another needed system rewrite and not every answer is perfect. My main problem with the current situation is I think it backfires on some of us who are forced to then find that funding ourselves, especially when a pandemic has been a cause for so many progress delays. Grad students are already criminally underpaid and then add on all these damn fees and required tuition and it's all just fucking ridiculous. Especially for those of us who aren't going to get fabulous high paying careers at the end of it!",
                      "author": "ghost_pies",
                      "created": 1619194268,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "gvky6ik": {
                      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvky6ik/",
                      "text": "Still makes no sense when you're not taking any courses and you're literally working as an apprentice.\n\nFor tradesman that need to be certified and professional engineering licensure in no way requires tuition to keep the professional mentor from abusing or milking their apprentice.",
                      "author": "BerserkFuryKitty",
                      "created": 1619194765,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "gvka8tb": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvka8tb/",
                  "text": "So I got a question as an older bachelor student that is very aware of how fucked up the system is.\n\nI'm a geography major and I will never get more then a masters (just don't want it). Is there any point in writing in scholarly format if I know I'm not going to get a job writing them and I will never be a PHD student? Like what is the really world application?",
                  "author": "Clozee_Tribe_Kale",
                  "created": 1619183963,
                  "upvotes": 2,
                  "replies": {
                    "gvkbwse": {
                      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkbwse/",
                      "text": "By writing in scholarly format do you mean submitting manuscripts for publication? Depending on your career choice, even with an MS, you may still need to at the very least contribute to peer reviewed or company manuscripts. I'm not super familiar with the geography field. If your goal is private company, you likely will not need to but if you want to be government or university related, you may need to do some sort of report writing. \n\nThe real world application of a PhD and scientific writing is attention to detail, well planned out ideas, critical thinking, scientific literacy, concise writing, and the ability to digest scientific claims and explain them simply. Part of the PhD is and should be focused on writing and communication. Most academic writing is terrible and overly complicated. People pump stuff out shit for publications and shit writing gets published. We could increase scientific literacy (and scientific reproducibility and accountability) SO MUCH just by requiring a better level of writing. A lot of scientific articles are lazy writing. It takes practice and skill to be a good effective scientific writer. \n\nSorry that was sort of a tangent of your question.\n\nThat being said, if you don't need a PhD for the job you want, don't get one. It will be a colossal waste of your time, sanity, and money.",
                      "author": "ghost_pies",
                      "created": 1619184818,
                      "upvotes": 9,
                      "replies": {
                        "gvkiqwx": {
                          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkiqwx/",
                          "text": "No you're totally fine and thank you for the insight. By scholarly paper I mean your typical abstract, method, results split into sections with subsections describing different methods and findings. I understand the reasoning behind it but, all of the authors of my sources, whom I'm modeling my paper structure off of, all have a PhD. Plus I feel like I am lacking in my ability to properly support a paper in this structure due to my inability to run an experiment in the first place.\n\n So, to clarify, I'm using a paper structure that is used for experiments but, I don't have an experiment. I'm just writing about other people's experiments.\n\nI will definitely go private because it seems my field (sustainability for me personally) is doing a whole lot more in the private sector. However, I'm focusing in GIS which, I will probably never have to write a paper about. \n\nAt the end of it all I guess it's just part of academia. Endlessly writing papers no one will read because there isn't that much of a point behind them anyway except, maybe for practice as it pertains to critical thinking. O and grades....sweet sweet grades.",
                          "author": "Clozee_Tribe_Kale",
                          "created": 1619188060,
                          "upvotes": 5,
                          "replies": {
                            "gvkmfcy": {
                              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkmfcy/",
                              "text": "Gotcha. The beauty and probably original reasoning for the structure of scientific papers was the clarity (Ha!) and transparity of the process. It eliminated fluff so that others could see exactly what you did to come to the conclusions you arrived at. \n\nFor your structure, I would definitely check out academic review papers. They do exactly what you mentioned... writing about other people's experiments. It's considered a secondary type of article because there is no original experiments but you are summarizing or critiquing other experiments. There are many different structures depending on the journal, but the typical structure (with methods, results, etc) doesn't usually make sense for review papers. They have different subsections. I would recommend looking up a few in a related field/journal to see how they do it and model it after those!",
                              "author": "ghost_pies",
                              "created": 1619189676,
                              "upvotes": 5,
                              "replies": {}
                            },
                            "gvktaeo": {
                              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvktaeo/",
                              "text": "I am bit surprised by:\n\n>Plus I feel like I am lacking in my ability to properly support a paper in this structure\n\nThere are plenty of \"published papers\" (written by PhD's) which count as \"credentials\" without including bench experiments.\n\nEvery \"literature review\" is just that.  An excellent literature review includes \"methods\": what were the key search terms, what reference-databases were queried, how were papers organized?  Then \"results\": what did the sum of the papers suggest for the topic?\n\n[A quick google search in Geography.](https://scholar.google.com/scholar?hl=en&as_sdt=1000007&as_ylo=2010&q=geography+sustainability+literature+review&btnG=)\n\n\nEven beyond the formal literature reviews you might find, there are some incredible \"published papers\" if you look: \n\n[Springer, S. (2016). Fuck neoliberalism. ACME: An International Journal for Critical Geographies, 15(2), 285-292.](https://www.researchgate.net/profile/Simon-Springer-2/publication/299578791_Fuck_Neoliberalism/links/57a02e0308aec29aed214c9e/Fuck-Neoliberalism.pdf)",
                              "author": "Bulette",
                              "created": 1619192652,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gvjw2rg": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjw2rg/",
              "text": "Your boss takes credit for all your work, but you must do an exceptional amount to get your own lab. Once you have a lab you must have an exceptional amount of output so you rely on grad students while you are typically hands off. \n\nThis analogy doesn’t extend well to early stage PIs",
              "author": "throwaway__official",
              "created": 1619174720,
              "upvotes": 57,
              "replies": {
                "gvjx2w0": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjx2w0/",
                  "text": "Also you chase the latest fads lest you get your funding given to someone who does.",
                  "author": null,
                  "created": 1619175547,
                  "upvotes": 27,
                  "replies": {
                    "gvjxs2t": {
                      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjxs2t/",
                      "text": "Ooh true. Saw a lab loose funding because their instrumentation wasn’t top tier. The grant they were applying for simultaneously was an instrumentation grant.",
                      "author": "throwaway__official",
                      "created": 1619176110,
                      "upvotes": 20,
                      "replies": {}
                    }
                  }
                },
                "gvkh3zl": {
                  "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkh3zl/",
                  "text": "I think you're overselling it with \"your boss takes credit for all your work\".",
                  "author": "AndChewBubblegum",
                  "created": 1619187322,
                  "upvotes": 4,
                  "replies": {
                    "gvmijhg": {
                      "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvmijhg/",
                      "text": "Yeah, I know this is field dependent to an extent, but in most I've seen it's understood that first author did most of the work, middle authors had some varying level of contribution, and the last author obtained funding and decided the general research direction. Nobody assumes the PI did all the work, and I've at least personally never seen a PI take first author on a paper that had students in authorship (occasionally I see collabs that PIs had with other PIs).\n\nIn general, I'd say while I can see how you'd get OP's impression, it's not really accurate. It's just rare to go to a talk on something your PI is ACTUALLY interested in, so it's hard to see how much they truly know.\n\nAnd some bosses are put at last author by default when in reality they shouldn't have any spot, but that's a whole can of worms.",
                      "author": "Mezmorizor",
                      "created": 1619220769,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gvjzrfn": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvjzrfn/",
              "text": "There are simply not enough positions in academia for everybody who wants to make a career out of it.",
              "author": "Guavaberry27",
              "created": 1619177602,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "gvkjk5w": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkjk5w/",
          "text": ">Academia is a pyramid scheme.\n\nEspecially Egyptology.",
          "author": "awksomepenguin",
          "created": 1619188423,
          "upvotes": 16,
          "replies": {
            "gvknwra": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvknwra/",
              "text": "Ha that's funny!",
              "author": "Glucksburg",
              "created": 1619190324,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gvkd7pc": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkd7pc/",
          "text": "A friend of mine did a PhD in the humanities at the top program in his field. He left extremely disgruntled and is insistent that he will never again return to academia.\n\nHis advisor was having him teach most of their classes, grade, keep abreast of the latest literature for them, assist in research, do reviews for journal articles for them, etc. while the advisor of course got all the credit and maintained a sweet sweet full professor’s salary and benefit package and my friend was scraping by.",
          "author": "ThrowawayHistory20",
          "created": 1619185470,
          "upvotes": 10,
          "replies": {}
        },
        "gvkqrdd": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvkqrdd/",
          "text": "I still cringe at the \"peer\" review I had to write as a second year (the paper was good and deserved publication but my suggestions were wacky in hindsight). The peer review I wrote as a fourth year was solid, though.",
          "author": "MercuriousPhantasm",
          "created": 1619191558,
          "upvotes": 3,
          "replies": {
            "gvm2f8a": {
              "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvm2f8a/",
              "text": "Yes! I always wonder how much eye-rolling has happened in the direction of my own reviews. I think I’m getting better, though.",
              "author": "show_me_your_graphs",
              "created": 1619212675,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gvlakpk": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvlakpk/",
          "text": "My PI does this, but also does his own review (most of the time.) We often generate better feedback that way. \n\nHe also has us write our own large grants. Both those experiences have helped so much in my preparation for future jobs, I think. \n\nBut yes, it’s shady when a PI pushes too much work off on grad students.",
          "author": "BiologyPhDHopeful",
          "created": 1619200108,
          "upvotes": 3,
          "replies": {}
        },
        "gvm25vl": {
          "link": "/r/GradSchool/comments/mwnxbj/is_modern_science_just_grad_students_writing_to/gvm25vl/",
          "text": "In my case, journal editors have reached out to me directly for reviews, so I have gotten credit for my reviews (for whatever it’s worth)",
          "author": "show_me_your_graphs",
          "created": 1619212552,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634065187
}