{"sid": "mqendh", "link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/", "title:": "Radical self-care is saying “no”", "text": "One thing I’ve enjoyed about being completely virtual for these terms is understanding and honoring my boundaries. I used to be the “yes” woman who would take on extra activities/work or perform favors for little, if any, compensation. I would over-extend myself to be there for family, friends, and classmates even when I was drowning in neglected depression, anxiety, and numbness. I just couldn’t say “no” because I was worried if I did, I would be seen as unreliable, lacking leadership, or not competitive. \n\n But I’ve chosen myself. Radical self-care is asking for extensions on my papers when I need them and taking breaks because I deserve it. It’s not feeling inadequate when I’m not achieving, but placing more importance on how much water I drink or whether my personal finances are on track. It’s making sure I stretch my legs after attending hours of lecture and taking a brief walk outdoors. It’s giving myself grace and allowing myself room to fail. It’s prioritizing and compartmentalizing my goals so my thoughts don’t run wild with fear. But most importantly, it’s saying “no” to those who expect my yes. \n\nSo if you’ve reached your limit, this is your sign. Just tell them no. It’ll be okay.", "author": "athoughtbin", "created": 1618357845, "retrieved": 1632845494, "over_18": false, "upvotes": 477, "upvote_ratio": 0.98, "comments": {"gxyifxv": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gxyifxv/", "text": "YES TO EVERY PART OF THIS. I’m like this too, 100%, and learned the hard way that it’s not healthy. Someone in my therapy group said \n\n“Don’t set yourself on fire to keep others warm” \n\nit’s honestly one of the greatest things I’ve heard, and I always try to remember it when I find myself about to say yes/offer help when I’m already at my mental/emotional limit (or if doing that thing will get me there).", "author": "rghaddar", "created": 1620897075, "upvotes": 2}, "gukszne": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gukszne/", "text": "Great quote by Steve Jobs I hold close to my heart: “People think focus means saying yes to the thing you've got to focus on. But that's not what it means at all. It means saying no to the hundred other good ideas that there are. You have to pick carefully. I'm actually as proud of the things we haven't done as the things I have done. Innovation is saying no to 1,000 things.”", "author": null, "created": 1618466962, "upvotes": 2}, "gukdwa0": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gukdwa0/", "text": "> I just couldn’t say “no” because I was worried if I did, I would be seen as unreliable, lacking leadership, or not competitive.\n\nIMHO \"competitiveness\" and \"leadership\" are only desirable beacuse it's useful to employers. To employees, and by extension to students, these traits are detrimental. In every circumstance cooperation and consensus are far better.\n\nThis whole thing, grad school, academia, research, it's about you, me, it's about the dreams and curiosities of people like us. Not about ticking boxes or accumulating numbers or satisfying reviewers, grant agencies, advisors, or universities. We risk a lot and forego a lot for what? Personally, my answer is, I want to do honest research, teach honest science, go where my curiosity takes me, and collaborate with curious people like me. People's expectations have no place in that answer, nor toxic totems of 21st century, like competition, hustle, or the commodification of one's own personality and life.\n\nIn that regard saying \"no\" is actually the least you can do for yourself. It's great to be helpful, caring, and cooperative, but the line between those and being exploited and abused is _very_ thin. People will be, often unintentionally, pulling you over to the wrong side of its. It is fundamental to one's wellbeing to resist.\n\nThis whole thing might sound a bit selfish, but it's actually the opposite. If you feel better, if you _are_ better, happy, and not overworked, you can be more helpful and charitable to everyone around you.\n\nSo congrats on caring for and prioritising your self! Wish you happiness and success!", "author": "gkayaalp", "created": 1618456419, "upvotes": 2}, "gukbp0j": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gukbp0j/", "text": "I saw this quote on Michelle Obama’s Instagram that has really stuck with me “what are you doing to put yourselves higher on your to do list”. Since then, no matter what I have to do each day, I also make sure I make time for things that make me smile and give myself permission to take a break/the night off from studying.", "author": "mrscohenplease", "created": 1618455164, "upvotes": 1}, "guhtza6": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/guhtza6/", "text": "I told someone no yesterday and wasted 30 whole precious minutes wondering if I was being an asshole for not putting someone else before me.\n\nYeah, being a yes person can lead to self-sabotage. I needed to say no.", "author": "sincere_eel", "created": 1618412967, "upvotes": 3}, "guhord6": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/guhord6/", "text": "Yes!! I've been working on getting better about this. I saw something recently that said like-- nobody is going to show up to give you a \"nice person\" award and tell you to take a break after a certain amount of self-sacrifice, so you have to do it yourself. It's so hard but so important!!!", "author": "joblo42069", "created": 1618410622, "upvotes": 2}, "guh7s57": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/guh7s57/", "text": "I look up to you for this realization/self-awareness!  I struggle with the exact same issues.  Only 45 days left of my MBA!  Woot-Woot!", "author": "iluvpntbtr", "created": 1618401596, "upvotes": 3}, "guh7bip": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/guh7bip/", "text": "Is you me. For real though, I know this is what I need to do but I don't think I can.", "author": "ad_2010", "created": 1618401285, "upvotes": 2}, "gugqzbj": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gugqzbj/", "text": "Before COVID hit I was juggling like 20 things at once. When COVID hit, the relief that hit was amazing when I realized I no longer had to do any of it. I became more proactive at declining more work that was offered when it provided me no real benefit and quitting things when I realized I was no longer interested in them as a result. I definitely value my own time a lot more, and have learned to say no without FOMO.", "author": "peregrin5", "created": 1618386572, "upvotes": 6}, "gugligk": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gugligk/", "text": "Not a grad student just yet (will start masters in the fall), but as someone who used to take so many projects to the point of \"too much\" at times and a work-alcoholic (ok I'll admit that I actually like working and actually doing something), I can definitely understand what you're saying: in the past year or so, I've learned the value of taking breaks as a form of recharge so that I would be able to be productive again and even more so when I'm back to work and self-care as beneficial to your mental health. Also, quality of projects is better than quantity as well!", "author": "TheFreeJournalist", "created": 1618381642, "upvotes": 3}, "gug79mm": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gug79mm/", "text": "Yes same here. I actually just quit a leadership position in the club because the over-commitment had me way over the edge.", "author": "doomer1111", "created": 1618371299, "upvotes": 5}, "gug0kng": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gug0kng/", "text": "I definitely need to exercise this. Unfortunately I can’t right. I’m helping to take care of an elderly relative whose condition has gotten worse over the past year I’ve been in school and she needs a lot of attention. Those two things plus work, plus a side hustle has me so exhausted. I can’t wait for summer.", "author": "evin0688", "created": 1618367456, "upvotes": 6}, "gufzbva": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gufzbva/", "text": "It is really a great tool, the word \"no\", and not being afraid to use it.", "author": "TJHistory", "created": 1618366784, "upvotes": 5}, "gufvbul": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gufvbul/", "text": "An important reminder!! Thank you for sharing!", "author": "circlueblights", "created": 1618364688, "upvotes": 5}, "gufu4ee": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gufu4ee/", "text": "Agreed. Why is it radical tho?", "author": "totalitydude", "created": 1618364066, "upvotes": 6}, "guftbeq": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/guftbeq/", "text": "I needed this.", "author": "Deejay_94", "created": 1618363652, "upvotes": 9}, "guflluq": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/guflluq/", "text": "I can relate. I have a problem saying \"no\" in my academic and personal life, but I just told my advisor that I didn't want to turn in a paper this summer for a conference (after I graduated with my masters). While he was disappointed, he respects my decision. I am grateful that he didn't try to talk me back into it, or pressure me. He seemed very understanding, and I am very happy for it. I am ready to be done with school, and this will help me push forward to that end.", "author": "duffmeisterc", "created": 1618359658, "upvotes": 31}, "gufiuts": {"link": "/r/GradSchool/comments/mqendh/radical_selfcare_is_saying_no/gufiuts/", "text": "Definitely so. I came to that realization after taking on too many side projects and had stretched myself so thin that wasn't making good progress on any of them. My goal now is keep my projects limited but substantial.", "author": "bio-nerd", "created": 1618358216, "upvotes": 50}}}