{"sid": "potx14", "link": "/r/GradSchool/comments/potx14/taing_a_masters_course_and_struggling/", "title:": "TA'ing a masters course and struggling", "text": "I'm in my second year (of a 3 year phd in Europe) currently TA'ing a master's course, problem is I'm also taking it at the same time. This happened because I basically had to agree to set down all my teaching by a certain date and i'd already turned down several courses for various reasons. I didn't even know the actual material when I signed up, and when I got access it was way beyond the level that I thought it was. I'm devoting a lot of time to learning and understand the material and doing the assignments prior to the students, but I have to lead q/a sessions with 30 students and I just don't have the level of insight required to properly help them, because although I get the material enough to do the assignments (barely), I'm just learning it myself too. I am also doing research at the same time (I can't stop whilst teaching) and I'm so tired from doing both that my mental and physical health is diminishing and I just can't be a good TA. I don't really know what to do at this point, besides dropping the TA role, but the problem is they are really short of TAs and I would be majorly screwing over the professor and other TA by leaving. But, it's clearly affecting me, because I'm not sleeping enough and I already feel exhausted and can't think straight. Any advice?", "author": "ilovegalaxies", "created": 1631724420, "retrieved": 1632844435, "over_18": false, "upvotes": 14, "upvote_ratio": 0.94, "comments": {"hd02soy": {"link": "/r/GradSchool/comments/potx14/taing_a_masters_course_and_struggling/hd02soy/", "text": "Is the workload you're being given too much? If so you can probably talk to the professor teaching the class about lightening up the work load a little on your end. Most TAs are TAs for a class because it's something they already know how to do. Having to learn along with the other students basically makes you a student for that class too. Try talking to the professor about it being overwhelming and express that you are feeling like you aren't knowledgeable enough on the material to be leading weekly discussions on it.", "author": "hakeemalajawan", "created": 1631741489, "upvotes": 2}, "hczfg7z": {"link": "/r/GradSchool/comments/potx14/taing_a_masters_course_and_struggling/hczfg7z/", "text": "Masters students are essentially your peers. I’d be level with them that you’re learning the material with them. And treat the Q/A sessions more like a study group than a lecture. Structuring the session around group work could help shift the burden of teaching off of you. And reasoning through problems with your peers can be a very effective way to learn anyway", "author": "mandm3456", "created": 1631732071, "upvotes": 16}}}