{
  "sid": "qaj71u",
  "link": "/r/GradSchool/comments/qaj71u/need_advice_asap_anxious_af_about_missing_class/",
  "title:": "NEED ADVICE ASAP- ANXIOUS AF ABOUT MISSING CLASS OVER BEING SICK",
  "text": "I just started grad school at a very intense program for a highly ranked school. Since school began, I have been persistently ill. First I had a UTI that went to my kidneys and turned into a massive infection. Then my doctor also discovered I had a kidney stone. I did everything to not miss school during this. There was one day where I was up until 4am with pain, woke up at 7am, went to urgent care, received antibiotics, and went to school until 5:30pm while in extreme pain. \n\nSince this is the first month, I just have this intense fear about missing. It almost feels as if my instructors think I am lying or something. I had one teacher tell me I needed to contact the advisor because I had missed 2 of her classes. The advisor said I could take a medical leave of absence (which would mean I couldn't resume until next year- not doing that!). Anyways, I am not behind in school.\n\nSo I got extremely sick last Wednesday with the flu (or what I thought was the flu). I had to miss class again because you cannot come sick (and I was coughing a lot). I thought I would be better by Monday and it was not even a thought in my mind that I would be missing class Monday. \n\nSo now it is Sunday and I felt somewhat okay today. Then, at like midnight I got hit with the worst cough I have ever had. If I go to class and they hear me coughing they are gonna be pissed thinking I have COVID. However, I also don't want to email my professors last minute saying \"hey sorry for the 2am email but I am actually sick\" cause I actually thought I would be good by tomorrow!!\n\n&#x200B;\n\nDoes anyone have advice on how to handle this? It is truly freaking me out that I might have to miss tomorrow",
  "author": "emmastudent",
  "created": 1634549444,
  "updated": 1634655425,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh3iawn": {
      "link": "/r/GradSchool/comments/qaj71u/need_advice_asap_anxious_af_about_missing_class/hh3iawn/",
      "text": "Well...do you have COVID?  No offense but from a human perspective you cannot put your desire to do well in your program in front of others people's health.  \n\nAny program that is incentivizing you taking that risk is doing some extreme things wrong IMO.  Grad school isn't highschool or college, they should treat you like an adult--and sometimes shit comes up like getting sick. I would talk with professors, they are people, if they won't play ball you should probably look up if there is an ombudsman because sometimes people get sick...but I would see if there are alternatives (example: zoom into class, if they have any prerecorded lectures from last year, before going down that route).",
      "author": "Onepopcornman",
      "created": 1634557068,
      "upvotes": 7,
      "replies": {}
    },
    "hh3unmb": {
      "link": "/r/GradSchool/comments/qaj71u/need_advice_asap_anxious_af_about_missing_class/hh3unmb/",
      "text": ">It almost feels as if my instructors think I am lying or something.\n\nBelieve it or not, people often do lie about having such medical issues.\n\nContact your dean of graduate students office. Or if you don't have that, your college office. \n\nMany schools require that the university certifies significant medical issues, not the professor. And then they provide notice to your instructors of the medical issues.",
      "author": "raistlin65",
      "created": 1634564170,
      "upvotes": 3,
      "replies": {}
    },
    "hh3uwsc": {
      "link": "/r/GradSchool/comments/qaj71u/need_advice_asap_anxious_af_about_missing_class/hh3uwsc/",
      "text": "Well you don't say what country you are in, but at least where I'm in in New York\n1. We get sick days, although those are really for if we miss our TA/GA responsibilities. But we get 5 days a semester.\n2. There is an explicit allowance for NOT coming into work if you are getting symptomatic covid testing. You just need to get a note from wherever does the test. \n\nAre these classes taking attendance or something? Does your syllabi specify a maximum number of classes you can miss? If not then I think your anxiety is making things worse for yourself. The only time an undergrad would need an excused absence in any class I've TA'd is I'd they kiss an exam or major deadline. I'd the syllabus says nothing about attendence and you haven't missed any deadlines then I don't see what your problem is. \n\nDO NOT voluntarily take leave. Make them make you do it. I'm betting they can't. \n\nAnd I'm sorry you are going through this. As you are seeing, grad students are treated like students when it's convenient for them and then treated like employees when that is convenient for them.",
      "author": "Pr0gr3s",
      "created": 1634564295,
      "upvotes": 1,
      "replies": {}
    }
  }
}