{
  "sid": "qmrufn",
  "link": "/r/GradSchool/comments/qmrufn/does_taking_classes_after_graduation_help_gpa/",
  "title:": "Does taking classes after graduation help GPA?",
  "text": "So I need to get my GPA up by a minimum of .2 points or better. I want to take classes as a non matriculated student during the winter at the school I graduated from but have been told by the registrar that it has no bearing on undergraduate GPA. I’ve looked online and have found conflicting statements about this. Would taking these classes help me out? I’m in the SUNY system if it’s relevant.\nThanks",
  "author": "mynameizham",
  "created": 1636052464,
  "updated": 1636138120,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hjbx7ng": {
      "link": "/r/GradSchool/comments/qmrufn/does_taking_classes_after_graduation_help_gpa/hjbx7ng/",
      "text": "Classes you take outside of a degree program won't impact your GPA for a degree program you already completed, even if you take the classes from the same school. Graduating effectively \"seals\" a transcript or record, and you can't add onto it from there.",
      "author": "MyName___YourName",
      "created": 1636059026,
      "upvotes": 5,
      "replies": {
        "hjc4al4": {
          "link": "/r/GradSchool/comments/qmrufn/does_taking_classes_after_graduation_help_gpa/hjc4al4/",
          "text": "Agreed. Program is finished. GPA stays. The new classes and improved GPA could help with future admissions and show a progression in studies and GPA. For example, my undergraduate GPA was like a 3.2. I completed a certificate program in a related field after graduation and my GPA in that program was like 3.8. Two separate GPAs but the 3.8 probably helped me look better to grad admissions.",
          "author": "smpricepdx",
          "created": 1636061861,
          "upvotes": 3,
          "replies": {
            "hjd5md1": {
              "link": "/r/GradSchool/comments/qmrufn/does_taking_classes_after_graduation_help_gpa/hjd5md1/",
              "text": "Would you recommend I take the winter classes then or focus on the GRE? This whole thing has been pretty emotionally and mentally taxing and I’m not even in grad school yet.",
              "author": "mynameizham",
              "created": 1636077927,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}