{
  "sid": "fhihfh",
  "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/",
  "title:": "PSA to everyone who may be evicted by their university housing or off-campus housing due to the coronavirus outbreak!",
  "text": "I'm a Crisis Counselor at the Crisis Text Line. You don't have to just use it if you're feeling suicidal. You can use it if you're feeling anxious or depressed about the coronavirus outbreak or any other issue. Feel free to vent out your frustrations and emotions but please know that we're not the experts in your life. Text STEVE to 741741 if you prefer to be with a Crisis Counselor of color.\n\nI'll be on the Crisis Text Line platform starting from 8 PM Eastern Time and I'll probably be on for around four hours.\n\nRegardless of who you get, please leave us crisis counselors some feedback regarding our help and services overall. Please tell us what we can be doing better and what we've been doing well. \n\nThanks!",
  "author": null,
  "created": 1584028489,
  "over_18": false,
  "upvotes": 346,
  "upvote_ratio": 0.97,
  "comments": {
    "fkd5olx": {
      "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkd5olx/",
      "text": "Services like this really helped me when I was younger and dealing with personal trauma and mental illness. Props to those of you who volunteer, hopefully the good karma will go around!",
      "author": "KamalaHarris4Prez",
      "created": 1584069020,
      "upvotes": 3,
      "replies": {}
    },
    "fkcqqxe": {
      "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcqqxe/",
      "text": "Thank you for doing what you do. I've heard some truly heartwarming stories of people who have been at their crisis point, seemingly and the point of no return, but the services that you folks provide being the one thing that pulled them back and ultimately helped hope return.",
      "author": "echotrain",
      "created": 1584058998,
      "upvotes": 3,
      "replies": {}
    },
    "fkc5az0": {
      "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkc5az0/",
      "text": "Are people being evicted from off campus housing at some universities? How is it handled? I imagine a lot of international students for example don't have the resources to just up and find a place to stay.",
      "author": "pur3str232",
      "created": 1584046069,
      "upvotes": 28,
      "replies": {
        "fkc5qfa": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkc5qfa/",
          "text": "Undergrads must be gone by Sunday at Vanderbilt. Some provisions made. But it’s a pretty extreme action.",
          "author": "throwaway__official",
          "created": 1584046311,
          "upvotes": 25,
          "replies": {}
        },
        "fkc7a2q": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkc7a2q/",
          "text": "Depends on the school, and they usually make exceptions for international students/students who can’t go home for whatever reason. At my school (SUNY ESF), they are encouraging students to go home and they get a partial refund for room and board. If they want to stay, they fill out a form, and they ask that those who choose to continue living in the dorms don’t travel then return.",
          "author": "Feisty-Sherbert",
          "created": 1584047188,
          "upvotes": 6,
          "replies": {
            "fkcmwml": {
              "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcmwml/",
              "text": "[deleted]",
              "author": null,
              "created": 1584056530,
              "upvotes": -8,
              "replies": {
                "fkcr1ij": {
                  "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcr1ij/",
                  "text": "Why would they refund them for a whole semester when they've only lived in it for half? I'm reading it as they will be refunded for the portion of the semester they won't be living there. I'm usually a very \"fuck the man\" sort of person, but this seems totally reasonable to me.",
                  "author": "RacecarsOnIce",
                  "created": 1584059191,
                  "upvotes": 7,
                  "replies": {}
                },
                "fkcoy0n": {
                  "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcoy0n/",
                  "text": "We're gonna totally not provide the service you paid for *and* literally kick you out of your home. Here's $20 kid",
                  "author": "GeneralShepard",
                  "created": 1584057823,
                  "upvotes": -2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fkc5f5r": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkc5f5r/",
          "text": "It depends on the students and the landlords so I'm not sure how that's being handled right now.",
          "author": null,
          "created": 1584046134,
          "upvotes": 3,
          "replies": {}
        },
        "fkcorax": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcorax/",
          "text": "At my school we were already on break, and housing (apartments and dorms- we have to live on campus all 4 years) is closed til at least April 5th. They make exceptions for those who absolutely have nowhere else to go, but everyone else needs to find somewhere to be. Most of them home",
          "author": "skelechel",
          "created": 1584057702,
          "upvotes": 2,
          "replies": {}
        },
        "fkcx5xm": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcx5xm/",
          "text": "At my university, exceptions are given to those who do not have alternative housing. You just have to fill out a form. So some undergrads will actually be staying on campus.",
          "author": "SaintLoserMisery",
          "created": 1584063212,
          "upvotes": 1,
          "replies": {}
        },
        "fkfq3wb": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkfq3wb/",
          "text": "Rice undergrads have to be out by end of day the 25th, with some exceptions. Afaik no grad students are being kicked out of the designated grad housing, which is good as that's largely international students.",
          "author": "Abshalom",
          "created": 1584139997,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkbccz0": {
      "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkbccz0/",
      "text": "I feel way worse for undergrads, ngl.",
      "author": "Canidae__",
      "created": 1584030362,
      "upvotes": 185,
      "replies": {
        "fkbdyl0": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkbdyl0/",
          "text": "Agreed. A bug in the dorms is a spark amongst tinder.",
          "author": "Rushderp",
          "created": 1584031234,
          "upvotes": 59,
          "replies": {}
        },
        "fkbhf44": {
          "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkbhf44/",
          "text": "Though I sort of agree, they are mostly of age to still be covered many their parents insurance at least",
          "author": "bitetheboxer",
          "created": 1584033034,
          "upvotes": 23,
          "replies": {
            "fkcqeem": {
              "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcqeem/",
              "text": "Most, yes. All? No. When I was in undergrad I was on my own. I had no other option. I filled my summers with work or school because I was just a kid and I was on my own. Parents were both dirt bags. They mooched off me until I finally stood up for myself and stopped giving them money.\n\nSome young people are going to really suffer if schools kick them out of the dorms. Most won't but the ones who do will probably live out of their cars.",
              "author": "NormalCriticism",
              "created": 1584058771,
              "upvotes": 13,
              "replies": {
                "fkcr1in": {
                  "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkcr1in/",
                  "text": "maybe this is a dumb question, but why can't they just make residence halls quarantine zones (after giving those who want to leave the option, just with the understanding they cannot come back until the all clear) and lock everyone in on campus for a week or two? Campuses with dorms are certainly going to have food services...aside from deliveries and skeleton crews that would need to come in from outside, university campuses seem like ideal quarantine zones.",
                  "author": "echotrain",
                  "created": 1584059191,
                  "upvotes": 4,
                  "replies": {
                    "fkctno0": {
                      "link": "/r/GradSchool/comments/fhihfh/psa_to_everyone_who_may_be_evicted_by_their/fkctno0/",
                      "text": "Legality issues, probably. Can't hold people against their will, especially if they haven't tested positive for anything. Not to say it wouldn't be effective though",
                      "author": "plearbear",
                      "created": 1584060893,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634065032
}