{
  "sid": "qhej2x",
  "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/",
  "title:": "Applying to Grad School Post-COVID",
  "text": "I'm currently an junior in an undergraduate program, and although I recognize I'm jumping the fence here, I was wondering about how the application process would be like. \n\nI graduated from HS May 2020 and spent basically the first year of college locked indoors due to financial issues/me being away from campus. Now that COVID has calmed down a bit and companies have started opening up again, I'm finally able to do things like work opportunities and internships. However, since I am a junior, I really feel lacking about my experience.\n\nI have one paid offer I've done for 3 months and that's about it. Besides my grades (thankfully it's still a 4.0) I really don't have anything else on my resume. Would grad programs recognize how stuff couldn't really happen during COVID or are they just going to be like \"Oh you should have come up with a solution/done something online\".",
  "author": "l33d0ngw00k",
  "created": 1635393965,
  "updated": 1636200384,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hie2bov": {
      "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/hie2bov/",
      "text": ">Would grad programs recognize how stuff couldn't really happen during COVID\n\nThey will be comparing the candidates for their program against each other. So other people are in the same boat as you.\n\nThat being said, you're only a junior. Not a lot of people do things sophomore year to build a CV for grad school. So get busy with it :)",
      "author": "raistlin65",
      "created": 1635434387,
      "upvotes": 2,
      "replies": {
        "hife617": {
          "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/hife617/",
          "text": "The point about the being qualified relative to the applicant pool is spot-on. However, grad school isn't a default next step after undergrad. While grad program admissions will certainly understand the circumstances, OP will also likely be in an applicant pool that includes people a few years out of undergrad who gained experience in the work force---this is true regardless of the pandemic, but the pandemic has given those applicants even more of an edge temporarily.",
          "author": "aggressive-teaspoon",
          "created": 1635453229,
          "upvotes": 1,
          "replies": {
            "hifimsg": {
              "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/hifimsg/",
              "text": ">but the pandemic has given those applicants even more of an edge temporarily.\n\nYeah, I don't see how the pandemic gave any of them an edge. He's a junior. Most people don't do that much sophomore year that builds a CV. The edge they have comes from their work experience if it's any good.\n\nPlus, there will also be people who took a year off from school, who were more greatly impacted by the pandemic.\n\nFinally, the point of him being in the same boat with other people in his graduation year means that admissions will be considering that, if it's worth factoring in.",
              "author": "raistlin65",
              "created": 1635455022,
              "upvotes": 1,
              "replies": {
                "hig9zdb": {
                  "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/hig9zdb/",
                  "text": "Yes, I do indeed mean that people with postgraduate work experience will have an additional edge over straight-out-of-undergrad applicants for some time. Undergrads have been shut out of many opportunities during the pandemic that were still available to full-time workers.\n\nPerhpas I'm just used to thinking this way because having 2-3 years of postgrad experience has been more the norm in my field (biostats) anyway and the standards were already high for going straight into grad school from undergrad.",
                  "author": "aggressive-teaspoon",
                  "created": 1635467368,
                  "upvotes": 1,
                  "replies": {
                    "higdjs6": {
                      "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/higdjs6/",
                      "text": ">Undergrads have been shut out of many opportunities during the pandemic that were\n\nOnce again, he's just now a junior. First and second year students don't do a lot of CV building in their field. It's junior year before they have had enough coursework to start doing things.",
                      "author": "raistlin65",
                      "created": 1635469023,
                      "upvotes": 1,
                      "replies": {
                        "higqhan": {
                          "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/higqhan/",
                          "text": "I'm going to chalk our disagreement up to different expectations due to different fields. At least in the fields I have exposure to, it would be unusual to get in to top grad programs straight out of undergrad unless one was already getting practical experience in during the first two years of college, if not earlier.",
                          "author": "aggressive-teaspoon",
                          "created": 1635474937,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hie4q7g": {
      "link": "/r/GradSchool/comments/qhej2x/applying_to_grad_school_postcovid/hie4q7g/",
      "text": "Like previous reply said, you're competing with the rest of the applicant pool.  Unfortunately, the COVID reason doesn't seem to be cutting it.  A lot of labs have been running for a long time now and people are still getting experience, whether we agree with the practice or disagree.  You're not behind though, I would say that you should start reaching out now.  As a junior you could get some good experience before the application cycle begins.\n\n&#x200B;\n\nThat being said, what sort of program are you aiming to go into?  Further, if you haven't had experience in those settings, what makes you feel like you want to go into those fields?  Just food for thought.",
      "author": "idk_witty_username",
      "created": 1635435355,
      "upvotes": 1,
      "replies": {}
    }
  }
}