{"sid": "favx9j", "link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/", "title:": "PI in hell, appropriate for recruitment season", "text": "A PI was knocked down (tragically) by a bus and was killed. Her soul arrived at the Pearly Gates, where St.Peter welcomed her. “Before you get settled in” he said, “We have a little problem…you see, we’ve never had a PI make it this far before and we’re not really sure what to do with you.”\n\n“Oh, I see,” said the woman, “can’t you just let me in?”\n\n“Well, I’d like to,” said St Peter, “But I have higher orders. We’re instructed to let you have a day in hell and a day in heaven, and then you are to choose where you’d like to go for all eternity.”\n\n“Actually, I think I’d prefer heaven”, said the woman. “Sorry, we have rules…” at which St. Peter put the PI into the downward bound elevator.\n\n\nAs the doors opened in Hell she stepped out onto a beautiful golf course. In the distance was a country club; around her were many friends, past fellow PIs, all smartly dressed, happy, and cheering for her. They ran up and kissed her on both cheeks, and they talked about old times.\n\nThey played a perfect round of golf and afterwards went to the country club where she enjoyed a superb steak and lobster dinner. She met the Devil (who was actually rather nice) and she had a wonderful night telling jokes and dancing.\n\nBefore she knew it, it was time to leave. Everyone shook her hand and waved goodbye as she stepped into the elevator. The elevator went back up to heaven where St. Peter was waiting for her. “Now it’s time to spend a day in heaven,” he said.\n\nSo she spent the next 24 hours lounging around on clouds, playing the harp and singing; which was almost as enjoyable as her day in Hell. At the day’s end St. Peter returned. “So,” he said, “You’ve spent a day in hell and you’ve spent a day in heaven”. “You must choose between the two.”\n\nThe woman thought for a second and replied: “Well, heaven is certainly lovely, but I actually had a better time in hell. I choose Hell.”\n\nAccordingly, St. Peter took her to the elevator again and she went back down to hell. When the doors of the elevator opened she found herself standing in a desolate wasteland covered in garbage and filth. She saw her friends dressed in rags, picking up rubbish and putting it in old sacks. The Devil approached and put his arm around her.\n\n“I don’t understand,” stuttered the PI, “The other day I was here, and there was a golf course, and a country club. We ate lobster, and we danced and had a wonderful happy time. Now all there is, is just dirty wasteland of garbage and all my friends look miserable.”\n\nThe Devil simply looked at her and smiled, “Yesterday we were recruiting you, today you’re staff.”", "author": null, "created": 1582901968, "retrieved": 1632845198, "over_18": false, "upvotes": 818, "upvote_ratio": 0.99, "comments": {"fj36w7i": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj36w7i/", "text": "I literally just had my interview with a PI that I'm about to work for as an RA. After the formal interview process with his WHOLE lab, he left me with some of the members to chat and mingle. Then he treated us to lunch. Afterwhich, he told me he would like to offer me the position.\n\nAt the end of the day, I was convinced that he was the nicest human ever, and I am very much looking forward to working with him.\n\nHaving read this...... I am now very slightly concerned that it was all just a facade..", "author": "seeking_for_advice", "created": 1582970370, "upvotes": 7}, "fj2rylt": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj2rylt/", "text": "Spent far too long today cleaning the lab and not running experiments, at the insistence of our PI ahead of visit days. I'm all for cleanliness, organization, no safety violations, etc., but apparently putting things on tables is not what tables are for.", "author": "ssbbgo", "created": 1582952041, "upvotes": 5}, "fj1tdb0": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj1tdb0/", "text": "I came here for the math joke. It was a bit irrational to think that \"PI\" meant the number and not a profession.", "author": null, "created": 1582927330, "upvotes": 14}, "fj1nh4o": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj1nh4o/", "text": "This reminds me of when I joined my research group lol. It was all fun and optimism when I joined. After a while the smoke was gone and it's pretty much hell. Can't wait to graduate 😂", "author": "-arisa-", "created": 1582923732, "upvotes": 7}, "fj18xwr": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj18xwr/", "text": "Is anyone here brave enough to send this to their PI?", "author": "haha_isjoke", "created": 1582915118, "upvotes": 18}, "fj17dzk": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj17dzk/", "text": "> The Devil simply looked at her and smiled, “Yesterday we were recruiting you, today you’re staff.” \n\nOMG. I literally lol'ed.", "author": "False-Guess", "created": 1582914322, "upvotes": 21}, "fj0w6zh": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0w6zh/", "text": "Also works with \"that was the abstract, this is the results\" and \"that was the proposal, now get to work\"", "author": "inspectorG4dget", "created": 1582908756, "upvotes": 117}, "fj0t8nt": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0t8nt/", "text": "I've read this with the subject being a politician. \"Yesterday we were campaigning but today we've already been elected.\"\n\nStill fits here.", "author": "ttblue", "created": 1582907267, "upvotes": 54}, "fj0sjh3": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0sjh3/", "text": "r/TIHI", "author": "ayaPapaya", "created": 1582906858, "upvotes": 5}, "fj0rx90": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0rx90/", "text": "Oh boy", "author": "Krzysiuu", "created": 1582906502, "upvotes": 4}, "fj0r61r": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0r61r/", "text": "Accurate", "author": "segu01", "created": 1582906059, "upvotes": 8}, "fj0qz4j": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0qz4j/", "text": "This should be crossposted to /r/gradadmissions", "author": "campbell363", "created": 1582905947, "upvotes": 130}, "fj0pu0y": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0pu0y/", "text": ":'(", "author": "Astrobrony", "created": 1582905285, "upvotes": 10}, "fj0odqp": {"link": "/r/GradSchool/comments/favx9j/pi_in_hell_appropriate_for_recruitment_season/fj0odqp/", "text": "wow lmao", "author": "AlphaBetablue", "created": 1582904430, "upvotes": 142}}}