{"sid": "gnm3qm", "link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/", "title:": "Proud of myself and wanted to share!", "text": "I just had the semester from hell—my dad died unexpectedly 2 weeks before the world went into pandemic lockdown. I go to school 5 hours away from my family and I remember telling my mom that I just couldn’t do it—I couldn’t finish the semester or my degree which broke my heart because my dad was so proud of me for being in grad school. Because of the pandemic I have not seen the rest of my family for over 2 months (at a time when I really need their support).\nBut I finished out the semester! Kept my 4.0, did my research (still a little behind but oh well), and fulfilled my TA duties. Right on track to finish my masters in December.\nI had days when I couldn’t get out of bed but I still finished the semester strong. If I can do it, y’all can too", "author": null, "created": 1590019136, "retrieved": 1632953799, "over_18": false, "upvotes": 439, "upvote_ratio": 0.99, "comments": {"frd3vba": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frd3vba/", "text": "I'm sorry for your loss :( That's a lot on your plate to deal with and I can't imagine myself in your shoes. Props to you, you're kicking ass despite everything! 👏", "author": "letsaurify", "created": 1590083212, "upvotes": 1}, "frcubbf": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frcubbf/", "text": "I'm sorry for your loss. More power to you op.", "author": "seeker256", "created": 1590078603, "upvotes": 1}, "frcs4gj": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frcs4gj/", "text": "You are strong! You will achieve many more! 😌💛", "author": "Chamodhir", "created": 1590077526, "upvotes": 1}, "frcrtt9": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frcrtt9/", "text": "This makes me feel bad because now I have no excuses.", "author": "VoidingTorment1998", "created": 1590077381, "upvotes": 2}, "frcgmni": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frcgmni/", "text": "I know that feel, I lost my mom recently. Being in social isolation is a real bitch when you're grieving, forget trying to actually accomplish anything! Congratulations man, this is really inspiring.", "author": "DishsoapOnASponge", "created": 1590071760, "upvotes": 1}, "frcbofa": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frcbofa/", "text": "Amazed by all your successes in spite of so much hardship. You are so strong. Hope you get to hug your mom soon.", "author": "dustonthedash", "created": 1590069028, "upvotes": 1}, "frc3mbt": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frc3mbt/", "text": "Wow, good job! This is weird to say but I’m almost in the exact same boat. My dad passed away right before the shit hit the fan too. Family lives across the country and grad school is challenging without all of this other stuff. You fared better than me....I was taking only two classes at the beginning of the semester because they were the only two that would count towards anything at the moment, but after everything that happened I ended up falling behind in and dropping one of them. Basically the same shit that happened to me finishing off strong is damn impressive. Mad respect.", "author": null, "created": 1590063829, "upvotes": 4}, "frbxvh3": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frbxvh3/", "text": "I am sorry for your loss. \nBut you did it! Thank you for sharing this here. This gives me so much motivation to finish my semester. Much love and good wishes! 💜", "author": "eshe2019", "created": 1590059010, "upvotes": 3}, "frbs0qj": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frbs0qj/", "text": "I am so happy for you. This is the kind of post I love seeing on this thread! Grad school is fucking tough and despite everything, you have pulled through so well.  You give me so much inspiration :)", "author": "marauder227997", "created": 1590053149, "upvotes": 3}, "frbq8xf": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frbq8xf/", "text": "I read this and literally had a lump in my throat.\n\nI have been where you are, not in grad school (tech school), but yeah. It’s so hard. I finished eventually, went on to undergrad, then recently finished grad school). I know EXACTLY how you are feeling. \n\nI am SO PROUD of you. You’re gonna do AWESOME!", "author": "jeninjapan", "created": 1590051327, "upvotes": 1}, "frbomas": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frbomas/", "text": "You're doing fantastic. Really appreciate your willingness to share your hardship for others.", "author": "nothing_to_be", "created": 1590049682, "upvotes": 1}, "frbh93p": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frbh93p/", "text": "My condolences to you and your family. If you ever need a random stranger to talk to, I’m here. Thanks for being a true inspiration. More power to you!", "author": "Rao-dy", "created": 1590042603, "upvotes": 3}, "frbe78d": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frbe78d/", "text": "Sorry for your loss. May you and your family get through this hard time. \nBesides that This was such a pleasure to read 💕", "author": "thankingyouu", "created": 1590039871, "upvotes": 1}, "frbcxic": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frbcxic/", "text": "Honestly don't know how you did it but big, huge, massive congrats. Now, get some rest.", "author": "pheebspheeb", "created": 1590038789, "upvotes": 3}, "fraxqld": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/fraxqld/", "text": "I'm so sorry for your loss. I can't imagine how hard it is to be so far from family at a time like this. But congratulations on your achievements this semester! That's truly remarkable and you should be so proud of yourself.", "author": "naughty_bunny", "created": 1590028415, "upvotes": 5}, "fravohw": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/fravohw/", "text": "This is inspiring! What field? Sorry about your loss......", "author": "anarcho-geologist", "created": 1590027210, "upvotes": 9}, "fratydv": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/fratydv/", "text": "I don’t even know if I could do all of that WITHOUT the loss of a family member, much less at the same time as trying to deal with the loss of my dad. Kudos to you, you deserve it! Your dad is smiling down on you!", "author": "kaw3731", "created": 1590026220, "upvotes": 20}, "frasz7i": {"link": "/r/GradSchool/comments/gnm3qm/proud_of_myself_and_wanted_to_share/frasz7i/", "text": "I'm so sorry for your loss. I'm awed by your dedication, and I hope that it's soon safe for you to be reunited with family.", "author": "FunctionalAdult", "created": 1590025665, "upvotes": 56}}}