{
  "sid": "q6sbuh",
  "link": "/r/GradSchool/comments/q6sbuh/should_i_apply_for_nsfgrf_senior_undergrad_who/",
  "title:": "Should I apply for NSFGRF? Senior undergrad who found out about the fellowship two weeks ago",
  "text": "I am applying for a PhD in ecology for entry Fall 2022. A bunch of professors I've talked with have said I should apply for the NSFGRF, and that I'm competitive for it, but I only found out about it a couple weeks ago and really don't think I'm going to be able to put together a competitive application in the amount of time I have left. It's taking an enormous amount of time and I also work full time and am trying to email and talk with professors in the meantime. I've drafted a decent personal statement but flat out don't think I have time to do the proper research to put together a competitive research proposal. I have some general ideas of what i want to study in grad school but putting together a specific research proposal is more than I have time for currently. I'm thinking about withdrawing and then just looking at this experience as really great prep for when I apply when I'm actually in grad school. If I do submit something this cycle it really won't be my best work and I'll have killed myself trying to get there - just doesn't super feel worth it. Thoughts?\n\nI only seriously considered applying because so many of the professors I have talked with said they don't have funding, but if I got this fellowship they'd support me. I do have really strong leads with a few profs who do have funding however. ",
  "author": "AnxiousSuccotash7",
  "created": 1634062844,
  "updated": 1634099451,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hgduujl": {
      "link": "/r/GradSchool/comments/q6sbuh/should_i_apply_for_nsfgrf_senior_undergrad_who/hgduujl/",
      "text": "For the NSF GRFP, you can apply once before grad school and once during the beginning. You are not likely to get the same reviewers between the two, so I don't think you will have any drawbacks if your first application is not strong.\n\nI would be most concerned about if your recommendation writers would view you asking now as a problem. They are likely to be some of your recommenders for your grad school application as well. I would discuss with them if it is too late, and if not, then see how much you can do.",
      "author": "Blaidd-XIII",
      "created": 1634063292,
      "upvotes": 11,
      "replies": {}
    },
    "hgf3qay": {
      "link": "/r/GradSchool/comments/q6sbuh/should_i_apply_for_nsfgrf_senior_undergrad_who/hgf3qay/",
      "text": "Applying before you start grad school is a \"freebie\", it's a good way to get feedback so your second chance is stronger (because otherwise you just get one).\n\nThat said, put yourself and your grad apps themselves first. The odds are pretty slim, so probably not worth jeopardizing the others by not spending enough time on them.",
      "author": "mediocre-spice",
      "created": 1634082215,
      "upvotes": 3,
      "replies": {}
    },
    "hgfnab7": {
      "link": "/r/GradSchool/comments/q6sbuh/should_i_apply_for_nsfgrf_senior_undergrad_who/hgfnab7/",
      "text": "I put together a good enough entry-level application to win a prestigious national undergraduate fellowship in a single weekend.    Talked to the people that ran the fellowship on Friday, they said “you know the first part is due Monday, right?”  I passed the first round and went on to win one.\n\nIt’s a all a matter of how much you care and how hard you can push.\n\nYou’ll never know if you could do it unless you push for it.  If you come up short and gave it your all, then you’re really prepared for the process next year 🙂\n\nEdit:  to tack onto that, I nearly boarded a plane to fly in my transcript in person, the day it was due at 5:00pm, when I applied to the NSFGRFP the following year, because I didn’t know you had to mail in a formal copy of it and that took time to process.\n\nTurned out after calling frantically that morning on the 4 hour drive to the airport that they were fine receiving it late if I had the rest in on time.  Went home and over-nighted it instead.\n\nIf you think you can win, you do whatever is in your power to get it done.  At least then you know you tried.",
      "author": "Weekly-Ad353",
      "created": 1634091299,
      "upvotes": 1,
      "replies": {}
    }
  }
}