{
  "sid": "qbq4p3",
  "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/",
  "title:": "Anyone miss their undergraduate school?",
  "text": "Title. I really miss my old school.  I'm in my first semester of a kinesiology program in the US. I can't seem to connect with my graduate school. I don't know if it's I genuinely don't like it here or if I just miss all my friends. Has anyone else had this experience?",
  "author": "Buick117",
  "created": 1634694143,
  "updated": 1636199242,
  "over_18": false,
  "upvotes": 64,
  "upvote_ratio": 0.98,
  "comments": {
    "hhbao7q": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbao7q/",
      "text": "I think there's just a whole different culture being in grad school. I feel pretty attached to my undergrad because I had a wide network and explored the entire campus. In grad school, I only know my department and our one building. I don't necessarily feel the need to change that, but it does kind of feel like being a stranger on campus.",
      "author": "72-27",
      "created": 1634696300,
      "upvotes": 59,
      "replies": {
        "hhcinrg": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhcinrg/",
          "text": "Yes, this is exactly how I feel, especially the part about being a stranger on campus",
          "author": "somilikeit",
          "created": 1634727799,
          "upvotes": 7,
          "replies": {}
        },
        "hhd2n3i": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhd2n3i/",
          "text": "Me too, I feel like I go here but I’m just in my own little world.",
          "author": "Buick117",
          "created": 1634738772,
          "upvotes": 3,
          "replies": {}
        },
        "hhd7kmw": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhd7kmw/",
          "text": "Yeah, I second this.",
          "author": "TheRealDrRat",
          "created": 1634740964,
          "upvotes": 1,
          "replies": {}
        },
        "hheam8s": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hheam8s/",
          "text": ">In grad school, I only know my department and our one building\n\nyup. I literally only ever go to three buildings on campus. The physics building where I take my classes and take comps, the space sciences building where I do my research, and the heath center where I refill my prescriptions/get regular medical appointments. That's kinda it.",
          "author": "DoctorWatchamacallit",
          "created": 1634756603,
          "upvotes": 8,
          "replies": {}
        },
        "hhe1qr5": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhe1qr5/",
          "text": "That's why it would be best to explore all the buildings in the uni even as a grad student :)",
          "author": "inklingt",
          "created": 1634753040,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhbjoy8": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbjoy8/",
      "text": "Not to say I don’t enjoy my grad institution, but my undergrad one was my second home for so long. It was where I met a majority of my mentors and found my passion for what I currently study. I struggled with connecting too, but it helped to join dept. specific clubs and make an effort to hang out with classmates. I say make an effort because it’s so easy to want to stay inside after a long week of classes/research/work.",
      "author": "SassMasterCass99",
      "created": 1634700935,
      "upvotes": 10,
      "replies": {}
    },
    "hhbv4ul": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbv4ul/",
      "text": "Honestly, feeding off of the other comments here, I think that grad school really isolates you and it makes it hard to connect with others since you're just talking to people in your specific area(s). On top of the fact that everyone is so freaking busy, you can't connect even if you want to sometimes, as everyone has packed calendars, and then need to recuperate in their free time. I've definitely felt the same way as you, OP, starting in Covid (I'm a 2nd year now) hasn't done anyone any favors.",
      "author": "PhoenixInfinity88",
      "created": 1634707901,
      "upvotes": 8,
      "replies": {}
    },
    "hhbwbsq": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbwbsq/",
      "text": "I actually prefer my grad school way more. I wish I went to undergrad here too.",
      "author": "phdreaming234",
      "created": 1634708779,
      "upvotes": 6,
      "replies": {
        "hhe1ejy": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhe1ejy/",
          "text": "Same here. I went from a small private institution to a large, state-related one and the culture seems so much different. Definitely seems a lot less toxic.",
          "author": "RunningDrummer",
          "created": 1634752903,
          "upvotes": 5,
          "replies": {}
        },
        "hheb1o3": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hheb1o3/",
          "text": "yeah, I don't miss my undergrad school, I miss \\*being\\* an undergrad and wish I had been an undergrad here too.\n\nTruth be told my small catholic private commuter school was a horrible choice for me as a physics major, and I would have benefitted from a large state school with a lot more opportunities to get involved in research as an undergrad and take a wider variety of classes. Also not being in a conservative catholic environment would have been nice considering I am LGBT. The R1 state school I am in my PhD at with a lot of resources for the type of physics I love and a large variety of coursework would have been \\*much\\* better for me to have been an undergrad at.\n\nIf I'm being honest, pretty much all of my happy memories from undergrad are actually \\*not\\* from my actual home institution, but when I was away, either during my study abroad, or during my summer internships.",
          "author": "DoctorWatchamacallit",
          "created": 1634756778,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhbwfo9": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbwfo9/",
      "text": "Grad school is more like a job than college.",
      "author": "fwafwa",
      "created": 1634708861,
      "upvotes": 5,
      "replies": {}
    },
    "hhbwakc": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbwakc/",
      "text": "I lived in my undergrad college town and now I’m in a 100% online grad program at another school and I just feel so separate from it all :-/",
      "author": "wizardkelly_",
      "created": 1634708752,
      "upvotes": 5,
      "replies": {
        "hhg14u2": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhg14u2/",
          "text": "It's very sad. Some of my friend got mental break down.",
          "author": "BenL90",
          "created": 1634783774,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhcvqkg": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhcvqkg/",
      "text": "I feel this! I think for me it's because undergrad is where I found myself, and grad school is where I lost myself 😂. Even though my grad school is more prestigious and the sports teams are in better divisions/higher ranked, I don't have any interest in going to games, yet trek back to my undergrad school to go to football games once a year. Grad school doesnt really make me feel like a part of the campus community, and I don't identify with the undergrads here at all.",
      "author": "souperpun",
      "created": 1634735579,
      "upvotes": 5,
      "replies": {
        "hhd2h9d": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhd2h9d/",
          "text": "This! I was in a huge department at my undergrad university and had friends in other departments as well. Here, the school is mostly art and music students and I just don’t identify with that.",
          "author": "Buick117",
          "created": 1634738698,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhbf5xz": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbf5xz/",
      "text": "Yep. My small undergrad institution had more of a lasting impression on me compared to the big named school I attended for my MS. Grad school can make one feel so isolated :/",
      "author": "MotherHighway3357",
      "created": 1634698524,
      "upvotes": 3,
      "replies": {}
    },
    "hhcicjb": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhcicjb/",
      "text": "No but I had a rough time in undergrad",
      "author": "Sriracha11235",
      "created": 1634727566,
      "upvotes": 3,
      "replies": {}
    },
    "hhbn3w3": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbn3w3/",
      "text": "I mostly miss the lab and class culture at my old school. I had a few friends in my major who I was in nearly every class with, so we studied together all the time, and my lab had a lot of really cool people that I spent a lot of time talking to. Now I mostly work by myself and connecting with people in the department has been difficult.",
      "author": "DADPATROL",
      "created": 1634702794,
      "upvotes": 2,
      "replies": {}
    },
    "hhbqe2r": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhbqe2r/",
      "text": "I absolutely miss my undergrad school. It was community based and the professors called you a “colleague” instead of seeing you as second rate and truly cared how you were doing. My grad school just makes you take an online module saying we’re “healthy”. I fit in with my undergrad school way better.",
      "author": "According_Age8997",
      "created": 1634704740,
      "upvotes": 2,
      "replies": {}
    },
    "hhdj70o": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhdj70o/",
      "text": "My experience is a little different because I go to the same school as I did for undergrad, but I can’t even imagine trying to make all new connections on top of everything else. It’s hard enough maintaining existing relationships and finding enough time in the day to be social. I do miss the new sense of freedom I had in undergrad though. Moving to a new city and finally feeling like an adult was great, especially since I had so much less responsibilities than I do now. I don’t miss my undergraduate education though. A lot of times i would think “why am I doing this, I’ll never need to know this!” Now that I’m in grad school, everything I learn feels like it matters and I love that.",
      "author": "anthrogorl",
      "created": 1634745716,
      "upvotes": 2,
      "replies": {}
    },
    "hhctsjq": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhctsjq/",
      "text": "My two years in community college were the best years of my academic career. I miss it all the time",
      "author": "Internal-Bear-8184",
      "created": 1634734595,
      "upvotes": 1,
      "replies": {}
    },
    "hhd77w0": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhd77w0/",
      "text": "Ok I’m glad to see I’m not the only one! I don’t have any friends here so I can’t really talk to anyone about it. I’m going to a super artsy school where a lot of the undergrads are music students and I’m here for sports so I don’t think that helps. Thanks for responding everyone and thanks for the award! Good luck this semester!!!",
      "author": "Buick117",
      "created": 1634740816,
      "upvotes": 1,
      "replies": {}
    },
    "hhd7hql": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhd7hql/",
      "text": "I definitely do. I haven’t been in undergrad for a real long time now but still think about it sometimes. I went to a catholic school and the bells used to ring there - the school I’m in now is far from catholic just some hardcore science school. Anyway, I thought I heard bells on campus yesterday and it made me think of the nice ambience that my undergrad school had. I’m not catholic by the way it’s just the campus was real beautiful, small, relaxing. Now I’m in such a busy loud huge campus, but I don’t hate it either..",
      "author": "TheRealDrRat",
      "created": 1634740932,
      "upvotes": 1,
      "replies": {}
    },
    "hhdcq9h": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhdcq9h/",
      "text": "Definitely. I'm a 6th year PhD student and although I I happy with my program and my graduate school. I don't have the emotional connection to it I did to my undergraduate school. Undergrad is where I made two of my best friends, really become and adult independent from my parents, and have so many great memories. Graduate school just feels like a job. I dont have any strong feelings toward the school and when I leave I don't think I'll be sad.",
      "author": "PaperPhD",
      "created": 1634743106,
      "upvotes": 1,
      "replies": {}
    },
    "hhdh09x": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhdh09x/",
      "text": "I don't miss the undergrad academic life but I miss my dorm life. I miss the freedom, i miss the roof where i spend so many nights. I miss eating out during midnight. I miss that independent life. 🙂",
      "author": "JulioReese",
      "created": 1634744836,
      "upvotes": 1,
      "replies": {}
    },
    "hhdj8dm": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhdj8dm/",
      "text": "I was in a different stage of life when I started undergrad, so it left a much bigger impression on me than where I went for my masters or currently my PhD. In undergrad I didn't have many financial responsibilities, made friends, joined clubs, lived on campus, and got immersed in D2 sports (lol). Despite going to much larger D1 schools for my masters and now my PhD, those feelings just aren't there. I'm on campus once or twice a week if even that, I work full time, I'm getting married next year, more responsibilities, etc. Just makes it difficult to invest in the institution beyond \"I'm only here to get a degree and leave\".",
      "author": "Reductate",
      "created": 1634745731,
      "upvotes": 1,
      "replies": {}
    },
    "hhdnay7": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhdnay7/",
      "text": "I miss my undergrad school, like, weekly. It was such a good place and a cool place and an encouraging place.\n\nIn grad school, we were pretty much confined to one dark, old, run-down building for everything, didn't even have a real cafeteria or anywhere to collaborate or meet people in other disciplines to cross-pollinate ideas. My grad school was also primarily known for being an undergraduate school, so grad students were always a bit of an afterthought.",
      "author": "NotSkinNotAGirl",
      "created": 1634747344,
      "upvotes": 1,
      "replies": {}
    },
    "hhdpb8s": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhdpb8s/",
      "text": "I'm a grad student at my undergrad and I miss undergrad. Culture is different rand much more isolating.",
      "author": "justapoliscimajor",
      "created": 1634748125,
      "upvotes": 1,
      "replies": {}
    },
    "hhds4fp": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhds4fp/",
      "text": "[removed]",
      "author": null,
      "created": 1634749221,
      "upvotes": 1,
      "replies": {}
    },
    "hhds7j8": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhds7j8/",
      "text": "Yes. I went for a huge Big 10 state school (50k students) to a medium sized private school (15k students) and don’t feel like i’m part of this new school at all. I only interact with people in my program, and it’s not that I don’t like my peers, I just know we won’t become friends. I really miss going to football and basketball games with my friends and our late night adventures around campus, but i don’t have anyone here to do that with.",
      "author": "brockhamptons_bitch",
      "created": 1634749254,
      "upvotes": 1,
      "replies": {
        "hhexzlb": {
          "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhexzlb/",
          "text": "I went to a Big 10 state school of 50k students as well! And I can completely relate to this. I miss the campus culture, the games, the school spirit... just so many things I know I'll never get to have again in the same way. The pandemic started my senior so I never got a real graduation and still haven't been able to find closure.",
          "author": "xoxo_yana",
          "created": 1634765914,
          "upvotes": 1,
          "replies": {
            "hhfys2g": {
              "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhfys2g/",
              "text": "Pandemic started my junior -> senior year so my last year was completely ripped away from me",
              "author": "brockhamptons_bitch",
              "created": 1634782654,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhfhk6i": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhfhk6i/",
      "text": "Nope",
      "author": "the_stang_boy",
      "created": 1634774737,
      "upvotes": 2,
      "replies": {}
    },
    "hi3ut8t": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hi3ut8t/",
      "text": "For me it’s a mixed bag. I loved my undergrad institution except for a few toxic profs. I miss my friends there. On the other hand, my grad institution has very kind faculty,while I’m finding it hard to network with the grad students. I guess you can’t always have your cake and eat it too. You just have to settle for something in between.",
      "author": "Mega_Dragonite96",
      "created": 1635251636,
      "upvotes": 2,
      "replies": {}
    },
    "hhdwdoo": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhdwdoo/",
      "text": "I feel nostalgic for undergrad sometimes, but then I really stop to think about it and remember it wasn't actually that great. It was good, but not as great as my memory makes it out to be.",
      "author": "KiwiTheKitty",
      "created": 1634750904,
      "upvotes": 1,
      "replies": {}
    },
    "hhe19ju": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhe19ju/",
      "text": "Honestly, I miss the people and some of the faculty/staff, but I've come to dislike my undergrad institution as a whole. I'm in an MEd program where I've tried reaching out to them for projects and to gather some pretty basic data and they just suck at either replying or giving clear answers. In fact, I've decided that when I look for a job after getting my master's, my undergrad institution will be near the bottom of my job search list.\n\nI did take a few weeks to completely adapt to the new environment, which definitely went smoother with a patient group of instructors and a bunch of others in my cohort hosting events after a while. If no one in your cohort is doing these things, you should. Host mini get-togethers, meet up at bars or restaurants, anything to get to know who you're sitting next to outside of class work.",
      "author": "RunningDrummer",
      "created": 1634752845,
      "upvotes": 1,
      "replies": {}
    },
    "hhe5w5q": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhe5w5q/",
      "text": "I also think that it has to do with the pandemic. Most of us who are in grad school now were in undergrad pre-pandemic. Even though many restrictions are lifted on campuses (at least in the US) and most classes are in-person now, campuses just don't feel the same as before in terms of being spaces of spontaneity, robust social interaction, and regular interaction with professors outside of the classroom. This, combined with the fact that campus life is always diminished for graduate students compared to undergrads, gives me similar nostalgia (even though my grad institution is, in normal times I think, much closer to my vibe than the place I attended undergrad was).",
      "author": "rulesaremultiform",
      "created": 1634754710,
      "upvotes": 1,
      "replies": {}
    },
    "hhea1ey": {
      "link": "/r/GradSchool/comments/qbq4p3/anyone_miss_their_undergraduate_school/hhea1ey/",
      "text": "I miss \\*being\\* an undergrad, not my undergraduate institution. Honestly, my undergrad institution sucked as a choice for me. Their physics program was really emaciated and I ended up screwing myself over by going there in a program where half the standard physics undergrad coursework wasn't even offered, forcing me to take a bunch of undergrad classes during my masters to make up for it before moving to my PhD.\n\nPlus, It was a small catholic commuter school and I was a closeted trans woman at the time. My social life wasn't exactly great  because of it, and the vast majority of my fun times and social bonding during undergrad actually came from summer internships and study abroad programs rather  than genuine campus connection and bonding. \n\nIf anything, I wish I had been an undergrad at a different institution, and honestly my grad institution is a \\*much\\* better choice for me than my undergrad was. \n\nBut yeah... I've told my therapist this before, but the problem with grad school is we have all the teaching research responsibilities of faculty, the coursework responsibilities of undergrads, and the privileges of neither. We are alienated from the campus and social life of undergrads, and don't have the status or financial security of tenured faculty either. It's a very socially isolating experience, and honestly I'd probably be in a much worse mental state if not for the intervention of my boyfriend who lives with me.",
      "author": "DoctorWatchamacallit",
      "created": 1634756374,
      "upvotes": 1,
      "replies": {}
    }
  }
}