{
  "sid": "q2u3i6",
  "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/",
  "title:": "Do Grad Schools care where you did your undergrad?",
  "text": "I'm an undergrad currently attending a somewhat prestigious (?) state school, or at least that's what I've been told. I have been looking to transfer to a T-25 school for next fall, and hope to do a PhD after I graduate. \n\nI was pretty fixed on transferring schools, however, I just got a research position at a lab that researches something related to my career plans. They offered me the opportunity to co-author a paper, but this is contingent on me dedicating at least a year to the project, to get some meaningful data. \n\nI know that the school I'm seeking to transfer to has many amazing labs in my area of interest --that is why I want to go there. But I feel that I may be wasting a decent opportunity to fully develop a research project, trying to please an admissions officer who may not even care.  \n\nSo, the question is, should I stay at my current school, or would it look better if I transferred to a more prestigious university?\n\nTIA!",
  "author": "AmericanF3A",
  "created": 1633556123,
  "updated": 1634099862,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hfoy3eo": {
      "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfoy3eo/",
      "text": "Not really, it’s all about what you did in undergrad, not where you did it. \n\nStudents at elite undergrad institutions are probably generally more serious students who are more likely to pursue academic opportunities, and elite institutions generally will have more institutional support and opportunities to take advantage of. They also have a potential advantage that their professors who write their letters of recommendation are more likely to be known to the admissions committee. \n\nIf you’re a serious student with some decent enough mentorship and good research opportunities that you’re taking advantage of though, I think it matters very little where you went to undergrad.\n\nIf it came down to having a diploma from a more prestigious undergrad institution or having a publication, the publication is going to go a lot further in getting you into grad school.",
      "author": "ThrowawayHistory20",
      "created": 1633580883,
      "upvotes": 10,
      "replies": {}
    },
    "hfp3jb9": {
      "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfp3jb9/",
      "text": "Yes, it matters but not the ranking per se. At the top schools, students are generally stronger and have opportunities to work on hot projects with famous professors. Getting a strong recommendation from a Nobel laureate-class professor is hard to beat.",
      "author": "fwafwa",
      "created": 1633584368,
      "upvotes": 3,
      "replies": {}
    },
    "hfnok11": {
      "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfnok11/",
      "text": "It depends. If it’s a top 5, sure. If it is 30 versus 60 probably not.",
      "author": "LegallyThrownFarAway",
      "created": 1633557918,
      "upvotes": 6,
      "replies": {
        "hfo40do": {
          "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfo40do/",
          "text": "This is not true.",
          "author": "MOUDI113",
          "created": 1633565370,
          "upvotes": 0,
          "replies": {
            "hfo7yld": {
              "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfo7yld/",
              "text": "Why?",
              "author": "AmericanF3A",
              "created": 1633567221,
              "upvotes": 1,
              "replies": {
                "hfoarjb": {
                  "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfoarjb/",
                  "text": "Because my friends and I went to a school that every1 shits on for undergrad. Most of us now received PhD from top programs. It all depends on what you do in school... Looking back, I would advise you to enroll in a PhD program that best fits you and where you will be most happy.",
                  "author": "MOUDI113",
                  "created": 1633568533,
                  "upvotes": 3,
                  "replies": {
                    "hfozbqk": {
                      "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfozbqk/",
                      "text": "I think you misinterpreted his comment. He's saying that being in a top 5 school will look good, otherwise, they won't even consider the school you went to. Ultimately, everyone is in an even playing field when it comes to your undergrad school.",
                      "author": "Shinie_a",
                      "created": 1633581550,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "hfoavlk": {
                      "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfoavlk/",
                      "text": "Thanks for the advice!",
                      "author": "AmericanF3A",
                      "created": 1633568586,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hfq4oj9": {
              "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfq4oj9/",
              "text": "It’s definitely sometimes true man. We take that into account in preparation. It’s a field in the spreadsheet to help account for a programs rigor.",
              "author": "LegallyThrownFarAway",
              "created": 1633612850,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfq4inz": {
      "link": "/r/GradSchool/comments/q2u3i6/do_grad_schools_care_where_you_did_your_undergrad/hfq4inz/",
      "text": "If you get in,no one cares.Just to get in,not sure.I think if you are from top 15-20 then you will be treated favourably in the first screening but after the interviews start, university does not matter.I heard just one case where it mattered.If you are  interviewed by the professor who attended your university at some point,they digress and ask you minor questions and of course if no harsh questions are asked,you are more or less through.",
      "author": "Success-Useful",
      "created": 1633612771,
      "upvotes": 1,
      "replies": {}
    }
  }
}