{"sid": "eybjax", "link": "/r/GradSchool/comments/eybjax/writing_an_email_when_i_might_be_missing_class/", "title:": "Writing an email when I might be missing class?", "text": "I might have to miss class this week. I wrote this but haven't sent it yet. It is my first year in Medical school and I don't want to mess it up:\n\nDear Professor,\n\nMy Great Uncle is in the hospital right now and it's not looking good. If, God forbid, he dies in the next couple days before Thursday, then I will miss class next Tuesday for the funeral. If he dies on Friday or Saturday, then I will miss class on Thursday. I hope he can make it, but I am letting you know in advance just in case he doesn't. You know how important Medical School is to me, but unfortunately this is out of my control. I understand that this is an inconvenient time, but I can make the class up if necessary. If he can't make it past Saturday, then I can be on call the next class I am in. If he makes it past Saturday, and dies next week then the funeral will probably be on a Monday or Wednesday so I would not be missing class. However, it is impossible to know at this time if the funeral will be on a Tuesday or Thursday if he dies after two weeks from today. I will keep you in the know. Thank you for understanding.\n\nLove,\n\nStudent", "author": "dennismiller2024", "created": 1580755011, "retrieved": 1632846001, "over_18": false, "upvotes": 327, "upvote_ratio": 0.97, "comments": {"fry8ahd": {"link": "/r/GradSchool/comments/eybjax/writing_an_email_when_i_might_be_missing_class/fry8ahd/", "text": "This is beautiful", "author": "ElonTheRocketEngine", "created": 1590557114, "upvotes": 1}, "fgj8wp4": {"link": "/r/GradSchool/comments/eybjax/writing_an_email_when_i_might_be_missing_class/fgj8wp4/", "text": "Nice cringe post", "author": "CapitalistVenezuelan", "created": 1580839297, "upvotes": 2}, "fgh3ygu": {"link": "/r/GradSchool/comments/eybjax/writing_an_email_when_i_might_be_missing_class/fgh3ygu/", "text": "I'd say something like this:\n\n\"Dear Professor,\n\nI just wanted to give you a heads up that I may miss class in the next week or so. A family member is in the hospital and could be serious. I will let you know if the situation changes and will contact some classmates regarding missed lectures or assignments.\n\nThank you,\n\nMe\"\n\nI feel like your draft is a big long and contains information that is honestly none of the instructor's business. I find it's better to keep it simple and you can choose to disclose more later depending on the context or whether it's appropriate (i.e. if, god forbid, your family member passes away then you may mention missing class for a funeral but if he hasn't yet then there's no need).", "author": "False-Guess", "created": 1580776129, "upvotes": 6}, "fggxcfz": {"link": "/r/GradSchool/comments/eybjax/writing_an_email_when_i_might_be_missing_class/fggxcfz/", "text": "Overshare big time.  Just say.  \"Due to a family emergency I will be taking leave.  Due to the nature of the emergency it is not clear when I may return but I will keep you appraised of the situation.  My standing at the school is important to me but I need to do this for my family.\n\nThank you for understanding\"\n\nDo not go on and on about who in your family is about to die and possibly when.  Also don't sign it off \"Love\", this should be professional...don't bring emotion into it.", "author": "Grevious47", "created": 1580771672, "upvotes": 5}, "fggvflz": {"link": "/r/GradSchool/comments/eybjax/writing_an_email_when_i_might_be_missing_class/fggvflz/", "text": "Troll post", "author": null, "created": 1580770444, "upvotes": 16}, "fgg8lp8": {"link": "/r/GradSchool/comments/eybjax/writing_an_email_when_i_might_be_missing_class/fgg8lp8/", "text": "You really don’t need to include that much detail (what specific day he may die). It’s a bit morbid and TMI for someone who you don’t have a close relationship with. I would be very uncomfortable receiving this from a student. \n\nI would simply write that an immediate family member is in the hospital and you are expecting the final visitations and funeral within the coming week/s. And that you will let them know ASAP if you will be missing anything and will arrange to make it up. \n\nAlso email the deans office with the same info, they will help you with arrangements. I had to go through the same process when my brother died, schools have grieving procedures in place generally. \n\nAlso don’t sign off with “love, x”. I always use “Thanks, X” or something along those lines. I mean, you can use love, but it sounds more like a romance letter or letter to your mom than a colleague/professor.", "author": "Contntlbreakfst", "created": 1580756589, "upvotes": 27}}}