{
  "sid": "qmablm",
  "link": "/r/GradSchool/comments/qmablm/how_do_i_determine_if_im_a_competitive_applicant/",
  "title:": "How do I determine if I’m a competitive applicant for a doctoral program?",
  "text": "Spring 2022 is my last semester for my M.Ed. and I am planning on continuing on to do a Ed.D. in Educational Leadership & Policy. While doing research and trying to decide what programs to apply to, I have found it very difficult to find admission stats from the previous years.\n\nDoes anyone know of any resources to help find doctoral admission stats?\n\nI was trying to decide what programs to apply to based on how competitive I was compared to everyone else.\n\nThank you!",
  "author": "CammyXOX",
  "created": 1635991630,
  "updated": 1636138132,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hj8fcfd": {
      "link": "/r/GradSchool/comments/qmablm/how_do_i_determine_if_im_a_competitive_applicant/hj8fcfd/",
      "text": "I think it’s a free for all in the sense you can be a fantastic candidate and not get in, and kind of a wild-card and get in. I think a huge determinant is the faculty you want to work with - and if they want students/to work with you. If you reach out to many advisors they can give you previous candidates profiles, but most universities have that on their website.",
      "author": "SJserenity",
      "created": 1635992461,
      "upvotes": 5,
      "replies": {}
    },
    "hj98gaa": {
      "link": "/r/GradSchool/comments/qmablm/how_do_i_determine_if_im_a_competitive_applicant/hj98gaa/",
      "text": "I think you need to find a faculty mentor, especially a relatively recent hire. They'll know your field and specialty better than random people on Reddit, and may even help you network with their friends at other schools. 🙂\n\nIn my experience, PhD admissions are unpredictable using almost any numerical score. Schools reject people with perfect GPAs, GREs, and recs for those below the minimum threshold. People from top 10 schools don't get into top 50 schools, and people from regional ones get into top 10 schools all the time. I'm not sure you'll find reliable admission data For PhD programs online.",
      "author": "roachRancher",
      "created": 1636011351,
      "upvotes": 2,
      "replies": {}
    }
  }
}