{"sid": "gjj429", "link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/", "title:": "Need Venting. If any professor is reading this: please do not praise students keeping their presentations much longer than you said it should be because it covers more. It is unfair and an obvious sign of obliviousness. It is nonsense", "text": "\nPlease. If you tell your students to keep their presentations at a certain length, do not praise the ones who go above the set time limit by half an hour and praise their work for its depth. This has happened to me second time now. My professor asks me to cover one of the most controversial and comprehensive subjects in social sciences in 10 minutes and rolls their eyes for it not having elaborated enough in certain aspects while praising the 40-minute-though-supposed-to-be-10-minute presentation of my classmate for covering more on the same subject.\n\nIf there are any professors reading this; please don't do this. Some students put a lot of work into making the damn presentation as concise as possible and literally rehearse a few times so that they do not go over the time limit. Covering more by going waaaay above the limit you yourself set is not something to be encouraged. Nor is it fair.", "author": "matkapriza", "created": 1589448936, "retrieved": 1632953200, "over_18": false, "upvotes": 896, "upvote_ratio": 0.97, "comments": {"fqvrjmk": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqvrjmk/", "text": "The heck. In our dept we get maybe 5 min on a 40min talk if you run over but otherwise they just stop you. Like, no. Read the damn requirements. Same with reports/papers", "author": "blackygreen", "created": 1589683576, "upvotes": 1}, "fqutnsj": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqutnsj/", "text": "Yes this! I always give groups 30 seconds to one minute over without docking points. I’ll let them finish if it’s not going to be too much over (3 or so minutes) but if they’re 40min long when it should be 10mins I would end the presentation. They obviously can’t follow directions which should mean they lose a significant number of points.", "author": "abstract_colors91", "created": 1589664403, "upvotes": 1}, "fqpvs2d": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqpvs2d/", "text": "When I was in grad school, we were given rubrics for our presentations. Time was on the rubric, points were deducted for being over or significantly under time. If your professor is going to give a time limit, he should stick to it, and so should your classmates.", "author": "HerdResistant", "created": 1589554878, "upvotes": 0}, "fqnrqkj": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqnrqkj/", "text": "It's kind of a bit of a facade when I teach and have student presentations. I always give summaries and reflections from the presentation while they transition so I discuss the strong points that they brought up and ask my students to reflect. While this is happening, another group is setting up. So in person, I don't not 'praise' them but further analyze the information they presented. I don't mention about their lateness or telling them to stop immediately in front of everyone but try to be subtle when they do demonstrations for example. On the rubric, I always take marks off as I have a clear criteria on professionalism/timeliness. But in front of my students, I don't make a deal out of this and simply move on if that makes sense. \n\nAdditionally, I give them reminders and they see my timer throughout so it's their skill to manage how to cut/wrap things up.", "author": "EthanJJ", "created": 1589500168, "upvotes": 0}, "fqn5kyy": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqn5kyy/", "text": "I just finished a grad program in a social science field and all of my professors were consistent with timing. If they gave us a time limit, they either cut us off when we reached it or took off points for going over or both. \n\nI would be so angry if any of my professors ever did this (not to mention, angry for them keeping us way past the end of class since presentation days are usually tight on time as it is).", "author": "aattanasio2014", "created": 1589489053, "upvotes": 1}, "fqn5hoq": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqn5hoq/", "text": "your professor is some sort of anomaly and presenting that way shows the lack of time management.", "author": null, "created": 1589489010, "upvotes": 1}, "fqmwquf": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmwquf/", "text": "I don't know if it's different in your field, but in the physical sciences people stick to the time expected for a talk. We rehearse in front of our research group before conferences so that we don't go over the time even by a few minutes.", "author": "vagabond178", "created": 1589484809, "upvotes": 2}, "fqmqvjs": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmqvjs/", "text": "this happened to me literally 6 days ago. since we're all obviously online, i pre-recorded mine (with permission) so that it would 100% stay within the time limit, whereas others who did it live went over time. my prof interrupted them but at the same time they better have also taken points off", "author": "pseudoname123", "created": 1589481983, "upvotes": 0}, "fqmp853": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmp853/", "text": "This should not happen at all. This is not something that is encouraged in STEM. Our group's mentality is that if a successful prof is able to condense their whole research into a 30 minute presentation (for conferences), then there is absolutely no reason you can't do a presentation on your specific topic in 10. Any longer is a waste of everyone's time.", "author": "switchpot", "created": 1589481209, "upvotes": 0}, "fqmlr5d": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmlr5d/", "text": "That’s so annoying! I can’t remember the exact quote my professor shared way back in college, but I’ll never forget the meaning. It went something like “I’m sorry this letter is so long, I didn’t have enough time to make it short”.  Which is just to say that it takes quite a bit more time to organize your thoughts into a concise meaningful essay or presentation instead of just trailing on and on in a longer one.", "author": "cazthebeast", "created": 1589479544, "upvotes": 1}, "fqmjmqk": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmjmqk/", "text": "i also don't think it should be hold against them, sometimes you just don't know where you are going to end", "author": "dutchgguy", "created": 1589478528, "upvotes": 0}, "fqmijfw": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmijfw/", "text": "That's bizarre, and I'm sorry that happened to you.. TWICE. I'd be mad too. I feel like time limits are part of the \"work\". Learning how to explain a concept in a succinct way at the appropriate level for a specific amount of time is a skill we should all have and be improving upon.", "author": "kelseylulu", "created": 1589478021, "upvotes": 0}, "fqmfd5g": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmfd5g/", "text": "What I've found is that many professors are bad managers. Clear communication of expectations and deadlines translates to less time wasted scratching heads and more lab productivity. Yet many professors give broad general descriptions of the work they want their students to do, then deride the students when they haven't produced exactly what they had in mind. \n\nYour story is a classic example of bad management. Manager says one thing, wants another, and the employee who followed instructions gets punished. I don't know what it is, maybe there's just something about the type of personality drawn towards the professor path. Or maybe it's the general lack of structure in most labs, but I see a huge shortcoming in management skills within academia.", "author": "TheNarwhaaaaal", "created": 1589476522, "upvotes": 0}, "fqmeqce": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqmeqce/", "text": "I had an hour 15 min class yesterday turn into 3 hours because people kept talking and talking. I feel you.", "author": "choobs", "created": 1589476222, "upvotes": 1}, "fqm9rgn": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqm9rgn/", "text": "This happened to me too the other day. We were in groups and each had to present about a topic relevant to the class. The limit was 5 slides per group. so, my group presented its 5 slides in 10 min. Then came another group that presented about 25 slides and took their sweet time. The professor praised them so much leaving my group feeling like a sack of shit. Sigh.", "author": "coffeebeforebed_", "created": 1589473891, "upvotes": 0}, "fqm8ktm": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqm8ktm/", "text": "Once I was participating in a data blitz where you only get one slide, no animations, and 3 minutes to talk. Someone got up there and went on for 10 minutes and so many animated slides and no one stopped them. Drove me nuts! You work hard to develop the best presentation and story in the time allotted. Letting people go over time is unacceptable and I’m sorry that’s been your experience.", "author": "Team_Cap", "created": 1589473331, "upvotes": 1}, "fqm6iey": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqm6iey/", "text": "There's one student in my cohort who always does this and is praised. Yes she's very smart, and she does great work! But when you say that a presentation should be about 10 minutes, that's what it should be. Every time she ends up putting together something that is at least double what is asked, and then gets complimented. And I usually get the feedback that I need to provide more detail. Drives me crazy.", "author": null, "created": 1589472338, "upvotes": 1}, "fqm32qi": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqm32qi/", "text": "Ugh these are probably the same people that talk way too long themselves during their own conference presentations. And their moderators and fellow panelists that keep to the time hate them just as much you do!", "author": "cats_and_feminism", "created": 1589470660, "upvotes": 2}, "fqm30em": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqm30em/", "text": "This happened to me way back in school and I’m still salty about it. I kept exactly to time and got a B because it was ‘not so in depth.’ Whereas several people went so far over time that our 2 hour class ran 5 hours that day (and no they didn’t let us leave, this wasn’t in the US) and those super long presentations got A’s. Totally unfair, because obviously if there was a longer time limit everyone else would’ve included more info too.\n\nI teach now and I’m all about getting to the point. I time presentations/debates strictly and if your argument  wasn’t effectively made in that time then you get docked. I also always create a rubric the students have ahead of time and rigidly adhere to it. I don’t want any mystery about what you have to do to get an A.", "author": "chuuluu", "created": 1589470629, "upvotes": 4}, "fqm2uin": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqm2uin/", "text": "Student here! Just did a 15min presentation a few days ago. All I did was set a stopwatch, when I saw it hit 12min, I knew it was time to finish up. Hit 15:00.78, definition of accurate!\n\nI don't know why this hasn't become the gold standard for presentations. You give what the teacher asks for, not so much extra.", "author": "LethalChemistry", "created": 1589470547, "upvotes": 0}, "fqm2tpl": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqm2tpl/", "text": "Oh. my. fucking. God.  Yes. I have had three 2 hour zoom meetings in past three days because my colleagues don't know how to express themselves concisely, and my boss encourages them. The only thing it has led to is that I check out earlier every time.", "author": "threelittlepossums", "created": 1589470536, "upvotes": 4}, "fqly14k": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqly14k/", "text": "40 minute presentations are usually left for department-level talks, invited conference speakers (if that). At that rate you might as well write a review article that goes into even more detail. A 10 minute talk for a class is great. Get right to the nougatey goodness without wandering into the weeds. The fact that this professor was fine with a talk that far exceeded the limits they imposed is ridiculous. Conference moderators get testy when you go past their second warning that you need to stop talking. Encouraging this kind of behavior is only going to cause problems professionally.", "author": "thatwombat", "created": 1589468133, "upvotes": 0}, "fqlt7lj": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlt7lj/", "text": "Not just in grad school I've seen this in all levels of education but it always annoyed me. School isn't real life but should be preparing us for it and if you are a speaker at a conference and run into everyone's time especially if you go first it's disrespectful and weirdly competitive.\n\nDo they then praise the ability to generate discussion? They should factor that into the time set. Q+A at the end like in real life!", "author": "Pandy_45", "created": 1589465617, "upvotes": 11}, "fqlr51h": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlr51h/", "text": "What? I thought it was normal to get impossible tasks from you PI? Be safe and don't go into lab, but please try and get this done. Oh your work needs to be more rigorous, oh but I don't want you to take the take to do the extra rigorous experiments......", "author": "ozzalot", "created": 1589464479, "upvotes": 0}, "fqlq9y9": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlq9y9/", "text": "Are you sure they aren't knocking off points or criticizing the length later? I've always had some piece of positive feedback even if the presentation is a disaster and \"wow that was really in depth!\" would be one.", "author": "mediocre-spice", "created": 1589463996, "upvotes": 1}, "fqlmb6l": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlmb6l/", "text": "That is REALLY strange to me. None of my professors want us to go over time limit. In fact, they ding our grades for it", "author": "articlesarestupid", "created": 1589461593, "upvotes": 4}, "fqllb7n": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqllb7n/", "text": "I feel you, I got a shitty grade on a 8 minute presentation (we were originally given 15 minutes but than the professor reduced the time due to how many were in the class). The presentation was supposed to be on a 26 page paper we wrote. He let this one guy go way over the time limit and then talked about how great his presentation was, but told me mine sucked because I hardly covered anything. How the FUCK am I supposed to explain melanin, keratin, and structural coloration in birds, AND go over at least 3 studies about them in 8 fucking minutes?", "author": "boxdkittens", "created": 1589460941, "upvotes": 30}, "fqlijh4": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlijh4/", "text": "My prof always says \"Your presentation should be exactly the given time limit, plus or minus 1 minute.\"", "author": "IrahX", "created": 1589459017, "upvotes": 20}, "fqlgviz": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlgviz/", "text": "So far I haven’t experienced any negative ramifications for sticking to an assigned time limit, but I have a couple of classmates who always go way over time for presentations and frequently bring up ideas that are barely related to our class material. Unfortunately most of my professors just let them go on...and on...and on...and it’s frustrating.", "author": "GothBurger12", "created": 1589457748, "upvotes": 4}, "fqlgmny": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlgmny/", "text": "This is one of my biggest pet peeves, and the worst I’ve ever had to deal with is a Prof not cutting someone off for going over time. \n\nNot enforcing time limits encourages people not to practice their presentations and punishes those who actually respect the guidelines. If I’m ever a prof I’ll do what one of my old teachers did: when the timer goes off you can finish your sentence and that’s it.", "author": "pjokinen", "created": 1589457552, "upvotes": 15}, "fqlfxwg": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlfxwg/", "text": "[deleted]", "author": null, "created": 1589456992, "upvotes": 82}, "fqlfhq4": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlfhq4/", "text": "The professor for which I was a TA was always worried of interrupting students half-way because he felt somehow rude, but at the same time, he never praised whoever went over length; I think he even asked us TAs to detract few points from the grade because, in the end, they are violating a constraint.", "author": "9december3", "created": 1589456620, "upvotes": 64}, "fqlecup": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fqlecup/", "text": "This always frustrates me too. Keeping your presentation to a specific time limit is a skill and going over time, to me, demonstrates that person's poor development of that skill. Frustrating that a professor can't understand that simple fact!", "author": "WeedsAndWildflowers", "created": 1589455631, "upvotes": 36}, "fql9wz8": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fql9wz8/", "text": "Happened with me too!\nPut this in r/professors", "author": "bonelesslettuce", "created": 1589451416, "upvotes": 3}, "fql9vi3": {"link": "/r/GradSchool/comments/gjj429/need_venting_if_any_professor_is_reading_this/fql9vi3/", "text": "Never allowed students to go way over time. If anyone did, they were stopped and they lost points. If one went over time, others got same extra time.\n\nYou must have a special professor who allows a 10m to turn into a 40m.", "author": "Kingarvan", "created": 1589451375, "upvotes": 336}}}