{
  "sid": "jqiddy",
  "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/",
  "title:": "IM NOT AN IDIOT!!!",
  "text": "OH MY GOSH SORRY I DONT HAVE ANYONE TO TELL THIS TO SO IM HERE!!\n\nSo I've been in my Aerospace Engineering \"catch-up\" courses this semester since I got my degree in Physics, and I really didn't understand half of the stuff going on. \n\nToday I figured out it's because every engineering principle is based on Statics. *I never took Statics in undergrad.* \n\nI thought I was maybe just naturally stupid or didn't belong here, but it's not that at all!!\n\nI was approaching all these problems from a Physics mindset, which is why I kept getting things wrong!\n\nI talked to my professors and they understood and helped me find good resources, so now I'm gonna teach myself Statics and FINALLY UNDERSTAND WHATS GOING ON!!!\n\nI'm so happy y'all. This probably doesn't seem like anything big, but it's a huge game-changer for me. I'm so excited!!!!\n\nTL;DR - Im getting an engineering masters and I just realized the reason nothing's made sense is bc I never took Statics!!\n\nEdit: Thank yall all so much for your support and my first awards on reddit! I'm really blown away by how common this is in transitioning to grad school programs lol",
  "author": "hufflepuffhorcrux",
  "created": 1604865658,
  "over_18": false,
  "upvotes": 538,
  "upvote_ratio": 0.98,
  "comments": {
    "gbq8w55": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbq8w55/",
      "text": "My social sciences majoring self thought you meant statistics for a minute.\n\nAs someone who did their undergrad in a poli science discipline and shifted to a type of sociology, I definitely experience that feeling that I'm missing some key tools on my bench.",
      "author": "awkwardenator",
      "created": 1604937749,
      "upvotes": 3,
      "replies": {}
    },
    "gbq7enc": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbq7enc/",
      "text": "I had a very similar problem. Did my undergrad in chemistry, did masters and PhD in chemical engineering, and during my masters I was confused a lot because I didn’t have a lot of the basic courses. During my PhD I started taking a bunch of “catch up” courses like you in order to qualify for my EIT designation and you’re completely right, it does make a huge difference. I had imposter syndrome for the longest time and after taking some courses and using COVID as an opportunity to read a lot, I really got a confidence boost and no longer feel stupid. \n\nCongrats on figuring it out too!",
      "author": "alecahol",
      "created": 1604936997,
      "upvotes": 2,
      "replies": {}
    },
    "gbq0zmq": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbq0zmq/",
      "text": "I'm happy you are happy.\n\n&#x200B;\n\nI had a similar experience going from ecological to subcellular molecular biology and, girl, did I feel dumb as a rock during all my first few seminars. As I was taking relevant classes I was so proud of my growing ability to connect the dots I literally smiled. It felt like I was a main character and this was that time when the narrator would describe as the beginning of my exponential growth.  Ah, those were the days; I miss that me.",
      "author": "TheYoungBiologist",
      "created": 1604933625,
      "upvotes": 2,
      "replies": {}
    },
    "gbpjs3v": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbpjs3v/",
      "text": "I had a similar realization the other day. I've spent the past two months thinking I'm an idiot because it takes me three weeks to summarize 400 pages of literature while it takes my colleagues two days.\n\nThen I realized that it's because my background is scientific (computer science) rather than philosophical (I'm in cognitive science now). Of course philosophers are able to read and digest hundreds of pages of literature in an afternoon and come up with perfect arguments on the spot, *that is literally what they've spent their life training to do!* Meanwhile, computer scientists don't give two shits about what someone said 50 years ago since, if you have the data to back up your claims, what does it matter?",
      "author": "Jealous_Illustrator",
      "created": 1604921006,
      "upvotes": 2,
      "replies": {}
    },
    "gbpeq5v": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbpeq5v/",
      "text": "My Master in a nutshell.  \nI studied Biology with specialisation in Bioinformatics in my Bachelor and my University had an agreement with the Computer Science institute that they would accept that degree as equivalent of a CS Bachelor for their Master program with specialisation in Bioinformatics.   \nTo this day I have no idea how they imagined that working out. I obviously wasn't qualified to sit in many of the advanced lectures but they also didn't allow me to take too many Bachelor-level courses (for obvious reasons). A friend of mine took the same route and ran into the same problems.  \nGlad I pushed through, since I found a fun PhD project and now industry job that both heavily rely on me having that Master, but man, those years really sucked.",
      "author": "LittlePrimate",
      "created": 1604915337,
      "upvotes": 2,
      "replies": {}
    },
    "gbp7xsg": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbp7xsg/",
      "text": "That's awesome!\n\nReminds me of when I tutored maths. It always turned out that kids who were having a bad time with algebra or calculus had ended up missing a few days of school at exactly the wrong time, sometimes years before, and just never had that building block to work from.",
      "author": "sirophiuchus",
      "created": 1604907960,
      "upvotes": 2,
      "replies": {}
    },
    "gbowoqo": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbowoqo/",
      "text": "Glad you've sorted it out! I'm currently reminding myself that I had to take multivariate stats before bivariate/ intro to stats due to scheduling conflicts so now that I am dealing with a multivariate problem and it's 7 years since I took that poorly organized multivariate course and that I am not stupid, just ill-prepared for this project I am trying to finish.",
      "author": "Keoqe",
      "created": 1604898163,
      "upvotes": 2,
      "replies": {}
    },
    "gbotwk2": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbotwk2/",
      "text": "Statics is much better than Physics. Also easier to follow.",
      "author": "anonyaway",
      "created": 1604896201,
      "upvotes": 0,
      "replies": {}
    },
    "gbos0o8": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbos0o8/",
      "text": "thread title looks like a trump tweet",
      "author": "iammaxhailme",
      "created": 1604894953,
      "upvotes": 4,
      "replies": {}
    },
    "gbomp2t": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbomp2t/",
      "text": "I read this entire post like you meant statistics, got confused. Read it again. Then was like ah.",
      "author": "nanon_2",
      "created": 1604891702,
      "upvotes": 2,
      "replies": {}
    },
    "gbomjmr": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbomjmr/",
      "text": "How come your degree is an \\_MA\\_? I assumed engineering was usually an MS or an MEng",
      "author": "AFewSentientNeurons",
      "created": 1604891611,
      "upvotes": 1,
      "replies": {}
    },
    "gbojeyb": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbojeyb/",
      "text": "Same thing happened to me but with economics and real analysis. It gets easier once you get done with the qualifying exams",
      "author": "raforad",
      "created": 1604889779,
      "upvotes": 6,
      "replies": {}
    },
    "gboex6w": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gboex6w/",
      "text": "So uh... what are said resources? Asking for a friend....",
      "author": "penguinhearts",
      "created": 1604887241,
      "upvotes": 7,
      "replies": {
        "gbogckg": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbogckg/",
          "text": "Haha I got you! I started going through this [MIT powerpoint](http://web.mit.edu/16.unified/www/SPRING/materials/Lectures/M4.3-Unified09.pdf) and my prof recommended me to watch a series of [youtube videos](https://www.youtube.com/playlist?list=PLrMPyRXvlE9xFauIlWTOO89vX52sOYIh3) from UC Berkley's Dr. Sanjay Govindjee!",
          "author": "hufflepuffhorcrux",
          "created": 1604888046,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gbod6o6": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbod6o6/",
      "text": "I also have a Physics undergrad and just finished a MS Aerospace in August. I struggled through fluid dynamics and structures. I got by okay with fluids bc of the math we take for physics, but once we got to airfoil theory I had a difficult time. Structures was easily one of the worst classes I have ever taken and it is definitely bc I never took statics lol. Just know you can do it too!  \n\n\nAlso, for an edit...my focus was in GNC so those two courses were requirements for the MS but not my focus.",
      "author": "jkizzles",
      "created": 1604886254,
      "upvotes": 3,
      "replies": {
        "gbodxte": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbodxte/",
          "text": "Omg this relieved me SO MUCH just to hear its possible!! \n\nI'm taking fluid dynamics this semester and the prof is one of those that just teaches the textbook/is lowkey a tenure prof, so I'm basically teaching it to myself... I'll def look into airfoil theory so it doesnt blindside me, thanks for the heads up!!! \n\nAlso I'm taking structures next semester so I guess I can like do a bunch of statics stuff over winter break to prep for it 😤 thank you soso much for your story, I'm taking it all straight to heart!!",
          "author": "hufflepuffhorcrux",
          "created": 1604886689,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gbocsj7": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbocsj7/",
      "text": "And this is why you deserve to not only be in grad school, but earn that degree. You have a desire to persevere. You are willing to teach yourself a new topic, as opposed to having it taught to you. That kind of attitude will help propel you to victory.",
      "author": "Mash_Ketchum",
      "created": 1604886030,
      "upvotes": 38,
      "replies": {
        "gbod0xm": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbod0xm/",
          "text": "Wow. idk if you meant that as a supportive comment, but I really needed to hear that. This semester's been rough. Thank you stranger 💜",
          "author": "hufflepuffhorcrux",
          "created": 1604886162,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "gbo92q9": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbo92q9/",
      "text": "My older, electrical engineer, brother took a mechanical engineering robotics elective that everyone said was easy. \"it's just statics, just sum the moment.\"\nHim:wtf is a moment?",
      "author": "us3rnam349",
      "created": 1604883874,
      "upvotes": 9,
      "replies": {}
    },
    "gbo54vs": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbo54vs/",
      "text": "Now just wait until you get to M E C H A N I C S",
      "author": "CosmoBiologist",
      "created": 1604881656,
      "upvotes": 3,
      "replies": {
        "gbo5cee": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbo5cee/",
          "text": "THATS THE PROBLEM Ive been in Mechanics 2 this semester, totally confused half the time 😅 luckily my prof for that class is really good at building on concepts so I'm not nearly as confused as I probably should be lol",
          "author": "hufflepuffhorcrux",
          "created": 1604881769,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gbnwjbj": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnwjbj/",
      "text": "I feel this as somebody who got an undergrad degree in EE, and is now doing more math/CS research and coursework. We're gonna catch up at some point!",
      "author": "Man_Thighs",
      "created": 1604877126,
      "upvotes": 10,
      "replies": {
        "gbnz1kf": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnz1kf/",
          "text": "Heck yeah, we got this!!! I'm glad to know I'm not alone in this physics-math-engineering-tech game of musical chairs",
          "author": "hufflepuffhorcrux",
          "created": 1604878444,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gbnsbs0": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnsbs0/",
      "text": "My favourite \"Well shit, *that's* the problem\" moment from undergrad was when I discovered that mathematicians and physicists use different conventions for spherical polar coordinates.  Specifically, they swap the definitions of the phi and theta angles.\n\nNobody thought to mention it to us, of course. It was several weeks in that I finally figured out why approaches that worked just fine during electromagnetics in the morning were confusingly incorrect during vector calculus in the afternoon....",
      "author": "cryptotope",
      "created": 1604874937,
      "upvotes": 105,
      "replies": {
        "gbnzj2a": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnzj2a/",
          "text": "D U D E  YES!!! I got a math minor so I took so many math classes where I'd just.... continue to use physics notation on homework and notes even if it wasn't what the prof wrote. Eventually I confused myself and had to go back and re-do all my notes lol",
          "author": "hufflepuffhorcrux",
          "created": 1604878693,
          "upvotes": 37,
          "replies": {}
        },
        "gboykuf": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gboykuf/",
          "text": "Yep.  Tripped me up too.  Lots of little \"oopsies\" like that go unremarked....\n\n* Physicists & mathematicians say sqrt(-1)=i; engineers say sqrt(-1)=j\n\n* Everyone in the world indexes points in a plane with (x,y) tuples .. except mathematicians indexing arrays - then they use (y,x) tuples.  Oh, right.  Python programmers do that also.\n\n* Physicists of most stripes are really anal about units because they're so helpful.  Nearly everyone uses MKS, which is good and right and proper.  Except cosmologists, who like to set c=G=ℏ=1, and then ignore units enitrely.\n\n* Physicsts use Laplace transforms; engineers use \"Z\" transforms.   They are the same thing, written slightly differently.  Why?  dunno.",
          "author": "drzowie",
          "created": 1604899597,
          "upvotes": 15,
          "replies": {
            "gbozk8j": {
              "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbozk8j/",
              "text": "haha the j convention is mainly used by electrical engineering students due to current being everywhere in just about every equation",
              "author": "davvidho",
              "created": 1604900380,
              "upvotes": 11,
              "replies": {}
            },
            "gbp4d0h": {
              "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbp4d0h/",
              "text": "About your last point: Laplace and Z-transforms are not the same, but they are indeed closely related to each other. \nThe Laplace transform works only with functions of a continuous argument t, let's say time, while Z-transforms only work for sequences, that is functions mapping the integers to the real or complex numbers.\nIn any case, they both express the original function in terms of damped exponentials, which makes them extremely useful for the description of linear, time invariant systems, whose eigenfunctions are complex exponentials.",
              "author": "vladdaimpala",
              "created": 1604904518,
              "upvotes": 5,
              "replies": {
                "gbp836p": {
                  "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbp836p/",
                  "text": "Hah!  Spoken like a mathematician!  Stand back far enough and squint a little and they're the same thing (for physics-friendly functions anyway...)",
                  "author": "drzowie",
                  "created": 1604908110,
                  "upvotes": 3,
                  "replies": {
                    "gbqdtlo": {
                      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbqdtlo/",
                      "text": "Not really, lol. Look at the bilinear transform, you have to make approximations to \"convert\" from one to another.",
                      "author": "qksv",
                      "created": 1604940222,
                      "upvotes": 2,
                      "replies": {
                        "gbrg6je": {
                          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbrg6je/",
                          "text": "Of course.  In particular, you have to figure out what to do with any poles at infinite frequency.  But physics-friendly functions always approach infinity smoothly and cleanly (no infinitely complex functions allowed), so it's valid to approach the continuous as a clean limit of the discrete -- essentially, any control function can be treated as having a massive well-behaved lowpass filter with a cutoff somewhere above the frequencies of interest to the problem.  In that instance it's obvious and trivial that the Z transform converges to the Laplace transform as the step size decreases (or, if you prefer, as the sampling rate increases).",
                          "author": "drzowie",
                          "created": 1604958759,
                          "upvotes": 2,
                          "replies": {
                            "gbs8308": {
                              "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbs8308/",
                              "text": "In electrical engineering you have to be careful, as the z-transform usually corresponds to the sampling of a continuous time system, and your sampling frequency is not infinite.",
                              "author": "qksv",
                              "created": 1604972347,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gbpqoek": {
                  "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbpqoek/",
                  "text": "I understood a few of those words...",
                  "author": "Mad_Cyclist",
                  "created": 1604927075,
                  "upvotes": 2,
                  "replies": {
                    "gbrh2e2": {
                      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbrh2e2/",
                      "text": "The Laplace transform is a generalization of the Fourier transform, which is what your ears do to incoming sound.  Fourier transformation turns any function of an independent variable (say, pressure as a function of time -- i.e. sound) into an equivalent function of the reciprocal of that variable (say, sound energy as a function of pitch -- which is measured in units of 1/time). \n\nThe Laplace transform is a generalization of that.  Applied to sound, the Laplace transform converts pressure-vs-time into a collection of \"bell tolls\" (nearly-pure pitch, falling off in volume) rather than pure-pitch tones.\n\nBoth types of transform are useful for understanding physical systems.  Physicists think about Laplace transforms in several contexts including the behavior of dissipative fields (such as the electromagnetic field in a medium, which might gradually absorb radio or light as they propagate).  Engineers think about Z transforms (and, to be fair, Laplace transforms also) in the contexts of signal processing and control theory.   Mathematicians -- well, who knows what mathematicians think about?",
                      "author": "drzowie",
                      "created": 1604959199,
                      "upvotes": 3,
                      "replies": {
                        "gbxybrr": {
                          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbxybrr/",
                          "text": "I was mostly joking, but this is a fantastic explanation, thank you! I have a vague familiarity with Fourier transforms, and I knew I heard of the Laplace transform but couldn't place it.\n\n&#x200B;\n\n> who knows what mathematicians think about? \n\nAccurate.",
                          "author": "Mad_Cyclist",
                          "created": 1605108992,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gbp4pme": {
              "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbp4pme/",
              "text": ">* Physicists of most stripes are really anal about units because they're so helpful.  Nearly everyone uses MKS, which is good and right and proper.  Except cosmologists, who like to set c=G=ℏ=1, and then ignore units enitrely.\n\nHey now, don't leave out us smaller scale astronomers -- we all still use CGS units and we like it that way.",
              "author": "CapWasRight",
              "created": 1604904836,
              "upvotes": 4,
              "replies": {
                "gbpayvf": {
                  "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbpayvf/",
                  "text": "Particle physicists too, I think. I'm still not sure why ergs and dynes are preferred....",
                  "author": "LordFuckBalls",
                  "created": 1604911054,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gbnm5mm": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnm5mm/",
      "text": "Love the title! Took me at least three years in my program to be like \"huh, maybe I'm not completely stupid.\" We're all constantly learning and we can't have background on everything.",
      "author": "UnspectacularAim",
      "created": 1604871784,
      "upvotes": 8,
      "replies": {}
    },
    "gbnlpkh": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnlpkh/",
      "text": "Same thing happened to me in undergrad, had to take a certain number of engineering classes, but they didn’t specify which ones, I was able to make a bunch fit my schedule except for statics. Boy was that a mistake",
      "author": "enginerd826",
      "created": 1604871560,
      "upvotes": 10,
      "replies": {}
    },
    "gbncsbl": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbncsbl/",
      "text": "The first time around dynamics was a dark art to me, but when I eventually got it in context it was a lot easier.",
      "author": "ntfh_uk",
      "created": 1604867366,
      "upvotes": 10,
      "replies": {}
    },
    "gbn9l1n": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbn9l1n/",
      "text": "Statics is OK, much easier when nothing is moving about.",
      "author": "ntfh_uk",
      "created": 1604865807,
      "upvotes": 36,
      "replies": {
        "gbnb4b4": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnb4b4/",
          "text": "Seriously lol. We got into motion and everyone was like \"okie dokie that sounds reasonable!\" and I was sitting over here like \"why.... why are we cutting the bar 'just to the right' or 'just to the left' why not down the middle??? WAIT DONT MAKE THE BAR MOVE IM STILL CONFUSED!!\"",
          "author": "hufflepuffhorcrux",
          "created": 1604866550,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "gbn9hn3": {
      "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbn9hn3/",
      "text": "I don't even know what Statics is, I'm just happy you're happy~",
      "author": "beekergene",
      "created": 1604865761,
      "upvotes": 222,
      "replies": {
        "gbo7skd": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbo7skd/",
          "text": "You know how the classic Newton's law in physics? An object in motion stays in motion? That's one branch of physics - kinetics. It's about things that move.\n\nStatics is another branch of physics, specifically focused on things that *don't* move. Usually this means analyzing materials under load - your desk, for example, is not moving, but it's experiencing load from your keyboard, monitor, etc. It might not be a big deal if your desk breaks if you put too much load on it, so there might not be the most urgent need to analyze how the material handles loads and stressed, but for something like a building you'll need to do work beforehand because we don't ever want to find out its breaking point after the fact.\n\nIt's important in aerospace engineering for studying loads on a wing, for example.",
          "author": "ksedymami",
          "created": 1604883135,
          "upvotes": 126,
          "replies": {
            "gbo9bji": {
              "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbo9bji/",
              "text": "🤔 hmm interesting! Do static values only apply to the object bearing the weight like the desk? Like a desk has a static value of 50 lbs it can hold up? Do static values apply to the object being held up like a monitor on top of the desk? If so, does the value change depending on where the monitor sits on the desk? Like if it sits on the corner of the desk then it won't break but if it's a thin table and the monitor sits right in the center of it then it's more liable to collapse? How does Statics work in space without all the gravity? Does it mess everything up? \n\nShoot, now I want to learn about statics and physics and dropping bowling balls off buildings and stuff",
              "author": "beekergene",
              "created": 1604884018,
              "upvotes": 10,
              "replies": {
                "gboeyy8": {
                  "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gboeyy8/",
                  "text": "Mech E here. Static values are used for most designs, and it absolutely changes based on where the load is (where the monitor sits on the disk). Typically objects are designed within certain criteria so the design engineer is either told or makes an assumption on were the load is and how much it is. So if the engineer is told the weight should be in the middle they will make sure there is enough reinforcement in the middle. \nI have no idea about how it would work in space but probably more about withstanding acceleration from thrust and actually getting the object to space.",
                  "author": "CritterACDC",
                  "created": 1604887268,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "gboly5d": {
              "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gboly5d/",
              "text": "That was a very good ELI5 type answer. As someone who had never even taken physics in high school, I actually understood what you’re talking about :3",
              "author": "Elevendytwelve97",
              "created": 1604891250,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gbnax40": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbnax40/",
          "text": "THANK YOU 🥺💜 I'm seriously so happy. I missed feeling this happy about learning omg",
          "author": "hufflepuffhorcrux",
          "created": 1604866451,
          "upvotes": 47,
          "replies": {}
        },
        "gbqe886": {
          "link": "/r/GradSchool/comments/jqiddy/im_not_an_idiot/gbqe886/",
          "text": "> I don't even know what Statics is\n\nWhat I remember: \n\nSum of forces = 0\n\nSum of torques = 0",
          "author": "Carnot_Efficiency",
          "created": 1604940420,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064989
}