{"sid": "ppvubu", "link": "/r/GradSchool/comments/ppvubu/anxious_i_wont_finish_grad_school_just_started/", "title:": "Anxious I won’t finish grad school (just started)", "text": "So I am 2 weeks into my MA of clinical psych program and I’m not doing too hot. For starters, we are in a cohort and could not pick our classes. So they run from 9am-4pm and I am not a morning person. I spent the first week fighting off an intense urge to sleep in class. I also got a kidney infection which led to me missing a day and when I got back, everyone in the cohort formed alliances and made their friends (so I spent the last lunch alone). I tried to go up to their table at lunch but there were no seats. So that sucks.  \n\nThe worst part though, is I feel mentally incompetent compared to everyone else. Not in terms of smarts tho- in terms of mental health. I suffer from pretty bad anxiety on top of bipolar 2. Right before grad school, my two closest friends went into a psychosis and my other friend’s mom passed suddenly. All of this just caused intense anxiety for me and I have felt pretty detached from reality ever since. I haven’t spoken to my two closest friends (due to the psychosis thing), and they were my biggest support system. I do have a therapist but seeing him once a week for an hour is not cutting it.  \n\nAnyways, the last class I had, I randomly had a panic attack. I have no idea why and it sucked. I tried to hide it for 4 hours, and went to the bathroom any time I could. And I just thought to myself- in 3 months I’m supposed to give therapy to people (part of the program practicum), but I’m a mess myself. So I’m really starting to have fears that my mental high is going to get in the way of me completing this program.", "author": "emmastudent", "created": 1631865184, "retrieved": 1632844178, "over_18": false, "upvotes": 10, "upvote_ratio": 1.0, "comments": {"hd6m411": {"link": "/r/GradSchool/comments/ppvubu/anxious_i_wont_finish_grad_school_just_started/hd6m411/", "text": "Wow that sounds like an intense few weeks. I feel you about the being a mess and then attempting to help others, but your experience gives you strong empathy towards others issues. maybe thinking of it like that will help. We get used to believing that a doctor is not a human, but that's just not true. Also, these events will pass and if you keep trying to butt into conversations with people in your cohort I bet you'll make some friends. Persistence!", "author": "Anarchy_Lurker", "created": 1631865526, "upvotes": 2}}}