{
  "sid": "r117b2",
  "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/",
  "title:": "This is embarrassing, but how do you do a peer-review?",
  "text": "My classes in undergrad never prepared me to do one, and now I have an assignment wherein our classmates have to peer review each others assignment.\n\nHow do you do a peer review? In fact, what exactly is a peer review 😬 I feel like I should know all these but I never learned it!\n\nI thought I \"peer-reviewed\" my classmate's article by editing their grammar, formatting, commenting on certain word choices, moving certain concepts from here to here to make similar discussions together, making methods suggestions, and overall feedback. \nBut then someone else did mine and all they put in was an one sentence speaking to the overall. I feel like I'm an asshole now for being over critical and editing things that I should not.\n\nWhat's the correct thing to do in this situation? (Please don't judge)",
  "author": "NoUsernamesL3ft",
  "created": 1637745731,
  "updated": 1638208032,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {
    "hlw02ag": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlw02ag/",
      "text": "I had to do similar things for some of my seminars and it really differed between professors regarding what their expectations were. For one, it was more like read your classmate's paper and edit for grammar, spelling, and give your thoughts. That was similar to stuff we did in undergrad and wasn't at all helpful to me personally. \n\nAnother professor had a more structured assignment where each person's paper was to be read and discussed by two classmates. Those two peer reviewers would type up a document similar to what a reviewer would send to an author. There may be some grammatical corrections or suggestions, but the vast majority was focusing on a.) does the literature review provide enough support for why this paper is worth writing?, b.) do the hypotheses make sense in the context of the lit review?, c.) are concepts explained thoroughly?, d.) (if applicable) is the methodology appropriate for the research question? e.) what could improve this paper, and how?\n\nI think a more thorough review is actually being considerate because you are engaging with your peer's work and trying to give them constructive suggestions. Someone who reads an entire paper and says \"yours is really good!\" or who only bothers to write a single sentence is the one who is the asshole. Even an extremely well-written paper by a renowned professor will have more than 1 line of comments. Personally, I'm always thankful when I get a lot of comments (as long as they are constructive) because, while I may not incorporate some into my next draft, it shows someone cared enough to critically think about it and sometimes it gets me to see something I didn't see previously.",
      "author": "False-Guess",
      "created": 1637752661,
      "upvotes": 11,
      "replies": {}
    },
    "hlvvr7u": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlvvr7u/",
      "text": "The way you are going about it is about the same way I do it. Pretty much any prominent flaws you see in their work you just make a polite note of. The point of a peer review is to make their work better. A one sentence overall situation would be a good addition but imo not something that constitutes an entire review. \nSidenote: I was regarded as one of the smarter kids in my classes and would give reviews like yours to people, but anyone reviewing mine would hand it back saying \"nice job looks good to me\" with almost zero corrections. So i was annoyed in a sense that my paper never got marked up as much. \nBottom line, do you what you feel is necessary to make their paper better. I think it's great that you're going beyond strict grammar or editing by also diving into flow and content. As long as you are polite and humble with your suggestions, I think you're doing fine the way you're going about it now!",
      "author": "After_Anything3981",
      "created": 1637749222,
      "upvotes": 11,
      "replies": {
        "hlvwjgz": {
          "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlvwjgz/",
          "text": "Thank you so much for your response!! This genuinely helps a lot!\n\nI tend to overthink and self-doubt myself all the time and have a deep rooted need to overachieve. I'm just a bundle of anxieties at this point in the semester, so hearing your feedback really helps!",
          "author": "NoUsernamesL3ft",
          "created": 1637749862,
          "upvotes": 1,
          "replies": {
            "hlwqskr": {
              "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlwqskr/",
              "text": "Totally get that haha and yeah no problem. Glad I could help! Peer reviews are definitely a gray area",
              "author": "After_Anything3981",
              "created": 1637767294,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlwaji1": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlwaji1/",
      "text": "I agree with the others.  The only thing I would add is to try and focus on structural or methodological flaws over style. So you can correct clear grammar errors, but I would not change sentence structure. You could say something overarching about convoluted sentences  though. The more useful is to identify flaws in reasoning. What in the paper would make you think \"I don't believe that\" or \"I don't trust the results\"",
      "author": "grounded_out",
      "created": 1637759586,
      "upvotes": 3,
      "replies": {}
    },
    "hlwkqgf": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlwkqgf/",
      "text": "I don’t know if they want an actual professional style peer review, but in my field it’s usually a succinct 3-4 sentence summary of the findings and their impact followed by a one sentence summary of the benefits/limitations of the paper.\n\nThis is usually followed by a bullet-point style list of “major concerns”, usually 1-3 but can be more or less. These usually focus on “big picture” elements or experimental changes that should be addressed. This is followed by another list of “minor concerns”, these can be content focused (e.g. the findings are good but the authors draw unreasonable conclusions), grammatical (e.g. the authors use inappropriate nomenclature), or technical (e.g. the authors western blot does not match IF images).",
      "author": "gradthrow59",
      "created": 1637764691,
      "upvotes": 3,
      "replies": {}
    },
    "hlx9zot": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlx9zot/",
      "text": "My peer reviews tend to be about one page (if the original paper was empirical) and have three paragraphs. My first paragraph overviews the purpose, methods and findings. The second paragraph outlines implications, contributions, and critiques. My third paragraph draws connections between the paper and other concepts we have discussed  as well as how the findings connect to the overall theory that drives the investigation. \n\nJust kidding, I always run out of room for the third paragraph and refuse to give my peers more than I am willing to read myself (about one page). I did have a professor provide this feedback a little while ago: \"This is good, but you are doing more than you need to.\" I'm not sure if she said this because it was really too much, or if it was because I ripped into a paper in which she was the co-author.",
      "author": "electriccroxford",
      "created": 1637774954,
      "upvotes": 2,
      "replies": {}
    },
    "hlynlae": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlynlae/",
      "text": "When I did this in a grad seminar we got the following instructions (I'm in the humanities):\n\nSubstance:\r  \n• Is it clear what the overall argument of the paper is? Can you identify the main premises and\r the conclusion?\r  \n• Is the argument valid? Is it sound? In assessing these questions, consider whether you can\r come up with objections or counterexamples to the premises.\r  \n• Are there places where the argument relies on intuitions that you do not share?\r  \n• Are there places where the argument overlooks relevant literature?\r  \n• Does the author correctly interpret or present other views with which it is engaging?\n\nClarity:\r  \n• Is it clear what each sentence is saying?\r  \n• Is it clear what each sentence is contributing to the paragraph?\r  \n• Is it clear what the main point of each paragraph is?\r  \n• Is it clear what each paragraph is contributing to the overall argument?\r  \n• Does the introduction do enough to clearly set up the paper?\r  \n• Does the introduction do enough to make the subject of the paper seem interesting/worthy\r of consideration?",
      "author": "AdvanceImpressive158",
      "created": 1637794629,
      "upvotes": 2,
      "replies": {}
    },
    "hlwdmxf": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlwdmxf/",
      "text": "Na yo, you're good. For real peer review the grammatical and structural stuff are usually already handled, but if not then it gets a comment. It will also I volve critiques of methods or other ideas the reviewer think should he covered. \n\nThere is a thing now called open peer review where the review comments and responses are published with the article. Try searching for some open peer reviews in you field to read them and get a sense of what it usually involves. \n\nOr ask your professor. Don't be embarrassed, they're there to teach and you to learn.",
      "author": "Pr0gr3s",
      "created": 1637761278,
      "upvotes": 1,
      "replies": {}
    },
    "hlwfdp7": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlwfdp7/",
      "text": "There is a great FREE course by elsevier on how to review a paper and all steps included. I really recommend it. If everyone did it, the peer review would be a high quality process.",
      "author": "AlayneSt",
      "created": 1637762161,
      "upvotes": 1,
      "replies": {
        "hlxbnc6": {
          "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlxbnc6/",
          "text": "Do you have a link to that?",
          "author": "notanothpsychstudent",
          "created": 1637775593,
          "upvotes": 1,
          "replies": {
            "hlxdsyn": {
              "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hlxdsyn/",
              "text": "https://researcheracademy.elsevier.com/navigating-peer-review/certified-peer-reviewer-course",
              "author": "AlayneSt",
              "created": 1637776436,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hm01bp6": {
      "link": "/r/GradSchool/comments/r117b2/this_is_embarrassing_but_how_do_you_do_a/hm01bp6/",
      "text": "Lots of great comment, suggestions and guidance here.  I just wanted to say that it sounds like you took the right approach.  I think you engaged in the process of learning how to do a peer review and now you have a better idea of how to go about it.  So, you’re not the asshole your peer was lazy and or afraid to engage in the process of learning.  You’re better off for having done so.",
      "author": "DicaxErsatz",
      "created": 1637817993,
      "upvotes": 1,
      "replies": {}
    }
  }
}