{
  "sid": "r3q0e9",
  "link": "/r/GradSchool/comments/r3q0e9/those_of_you_who_have_a_masters_in_history_was_it/",
  "title:": "Those of you who have a masters in history, was it worth it?",
  "text": "I graduated with a BS in history last December. One of my former professors nominated me to go to a recruiting event for grad school, where a few of those in attendance (6 in total) get offered full academic scholarships.\n\nI almost don't even want to apply anymore because I know if I'm offered the scholarship, I'll feel obligated to accept it. I have serious doubts that I actually want to work in the historical field. My family tells me it would be worth going just so I could get a master's degree, but I highly doubt it would make much of an impact outside of the historical field which I don't want to work in. \n\nI also don't want to spend 40+ hours a week sitting in my apartment alone reading, and then wearing a mask everywhere when I do step foot on campus. I'm also worried everything could go online again with these new variants. \n\nWhere are all of you now?",
  "author": "InternationalLake797",
  "created": 1638056001,
  "updated": 1638207969,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hmd5jz8": {
      "link": "/r/GradSchool/comments/r3q0e9/those_of_you_who_have_a_masters_in_history_was_it/hmd5jz8/",
      "text": "There are two reasons to do a masters\n\nYou are very passionate about the discipline, and would love to learn more.\n\nIt is important for your career goals.\n\nDoesn't sound like either of those things are true for you. Graduate school is very hard work. And without one of those things to motivate you, you might be miserable.\n\nSo get a job. There are plenty of people who go back to school for graduate degree later in life once they figure out for sure what they want to do, and why they want to do it.",
      "author": "raistlin65",
      "created": 1638075483,
      "upvotes": 5,
      "replies": {}
    },
    "hmd4pi1": {
      "link": "/r/GradSchool/comments/r3q0e9/those_of_you_who_have_a_masters_in_history_was_it/hmd4pi1/",
      "text": "Coming from someone who just recently finished an MA in history, I'd most certainly say it's not worth the time or money. Think of this in terms of inputs and outputs. You'll be putting in probably close to two years of time that you could either be working or finding a career and getting a degree that, given the atrocity that is the academic job market, holds little to no value. \n\nFor reference, I'm currently a retail manager.",
      "author": "jhowell98",
      "created": 1638075017,
      "upvotes": 2,
      "replies": {}
    }
  }
}