{"sid": "i9yafl", "link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/", "title:": "You know you're a grad student when...", "text": "So, I just got engaged a week ago. My labmates knew I was planning it, but I hadn't seen them since. Cut to last night, we're all having an informal social hour over Zoom when one of my colleagues says \"So, tell us about the proposal!\"\n\nAnd I respond with \"Well, my committee meeting isn't until next week but the project is basically about using...\"\n\nThat's when our post-doc cut in to remind me they were asking about the engagement, not my dissertation. \n\nThis life really does consume your every thought process at times, but I suppose we can at least have a laugh about it. Anyone else have a recent grad student related faux pas?", "author": "Doktor_Dysphoria", "created": 1597453288, "retrieved": 1632845166, "over_18": false, "upvotes": 1213, "upvote_ratio": 0.99, "comments": {"g242a8c": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g242a8c/", "text": "you call that a faux-pas? oh boy...", "author": "Javlington", "created": 1597851965, "upvotes": 1}, "g1njpbq": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1njpbq/", "text": "Congrats! \n\nLast week I had a telehealth call with my doctor to talk about OCD behaviors that are sort of out of control. I talked about my symptoms like it was part of a paper. Prepared an outline as well. Used “causation and correlation” and “P-value” in the conversation as well.", "author": "HighlyPolitical16", "created": 1597525431, "upvotes": 2}, "g1lvv9o": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1lvv9o/", "text": "Also got engaged during my PhD, and I did this exact same thing. Multiple times.", "author": "Dr_Silk", "created": 1597507029, "upvotes": 6}, "g1lr182": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1lr182/", "text": "Congrats!! I did something similar earlier this year after I got married... I took two weeks off after the wedding and on my first day back a post-doc saw me and told me congratulations. Really caught me off guard and I had to stop and think about it since I hadn't been working or even been in lab for a while... So I just said, \"for what?\"", "author": "overthinkitover", "created": 1597505505, "upvotes": 7}, "g1l066g": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1l066g/", "text": "Exact same thing. I recently had a baby and am also preparing to defend in a few weeks. I saw some people I hadn't seen since the baby was born. \n\n\"How are you doing? Are you getting any sleep at all?\"\n\n\"Well not really. I'm doing the best I can to manage my writing time but these edits are pretty time consuming.\"\n\n\"Oh, uh, I'm sorry to hear that. I meant the baby, though, is he keeping you up?\" \n\n😬", "author": "MissBee123", "created": 1597496319, "upvotes": 81}, "g1kq6tm": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1kq6tm/", "text": "Congratulations...hope all the best for you", "author": "Hazem2037", "created": 1597493100, "upvotes": 3}, "g1jcieg": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1jcieg/", "text": "Congratulations!", "author": "atchemey", "created": 1597472585, "upvotes": 3}, "g1ix1jz": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1ix1jz/", "text": "It took me a good minute to realize how \"proposal\" and \"engagement\" were related.", "author": "ivyprof", "created": 1597465981, "upvotes": 153}, "g1injd6": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1injd6/", "text": "Congrats on the engagement! Welcome to the fun world of trying to gather your data for a data defense + planning a huge party (which for me includes almost half my department)!  I did have a committee member ask about my future plans and I explained my work I wanted to do when we are allowed in the labs, but she actually was asking if I found a venue. If you have professors around that love weddings, expect more of those faux pas :)", "author": "Its_Just_Jen", "created": 1597461923, "upvotes": 26}, "g1ihcey": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1ihcey/", "text": "Hey congrats on the engagement! Oh, and I hope your project goes well.", "author": "2shizhtzu4u", "created": 1597458417, "upvotes": 41}, "g1ig145": {"link": "/r/GradSchool/comments/i9yafl/you_know_youre_a_grad_student_when/g1ig145/", "text": "Nothing to share personally, but congrats on the committee meeting and good luck on the engagement :)\n\nOr... actually it might be the other way around", "author": "aggressive-teaspoon", "created": 1597457621, "upvotes": 275}}}