{
  "sid": "qwdkzw",
  "link": "/r/GradSchool/comments/qwdkzw/anyone_have_personal_experience_with_humanities/",
  "title:": "Anyone have personal experience with humanities alt-ac?",
  "text": "Feeling very defeated by the academic job market, and having a lot of job anxiety (have never been particularly good at securing jobs) so trying to figure out a workable alt-ac path as a plan B while I have time.\n\nLooking at all the alt-ac sites, I can't help but feel like this cottage industry is just as cynical as the academic market. I tried using some of the job searches but they were trying to funnel me into crap jobs or jobs in industries I would never want to work in (corporate, banking, etc.)\n\nWould appreciate pointers, tips, personal experiences from folks who have been successful going alt-ac with a humanities degree! Thanks!",
  "author": "dramaturgicaldyad",
  "created": 1637196760,
  "updated": 1637354744,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {
    "hl3o9ep": {
      "link": "/r/GradSchool/comments/qwdkzw/anyone_have_personal_experience_with_humanities/hl3o9ep/",
      "text": "Can you define what “alt-ac” is to you?\n\nIt’s one of those words where people can have very different ideas about what it means, which can make it hard to discuss unless everyone is using the same definition.\n\nSo what makes something “alt-ac” to you, and what about alt-ac jobs makes them sound more appealing to you than non-academic jobs?",
      "author": "tentkeys",
      "created": 1637227446,
      "upvotes": 4,
      "replies": {
        "hl5b3nh": {
          "link": "/r/GradSchool/comments/qwdkzw/anyone_have_personal_experience_with_humanities/hl5b3nh/",
          "text": "Alt-ac isn't exactly \"more appealing\" more than the academic job market seems extremely unappealing now, having gone through it once and not had much success.\n\nI'm about 7 years older than most applicants so I don't have much time to waste, whereas a lot of the kids now can spend the next 1-3 years applying and reapplying. \n\nIdeally I'd love to still do something related to teaching/writing/researching/education but without the insane grind (like secondary teaching, for eg) or the insane application process.",
          "author": "dramaturgicaldyad",
          "created": 1637258048,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}