{
  "sid": "poy4sz",
  "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/",
  "title:": "Should I even bother applying to ivy leagues?",
  "text": "I’m a fifth year Chemistry major with a Neuroscience minor at Ohio State and was recently informed I will be published very soon in the Journal of Chemical Education which is a apart of the ACS. I have made a long journey since starting college where my gpa was atrocious for my first 2.5 years due to mental health struggles, but I am proud to say at the end of this semester my gpa will be vastly improved (will be around a 3.1). I was told I should apply to an Ivy League or a UC school because of this publication as I am a co-author with my professor. No one else is listed on the paper and I was told by peers that are already in graduate school that this is typically very impressive for an undergraduate and would possibly give me a shot at a prestigious chemistry PhD program at an ivy or one of the UC’s. Should I even bother applying based on my gpa? It is pretty obvious on my transcript that I have excelled in my upper level classes, but I’ve never been confident about myself even with this publication I just received.\n\n\nEdit: I know my 3.1 is not stellar, I just know had I have overcome my struggles before college I wouldn’t be in this position of having such low confidence about applying to a prestigious chemistry grad program.",
  "author": "Apocalyptic2020",
  "created": 1631737312,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hdguvgg": {
      "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hdguvgg/",
      "text": "I agree it depends. And your personal situation can influence things for the better. If you are able to write a story about what happened you can use your story to your advantage. That said based on what you have said so far; it’s a long shot. Go in with that mentality and you never know. But I would expect getting in.",
      "author": "LegallyThrownFarAway",
      "created": 1632062712,
      "upvotes": 1,
      "replies": {}
    },
    "hd1gg2q": {
      "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hd1gg2q/",
      "text": "I don't think JCE will be viewed favorably as it is a education rather than research journal. I don't think you will be competitive at elite programs. Apply to 1 or 2 as long shots. I suggest focusing on less competitive graduate programs.",
      "author": "fwafwa",
      "created": 1631765278,
      "upvotes": 0,
      "replies": {}
    },
    "hd0b8oh": {
      "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hd0b8oh/",
      "text": "Apply. I have several colleauges with PhDs from Cambridge and Master's degrees from Oxford who didn't even think of applying to those institutions, but had someone pushing them and telling them they were good enough. I contacted a professor at Oxford on a whim when I was applying to PhD programs, and he was super interested in being my advisor (I ended up not applying for other reasons). There are many of us who just assume we aren't Ivy League or Oxbridge material, so we don't apply, while less impressive people who apply are sometimes accepted. Just apply. You never know.",
      "author": "Interesting-Gold-720",
      "created": 1631745201,
      "upvotes": 4,
      "replies": {
        "hd0by0p": {
          "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hd0by0p/",
          "text": "How did you reach out to these professors being from a different school? Some of the ivy leagues and UC’s have some chemistry research groups that I am very interested in and I think that sounds like a great idea for me to reach out to them.",
          "author": "Apocalyptic2020",
          "created": 1631745523,
          "upvotes": 2,
          "replies": {
            "hd0d1vq": {
              "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hd0d1vq/",
              "text": "Definitely reach out! I contacted many professors, even the very well-known, \"legendary\" ones, and our exchanges were always positive and gave me even more confidence. \n\nWrite an email - keep it brief! - just stating something about yourself (for me I included where I did my previous degree and what I was working on at the time) and what you want to research for your PhD. Then ask something like \"is this something you would be interested in supervising\" or \"I'm very interested in your research group, would you consider someone with my profile and research interests?\"\n\nIn my experience, 90% of professors replied, and even if they couldn't advise me, they often recommended other professors for me to contact based on my interests.\n\nEDIT: also, my grades plummeted in 2nd year, but I managed to get excellent grades in 3rd & 4th year. I ended up with a full PhD scholarship in a globally top 10 department in my field. So don't worry too much!",
              "author": "Interesting-Gold-720",
              "created": 1631746029,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hczyj9q": {
      "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hczyj9q/",
      "text": "Applying to schools that are doing the research you want to do is more important than the prestige of the school. Having a good PI is also important. Look into those things before applying. I had a 4.0 in undergrad but didn’t apply to Ivys because none were a fit for my interests. \n\nAlso, college ratings are basically crap. Check out the latest season of the Revisionist History podcast for a great explanation of this.",
      "author": "Funkybeatzzz",
      "created": 1631739696,
      "upvotes": 9,
      "replies": {}
    },
    "hczw13i": {
      "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hczw13i/",
      "text": "Really depends on your recommendation letters and what your paper was actually about. A 1st author paper on independent research that contributed valuable scientific insights? Awesome! 1st author paper on using iPads as teaching aids in chemistry classes? Not really a good indication for or against your potential as a researcher.",
      "author": "johnnydaggers",
      "created": 1631738686,
      "upvotes": 7,
      "replies": {
        "hczx9b7": {
          "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hczx9b7/",
          "text": "The paper was one of the first python programs developed for chemistry students to perform a lab experiment online! I feel it was pretty substantial, much more so than ipads as teaching aids. I wouldn’t consider it something revolutionary, but very important especially during this period of the pandemic.",
          "author": "Apocalyptic2020",
          "created": 1631739182,
          "upvotes": 2,
          "replies": {
            "hd09bop": {
              "link": "/r/GradSchool/comments/poy4sz/should_i_even_bother_applying_to_ivy_leagues/hd09bop/",
              "text": "If you're applying to groups where python and/or software development is used then this is a good thing for you. If you're applying to bench experiment groups it will be slightly less helpful.",
              "author": "johnnydaggers",
              "created": 1631744326,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064898
}