{"sid": "j4d0ti", "link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/", "title:": "R/Professors is a scary scary place.", "text": "I’ve been a long time lurker on r/professors just to try and learn about the qualities professors look for in successful students but the only thing I’ve learned is that academia breeds narcissism and self importance. \n\nHere’s a professor who posted his syllabus today and holy shit. This person is such an asshole, they seriously expect students to prioritize their class over putting food on the table DURING A GLOBAL PANDEMIC. How do these people end up in teaching positions?? I really don’t understand this attitude and how it’s so well accepted to treat students like this.\n\n[sauce](https://www.reddit.com/r/Professors/comments/j47lth/open_letter_to_lurking_students/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "author": "galacticfartraisin", "created": 1601717899, "retrieved": 1632845278, "over_18": false, "upvotes": 613, "upvote_ratio": 0.92, "comments": {"g7xx9mt": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7xx9mt/", "text": "It's important to remember that subs like /r/gradschool and /r/professors have a strong selection bias towards people having a terrible time and need to vent, or people who might just have unreasonably strong opinions and little regard for other people. \n\nDon't take it to be a true cross-section of the demographic.", "author": "fruitshortcake", "created": 1602021295, "upvotes": 1}, "g7pq306": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7pq306/", "text": "P r e a c h. \nI feel like most people in that subreddit really just hate college students and they act like they have never been a student", "author": "royal_traveler", "created": 1601840600, "upvotes": 1}, "g7oishl": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7oishl/", "text": "My sister is a professor on the teaching stream, and she does say that a lot of professors (especially ones that are tenured/not on the teaching stream) really only care about their own research and only teach because they have to, so they half-ass it. Also academia seems not much different than any other industry. Research topics & fundings are often driven by money/corporate interests and trends. So for example, a lot of academics jumped at the opportunity to write a COVID research paper asap, but most of those papers turn out to be garbage. People form committees to look good, and not because they genuinely want to improve the quality of education they're providing. I'm honestly kinda afraid to spill all the juicy details I've heard from her over the years in case anyone online can identify her from the stories 😅", "author": "otterducksnake", "created": 1601820133, "upvotes": 1}, "g7ocpdi": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ocpdi/", "text": ".**Aaaaaaand his post has been deleted.**\n\nI am sure he is fuming in his beer somewhere. \n\nThis is why, good students, it's good practice to check in to class websites (r/gradschool) everyday. \nr/galacticfartraisin", "author": "panthersleeps", "created": 1601817224, "upvotes": 1}, "g7mxepn": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7mxepn/", "text": "There's a lot of pathetic whining in there for sure, but also a lot of normal and chill peeps who just wanna do a good job and are human too hah", "author": "totalitydude", "created": 1601795448, "upvotes": 1}, "g7m1sbh": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7m1sbh/", "text": "For those of you who got here after the post was removed, [I got sauce](https://www.removeddit.com/r/Professors/comments/j47lth/open_letter_to_lurking_students/).\n\nI meeeean a lot of it is pretty valid advice for students, but I agree #1 could have been worded better. Professors should be compassionate with students that have jobs and are paying their own way, etc. I've heard some pretty terrible reasons from students as to why their work wasn't done. There are more delicate ways to get the take-no-bullshit approach across.", "author": "the_stang_boy", "created": 1601783663, "upvotes": 2}, "g7lm5cf": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7lm5cf/", "text": "Please note the post was deleted and almost every OP comments were downvoted to oblivion. As someone who's been on both sides of the coin in the last few years...we do care, but we can only take you so far.", "author": "Perjink", "created": 1601778063, "upvotes": 2}, "g7le23r": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7le23r/", "text": "They are literal psychopaths. It's shocking. I think the profession actually selects for such qualities.", "author": "Ltrfsn", "created": 1601775339, "upvotes": 2}, "g7l897r": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7l897r/", "text": "The coward deleted the post smh", "author": "stathicus", "created": 1601773298, "upvotes": 2}, "g7kuesc": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7kuesc/", "text": "One of that professors comments on that thread has over 240 downvotes. He's a tool. Prick.", "author": "olixius", "created": 1601768860, "upvotes": 3}, "g7k8enj": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7k8enj/", "text": "Do not worry too much. I had a prof exactly like this. You can weed them out pretty quickly. They say interview your profs in the program you want. Find some good questions that can weed out this type of prof. You'll find someone brilliant and a decent person. Just know what to look out for. The prof I had who was like this, I had 2 classes with. Emailed him explaining how I had to work to pay for school, rent and food and he didn't care. Told the classmates in my final project group that \"i had just disappeared\". They know him for who he is now and no one has gone to him for undergrad research. It is a shame too, because I want to work on a fungi that would be right up his alley. I am saving that for maybe a post grad thing later on down the line. \n\nKeep your chin up. That professor is not akin to ALL professors.", "author": null, "created": 1601761170, "upvotes": 1}, "g7k5xzp": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7k5xzp/", "text": "I (a) never considered that /r/professors could exist (makes total sense, just never thought of it) and (b) I don't think I could mentally withstand subscribing there too. Witnessing all the misery in /r/PhD and /r/gradstudents is all I can take right now...", "author": "WhoThrewPoo", "created": 1601760342, "upvotes": 1}, "g7jytp8": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jytp8/", "text": "Well, to be fair, that post got 30% upvoted and the OP is getting dragged in the comments, justifiably, mind you. \n\nIf that person is even a professor, I feel sorry for their students, but based on the comments it seems like a lot of people in that sub disagree with the content and sentiment OP is trying to express there.", "author": "False-Guess", "created": 1601757896, "upvotes": 1}, "g7jygym": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jygym/", "text": "i read through some of the comments on that thread and all I see is a serious reading comprehension problem. The professor doesn't expect students to prioritize class over survival, he/she just makes it clear that regular work is not an excuse for missing classwork. Is this somehow controversial? You need to complete a certain amount of work to a certain satisfaction to receive a certain grade. Or are you suggesting that corona = give people As for free?", "author": "Hot_Opportunity_2328", "created": 1601757764, "upvotes": 4}, "g7jtzoo": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jtzoo/", "text": "That page makes me so sad—and so determined to be better. The majority of posts show such disdain for students. Why even teach if you hate your students?", "author": "ittollsforthee1231", "created": 1601756212, "upvotes": 1}, "g7js2sf": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7js2sf/", "text": "Yeah, I have not found that place to be representative of all my colleagues but definitely of a brand of colleague. I'm still recovering from the responses to this post:\n\nhttps://www.reddit.com/r/Professors/comments/iyq01g/university_students_these_days_are_so_entitled/?utm_medium=android_app&utm_source=share", "author": "Hpstorian", "created": 1601755556, "upvotes": 1}, "g7jfbql": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jfbql/", "text": "(slow claps)", "author": "beautifulcosmos", "created": 1601751165, "upvotes": 1}, "g7jdgp0": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jdgp0/", "text": "Dude got downvoted to hell, so I'm not really of the opinion that is representative of the sub.", "author": "iamjacobsparticus", "created": 1601750519, "upvotes": 3}, "g7jc7e5": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jc7e5/", "text": "Reading through this comments section it's obvious who has taught and who hasn't. Yes, that specific op was an ass. However if you honestly think teaching is all roses and daisies and if you just love and value your students and give it your 100% best and they'll do they same, you're believing in a fairy tale and you're going to be extremely disillusioned. Especially with the classes we grad students teach (usually 100 level gen ed requirements like freshman comp or whatever) our classes are hoops to jump through. Maybe 2/20 will want to be there because they're nerds like us, 14/20 will just keep their heads down and do the work, and then the last 4 will be actively resisting you the entire way because they resent they'll have to take your class at all. They will fail, not at the skills you're trying to teach, which is understandable--they will fail at READING AND FOLLOWING BASIC DIRECTIONS. And then they'll blame YOU because they didn't show up to class all semester or turn in homework, and best case scenario they just send you passive aggressive, blame-deflecting emails, worst case scenario, they'll escalate and try to make your life hell. And heaven help you if you happen to get a football player who tries to leverage THAT. All this to say, there are a lot of terrible students out there, and teachers deserve a place to vent about it. Don't judge them until you've taught classes yourself.", "author": "joliepachirisu", "created": 1601749906, "upvotes": 3}, "g7jbwwp": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jbwwp/", "text": "One of many reasons I hope to one day rise to a position of power and fight the system. Far too many mediocre faculty who haven't made any worthwhile contributions and get intimidated rather than excited about new challenges.\n\n\"Those who need tenure don't deserve it, and those who deserve tenure don't need it.\" \\~a friend of mine, who's a professor in microbiology", "author": "Palerthanghosts", "created": 1601749764, "upvotes": 2}, "g7jat2e": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7jat2e/", "text": "Sadly, I agree with you. That sub is quite toxic and negative. I worked in industry prior to grad school, and while I think every vocation has its pros and cons, HE faculty seem to have many more grievances about their job both on reddit and irl. Just read any other vocational subreddit or hang out with non-academic people, they aren’t nearly as miserable. I enjoy my PhD and get on great with my supervisor, but there’s no way I’d continue in academia after this. I’ve got one life to live, and I’m not spending it around folks who hate theirs.", "author": "gold-ukthrowaway", "created": 1601749229, "upvotes": 3}, "g7j9k01": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7j9k01/", "text": "Academia is a shithole. It is what it is. My PI is very humble and down to earth, and I'm grateful for that, but so many professors are so narcissistic that it just ruins it for everyone else.", "author": "cascaderade", "created": 1601748628, "upvotes": 2}, "g7j5fjy": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7j5fjy/", "text": "I agree, I lurk there sometimes too and I once saw a prof (from my school) post the contents of an email from a student and mocking them. This was awhile back and they didn’t put in the student name, however the student mentioned a friends first name in that email and that part was left in. I’m cool with the venting bc most professors are pretty underpaid and teaching can be stressful, but some of it is toxic.", "author": "whitcantfindme", "created": 1601746415, "upvotes": 2}, "g7j53pd": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7j53pd/", "text": "I've heard similar things about that sub and as a new professor I have avoided it.  Maybe other younger professors are doing the same?", "author": "botanygeek", "created": 1601746230, "upvotes": 3}, "g7j4aqc": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7j4aqc/", "text": "honestly if i ever wanted to get into academia this sub has killed that. on this sub i rarely hear of someone who works in academia or is pursuing their PhD and genuinely seems to enjoy it.", "author": "Texas_Rockets", "created": 1601745794, "upvotes": 1}, "g7izzvk": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7izzvk/", "text": "> academia breeds narcissism and self importance.\n\nThis 100%. I'm in the huminaties and I think they are important. But we're not curing cancer. Everyone needs to get the sticks out of their asses.", "author": "revolutionPanda", "created": 1601743400, "upvotes": 2}, "g7ivpcr": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ivpcr/", "text": ">the only thing I’ve learned is that academia breeds narcissism and self importance. \n\nI figured this out within my first year of undergrad. Why else do you think some professors spend an entire class listing off all their achievements? They need their students to practically worship them because that's what their egos desire. The more sane ones don't need to prove anything to you and they just get on with teaching.", "author": "lead999x", "created": 1601740959, "upvotes": 1}, "g7ivbjp": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ivbjp/", "text": "Your conclusions are unfair. We have specialized subs that are special places we can talk, laugh, cry, and scream all we want to people who will be able to relate, it's a no-filter safe space for people to unload and better themselves to people who know what they are going through. Some stuff I've seen and personally posted on r/gradschool would have undergrads thinking grad school is the worst time sucking, all work no reward place, which it is, but it's so much more than that and I would never talk about grad school in such a one sided manner to others who weren't in grad school experiencing the same as me. Don't go in and judge what you see by your own views (ethnocentrism), because that's their world and let them have it. Imagine the professors who finally have a safe space to bull shit about work and now students are adding their private comments to rate my professor.com, now where will they go rant about shit students, fair or not. To criminalize a group of people off of material they spouted into existence in a reddit sub is a thought crime. \n\nTl;dr not fair to judge a group by their sub. People need a place to talk nuances in peace.", "author": "ForSureYo", "created": 1601740739, "upvotes": 5}, "g7it8d8": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7it8d8/", "text": "See, I thibk that sub is much like this sub. Its bitchy, pissy, moany watercolor talk and nothing more. A lot of them are upset at their students like you all are at PIs and the system. \n\n\nWe all need a place to vent without fear of consequences irl.", "author": "Ytterbro", "created": 1601739575, "upvotes": 6}, "g7isu2d": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7isu2d/", "text": "That sub is insane. Our education system is insane. You have to go to so much trouble just for access to the information you need and then it's all about being graded on what you've learned instead of just being about learning the information. Im very depressed", "author": null, "created": 1601739352, "upvotes": 1}, "g7iqem8": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7iqem8/", "text": "I don’t even understand the motivation for this.\n\nLike at least being sociopathic towards your grad students makes sense, you want to keep squeezing research and publications out of them as much as possible and giving them slack might lead to a setback in that, but why do you even care about classes that way? What will you lose by giving an extension on an assignment?", "author": "RedElephantWhale", "created": 1601737959, "upvotes": 1}, "g7io89x": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7io89x/", "text": "Reddit brings out the most miserable people. You have to take everything there and here with a big grain of salt. I don't know that this is typical or that academia breeds narcissism or self importance more than any other field. I think the issue is more that people expect it to be better than corporate offices and it's really not any different.", "author": "mediocre-spice", "created": 1601736635, "upvotes": 7}, "g7io1i6": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7io1i6/", "text": "Disclaimer: I'm not a prof or a TA, but I've been a tutor for some years now.\n\n\nWhile I agree that the 2nd point in the OP is on the harsh side, I think we need to also recognize where the guy's coming from. I attend and tutor at institution known for being extremely rigorous at the undergrad level, and I've definitely encountered students with unrealistic expectations for their own time. It's like... I understand you want to work during school so that you can graduate with less debt, but you also have to understand that studying takes time. I've definitely had at least one student who tried to use the the \"I work 40h a week and that's why I bombed this midterm\" line.\n\n\n\nEDIT: spelling/grammar", "author": "Hayw00dUBl0wMe", "created": 1601736522, "upvotes": 6}, "g7in2ir": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7in2ir/", "text": "r/professors really isn’t that bad. This guy is out of the norm. They mostly just complain about how much work they have to do or stupid questions from students.", "author": "fserv11", "created": 1601736006, "upvotes": 35}, "g7iktia": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7iktia/", "text": "Grad student who also teaches calculus here;\n\nSome of the points are fair or partially fair, but mostly they suck or are lacking empathy / thoughtfulness (especially the “class > job” bullshit). \n\nWrote a fuller response on the post itself.", "author": "realFoobanana", "created": 1601734851, "upvotes": 6}, "g7iklwh": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7iklwh/", "text": "You’d be surprised how many assholes exist in academia apart of decent people with a heart and conscious mind.", "author": "ggplot6", "created": 1601734749, "upvotes": 2}, "g7ik0gh": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ik0gh/", "text": "Yes, as written that does read as \"screw your job, MAH CLASS!\"  \n\n\nBut the entire thing clearly reads to say that the Professor is tired of answering questions he has already answered numerous times, but the student wants their own special answer at their own special time without any effort.  \n\n\nThat particular point about job vs class is meant to indicate that you cannot justify your performance in the class based on factors outside of the class.  All of your classmates also have some life outside of class, all of them realize that they voluntarily decided to pursue a degree, and that they have to prioritize it within the rest of their life, or make the realization that it may not be the right time to be trying for a degree for them personally.\n\n&#x200B;\n\nAs a good student, the kinds of things your classmates attempt will blow your mind.  I recall in my undergraduate time I overloaded every semester, but took a theater class in the middle of the day as a mental break.  One year another student in the class came for the first 2 classes of the semester, then disappeared.  They came back for the last class of the semester and said \"Yeah, I broke my leg, so I missed a few classes, is that cool?\" And the teacher asked if he was sure he could handle being back or not.  \n\n\nNow... for all I know the dude was a theater major, and regularly met outside of class with the professor.  But in that moment, I saw a guy who showed up for 3 classes out of the 48 in the semester, and still passed.  \n\n\nAs a TA, I have seen similar, in the sciences even.  I ran some labs, we would have 13 in the semester.  Had a student miss the first 5 because they had various medical appointments, the next 3 because of family emergency, and then showed up for the last 5.  They dodged all questions about the work missed, ignored all emails and discussions indicating they had already failed the course.  Then on the Friday of finals week, at 1pm, asked when they could schedule make up labs.\n\n&#x200B;\n\nSo yeah... professors start out all sunshine and rainbows with idealistic hopes and dreams.  The few bad students each semester slowly beat the professors down until they are jaded bastards who are completely inflexible.", "author": "xienwolf", "created": 1601734440, "upvotes": 24}, "g7ijy6j": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ijy6j/", "text": "[deleted]", "author": null, "created": 1601734400, "upvotes": 9}, "g7iiiy9": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7iiiy9/", "text": "I just went through that post and big yikes. Yes- let’s fill every line of this syllabus with negative language (almost EVERY LINE started with don’t) and chastise those who are doing anything possible to survive. \n\nAnd to see others comment saying then take a semester off, drop out, toughen up, I did it so can you. As if they did it through a global pandemic, a national affordable housing crisis, and with inflation rates out the wazoo. All furthers the reason why I constantly question continuing to pursue tenure track positions.", "author": "mudionduty", "created": 1601733568, "upvotes": 2}, "g7iibzo": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7iibzo/", "text": "Never seen the sub before, but reading through the dumb, lazy or just plain dishonest shit they deal with on https://www.reddit.com/r/Professors/comments/j46blo/best_student_wtf_of_the_week/, I'm getting pretty sympathetic to the professors. If you keep seeing the worst imaginable behaviour from students, it's no surprise you default to not thinking of them as people anymore.", "author": "alienangel2", "created": 1601733467, "upvotes": 12}, "g7ihd0z": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ihd0z/", "text": "Narcissists thrive in academia...", "author": "Extreme_Pomegranate", "created": 1601732946, "upvotes": 4}, "g7ig9fy": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ig9fy/", "text": "OP in that sub is an asshole, but did you see how everyone tore them a new one? Their attitude isn’t the norm. I’ve literally only ever seen my professors or my colleagues act with compassion.\n\nETA: In undergrad, I had a professor let me reschedule a quiz because I had lost my gecko and I needed to try and find her. Found her a month later, but still, lol.", "author": "nerdhappyjq", "created": 1601732307, "upvotes": 179}, "g7ig3f2": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ig3f2/", "text": "I lurk there too but work with/am friends with many faculty that I've seen go from grad school through tenure. There's a wide range of experience with students within r/professors and in the real world, and at many schools there is a culture of students really, really trying to shirk their work, leaving instructors feeling like the students are the ones entitled.\n\nThere's a big disconnect between profs and students. Most students have little to no idea what life is like as an academic and how demoralizing it is when they offer to help a student only to be ignored until immature pleas right when grades are due. Most profs have little to no idea what it's like to be an average student; you're able to become a professor in part because you were good at school, but that doesn't come naturally for many students.\n\nThe tone you saw in that post wasn't so much entitlement as anger and frustration. That prof needs a leave, and I hope they have a mentor or peer who can help them. The question isn't \"how do these people end up in teaching positions\" but rather \"how did someone become this kind of teacher\"?", "author": "dcgrey", "created": 1601732205, "upvotes": 17}, "g7ie9cw": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ie9cw/", "text": "That professor sounds like an ass. I’m so glad I’ve had awesome professors in my colleges.  A lot were more than ok if I handed in an assignment a day or two late as long as I cleared it with them and told them I’m in school 8-12:30ish Monday through Friday and work 2-10:30 Monday through Friday.", "author": "Redd889", "created": 1601730986, "upvotes": 5}, "g7idr12": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7idr12/", "text": "Yeah, I’ve seen that jagoff pop up a couple of times. Glad that the worst of it is getting downvoted. I’ve always believed that the biggest problem lies in these facts:\n\nA) Most professors in the real world will not be at big R1s and will therefore have more teaching-focused jobs.\n\nB) Terminal degrees are overwhelmingly awarded at big R1s, where professors’ advancement, pay and job security is rarely tied to teaching performance. These professors tend to have very little teacher training and are even disincentivized to be dedicated to their teaching. \n\nIt follows that with the exception of rare bright spots, grad students are trained as if they will work at research-focused jobs and given very little formalized teacher training. Good teachers coming out of R1s are more often than not autodidacts, people with previous teaching experience, or the people who didn’t really fit into their terminal degree program to begin with.", "author": "Harmania", "created": 1601730621, "upvotes": 28}, "g7idjs3": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7idjs3/", "text": "I follow both of those subs (I just graduated grad school and am starting my job as an assistant professor). I actually think that sub is a lot better. This one is 70% venting about grad school sucking, bad advisors, and a lack of a social life, and then it’s 30% really helpful resources or legitimate questions. That sub is a good 50% venting, and don’t get me wrong I definitely don’t agree with all of it, but it’s also a good 50% resources.\n\nThe more you teach, the more I think the venting will make sense to you. And if you look through the thread you highlighted you’ll notice that the OP did get critiqued for that point about prioritizing his class. So it’s not like the sub is a toxic pool of hate—they call out the BS a lot more than I’ve seen on this sub.\n\nThat sub has also been so helpful in giving me ideas about how to write good exam questions, how to encourage students to come to office hours, what kind of boiler plate language to put in my syllabus, how to handle student cheating, how to be compassionate towards students, how to talk to your colleagues and navigate office politics, how to balance teaching and research, etc. There’s some bad posts every now and then, but they tend to get called out in the comments and there’s way more bad than good.\n\nIf you don’t believe that happens here, look for one of the meta posts that gets posted every so often where someone basically says “I read all these posts and grad school sounds so awful, why would I ever want to go?!” And then the comments are people going, “no, it’s not that bad, there’s lots of good stuff too...” The overwhelming view on this sub is negative, it’s just directed at ourselves and sometimes our advisors instead of students so you think it’s somehow better. It’s not.\n\nAlso, I see one of these posts here every now and then about r/professors being toxic. Look, if a sub isn’t for you then it isn’t for you. But as you teach more and more I encourage to you lurk there and look for tips. And yes, when you’re having a bad day it’ll be much healthier to go vent there than to take it out on your students or anyone else.\n\nTLDR: rhat post you highlighted was dumb but hardly representative of the sub as a whole, and overall I think that sub is more useful and less venting than this sub", "author": "zarza_mora", "created": 1601730467, "upvotes": 168}, "g7idinq": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7idinq/", "text": "Holy shit, OP in that thread was a total asshole. It’s unfortunate that so many profs think that way. I’m glad I went to a community college and adjuncted for a few years. It really helped me see the human side of students. \n\nThat, and I’m capable of basic empathy.", "author": "Dawalkingdude", "created": 1601730432, "upvotes": 11}, "g7idi2m": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7idi2m/", "text": "To get a professorship you don't need to be a good teacher or supervisor and you don't get proper training to become either.  \nYou need to get those publication and funding numbers through the roof, neither reflect your skill as a teacher (and only partially as a supervisor).", "author": "LittlePrimate", "created": 1601730413, "upvotes": 3}, "g7idehn": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7idehn/", "text": "Not surprised tbh. I was conditioned early not to expect compassion from professors", "author": "superdrolic", "created": 1601730300, "upvotes": 1}, "g7ib5c8": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7ib5c8/", "text": "Agreed. But being brilliant in your field doesn’t make you a good person or good teacher. On the bright side, the top voted comment is basically saying what you are, so clearly many do not agree with them.", "author": "jro727", "created": 1601725204, "upvotes": 479}, "g7iay0u": {"link": "/r/GradSchool/comments/j4d0ti/rprofessors_is_a_scary_scary_place/g7iay0u/", "text": "Also some in AskAcademia sub are like that, but not everyone. I haven’t gone through this sub yet but I assume it’s worse lol.", "author": "cobie1em0ji", "created": 1601725087, "upvotes": 45}}}