{
  "sid": "pzh5l5",
  "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/",
  "title:": "The opposite of Imposter Syndrome",
  "text": "Does anyone here not have Imposter Syndrome and feel like you are good enough, or perhaps even better than the other people in your program?",
  "author": "frugaldutchman",
  "created": 1633122397,
  "updated": 1634099982,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.9,
  "comments": {
    "hf0zx51": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf0zx51/",
      "text": "Don’t listen to these people who wish you had lower self-esteem. There’s nothing wrong with being confident in your abilities.",
      "author": "HouseNegative9428",
      "created": 1633126521,
      "upvotes": 58,
      "replies": {}
    },
    "hf1yjj9": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf1yjj9/",
      "text": "Yes, 100% this. I know that I got better grades in almost every class than many of my classmates. I was also able to do my work in a fraction of the time that others said they spent. I do sometimes feel like I'm being arrogant or something, but I wouldn't ever say that to classmates. So I don't think it's bad to be confident and know that you are rocking it in your program!",
      "author": "maketheworld_better",
      "created": 1633143818,
      "upvotes": 19,
      "replies": {}
    },
    "hf21hzo": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf21hzo/",
      "text": "I try not to have imposter syndrome. I think I’m fine knowing that I sometimes feel it. So I give myself a must needed pep talk from time to time. It goes a little something like this: \n\nLive your best self! If you know it, then you know it. 😆 \n\nThis does not mean you belittle others though. Help others that know less than you. Don’t dumb yourself down when you’re with others that may have less than you…just to fit in. \n\nNot having imposter syndrome in my opinion is just being your best self, allowing yourself to be passionate about your craft, even if you don’t know all of it or if you’re not the “best”. You are willing to learn and you are comfortable with failing because you know that after failures, you grow and be better.",
      "author": "Oniko_2009",
      "created": 1633145479,
      "upvotes": 8,
      "replies": {}
    },
    "hf3u4zq": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf3u4zq/",
      "text": "... and what if you oscillate between the two? I am like that; some days I feel I am not good enough, some other like I am good enough",
      "author": "Normal_Kaleidoscope",
      "created": 1633187871,
      "upvotes": 6,
      "replies": {
        "hf4al8g": {
          "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf4al8g/",
          "text": "Same.",
          "author": "Plutonium_Nitrate_94",
          "created": 1633194934,
          "upvotes": 3,
          "replies": {}
        },
        "hf4ri05": {
          "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf4ri05/",
          "text": "Sometimes I do this. When I compare myself to some others from my program I'm like, \"their thesis was so easy, and not as in-depth as mine\". But when I go to conferences or communicate with my committee I'm full on imposter syndrome.",
          "author": "daltosax",
          "created": 1633202251,
          "upvotes": 2,
          "replies": {
            "hf7qa6b": {
              "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf7qa6b/",
              "text": "My impostor syndrome is quite rampant when writing papers... I've got to convince myself that I have to write what I think with no fear. I wrote a paper for a high rank journal and I was petrified, I swear. Then reviews came in... And they weren't bad! Deep inside I knew the paper wasn't bad, but my impostor syndrome tried to convince me otherwise",
              "author": "Normal_Kaleidoscope",
              "created": 1633260875,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hf37qn3": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf37qn3/",
      "text": "My coworkers are a black hole of insecurity and I'm supposed to constantly validate their experience by being equally insecure. I wouldn't say I'm better than them except at certain skill sets which are my particular area of expertise however they have their own skill sets and knowledge. But good God, if I listened to them I'd truly believe that our PI is Satan incarnate. I don't know how they even have time to do all the shit talking they do, especially if they're really as busy and overworked as they claim to be. It honestly feels extremely high school at times, particularly with the other women who talk about their weight often (they're very thin, bordering medically underweight- their words, not mine), and also going on about ohhhh so and so was flirting with me, ewwww etc. etc. Not that I'm particularly friends with my boss, but he has never made me feel like I took crazy pills or stepped into a time machine and ended up back in 6th grade. So yeah, they're smart and capable, just maybe not mature or emotionally intelligent enough to handle our department.",
      "author": "erehin",
      "created": 1633176553,
      "upvotes": 12,
      "replies": {}
    },
    "hf4f42h": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf4f42h/",
      "text": "I'm so glad I'm not the only one. It feels like the rest of my cohort thinks they're totally incompetent and I'm the weird one for having full faith in myself ???",
      "author": "RILES2987",
      "created": 1633196859,
      "upvotes": 4,
      "replies": {}
    },
    "hf17j8i": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf17j8i/",
      "text": "Good to know your strength but be mindful that they also have their strengths and it might shine in other class subjects/topics!",
      "author": "MotvStr",
      "created": 1633130185,
      "upvotes": 19,
      "replies": {}
    },
    "hf2azzp": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf2azzp/",
      "text": "Yes me here. I just aim for good enough. I'm good enough to achieve what I want to do and that's enough for me. And if I currently don't have the skills I have the capacity to one day get there.\n\nObviously I'm not good at many things but I don't consider that imposter syndrome. It's not imposter syndrome when you just actually suck at something but you can acknowledge it and work on it to get better. \n\nI actually frequently have the very opposite experience of imposter syndrome where people would first meet me and immediately assume that I'm not good at the things that are literally my best strengths. Like I can see the bias they harbor and how they immediately underestimate me from the start, which as I've learned can often work in my favor. Their mistake really. \n\nAlso the older I get the less I care for people's opinions, which helps.",
      "author": "PumpkinCrumpet",
      "created": 1633151527,
      "upvotes": 10,
      "replies": {}
    },
    "hf3hhai": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf3hhai/",
      "text": "I don't think I'm better than other people in my program because people just have different strengths and I don't really think there's a use comparing myself like that to them. I may be better at certain things, but I'm not better overall. \n\nBut yeah I definitely feel like I'm good enough to be in grad school. Am I perfect at everything? Of course not, but that's why I'm in school. A lot of it is because there's a culture of communicating in my department and program and because my lab and advisor are great. If I had a shitty advisor and an overly competitive program, I don't know if I'd feel the same way.",
      "author": "KiwiTheKitty",
      "created": 1633181817,
      "upvotes": 3,
      "replies": {}
    },
    "hf4qgsh": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf4qgsh/",
      "text": "I don't feel like I have either imposter syndrome or the opposite, I'm just here doing my work. I'm doing fine based on feedback from my professors, and so far teaching is going well. I have had a few moments where it just hit me, \"woah, I'm actually here, in grad school, being a grad student like the other grad students, that's wild!\" but it wasn't that I felt like an imposter, just that I was marveling at how far I've come. \n\nI think the fact that I don't feel like an imposter is because I'm just generally more grounded and confident in myself as a person. I'm not plagued as much by the what ifs and incompetence I felt during my undergrad and first few years working. I was out of school for almost 6 years before starting a masters this year, and I grew up a lot during that time. I know what I'm good at and bad at, I'm better at accepting criticism, and I don't feel like I need the friendship of the other students, I'm more ok with it if they don't like me. Now, to some extent I still fight against those negative impulses, I still have periods of nervousness about a project or worry about building good relationships, but they don't drive me like they used to.",
      "author": "AnonAltQs",
      "created": 1633201796,
      "upvotes": 3,
      "replies": {}
    },
    "hf5ovi6": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf5ovi6/",
      "text": "Unfortunately my masters research class at a state school where most aren't getting PHD is feeling like this by week 6 semester 1, \n\n\nI got a 4.0 in same degree same college but I am leaving this country after this degree so figured I'd stay and grab another shiny paper.\n\n So I absolutely have a leg up and people in class are starting to treat me as way smarter than I am because I do the work, put in extra time for this class specifically because quantitative stuff is harder for us qualitative minded folks, and so I know quite a decent amount about social sciences in general by now, because I took way longer than I should have in undergrad. It's legit undergraduate level research methods so far imo. Just surveys and methodologies in Qualtrics and some readings.  I hate to see these folks when the coming weeks are SPSS and R, GiS.",
      "author": "Anarchy_Lurker",
      "created": 1633216867,
      "upvotes": 3,
      "replies": {}
    },
    "hf480zm": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf480zm/",
      "text": "I would be careful of the Dunning-Kruger effect. I had high confidence at the beginning which all came crashing down when I realized I didn't know 10% of what I needed to in order to finish my PhD. The last few years have been building that confidence back up. I would say if you feel like you are better, but don't have any papers to back it up, check yourself.",
      "author": "Superduperbals",
      "created": 1633193854,
      "upvotes": 5,
      "replies": {}
    },
    "hf22hoy": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf22hoy/",
      "text": "Yes! I’m a first year in a program that attracts a lot of professionals from a variety of fields. I came here directly from undergrad with a strong background in the material. So, all of the courses I’m taking are review for me and most of my peers are less experienced in this area than I am. It’s still a little weird, but in the end my PI is brilliant and that’s who really matters the most when it comes to learning to be a researcher.",
      "author": "Zam8859",
      "created": 1633146051,
      "upvotes": 2,
      "replies": {}
    },
    "hf3nv1f": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf3nv1f/",
      "text": "I can’t imagine anyone getting a PhD in the hard sciences saying yes to this. Maybe I met one guy… even him I would say honestly not even in my top five best all time. If you seriously think you are the smartest person in your program then you just might be too stupid to realize that there is no such thing.",
      "author": "LegallyThrownFarAway",
      "created": 1633184938,
      "upvotes": 3,
      "replies": {}
    },
    "hf0tr3z": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf0tr3z/",
      "text": "So... Arrogance",
      "author": "Single_Blueberry",
      "created": 1633123521,
      "upvotes": -14,
      "replies": {
        "hf32139": {
          "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf32139/",
          "text": "No. It's possible for some grad students to be just secure.",
          "author": "ozzalot",
          "created": 1633172604,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hf0v2r7": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf0v2r7/",
      "text": "Narcissism?",
      "author": "phdreaming234",
      "created": 1633124159,
      "upvotes": -15,
      "replies": {}
    },
    "hf31w55": {
      "link": "/r/GradSchool/comments/pzh5l5/the_opposite_of_imposter_syndrome/hf31w55/",
      "text": "As someone intimately aware of mine and others cases of IS, no, don't worry, not everyone must be afflicted with IS. Perhaps it's rare but not that rare at all. \n\nJust make sure you aren't being too cocky. I was aware of two individuals in my department who scoffed at the idea of IS - they also were the type that always had the \"correct reaponse\" or the \"right retort\" to like...anything you would say to them. Like...to the point you just wanted to stop talking to them. When prelims A and B came around, they crashed and burned very quick. \n\nI think the fact that you pose the question precludes you from this group anyways.....",
      "author": "ozzalot",
      "created": 1633172501,
      "upvotes": 1,
      "replies": {}
    }
  }
}