{"sid": "hunzw7", "link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/", "title:": "I'm gonna quit and I'm excited but also terrified", "text": "I started my program and it became quickly apparent that I had a strong dislike for the work and the project I was doing. I decided very early on that I didn't want to be a career scientist, and that nothing about this degree seemed like it was worth the time. \n\nThen, the pandemic hits. Productivity hits an all-time low, and I genuinely stop caring about my project, causing my PI to stress to no end. I thought to myself, \"OK. When the lockdowns end, I'll go back to the city and try one more time to see if I can get back into lab work. Then I'll make a decision.\" And guess what? I hate it even more now. I just can't see the point in this. So I'm going to quit. Have a couple interviews lined up back home. \n\nSo where am I going from here? Well, medical school is something I've always been passionate about pursuing, but something that also initially scared me off when I finished my undergrad - which is what caused me to go into grad school. Now that I have 100% confirmed what I want my path to be, and I know what it will take to get there, I feel confident about leaving this program and pursuing what I really want. \n\n&#x200B;\n\nAnyways, rant over. Thanks for listening.", "author": "m0bin16", "created": 1595261403, "retrieved": 1632953925, "over_18": false, "upvotes": 366, "upvote_ratio": 0.98, "comments": {"fyqmenh": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyqmenh/", "text": "I just told my PI last week that I’m mastering out and damn it still feels good. I had a similar experience to yours and I’m confident that what I’m doing now is not what I want for the next 4 years. Good luck!", "author": "punnugget42", "created": 1595310031, "upvotes": 3}, "fyqemwl": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyqemwl/", "text": "Good for you! I have been in the same boat before. I quit grad school and started a second bachelors. I quit that to go back to grad school and finally finished a year and a half ago. Now I’m getting a terminal post masters degree in the same field. It’s a journey sometimes to find out what you really want. I did go into some debt for it, But I’m still glad I learned so much about myself and found something I’m passionate about instead of sticking with something for the sake of consistency when I wasn’t happy. Congrats and best wishes on your new journey!", "author": "maureenpurrnderosa", "created": 1595304284, "upvotes": 3}, "fyq7mtv": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyq7mtv/", "text": "I mastered out a few months after passing my prelims. Toughest decision ever but it was the right one in the end. Felt great after I had decided to do it too.", "author": "lildil37", "created": 1595299817, "upvotes": 3}, "fyq5wfa": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyq5wfa/", "text": "Congrats. As someone who has done both I’d say they suck in different ways. Be careful how you frame “quitting” on your application", "author": "CharlieMayne", "created": 1595298776, "upvotes": 3}, "fypz1go": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fypz1go/", "text": "Good for you! Sounds like a great relief to feel like you have a confirmed sense of direction. I wish you all the best. Take the bull by the horns and ride off into the life you really want.", "author": "Hot-Pretzel", "created": 1595294752, "upvotes": 2}, "fyps0mc": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyps0mc/", "text": "It’s great to know so surely what you don’t want and to have the courage to leave it behind. Best of luck to you!", "author": "SavesNine9", "created": 1595290671, "upvotes": 2}, "fypbkwk": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fypbkwk/", "text": "You made the right choice.", "author": "MrUnknown1996", "created": 1595281982, "upvotes": 3}, "fyp9wau": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyp9wau/", "text": "Me right now ! We got this. Godspeed", "author": null, "created": 1595281158, "upvotes": 3}, "fyp33tx": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyp33tx/", "text": "I work for a medical school helping their students adjust to the program and learn the level of time management and study strategies required to be successful. Your story is a great one for your personal statement, since you can confidently say medical school is your “calling”, and can back it up with a story of trying to ignore that with grad school and still ending up back at your original passion. :) Best of luck!", "author": "PhDdegreeBurn", "created": 1595277814, "upvotes": 9}, "fyottnr": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyottnr/", "text": "Good for you! I’ve also thought quite a bit about quitting my program all together and also about switching majors and going the business route but that would require me to start over. Long story short, I still have no idea what I’m going to do considering COVID isn’t getting better, I’m going into year 2 of my masters, haven’t started my thesis and my thesis relies on human subjects so honestly don’t see that happening anytime soon. But I hope everything works out for you and do whatever makes you happy! :)", "author": "foodgeek19", "created": 1595273264, "upvotes": 4}, "fyorxb4": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyorxb4/", "text": "You should definitely reflect a little on what made you hate grad school...you don't want to leave and jump straight into another super intense program before you've identified exactly what the issue was. \n\nFor example, I hated grad school and thought my life would be peachy once I got out of academia. Turns out I just don't like working on one thing for too long. Lots of short, always changing projects is what I like...not focusing on one thing for 5 years. \n\nNot trying to cast doubt on what you've decided, but don't jump out of the frying pan and into the fire unless you know that being a physician is going to make you happy.", "author": "wretched_beasties", "created": 1595272340, "upvotes": 25}, "fyoq631": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyoq631/", "text": "[deleted]", "author": null, "created": 1595271488, "upvotes": 12}, "fyonw1i": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyonw1i/", "text": "You and I are one. Currently studying for mcat and im trying to master out of my program. If you wanna chat about the emotional terror and uncertainty that comes with quiting what your doing and trying something new DM me.", "author": "mishandle123", "created": 1595270396, "upvotes": 30}, "fyolbor": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyolbor/", "text": "congratulations! do whats best for you :D", "author": "salt_mermaid", "created": 1595269166, "upvotes": 2}, "fyokmqk": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyokmqk/", "text": "I mastered out! And Oh My Gawwwd! I am so happy. It was a tough decision to make but I made a pro/con list and I got a job! I wish you the best in your endeavors!", "author": "bootae_wae_wae", "created": 1595268830, "upvotes": 58}, "fyoijgw": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyoijgw/", "text": "I literally just made the same choice about 5 days ago. I was doing well, but wasn’t really enjoying it. Pandemic happened, motivation completely tanked and so did my grades because I just stopped caring. So now I’m switching gears. Applied to another university for a different program, got accepted, and could not be more excited to start in the fall. Sometimes we just need some clarity in what our future goals are and the pandemic gave us that clarity. Best of luck to you.", "author": "moonflower19", "created": 1595267818, "upvotes": 39}, "fyoeil4": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyoeil4/", "text": "Honestly I was in the same boat as you. I have no interest in my project. I realized I wanted to go back to school but for something else. Its better to leave now before wasting time on something you're not passionate about. Good luck 👍", "author": "DekuChan95", "created": 1595265876, "upvotes": 32}, "fyoe17n": {"link": "/r/GradSchool/comments/hunzw7/im_gonna_quit_and_im_excited_but_also_terrified/fyoe17n/", "text": "From one grad school to another 😃", "author": "DrugChemistry", "created": 1595265642, "upvotes": 150}}}