{
  "sid": "q1zxda",
  "link": "/r/GradSchool/comments/q1zxda/is_ms_in_data_science_worth_it_college_senior_ba/",
  "title:": "Is MS in Data Science worth it? (College Senior BA in Economics)",
  "text": "Some  Background: I'm a senior in college graduating with a BA in Economics  and minoring in Mathematics. I'm very interested in becoming a data  scientist later on in my career path.  So far, I would like to apply to  the University of San Diego MS in Data Science program.\n\nWhat  I am worried about is my low gpa. Upon graduating, i expect to have a  2.5 gpa. I am worried that i've ruined my chances in getting into a grad  program to become a data scientist. I am really trying to turn my life  around, as the initial motivation was not there in my first few years of  college. The program that I've applied to so far that even with my low  gpa, i would still be able to get in if i sent a letter to the dean and  explained my predicament.\n\nMy  questions would be: Are there any current data scientists who started  out in my predicament? What can I do to further increase my odds of  becoming a data scientist?",
  "author": "I_Am_Romanus",
  "created": 1633450956,
  "updated": 1634099903,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfhux78": {
      "link": "/r/GradSchool/comments/q1zxda/is_ms_in_data_science_worth_it_college_senior_ba/hfhux78/",
      "text": "I graduated from undergrad with 2.1 overall gpa.  Went back to school for pre reqs,  got a 4.0 on all work.  Plus I built a portfolio of working projects outside of class and sent those in as supplemental work.\n\nTo top it all off I got stellar recommendations from a pre reqs professor and work contacts.  For the prof I for a recommendation from I got 93 in above in three of their classes. \n\nBtw, I had a job for the past five years.",
      "author": "ConnectKale",
      "created": 1633451283,
      "upvotes": 1,
      "replies": {
        "hfhxhx5": {
          "link": "/r/GradSchool/comments/q1zxda/is_ms_in_data_science_worth_it_college_senior_ba/hfhxhx5/",
          "text": "Awesome! Did you pursue a masters degree in data science or in any other field?",
          "author": "I_Am_Romanus",
          "created": 1633452328,
          "upvotes": 1,
          "replies": {
            "hfhz4f4": {
              "link": "/r/GradSchool/comments/q1zxda/is_ms_in_data_science_worth_it_college_senior_ba/hfhz4f4/",
              "text": "I am in a data science program!",
              "author": "ConnectKale",
              "created": 1633452984,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}