{"sid": "pjrii4", "link": "/r/GradSchool/comments/pjrii4/phd_with_no_advisor_for_the_first_year/", "title:": "PhD with no advisor for the first year", "text": "Hi, I enrolled in a Ph.D. program after my undergraduate and 2 years of industry experience. I figured I wanted to go into research. I can't fund myself so I got admitted into a State University under a Research Assistantship under one of the professors.\n\nBut I could not enroll that semester and had to defer losing the RAship. But the department stepped in and gave me a TAship. I joined the university however after 1 semester I see my situation as bleak because professor's just don't have new grants even this fall and I completed one semester working as a TA and worked as a student worker TA for summer. Now this is my 2nd semester but I don't have a professor I really want to commit to because lack of funds, active involvement and basically a lack of road map for me. 3 4 professors are eager to advise me but non of them have funds and just want me to keep working as a TA to fund myself. There isn't much research work going on. Those who do want to advise me just want me to look into few of their papers and start publishing papers without much guiding me on what to do, what university resources to use, what data to use, the process. Nothin. I feel like I am not doing research work but just trying to publish papers. I am a CS background and really good at technical stuff and programming but I have barely done that for the past 7 months.\n\nI feel like switching into masters and drop out of PhD program. What should I do?", "author": "artemis_irelia", "created": 1631035146, "retrieved": 1632844731, "over_18": false, "upvotes": 7, "upvote_ratio": 1.0, "comments": {"hbz8tzt": {"link": "/r/GradSchool/comments/pjrii4/phd_with_no_advisor_for_the_first_year/hbz8tzt/", "text": "A lot of my grad school experience is leaning independently. \n\nI had to TA for three years and figure out research myself with only minor guidance when I got stuck. \n\nMost professors don’t micromanage you but there are some out there that do. If you have trouble being a self starter seek one of the type that do. \n\nYour lucky they have a TA for you to continue. Some departments don’t have them so if your boss can’t pay you get forced out. \n\nWhat I don’t understand is how you can publish papers with no research?! Do all of them just want you do to reviews? \n\nI had to put a research proposal together about the work I would do that fits in the professors goals. Maybe reading their literature and trying to brainstorm some ideas on how you can contribute to what they work in in a good place to start. \n\nI find each project I work on needs different resources, data and process. Most of this is trail and error. \n\nWith that said, not everyone is cut out for a Ph.D. \nAnd there’s various reasons to that, I agree with the previous reply… you should really thing about everything and how it applies to you and what is expected of you to achieve it.", "author": "chemnerdgirl", "created": 1631048442, "upvotes": 1}, "hbyrpww": {"link": "/r/GradSchool/comments/pjrii4/phd_with_no_advisor_for_the_first_year/hbyrpww/", "text": "Being a TA is fairly common, there are certain grants you can work on applying for that will cover your stipend as well, or look into seeing if your uni has any T32 fellowships.  There may be random fellowships around the university that would fund you.  Without knowing the field, are there any online data bases that you could access relevant to your field?  For instance, ADNI for alzheimrs, or I think its the PPMI for Parkinsons.  They often have massive amount of free data on there that if you have a good question, some good skills you can look into.  A prof or collaborator could help guide you from there maybe.", "author": "idk_witty_username", "created": 1631041445, "upvotes": 2}, "hbyqosa": {"link": "/r/GradSchool/comments/pjrii4/phd_with_no_advisor_for_the_first_year/hbyqosa/", "text": "I can speak to having an advisor that is not very good at \"guiding\". My advisor's lack of involvement in my work has led to me getting put on projects that have delayed my thesis work bc she volunteers me to work on things I don't have high interest in. These have been good for my learning overall, but have added at least a term or two to my projected completion timeline. If you feel like that kind of thing might happen to you (floundering on projects without guidance) you will need to 1) choose to be more independent and learn to be persistent during meetings (e.g. go in with a clear plan of what to talk about and don't let the meeting end w/o the info you need, and find others who can help answer your questions beyond your advisor), 2) find another advisor, or 3) be aware you may not be successful/happy and not move forward with the program. This is just my simplified feelings about it/what I felt my options were. I picked option 1 if that helps to know.\n\nAs for funding, my institution (public state university) has at least half if not more of its graduate students on TA positions. While this is frustrating because we would all rather be doing RAs, it's kind of just the thing you have to do to reach the end goal of a PhD. Whether that is a worthwhile cost for paying for your degree is up to you. Paying for the degree out of pocket is definitely not worth it imo, so really it's whether you're willing to do work you don't want to do to meet your end goal. Also think about if there are any skills you can gain from being a TA that will benefit your long term career goals.\n\nIf I were you I would think long and hard about why a PhD is critical for your long term career goals. If it is not critical for career goals, you have to have some serious passion for your studies to make it worthwhile. If a master's degree can offer you similar or suitable employment options, then that could be a strong consideration for you and you could avoid a lot of the issues you are presenting. Hope this helps.", "author": "Kitty_casserole", "created": 1631041020, "upvotes": 1}}}