{"sid": "pvylax", "link": "/r/GradSchool/comments/pvylax/using_multiple_chapters_from_a_single_book/", "title:": "Using multiple chapters from a single book?", "text": "I am doing a lit review for my doctoral program (STEM) and I found a great book for the sources. It has pretty much all the necessary info I have, but I don't know if it's acceptable to cite multiple chapters from one book. I didn't do it for my masters because I assumed it would look 'lazy,' but what do you guys think?", "author": "articlesarestupid", "created": 1632678317, "retrieved": 1632952021, "over_18": false, "upvotes": 2, "upvote_ratio": 0.75, "comments": {"heftbp9": {"link": "/r/GradSchool/comments/pvylax/using_multiple_chapters_from_a_single_book/heftbp9/", "text": "Citing multiple chapters from a single book seems like a completely reasonable and normal thing to do.", "author": "ucscpsychgrad", "created": 1632719213, "upvotes": 1}, "hefnxkx": {"link": "/r/GradSchool/comments/pvylax/using_multiple_chapters_from_a_single_book/hefnxkx/", "text": "Do you have a style guide you can consult? \n\nFor my field’s style guide, if all the chapters of the book are written by the same person(s), then they’re not cited separately.  If any of the chapters are written by different people, then yes, you should cite the chapters separately.", "author": "campingandcoffee", "created": 1632715645, "upvotes": 1}, "hedgdhg": {"link": "/r/GradSchool/comments/pvylax/using_multiple_chapters_from_a_single_book/hedgdhg/", "text": "If you \"consider\" it one source (even though many chapters) and support it's/your ideas with a bunch of other supportive resources, I don't see why you couldn't.\n\nI would check with my advisor, but if you have a set minimum of resources then count the whole book as one but cite it when you need.", "author": "Happy-birdie-918", "created": 1632679243, "upvotes": 2}, "hedfyjr": {"link": "/r/GradSchool/comments/pvylax/using_multiple_chapters_from_a_single_book/hedfyjr/", "text": "As long as your review is thorough and includes a wide variety of different sources, then citing/discussing multiple chapters from one book should be fine.  If this book is your only source or one of very few sources, then you should make clear why this book is so central/necessary and why so few other sources were consulted or mentioned.  Perhaps it's because your field is small and there simply isn't a lot of other material.  But if there is a wide variety of material available, make sure you review those sources as well, especially if they come to different conclusions than the book in question.  You don't want it to appear that you favor the one book to the exclusion of other sources just because you happen to agree with that book's conclusions.", "author": "ChemMJW", "created": 1632679083, "upvotes": 3}}}