{"sid": "guox53", "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/", "title:": "To my fellow graduate students in the U.S, a bill has been proposed to restrict Chinese graduate students in STEM fields.", "text": "A bill was proposed this morning by a few senators to restrict graduate student visas from China who are doing research in STEM fields at all institutions in the United States: https://www.cotton.senate.gov/?p=press_release&id=1371  \n\n\nNo matter what your stance is on this issue, one thing is clear: Some of the most influential and talented researchers at our institutions are from China. Barring them is simply xenophobic.  \n\n\nThere is a petition going around right now to go against this bill -- if you are willing to sign it, please do. It takes 30 seconds.  \n\nhttps://docs.google.com/forms/d/e/1FAIpQLScIu1jbAfB5qFGkV3I7rpEAo0kwsUb8CpzZ_6Nu-CoKeul4PQ/viewform", "author": "masjoven", "created": 1591032801, "retrieved": 1632953321, "over_18": false, "upvotes": 575, "upvote_ratio": 0.89, "comments": {"fsptgsg": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsptgsg/", "text": "I'm not even American, and yet I think this may be a great development for STEM PhD students of the future. This should just be a first step.\n\nTO BE CLEAR: Yes, these students are every bit as talented as American students. Yes, they contribute a shit ton of research work. And to the economy overall.\n\nBut universities and supervisors don't take on [more and more](http://nfap.com/wp-content/uploads/2017/10/The-Importance-of-International-Students.NFAP-Policy-Brief.October-20171.pdf) students from non-Western countries out of the goodness of their hearts. They love doing so, because many can be 'nudged' to work very long hours for very little money. Not only during their PhD, but also as post-docs afterwards - yay! Additionally, quitting is not an economically viable option for most, and supervisors know this.\n\nWhere companies outsource to low wage countries, universities just bring in the more cost-effective labour they need. After all, a PhD in STEM is at max 30% educational and 70% work like any other. Working conditions for PhDs have always been subpar, but that's exactly why we shouldn't allow universities to continuously put downward pressure on them. A steady inflow of cheap(-ish) labour makes it far too easy for them. When corporations do this, they get exposed and everyone talks about (just think of Amazon and their warehouses). Why should universities get away with it?", "author": "wave-o", "created": 1591161445, "upvotes": 3}, "fsmuts7": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsmuts7/", "text": "We have very talented black and brown students as well. But we refuse to educate them. I'm not worried about not having access to chinese talent. Maybe now we'll actually focus on training our own children.", "author": "Harewol", "created": 1591105584, "upvotes": -8}, "fsmqmzb": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsmqmzb/", "text": "[deleted]", "author": null, "created": 1591103048, "upvotes": -5}, "fsm00dj": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsm00dj/", "text": "You know this has Stephen Miller written all over it, right?", "author": null, "created": 1591079790, "upvotes": 4}, "fslqx8v": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslqx8v/", "text": "Imagine pulling this shit in a time of unprecedented global academic and research collaboration due to coronavirus.", "author": "nuanced_memer", "created": 1591073032, "upvotes": 22}, "fslpz88": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslpz88/", "text": "Thank you for sharing this. Signed.", "author": "chobani-", "created": 1591072391, "upvotes": 1}, "fslnih6": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslnih6/", "text": "Isn’t this Cotton guy the same who is urging Trump to order air strikes on the protests? It scares me that someone this openly racist is an elected senator. Vote in November ppl!", "author": "chuuluu", "created": 1591070764, "upvotes": 13}, "fslia29": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslia29/", "text": "Our state school in butt fuck Oregon only stays afloat because of the Chinese students that come here and pay full tuition.", "author": "quarkthestrange", "created": 1591067549, "upvotes": 9}, "fslaitq": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslaitq/", "text": "What does \"research in STEM fileds\" mean in this context?", "author": "pappypapaya", "created": 1591063009, "upvotes": 4}, "fsl0ee6": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl0ee6/", "text": "The US is going down the toilet and this is what our legislators are spending their time on?????", "author": "AFKpink", "created": 1591057360, "upvotes": 50}, "fskz0oj": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskz0oj/", "text": "I'm in social science and so am not directly affected but the Chinese students in my program are brilliant and it would be so unfair if they were kicked out. Just imagine you are working hard doing research and teaching for a university in return for low pay, and you may be in the middle of your research, or you've just finished your research, and all of a sudden you are kicked out. There are finer grain ways to weed out stealing of information than a blanket ban.", "author": "garulous", "created": 1591056594, "upvotes": 19}, "fskxze6": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskxze6/", "text": "I’m willing to bet the economic and academic benefit produced by legitimate visa holders outweighs the losses sustained through academic espionage", "author": null, "created": 1591056024, "upvotes": 9}, "fskr808": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskr808/", "text": "So how would this affect existing Chinese grad students? Would those nearing the end of their degrees still be allowed to finish remotely after their visas expire, esp. if they've long finished with coursework and are wrapping up a few research projects?", "author": "--MCMC--", "created": 1591052372, "upvotes": 5}, "fskp94x": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskp94x/", "text": "my god this is fucked up. much love in this time of hardship. be safe.", "author": "wackrapconcarne", "created": 1591051332, "upvotes": 7}, "fsknk70": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsknk70/", "text": "[deleted]", "author": null, "created": 1591050440, "upvotes": -6}, "fskmjz0": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskmjz0/", "text": "Not sure if I count as am not american, but signed it just in case. These kind of things mustn't be allowed anywhere.", "author": "Fran_97", "created": 1591049921, "upvotes": 10}, "fskgr4c": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskgr4c/", "text": "Let's be clear; this specific bill is a blanket ban on Chinese citizens (PRC citizens outside of Hong Kong & Taiwan) obtaining visas to pursue graduate degrees in STEM in the US. Denial of visas would be the new norm, with very minimal exceptions as outlined in the link from the main post. It is not 'feel-good' legislation and it is not a precursor to anything; there is nothing beyond this. \n\nThis cannot be allowed to happen. I'm dismayed at what I've seen in the most recent reddit threads about this. Do you ever talk to your Chinese colleagues? You know that China does not allow dual citizenship, right? I know many people who plan to give up their Chinese citizenship as soon as they have the option to. Poorer people don't have the option of coming to the US for undergrad, but see grad school as a path to US citizenship and \"the American dream\". \n\nI am an American PhD student in Canada. Canada already has all of the strong Iranian students. Don't make US schools weaker by giving up most of the Chinese students too. Already visas can be denied for almost no reason - we don't need more restrictions, even in the form of Trump's more reasonable order.", "author": "plasticpots", "created": 1591046975, "upvotes": 225}, "fskeagu": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskeagu/", "text": "Thank you for doing this.", "author": "rmlosblancos", "created": 1591045761, "upvotes": 4}, "fsk681a": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk681a/", "text": "We've gone down this road before with banning immigrants and travelers from Muslim countries because of prejudice and xenophobia. It starts with having a semi-legitimate reason, but then the scope of it gets expanded, and soon enough, any person of that ethnicity/religion/race is being targeted and scapegoated in their everyday lives.", "author": "PumpkinCrumpet", "created": 1591041819, "upvotes": 69}, "fsjse9x": {"link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjse9x/", "text": "[deleted]", "author": null, "created": 1591035169, "upvotes": 52}}}