{
  "sid": "m0tn7v",
  "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/",
  "title:": "To new graduate students: never settle",
  "text": "For 7 months I rotated in 5 different labs trying to find a mentor. I had PIs tell me that they don’t know how I got into my program, and that the grants I want to apply for are a pipe dream for someone “like me”. I had one PI call me a slacker and many others insult my intelligence and ability. I watched all of my friends commit to labs happily for months before me. I experienced students tell others that I was the problem. Even my own program heads were questioning what was taking me so long. Almost everyone told me what I wanted out of a PI was not possible, that I was being too picky, that I needed to “just choose already”.\n\nToday, after 17 zoom interviews, 5 rotations, and 7 months of searching while balancing some of the worst self-doubt and pressure to join a lab from my department: I found a PI who truly believes in me, supports me, and inspires me everyday. And I could not be more proud to officially join their laboratory. \n\nTL;DR Never settle\n\nEdit 1: Thanks for the support/ awards/ kind remarks. I acknowledge the privileged situation I was in to be able to take so many rotations and speak to so many PIs. I wrote this in hopes to let people know that regardless of your situation in life you don’t have to settle for less than you deserve. I settled in a horribly abusive relationship for many years of my life, and recently I have been able to prioritize not doing so in personal and professional aspects. I want those reading this to know it *does* get better. There is a light at the end of the tunnel: and it’s yours.",
  "author": "the_girly_scientist",
  "created": 1615247500,
  "over_18": false,
  "upvotes": 733,
  "upvote_ratio": 0.95,
  "comments": {
    "gqpysw0": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqpysw0/",
      "text": "Wow. I am going to share this story with some of the other students in my cohort. I am in my first year and we just finished our standard three lab rotations and there are still some who are in this grey territory of a fourth rotation and beyond.\n\n&#x200B;\n\nLike you said, although maybe not as explicitly as your situation, but some of these PIs do see fourth rotation students as a red flag. It sucks. Maybe this can uplift some spirits on this side. Thank you!",
      "author": "ocfl8888",
      "created": 1615576070,
      "upvotes": 2,
      "replies": {}
    },
    "gqctdpc": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqctdpc/",
      "text": "This is really very field specific though. You're honestly privileged to be in a major where you can get into a program before getting a PI. We have to have a PI lined up already for admissions to even look at your application and you're often committing to their lab without having a chance to even meet them in person, unless you've been fortunate enough to have had an undergrad internship with them. Then it's very hard to switch labs after getting in because other labs have already lined up all the grad students they want and you've usually signed onto your PI's grant when you accepted which makes it awkward to leave",
      "author": "bi_smuth",
      "created": 1615313575,
      "upvotes": 6,
      "replies": {
        "gqdite2": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqdite2/",
          "text": "Yeah I was gonna say, in my field you apply to programs saying who you want to work with, and start out with that person. It sounds like a nightmare to go into a program not having had several conversations with your future PI/mentor? I got accepted into a program and turned it down because the person I had wanted to work with was a really bad communicator.",
          "author": "validusrex",
          "created": 1615325082,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gqcsksl": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqcsksl/",
      "text": "Your PI is roughly 95% of your PhD experience. So finding the right PI for you is massively important. Investing even 7 months to find the right fit is so worth it. I'm glad it worked out for you OP :)",
      "author": "madbadanddangerous",
      "created": 1615313215,
      "upvotes": 2,
      "replies": {}
    },
    "gqcd0am": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqcd0am/",
      "text": "Kudos to you for standing up for yourself and knowing your worth. This got to be the best attitude ever to get through in life, be it professionnal or personnal related. You got this !",
      "author": "jtmooon",
      "created": 1615306899,
      "upvotes": 2,
      "replies": {}
    },
    "gqcaw73": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqcaw73/",
      "text": "I had a really similar experience in 2019. I ended up being rejected by nine or so professors in my department and ultimately re-applied to graduate school that Fall. I was so mad that I was even accepted in the first place when I couldn't actually find work! Sometimes it was money, but sometimes it was accusations or assumptions of not being good enough, passionate enough, hard-working enough. The list goes on and on. I eventually found a PI in a different department who really believed in me and was comfortable investing in me as a scientist (but I still eyed other universities just in case before deciding on this group). It was such a trying experience, but frankly now I feel invincible. Like, what can be worse than be nearly kicked out of your own department in your first semester 😂",
      "author": "cucurbitacin",
      "created": 1615306117,
      "upvotes": 6,
      "replies": {
        "gqf2j26": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqf2j26/",
          "text": "Had a similar experience.\nAmazing how these professors judge people on something as subjective as being \"passionate\" all the while knowing our passion will most likely amount to not getting a job in academia or a field requiring a phd. \n\nThe shit these profs make up to make themselves feel special makes me cringe",
          "author": "BerserkFuryKitty",
          "created": 1615355600,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gqc6m2d": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqc6m2d/",
      "text": "I’m so happy for you. I’m thinking about switching grad programs because I feel so unhappy with my current one, just unwelcome and like I don’t belong. I hope I find a place where I fit!",
      "author": "HighlyPolitical16",
      "created": 1615304456,
      "upvotes": 2,
      "replies": {}
    },
    "gqauf2c": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqauf2c/",
      "text": "Thank you for this. Lifts up my spirit 🙌",
      "author": "SnooBeans3895",
      "created": 1615270116,
      "upvotes": 3,
      "replies": {}
    },
    "gqam0rm": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqam0rm/",
      "text": "As someone that settled on a PI after 3 rotations and had to leave that lab after 4 years to start over, I commend you. \nI’m still unsure if I’m not a good judge of labs, or things take time to reveal themselves. I’m just curious as to how you are sure you found the right one?",
      "author": "snoop_pugg",
      "created": 1615264249,
      "upvotes": 10,
      "replies": {
        "gqanbbj": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqanbbj/",
          "text": "Man, these questions are amazing haha. In the end I suppose we never do huh? Time will tell. Good signs I have: my PI has multiple parents in the lab. As I am not one, I do know their struggle in finding a PI that supports their home-work life balance with picking up kids/ kids being sick/ etc. so I know my PI supports a healthy work-life balance. He is a perfect field match for a ton of research I have done before. The research excites, challenges, and motivates me. He is a kind soul that “prioritizes fun in the lab” and I have seen that first hand. He post Doc’ed at a university I did years of research at, we worked with similar faculty, I cross checked all of them and they all have positive things to say. He believes in my goals, and is as excited to make them a reality as I am. He supports me taking classes and completing internships that deviate from the lab. We can talk for hours and have about life and research. He’s modest but accomplished, has great funding. He is who I see myself becoming, and wanting to become. Those were the signs I found to be the most important.",
          "author": "the_girly_scientist",
          "created": 1615265068,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "gqaf715": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqaf715/",
      "text": "Congrats on finding a PI that supports you fully.  I'm curious if it took that entire search process to find this PI, or now that you've gone through it there were signs that pointed to this PI being good but never surfaced at first glance?",
      "author": "charlieplexed",
      "created": 1615260225,
      "upvotes": 4,
      "replies": {
        "gqafnx4": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqafnx4/",
          "text": "Great question! It was the search. And I forfeited a scholarship to choose a PI outside of my home department. So I didn’t even look outside my dept originally because our stipends are already so low. But it was and is very much so worth the cut to my salary to be supported in other ways. And to have a PI that just gets it. Once I made peace with that I had a lot better options and ultimately found my PI!",
          "author": "the_girly_scientist",
          "created": 1615260490,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gqa93as": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa93as/",
      "text": "Awesome on you for finding a program and person that works with you.\n\nThat said, I disagree that this should be general advice. I fully believe and support OP in what they say, but in general if there is no one that is a good fit for you or no one that you get along with, you need to start looking inward.",
      "author": "FunnierBaker",
      "created": 1615256851,
      "upvotes": 22,
      "replies": {}
    },
    "gqa43mw": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa43mw/",
      "text": "[deleted]",
      "author": null,
      "created": 1615254111,
      "upvotes": 3,
      "replies": {
        "gqa45gi": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa45gi/",
          "text": "**so inspiring, this is.** \n\n*-Imaginary-Change-807*\n\n***\n\n\n\n^(Commands: 'opt out', 'delete')",
          "author": "IamYodaBot",
          "created": 1615254138,
          "upvotes": -10,
          "replies": {}
        }
      }
    },
    "gqa2ohn": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa2ohn/",
      "text": "Were you only surrounded by such negative put-downy people? What kind of program is this so I can remember to avoid it? I know that hoping everyone in academia would lift each other up is wishful thinking but this seems overly hostile",
      "author": "Dustin_Bromain",
      "created": 1615253328,
      "upvotes": 36,
      "replies": {
        "gqa35jg": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa35jg/",
          "text": "Not all my student friends have had my experience, I wouldn’t reflect it on my program. Often if a student takes multiple rotations it’s seen as a bad sign. Many of my friends believed in me, many other PIs I talked to were kind. One of the PIs apologized to me after what they said, many did not. I do have very lofty goals for graduate school when it comes to grants/fellowships/conferences so it wasn’t incredibly surprising to be shot down. This many times was pretty unusual. I also am doing a PhD in a discipline that my bachelors is not, and I am met with a lot of criticism for that.",
          "author": "the_girly_scientist",
          "created": 1615253588,
          "upvotes": 24,
          "replies": {
            "gqa4lmw": {
              "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa4lmw/",
              "text": "Hm. Yes that sounds a very unusual to be shot down for having “lofty goals” like grants/fellowships. I’ve been in two PhD programs and most people are expected to apply for NIH F grants and go to their field’s best conferences funded by travel grants. I am also doing my PhD in a field I didn’t do my undergrad in and it just made me a little more marketable as a PI’s potential student/mentee.",
              "author": "coffeebeforebed_",
              "created": 1615254379,
              "upvotes": 27,
              "replies": {
                "gqalhdm": {
                  "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqalhdm/",
                  "text": "> I’ve been in two PhD programs\n\nStory time?",
                  "author": "peregrination_",
                  "created": 1615263915,
                  "upvotes": 8,
                  "replies": {
                    "gqbpxhx": {
                      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqbpxhx/",
                      "text": "Transferred to a different program with my PI who got a position at the university I currently attend.",
                      "author": "coffeebeforebed_",
                      "created": 1615296802,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "gqa59jq": {
                  "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa59jq/",
                  "text": "That was definitely my thought going into interviews and starting my program, but sadly is not my reality. But perhaps the difference is the lack of coursework I had coming in. I should’ve clarified that it wasn’t wanting to apply to grants in general, just the specific grants I wanted to apply for",
                  "author": "the_girly_scientist",
                  "created": 1615254748,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gqa0wu2": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa0wu2/",
      "text": "That’s not possible for most students. So many programs don’t have rotations, and if you need more than 3 then you’re kicked out. Good on you that it worked, but this isn’t good advice. I would counter with, pick a PI, and if it doesn’t work after a year for “reasons” then switch to a similar lab/ collaborator. You got this win, but it is not possible for the vast majority of PhD students.",
      "author": "krazyk1661",
      "created": 1615252369,
      "upvotes": 87,
      "replies": {
        "gqa8sxl": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa8sxl/",
          "text": "The best advice I got, on this front, was “don’t put yourself on an island”. My undergrad advisor recommended I look at programs where there was a strong community in my field and where there would be options if things didn’t work out. I’m in a relatively small niche, and there definitely aren’t rotations. You sign on for a specific professor, and there were only a couple programs where I could really have solid options if things soured. It shortened my list of possible labs significantly, but I really think he was right when he gave that advice.",
          "author": "hales_mcgales",
          "created": 1615256694,
          "upvotes": 37,
          "replies": {}
        },
        "gqdr4gc": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqdr4gc/",
          "text": "The “vast majority” of PhD students are likely in countries that don’t use this rotation system at all - sorry I just get sick of US centrism on here. In my country you pick your supervisor before joining a university, and OP’s advice is very relatable, it’s just not done by “rotation”, but by talking to them, ex grad students etc, beforehand.",
          "author": "ver_redit_optatum",
          "created": 1615328902,
          "upvotes": 3,
          "replies": {
            "gqduo66": {
              "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqduo66/",
              "text": "That’s actually the majority of the US system too.",
              "author": "krazyk1661",
              "created": 1615330585,
              "upvotes": 3,
              "replies": {
                "gqec70j": {
                  "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqec70j/",
                  "text": "So, I don't see why you think OP's overall advice isn't good, it just applies at a different stage of the process.\n\nThe only people it (and the whole system) kinda sucks for is anyone in a \"rotations but only up to X number\" program.",
                  "author": "ver_redit_optatum",
                  "created": 1615339753,
                  "upvotes": 1,
                  "replies": {
                    "gqecnj8": {
                      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqecnj8/",
                      "text": "Because of one main reason... PIs lie and pretend they are great in interviews. Their current students and postdocs usually can’t tell the truth without repercussions. So it’s more an unrealistic expectation than it is “bad advice”.",
                      "author": "krazyk1661",
                      "created": 1615339996,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gqab8rw": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqab8rw/",
          "text": "Yeah in my program you literally get kicked out if you don't find a PI after 4 rotations.",
          "author": "kraezic",
          "created": 1615258036,
          "upvotes": 8,
          "replies": {
            "gqahs5n": {
              "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqahs5n/",
              "text": "Haha yea, 4 rotations is a lot. My program was “choose this mentor, and stay there for 6 years”",
              "author": "krazyk1661",
              "created": 1615261695,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "gqa1gyx": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa1gyx/",
          "text": "I’m aware my experience is not possible for everyone. I had to go through a lot to get multiple rotations authorized, but I stand that it is good advice. I would counter that the advice wasn’t rotate until you find a fit. The advice was not to settle. And switching to a different lab later in your program is a great example of not settling!",
          "author": "the_girly_scientist",
          "created": 1615252672,
          "upvotes": 12,
          "replies": {
            "gqahx6h": {
              "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqahx6h/",
              "text": "I had a similar experience. Had extra rotations but ultimately was given the choose a lab or get out scenario (was more complicated due to funding). Definitely settled and decided to switch to a masters due to my PI. Glad I did because I couldn't live my life how acadamia demands. Settling isn't always bad. Sometimes it makes you realize what is really important to you.",
              "author": "lildil37",
              "created": 1615261774,
              "upvotes": 8,
              "replies": {
                "gqaia7d": {
                  "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqaia7d/",
                  "text": "I love this. You may have settled on a PI but you didn’t settle on what you wanted and what was important to you. And that’s what I was trying to get at. Thank you for saying what I wanted to much better than I could.",
                  "author": "the_girly_scientist",
                  "created": 1615261985,
                  "upvotes": 4,
                  "replies": {
                    "gqan0tk": {
                      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqan0tk/",
                      "text": "Glad things worked out for you as well! Never stop dreaming!",
                      "author": "lildil37",
                      "created": 1615264880,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gqdgh1b": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqdgh1b/",
          "text": "Yeah, I feel like there is a huge theme in grad school. The devil and angel on your shoulders are telling you to strive for the highest and settle/get it done (which is which may also greatly depend on the situation). The problem is, for many of us, it’s difficult to really determine where we stand on this and which is better in any given situation. So taking OPs advice could be exactly right for some folks, but terrible for others.",
          "author": "cprenaissanceman",
          "created": 1615324067,
          "upvotes": 2,
          "replies": {}
        },
        "gqfupen": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqfupen/",
          "text": "Agreed with this. Being able to select is a privilege itself.",
          "author": "givemeyourdonut",
          "created": 1615380485,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gq9zrwu": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gq9zrwu/",
      "text": "This sort of groundwork to pick the best mentor possible will pay dividends in the future. Other students will just say \"pick already\" but you'll find some of those students picked suboptimal mentors and when the going gets rough, there'll be a lot of eating of crow. I literally tracked down my future PI's previous lab mates in-person and got character references lol.",
      "author": "Stereoisomer",
      "created": 1615251745,
      "upvotes": 146,
      "replies": {
        "gqbvmwe": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqbvmwe/",
          "text": "Absolutely. I know so many people who have miserable PhDs  or they drop out specifically because they have the wrong mentor.",
          "author": "No_Income6576",
          "created": 1615299804,
          "upvotes": 11,
          "replies": {}
        },
        "gqc51m5": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqc51m5/",
          "text": "yeah that tends to be most things in life. Peers that get on you about things is a \"them\" thing and not a \"you\" thing - they regret their own decisions and there is a degree of jealousy apparent.",
          "author": "nickyfrags69",
          "created": 1615303849,
          "upvotes": 7,
          "replies": {}
        },
        "gqd0e3b": {
          "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqd0e3b/",
          "text": "Tracking down previous grad students is such a good idea.",
          "author": "ChristianValour",
          "created": 1615316892,
          "upvotes": 3,
          "replies": {
            "gqdfaq6": {
              "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqdfaq6/",
              "text": "That is a good idea but that wasn't the situation (and would've made the process much easier). My PI was brand new (never had a student before) and I took a flight to his old lab and met the other postdocs or the phd students he advised in-person.",
              "author": "Stereoisomer",
              "created": 1615323561,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gq9ug5t": {
      "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gq9ug5t/",
      "text": "Win. Nuff said.",
      "author": "theP0M3GRANAT3",
      "created": 1615248840,
      "upvotes": 103,
      "replies": {}
    }
  },
  "updated": 1634065031
}