{"sid": "dij1ql", "link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/", "title:": "My program isn't toxic, my professors and advisors care about me, the cohort I'm in supports one another and we all get along.", "text": "I joined this sub after I got accepted into my master's program, I was really nervous to start because of all of the horror stories I read on here and my own history with major mental illness. \n\nI just want people to know that grad school doesn't have to be traumatic or soul-sucking. It can be an incredible, positive, and nurturing experience.\n\nI know my experience is an exception to the rule and that's a shame.", "author": "BIORIO", "created": 1571194608, "retrieved": 1632845254, "over_18": false, "upvotes": 651, "upvote_ratio": 0.97, "comments": {"f42lgwx": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f42lgwx/", "text": "So far in my first semester its been soul draining, if I don't survive might enlist into the army. I always wanted to see Afganistan.", "author": "RedFlutterMao", "created": 1571333106, "upvotes": 1}, "f3zl9q6": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3zl9q6/", "text": "It's nice to commiserate about our difficulties in groups like this, but I have had a similar experience. My program is hard, and at times demoralizing, but my classmates and my advisor are always very supportive.", "author": "Drell-Yan", "created": 1571271630, "upvotes": 3}, "f3yrqoh": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3yrqoh/", "text": "I have the same experience as OP but disagree it's an exception to the rule.", "author": "pinkseptum", "created": 1571258481, "upvotes": 1}, "f3y9dhx": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3y9dhx/", "text": "I, too, am the exception! Happy studies!!", "author": "strandedsouth", "created": 1571250577, "upvotes": 1}, "f3y7i86": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3y7i86/", "text": "This person gets medals for being in an amazing grad program most of us wish we were in thus further widening the gap for us underprivileged graduate students. \n\nJoking here people.\n\nHonestly, I wish that everyone could have the same experience as you but it just isn't the case OP. I am happy for you truly am. At least I am being proactive and working on conditions at my school and department so it can get to your level for everyone!", "author": "ScreamnMonkey8", "created": 1571249789, "upvotes": 2}, "f3xy3mq": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3xy3mq/", "text": "My master's was a good experience. Advisor was helpful and available, he only had a few grad students in order to be able to help us all out as much as we needed, and I graduated on a reasonable time table.\n\nI switched for my PhD to another school and advisor and it has been horrible in many ways, and very good in other ways. Overall, my advisor is a very challenging person to work for, he has far too many grad students, he does zero training, and offers no support. I mentioned this here the other day, but when people graduate in our lab, it is in spite of him, not because of him.\n\nSo that's my experience. One good and one not so good.", "author": "madbadanddangerous", "created": 1571245720, "upvotes": 1}, "f3xtll7": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3xtll7/", "text": "As a whole, I'm happy in my program.  My cohort, the other students in my program, students in other programs, professors, and administrative staff are all very important.  Different advisors have different mentoring styles and personalities, and aside from a couple incidents where students had to switch labs, most people here are happy.  I struggle with my advisor sometimes, mostly communication, but I'm learning to work with my advisor better and communicate better with them.", "author": "trashpandalikespizza", "created": 1571243664, "upvotes": 2}, "f3x9cco": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3x9cco/", "text": "Most of the horror stories I've encountered while working with PhD candidates around the country come from online programs.", "author": "iamapremo", "created": 1571234351, "upvotes": 1}, "f3x5paz": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3x5paz/", "text": "I so agree! I’m in the second year of my PhD and from all the comments I was worried the next few years are going to get worse since my advisor/group is great so far. \n\nI am grateful that I have a supportive and hands on advisor, a good project, and a great group of lab mates. It definitely was a factor in continuing to do my PhD from a masters.", "author": "Chopinforelectrons", "created": 1571232486, "upvotes": 1}, "f3x4zcg": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3x4zcg/", "text": "Oh thank God that this program actually exists.  I probably won't be so lucky to get everything i want but things will probably be better than I think.", "author": "j0shred1", "created": 1571232102, "upvotes": 1}, "f3x3mu5": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3x3mu5/", "text": "I think when people are in toxic programs, the vast majority are in PhD programs. A Master’s program is much easier, people care less, etc.\n\nI’m a Master’s student having a great time.", "author": "DianeSucks", "created": 1571231373, "upvotes": 12}, "f3x3gzr": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3x3gzr/", "text": "and other lies you can tell yourself ;) j/k. I'm glad you enjoy your graduate school experience, being in a masters program definitely makes it simpler because you know you will be gone in 2 years.", "author": null, "created": 1571231260, "upvotes": 1}, "f3wxo6q": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wxo6q/", "text": "I want to validate OP and clap back against everyone in this thread that's saying, 'Oh, they're just doing a masters, or early in the program, it'll get worse...'. I'm in my fourth year of a PhD at an Ivy and I wouldn't trade it for anything. Sure, there's 14 hour days/100 hour weeks that kind of suck, and while my committee members have been extremely supportive they sometimes still say shitty stuff, because they're people too, but overall I've learned a lot, grown a lot, and produced a lot over those years. I love research, I love teaching, I love mentoring undergrads, I love being involved in the campus community. My experience is obviously anecdotal but I'm putting it out there for what it's worth. Positivity is worth something after all!", "author": "KrunkWantPuppetPals", "created": 1571225792, "upvotes": 5}, "f3wvts2": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wvts2/", "text": "[deleted]", "author": null, "created": 1571223638, "upvotes": 10}, "f3wunq2": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wunq2/", "text": "Same", "author": "IDrankChocolateMilk", "created": 1571222098, "upvotes": 1}, "f3wort6": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wort6/", "text": "Would you say most grad schools are like this? I’m considering grad school for the future and honestly this is very important to me", "author": "Due_Minute", "created": 1571212616, "upvotes": 1}, "f3wjllg": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wjllg/", "text": "I’m having the time of my life in my masters program.", "author": "alwaysskiing", "created": 1571205175, "upvotes": 2}, "f3wj5ct": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wj5ct/", "text": "Your experience is not an exception to the rule at all! My experience has been the same. My cohort is phenomenal and we’ve all got each other’s back. Additionally, my thesis panel has been so helpful and supportive, and any professor in my department, regardless of whether they’ve taught one of the grad courses, is more than happy to assist us with whatever we need. While I’m happy to be receiving my degree at the end of the spring semester, I’m definitely going to miss seeing these incredible people a few times a week and the amazing conversations we have.", "author": "Dorkuhsaurus_Rex", "created": 1571204617, "upvotes": 2}, "f3wfbz2": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wfbz2/", "text": "As a wannabe data scientist I must say that people who vent on this subreddit is a small sample and is ultimately a form of selection bias. :)", "author": "ADvklokmhggtfxccvjii", "created": 1571200437, "upvotes": 10}, "f3wfao8": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wfao8/", "text": "I’ve been in both toxic and supportive grad school environments and I can confirm that I do about 10,000% less venting about my program now that I’m in a supportive one. :) congratulations on being in a great program!", "author": "Weaselpanties", "created": 1571200404, "upvotes": 4}, "f3wed4k": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wed4k/", "text": "I remember being really anxious about having a horrible time in grad school because of the horror stories I’ve heard. However, now that I’m finishing my masters I can finally say that my program was amazing and supportive and my PI was the best mentor I could have possibly had. \n\nNow I’m applying to PhD programs and all the anxiety is coming back.", "author": "BadBadger21", "created": 1571199495, "upvotes": 11}, "f3wdar7": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wdar7/", "text": "Upset people tend to be the most outspoken. Happy grad students are probably less likely to post here. \n\nAnyways, I'm super happy too. In 2 week I'll wrap up a productive and fun PhD thesis, and I have a permanent government job lined up that I'll be starting right after. Grad school had stressful periods, of course, but overall it was pretty fun and I'm very happy I did it. Cheers OP!", "author": "Chocolate_fly", "created": 1571198478, "upvotes": 96}, "f3wd5c7": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wd5c7/", "text": "Even within my lab people have SUCH incredibly different experiences due to my advisor treating everyone so differently and the projects you end up on. I'm beyond miserable, but one of my labmates is doing just dandy due to my advisor liking him a lot, him getting good projects, and general willingness to be a confident ass who spews bullshit and gets other people to do his work for him whenever possible.", "author": "ssbbgo", "created": 1571198343, "upvotes": 17}, "f3wcfz9": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wcfz9/", "text": "I thought this my first year, just wait", "author": "MazelCheers", "created": 1571197709, "upvotes": 8}, "f3wc780": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wc780/", "text": "No, it is not an exception to the rule. Happy people aren't complaining on reddit.", "author": null, "created": 1571197494, "upvotes": 12}, "f3wayhe": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wayhe/", "text": "It’s funny. With Instagram, people try to show how fabulous their live are. With Reddit, people want to show how miserable their live are.\n\nI wonder if it’s the anonymity that does that.", "author": null, "created": 1571196444, "upvotes": 237}, "f3wag3k": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wag3k/", "text": "It's not an exception to the rule, people just come here to vent, not because they're happy or stable. I love my program but there have been issues that come up that I came here to commiserate about.", "author": "raggedpanda", "created": 1571196038, "upvotes": 140}, "f3wabwy": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3wabwy/", "text": "What is your area of study?", "author": "squirrels33", "created": 1571195948, "upvotes": 1}, "f3w9yo9": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3w9yo9/", "text": "good for you?\n\nthese kind of posts are pointless though", "author": "DazzlingTumbleweed", "created": 1571195664, "upvotes": -31}, "f3w9qwz": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3w9qwz/", "text": "It's wonderful that you're having a great experience.   Mine was the complete opposite of yours; I would never recommend my program to anyone.", "author": "knockknockbear", "created": 1571195502, "upvotes": 3}, "f3w93s9": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3w93s9/", "text": "I think we all know that it doesn't have to be bad but many of the factors that make for a bad grad school experience are out of one's control. \n\nYou're right. It's a shame that not everyone gets to have a good experience.", "author": "edicalmay_ysicsphay", "created": 1571195035, "upvotes": 14}, "f3w92gu": {"link": "/r/GradSchool/comments/dij1ql/my_program_isnt_toxic_my_professors_and_advisors/f3w92gu/", "text": "I feel the same! Such great programs are out there :)", "author": "mollymayhem08", "created": 1571195008, "upvotes": 18}}}