{
  "sid": "plqi12",
  "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/",
  "title:": "Getting tongue-tied during presentation even though I've practiced like crazy...",
  "text": "Hi all,\n\nI have my first presentation as a PhD student next week and I'm not sure how to fix my problem. I've read all the advice I could find. I think my presentation is good, I'm fairly good at exuding confidence I don't have, and I know what I want to say. I've been practicing every day, giving the full presentation out-loud in my apartment.\n\nNo matter how many times I practice, I end up tongue tied. I'll start a sentence wrong and then have to finish it or I won't explain something the way I wanted to. Then my options are to finish a very awkward sentence or pause, think it through, and start that sentence over. Neither of which are good when doing a presentation.\n\nI have problems with talking too fast, slurring my words, or stuttering so a lot of my concentration goes to saying words slowly and clearly. I just got braces a month ago which makes me have to concentrate even harder on speaking clearly. It makes it a lot easier for me to forget what I was saying or mess up, and I can't help when I mess a word up to start panicking and feeling embarrassed. If I mess up a word it distracts me, causes me to lose my train of thought, and then my mind goes blank and I have trouble recovering.\n\nWhen practice isn't helping anymore, what can I do to present well next week? I'm very nervous but I know I will feel better about presentations if I do a good job on this one. I'm just super scared of freezing up, stumbling over words, or saying things very awkwardly. I stutter when I'm nervous, which does not help.",
  "author": "FirstAvocado",
  "created": 1631297764,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hcf8fbt": {
      "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcf8fbt/",
      "text": "I also get really nervous giving presentations, which manifests for me as a really shaky voice and moving my hands a lot (all the nervous energy goes there). The one thing I started doing which helped me a lot was to take a deep breath in the middle of the presentation. So when I feel myself tripping up or hear my voice shaking I try to finish the sentence and take a deep breath before starting the next one. Honestly it has really really helped - just getting that air in calms your body down and can slow down that \"fight-or-flight\" adrenaline response that always kicks in for me when I have to present. \n\nAnd honestly if you do mess up the sentence, it's completely fine to start it again. I've heard so many presenters do that, everyone trips up on words or makes a mistake sometimes. It's 100% okay to stop, rewind a bit, and say it again for clarification. \n\nBest of luck with your presentation next week!",
      "author": "lemongarlicpasta",
      "created": 1631358878,
      "upvotes": 1,
      "replies": {}
    },
    "hce46ev": {
      "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hce46ev/",
      "text": "Hi! I used to teach people how to give presentations, and my best advice is to NOT FREAK OUT when you stumble on a word. Even the best presenters have brain farts or get tongue tied, and the best thing to do is to acknowledge it, maybe make a joke and move on. I’ve literally said “whoops, sorry, had a small stroke there” or “sorry folks, I’m buffering” Be honest and self-aware. You know what you’re talking about, you’re prepared, and you’re ready. Public speaking is hard, but remember: that everyone in the audience wants you to succeed. \n\nHow intense is this presentation? Just you? You and slides? Memorized? Notecards?",
      "author": "theythrewtomatoes",
      "created": 1631328323,
      "upvotes": 1,
      "replies": {
        "hcejze7": {
          "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcejze7/",
          "text": "I try not to! It's like the first stumble makes the next stumble more likely and so on. Funny to joke about it the first time, but I think that strategy stops working if I keep messing up. Might possibly have an actual slight stutter. I do have a bit of a stutter with certain words that have repeating sounds like \"paper\" that gets 100x worse when I'm nervous. I don't know if it's just me, but articulating some words is just hard? I have to say \"rhabdomyolysis\" a lot in the presentation and that's been pretty hard to get to not come out as a jumble of sounds sometimes. Maybe I just talk too fast, which is a different problem I guess.\n\nI mean, it's not high stakes but it feels pretty intense to me. It's my first presentation of my thesis work (or what my work will be, anyway. I am not very far into the research yet) to my college. Many grad students will be watching, all of my labmates, many PIs etc. It's on Zoom because of all the COVID stuff which actually I feel is harder in some ways. There are slides. I have memorized what I want to say, but I don't want to be too mechanical so it's not word for word the same every time. Notecards would be easy to have since its Zoom. I think generally notecards are frowned upon though.",
          "author": "FirstAvocado",
          "created": 1631338114,
          "upvotes": 1,
          "replies": {
            "hcfos90": {
              "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcfos90/",
              "text": "It really does sound like you need to slow down. I have the same issue where I stutter and slur words together in presentations, mostly when I'm nervous or tired. It gets better when I intentionally pause every couple words. \n\nIt's actually very strange from my perspective because even when I'm stuttering, from my perspective I'm speaking normally not fast. But the audience will tell me differently, so I just have to trust that I personally cannot gauge my own speaking speed, and rely on signs like stuttering and slurring and getting out of breath.",
              "author": "pb-pretzels",
              "created": 1631368742,
              "upvotes": 1,
              "replies": {}
            },
            "hcglk8f": {
              "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcglk8f/",
              "text": "The memorization can be tough, because the second you get off script it can completely throw you off. Echoing another comment in this thread: it’s better to know what you want to say, have your concepts and main points mapped out, and then follow the map rather than a script. Since you’re doing this on zoom, there’s nothing wrong with keeping an outline somewhere on screen for you to reference as you speak so that you don’t go off-track. I used to give tours at a major museum and had to write and memorize all of my material, which meant I had stories regarding about 50 objects/works of art in my head at any time. After a while, some felt like monologues I could do in my sleep. But at first, the process was to map out the story and know which points to hit and what I was eventually building to. That helps immensely when you get off-track or tongue-tied; knowing where you need to go next or what you need to make sure is covered in this current moment. Does that make sense?\n\n(I asked about the slides because in person, in can be very common for presenters to stare at their slides rather than engaging with the audience.)",
              "author": "theythrewtomatoes",
              "created": 1631383292,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hcdnhim": {
      "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcdnhim/",
      "text": "Now that you have the words down, leave them to muscle memory. Keep the concept front of mind and the words will flow. Look into the eyes of the audience to see whether they are getting it. That connection will reduce the stumbles, and make them unimportant when they do happen.",
      "author": "IkeRoberts",
      "created": 1631319737,
      "upvotes": 2,
      "replies": {
        "hcei3da": {
          "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcei3da/",
          "text": "It's  Zoom presentation so pretty hard to see if people are getting it. In some ways Zoom presentations feel harder than in-person ones.",
          "author": "FirstAvocado",
          "created": 1631336746,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hcccakz": {
      "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcccakz/",
      "text": "You probably need to slow your presentation down. Then you can relax and articulate better",
      "author": "dainty_frog",
      "created": 1631298365,
      "upvotes": 3,
      "replies": {
        "hcehy8w": {
          "link": "/r/GradSchool/comments/plqi12/getting_tonguetied_during_presentation_even/hcehy8w/",
          "text": "Yes, likely. Easier said than done!",
          "author": "FirstAvocado",
          "created": 1631336651,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634065605
}