{"sid": "pip9uv", "link": "/r/GradSchool/comments/pip9uv/quals_committee_anxiety_how_screwed_am_i/", "title:": "Quals & Committee Anxiety: How screwed am I?", "text": "So… I just started my fourth year of my PhD. I (stupidly) have failed to meet the department “milestones” for committee meetings. \n\nI have not yet had a committee meeting, \nI have not submitted my prospectus, \nI have not completed my quals. \n\nThere are a few reasons for this, and I now have a huge amount of anxiety around tackling these goals. \n\nRight before COVID shutdowns (in my second year), I submitted a grant for 250,000 for my project… and it was miraculously awarded. This covered all requirements for quals (writing a large grant.) Woot, right? \n\nUnfortunately, 3 weeks before I submitted this proposal to my committee, my project was scooped by another lab member. (Several months later my PI admitted he let this happen). \n\n(On the plus side, I did get on the paper for designing the project and contributing to the data, but this still left me without a main thesis topic.) \n\nSo, shut downs happen, but I manage to collect preliminary data for a new project: and I get negative data. Nothing I can build a proposal on. \n\nNow, for the past year, I have been working on (what was supposed to be) the highest profile project in the lab. Here’s the kicker: I only have negative data… again. \n\nSo, I’m a 4th year grad student with a first author pub, and like 6 contributing author pubs, but no solid project of my own. I’ve completed fellowships, collaborations, conference talks, and thus far, have completely funded my PhD. \n\nBut…. \n\nI’m afraid of getting in trouble with my committee and my department for failing to meet these milestones officially, and I can’t explain my lack of meetings without throwing my advisor under the bus. \n\nLuckily, my department doesn’t have official deadlines for these things, but has strongly suggested deadlines that I am way beyond. \n\nAm I at risk for my PhD being terminated? Anyone else have any experience with this sort of thing?", "author": "BiologyPhDHopeful", "created": 1630890296, "retrieved": 1632953015, "over_18": false, "upvotes": 13, "upvote_ratio": 0.94, "comments": {"hbtzn4l": {"link": "/r/GradSchool/comments/pip9uv/quals_committee_anxiety_how_screwed_am_i/hbtzn4l/", "text": "I don't know if you're at risk of being terminated because each department is different. However, you have a first author publication and 6 other publications so it's not like you're unproductive. \n\nI'd be more concerned about your adviser, to be honest with you. The fact that he \"let\" another lab member scoop your idea for which you were awarded a large grant for your proposal seems either like an act of negligence on his part, or sabotage. Your adviser should be aware of what you are doing and what your project idea is, so it seems like a very massive and suspicious \"oversight\" on their part that should warrant an explanation. It would not be throwing your adviser under the bus to recount, factually, what happened if you have to explain it. I'm not sure of what the norms are in your field, but in mine it would be incredibly rare for a grad student to be awarded $250,000, so what your adviser did would raise some red flags. \n\nIt's also unclear why you're only a contributing author on this paper when it was your idea and you designed the project. For the professors I work with, the person who comes up with the idea is lead author. Of course, they're expected to contribute the most to writing and everything else, but personally I find it difficult to justify being a lead author on a paper that was someone else's idea.", "author": "False-Guess", "created": 1630950398, "upvotes": 5}, "hbrergj": {"link": "/r/GradSchool/comments/pip9uv/quals_committee_anxiety_how_screwed_am_i/hbrergj/", "text": "I am not informed enough on your particular problem to be of any great help. But if you're scared to call out your advisor, well, try not to be? I wish I had advocated for myself, told anyone the shit my advisor was. But I kept thinking it was just because of me, I wasn't good enough. Well, I sure as shit aren't good enough anymore, & I wish I had said how scared I was that I was being let down by my advisor. This person is so important to your well-being, please, do not be afraid to tell someone that THEY ARE NOT DOING ENOUGH FOR YOU. You deserve better than someone who let's you get scooped by someone who was supposed to be on your team. Fuck that. Fuck all of that.\n\nPS - change advisors. Let the costs sink, you are worth it. Take extra time to finish if it means you finish confidently. Knowing you've got someone at your back.", "author": "statusisnotquo", "created": 1630894689, "upvotes": 11}}}