{
  "sid": "eleyah",
  "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/",
  "title:": "I tried one \"new thing\" every month last year to get out of the work-sleep-repeat rut. I was shocked by the improvement in my quality of life and productivity as a grad student. (list of potential hobbies enclosed lol)",
  "text": "For my first three years of grad school, my schedule consisted of working 12-14 hour days, coming home, and vegging on the couch before going to bed. I was unhappy and not as productive as I would've liked, but I didn't have the time or energy to do anything else.\n\nLast year, my new years resolution was to force myself to do things. Starting out sucked all of my energy dry, but I forced myself to try one new \"thing\" per month. \n\nAfter a few months... my entire life was better. I was working less but being more productive, as I had more energy, was sleeping better, and was in general healthier. In the morning, I looked forward to coming to work, and in the evening, I looked forward to coming home and working on a project. \n\nIt was a shitty year for me (lost a few family members, including a parent, and had some academic setbacks), but I'm in a significantly better place than I was last year. \n\nNow, I know this post can come across as a bit r/wowthanksimcured, which is not my intention. It's just a success story of someone who has gotten out of the work-sleep-repeat pattern. \n\nFor those of you who might want to try some new things, my monthly new thing list was as follows:\n\nJanuary - snowboarding (love it, still do it!)\n\nFebruary - painting (didnt enjoy it)\n\nMarch - kickboxing (liked it, but too costly)\n\nApril - Journaling (not my thing)\n\nMay - knitting (loved it, still do it)\n\nJune - gardening (love it) \n\nJuly - piano lessons (dud)\n\nAugust - app development (still do it)\n\nSeptember - gym (still do it)\n\nOctober - rock climbing (nah)\n\nNovember - 3d animation (love it!)\n\nDecember - scrapbooking (fun)",
  "author": "DishsoapOnASponge",
  "created": 1578419707,
  "over_18": false,
  "upvotes": 1019,
  "upvote_ratio": 0.99,
  "comments": {
    "fhhphk7": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fhhphk7/",
      "text": "I know this is late but, I wanted to let you know that your post has positively impacted someone's life. I think it's going to positively impact my whole year!  I have taken this up as my new-year's resolution (I never participate in new year resolutions). These past 1.5 months have been so much more enriching despite the pain that is grad school. I look forward to the next hobby I'm going to take up next month. Thank you so much for sharing your wonderful experience!",
      "author": "DrWishy",
      "created": 1581609153,
      "upvotes": 1,
      "replies": {
        "fhirarn": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fhirarn/",
          "text": "that's awesome!! i'm glad to hear it!",
          "author": "DishsoapOnASponge",
          "created": 1581630278,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fe2zbon": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fe2zbon/",
      "text": "Very cool! I want to do something similar, except with traveling. I'm currently getting my MA in Japan and coming up towards the end, so I want to travel and make sure I see more of the country before I leave. It has been very easy to fall into a school/work - home - netflix - sleep routine. Especially since a lot of the hobbies I had in the U.S. before coming here I haven't been able to keep up with in the same way. But there are so many things to see even just in the immediate area, so I'm making a list and want to visit at least a few places a month.",
      "author": "thebond_thecurse",
      "created": 1578844466,
      "upvotes": 1,
      "replies": {}
    },
    "fdmlwhm": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdmlwhm/",
      "text": "Out of curiosity, how do you feel after stopping? Did you go back to your routine before or do you have enough motivation to continue the activities you liked, so the improvement on mood is still there?",
      "author": "quooj",
      "created": 1578554926,
      "upvotes": 1,
      "replies": {
        "fdn10jh": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdn10jh/",
          "text": "I've continued the activities I like and I don't really have an issue with motivation, which I never thought I'd say haha.",
          "author": "DishsoapOnASponge",
          "created": 1578573954,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fdk1mvw": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdk1mvw/",
      "text": "3D animation?? How did-\n\n>PhD* Physics\n\nOh",
      "author": "TheMechEPhD",
      "created": 1578493824,
      "upvotes": 2,
      "replies": {
        "fdk41pa": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdk41pa/",
          "text": "actually I use blender, which is free, and requires no knowledge of physics :D",
          "author": "DishsoapOnASponge",
          "created": 1578495537,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fdju8fo": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdju8fo/",
      "text": "This is great! I garden and crochet, which I found to be more flexible and forgiving than knitting. I definitely need to implement a practice like this - I have a lot of DIY hobby projects that have been on hold too long, in addition to things I would like to learn or try.\nGardening for me gets better every year, since many of my perennials take time to establish themselves and grow. How have you been getting yours? My garden is made up mostly of clones because I've been propagating from friends' plants, which has been another layer of fun for me.",
      "author": "SupernerdSven",
      "created": 1578487664,
      "upvotes": 1,
      "replies": {
        "fdk45vq": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdk45vq/",
          "text": "Too funny - I started knitting after trying crochet and giving up several times! And my plants also are clones from friends/family, which does add some meaning for me as well. Such an underrated hobby :)",
          "author": "DishsoapOnASponge",
          "created": 1578495616,
          "upvotes": 2,
          "replies": {
            "fdkcuz8": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdkcuz8/",
              "text": "Indeed! I recommend a pineapple top; mine has been growing heartily even though I'm in the northern U.S.",
              "author": "SupernerdSven",
              "created": 1578501187,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fdivjvh": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdivjvh/",
      "text": "Thank you for sharing your wisdom!",
      "author": "ElvhenGambit",
      "created": 1578452002,
      "upvotes": 1,
      "replies": {}
    },
    "fdiqpf6": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdiqpf6/",
      "text": "That is such an awesome idea!",
      "author": "crazyladyscientist",
      "created": 1578448901,
      "upvotes": 1,
      "replies": {}
    },
    "fdipzkt": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdipzkt/",
      "text": "I have been telling myself that I will start working out a t some point for over a year. This motivated me to sign up for one of the fitness classes at my school. Maybe I'll go out of my comfort zone and rake a martial arts class. Any recommendations about easy martial art sports for a beginner like me?",
      "author": "UnspectacularAim",
      "created": 1578448440,
      "upvotes": 1,
      "replies": {
        "fdiq5hz": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdiq5hz/",
          "text": "sorry I'm not a martial arts person :) honestly if it's not cost prohibitive, just try stuff until you find something you like!",
          "author": "DishsoapOnASponge",
          "created": 1578448546,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fdilro2": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdilro2/",
      "text": "Nice ideia. I’ve been trying some different things the past few months as well, and it’s nice to feel like you’re not simply the work that you do. The best of them for me was reading, something that was “meh!” and now I devote a specific time of the day just for it. \n\nFor those uninspired, look for [r/EruditeClub](https://www.reddit.com/r/EruditeClub/)",
      "author": "IgorYamamoto",
      "created": 1578445740,
      "upvotes": 3,
      "replies": {}
    },
    "fdijgy3": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdijgy3/",
      "text": "How did you manage to add multiple things to your life (snowboarding, knitting, app development, gym) -- are you super busy now?",
      "author": "indecisive_maybe",
      "created": 1578444285,
      "upvotes": 1,
      "replies": {}
    },
    "fdigf7i": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdigf7i/",
      "text": "Can confirm this works.  Just started rock climbing and already I feel more alive again.  It’s very easy to get lost in academia and forget we can have lives outside of it.",
      "author": "Smartmud",
      "created": 1578442329,
      "upvotes": 4,
      "replies": {}
    },
    "fdiffxj": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdiffxj/",
      "text": "I wish I had more time for 3d animation. Used to be more into it when I was a kid but man is it time consuming.",
      "author": "sickleandsuckle",
      "created": 1578441692,
      "upvotes": 1,
      "replies": {}
    },
    "fdidb8l": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdidb8l/",
      "text": "Literally my New Years resolution, too! Knowing it made you feel better/more productive inspires me even more. Thanks for sharing!",
      "author": "Passacagalia",
      "created": 1578440312,
      "upvotes": 2,
      "replies": {}
    },
    "fdibdeg": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdibdeg/",
      "text": "This is a brilliant idea, thank you for the inspiration! I also seem to be stuck in this work-school-repeat rut and it is dreadfully monotonous. It seems pretty feasible to try something new each month at the very least.",
      "author": "mishmosh__",
      "created": 1578439154,
      "upvotes": 1,
      "replies": {}
    },
    "fdi65xk": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi65xk/",
      "text": "This is actually a great idea. Thanks a ton for the suggestions. I might not try everything right now but will try to do as many as I possibly can.",
      "author": "notinverse",
      "created": 1578436420,
      "upvotes": 1,
      "replies": {}
    },
    "fdi6085": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi6085/",
      "text": "A long time ago I read a theory suggesting the reason adults feel like life goes by so fast is that we only remember things that stand out from our routines.  When you are a kid so much is new and exciting or different so it stands out.  As you age, things are more common and you settle into a routine.  They suggested scheduling something to look forward to during the week and not just the occasional weekend.  I have been doing this for awhile and will say it helps mentally.  Some little things I have done are\n\n* trying a new restaurant or bar\n* game night with friends\n* renting a movie I'm excited about\n* running on a new trail (I do endurance running)\n* meeting up with a friend to not talk about school or work-that is the key part!\n* photography\n* swimming\n* trying a new exercise class\n* watching a sunset\n* birding\n\nMany free or low cost options if you think about it and get creative.  I also found it helpful for being more productive during the week.  If I want to go to my photo club on Thursday, I need to be caught up to go so I waste less time.",
      "author": "calmhike",
      "created": 1578436340,
      "upvotes": 15,
      "replies": {}
    },
    "fdi4d4m": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi4d4m/",
      "text": "I'm really glad for you!  I discovered the importance of hobbies during comps.  If I hadn't started doing something with my free time, I don't think I would have made it this far in grad school.",
      "author": null,
      "created": 1578435514,
      "upvotes": 2,
      "replies": {}
    },
    "fdi3f39": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi3f39/",
      "text": "I started playing Skeeball competitively and doing improv and those things have pretty much saved my life",
      "author": "TardGenius",
      "created": 1578435033,
      "upvotes": 3,
      "replies": {}
    },
    "fdi1o7k": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi1o7k/",
      "text": "My issue is I come up with all the things I want to do and then when it comes time to it, i don't do it. This post is inspiring and i want to try to do this! My uncle does something kinda similar, every year on his birthday he does 1 'extreme' sport (bungie jumping, white water rafting) and this way his angst of getting older was overshadowed by his excitement :)",
      "author": "ExcitedAlpaca",
      "created": 1578434156,
      "upvotes": 2,
      "replies": {}
    },
    "fdhqlim": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhqlim/",
      "text": "Also important to realise that it's okay if this method doesn't work for you. It didn't work for me, but I had depression which really throws a giant spanner into the idea. If you no longer love even the stuff you've always loved and can't muster the motivation for even the most basic stuff, then you may not love any of the new activities either. Doesn't mean it's a lost cause, just means you need to seek a different treatment before you try again.",
      "author": "NoxiousQuadrumvirate",
      "created": 1578428230,
      "upvotes": 28,
      "replies": {
        "fdim7s2": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdim7s2/",
          "text": "Yes, absolutely. Trying hobbies doesn't cure chemical imbalances (contrary to what an alarming number of people think).",
          "author": "DishsoapOnASponge",
          "created": 1578446026,
          "upvotes": 11,
          "replies": {}
        },
        "fdi649s": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi649s/",
          "text": "What had worked for you? That sounds like me.",
          "author": "Pastry_Lad",
          "created": 1578436396,
          "upvotes": 5,
          "replies": {
            "fdi9xkw": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi9xkw/",
              "text": "Honestly, just time. And maybe better boundaries and a better work-life balance. \n\nI think I'm starting to get better now but it's been nearly 7 years since I first attempted suicide and started treatment. I tried every medication they could think of until the doctors stopped prescribing them, I tried weekly therapy for years until the doctors gave up, I tried exercising and eating better, I tried sleeping more, I tried cleaning my room and setting small goals, I tried forcing myself to do things, I tried illicit drugs and risk-taking, I tried news things as much as I could handle them, I tried making new friends. I kept trying because I wanted to get better. I recommend you try most of it too because maybe one of those will help you where it failed me (not the drugs though, avoid the illegal drugs). \n\nAnd for a long time, none of it helped. Or worse, it made me so angry. I either felt nothing or I felt irrational hatred and rage. I dated people for years and felt nothing, then broke up with them and still felt nothing. People I loved died and I still felt nothing. I was given awards and finished school and I still felt nothing. Then something minor would happen that threw me into a raging tailspin - but still, rage is better than nothing. \n\nI've moved but I don't think that was a magical bullet or anything. I just feel a bit better now. I don't feel *happy*, but I'm no longer crushed by that insane, directionless grief or the lack of interest in living and breathing. Perhaps it's having better, more authentic relationships, trying hard to be more sociable even if I don't quite feel like it, and fixing my relationship with my parents. Maybe it's the new cocktail of drugs that I take off-label. Or maybe it really did just take time. It's very hard to fix an illness when you don't know its cause.",
              "author": "NoxiousQuadrumvirate",
              "created": 1578438384,
              "upvotes": 19,
              "replies": {}
            }
          }
        }
      }
    },
    "fdhq2tf": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhq2tf/",
      "text": "I'm so so sorry for your loss(es). In light of the loss, I'm even more proud of you for pushing yourself to try these new things. I'm truly impressed and inspired.",
      "author": "southeastcheese",
      "created": 1578427923,
      "upvotes": 2,
      "replies": {}
    },
    "fdhopvw": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhopvw/",
      "text": "I started grad school and gave myself the challenge to learn to ice skate this season!!!",
      "author": null,
      "created": 1578427113,
      "upvotes": 1,
      "replies": {}
    },
    "fdhnkvn": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhnkvn/",
      "text": "And it's not too late to start. Thanks for getting my mind working. I'm so guilty of vegging out after work and I come from a long line of loungers. Thank you for the suggestions!\n\nEdit: For cost-prohibitive activities, check for groupon and coupon deals. :)",
      "author": "butnobodycame123",
      "created": 1578426434,
      "upvotes": 3,
      "replies": {}
    },
    "fdhlxsv": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhlxsv/",
      "text": "Roxk climbing nah?!",
      "author": "fuckwatergivemewine",
      "created": 1578425449,
      "upvotes": 8,
      "replies": {
        "fdimw96": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdimw96/",
          "text": "haha i got this response so much from my friends. I just don't have the arm strength!",
          "author": "DishsoapOnASponge",
          "created": 1578446466,
          "upvotes": 6,
          "replies": {}
        },
        "fdhq6mf": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhq6mf/",
          "text": "I relate to OP. I don't like heights. Bouldering can be fun, though.",
          "author": "southeastcheese",
          "created": 1578427986,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fdhkr6m": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhkr6m/",
      "text": "Try out bjj",
      "author": "happygorilla",
      "created": 1578424728,
      "upvotes": 11,
      "replies": {
        "fdhp6lz": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhp6lz/",
          "text": "If kickboxing is too expensive I’d imagine BJJ is a lot more so. I personally find it **too** addicting",
          "author": "Stereoisomer",
          "created": 1578427387,
          "upvotes": 6,
          "replies": {
            "fdhq74q": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhq74q/",
              "text": "I'm spending about 130 a month right now, but my previous was about 60 a month... just depends on the city",
              "author": "happygorilla",
              "created": 1578427994,
              "upvotes": 3,
              "replies": {
                "fdhrgut": {
                  "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhrgut/",
                  "text": "Wow that’s cheap. In my city it’s $180 a month. Also, it’s a Gracie Barra so you have to wear their gear which is $200 for a full set of top, bottom, and rash guard",
                  "author": "Stereoisomer",
                  "created": 1578428735,
                  "upvotes": 1,
                  "replies": {
                    "fdhse0f": {
                      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhse0f/",
                      "text": "Dang I've heard gracie bara made you buy their gear but I had no idea it was so expensive. My gym is pretty great compared to my last one. Its renzo gracie and has 4-6 black belts. Super chill culture.",
                      "author": "happygorilla",
                      "created": 1578429263,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fdhwql1": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhwql1/",
          "text": "HIGHLY recommend this!\n\nLoved it so much I wrote an article (https://gradschool.duke.edu/professional-development/blog/letting-go-and-other-lessons-mat?utm_content=bufferead9d&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer) \n\n... also may not be expensive: my school offers it as a club so participation is heavily subsidized and I even receive a scholarship to cover that.",
          "author": "Ceej640",
          "created": 1578431539,
          "upvotes": 4,
          "replies": {}
        },
        "fdilznp": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdilznp/",
          "text": "ooh i will! thanks!",
          "author": "DishsoapOnASponge",
          "created": 1578445880,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fdhkbvy": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhkbvy/",
      "text": "Can I recommend gymnastic rings or AcroYoga?",
      "author": "SunTzuWarmaster",
      "created": 1578424470,
      "upvotes": 2,
      "replies": {
        "fdindcr": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdindcr/",
          "text": "honestly I would've loved to include some of these things! But I live in such a small town and when I looked it up (well, I looked up aerials) there was only one class and it was in the middle of the day :'(",
          "author": "DishsoapOnASponge",
          "created": 1578446769,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fdhju4c": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhju4c/",
      "text": "How did you start knitting? Buy a kit and watch YouTube videos? My girlfriend wants to start",
      "author": "kudles",
      "created": 1578424173,
      "upvotes": 7,
      "replies": {
        "fdhllho": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhllho/",
          "text": "Not OP, but when I started it was exactly that, bought some needles, some wool (people working on the store can give her some help regarding sizes and types) and YouTube videos and a month later I had my first scarf :)",
          "author": "IMustSayThat",
          "created": 1578425243,
          "upvotes": 10,
          "replies": {
            "fdhm11k": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhm11k/",
              "text": "Thanks!",
              "author": "kudles",
              "created": 1578425503,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fdht13z": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdht13z/",
          "text": "Also there are usually knitting groups held by the local yarn shop! Knitters are typically so friendly and love to teach and learn from one another. Joining a local knitting group is an awesome way to learn too :)",
          "author": "MatSciKnits",
          "created": 1578429621,
          "upvotes": 5,
          "replies": {}
        },
        "fdimts7": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdimts7/",
          "text": "YES! I learned from \"Very Pink Knits\". She has a lot of slow motion videos teaching how to do different stitches, and some pretty easy patterns where she walks you through the ENTIRE thing and tells you EXACTLY what to buy (but you still get to pick out the yarn which is the fun part!)",
          "author": "DishsoapOnASponge",
          "created": 1578446422,
          "upvotes": 4,
          "replies": {}
        },
        "fdibwcf": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdibwcf/",
          "text": "r/knitting is lovely and has info in the sidebar and wiki. Being self-taught is totally doable.",
          "author": "doomparrot42",
          "created": 1578439441,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fdhjo1p": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhjo1p/",
      "text": "Thanks for posting this, really cool story, and I am glad it helped you! Just had a couple questions: What was your process for implementing this? How long did you stick with something if you didn't like it? How often did you choose to pursue these hobbies during each month?",
      "author": "containment13",
      "created": 1578424070,
      "upvotes": 12,
      "replies": {
        "fdimpmm": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdimpmm/",
          "text": "My process was literally just to get started on something once a week. For example, with snowboarding I told myself I'd pack the board/boots/helmet in my car and go to the mountain. Then, if I wanted to go home, I could. But I never did that for any of them - except for a few times where I went to the gym but then went right back home lmao.\n\nIf I didn't like something, I still tried to do it once a week until the month was over, but I'd try to change small parts about it. For instance, I didn't really love painting freeform, so the next week I watched a Bob Ross episode and tried to recreate it. Just small tweaks.",
          "author": "DishsoapOnASponge",
          "created": 1578446348,
          "upvotes": 13,
          "replies": {
            "fdj4bnr": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdj4bnr/",
              "text": "\"Just relax and let it flow. That easy.\" - Bob Ross",
              "author": "BobRossGod",
              "created": 1578458084,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fdhjdsr": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhjdsr/",
      "text": "How did you get into app development? How did you learn to do it?",
      "author": "indecisive_maybe",
      "created": 1578423895,
      "upvotes": 4,
      "replies": {
        "fdin125": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdin125/",
          "text": "Instructables has a great guide on how to make Android apps. I'll admit I was a bit ahead of the curve on this one, having learned Java in undergrad.",
          "author": "DishsoapOnASponge",
          "created": 1578446552,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fdhi2nl": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhi2nl/",
      "text": "This is such a good idea. I like the idea of trying things AS a bucket list. Sometimes I feel like a failure when I try things and don't stick with it. I'm definitely going to try implementing this in 2020. Some ideas I have:\n\nPottery, Bird watching, Cooking (I just cook the same 5 things over and over), Volunteering, Reading fiction fun books, Learn German\n\nThanks for sharing this, you probably made my 2020 a little healthier. ;)",
      "author": "kelseylulu",
      "created": 1578423098,
      "upvotes": 56,
      "replies": {
        "fdhkqh3": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhkqh3/",
          "text": "Birding is awesome! You can combine it with other hobbies too, like painting nature or photographing birds.\n\nYour local Audubon society or another local birding organization almost definitely has field trips or other events you can attend and learn a whole ton! They also usually have binoculars you can borrow. There's a lot more to birding than it might seem at first!",
          "author": "Bradyfish",
          "created": 1578424715,
          "upvotes": 13,
          "replies": {
            "fdhpit3": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhpit3/",
              "text": "Ooooo, smart combining them! This is probably a really dumb question.. are there usually fees involved in birding? Like does the Audubon have fees for these kind of tours? And if so, how much is average/reasonable?\n\nAlso, I just bought a truck and the seller accidentally left a pair of binoculars inside, I tried returning but was told they \"go with the truck\". :P",
              "author": "kelseylulu",
              "created": 1578427592,
              "upvotes": 5,
              "replies": {
                "fdhrljx": {
                  "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhrljx/",
                  "text": "There's usually a registration fee for field trips and stuff yeah, but it's not that bad. Around me (NJ) the Audubon field trips or bird walks are $20ish each? And that's for a few hours walking around with an expert / experts.\n\nWorkshops and classes and such can be really expensive, but I've never gone to one. I learn a ton by just birding with people who know what they're talking about as opposed to learning in a classroom or whatever.\n\nAnd no question is dumb, I'm always happy to help people get into birding!",
                  "author": "Bradyfish",
                  "created": 1578428810,
                  "upvotes": 6,
                  "replies": {
                    "fdhwo7u": {
                      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhwo7u/",
                      "text": "Thank you! $20 bucks isn't bad at all. I spend that on coffee in a week, much better spent on learning. <3 Thanks again!",
                      "author": "kelseylulu",
                      "created": 1578431506,
                      "upvotes": 2,
                      "replies": {
                        "fdi9k7n": {
                          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdi9k7n/",
                          "text": "Yeah of course <3, enjoy the world of birding!!",
                          "author": "Bradyfish",
                          "created": 1578438182,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fdhtkdf": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhtkdf/",
          "text": "For learning German, you should check out \"Langsam Gesprochene Nachrichten\" by DW (a German news station). It's literally \"news spoken slowly\" and has ten minute daily news reports for people who are learning German. It may be a bit advanced if you're just starting out, but it's helped me learn so many useful words!",
          "author": "geosynchronousorbit",
          "created": 1578429910,
          "upvotes": 10,
          "replies": {
            "fdhwfjc": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhwfjc/",
              "text": "Thanks for this! I've thought about using Babbel, but immersing myself in other ways sounds helpful as well, will check this out!",
              "author": "kelseylulu",
              "created": 1578431385,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fdhr69y": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhr69y/",
          "text": "If you take up birding, consider downloading the Merlin bird app. Cornell school of Ornithology built it to help with bird identification. They also have another app, ebird, that you can use to make a list of what you saw and you can use it to explore other sightings in your area.",
          "author": "TBUmp17",
          "created": 1578428563,
          "upvotes": 4,
          "replies": {
            "fdhwjgg": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhwjgg/",
              "text": "Thank you so much for these suggestions. I really don't know much about birding, thinking of looking at apps didn't cross my mind. I'll keep these in mind when I start!",
              "author": "kelseylulu",
              "created": 1578431441,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fdhh9sf": {
      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhh9sf/",
      "text": "Thanks for sharing! I’m currently in a very low place and seeing posts like this actually helps me believe I’m going to get through it. I’m definitely going to do this!",
      "author": "brightlight12234",
      "created": 1578422616,
      "upvotes": 155,
      "replies": {
        "fdilxcq": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdilxcq/",
          "text": "It's really hard to start at first, because most people aren't good at stuff when they first try. You definitely have to push through the feelings of wanting to give up.",
          "author": "DishsoapOnASponge",
          "created": 1578445839,
          "upvotes": 31,
          "replies": {
            "fdix63p": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdix63p/",
              "text": "I’ve gotten better at accepting this, as well. After all, I’m constantly challenged by my PhD studies, and I somehow get through it, so why not apply the same mindset to a new hobby I’ve never done before?\n\nSide note: I’m trying out rollerskating this weekend! I used to do it on and off as a kid so I’m not a total newbie, but it’s been a while!",
              "author": "maievsha",
              "created": 1578453065,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "fdhiixg": {
          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhiixg/",
          "text": "Positivity is a choice, make that choice for you!\n\nEdit: I meant this as encouragement to the poster in a low space.\n\nFuck all y'all that been down voting and talking shit.\n\nPositivity is a choice, in a low spot, that is a good thing to remeber, it helped me through a rough patch a couple of years ago.",
          "author": "Burrito_Capital",
          "created": 1578423371,
          "upvotes": -28,
          "replies": {
            "fdhjw2k": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdhjw2k/",
              "text": "Hard choice for many! Or at least, it takes a lot of hands and help to make you see that you can do things for yourself that may result in positive change",
              "author": "tehlolredditor",
              "created": 1578424205,
              "upvotes": 29,
              "replies": {}
            },
            "fdiedfc": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdiedfc/",
              "text": "/r/wowthanksimcured",
              "author": "ssbbgo",
              "created": 1578441004,
              "upvotes": 12,
              "replies": {
                "fdiedwl": {
                  "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdiedwl/",
                  "text": "Here's a sneak peek of /r/wowthanksimcured using the [top posts](https://np.reddit.com/r/wowthanksimcured/top/?sort=top&t=all) of all time!\n\n\\#1: [Found this picture on Facebook](https://i.redd.it/burxk65rmya11.jpg) | [592 comments](https://np.reddit.com/r/wowthanksimcured/comments/9096hx/found_this_picture_on_facebook/)  \n\\#2: [It do be like that](https://i.redd.it/8zjrjmgaor541.jpg) | [253 comments](https://np.reddit.com/r/wowthanksimcured/comments/ed8ifj/it_do_be_like_that/)  \n\\#3: [Fucking thanks Rachael](https://i.imgur.com/eFfsgYD.jpg) | [297 comments](https://np.reddit.com/r/wowthanksimcured/comments/8yblbo/fucking_thanks_rachael/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)",
                  "author": "sneakpeekbot",
                  "created": 1578441013,
                  "upvotes": 1,
                  "replies": {}
                },
                "fdigcwi": {
                  "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdigcwi/",
                  "text": "It's encouragement, not a cure...\n\nPhD is Piled higher and deeper, right?",
                  "author": "Burrito_Capital",
                  "created": 1578442286,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fdim2r4": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdim2r4/",
              "text": "Oh no burrito got burnt 😂",
              "author": "maldhowayanr",
              "created": 1578445936,
              "upvotes": 1,
              "replies": {
                "fdimmjc": {
                  "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdimmjc/",
                  "text": "It happens, I'm cool with it I guess",
                  "author": "Burrito_Capital",
                  "created": 1578446291,
                  "upvotes": 3,
                  "replies": {
                    "fdimtks": {
                      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdimtks/",
                      "text": "I am sorry, I laughed more than I should. You will be fine, I think.",
                      "author": "maldhowayanr",
                      "created": 1578446418,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fditc64": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fditc64/",
              "text": "\"Positivity is a choice\" is the Jim Belushi of depression advice. Everybody keeps using it and no-one knows why.",
              "author": "junkmeister9",
              "created": 1578450581,
              "upvotes": 1,
              "replies": {
                "fdiz0b3": {
                  "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdiz0b3/",
                  "text": "So if it works 5% of the time, with no harm the other 95% of the time, why is that bad?",
                  "author": "Burrito_Capital",
                  "created": 1578454307,
                  "upvotes": 1,
                  "replies": {
                    "fdj2a7p": {
                      "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdj2a7p/",
                      "text": "If you've ever been in a dark place and been told to \"be positive,\" then you might question your \"no harm\" assumption.",
                      "author": "junkmeister9",
                      "created": 1578456584,
                      "upvotes": 3,
                      "replies": {
                        "fdj3yxz": {
                          "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdj3yxz/",
                          "text": "I have, and I blew it off when it didn't make sense, when it helped, it helped.\n\nYour phd is not in counseling, does that mean you can not give advice? We don't need to be experts to attempt to help others. The poster I replied to needs the help, not me.",
                          "author": "Burrito_Capital",
                          "created": 1578457815,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fdib8li": {
              "link": "/r/GradSchool/comments/eleyah/i_tried_one_new_thing_every_month_last_year_to/fdib8li/",
              "text": "You should make the choice to stfu",
              "author": "westalalne",
              "created": 1578439083,
              "upvotes": -2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064962
}