{"sid": "py0igu", "link": "/r/GradSchool/comments/py0igu/leaving_my_mba/", "title:": "Leaving my MBA", "text": "TL;DR I think I just need words of encouragement from strangers lol\n\nI’ve been in an MBA for about a year now, and I’m realising that I hate every single aspect of it. Long story on why I chose it to begin with, but there was a lot of pressure from my dad to do it, and he helps pay my tuition (yes I know I’m sounding very spoiled). I got my bachelors in English and History, and I’ve never had the talent for anything even remotely math related. Now I’m stuck in another years worth of accounting, economics, and finance classes that I’m severely struggling with.  There’s so much I don’t understand, and even when I do understand I still hate it. It’s gotten to the point where I’m feeling constantly stressed and depressed. I’ve recently decided that it may be best to drop the program as a whole and start a Masters in Secondary Education. Only downside is I’ll have to end up taking on student debt if I do it. I don’t know if I’m necessarily looking for any specific advice (although student debt is gonna be a whole new can of worms) I just want to feel like I’m making the right decision. I feel fairly set in my decision to leave the MBA, it’s just a big, very scary step to take towards making myself happy and feeling like I have control of my life. It sounds like an easy choice, but I’m throwing away a whole years worth of money and work, and most of my friend and family are discouraging it, despite the fact that I barely know if I’m going to pass this semesters classes, let alone the rest of the program. Long post, mostly a rant, but any opinions?", "author": "dreamsofmanybeans", "created": 1632937128, "retrieved": 1632951885, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"her77f3": {"link": "/r/GradSchool/comments/py0igu/leaving_my_mba/her77f3/", "text": "There are two good reasons for getting a master's in a field\n\nYou really enjoy studying the subject area and want to learn more.\n\nIt's important for your career goals.\n\nSounds like neither one of those apply to you. \n\nIf you went straight from undergraduate to an MBA program, might even be good to take a year or two off and work and figure out for certain what you want to do next.", "author": "raistlin65", "created": 1632941072, "upvotes": 3}}}