{"sid": "jmpizd", "link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/", "title:": "I just withdrew all my postdoc applications", "text": "I was working on the applications all week long (that nov 1st deadline!) but I realized I really don't want it. I was doing the applications just because that's the thing expected of us.\n\nAlso I feel like I've been trying so hard to \"play both sides\" and it hasn't worked. Applying for postdocs while looking for work outside of academia just wasn't working.\n\nIts also frightening to say outloud, \"I dont want this anymore\". Theres also a risk that I won't even get a non academic job. And I, personally, am very risk adverse. That's why I wanted tenure; so noone can fire me! But I have to be real with myself too.\n\nGrad school is hard. Thanks for coming to my therapy session.", "author": "mdizzle106", "created": 1604331064, "retrieved": 1632845331, "over_18": false, "upvotes": 547, "upvote_ratio": 0.99, "comments": {"gb8qi98": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gb8qi98/", "text": "Ugh I am going up against the same thing. This post really makes me want to just not even apply for postdocs because I am pretty sure at this point I want to go into industry. I definitely do not want to be a professor, but I think a postdoc could be fun. Also, I feel a bit stuck and obligated to apply to this one fellowship because I was internally nominated by my school and I literally took other people's spots and I don't currently have a job lined up. But I don't feel like having to deal with both job hunting in industry and academia. That sounds like a recipe for disaster.\n\nFor my own sake, I am going to try to go through the pros and cons here\n\n**pros of a postdoc:**\n\n\\+ learn new things from new people and perspectives (but a job also has this benefit)\n\n\\+ get to live somewhere new temporarily (ok covid might ruin this, and again with job hopping this is also possible in industry)\n\n\\+ i am more confident now in my research abilities than i was throughout grad school\n\n\\+ i know more about what i want to study versus at the beginning of grad school\n\n\\+ i feel like i don't know anything and i need to learn more before i go into a job (i think this reason is BS because I am going to feel like this no matter when i start a job)\n\n**cons:**\n\n\\- money lol\n\n\\- work life balance is horrible\n\n\\- i'm just delaying my ultimate career choice in industry because I don't like change and I know what I'm getting with a postdoc but a postdoc will just slow down my career in industry\n\n\\- if i'm honest with myself, i'm just not that passionate about research and what i do so i am probably going to be miserable\n\n\\- writing bs papers that don't help anyone versus working in industry and have immediate tangible effects/changes\n\n\\- if i \"fail\" at a postdoc, does that hurt my chances of getting good industry job", "author": "doubleaxel1951", "created": 1604594249, "upvotes": 1}, "gayzgnz": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gayzgnz/", "text": "Congrats, stay as far away from academia as possible. Dont look back.", "author": null, "created": 1604375651, "upvotes": 1}, "gaygckt": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gaygckt/", "text": "Yeah this just happened to me Saturday, lol... started polishing my resume.", "author": "MinotaurOnLucy", "created": 1604364919, "upvotes": 1}, "gayewnn": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gayewnn/", "text": "Post docs suck anyway. Literally any job other than an academic postdoc that uses your PhD will pay better", "author": "thisdude415", "created": 1604364126, "upvotes": 1}, "gay8yra": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gay8yra/", "text": "Social work PhD here. It's good to know I'm not alone in this.", "author": "SimilarOrdinary", "created": 1604360872, "upvotes": 1}, "gay6l31": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gay6l31/", "text": "Man the more I read about the struggles of the guys who want to stay in academia, the less I want to do it. Stay strong my dude.", "author": "andy_el_gato", "created": 1604359589, "upvotes": 1}, "gaxoq5d": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gaxoq5d/", "text": "Good for you! Do what makes you happy. Also, I’m pretty sure nobody actually wants a postdoc", "author": "Enzohere", "created": 1604350571, "upvotes": 3}, "gaxj0cu": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gaxj0cu/", "text": "Never wanted to do a postdoc. Now over 3 years in and checking the job boards all the time.", "author": "Pompousasfuck", "created": 1604347852, "upvotes": 1}, "gax68bw": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gax68bw/", "text": "huh funny...this was my exact reaction before going into clinical psychology and then deciding to go to law school/public policy school instead.\n\nI did 1 to 2 years of post-bachelor work in labs and threw a lot of that experience away to do something that was better for me professionally.", "author": "MajinVegeta2171", "created": 1604341772, "upvotes": 3}, "gax5u2n": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gax5u2n/", "text": "Lol I just had the conversation with my husband saying I'd be alright being a stay at home parent making money selling artisan bread and handmade knit and crochet goods. I think it's my defense mechanism kicking in because I'm afraid I won't get a post-doc!", "author": "rubberduckie819", "created": 1604341589, "upvotes": 6}, "gax4oou": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gax4oou/", "text": "Be ready for almost all other applications to ask you “have you considered doing a post doc”. Yes I have and I didn’t want to. Do you ask an MS if they considered going to gradschool too? Enough is enough. It gets worse: there’s literally people in stem who do more than 1 post doc with each post doc risking to reach 4 years. I talked to a guy who post doc’ed for more than 10 years and I just wanted to ask why the fuck but I didn’t ......\n\n\nAnd that question is so loaded ... like the majority of academic post docs you’re more likely to get if the PI you’re applying to has money, and they’re easier to get than the more competitive (slightly better paid) industry post docs BUT YOU STILL DONT LEARN INDUSTRY SKILLS SO WHY WOULD YOU CHOSE TO PROLONG THE LOW PAY SUFFERING? I think it’s ridiculous how low post docs are paid.", "author": "chonkycatsbestcats", "created": 1604341052, "upvotes": 3}, "gax4mlt": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gax4mlt/", "text": "Bravo. I hope I had that option. After 300 failed applications, I end up being a postdoc that I hate every second of. \nBest of luck!", "author": "guyonghao004", "created": 1604341025, "upvotes": 2}, "gawymr6": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gawymr6/", "text": "People may call your decision impractical, but I congratulate you. Every time in my life that I’ve refused to accept less than I want/deserve, something better comes along. Every. Time. Trust your gut, do what’s right for you. Be proud of yourself!", "author": "candrade2261", "created": 1604338233, "upvotes": 12}, "gawtifw": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gawtifw/", "text": "Postdoc at national labs is amazing pay (over 80K) and if you want to stay they help you build a competitive application so you can be hired as a staff scientist. They are a perf blend between industry and academia", "author": null, "created": 1604335833, "upvotes": 31}, "gawtgrm": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gawtgrm/", "text": "Congrats! Pursue your dreams, honey. If you already know that you don't want something there is no reason to waste your time and theirs.\n\n\nGood luck! I look forward to your update when you find a job you actually want. 💛", "author": "CeeCee123456789", "created": 1604335812, "upvotes": 8}, "gaws62b": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gaws62b/", "text": "A+ therapy session. \n\nIt's painful to be real with yourself. I'm glad you caught it before losing your time and money.", "author": null, "created": 1604335207, "upvotes": 39}, "gawrm3s": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gawrm3s/", "text": "I feel that, especially with being risk adverse. I turned down a postdoc offer in a toxic lab without having something else lined up. That was scary, but necessary for my mental health. I wish you the best in your search! What kind of job/work environment are you looking for?", "author": "BelgaerThinker", "created": 1604334942, "upvotes": 102}, "gawrlsf": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gawrlsf/", "text": "Congrats on what sounds like the right decision for YOU! Don't apply if you know you don't want it!", "author": "leetocaster347", "created": 1604334938, "upvotes": 3}, "gawqa72": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gawqa72/", "text": "You did the best thing for yourself. It is always risky but be sure your experience in grad school will get you a job you love eventually! Fingers crossed for you!", "author": "crying_out_loud_mary", "created": 1604334314, "upvotes": 5}, "gawpqz4": {"link": "/r/GradSchool/comments/jmpizd/i_just_withdrew_all_my_postdoc_applications/gawpqz4/", "text": "I mean.... you can always say no later right?\n\nTo me, if the applications are in, seems short sighted to pull them out when you don't have any hard plans.", "author": "rustyfinna", "created": 1604334060, "upvotes": 45}}}