{"sid": "jxvj54", "link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/", "title:": "Professors should not be allowed to mandate exams or significant assignment deadlines on a university holiday - fight me.", "text": "A bit of an odd topic, but for the 6th year in a row (out of 9 in higher education), a professor for one of my classes has set a major project deadline during next week’s university holiday.\n\nOur university is fully closed (not just class “break”) on Thursday and Friday to observe the holidays. I have a full semester-long project due on that very Friday. \n\nNow, I am not arguing that I can’t complete it ahead of time. (Which is what I will end up doing.) However, fundamentally, I do not feel that professors should have deadlines or exams/quizzes assigned to dates where their university is actually fully closed. \n\nSome would argue that even having deadlines over a “break” in general isn’t wonderful, but official closures when both staff and faculty are also off, is a no go for me. \n\nCall me “salty,” but this type of thing has happened to me multiple times now, and I’m a bit frustrated. (Maybe it’s just 2020 grinding down on my nerves... but .... as a grad student, I’m already going to be in the lab working during these few days off. It’d just be nice to be able to get a break from class work when there isn’t supposed to be, you know, class.) \n\nEnd rant.", "author": "BiologyPhDHopeful", "created": 1605899973, "retrieved": 1632845836, "over_18": false, "upvotes": 402, "upvote_ratio": 0.96, "comments": {"gd4ilnz": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd4ilnz/", "text": "私はあなたの考えに完全に同意します", "author": "RedFlutterMao", "created": 1605999850, "upvotes": 1}, "gd33i8u": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd33i8u/", "text": "Yeah like what's the difference between having it due right before or on the holiday? I've never had a professor do this for any holidays that the school is scheduled off for and in fact, if a lab or due date is scheduled on another religion's holiday, we have to let students that practice that religion observe and give them a different deadline or let them make up lab or whatever.", "author": "KiwiTheKitty", "created": 1605981972, "upvotes": 0}, "gd29b0n": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd29b0n/", "text": "This is the problem with having thanksgiving so late in the term. You should have Canadian thanksgiving instead in mid October! Lol But really the term ends early December; there's not much wiggle room there.", "author": "ilovebeaker", "created": 1605969347, "upvotes": 2}, "gd2842v": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd2842v/", "text": "Community College Professor here. Thanksgiving break is when I make and set my final exams up virtually. Completely agree that major projects should not be due until after the holiday. \n\nHowever, some of my online-only or hybrid classes will have assignments that are due on Friday or the following Sunday like normal. They are given the whole week to complete them. I feel like that’s still fair game. It shouldn’t take them more than 2 hours to complete, though.", "author": "the_stang_boy", "created": 1605968617, "upvotes": 2}, "gd2698b": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd2698b/", "text": "At my university this is definitely not allowed - profs have done it by accident but will change it if it's brought up to them.", "author": null, "created": 1605967618, "upvotes": 2}, "gd13g03": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd13g03/", "text": "Do we go to the same school? This is the longest paper I've ever written, and I need it to graduate.\n\nI have him for another class. A presentation and an unrelated paper are due the Wednesday before the break.\n\nOn top of that the ski resort just opened. Am I going? Who the hell has time? Petty I guess but it sure would be nice to get outside.", "author": "PyrocumulusLightning", "created": 1605947882, "upvotes": 2}, "gd0zpdy": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd0zpdy/", "text": "I did my degrees online, and work in healthcare. What are these holidays you speak of?", "author": "someguynamedjohn13", "created": 1605944215, "upvotes": 0}, "gd0oclj": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd0oclj/", "text": "exactly the best solution is just to make it due the day before the holiday. No more holiday or fIrST mOnDaY after holiday BS\n\nThen, the professor should be kind to everyone and give everyone an extension. \n\nOH wait, thats the same thing nvm", "author": "BttrThanU", "created": 1605934751, "upvotes": 0}, "gd0nxg8": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd0nxg8/", "text": "I feel the same way! Last year I didn't have this issue but this year, I have two classes that have assignments due on THURSDAY and FRIDAY. That's literally thanksgiving. It's too late now to change anything but I just thought it wasn't really fair.", "author": "Mountain_Apricot", "created": 1605934453, "upvotes": 3}, "gd0dq7e": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd0dq7e/", "text": "yup this has happened to me many times", "author": "rheetkd", "created": 1605927872, "upvotes": 2}, "gd0ddoa": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd0ddoa/", "text": "We have submissions every Sunday :) ☠️", "author": "becky_tararara", "created": 1605927663, "upvotes": 2}, "gd071o9": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd071o9/", "text": "Thankfully I don’t think this was ever done in my university. All work is due before any midterm break, so your break is entirely your own. They can make things due during the break because all assignments had to be physically handed in and the department would be locked to us over the break.", "author": null, "created": 1605923857, "upvotes": 2}, "gd05fp9": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd05fp9/", "text": "Never happened to me because the teaching union, TA union and students union would freak out.", "author": "TheMightyWoofer", "created": 1605922918, "upvotes": 2}, "gd02ddq": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gd02ddq/", "text": "Okay.\n\nBut what if he set the deadline for right before the break, then gave everyone a few extra days to get the work done in case they need the time?", "author": "Deradius", "created": 1605921101, "upvotes": 8}, "gczz3ve": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczz3ve/", "text": "I agree. My students have the whole week off.", "author": "ProfRavenclaw", "created": 1605919187, "upvotes": 5}, "gczyliv": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczyliv/", "text": "My undergrad professors would say \"It is due Wednesday before Thanksgiving, but if you submit it on Thursday night I will still accept it.\" With a small class graded on a curve this usually meant I would spend some time on Thanksgiving working on something.", "author": "King_Freedom", "created": 1605918896, "upvotes": 12}, "gczxq9q": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczxq9q/", "text": "Turn it in Wednesday before break? Your professor is giving you two extra days to work on it.", "author": "nbx909", "created": 1605918405, "upvotes": -1}, "gczxb42": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczxb42/", "text": "Agreed. It's a dick move, and considering the state of the world at the moment, everyone deserves some time to disconnect and focus on self-care during holidays where staff and faculty are told to go home.", "author": "OfTheWater", "created": 1605918168, "upvotes": 2}, "gcztopi": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gcztopi/", "text": "This hasn't happened to me but I totally agree.  \n\nBut I will add to this saying I've had to give a lot of exams to my undergrad students the day before a break because that's how our department wants to roll, and that is something that really irks me. They literally put those exams there to force students into staying.", "author": "ChezJason", "created": 1605916142, "upvotes": 2}, "gczrfze": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczrfze/", "text": "I had a professor who had a term paper due on a university holiday and had class meet on that day too. When I told her that my family was visiting from out of town for said holiday, she said \"well they won't miss you for a couple of hours\".", "author": "betty_deez", "created": 1605914921, "upvotes": 28}, "gczktkh": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczktkh/", "text": "I always had term papers and test the first day after break.  My family got used to seeing me studying before family dinners or at camping trips during the term, but it was rough. Breaks should be breaks. Study after study has proved that people are more alert and focus better on work after weekends and vacations if they are able to fully pull back from work during that time, so I imagine the same logic works with students.", "author": "94sHippie", "created": 1605911444, "upvotes": 40}, "gczgpiq": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczgpiq/", "text": "[deleted]", "author": null, "created": 1605909309, "upvotes": -28}, "gczcqwj": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gczcqwj/", "text": "\"Fight me\" - love it.", "author": "olixius", "created": 1605907265, "upvotes": 5}, "gcz655w": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gcz655w/", "text": "100% agree with you. you’re right to be salty about this happening over a pandemic, especially. I’ve had only 1 professor update us about inclement weather policies (in US) effectively saying they don’t apply since everything is online. BUT now that nearly everything is online—why?? let us have a morsel of a 5 day break. it doesn’t mean our lives stop, or that we suddenly become inexhaustible machines.", "author": "almostnamedkyle", "created": 1605903955, "upvotes": 14}, "gcz4q4u": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gcz4q4u/", "text": "I've never had a professor set deadlines or exams over holiday break, its usually before or right after. I've worked with countless professors as well and it is pretty much an unofficial department rule not to do that to students. \n\nI remember one or two classes in which the professor set a deadline on a university holiday and we would shamelessly point out that it was a holiday, and they'd usually change it (out of pressure or an honest mistake). \n\nYour frustration is completely valid. If we don't expect professors or staff to do any work over the holidays (if they decide to do any work, its up to them), then we shouldn't expect students to be trying to meet a deadline on a university holiday. Even if the assignment is due the following Monday, it is up to the student to make their own choices over how they want to spend their time.", "author": "CalmPea6", "created": 1605903251, "upvotes": 125}, "gcyzoj0": {"link": "/r/GradSchool/comments/jxvj54/professors_should_not_be_allowed_to_mandate_exams/gcyzoj0/", "text": "Well. In my university, deadlines for term papers are at the end of the holidays, every term. You have exams at the end of the regular term, then the holidays to complete your term papers. I'm used to it", "author": "Kaleandra", "created": 1605900769, "upvotes": 13}}}