{"sid": "pwwn7g", "link": "/r/GradSchool/comments/pwwn7g/my_friend_is_in_grad_school_i_am_not_but_i_want/", "title:": "My friend is in grad school, i am not but i want to comfort them throughout the process, what can i do?", "text": "So my friend is going through the process of grad school, is a few years in and heres the primary concerns now\n\npublished papers before but most recent one got rejected? it passed IRB but was rejected by volunteer reviewers? (what do i do here?)\n\nfirst year teacher, is overwhelmed with teaching, making course materials the day of at 1-3am, grading, has a conflict with the other teacher of the course over teaching style \n\nHasnt started dissertation yet, i told them to take their time and try to get a little progress every day, but hard to start without an actual idea for the dissertation \n\n\nim just a lowly bachelors degree student, so i would really appreciate the help getting to know how should i approach these topics with them", "author": "SpamSteal", "created": 1632796406, "retrieved": 1632843825, "over_18": false, "upvotes": 7, "upvote_ratio": 1.0, "comments": {"hejy6qb": {"link": "/r/GradSchool/comments/pwwn7g/my_friend_is_in_grad_school_i_am_not_but_i_want/hejy6qb/", "text": "Keep them grounded in the real world. My non-gradschool friends talking about their “normal” lives was a huge comfort to me during my PhD. It reminded me that I was in a highly abnormal environment, and that sometimes when things sucked it was because gradschool sucked not because I sucked.\n\nI still remember an incident where I walked into the office of an important person (a department head) who had gone several days without answering an email that was extremely time-sensitive/critical for me. The department head then made a phonecall and chewed out my advisor for “letting” me do that, and my advisor then made it clear to me that I had really stepped in it and should never, ever do something like that again. Within the alternative reality of grad school, I had clearly sinned and committed a major faux pas and should be quite ashamed of myself and worried about further repercussions.\n\nBut according to a close friend who skipped college entirely and has a successful career, my department head needed to “get the fuck over herself”. Another non-gradschool friend made some funny comments about territorial urine-marking. These friends helped me remember that it was my environment that was crazy, not me.\n\nThis may be harder for you to do, since as an undergrad you are also a student and may not have much non-academic life experience yet. But you can still help your friend “zoom out” and remember what matters. In most fields, what the professor they TA for thinks about their teaching will not have the teeniest, tiniest bit of an impact on their future. At all. In the long run, what they eat for breakfast matters more, because it could impact their future risk of heart disease. And then there’s all the really big stuff that makes someone a good person leading a good life and has absolutely nothing to do with grad school…\n\nDon’t belittle their concerns, but do ask questions about how the things they’re stressed out over affect their future. In the process of answering that, they may realize that some things aren’t as important as they thought they were. In general, I think “asking questions that might help your friend clarify situations and see them in a different light” might be a good way for you to help them when they’re struggling with something you don’t have any experience with.\n\nAnd do remind them of “the big stuff” sometimes - “You are my friend because (list some things that make them a good and likeable person), not because you get your conference abstracts in on time.” Also, just empathy and listening can help. A lot.", "author": "tentkeys", "created": 1632799871, "upvotes": 3}}}