{"sid": "hyywce", "link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/", "title:": "[Rant] I'm getting cut out of a grant based on my own research", "text": "Two years ago, I made a discovery that had nothing to do with my Ph.D thesis but was solidly in my field of expertise. I documented the results, drafted a budget and full research plan to explore the implications of the new discovery, and shared the details with my advisor. \n\nHe loved it. So much, in fact, that he submitted my plan and budget almost unmodified to the National Institutes of Health as a grant proposal. \n\nThat grant just got funded. And I've been completely cut out of the project. One of the things my advisor changed was removing a budget line for a postdoc and replacing it with a graduate student. A new grad student. I.e., not me. When I talked to my advisor about it, he said my findings were a product of HIS lab, not MY efforts. I'll get a line in the acknowledgements of any papers that are produced from the grant, but won't get authorship. \n\nI realize that I can't just jump on board a brand-new project when I've got one year left before I defend. And I know that it would have been selfish to keep my results to myself, especially as this discovery has some public health implications. And yes, I know it's highly unusual to write your own postdoc position. \n\nBut, dammit, I feel used. This wasn't just a chance discovery; I worked hard to get these results and they're important. I feel I should be involved in the project. Now my work is going to completely fund someone else's Ph.D and I'm not even getting an authorship out of it.", "author": "impressive_neglect", "created": 1595877722, "retrieved": 1632845378, "over_18": false, "upvotes": 499, "upvote_ratio": 0.99, "comments": {"fzo9liu": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzo9liu/", "text": "This sounds similar to my prof who got no credit from his supervisor. He ended up suing him as a grad student. (He’s obviously now an amazing chemistry Prof who ensures that no one taken for granted anymore)", "author": null, "created": 1596065252, "upvotes": 1}, "fzifdpp": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzifdpp/", "text": "Like other responses, in my lab, my supervisor would always include past students as authors  if their initial findings resulted in a publication.", "author": "bunwitch", "created": 1595943835, "upvotes": 2}, "fzhuofo": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzhuofo/", "text": "I’m so sorry this is happening to you. Academia is for the most part a really horrid place. Is there any formal action you can take to reverse this? I understand it’s risky for a grad student to expose yourself like that because of fear of retaliation. Sadly the power structure is such that we have 0 agency. But in a matter this big, and this blatantly unfair, other senior people may have your back. Do you have any other senior people who you can talk to and that you think may be understanding?", "author": "skakkuru", "created": 1595926725, "upvotes": 1}, "fzhj9dk": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzhj9dk/", "text": "[deleted]", "author": null, "created": 1595915773, "upvotes": 1}, "fzhect6": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzhect6/", "text": "This is absolutely unacceptable. It was your original research idea, your execution and your writing. Including your advisor as the correspondent author is the norm but to be cut out from a grant that essentially was completed entirely by you is just bizarre. \n\nTalk to your department head, grad school, the president’s office, even the NIH. Call it for what it is: this is bullshit, your advisor committed a major ethical abuse, and you should never be exploited like this.", "author": "Whereishumhum-", "created": 1595911877, "upvotes": 1}, "fzgoyr8": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzgoyr8/", "text": "Extra idea, on top of what others proposed. If you decide to escalate this, you actually have an extra weapon now - this thread. Any sort of ethics committee or chair is likely to be worried about a PR problem first and foremost, so thread can serve as a bit of a threat for them of what can happen if they don't handle this PR situation properly. You do risk a bit coming off as a bit errant though - immediately airing dirty laundry online. I might suggest taking the following steps:\n\n1. Speak with your chair/ethics rep in person, and describe to them reasonably how you have a problem.\n2. Before you ask them for a particular solution, just mention offhand how you've also asked for advice online, \"of course, completely anonymously, I don't want to hurt our school's reputation\", and then show him/her this thread.\n\nYou have to be clear that you of course wouldn't go to the public like this, but on the other hand they'll get the threat just from everyone's responses on this forum.. and they'll feel the outrage of everyone on this thread agreeing with you as well. This thread is actually a pretty great card to play imo, if you play it right.", "author": "chillage", "created": 1595896362, "upvotes": 1}, "fzggsu1": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzggsu1/", "text": "Yeah something similar happened to me but it was more because of administrative reasons. So I worked on a grant proposal and brought in about 500k but then that year we had an influx of grad students which ended up cutting my salary in half during the final year of my PhD. The school made up a rule about max salary for grad students which is a BS wage ceiling imo so I was expecting some cut anyways but halving was a bit too much for my liking.", "author": "geometer2015", "created": 1595891885, "upvotes": 2}, "fzggssd": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzggssd/", "text": "I'd backup your emails and any other communication you had with this guy yesterday. Whenever and to whoever you complain to will need proof.", "author": "ECTD", "created": 1595891884, "upvotes": 3}, "fzggasf": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzggasf/", "text": "There has already been a bunch of great advice in this thread. I would only add that, if possible, you delay filling the complaint until after you defend so that your PI does not mess with your planned graduation. I am so sorry this happened to you. Something very similar happened to me. Stay strong.", "author": "Fiacre54", "created": 1595891617, "upvotes": 2}, "fzgfj2y": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzgfj2y/", "text": "What type of school was this?\n\n&#x200B;\n\nLarge public/private\n\nSmall public/private?", "author": "Silver4R4449", "created": 1595891205, "upvotes": 1}, "fzgfijz": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzgfijz/", "text": "Yea, 100% academic misconduct. This will be taken seriously by the university if you bring it to them. I would be cautious though, especially since you have a year left in your program. I would bring this up with someone you trust in the department that you can discuss next steps and how they will effect you and the professor", "author": "Vividersplash26", "created": 1595891198, "upvotes": 2}, "fzg9l33": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg9l33/", "text": "This is normal for STEM and even chemistry fields.  Sadly, that work is your professors and not yours and they can do with it as they see fit.  For NIH grants you need to be a professor (research or tenure-track) to count as anything.\n\nYour advisor maybe looking out for your best interests by focusing you on a project for your PhD and not having you diverted on another project.  Additionally, if its an RO1 that is 5 years, which is longer than you will probably be in their lab. Also, a grant is not funded on one discovery.  It takes data from multiple (maybe a dozen) papers to create a competitive NIH grant, even an R21!  So even though your data contributed to the grant, it is not the sole data in the grant.\n\nChalk it up to you discovered an awesome thing and hopefully you got a paper or presentation on it.", "author": "spartan1977", "created": 1595888129, "upvotes": 1}, "fzg85s6": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg85s6/", "text": "Your advisor sounds like my old one. He had a former PhD student of his write a paper and create all of the results from scratch by herself only to force her to take 3rd authorship because he needed the paper under his name to fulfill is grant requirements. Academia is, in many cases, such a fucking sham.", "author": "shapoopy723", "created": 1595887403, "upvotes": 8}, "fzg7hj2": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg7hj2/", "text": "Thanks, u/dcgrey.  I'm happy to comment on this one.\n\nIf it is as you described, this is a serious ethical lapse on the part of your advisor.  It sounds like he plagiarized your work and stole your research idea.  I recommend that you report it to your campus Research Integrity Officer.  You can also report it to the NIH, who will hold your university accountable for investigating it properly.  This page--[https://ori.hhs.gov/index.php/complainant](https://ori.hhs.gov/index.php/complainant)\\--has useful information for complainants.  It will be important to provide documentation of your original results, budget, research plan, and related communications with your advisor.  You can expect your institution to take this very seriously.  It is a serious allegation and, if your facts are correct, it should be corrected.\n\nAnd FYI, it is not all that unusual to write your own postdoc position.  Good luck with it.", "author": "bigrottentuna", "created": 1595887063, "upvotes": 44}, "fzg75op": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg75op/", "text": "Not sure about program managers at the NIH, but I'd want to know if I was funding someone who stole a proposal from one of ftheir students. It would certainly make me a lot more wary about their honesty in other things they'd be trying to pass off in the project.", "author": "racinreaver", "created": 1595886899, "upvotes": 8}, "fzg6ozb": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg6ozb/", "text": "Wow, this is absolutely shocking to me. Reading the stories of grad students in labs make me realise how easier we the non-lab grads have it...", "author": "cilbirwithostrichegg", "created": 1595886670, "upvotes": 2}, "fzg5rn5": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg5rn5/", "text": "Welcome to academia!  You basically have zero recourse here.  You should have negotiated in writing when he took your idea and submitted it as a grant.  You probably have a decent claim to getting on a paper if it uses or is based on your discovery or preliminary data.  You should push for that.  You could also use your idea to apply for a postdoc fellowship in someone else's lab.  That's probably your best bet if you want to actually do the work.", "author": "OverTheFalls10", "created": 1595886210, "upvotes": 1}, "fzg5fc0": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg5fc0/", "text": "This is highly unethical. Be carefull when trying to seek justice because people like this are malicious and will retaliate. \n\nUnfortunately I have first hand experience.", "author": "Extreme_Pomegranate", "created": 1595886042, "upvotes": 2}, "fzg2203": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg2203/", "text": "That sucks. It's similar to something that happened to me, though outside of grad school. My dissertation research was on a certain government program in a developing country. The government agency liked my research so much that they told me they wanted to fund me so that I could continue my work. I had several discussions that culminated in being asked to write up a whole project outline and budget. It was actually happening! I had actually created a job for myself! I was pretty excited. Then months went by without a response. Finally they said they weren't sure if their policies allowed them to hire me directly, as opposed to putting the project up for tender. Then they assured me that even if it was tendered, I would still have a strong role and could be subcontracted by the winner. Eventually they took my project and put up for bid and a consultancy won. I thought at least the consultancy would pay me to do work for them, but their only interest in me has been superficial, keeping me updated on their progress and asking for very basic feedback and advice. \n\nAnd I have nothing to show for it.", "author": "bicepsion", "created": 1595884365, "upvotes": 4}, "fzg169x": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg169x/", "text": "Why did you write up a grant proposal in the first place? Especially one that focused on funding and personnel? Were you planning on submitting this for a training grant or something?", "author": "wretched_beasties", "created": 1595883923, "upvotes": 2}, "fzg163d": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzg163d/", "text": "Ugh, I wish I could remember/find the username of the person in either r/AskAcademia or r/professors with the flair something like \"Professor and VP Research\". They're always really helpful and would be perfect for this question. If anybody knows, please tag them.\n\nEdit: It's u/bigrottentuna!", "author": "dcgrey", "created": 1595883920, "upvotes": 12}, "fzfxo20": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfxo20/", "text": "I been in a similar situation and have thought through many scenarios. My situation made me feel so used and abused but I had no choice but to move on. At the end of the day your PI didn’t do anything wrong on paper. You are part of his lab, you’re paid by his grants and you use his labs materials, therefore anything you generate whether it be experimental results or ideas are free to him to use. It’s just like how big tech companies often will take the inventions and developments from its employees as it fully belongs to the company and the individual employee responsible for the ideas have no rights to them. That employee may get a promotion and a pay raise as recognition. In your case, since a grad student can’t really get a pay raise, the only thing we can get is publications and a good letter of reference for our next endeavor. I think you deserve to have your name in the authors of any future publication from that grant if that publication include experiments originally designed by you. I hope you have a paper trail to back yourself up. Also, make sure he at least mentally acknowledges you, meaning he acknowledges you for the ideas in his mind. With that you can at least get him to put it on future reference letters.", "author": "snoop_pugg", "created": 1595882244, "upvotes": 1}, "fzfwwju": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfwwju/", "text": "From my perspective, you’re expressing completely reasonable thoughts and feelings about this. Ask for what you want.", "author": "letsrollwithit", "created": 1595881878, "upvotes": 4}, "fzfwazo": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfwazo/", "text": "This is absolutely unethical behavior. You have receipts, use them to your advantage. Try a mediation with your PI, otherwise, escalate. I know it's hard given that you are defending soon, but you deserve authorship. Your PI does not have to hire you if they don't want to, but that is your intellectual property.", "author": "nanon_2", "created": 1595881588, "upvotes": 15}, "fzfvo6t": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfvo6t/", "text": "Not ok. Don't every sell yourself short. People do write their own postdoc positon. Like a lot I'm Canada.\n\nYou got bumped for cheaper labour. See it for what it is. A grad student costs less than a postdoc and is easier to use. Your work got stolen and you got outsourced. \n\nThis happens too much in academia. Please, please try to break the system by escalating it. I'm so sorry I don't know to who or how.\n\nYour work was soo amazing and important it went to a national granting agency and won. You deserve credit. This it's my lab thing is not a real reason to bump you out of your work.", "author": "rnalice", "created": 1595881285, "upvotes": 53}, "fzfv9u7": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfv9u7/", "text": "Highly unethical. But such is the state of things amongst our institutions of higher learning.", "author": "luftwaffle333", "created": 1595881093, "upvotes": 2}, "fzfujts": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfujts/", "text": "This is flat-out research misconduct. It doesn't matter that you're a grad student and the findings are a product of his lab—whatever that means. Nor does it matter that the idea has nothing to do with your thesis. He took your ideas without giving you appropriate credit. Tenured professors have been fired over *much* less; e.g. [this example at Dartmouth](https://www.statnews.com/2018/08/20/dartmouth-health-policy-researcher-plagiarized/). \n\nEscalate, escalate, escalate. Talk to the obmudsperson, chair, or the office of grad education. Especially if your idea is one that you think has legs.", "author": "eeaxoe", "created": 1595880748, "upvotes": 50}, "fzfu3gz": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfu3gz/", "text": "Do you have authorship for the original result and these are follow ups or is the original unpublished? It still seems like you should get credit for designing the experiment though.", "author": "mediocre-spice", "created": 1595880532, "upvotes": 11}, "fzft5ls": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzft5ls/", "text": "Talk to your department chair or graduate school office about this matter. This is blatantly unacceptable, maybe not from a legal perspective, but from an ownership one.\n\nIt might screw up your opportunity to graduate on time given you’ll have to deal with more shit from your advisor. But if you care enough to want to be involved in this, you should make that clear", "author": "ridethelightning469", "created": 1595880078, "upvotes": 118}, "fzfsaw5": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfsaw5/", "text": "If you wrote it up as a proposal then your advisor stole that from you. That is not ok. This sounds like a serious case. If you are serious about it I think you should consider talking first to the Graduate student liason to get their input, but it may need to go to the VPR.", "author": "Pop_pop_pop", "created": 1595879678, "upvotes": 44}, "fzfribe": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfribe/", "text": "My condolences. It’d be nice to think that there’s purity and honor in research academia, but it’s just as cut throat and demoralizing as being part of the capitalist machine. And that attitude from your advisor just perpetuates that. What an asshole", "author": null, "created": 1595879304, "upvotes": 15}, "fzfrfkt": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfrfkt/", "text": "I know authorship norms vary a lot by field and I'm a chemist, but not ending up with any authorship from such a project does not seem appropriate. If someone in my group did the in-house work and writing to obtain time on a X-ray laser, then graduated, they would certainly be an author on the first paper to come out of that machine time.", "author": "i8i0", "created": 1595879269, "upvotes": 237}, "fzfr11j": {"link": "/r/GradSchool/comments/hyywce/rant_im_getting_cut_out_of_a_grant_based_on_my/fzfr11j/", "text": "What! That is absolutely horrible. Granted, I am not sure what field you are in, but honestly no matter what field you are in, this should not be an acceptable practice. You worked hard on that proposal and it was based on your own discovery. I agree that if it was in your advisor's lab that he should be included, but I don't believe he has any right to essentially cut you out of the project. You should both be included and I don't think he had any right to cut you out of the project. That is so ridiculously unfair. I'm so sorry.", "author": "BonnieviewDrive", "created": 1595879080, "upvotes": 150}}}