{
  "sid": "qw166l",
  "link": "/r/GradSchool/comments/qw166l/i_am_so_thankful_for_my_phd_supervisor_the_little/",
  "title:": "I am so thankful for my PhD supervisor...... The little things matter.",
  "text": "During my Masters, I experienced a really difficult experience with my supervisors. I had to tiptoe around and make sure every word I said didn't hurt them. It was a challenging experience, to say the least. It was hard to show that I feel vulnerable and unsure of myself around them.\n\nComing into my PhD, I feel very thankful to my new supervisor. Recently, I misunderstood what my supervisor said which caused me to embark on this writing journey which I thought was what we previously discussed about. Then, I had a discussion with my supervisor about this supposed \"extension\" I'm writing about and he very kindly told me that this wasn't the initial plan etc... We exchanged emails and managed to resolve it in under an hour.\n\nThat was it. No harsh words. There was no \"you are supposed to know this as a phd student\", \"this is your job, you need to be more accountable for it\", \"I'm disappointed in you\", \"I expected more from you\" or \"You think you know it all\".\n\nNone of that in our email exchange or even in any of our discussions. I feel that I am able to be myself in this PhD journey. I make mistakes, I discuss about the mistakes and my insecurities about my research journey. Then, my supervisor just calmly discusses with me about all these things with no reference whatsoever to me being a terrible human for not grasping all these things naturally.\n\nGreat supervisors are a gift.",
  "author": "givemeyourdonut",
  "created": 1637161348,
  "updated": 1637182611,
  "over_18": false,
  "upvotes": 54,
  "upvote_ratio": 0.95,
  "comments": {
    "hl0b4ew": {
      "link": "/r/GradSchool/comments/qw166l/i_am_so_thankful_for_my_phd_supervisor_the_little/hl0b4ew/",
      "text": "I really really hope I get a supervisor like yours!!",
      "author": "obitachihasuminaruto",
      "created": 1637168710,
      "upvotes": 6,
      "replies": {}
    }
  }
}