{
  "sid": "pgl97t",
  "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/",
  "title:": "Advice on building relationships with professors",
  "text": "I would like to get a Masters degree and know that having a strong relationship with professors is important for a strong LoR. Any advice?",
  "author": "Equal_Revolutionary",
  "created": 1630599930,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.86,
  "comments": {
    "hbgkk4a": {
      "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbgkk4a/",
      "text": "All of this is great advice. If your professor offers you the opportunity to do something unique for a final project, do it. If your professor is conducting research and asks for volunteers to help, do it. I recently ran into a professor who I did both of these things for who I hadn’t seen or spoken to in 5 years. I had to remind her of my name but as soon as I did she said “oh, yes! ohdaisydaisy! I still have your final project in my office”",
      "author": "ohdaisydaisy",
      "created": 1630684416,
      "upvotes": 2,
      "replies": {}
    },
    "hbckt9r": {
      "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbckt9r/",
      "text": "Speak up in class, don’t be afraid of giving a wrong answer (that’s different from answering when you don’t know just to be heard). Lots of prof’s will bring on TAs who received a good grade in the class. My second year I was an unpaid TA just for the experience and it really helped my relationship with that professor, who in return gave me a great LoR",
      "author": "RenaissanceScientist",
      "created": 1630608199,
      "upvotes": 8,
      "replies": {}
    },
    "hbc84me": {
      "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbc84me/",
      "text": "Be critical. Many of my co-students are not critical at all and eat everything the professors say. Some friends and I, however, challenge the professors and their views. It's also highly refreshing and I was offered some mini-jobs with one professor already being rather early in my masters. \n\nMy prof also told me he is frustrated by how uncritical many of his students are, and that if they ask questions it's about the font size of some assignment or stupid stuff like that, instead of figuring things out themselves...",
      "author": "CleviaLynch",
      "created": 1630603125,
      "upvotes": 1,
      "replies": {}
    },
    "hbc6lxc": {
      "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbc6lxc/",
      "text": "Make sure your professors know you by name by making yourself \"known\" in class/activities etc. Participate, do really well in exams, go to their consultation prepared and go to their classes prepared. Make sure you engage in good conversations with them at least once or twice during your undergrad.",
      "author": "givemeyourdonut",
      "created": 1630602512,
      "upvotes": 4,
      "replies": {}
    },
    "hbc24qw": {
      "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbc24qw/",
      "text": "Go to office hours even if you dont have questions. If you have a question ask, obviously. If not, just ask to review the topics discussed so you know you have it down. Then break the ice some more and talk about how they ended up where they are now, etc etc. \n\nMost importantly, if you do all this, get a great grade in the class lol",
      "author": "CptSmarty",
      "created": 1630600750,
      "upvotes": 15,
      "replies": {
        "hbcg2vt": {
          "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbcg2vt/",
          "text": "I’d actually push back on this point a bit. I tend to talk too much in class so I have to consciously rein myself in, so that informs my experience. I’d say go to office hours for sure, but don’t go just to go. Go with specific questions in mind. If you want to review a topic from class, that’s great, but go with one in mind that you’re struggling with.",
          "author": "ThrowawayHistory20",
          "created": 1630606315,
          "upvotes": 12,
          "replies": {
            "hbcyvb7": {
              "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbcyvb7/",
              "text": "Thanks! This is great advice",
              "author": "Equal_Revolutionary",
              "created": 1630613767,
              "upvotes": 1,
              "replies": {
                "hbdze7p": {
                  "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbdze7p/",
                  "text": "If applicable, get in the field experience or work with them on a 1-1 basis.",
                  "author": "bramante1834",
                  "created": 1630630373,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hbcd4ic": {
          "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbcd4ic/",
          "text": "This. The best thing I ever did was start talking to my professors on a regular basis. They are usually helpful and approachable (And office hours are really boring when no one shows up, a nice chat with a student makes them feel worth while)\n\n Also if you find out the professor who shares your research interests offers an extracurricular reading group. Get involved.",
          "author": "CadmiumRrred",
          "created": 1630605103,
          "upvotes": 2,
          "replies": {
            "hbcysnf": {
              "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbcysnf/",
              "text": "Thank you!",
              "author": "Equal_Revolutionary",
              "created": 1630613738,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hbc379d": {
          "link": "/r/GradSchool/comments/pgl97t/advice_on_building_relationships_with_professors/hbc379d/",
          "text": "Thank you!",
          "author": "Equal_Revolutionary",
          "created": 1630601170,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066239
}