{
  "sid": "qoo6w3",
  "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/",
  "title:": "Is it bad to take a gap year before graduate school?",
  "text": "I'm a physics major and I'm graduating soon, I want to take a gap year before I go to graduate school. Is that a bad idea? \n\nReason: I'm working on a few research projects that will have an outcome after the graduate admission deadline. I know that with those projects I'll have a better chance of getting in, but I don't want the grad school to think that I'm slacking by taking a year off.",
  "author": "Electrical_Bed2638",
  "created": 1636290475,
  "updated": 1636656577,
  "over_18": false,
  "upvotes": 109,
  "upvote_ratio": 0.93,
  "comments": {
    "hjo4g91": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo4g91/",
      "text": "Not at all. In fact, if you do something productive during the gap period, it will boost your chance to get admitted.",
      "author": "Wise-Replacement7286",
      "created": 1636291000,
      "upvotes": 102,
      "replies": {
        "hjo670f": {
          "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo670f/",
          "text": "That's the plan! Thank you",
          "author": "Electrical_Bed2638",
          "created": 1636291934,
          "upvotes": 13,
          "replies": {}
        },
        "hjr8n34": {
          "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjr8n34/",
          "text": "Agreed. I was far more likely to admit a student who was *not* directly out of undergrad.",
          "author": "halavais",
          "created": 1636338432,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjo4l5t": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo4l5t/",
      "text": "I took a decade off between undergrad and grad school. You’re fine.",
      "author": "Funkybeatzzz",
      "created": 1636291072,
      "upvotes": 248,
      "replies": {
        "hjo6475": {
          "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo6475/",
          "text": "Thank you! I guess I was just worried that the grad school would think that I'm lazy or something",
          "author": "Electrical_Bed2638",
          "created": 1636291893,
          "upvotes": 32,
          "replies": {
            "hjod8k1": {
              "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjod8k1/",
              "text": "The major thing I would suggest is that you get your professors to write recommendation letters now rather than after your time off. They’ll still be relevant a year or two or three from now.",
              "author": "Funkybeatzzz",
              "created": 1636295384,
              "upvotes": 65,
              "replies": {
                "hjoir0y": {
                  "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoir0y/",
                  "text": "good point",
                  "author": "almondbutter_22",
                  "created": 1636297751,
                  "upvotes": 3,
                  "replies": {
                    "hjpyfb7": {
                      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpyfb7/",
                      "text": "And if possible, ask them to not put a date on the recommendation. Speaking from experience, It really comes in handy for you to not have a dated looking recommendation, and it’s handy for your professors who don’t want to write several recommendations over the years.",
                      "author": "Internal-Bear-8184",
                      "created": 1636318132,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "hjslbfd": {
                  "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjslbfd/",
                  "text": "In many institutions, you can’t do that since the professor sends the letter directly during the application process. I doubt they would want to write a letter a year in advance with no real assurance it will be used or how it will be used.",
                  "author": "ThePoliteCanadian",
                  "created": 1636372598,
                  "upvotes": 0,
                  "replies": {
                    "hjsvxx0": {
                      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjsvxx0/",
                      "text": "But they can write them and store them to send later. They won’t spoil.",
                      "author": "Funkybeatzzz",
                      "created": 1636378875,
                      "upvotes": 1,
                      "replies": {
                        "hjtabxq": {
                          "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjtabxq/",
                          "text": "Guess we’re just from different faculties or I have shit profs that get pissy when you ask them to do any sort of work.",
                          "author": "ThePoliteCanadian",
                          "created": 1636385507,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hjoj7s4": {
              "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoj7s4/",
              "text": "Definitely not. One of the things I've really liked about grad school is you have people of all ages and it's totally normal.",
              "author": "sophtine",
              "created": 1636297951,
              "upvotes": 12,
              "replies": {
                "hjpckf7": {
                  "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpckf7/",
                  "text": "My PI is only four years older than me",
                  "author": "Funkybeatzzz",
                  "created": 1636309640,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hjp7zph": {
              "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjp7zph/",
              "text": "They won't even notice. My boss was on the admission committee. He has the wrong BS graduation year on the website for me.",
              "author": "Mezmorizor",
              "created": 1636307859,
              "upvotes": 1,
              "replies": {}
            },
            "hjq9cb1": {
              "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjq9cb1/",
              "text": "They'll only think you're lazy if you tell them that you were lazy. If they ask how you spent your gap year, tell them all of the relevant things to your career path you did to keep yourself occupied and engaged.",
              "author": "the_stang_boy",
              "created": 1636322526,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjo5gvg": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo5gvg/",
      "text": "My grad school preferred students that took time off to work because undergrad is so different than grad school",
      "author": "Sriracha11235",
      "created": 1636291548,
      "upvotes": 67,
      "replies": {
        "hjo66e3": {
          "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo66e3/",
          "text": "Thanks! That's helpful",
          "author": "Electrical_Bed2638",
          "created": 1636291925,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hjob4eo": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjob4eo/",
      "text": "Not in the slightest. While most people (at least in my program/school) go into PhD right after undergrad, I'd highly recommend taking a gap year to work. And no program will look down on you for doing so.  \n\n\nThat extra research/work experience will boost your application--as you said--and it'll get you some money in the bank. Moving to a new city and furnishing an apartment from scratch is *expensive*, and even if you get a stipend it will barely cover month-to-month expenses. I worked for a year living with my parents, and used the money I'd saved to pay off student loans, buy a car, and go on an IKEA/Salvation Army shopping spree.",
      "author": "Tritagator",
      "created": 1636294398,
      "upvotes": 24,
      "replies": {}
    },
    "hjocf61": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjocf61/",
      "text": "Absolutely not! I even wrote an article about why taking a gap year between physics undergrad and physics grad school can be a really great thing - check it out [here at Physics Today!](https://physicstoday.scitation.org/do/10.1063/PT.6.3.20201118a/full/)\n\nTo specifically answer your question - grad schools essentially lump applications together for people who have taken 1-2 gap years, with the rest of the cohort of people who immediately came from undergrad. The statistics, as well as interviews with physics grad admission professors, supports the idea that there is no serious disadvantage (from an application side) of taking a gap year. \n\nThe biggest risk you run is that it will be harder to find the motivation/access to complete a grad school application when you are away from school. You will have to self-motivate to take exams (ie, the pGRE and GRE), track down your register's office to send in your grades, and somehow get professors to write you letters of recommendation even if you are not able to go directly to their offices.",
      "author": "seattlechunny",
      "created": 1636295008,
      "upvotes": 11,
      "replies": {}
    },
    "hjofr88": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjofr88/",
      "text": "I did some travelling during my gap year between undergrad and grad school. I was much more relaxed when I started my programme and honestly I think no one would really mind as long as you're doing something meaningful for yourself.\n\nI also helped publish a paper with my data during my gap year as well.\n\nYou'll be fine.",
      "author": "deliciouswaffle",
      "created": 1636296473,
      "upvotes": 7,
      "replies": {}
    },
    "hjoh6wa": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoh6wa/",
      "text": "I dropped out of a PhD program (bad fit, with the financial reality different from what was presented and incompatibilities with an advisor who I now know does poor quality research) and then waited tables for ~1.5 years. I somehow found my way into one of the top programs for my field in the world.\n\nThat time waiting tables was a great mental break between undergrad and graduate school, and it also helped for the motivation to get back into academia and research which I find more fulfilling.\n\nIf you take a gap year, get projects out, that would only be a positive. If you take a gap year just to relax and figure out what you want to do for grad school, that is also a positive. I actively encourage undergrads I mentor to take a gap year, if possible, between undergrad and graduate school.\n\nSo: gap year = very good idea, particularly in your situation",
      "author": "vegetableWheelhouse",
      "created": 1636297081,
      "upvotes": 5,
      "replies": {}
    },
    "hjoipms": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoipms/",
      "text": "Please take the year off! It will give you perspective and u'll be happy you took it away from school! working, taking a break, just chilling, do whatever you wish to",
      "author": "almondbutter_22",
      "created": 1636297735,
      "upvotes": 5,
      "replies": {}
    },
    "hjo5yxt": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo5yxt/",
      "text": "It may be time to come up with a FAQ section here, I think I've seen the same q about 10 times. But no it doesn't matter at all, I took Four years off and another three before PhD",
      "author": "Conhbd",
      "created": 1636291815,
      "upvotes": 14,
      "replies": {
        "hjo65oc": {
          "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo65oc/",
          "text": "Sorry about that, yes I read other questions but mine was more based on physics",
          "author": "Electrical_Bed2638",
          "created": 1636291915,
          "upvotes": 3,
          "replies": {
            "hjo8oca": {
              "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjo8oca/",
              "text": "Don't apologize! Sorry if I came off rudely, it was more of a general thought for the sub than any sort of insult towards you.",
              "author": "Conhbd",
              "created": 1636293200,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hjobvwy": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjobvwy/",
      "text": "I had 4 years between undergrad and masters, then another 8 years before starting my PhD. You’ll be fine. If you’re using the time wisely all the better and it might give you some perspective to just be out of school for a while.",
      "author": "cynikles",
      "created": 1636294762,
      "upvotes": 3,
      "replies": {}
    },
    "hjoiltu": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoiltu/",
      "text": "I took 1 year off between before my last year in undergraduate. Did 1 year internship. Changed the trajectory of my life.\n\nAlso if you are interested, I have collected resources on what one can do during the gap year.\n https://www.xoxial.com/lists/list-profile/60204cf21fd5632d65aad280\n\nAs long as you have a plan to do something worthwhile to expand your world, to come up with more questions you want to pursue, ... then it is not a bad thing.",
      "author": "born-to-code",
      "created": 1636297688,
      "upvotes": 3,
      "replies": {
        "hjpf13p": {
          "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpf13p/",
          "text": "Thank you so much! That's very helpful",
          "author": "Electrical_Bed2638",
          "created": 1636310595,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjp9opm": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjp9opm/",
      "text": "People are giving you a lot of \"I took x years off before grad school\", but there's a huge confirmation bias here.\n\nI know plenty of people who would not recommend taking time off because they never returned, but they're obviously not posting on /r/gradschool.\n\nYou should talk to admissions, I had a few ongoing projects when gradschool started and they helped my application because I described them and the potential future publications. Plus the first few months of gradschool are usually slow because you're doing background research and course work.",
      "author": "LoaderD",
      "created": 1636308533,
      "upvotes": 3,
      "replies": {}
    },
    "hjpxt6h": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpxt6h/",
      "text": "TAKE TIME OFF!!! I say this as someone who took off 2 years between undergrad and grad  due to a number of reasons both personal and professional. Burnout is real and it takes time to understand how your mind needs to recover from prolonged bouts of stress (like academic). Additionally, there are programs that encourage (not require) time off bc some places care about young college kids becoming well rounded citizens rather than JUST scientists. I am finishing my masters (shark ecologist) and as a side job I work as a special ed teacher, a totally opposite field of my professional one but I'm happy to say that it's been a good place for me to learn about myself and give my mind a break. \n\nSorry to ramble, but I feel like people don't talk about gap years enough!! Best of luck to you!",
      "author": "elasmotri",
      "created": 1636317892,
      "upvotes": 3,
      "replies": {}
    },
    "hjof76j": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjof76j/",
      "text": "No, it's great. It's actually seen as a plus to take some time and do research in between and it can really help with burnout to do something a bit lower pressure.",
      "author": "mediocre-spice",
      "created": 1636296235,
      "upvotes": 2,
      "replies": {}
    },
    "hjoirxd": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoirxd/",
      "text": "I took a couple years off in between. Admittedly, I'm in the fine arts and I could continue learning and growing independently from school, and my professors actually recommend we wait a good few years and be artists on our own for a bit and mature before going for the MFA. But you should be fine!",
      "author": "lilycamilly",
      "created": 1636297762,
      "upvotes": 2,
      "replies": {}
    },
    "hjorq31": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjorq31/",
      "text": "I took 4 years between undergrad and grad school. Coming in as a more mature person and scientist helped me immensely. That said, being a grad student in your 30s can be rough without the right support system.",
      "author": "Chahles88",
      "created": 1636301386,
      "upvotes": 2,
      "replies": {}
    },
    "hjp41mn": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjp41mn/",
      "text": "One of my biggest regrets is NOT taking a gap year. You're only young once. Do something with your time that isn't academia. Find who you are outside of school. You'll be better for it.",
      "author": "kitzdeathrow",
      "created": 1636306265,
      "upvotes": 2,
      "replies": {}
    },
    "hjp4km4": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjp4km4/",
      "text": "BioMed PhD here. Taking a year off is not a bad idea at all. I took a gap year and worked a 9 to 5 lab tech job to make money to help me feel more financially secure during grad school. This tech job resulted in a few publications before I even began my PhD and helped bolster my application. The year off really helped me overcome some of the mental exhaustion from undergrad and to get clear about how I want my PhD to go. It also allowed me to build some field specific skills without the grad school pressure. 10/10 would recommend.",
      "author": "4-youreyezonly",
      "created": 1636306476,
      "upvotes": 2,
      "replies": {}
    },
    "hjpbliy": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpbliy/",
      "text": "I took a year off to work at a law firm and polish my application materials; if I hadn't, I probably wouldn't have gotten in.",
      "author": "synesfreesia",
      "created": 1636309259,
      "upvotes": 2,
      "replies": {}
    },
    "hjpbv3y": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpbv3y/",
      "text": "My PI told me he frequently preferred the PhD program applications of students who had taken time off because they were more likely to be fully committed to doing the work for a PhD rather than rushing into it because they thought it was their only option post-grad. Plus I’m in the middle of my gap year and it’s been one of the best years ever so would absolutely recommend",
      "author": "orgodeathmarch",
      "created": 1636309365,
      "upvotes": 2,
      "replies": {}
    },
    "hjpiriv": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpiriv/",
      "text": "I worked for a year between undergrad and my PhD, and I am SO much better off for it. I got to avoid online school (for the most part) while making a good income for a year. Now I'm financially stable, 100% sure that industry isn't for me, and started grad school off on the right foot.",
      "author": "CorporateHobbyist",
      "created": 1636312028,
      "upvotes": 2,
      "replies": {}
    },
    "hjpjwa4": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpjwa4/",
      "text": "Not at all, I took 3 years off in between. And if the result of a gap year is published research that you can put on your CV when you apply, you should absolutely do it.",
      "author": "ndrach",
      "created": 1636312464,
      "upvotes": 2,
      "replies": {}
    },
    "hjpupyl": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpupyl/",
      "text": "Grad school won't care, especially since you're doing work that can demonstrate to them you'd be a great addition to their research team!",
      "author": "orangeroses_",
      "created": 1636316690,
      "upvotes": 2,
      "replies": {}
    },
    "hjod7kl": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjod7kl/",
      "text": "Absolutely not.",
      "author": "itsjusttooswaggy",
      "created": 1636295372,
      "upvotes": 1,
      "replies": {}
    },
    "hjodtkh": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjodtkh/",
      "text": "Not at all! I took 2 years off and go to the number 1 school in my field and it wasn’t a problem at all",
      "author": "honeybee333-",
      "created": 1636295643,
      "upvotes": 1,
      "replies": {}
    },
    "hjofvwj": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjofvwj/",
      "text": "Not at all. I had a seven year gap between undergrad and grad school.",
      "author": "lilibet89",
      "created": 1636296527,
      "upvotes": 1,
      "replies": {}
    },
    "hjojcd7": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjojcd7/",
      "text": "Almost everyone in my department took at least a year off. You’re fine!",
      "author": "snake-juice",
      "created": 1636298007,
      "upvotes": 1,
      "replies": {}
    },
    "hjolpgh": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjolpgh/",
      "text": "Go ahead and do it, I wish I had.",
      "author": "DikkDowg",
      "created": 1636298983,
      "upvotes": 1,
      "replies": {}
    },
    "hjoo64q": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoo64q/",
      "text": "I took my gap years between 2014 and 2019. I would advise you take your time and decide when you want to go.",
      "author": "gabe89san",
      "created": 1636299978,
      "upvotes": 1,
      "replies": {}
    },
    "hjoprip": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoprip/",
      "text": "A lot of physics people do this, I wouldn’t worry about it",
      "author": "medusawakened5",
      "created": 1636300605,
      "upvotes": 1,
      "replies": {}
    },
    "hjoqwtf": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoqwtf/",
      "text": "Yes, people take decades \"off\" before going to grad school. One year is fine.",
      "author": "givemeyourdonut",
      "created": 1636301059,
      "upvotes": 1,
      "replies": {}
    },
    "hjorb8c": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjorb8c/",
      "text": "I did and it was one of the better desisions I made. Chemical and Electrical undergrad, Nuclear for ms and phd. I started following the various societies and worked under contracts with NASA, Argonne labs, Los Alamos and INL and wrote public policy in washington.",
      "author": "zdpastaman",
      "created": 1636301219,
      "upvotes": 1,
      "replies": {}
    },
    "hjotbcb": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjotbcb/",
      "text": "Highly recommend a gap year!",
      "author": "string_bean_dipz",
      "created": 1636302019,
      "upvotes": 1,
      "replies": {}
    },
    "hjougnl": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjougnl/",
      "text": "I took 6 months off between Bachelors and Masters. I don't regret that decision.",
      "author": "MakingPie",
      "created": 1636302483,
      "upvotes": 1,
      "replies": {}
    },
    "hjox5rd": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjox5rd/",
      "text": "No. Most profs I've met and talked about this with prefer it.",
      "author": "jtth",
      "created": 1636303547,
      "upvotes": 1,
      "replies": {}
    },
    "hjoz3q0": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjoz3q0/",
      "text": "I took a gap due to the pandemic and had no trouble applying to grad school! I was honestly so glad that I did so; the year of working gave me a much-needed break from the academic mindset that I didn't even know I needed. Most of the people in my current program did the same and have taken at least one, if not up to ten years off since undergrad! Of the 15 of us only 1 is fresh out of undergrad.",
      "author": "Calligraphee",
      "created": 1636304308,
      "upvotes": 1,
      "replies": {}
    },
    "hjozm46": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjozm46/",
      "text": "No. If anything, I recommend it.",
      "author": "elidan5",
      "created": 1636304512,
      "upvotes": 1,
      "replies": {}
    },
    "hjozp2b": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjozp2b/",
      "text": "Not bad at all!  There is people in my cohort who took some time before going (back) to school. (I’m chem grad student)\n\nIf you know you want to take only a year then go back look for a job with a 1 year contract so you know after a year it’s back to school.  I’d say the longer you spend out of school the less likely you are to go back, especially when it comes to making a decent or good salary at work and then to go back to a stipend of not that much",
      "author": "Redd889",
      "created": 1636304546,
      "upvotes": 1,
      "replies": {}
    },
    "hjp4t6w": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjp4t6w/",
      "text": "It's good to experience \"real life\" before committing to another half decade of schooling. Maybe you'll like the jobs you find, maybe one will fund your Masters or PhD. I was pushed to go into grad school in undergrad but it sounded like a bad idea, I came back after living life for a while and now I'm ready for it, mostly.",
      "author": "coazervate",
      "created": 1636306570,
      "upvotes": 1,
      "replies": {}
    },
    "hjp7fb8": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjp7fb8/",
      "text": "I took a year in-between my MA and PhD for that reason, I needed a better writing sample for my applications.\n\nI also know about a half dozen other students in my program who started their PhDs in their 40s so thats, what, 20 gap years?\n\nIts not something you have to explain or apologize for, IMO.",
      "author": "BeondTheGrave",
      "created": 1636307629,
      "upvotes": 1,
      "replies": {}
    },
    "hjpcrur": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpcrur/",
      "text": "Nope. In-fact, I'd recommend that everyone takes a gap year.",
      "author": "touched-by-eris",
      "created": 1636309721,
      "upvotes": 1,
      "replies": {}
    },
    "hjpjbrg": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpjbrg/",
      "text": "I took a gap year because I wasn't ready to figure out grad school my senior year of undergrad. I don't think it's hindered me in any way. Plus, I was able to work while staying with my mom, so that helped me save some money (I recognize that's not an option for everyone, also I hated the job that I did).\n\nMany of the grad students I've met at both the school I did my MS at and now the one I'm doing my PhD at also did one or more gap years (mostly between undergrad and grad, but some between an MS and a PhD). It doesn't seem to have set them back any either, compared to our fellow students who didn't take a gap year.",
      "author": "DistractedChiroptera",
      "created": 1636312243,
      "upvotes": 1,
      "replies": {}
    },
    "hjpvg7s": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpvg7s/",
      "text": "I took 4 years off and worked so it looked good on my resume and I was able to save up money to pay for grad studies + accommodation. Oh, I know most grad programs pay researchers, but mine does not. That's why it was a concern.",
      "author": "VivamusUtCarpeDiem",
      "created": 1636316975,
      "upvotes": 1,
      "replies": {}
    },
    "hjpx25c": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjpx25c/",
      "text": "I finished my undergrad in 2016, didn’t go to grad school until 2019. A ton of my classmates started the same program as me after 10-15 years after finishing their undergrad. No one will think you’re slacking so long as your resume / cover letter / statement of purpose reflect your intentions and credentials.",
      "author": "lightasapetal",
      "created": 1636317602,
      "upvotes": 1,
      "replies": {}
    },
    "hjq6rpt": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjq6rpt/",
      "text": "Nope. If you are American and did the typical 4 year undergrad out of high school, you'll find that many graduate students in your cohort might be older than you. For example, many of my peers were in their late 20's, early 30s when I started.",
      "author": "kudles",
      "created": 1636321459,
      "upvotes": 1,
      "replies": {}
    },
    "hjq7jc8": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjq7jc8/",
      "text": "nope, better yet, take several years off",
      "author": "isaac-get-the-golem",
      "created": 1636321776,
      "upvotes": 1,
      "replies": {}
    },
    "hjqcmj1": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjqcmj1/",
      "text": "I’m a physics major that took a year off before grad school and got into an Ivy League school. They don’t care about your year off.\n\nBut your reasoning is off. Try your luck this year! If you don’t get in, try again the next",
      "author": "orad",
      "created": 1636323907,
      "upvotes": 1,
      "replies": {}
    },
    "hjqh82s": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjqh82s/",
      "text": "No! I personally didn’t take a break because I had a feeling I wouldn’t go back, but it’s awesome that you have your projects!",
      "author": "kray01",
      "created": 1636325884,
      "upvotes": 1,
      "replies": {}
    },
    "hjqul8p": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjqul8p/",
      "text": "Take the year off! Apply now and defer. Then your year off is really off and not worrying about applications.",
      "author": "mchem3",
      "created": 1636331807,
      "upvotes": 1,
      "replies": {}
    },
    "hjqyh9v": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjqyh9v/",
      "text": "I took almost 6 years and gained so much experience that has been incredibly helpful - you’ll do great!",
      "author": "Waddles01",
      "created": 1636333646,
      "upvotes": 1,
      "replies": {}
    },
    "hjra01v": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjra01v/",
      "text": "I did this! Best decision ever. But I did it for social/emotional reasons, like I wanted a break before committing to grad school. If there’s also academic incentive, like you think you’ll have a better shot of getting in, I say totally go for it. You’ll feel way more secure once you arrive also! I think grad school would have whooped my ass if I came right after undergrad (even more than it already is lol)",
      "author": "quarantears",
      "created": 1636339081,
      "upvotes": 1,
      "replies": {}
    },
    "hjrunex": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjrunex/",
      "text": "I jumped right into grad school after undergrad, and I think there are pros and cons to be completely honest. I was in a rigorous undergraduate program, and although this graduate program could never top that despite the accelerated process, it’s still a lot and there wasn’t a huge break before starting up again. With that being said,  I don’t think it would have been easy for me to get back into “school mode” after a year off. Or years. I don’t even take a class every session depending on what’s going on in my personal or work life, and sometimes just that 7 week break throws me off. To me work life and school life are totally different, and once my brain gets used to the life without any school, it’s hard to revert back. Just my take on it! Everyone is different.",
      "author": "pr1298",
      "created": 1636350600,
      "upvotes": 1,
      "replies": {}
    },
    "hjrvl5h": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjrvl5h/",
      "text": "I took three years off in between undergrad and grad school. I don’t feel like it hurt my chances and has honestly made a huge difference for me personally as a student.  I recommend it.",
      "author": "copper_kettles",
      "created": 1636351270,
      "upvotes": 1,
      "replies": {}
    },
    "hjs2mil": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjs2mil/",
      "text": "I’ve never heard of that affecting grad school acceptance. I took two years off before going to grad school in geology. The only issue you’ll have is that one or two year taste of freedom, and then it’s hard to get back into the swing of things. It took me most of the fall semester after undergrad to be able to watch a whole day of college football without guilt pangs that I should be doing schoolwork. Once I went back to school, it was difficult doing work on the weekend when I knew what it was like to not have responsibilities like that.",
      "author": "StinkApprentice",
      "created": 1636356615,
      "upvotes": 1,
      "replies": {}
    },
    "hjs5jzn": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjs5jzn/",
      "text": "Take the gap. I didn’t and wish I did. The academic burnout is real.",
      "author": "Stressydepressy1998",
      "created": 1636359096,
      "upvotes": 1,
      "replies": {}
    },
    "hjsodz1": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjsodz1/",
      "text": "It's not a bad idea to take a break from anything, including school. That said, you must not slacken and fall into the trap of procrastination. Stay focused.",
      "author": "ace-myhomework",
      "created": 1636374629,
      "upvotes": 1,
      "replies": {}
    },
    "hjujf43": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjujf43/",
      "text": "Take the gap! Give yourself that break and time to figure out what you want to do and find work, etc. I worked for 5 years between undergraduate and grad school. I did a certificate in between but it was low key. The gap helped me a lot to get an idea of what I wanted to do and talk to different professors/programs. I’m still in my masters program and trying to finish my thesis, thanks to COVID and some mental health stuff, it’s taking me longer (it’s nothing to do with my advisor or program, a lot of it is me).",
      "author": "kiwiwater7",
      "created": 1636403654,
      "upvotes": 1,
      "replies": {}
    },
    "hjuquwv": {
      "link": "/r/GradSchool/comments/qoo6w3/is_it_bad_to_take_a_gap_year_before_graduate/hjuquwv/",
      "text": "No, why. This idea is quite OK. You can spend your gap year doing some research, for example. You can also read professional literature or learn some new things during this period. Your extracurricular activities will increase your chances of being admitted. Recently I came across reflections about a gap year for high school graduates (I leave it [here](https://ivypanda.com/essays/is-a-gap-year-necessary-for-high-school-graduates/)) - I think it works for grad school too. It's getting to be a trend in the US. Maybe, you'll find a little bit of inspiration there.",
      "author": "James_Korbyn",
      "created": 1636406617,
      "upvotes": 1,
      "replies": {}
    }
  }
}