{"sid": "psh9xn", "link": "/r/GradSchool/comments/psh9xn/what_are_some_possible_universities_in_the_us/", "title:": "What are some possible universities in the US that I can aim for with my profile? Please suggest.", "text": "Relevant Work Experience: 7 years\nCGPA: 7.4\nGRE: 318(Q: 161, V: 157)\nTOEFL: 106\nResearch: 2 projects(1 of them in association with ISRO)\nPaper: 1 (National level, related to ML, NLP)\nIndustry: 10+ proprietary projects(Web, middleware development mostly) and a few independent projects(games, integrations, etc.)\n\nI'm from India and planning for a MS in CS(general or specializing in AI), fall '22.", "author": "sheldonhemsworth", "created": 1632225627, "retrieved": 1632952161, "over_18": false, "upvotes": 0, "upvote_ratio": 0.33, "comments": {"hdt9191": {"link": "/r/GradSchool/comments/psh9xn/what_are_some_possible_universities_in_the_us/hdt9191/", "text": "So this hasn't been responded to in a while, so I'll bite.\n\nThis may sound a bit rough, but that's something you're going to have to figure out on your own.  These questions come up regularly on this subreddit and they're not very popular to answer as it's basically asking someone to do everything for you.\n\nOne method to answer your question though is:\n\n1. Aggregate a list of university programs or Professors in different programs you want to work with (aka do research into the university and professors).\n2. Look at each program's requirements (honestly, networking helps more here than those test scores.  It's just like finding a job, so treat it like that.)\n3. Read a few papers the professors you want to work with have published so you can talk with that professor and have a general idea on what they do.\n4. Reach out to them expressing interest.  Get a feel for the lab and environment if they're interested in you.\n5. Continue pruning or updating your list based on your evaluation.\n6. Reduce this down to like 5-10 institutions (realistically most people break this down to 3)\n\nYou can also google \"How to pick a grad school\" or any various topics and just read what they recommend.", "author": "HalfEatenPie", "created": 1632288482, "upvotes": 2}}}