{"sid": "idjaja", "link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/", "title:": "Does anyone else feel nervous whenever they meet with their advisor?", "text": "Grad school just started for me and I have a meeting with my advisor tomorrow. I'm feeling really nervous to be honest. Did any of you feel the same when you first started out? Do you have any advice? I wonder if this might be imposter syndrome.", "author": "boneless_wings", "created": 1597958812, "retrieved": 1632954483, "over_18": false, "upvotes": 277, "upvote_ratio": 0.98, "comments": {"g2dus7r": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2dus7r/", "text": "When I first met with my advisor she asked me \"how are you feeling?\" and I said \"pretty terrified and nervous\"\n\nIt broke the ice, we both had a good laugh, but it also set up our future meetings of \"hey, we need to handle this\" or \"how are you feeling? still nervous?\" and I'd say \"a bit less, yeah,\" and we'd have a good laugh. She was really awesome to work with, plus I took a ton of notes when I had my meetings with her and that, I think, showed her I was prepared and organizing myself properly which also helped.", "author": "TheMightyWoofer", "created": 1598056466, "upvotes": 2}, "g2d6dy7": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2d6dy7/", "text": "I used to but I meet with him at least once everyday for small meetings just talking about what I’m doing and seeing if I need any help in my work. So now I’m just kind of used to it haha", "author": "beckygeckyyyy", "created": 1598043159, "upvotes": 1}, "g2ch6mu": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2ch6mu/", "text": "I have a PhD. I worked with my advisor for 6 years. We had a call last week and I had notes prepared and was still nervous. I respect her a ton and never want to disappoint her. As long as your nerves aren’t unhealthy, I think they can be useful. When I’m anxious I prepare better.", "author": "crimbuscarol", "created": 1598030945, "upvotes": 1}, "g2ceatq": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2ceatq/", "text": "I mostly rather get tortured than have a talk with my advisor. Trust me you are not alone", "author": "pascguerr", "created": 1598029662, "upvotes": 2}, "g2bpd19": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2bpd19/", "text": "Depends entirely on the advisor.\n\nSome advisors are absolute terrors.  Other advisors are superfriends with their advisees.  I have a completely friendly and professional relationship with mine, and I view him as a hands-off boss.", "author": "bitparity", "created": 1598017857, "upvotes": 1}, "g2bo7b6": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2bo7b6/", "text": "Yeah, every Monday. No advice here; take a deep breath and get it done.", "author": "soundstragic", "created": 1598017182, "upvotes": 1}, "g2bkt4d": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2bkt4d/", "text": "So glad I'm not the only one!", "author": "toubouc", "created": 1598015091, "upvotes": 1}, "g2bhgsq": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2bhgsq/", "text": "yup! in the beginning I felt this way for no reason other than I didn't want to look stupid in front of him but then we started having weekly meetings so I eventually just sort of got over it", "author": "mathingDayandNight", "created": 1598012815, "upvotes": 1}, "g2bgpu3": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2bgpu3/", "text": "I just had my first meeting with my adviser on Wednesday and I was super nervous lol. Especially since I am a bit socially awkward *and* have no idea what I'm doing at grad school. Before the meeting, I read some papers on my field and stuff that's relevant to my vague research interests so that I could have at least something to say I've done. I had some questions to ask her about the papers, and I also asked her if there was anything she suggested I read or recommendations for study areas I should look at. My major is Hydrology for reference and I'm a masters student, so I need to come up with a thesis ASAP. Depending on your major and if youre a MS/PhD, maybe you could do the same? Let me know how the meeting goes!", "author": "boxdkittens", "created": 1598012267, "upvotes": 1}, "g2bg8vl": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2bg8vl/", "text": "Yes! Especially when you’re just starting and getting to know them. It’s the start of a (hopefully good) relationship.", "author": "apescapes", "created": 1598011911, "upvotes": 1}, "g2bf3ay": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2bf3ay/", "text": "Try not to worry too much! Your advisor is going to be your colleague (and likely your mentor) for the next few years so it might help to humanize them in your mind a bit. They may be brilliant, but they still had to start somewhere so they know what you are going through.\n\nI also find it helpful when meeting new colleagues to ask how they'd like to be addressed (Prof. X or first name) and confirming that you are saying their name correctly if it's not in your native language. Starts you off on the right foot.", "author": "criticalmaterial", "created": 1598011001, "upvotes": 2}, "g2b4q6p": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2b4q6p/", "text": "My supervisors are amazing and incredibly supportive, so easy to talk to... and every single time without fail before meetings, I'm hella anxious. For me, it's definitely imposter syndrome - I'm always subconsciously worried they're going to turn around and tell me they've finally realised my work is crap and I'm off the programme. However this has gotten a lot better simply due to time and probably the fact my supervisors have clocked on I'm lacking confidence so they tend to emphasise and reiterate positive feedback. I think some nerves are consequently normal but if you have good supervisors then those subside. One thing I've done to directly help myself with anxiousness due to imposter syndrome is to prepare little lists of all the work I've done, interesting findings from literature, etc. Seeing my research on paper helps solidify in my mind that I do belong and I always feel prepared going into meetings which takes the edge off!", "author": "bethcano", "created": 1598000800, "upvotes": 3}, "g2b1w9x": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2b1w9x/", "text": "Oh my, I was just thinking this today...", "author": "eindigo", "created": 1597997745, "upvotes": 1}, "g2atsra": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2atsra/", "text": "My advisor not so much most of the time but my committee when i have to meet with them i struggle.", "author": "Pagi101", "created": 1597989856, "upvotes": 2}, "g2aq6nx": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2aq6nx/", "text": "At first, yeah. But now I talk to my advisor 5 or 6 times a day. So it's just become an everyday, ordinary thing at this point.", "author": "NintendoNoNo", "created": 1597986899, "upvotes": 2}, "g2aq467": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2aq467/", "text": "My coping mechanism is to try and make my advisor nervous instead by vigorously flexing my pectoral muscles and grunting.", "author": "Durendal_et_Joyeuse", "created": 1597986847, "upvotes": 76}, "g2alctk": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2alctk/", "text": "A bit nervous, because I don't want to look like an idiot or do anything embarrassing. In fact I still don't know if they prefer going by \"Prof. Lastname\" or \"Firstname\".  \n\nBut in the end, I just talk to them like a peer, but more formally and without swearing. It will be fine. ;)", "author": null, "created": 1597983448, "upvotes": 3}, "g2ai97b": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2ai97b/", "text": "I remember those days! Ohh yeah, my program direct was a complete dick, former Marine, USC Ph.D, had only contempt for his students. When you deal with these people, just remember, academia has some of the most bloated egos known to humankind. So no, you're not imagining things.", "author": "MAJORMETAL84", "created": 1597981472, "upvotes": 5}, "g2adx7n": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2adx7n/", "text": "For me it got bad. I would take propranolol for public speaking, but then there came I point I would take it just to meet with my advisor. Little things would set me off, like and email from them or those \"....\" Symbols on slack (meaning they are typing a message to me). It got to the point where I would be stressed out if my advisor was near me.", "author": "ozzalot", "created": 1597978897, "upvotes": 6}, "g2aduws": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2aduws/", "text": "I’m a very anxious person and my lab has weekly meetings with my advisors. For weeks I didn’t sleep the night before these meetings. I never imagined feeling differently but it went away after a month or two. Sometimes I still get a little nervous but it does get better! And I’m shocked to say that lol. Just remember they are there to support and help you not tear you down. Try to remember that they are on your side and rooting for your success!", "author": "StinkbugShepherd", "created": 1597978860, "upvotes": 4}, "g2a7sik": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g2a7sik/", "text": "Yes because I feel like I should be working or presenting something more.", "author": "CaffeinatedThighs", "created": 1597975518, "upvotes": 6}, "g29yqz5": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g29yqz5/", "text": "I'll be honest, I've been working with the same supervisor for 3+ years, and every time I converse with her I'm still nervous. She's been nothing but kind and supportive to me, but somehow the nerves always hit.\n\nI think it's a normal part of grad school life - some people are better about it, some are worse. Imposter syndrome is normal. I think it's just important, every time you're nervous with them and start to question why that is, try to think whether your supervisor has ever given you an actual reason to be nervous, or whether this is all coming from you. Differentiating the two normally helps me calm down, since 95% of the time (for me anyways) I'm just making myself nervous for no reason.", "author": "GrayGhostReborn", "created": 1597970598, "upvotes": 117}, "g29ugsa": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g29ugsa/", "text": "Yes, absolutely!! I think it’s totally normal to feel nervous meeting with your advisor, I think it also shows that you care. I had a tough advisor, and many of our meetings were not rainbows and unicorns - ha! But it does get better. In fact, I took my ability to meet with my advisor without being too nervous and feel confident in doing so as a huge milestone in my graduate career. Totally normal, and you will grow from the experience. Best of luck!", "author": "Team_Cap", "created": 1597968231, "upvotes": 10}, "g29l8og": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g29l8og/", "text": "I’m starting my third year and I’m still terrified to meet with my PI. Whether it’s lab meetings or a “one on one” (which we both have weekly), I don’t sleep the night before. Hopefully the nerves will go away eventually! (For both of us!)", "author": "BiologyPhDHopeful", "created": 1597963211, "upvotes": 4}, "g29hwkd": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g29hwkd/", "text": "I'm finishing up my second year and I still feel nervous, but I've noticed I've gotten better at it over time. I think identitying expectations and explaining what you've worked on and what future experiments and research you intend to conduct.", "author": "Sancheneering", "created": 1597961530, "upvotes": 9}, "g29e8i2": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g29e8i2/", "text": "Probably just nerves. They took you on so they want you there. It would almost be weird if you weren’t nervous meeting your adviser when you’re just starting out.", "author": "ImJustAverage", "created": 1597959757, "upvotes": 18}, "g29e50y": {"link": "/r/GradSchool/comments/idjaja/does_anyone_else_feel_nervous_whenever_they_meet/g29e50y/", "text": "It's normal to feel nervous I think! \n\nI'm from the Sciences and I honestly cannot work properly in the laboratory whenever my adviser is observing (I keep making stupid mistakes!). It may sound cliché but communication is the key. I told him that I cannot work while he is observing and ask if I can work remotely/on my own pace, then just give end-of-the-week report (PPT file but emailed or whatever works). I update him mostly on email regarding data and flow, then just meet him when I hit a big roadblock/dead end. I always remind myself that knowing to show-up is one step closer to solving the problem. I recognize that my boss is a problem solver/focuses a lot on solving the negative things than giving compliments, which is helpful because my expectations are set too. In case he doesn't give compliments, it's not that I am not doing things correctly. Try to find out how your adviser works around people/former gradstudents and adjust your expectations. Communication is a two-way thing. Professors are busy/probably overworked with the online work, so you have to also adjust.", "author": "attentionspanmissing", "created": 1597959710, "upvotes": 26}}}