{
  "sid": "q7gat4",
  "link": "/r/GradSchool/comments/q7gat4/how_to_explain_my_time_in_grad_school/",
  "title:": "How to explain my time in grad school?",
  "text": "I joined my graduate program in 2020 as a PhD student, but given issues with both my advisors and the project, I wanted to look into leaving with a masters. I am at the point where I have discussed my options with my department head: 1) try to work out a masters with my current advisor, 2) join a new lab/project and hope for an \"accelerated\" masters, or 3) quit.  Given my experience so far, I am leaning towards quitting. I don't think I could mentally handle starting over. \n\nWith this information, how would you explain the last 15 months in a job interview? Would you even list this time in grad school on a resume? I considered treating it like a \"postbac\" program - taking classes and working in lab but not earning a degree.  Any advice is greatly appreciated.",
  "author": "_mockingjay_",
  "created": 1634146563,
  "updated": 1634167881,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgic5i6": {
      "link": "/r/GradSchool/comments/q7gat4/how_to_explain_my_time_in_grad_school/hgic5i6/",
      "text": "I would honestly suggest giving a restart a try. You got to grad school for a reason, and the advisor (especially a good one) makes a world of difference\n\nDefinitely don’t lie about what it was. Honestly, think the truth is always the best with these stickier situations. You had an advisor that was difficult to work with, and your project turned into a sunk cost. You did learn skills (list them) and interpersonal relationships in research (you’ll be asked about them). That’s valuable on a resume and CV.\n\nEdit: this is coming from a guy that switched labs and programs completely 2.5 years into his program, and is happier as a 3rd/6th year grad student now",
      "author": "rolltank_gm",
      "created": 1634147000,
      "upvotes": 5,
      "replies": {
        "hgiijrs": {
          "link": "/r/GradSchool/comments/q7gat4/how_to_explain_my_time_in_grad_school/hgiijrs/",
          "text": "Agree with this. I switched advisors and it made a huge difference. I was going to just get my masters and peace out, but I ended up getting my PhD because my new advisor was so great. I essentially had to start all over in a different sub field and learn all new literature and methods. But it was worth it. Just consider it. \n\nIf you do really want to quit, there is also no harm in that and for many people it’s the best thing to do. I’d be honest about your time in grad school and just say it wasn’t for you. It’s not for everyone and I think most reasonable people realize that. Also think if there are any experiences or skills you gained during that time that you can capitalize on - it might actually help with finding a job.",
          "author": "tiredstrudel",
          "created": 1634149549,
          "upvotes": 3,
          "replies": {}
        },
        "hgiukkt": {
          "link": "/r/GradSchool/comments/q7gat4/how_to_explain_my_time_in_grad_school/hgiukkt/",
          "text": "Thank you for your honest response! As for starting over, I'm at a difficult crossroads. I'm not even interested in pursuing a career in my subject, but I'm looking at the sunk cost. If I were to give grad school another go (which I would like to), I  would choose a completely different subject/field. I'm also having trouble convincing my family to live and let die.",
          "author": "_mockingjay_",
          "created": 1634154397,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}