{"sid": "pp4atz", "link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/", "title:": "Should I inform my professors about a death in the family even if I'm not looking for concessions?", "text": "My grandpa passed away fairly suddenly at the end of August right before I started grad school. The funeral happened during the first week of school. I'm (so far) managing to get through all the work but have been experiencing bouts of nausea, which I think are related to the grief/anxiety/stress of burying my grandpa and starting grad school concurrently. Is it worth letting my professors know, even if I'm not looking for academic concessions? Since I'm not actually asking for anything, it feels weird? I don't want to give the perception to the professors that I'm looking for pity, if that makes sense.\n\nThanks in advance for the advice.", "author": "intelligentsiastic", "created": 1631758417, "retrieved": 1632952553, "over_18": false, "upvotes": 27, "upvote_ratio": 0.95, "comments": {"hd4u3zk": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd4u3zk/", "text": "Yes you should. When my mom passed away I didn't take time off from my normal life. I wanted the distraction of work, travel, friends, doctor appts. If you want to dive into your homework or study for your test as your distraction you should inform your prof. You might have a big wave of grief on a test day and you want your prof to know that in advance.", "author": "wutsmypasswords", "created": 1631829777, "upvotes": 1}, "hd25j2a": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd25j2a/", "text": "My condolences, OP. My uncle died suddenly last September and I'm not a very outwardly emotional person. I didn't tell anyone other than the admin that manages the TAs to let me take a sick day to attend the funeral. I honestly should have. It would've helped me greatly if I knew that I could ask them for help while I struggled through their class while still grieving and processing. I was also a TA who had multiple students notify me of deaths in their family.  What I tried is to allow them to go through the class at what they could do, and give as much time as possible for them to complete assignments. Having to bury a loved one and attend coursework is very stressful, and it negatively affects your health and may reflect on your grades.\n\nIf the nausea and stress gets too much for you to handle your classes, please let your professors know. They know their class and can better assist you while you process your grief and stress.", "author": "datdestructor", "created": 1631785157, "upvotes": 3}, "hd1sjpo": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd1sjpo/", "text": "Let them know. Grief is a weird thing and comes when you least expect it. You may be \"ok\" now, but may unexpectedly need time off or just an extra day to hand in that paper or you may need nothing at all. I used to sit on a committee where students with academic issues were reviewed. I would say 90% of the time, the academic issue was due to some external \"life issue\" and not that the student just didn't \"get\" the material. The committee usually wanted to know if the student had reached out for help prior to it escalating to the committee. I was a non-voting member, but I always wanted students to know that there were resources available to them (ie. therapy, grief counseling, leave of absence, etc.) even if they didn't feel like they needed it in that exact moment. \n\nI'm so sorry for your loss. I hope you allow yourself the time and space to grieve your grandpa.", "author": "yerrrrr10", "created": 1631773431, "upvotes": 5}, "hd1jwc5": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd1jwc5/", "text": "I think it depends. If your classes are large (>25) or if your professors are not the friendliest, probably not. Otherwise, maybe. Consider what you're hoping to gain by telling them. Kind words of sympathy? An understanding that you're usually more upbeat?", "author": "eleveneels", "created": 1631767387, "upvotes": 2}, "hd1fmem": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd1fmem/", "text": "It's up to you. I'm not being an ass, but I don't need to know. Honestly, I'm emotionally overwhelmed these days with students losing family to COVID.", "author": "fwafwa", "created": 1631764797, "upvotes": -4}, "hd1denx": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd1denx/", "text": "Sorry for your loss; you should let them know because you don't know if this event will affect you down the line.", "author": "ning7", "created": 1631763553, "upvotes": 3}, "hd1ce1p": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd1ce1p/", "text": "Even if you think you won't need concessions or anything right now, you don't know for sure what will happen in the near future.", "author": null, "created": 1631762998, "upvotes": 3}, "hd14onn": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd14onn/", "text": "It's up to you, but it probably won't hurt. Even if you aren't looking for concessions it might help you just a little bit for a professor to not go as hard on you for a couple of weeks of mental recovery. My grandfather died just before winter break ended my first year. The funeral was the day before I got on a plane to go back to school. I didn't tell anyone, but people could tell I was acting off and my work suffered for a couple of weeks. However, I was in the position of people knowing what I was capable of and how I normally acted. You're still pretty fresh in the whole process so the expectations for you aren't quite as high and you could probably get away with not telling anyone if it's really that personal.", "author": "Madmax2356", "created": 1631759080, "upvotes": 4}, "hd14bph": {"link": "/r/GradSchool/comments/pp4atz/should_i_inform_my_professors_about_a_death_in/hd14bph/", "text": "Absolutely let them know. Something is going on in your life that might make you act unlike yourself (maybe in ways you won’t even realize), so it’s helpful for your professors to know something is going on. \n\nA brief note that says you just wanted to let them know that this is going on and that it’s weighing on you would be appropriate. You can even say you’re not looking for anything in particular right now - that you intend to do your work well and on time - but that you wanted to let them know in case something more were to happen or in case they notice you acting out of sorts on occasion. \n\nI don’t think that would be out of line. \n\nBy the way, I’m sorry for your loss. I can’t imagine having to deal with something like that at a time like this. Be kind to yourself", "author": "Rizzpooch", "created": 1631758908, "upvotes": 45}}}