{
  "sid": "qeeac3",
  "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/",
  "title:": "Grad school party school?",
  "text": "I graduated from my undergrad in June with a computer science degree and have been working fully remotely as a software engineer for the past few months. I thought having a job would take up 40 hours/week of time, but realistically I spend far less time than that actually working.\n\nSo, I'm considering doing grad school of some kind while maintaining my job. Perhaps feeling a bit robbed of a few years of undergrad by the pandemic, I'd especially like it if whatever grad program I did had a strong component of partying. Does such a grad program exist?\n\nYou know *those people* from your high school who went to Arizona State, Miami FL, Miami OH, and the like. Basically, I'm curious if there's a grad equivalent of this. Maybe the answer is simply going to grad school at one of these party schools?\n\nAlso, I don't particularly care about the field/program/etc. I'm pretty comfortable with the employability that a CS degree provides, so getting a grad degree would be more for fun than for anything else.\n\nThanks folks! Curious to hear your input.",
  "author": "threevox",
  "created": 1635025572,
  "updated": 1635185372,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.27,
  "comments": {
    "hhsx95w": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhsx95w/",
      "text": "I went to Miami OH, surprised someone knows it lol. I’m in a PhD program now. Don’t go to grad school just looking to party unless you legitimately want the degree. Go to a nightclub somewhere, much less stressful.",
      "author": "meye_usernameistaken",
      "created": 1635034878,
      "upvotes": 24,
      "replies": {}
    },
    "hht765t": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hht765t/",
      "text": "Hit the clubs. You'll party more, save money, and probably have more sex (no really, it is so hard to date or maintain a fling in grad school).\n\nGrad school isn't a time to party. When I \"party\" with my grad school friends, we are doing things like making dinner and drinking wine.",
      "author": "public_health_nerd",
      "created": 1635039599,
      "upvotes": 18,
      "replies": {
        "hhtg36i": {
          "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhtg36i/",
          "text": "Very based, thanks",
          "author": "threevox",
          "created": 1635043988,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhspaao": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhspaao/",
      "text": "Grad school is harder than undergrad (at least in mine, and many people's experience) so it's hard to wrap my head around passing and partying all the time. You are out of school, just go out to a club and party if you want. Why would you need college for that?",
      "author": "puppiesandyoga31",
      "created": 1635031100,
      "upvotes": 25,
      "replies": {}
    },
    "hhsyvli": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhsyvli/",
      "text": "I went to an SEC school for grad school. There were plenty of parties around. You can go to any of them maybe other than the frat parties but, tbh, you don’t wanna go to those anyway. They are pretty outrageous.\n\nBut I think you need to understand that partying is not why you go to college or graduate school. You go to college to find a passion and you go to graduate school to sharpen marketable skills. Parties are fun but not a factor for choosing a school.\n\nI did a PhD, so I chose the school based on the department and advisors I found interesting. UGA had 3 people I was really interested in working for and that pulled the trigger. \n\nDon’t make the mistake of thinking grad school is just for fun.",
      "author": "mfs619",
      "created": 1635035620,
      "upvotes": 6,
      "replies": {
        "hhtisbh": {
          "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhtisbh/",
          "text": "This is super helpful, thanks!\n\nI very much realize that my reasoning is antithetical to the way that most people think about grad school, and indeed to the way that I thought about my undergrad.\n\nWhile I don't think grad school is in itself *just* for fun, I would consider adding it to my life if it was a fun thing (if that makes sense.) However, I also wouldn't pay a lot of money or go into debt for the sake of it, which may not be a terribly realistic option. So it might be ruled out just for that reason.\n\nOh well, I'll think it over. Thanks for the help",
          "author": "threevox",
          "created": 1635045382,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhsh23j": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhsh23j/",
      "text": "Going to grad school to party is a very silly idea, but if you insist on doing it you probably want to apply for MBA programs.",
      "author": "tpharroawdaiygm",
      "created": 1635027262,
      "upvotes": 24,
      "replies": {
        "hhsk480": {
          "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhsk480/",
          "text": "That's kind of what I was thinking",
          "author": "threevox",
          "created": 1635028679,
          "upvotes": -5,
          "replies": {}
        }
      }
    },
    "hhsfhc9": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhsfhc9/",
      "text": "You should grow out of that shit by the time you finish undergrad",
      "author": "Superduperbals",
      "created": 1635026523,
      "upvotes": 30,
      "replies": {
        "hhsgkse": {
          "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhsgkse/",
          "text": "What even is the point of getting a graduate degree if you are only there to screw around?",
          "author": "KingOfTheEigenvalues",
          "created": 1635027036,
          "upvotes": 16,
          "replies": {
            "hhsgxyy": {
              "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhsgxyy/",
              "text": "The same as the point of undergrad if you’re only there to screw around",
              "author": "threevox",
              "created": 1635027207,
              "upvotes": -3,
              "replies": {
                "hht7bd3": {
                  "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hht7bd3/",
                  "text": "Yes, I too agree it is wasteful to go to undergrad for the sole purpose of partying when just partying is cheaper.",
                  "author": "public_health_nerd",
                  "created": 1635039667,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhszanw": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhszanw/",
      "text": "I’m currently a public health grad student from a school that once held a consecutive title for the number one party school in America! Lol and yeah people in my cohort do not party as much compared to students that are undergrad but the party scene has always been alive here pandemic or not.",
      "author": "EliexElie",
      "created": 1635035810,
      "upvotes": 3,
      "replies": {}
    },
    "hhun6jf": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hhun6jf/",
      "text": "Grad school isn’t a party environment. Most people work all day then go to classes at night. Some of us will go to the bar on weekends sometimes but people don’t do the whole “party it up every weekend” thing anymore.\n\nBelieve me, you’re going to be so tired that you’re not going to want to party at the end of the week.",
      "author": "jlm2299",
      "created": 1635075531,
      "upvotes": 3,
      "replies": {}
    },
    "hht8h3d": {
      "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hht8h3d/",
      "text": "Just go to a bar like the rest of us you privileged dick",
      "author": "callednotqualified",
      "created": 1635040213,
      "upvotes": 7,
      "replies": {
        "hht9d7w": {
          "link": "/r/GradSchool/comments/qeeac3/grad_school_party_school/hht9d7w/",
          "text": "Lolololol",
          "author": "threevox",
          "created": 1635040645,
          "upvotes": -7,
          "replies": {}
        }
      }
    }
  }
}