{"sid": "lhmt7d", "link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/", "title:": "Update to It Wasn't Worth It: 2 years later", "text": "https://www.reddit.com/r/GradSchool/comments/8audav/it_wasnt_worth_it/\n\nI posted 2 years ago about my grad school experience and how, well, absolutely terrible it was. I got a lot of support on that post as well as others I made here during my time in grad school, and I wanted to post an update for y'all. Maybe it can help somebody else see the light at the end of the tunnel.\n\nRecap: I finished a PhD in computational biology after 5 years of hell and an astoundingly shitty PI who dropped off the face of the earth for my last year and half, never read my thesis, and still had the gall to show up to my defense and act like he had any part in it. My mental health was trashed and I moved back home to live with my parents because my doctors didn't feel it was safe for me to live alone. I was pretty damn miserable and regretting just about everything about my life and decisions.\n\nThat \"shitty programming job\" I mentioned in my last post has turned into a great, stable position. I've grown into the job and even though I'm still \"just\" a software engineer, I feel valued and appreciated at work. (What a refreshing change!) It's an easy job for me, but it pays pretty well and it is fulfilling to do even an easy job well. \n\nI got my mental health under control (getting care has been a struggle in the rural area where I live, but I persisted and learned to advocate for myself). I'm still on medication, probably always will be, but I've been able to dial back the doses and handle the ups and downs more resiliently. I rescued a dog which was probably honestly the biggest contributor to my mental health improving. I was able to finally move out of my parents' house and I'm actually a homeowner now myself. Just a couple miles down the road from my parents :) I could not have done any of this without their support.\n\nThe one thing I miss about grad school is teaching. I really did love to teach. I did look into teaching high school but they required me to go get another degree which is, um, NOT HAPPENING. So that is a shame. I do some tutoring for coworkers' kids on the side and really enjoy that.\n\nI'm still in contact with one person from my grad school days. He said people talk about me like I died. One professor (not my PI) called me \"the girl who got a doctorate to work at McDonald's.\" Which, honestly, fuck that guy and fuck white tower hoity-toity academia. My compatriots from grad school are all still stuck in endless post-docs, making pennies. But it's \"prestigious\" so that's ok. Academics need to wake up and realize there aren't enough jobs for all of the students they're training up, and quit straight-up shaming people for choosing a different path. Sorry. Rant over.\n\nI emailed my PI twice, once about six months after graduating, one about a year after. Just asking if he can review my papers so I could get them submitted, just in case I ever decided to try to get back on the academic path. Never heard back. Never got published. Guess that door is closed. I have gotten a couple of citations on my thesis for a pretty useful statistical result I developed, so that's rad. I'll take it.\n\nI don't know if this post will help anybody who is struggling like I was. I hope it will. I still wish I had dropped out earlier. I could have saved a lot of heartache. Like I said in the original post, I didn't need encouragement to keep going, I needed permission to drop out. I wish instead of all the fake \"rah rah rah! you can do it! you go girl!\", somebody would have actually sat me down and helped me talk through my options realistically. I shouldn't have needed that -- I should have been strong enough to see it for myself, and to give myself permission to fail in a small way so that I could succeed in a big way. But I did need that. And maybe you do too, or you know somebody who does. There is life after academia. I promise.\n\nTake care friends <3", "author": null, "created": 1613056694, "retrieved": 1632845195, "over_18": false, "upvotes": 834, "upvote_ratio": 0.99, "comments": {"grpvfdy": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/grpvfdy/", "text": "It's so great to see this update OP, good for you! I don't know if you're still checking this post anymore but if you are, do you have any advice on picking a PI when you're coming to grad school? Were there any red flags in hindsight that you wish you had seen earlier? Not to victim-blame, I know there's no way you could have anticipated ALL THIS, but if you have any advice for students who are passionate about getting a PhD and want to know how to pick a supportive advisor please let us know. Again, congrats on making it to a better place!", "author": "king_kingcharles", "created": 1616346511, "upvotes": 1}, "gnsomik": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gnsomik/", "text": "I’m in a pretty bad place in my PhD and you post give me some peace and relieve. Thank you so much for posting your shitty experience to let us know that it will all be ok at the end. I wish you all the best :)", "author": "ipodalien", "created": 1613589009, "upvotes": 2}, "gnrizo3": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gnrizo3/", "text": "Hi, I just wanted to say thank you for the update. I remember reading your original post and I’m so happy you’re doing well now.", "author": "dashoundnights", "created": 1613570266, "upvotes": 1}, "gn5ymx1": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn5ymx1/", "text": "I'm both inspired and scared as a person weighing the options of a PhD at the moment.", "author": "TheZoologist", "created": 1613206225, "upvotes": 3}, "gn2n53s": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn2n53s/", "text": "What about teaching at community colleges? They often have night/weekend courses so you can still do your full time job if you’re doing the teaching for fun/because you want to.", "author": "Decisionsota", "created": 1613147548, "upvotes": 1}, "gn2lx29": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn2lx29/", "text": "I saw my mother struggle the same way when I was 7-12. My friend just left her post doc position for being overworked and underpaid. She was doing the work of the ENTIRE lab during the pandemic. She quit, and is making bank(toxicology experiments for a pharma lab) with regular hours. My mother was not able to be present when I was a kid due to academia. It is literally so toxic. I am never getting anything more than a masters. you ain't alone. Those people hold onto prestige because it is a lifeline when you are miserable.", "author": "Euneiphreniae", "created": 1613146999, "upvotes": 3}, "gn226gr": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn226gr/", "text": "Also if you miss teaching you can always pick up an adjunct position! Your job would probably let you work around that if you wanted.", "author": "SearchAtlantis", "created": 1613137345, "upvotes": 1}, "gn21ysx": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn21ysx/", "text": "I would just like to add that I'm always a fan of leaving academia. I'm not a PhD but my spouse is - literally one person in their entire cohort stayed in academia. Spouse's academe bff (met at a nat'l conference) is a ****ing unicorn and landed a tenure track position right out of grad school. Two years in and they're very seriously considering leaving too.\n\n*There's a damn good reason for that.*", "author": "SearchAtlantis", "created": 1613137219, "upvotes": 2}, "gn1zoqq": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn1zoqq/", "text": "Man what a great post.. To be honest \"the girl who got a doctorate to work at McDonald's\" is such a bunch of crap. My supervisor told me something similar after working diligently for 2 years in the lab. Made me feel so worthless. If you really like teaching, I do have some ideas, Do message me when you can and we can talk more about the same.", "author": "jollyfolly_9", "created": 1613135838, "upvotes": 2}, "gn1u320": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn1u320/", "text": ">The one thing I miss about grad school is teaching.\n\nsame, although only teaching chem lab; I absolutely hated teaching classes/lectures", "author": "iammaxhailme", "created": 1613131809, "upvotes": 1}, "gn1pm0c": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn1pm0c/", "text": "I’m in a really similar situation. After 4 years of being abused by my supervisors I’m about to convert my degree to a masters so that I can get out. It’s heart breaking to have fought for this long but I just can’t do it anymore, and there is no end in sight. They keep telling me I don’t have enough to graduate but when I ask what else needs to be done they respond by telling me to leave. I can’t escalate because my supervisor is the vice chancellor of the university. I’ve been to the dean and he said he would help but never did. It’s incredibly disheartening to feel so powerless when all I’ve done is try my damn hardest. One of the worst things is people asking “how is your PhD going” and the shame I feel when having to say I’m converting to masters. It’s like a punch to the gut.", "author": "el1zardbeth", "created": 1613127887, "upvotes": 1}, "gn0xkfi": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn0xkfi/", "text": ">Academics need to wake up and realize there aren't enough jobs for all of the students they're training up, and quit straight-up shaming people for choosing a different path. Sorry. Rant over.\n\n\nThis 100%\n\n\n\n>I didn't need encouragement to keep going, I needed permission to drop out. I wish instead of all the fake \"rah rah rah! you can do it! you go girl!\", somebody would have actually sat me down and helped me talk through my options realistically.\n\nYeeeesssssss.  Thankfully there are groups and consultants out there to help with that too.  There's also a similar vibe when it comes to jobs/careers after school also.  Lots of regrets in the recent ask reddit thread for example.  It's a bit tougher with that because the \"permission\" can be about financial barriers and responsibilities.\n\n\nI'm working on building my path out to something I can first of all stand but also enjoy/look forward to doing.", "author": "kinetic-passion", "created": 1613104865, "upvotes": 2}, "gn0dkac": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn0dkac/", "text": "Here’s a very different perspective. I earned an MS about 30 years ago in geology.  At that time in my industry, a PhD was considered a drawback, although over the last 10-15 years it’s become, not a positive, but much more common, and generally about the same for entry level jobs.  At one point in an industry downturn, I spent a couple of years in a PhD program I chose not to finish, and I really don’t regret that.\n\nMine is a practical science.  There is an entire subset of people in academia who do seem to think that leaving academia is unfortunate—but there’s a much larger group outside academia who love their work, love the (mostly) reasonable hours, (mostly) reasonable people, and decent wages.  This is the real world, and once you get out of the very narrow POV of academia, it can be liberating and empowering to be able to contribute to the world in a useful way and be rewarded for it.\n\nI think OP is just discovering that fact.  There’s a great big world out there, and education is a great thing, but it’s meant to be used, not diddled around with for kudos from a small group of so-called experts in academe.  In many, many cases, science advances through industry, often proprietary, and the universities/acadamia are years behind, they just don’t know it.  The attitudes many of you run into become laughable out in the bigger world.  Sure, a paper is nice, but it’s completely possible to publish as an industry expert if that’s what you want to do, and it can be groundbreaking work that academia envies because of budgets and support.  \n\nEspecially in any field such as computational biology, or any kind of software/engineering research, it’s very possible to thrive and love what you do.  Academia is a stepping stone, not even remotely the be-all and end-all.  Those of us out in the real world often think of academics as totally removed from reality. Not all of them, but a large proportion. Someone’s gotta do it, but it’s a means to an end, not the end itself.\n\nSo for all of you suffering through awful, snobbish PIs and advisors, there’s a whole great world out there and it’s very different.  Industries of all kinds would love to have you, and help you be successful.  It’s not selling out, it’s doing something useful for the world.  And for those of you lucky enough to have academic mentors who actually mentor you, all the better.\n\nCongrats OP.  You’re doing great, and you have a terrific future in front of you.", "author": "mel_cache", "created": 1613094006, "upvotes": 2}, "gn06mdj": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn06mdj/", "text": "Honestly, I don’t understand what a lot of academia thinks they’re training their grads for, especially for a field like computational biology where it’s INCREDIBLY employable and useful in private industry. \n\nLike not everyone’s trying to go back to academia, damn. Staying in the ivory tower doesn’t look THAT appealing to some people.", "author": "Jeru1226", "created": 1613090379, "upvotes": 3}, "gn01zhw": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gn01zhw/", "text": "I will be dropping out of my program after this semester. I joined a department who apparently does not feel the need to make sure their students all get into labs they are interested in or want to work with, and I fell through the cracks and was denied working with any of the four PIs I came to this school to work with.\n\nI already feel better knowing I will be, at the very least, taking a year or two off from school to mentally reset in that field and to fix my mental health (which was already wrecked before starting grad school at peak covid shitshow) which has declined more than I ever thought it would this year. I know my mental is going to get even worse because I have no motivation to do well in any of my classes this semester but know that I need to at least do okay in case I ever want to come back.\n\nThank you for this. You don’t often hear from the people who dropped out and why they dropped out from the positive side of everything, you only hear from the professors and other graduate students who don’t know the full story and just talk bad about whoever they can.", "author": "Pikalover10", "created": 1613087989, "upvotes": 6}, "gmzqmu0": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmzqmu0/", "text": "I’m so glad everything’s working out. If you still want to teach you should look into community colleges or private schools, they won’t have any state mandated teaching requirements and you’ll have a lot more freedom with your curriculum.", "author": "Unofficial_Overlord", "created": 1613082506, "upvotes": 3}, "gmzey6w": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmzey6w/", "text": "Thank you for the post and I hope you're well. I have made the decision to master out of my PhD. I am not 100% sure of the future ahead, but leaving seems to be better than the position I am in now. I've had my reserves about leaving, but this post gives me some hope. Cheers!", "author": "Todofuu", "created": 1613077330, "upvotes": 2}, "gmzcyqy": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmzcyqy/", "text": "Quick comment about teaching.  I never wanted to teach, and had zero interest in being a professor.  I taught in grad school just for the funding.  But to my surprise, I ended up with a career that very much involves teaching... but not college students!  I teach CEOs.  They don't know how to connect to my field, or how to implement it into their products, and somebody's gotta teach them.  The good news is: (1) the pay is fantastic, and (2) the CEOs are insanely attentive (they know their time is valuable, and they don't waste it).\n\nMy path isn't for everyone.  I carved it myself, and not everyone is interested in that type of entrepreneurship.  But I just wanted to suggest, if you really like teaching, there's many untraditional methods to accomplish this goal!  Think creatively.  Don't limit yourself to traditional career paths.\n\nPS- And whenever anyone starts cracking jokes that I'm not doing research or I \"sold out\" to industry, I just start dropping numbers about my budgets and how much and what type of research those budgets allow us to accomplish.  At least in my field, academia is failing at its own game.", "author": "PM_me_good_Reviews", "created": 1613076477, "upvotes": 5}, "gmz9c07": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmz9c07/", "text": "You can teach through YouTube..", "author": "electropop999", "created": 1613074933, "upvotes": 2}, "gmz1e72": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmz1e72/", "text": "I’m in academia and seriously fuck these toxic mentalities. I’m glad you are free and are happy.", "author": "nanon_2", "created": 1613071570, "upvotes": 7}, "gmypn6b": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmypn6b/", "text": "Wow. It took me seven years, but I had pretty much the same experience as yours. My advisor took a sabbatical my second year and then proceeded to have a mental breakdown and completely check out of reality. I was left teaching, managing a team of undergraduates and doing research that was technologically very novel (meaning I could have used some help, unlike his previous grad students who basically incrementally tweaked his old work). \n\nEvery morning, I woke up feeling like I might as well die. I enjoyed the teaching, but I was reduced to a ball of anxiety and depression and everybody around me kept saying \"oh you're doing great, you shouldn't worry\". It was awful. I pulled through and finished with zero support and got a job in tech that pays more than any of the TT faculty who are starting now. It is a million times less stressful and I get to work at a human pace on projects that use my expertise, though not my entire skillset.  In my department not a single person congratulated me on my job (which I started a few months before defending.). Everyone made a pity face and said \"what a shame, you'd be such a great professor\".  Just like you, they talk about me as if I'm dead.\n\nI am SO resentful but I'm six months out (though I did take on some extra teaching, so I'm not completely out) and finally returning back to my old self. The stress, negativity and catastrophisizing were not part of my personality, but responses to a protracted negative experience that took up my entire life. We tell people to go to therapy when they get depressed in grad school, but we should send grad programs and advisors to workshops on how to not destroy people and their minds.", "author": "chupagatos", "created": 1613066654, "upvotes": 16}, "gmyoxf1": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyoxf1/", "text": "I’m so happy for you OP! It sounds like you have a bunch of great things going for you right now: a new happy place to live, a lovable furry friend, a good relationship with your parents, and income during a pandemic. That is more than many people right now, and those professors seem small minded to think academics are the be all and end all after receiving a degree. Some people literally just go back to school for personal development. I often wonder if my degree was ‘worth it’ and it probably wasn’t financially and job-market-wise either but it meant a lot to me personally to compete such a big goal of mine and can only open more doors down the road I think. I hope your able to find a teaching outlet if you want! Thanks for updating the sub!", "author": "ck-dearie", "created": 1613066360, "upvotes": 3}, "gmyo9k1": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyo9k1/", "text": "> Like I said in the original post, I didn't need encouragement to keep going, I needed permission to drop out. I wish instead of all the fake \"rah rah rah! you can do it! you go girl!\", somebody would have actually sat me down and helped me talk through my options realistically. I shouldn't have needed that -- I should have been strong enough to see it for myself, and to give myself permission to fail in a small way so that I could succeed in a big way. But I did need that. \n\n\nMy 2 cents as a non-American PhD student. I hate this uniquely American approach to life, like the ending of the famous Eminem song \"You can do anything you set your mind to, man\". No sometimes, you need to change your mind rather than hustling to do what's in there. Thank you for sharing this, stranger. I hope life treats you better after all of this.", "author": "SultaniYegah", "created": 1613066091, "upvotes": 22}, "gmyl8lm": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyl8lm/", "text": "Amazing update! I'm glad it's over and that you're doing better. Most of all, it seems like you got a steady gig so keep it up OP!", "author": "theP0M3GRANAT3", "created": 1613064854, "upvotes": 3}, "gmyihy5": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyihy5/", "text": "I’m pretty glad I noticed this myself after starting   my masters program. Did job hunting and got myself a job so I could start working post graduation. Post grad penniless was not an option for me. You can’t survive on scholarship either.\n\nI’m not sorry that I went for masters though. The experience wasn’t entirely fun, but it really helped me to think right. Learned sth from the process of “attempting” research.\n\nBut I feel you. Maintaining a good relationship with your advisor is rly rly important. I’d say finding a good advisor who is passionate about helping students is key to surviving grad school. Though, I guess the same applies to the world outside of academia as well.", "author": "knoxyal", "created": 1613063722, "upvotes": 6}, "gmyhjpd": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyhjpd/", "text": "This is a powerful, powerful post. I'm so happy to hear you're doing much better these days. Congratulations on your immense perspective and strength, your wellness, those citations and that job, and your undoubtedly beautiful and sweet pup :)", "author": "letsrollwithit", "created": 1613063326, "upvotes": 6}, "gmygwyq": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmygwyq/", "text": "I'm glad you got the care you needed. I'm surprised that the high school wanted you to get another degree and not just take a few education classes. Many states offer an alternative certification process.", "author": "xanxer", "created": 1613063062, "upvotes": 8}, "gmyfxsr": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyfxsr/", "text": "Have you thought about adjuncting a course or two at a community college or university? It doesn’t pay too well, but you could do it in addition to your current job to get your teaching fixi", "author": "NeuroscienceNerd", "created": 1613062660, "upvotes": 29}, "gmydj0m": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmydj0m/", "text": "Thanks for sharing so openly and congratulations on everything you've achieved!\n\nYou are a success in so many ways: from doing well at an awesome job, to getting paid much closer to what you're worth than in academia, to improving your mental health. And all in spite of your terrible PI. Great example for the rest of us : )", "author": "0102030405", "created": 1613061667, "upvotes": 10}, "gmydf7r": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmydf7r/", "text": "Really proud of you internet stranger. \n\nThe more I see how it goes, the more I question myself about an academic future. We'll see where this leads to, I'm not closing the door. \n\nBut, I feel there is a lot of dishonesty from the PIs. Like when you get an \"Excellent work\" mention during a course, but then later on you are faced with a totally different (and much higher) criteria for something similar... Like they treat us like kids, and we get the more and more deceived, because the more and more we progress, the more and more the goalpost moves. This could probably qualify as mental abuse... and I value myself enough to not play that game. \n\nAgain, you seem healthy, and thanks a lot for sharing this with us today. I wish you a lot of success as you go on !", "author": "jtmooon", "created": 1613061624, "upvotes": 32}, "gmyawtb": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyawtb/", "text": ">Just asking if he can review my papers so I could get them submitted,  just in case I ever decided to try to get back on the academic path.\n\nI don't know if this helps to read, but those papers would not have helped you anyway and any attempt to get back on the academic path would likely just land you in a few deadend post-docs, where most of your peers are now. Some published papers would be nice to have of course, but you have not missed out on any opportunities by not publishing them.", "author": "CaptainCornerCamper", "created": 1613060590, "upvotes": 78}, "gmyaoxp": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmyaoxp/", "text": "Thank you! This makes me realize how lucky I am to have a supportive department and PI. But it's important for all students to be reminded that academia can act like a **cult** that doesn't want you to leave and punishes alternative world views and life paths. Your program *becomes* your life as a PhD student. The ability to sit down and clearly think through whether dropping out is the best decision for you is almost impossible with the weight of all that emotional manipulation.\n\nAnyways, the difference between this post and the one from two years ago is night and day. Congrats, OP!", "author": "peregrination_", "created": 1613060499, "upvotes": 60}, "gmy8bp1": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmy8bp1/", "text": ">One professor (not my PI) called me \"the girl who got a doctorate to work at McDonald's.\" \n\nWow. Fuck that guy.", "author": "ThePhysicistIsIn", "created": 1613059511, "upvotes": 607}, "gmy84or": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmy84or/", "text": "It is really nice to see that after a damaging PhD experience, you made it back to some stability and happiness. That gives me hope for myself", "author": "Left_turn_anxiety", "created": 1613059429, "upvotes": 80}, "gmy6ud9": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmy6ud9/", "text": "Are you sure about teachimg high school requisites? In the US generally you need a master level degree and then you can teach at a lot of places, in subjects you didnt necessarily concentrate in etc\n\nThere are also short term certifications \n\nAnd other types of teaching/classroom - teaching at alternate schools (my friend with a BA tutored at a school for drop out kids who needed individualized curriculum which could be very fun), afterschhool programs, workshops, high school computer/tech labs, private schools also have different requirwments\n\nI also know one person who was in a theory heavy grad program and rose to great heights but then she came home and chose her mental health and became a high school gym teacher / basketball coach", "author": "nvyetka", "created": 1613058872, "upvotes": 74}, "gmy6d0l": {"link": "/r/GradSchool/comments/lhmt7d/update_to_it_wasnt_worth_it_2_years_later/gmy6d0l/", "text": "Brava! Thanks for sharing your story.", "author": "santobdecarrion", "created": 1613058663, "upvotes": 14}}}