{
  "sid": "r0c2ck",
  "link": "/r/GradSchool/comments/r0c2ck/what_should_i_consider_when_deciding_on_a_thesis/",
  "title:": "What should I consider when deciding on a thesis research topic?",
  "text": "I just finished the coursework component of my MA and now moving on to write research thesis (MRes). I know the area that I like, but I am not too sure exactly what question I would like to take on for the thesis.\n\nIs there anything that I can do right now to help me come up with research questions?",
  "author": "remigiuslock",
  "created": 1637670281,
  "updated": 1637689761,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlrkkse": {
      "link": "/r/GradSchool/comments/r0c2ck/what_should_i_consider_when_deciding_on_a_thesis/hlrkkse/",
      "text": "Think about what your broader goals. Do you want to apply to PhD programs or work in a specific industry afterwards? Do you want to do independent research or mostly focus on a literature review? Is there a specific skillset you would like to learn? Do you want your advisor to be an export on your research topic? The answers to these questions should really narrow down your topic. After that you should start reading the literature to try to find what specific questions you can answer. If at this point you still have lots of potential research topics then you are either are very lucky or have not thought through the barriers you will face.",
      "author": "local_man_says",
      "created": 1637674440,
      "upvotes": 4,
      "replies": {
        "hlrlxa9": {
          "link": "/r/GradSchool/comments/r0c2ck/what_should_i_consider_when_deciding_on_a_thesis/hlrlxa9/",
          "text": "Thank you so much for this! I will have a think about these things",
          "author": "remigiuslock",
          "created": 1637675142,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlruyck": {
      "link": "/r/GradSchool/comments/r0c2ck/what_should_i_consider_when_deciding_on_a_thesis/hlruyck/",
      "text": "Read broadly to try and identify gaps in the current knowledge/literature that you might be able to fill",
      "author": "fjkfjldsls",
      "created": 1637679420,
      "upvotes": 2,
      "replies": {}
    }
  }
}