{
  "sid": "qjfold",
  "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/",
  "title:": "Forced into grad school.",
  "text": "I need advice. I’m currently a senior in undergrad majoring in criminology. I hate it. I did it because both my parents are lawyers and I was expected to be one too. I hate law. I have always wanted to do music. I blew that chance for undergrad to appease my parents.\n\nI’m graduating soon and I’m being pushed to get my masters in cybercrime and make a career in cybersecurity so I can be successful and make a lot of money. The thing is that terrifies me. I don’t like crime. I don’t want to do it forever until I’ve got one foot in the grave and the other on a banana peel. I hate it. I hate the thought of it. \n\nMy mom just called me to tell me I would make “zero dollars and zero cents” in music if I pursued it. My music minor is currently the only thing that makes me happy.\n\nDo I tough out getting a degree in cybercrime to appease my family? I touched out undergrad and survived but I’m not a very happy person, I’ll admit. I cry a lot. Almost offed myself. I’m lost.",
  "author": "SpicyMayoPacket",
  "created": 1635645443,
  "updated": 1636201563,
  "over_18": false,
  "upvotes": 182,
  "upvote_ratio": 0.93,
  "comments": {
    "hipxbux": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipxbux/",
      "text": ">but I’m not a very happy person, I’ll admit. I cry a lot. Almost offed myself. I’m lost.\n\nCall your university counseling services. Make an appointment to see them. They can help you with how you're feeling. They can also put you in touch with people who can help you figure out the best career path for you.\n\nBut go ahead and call them. You don't need to struggle with this on your own.",
      "author": "raistlin65",
      "created": 1635647524,
      "upvotes": 300,
      "replies": {
        "hipzvgy": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipzvgy/",
          "text": "I don’t wanna bother them they’ve got people with real problems to help lol. Plus I’ve already got a therapist and a life coach and a psychiatrist and I’m still not happy so probably nobody can help me at all.",
          "author": "SpicyMayoPacket",
          "created": 1635648879,
          "upvotes": -147,
          "replies": {
            "hiq0gpb": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq0gpb/",
              "text": "As long as you have someone you can talk with.\n\n It is hard to make a living as a musician. But maybe you might consider getting an MBA and working in the music industry. That's something that might sell to your parents that allows you to connect with your passion.",
              "author": "raistlin65",
              "created": 1635649204,
              "upvotes": 72,
              "replies": {}
            },
            "hiq0q9h": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq0q9h/",
              "text": "I know this is hard to hear, but this is a real problem. It’s not like you are sad because your favorite shoes have a scuff. You cry and you have thought about being unalive. That is the most serious of serious. Talk to any of these people you already have in your life to help you.",
              "author": "artteacherthailand",
              "created": 1635649354,
              "upvotes": 136,
              "replies": {}
            },
            "hiqddfg": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqddfg/",
              "text": "Hey, your problems are real. If you feel like you’re not connecting with your therapist, I’d switch to another if you can. You really need to talk to someone. You’re in distress and you don’t deserve to be. \n\nHowever… I’ll make a bold statement here: don’t go to a grad program you don’t want to. I think you need to figure out a viable career path that involves something you enjoy. You mentioned music. Do you want to teach at a school? Give lessons? Work in the industry as a producer/manager/agent? What about entertainment law? (Throwing that one out there as a long shot because you mentioned your parents are lawyers.) I mean, I think you should really explore these options and find something that resonates with you. \n\nI know you feel really boxed in and you’re under a lot of pressure. I get it, and I’m sorry you’re dealing with it. Lean on your support system right now, that’s what they’re there for. Reach out to academic advisors or maybe even a professor whose music class you liked and discuss possible career paths. Maybe something like an MBA would help? I have no idea, I would ask the experts. But please, at least ask questions and see what pops up.",
              "author": "StringOfLights",
              "created": 1635657235,
              "upvotes": 41,
              "replies": {}
            },
            "hiroa9n": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiroa9n/",
              "text": "Almost killing yourself **is** a real problem. You need professional help that you won't get here.",
              "author": "Jonno_FTW",
              "created": 1635691319,
              "upvotes": 12,
              "replies": {}
            },
            "hiqe3dq": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqe3dq/",
              "text": "I know this sucks but if your counseling isn't helping it might benefit you to find someone else that does, but I also don't know your journey. And don't discount your own problems - they are real and they are valid and enough that you're having these thoughts.",
              "author": "signedizzlie",
              "created": 1635657755,
              "upvotes": 12,
              "replies": {}
            },
            "hishacw": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hishacw/",
              "text": "> I don’t wanna bother them \n\nYou're not bothering them, it's literally their job to help people.\n\n>they’ve got people with real problems to help lol\n\nYou have real problems.\n\n>Plus I’ve already got a therapist and a life coach and a psychiatrist and I’m still not happy so probably nobody can help me at all.\n\nThis is a bit harsh, I gotta ask, are you just going there and sitting down for an hour, or are you actively following their advice? \n\nIf you are and it isn't helping, then you need to find someone else. If you aren't, then you need to start.",
              "author": "Do_Not_Go_In_There",
              "created": 1635703924,
              "upvotes": 11,
              "replies": {}
            },
            "hisibxu": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisibxu/",
              "text": "You’re actually the *exact* person that they’re there to help! Being intensely depressed *because of your major* is 110% a reason to contact your university’s counseling services. If your parents got you that life coach, try to stop going to meetings with them. It’s going to be hard. It’s not fun. But *you do not deserve this*. *You deserve to be happy*, and you *can be happy again.*",
              "author": "kryaklysmic",
              "created": 1635704345,
              "upvotes": 7,
              "replies": {}
            },
            "hirlynk": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirlynk/",
              "text": "Someone having from your perception worse problems or experiences doesn't invalidate yours or the need for help. Reach out to your therapist about this, and evaluate whether you want to live your life for others' expectations or to actually live life.",
              "author": "jouleheretolearn",
              "created": 1635690208,
              "upvotes": 5,
              "replies": {}
            },
            "hirhr25": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirhr25/",
              "text": "I felt this way too.  You are worth it and they saw my problems as worth it.  It saved my life.",
              "author": "teacherecon",
              "created": 1635688098,
              "upvotes": 3,
              "replies": {}
            },
            "hislvq8": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hislvq8/",
              "text": "You are officially qualified by me as having “real problems” ok? You have REAL PROBLEMS that NEED ATTENTION. I was in a similar situation as you and didn’t think I needed help; I won’t try and scare you with how awful things got, but it’s likely worse than you’re thinking. Don’t ignore your issues, they count, they’re real, they’re bad enough, they REQUIRE attention.",
              "author": "Plantsandanger",
              "created": 1635705822,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hiq5505": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq5505/",
      "text": "Are they also telling you they'll help fund your masters? If so, is the funding 100% conditional on it being a particular program? Otherwise, I'm not sure what their leverage is. \n\nYou're an adult and your parents don't have the right to force you to do anything. That being said, while your mom was pretty harsh about what she said, I also think she's kinda right. Music is a great hobby but not great for employment. Money doesn't buy happiness, but it's a lot harder to be happy when you're struggling to make the rent. \n\nThe good thing is that a bachelors degree (ANY bachelors degree) is the requirement for entry for a lot of jobs. It's proof that you have a decent work ethic and can stay focused for 4 years. You will have a lot of options just by having a degree. You also don't have to figure any of this out immediately. Presumably you're around 22. You'll have 40 years of work ahead of you so there's no rush to plan everything out. That's also all the more reason to not force yourself into a cybersecurity career if you don't want it. \n\nSide note, but I'm a bit confused about what this cybercrime masters is. You said this would be so you can work in cybersecurity--my partner works in cybersecurity but his background is entirely compsci. Do they not expect a computer science background for this program? The cybersecurity I'm familiar with, in short, has nothing to do with legal systems and everything to do with pointing out shitty code. Unless we have two very different fields in mind, this has nothing to do with criminology. If your parents are going to try pressuring you into a program, they should at least know that your undergrad in criminology is not enough preparation to start grad school in this field.",
      "author": "Auditor0fReality",
      "created": 1635651846,
      "upvotes": 35,
      "replies": {
        "hir4vw8": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hir4vw8/",
          "text": "Cyber crime would be a subset of law, not a subset of compsci. Cybersecurity experts don't litigate",
          "author": "Dr_Silk",
          "created": 1635679834,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "hipwux0": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipwux0/",
      "text": "You are an adult. No one can force you into graduate school, really no one can force you to do anything. It sounds like the first thing you need to do is establish boundaries with your parents, then figure out your own path.",
      "author": "public_health_nerd",
      "created": 1635647276,
      "upvotes": 102,
      "replies": {}
    },
    "hipx5bq": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipx5bq/",
      "text": "I make $50-60/hour teaching piano on my own schedule and took a serious pay cut to go into academia. Making music won't always pay the bills, but you have a built-in backup. It can be tough, but if it makes you happy, go for it.",
      "author": "DontFeartheTeacher",
      "created": 1635647429,
      "upvotes": 76,
      "replies": {
        "hiq000r": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq000r/",
          "text": "I’m a singer and I love classical music sooo much. It makes me happy and the best part of my day is practicing or going to rehearsal and I can’t imagine just never singing again",
          "author": "SpicyMayoPacket",
          "created": 1635648948,
          "upvotes": 35,
          "replies": {
            "hircucl": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hircucl/",
              "text": "It's not one or the other though. You can have a career in whatever you want and still be able to play and sing as a hobby outside of work",
              "author": "smmstv",
              "created": 1635685310,
              "upvotes": 22,
              "replies": {}
            },
            "hiqvu09": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqvu09/",
              "text": "You can always join local choirs or teach on the side if you like. There’s no reason it can’t be a big part of your life. But you shouldn’t try to turn it into a full career. This is from someone who has a music degree",
              "author": "Unofficial_Overlord",
              "created": 1635672571,
              "upvotes": 47,
              "replies": {
                "hirfouy": {
                  "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirfouy/",
                  "text": "I started as music ed major (flute). I changed to IT.\n\nI realized I didn't actually want to teach. And while I loved \"music\" I knew I didn't have the metal either to practice enough to get good enough to sustain a career in performance or keep up the hustle of teaching privately. \n\nI found something I like doing in IT. I wear many hats, including cybersecurity (not crime specific though lol). I have a steady schedule and high salary potential.",
                  "author": "PersonBehindAScreen",
                  "created": 1635686978,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            },
            "hirzr8c": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirzr8c/",
              "text": "I was the reverse of you. My first bachelor's was in vocal performance. I spent a few years doing composition work, they went back to school for premed. Now I'm getting my PhD in chem.\n\nMusic will never go anywhere, but trying to make your living on it is stressful. I found that keeping it as a hobby and something for extra cash worked better for me. The life of a freelancer is very stressful.\n\nThat said, you should not be forced into grad school at all, especially for something you hate. That is the worst thing you could do.\n\nPersonally, I would take a gap year and take some time to figure this out.",
              "author": "BellaMentalNecrotica",
              "created": 1635696416,
              "upvotes": 14,
              "replies": {}
            },
            "hisk1av": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisk1av/",
              "text": "There are so many opportunities to be involved in community music. When I was working my first job after graduating college, I was in 3 different orchestras. My working day was a bit sad, but my life overall was full of great music!! don't lose hope!",
              "author": "garulous",
              "created": 1635705052,
              "upvotes": 4,
              "replies": {
                "hisk698": {
                  "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisk698/",
                  "text": "This makes me happy",
                  "author": "SpicyMayoPacket",
                  "created": 1635705108,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hirq1st": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirq1st/",
              "text": "There are so many jobs for singers, especially classical. Places of worship, weddings, rich people's parties, schools for music lessons, local bands. My advice would be (if you can afford it) to take a year off school after undergrad and explore music. If you hate it or find out you can't make a decent living, you can always go back for a grad degree. That way, you'll never sit at the office computer on a Tuesday afternoon wondering what could have been.",
              "author": "DontFeartheTeacher",
              "created": 1635692125,
              "upvotes": 8,
              "replies": {}
            },
            "hivm4bk": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hivm4bk/",
              "text": "Adding my voice to the others here - there are loads of part-time opportunities for singers, especially if you like/don't mind choral music. As far as I know, even the choirs that will perform with symphony orchestras are typically not full-time. Plus, there are community choirs, church choirs and worship music leaders, weddings, open mic nights, community theatre/musicals, etc. I personally know many singers and the only two who do music full-time are preschool/elementary music teachers. The rest all have day careers and sing as a hobby or side gig, and seem happy with the balance.",
              "author": "Mad_Cyclist",
              "created": 1635770703,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiq7mee": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq7mee/",
      "text": "As someone who went to law school, do not go law school if you’re not 1000% on board with going. You’ll hate it. The people who do want to be there hate it, and it’ll be so much worse if you know that you’d rather be doing other things. \n\nI know you said that none of your therapists or treatments are helping, and I would argue that’s because you’re in a situation that’s making you miserable. Absolutely keep going with your treatment plan, but changing your career path (I think) will help immensely. (I’m not a psychologist, but I have a minor in it and have had depression my entire life. I’ve been in your shoes. I know how badly it sucks, believe me.)\n\nI really hope you’re able to find some peace with your path going forward. Knowing your passion is a great first step. It takes a lot of guts to buck the trend and do your own thing, but I bet you’ll end up so much happier.",
      "author": "shannaconda",
      "created": 1635653337,
      "upvotes": 24,
      "replies": {
        "hiqfmzk": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqfmzk/",
          "text": "This is what I came here to say. I’m not in law (I’m in science), but I think it’s a pretty universal thing that if you are not 100% interested and committed to your subject in grad school, you won’t finish. You can push through the bullshit in undergrad, but it’s nearly impossible in grad school.  \n\nI agree with what you said, even people who want to be there hate it. It’s hard, it takes up all your time, and there are long stretches where you basically live and breathe your thesis. If you don’t absolutely love it, there is no way to force the motivation needed to finish it.",
          "author": "You_Stole_My_Hot_Dog",
          "created": 1635658929,
          "upvotes": 15,
          "replies": {}
        },
        "his4uha": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/his4uha/",
          "text": "Are you working as a lawyer rn? Can you share if you don't mind?",
          "author": "human1469",
          "created": 1635698613,
          "upvotes": 1,
          "replies": {
            "hitrot1": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hitrot1/",
              "text": "I’m not actually! I’m in grad school for library science, and the end goal is to be a law librarian",
              "author": "shannaconda",
              "created": 1635724812,
              "upvotes": 1,
              "replies": {
                "hiw8gxe": {
                  "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiw8gxe/",
                  "text": "Oh I see. Best of luck!",
                  "author": "human1469",
                  "created": 1635781506,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiq67vs": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq67vs/",
      "text": "As someone who decided to go to grad school because their parents pressured them, don't do it.",
      "author": "yukionna31",
      "created": 1635652486,
      "upvotes": 16,
      "replies": {}
    },
    "hipuzlx": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipuzlx/",
      "text": "You need to find a way to not starve and a way to live a meaningful life. If music gives you meaning, do music. If music doesn’t pay the bills (and it probably won’t) then use another marketable skill to do it and keep playing music to live.",
      "author": "kronosdev",
      "created": 1635646289,
      "upvotes": 44,
      "replies": {
        "hiqhocp": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqhocp/",
          "text": "Like a\n\n> masters in cybercrime and make a career in cybersecurity?",
          "author": "resorcinarene",
          "created": 1635660520,
          "upvotes": -13,
          "replies": {
            "hiqrswp": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqrswp/",
              "text": "Not if the field makes you want to off yourself.",
              "author": "kronosdev",
              "created": 1635669055,
              "upvotes": 20,
              "replies": {}
            },
            "hiquh1s": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiquh1s/",
              "text": "I would hope someone who went through grad school wouldn't encourage other people to go through grad school in a subject they absolutely hate.",
              "author": "Comrade_Corgo",
              "created": 1635671351,
              "upvotes": 9,
              "replies": {}
            },
            "hish8fv": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hish8fv/",
              "text": "I can see in your flair you went into pharmaceutical sciences. I’m sure you did it because you like it. You know what else has a lot of money? Engineering. Probably make more money than you. How about you do that instead? \n\nOh… wait no you didn’t pick that because you don’t want to. It doesn’t matter how much money you make if you hate every single second of it.",
              "author": "Natalie-cinco",
              "created": 1635703903,
              "upvotes": 1,
              "replies": {
                "hisvo2u": {
                  "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisvo2u/",
                  "text": "It's funny you mentioned engineering. I did protein engineering for my phd in pharmaceutical sciences. \n\nI also enjoy hobbies that would have made shitty careers, which is why I chose my better paying degree. I make money and I have time and resources to spend on my hobbies.\n\nAnyway what was your point again?",
                  "author": "resorcinarene",
                  "created": 1635709871,
                  "upvotes": 0,
                  "replies": {
                    "hit6s5m": {
                      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hit6s5m/",
                      "text": "You were telling someone to get a career in something that they don’t like and makes them consider therapy just because it makes money. \n\nI was saying how that can apply that to anything. Engineering makes bank, I fucking hate it. I’m not going to force myself or anyone into something that they don’t like just because of $$$. That’s terrible advice.",
                      "author": "Natalie-cinco",
                      "created": 1635714646,
                      "upvotes": 0,
                      "replies": {
                        "hit9cjv": {
                          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hit9cjv/",
                          "text": "I think maybe you need to improve your reading comprehension because that's not what I said",
                          "author": "resorcinarene",
                          "created": 1635715810,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hiq1teo": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq1teo/",
      "text": "It's true that music majors tend to pay less than other fields, but economic value is not the only value that goes into a career. Money can always be made until the day you die, but you can never regain your youth, and your mental health has a value associated with it too. People who spend their lives chasing dollars and cents often end up with lots of dollars and little sense. \n\nIf your parents wanted to raise someone just like them, they should have cloned themselves rather than have kids. At some point, they need to realize that you are an adult with your own personality, your own interests, and your own goals. If music truly is what makes you happy, then I don't think it makes sense to pursue a graduate program you know you're going to hate, that you will likely struggle in, only to apply for jobs you don't want in a field you can't stand. \n\nAt the same time, because the phrase \"starving artist\" exists for a reason, I think it would be helpful for you to consider a backup plan. Others suggested maybe an MBA so that, if playing music professionally doesn't work out, you could have marketable skills for the music industry. I think that's definitely something to consider.",
      "author": "False-Guess",
      "created": 1635649948,
      "upvotes": 39,
      "replies": {
        "hircvxv": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hircvxv/",
          "text": ">People who spend their lives chasing dollars and cents often end up with lots of dollars and little sense\n\nI love this",
          "author": "smmstv",
          "created": 1635685336,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "hiputtb": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiputtb/",
      "text": "Yes, time to stand up to your parents because its your life. Or you can go along and be depressed and unsuccessful in a career that you hate.",
      "author": "iwasfakingit",
      "created": 1635646203,
      "upvotes": 34,
      "replies": {}
    },
    "hir9o3u": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hir9o3u/",
      "text": "Don't do cybersecurity. Don't get your master's yet. You've stated yourself that you're dealing with depression to the point of it being life-threatening, and it seems like your studies are only making it worse. Going into cybersecurity will only make things worse.\n\nIf I were in your shoes, I would do this: graduate with your bachelor's and get a job. It doesn't have to make bank, but as long as you can support yourself you'll be fine. With a criminology degree, you can go into law enforcement, but you can also do something a little bit more low key, like being a probation officer or even working an office job at the police department. Hell, you can even work as a teacher's assistant or an administrative assistant, as long as you think you'll be able to make ends meet. My personal standards for making ends meet is 30k a year/15 dollars an hour, but yours might be higher or lower depending on where you live and what your needs are.\n\nTry to rent a room with a friend, or a cheap studio (if you live in a place with low rent) and *establish independence.* One of the biggest ways parents hold authority over you is through financial compensation. If you learn how to support yourself, they will no longer be able to hold that over you. One of the best things you can do is google \"how to move out without any money\" and read/watch every result.\n\nOnce you've learned how to live on your own, your life is your own. It's not too late to pursue music through taking some extra classes on a part-time basis. However, I personally recommend going the music education route. Every school has a choir, and every choir needs a teacher. That's why I recommended looking into being a teaching assistant, because you could establish a relationship with a school and eventually get a job once you get enough credentials.\n\nAlso, there are so many programs that prepare you to become a teacher at an affordable price. Look into some of those, and try to incorporate the curriculum from your music minor in order to gain a teacher certification in music.\n\nHowever, if teaching isn't for you, just try to find a job you don't hate and will make ends meet. From there, spend your weekends and evenings continuing your passion through community choirs and even voice/piano lessons for supplemental income.\n\nMy two biggest recommendations: prioritize your mental health first and establish independence from your parents.",
      "author": "naturebaddie27",
      "created": 1635683302,
      "upvotes": 10,
      "replies": {}
    },
    "hiqr4ki": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqr4ki/",
      "text": "You know what your parents will also be upset about?\n\nYour lack of motivation, your depression, etc. The fact that you will resent them for the choices you felt they forced you to make, and that you didn't want to make.\n\nYou're not doing anyone favours in the long run by pursuing a degree you don't want.\n\nYour parents grew up in a world where getting a good degree meant getting a good job that could last you your whole life. That economy doesn't really exist anymore.\n\nBesides, it's absolutely untrue to say that you can't earn a living as a working musician. Whether you're in like half a dozen wedding bands or you work events, or you teach music to children and teens, there's many ways you can get revenue out of your musical skill. You won't be the next big pop star or the next great Jazz Genius. You won't be earning six figures. You can still get by.\n\nSo to recap :\n\n1. It's not an economic necessity to go through with this degree you don't want.\n2. Maybe your parents think that's what's best for you. But they don't know that, and neither do you. Plus, you think it would make you unhappy.\n\nStanding up to your parents and doing your own thing can be pretty hard. My parents don't really speak to me anymore ever since I came out to them. But it was either that or I was going to be miserable forever. My dad used to say I didn't need any gender identity at all, that being transgender would distract me from my Ph. D. You know what else distracts me from my Ph. D. ? The fact that I miss my dad, who won't talk to me anymore...  It still beats being chronically depressed forever, having no self-esteem, having panic attacks and feeling like shit all the time though. My life makes sense to me, now.",
      "author": "robertofontiglia",
      "created": 1635668472,
      "upvotes": 9,
      "replies": {}
    },
    "hiqtq9e": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqtq9e/",
      "text": "Dude I just hard ghosted my overbearing mother and it feels really freaking nice. Parents are supposed to support their children, not cram them into boxes. Yeah, music may not pay the bills, but there are plenty of jobs out there that would be flexible enough to allow you to put some real time into your passion. You may not be making bank, but net worth is a horrible metric of a good life.",
      "author": "Epicmuffinz",
      "created": 1635670697,
      "upvotes": 8,
      "replies": {}
    },
    "hiqu4ib": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqu4ib/",
      "text": "Just tell them you're taking a gap year. Go get a job and live an adult life for a while and let shit come together naturally for you.",
      "author": "drunkinmidget",
      "created": 1635671041,
      "upvotes": 9,
      "replies": {}
    },
    "hipu94d": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipu94d/",
      "text": "You need to do what makes you happy. A career in music can give you what you need to be happy. Live life for you, not your parents.",
      "author": "jb9406",
      "created": 1635645899,
      "upvotes": 49,
      "replies": {
        "hipur0l": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipur0l/",
          "text": "Happy cake day 🎉🥳❤️",
          "author": "SpicyMayoPacket",
          "created": 1635646162,
          "upvotes": 4,
          "replies": {}
        },
        "hipw1j4": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipw1j4/",
          "text": "Yeah. Happy cake day.",
          "author": "cyberwiz21",
          "created": 1635646848,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiqdsa8": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqdsa8/",
      "text": "So the summer before my senior year I realized I had no desire to go into my field (funnily enough, music industry). I graduated anyway with a degree in arts management and spent the next seven years figuring out what the fuck I actually wanted to do. Now I'm finishing my graduate program in a completely different field. I'm so thankful I took the time off to develop skills and put out feelers. I'm a huge proponent of taking time between undergrad and graduate school. My point is that it might be beneficial to take some time, either get a job in your field and use your free time to pursue music and figure out if it's something you really want to pursue professionally, or go ahead and pursue music with a fallback in your back pocket. You can also go into arts administration and put the skills you're learning now to good use there! Art still needs people with various tech skills.\n\nNothing you're learning right now is useless, and can offer you a unique and cross-discipline perspective. I know it feels like you have to decide RIGHT NOW where your life is going, but lemme tell you, I've been out of undergrad for almost ten years and I have done SO MUCH but at the time it felt like SO LITTLE for no reason. And even now I'm nowhere near music professionally, by choice, but it's still a huge part of my life. Please don't lose faith, and if you're having thoughts like that please take advantage of your campus counseling resources. You're not alone and I'm certain you'll figure out how to keep music in the spotlight.",
      "author": "signedizzlie",
      "created": 1635657538,
      "upvotes": 6,
      "replies": {}
    },
    "hirbbsp": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirbbsp/",
      "text": "Do not do not do not go to grad school unless YOU want to. Listen, I’m in a field I absolutely love and I can’t imagine doing anything else. And I still hate grad school. Sometimes it’s the worst thing ever and if I didn’t love what I’m doing, there is no way in hell I would finish my degree. If you’re already depressed (I’m assuming here) in undergrad, as I was, grad school isn’t always a friendly place. I know it’s hard to want to please your parents, but at the end of the day you are the only person you’re stuck with forever. You have to try to do something that brings you joy instead of terrifies you. You have to set that boundary and firmly with your parents that you will not continue down this path. You have to stand up for yourself.",
      "author": "comfyclassicist",
      "created": 1635684376,
      "upvotes": 7,
      "replies": {}
    },
    "hir4d5k": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hir4d5k/",
      "text": "Musician and research professor here.\n\nDo you actively *hate* law? Or do you just like music more? Because it's very difficult to make a career in music (or other arts) and even if you do, it simply won't provide you with a quality of life you may want.\n\nHowever, I know many people that play in a band on weekends and go to their full job during the week, myself included. It's so much better to just have fun playing music. If you're worried about making money with your music, suddenly it becomes a lot less fun",
      "author": "Dr_Silk",
      "created": 1635679424,
      "upvotes": 6,
      "replies": {
        "hirdpym": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirdpym/",
          "text": ">However, I know many people that play in a band on weekends and go to their full job during the week, myself included. It's so much better to just have fun playing music. If you're worried about making money with your music, suddenly it becomes a lot less fun\n\nThis. as someone in a band it's hard enough to get free gigs, let alone paid gigs, I can't imagine how tough it'd  be to make enough to earn a living from it. Being forced to do something is a great way to make it suck, even if you loved it at first. Get a good career, and you'll have enough money and time to enable you to pursue this hobby (and it can get very, very expensive",
          "author": "smmstv",
          "created": 1635685836,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hiqic4t": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqic4t/",
      "text": "Is there something you can do as a compromise? You clearly don't like criminology, but your parents have a point in terms of the practicality of pursing a performance art for money being unstable. Plus, there's a chance that once you make singing your main career rather than a hobby or side gig that you'd end up disliking it as a job (not saying you definitely would, but just that it's common to hear this from people who pursued their hobby interests as careers). Is there maybe something like, being able to create music for some tech industry company, or something where you can take what you learned in criminology and apply it to industry while you do music on the side (until it get stable enough for you to do as a main career)? I don't know if criminology has applicable skills, but I imagine it might be possible for you to get into something like UX Design or something related that is somewhat artistic at least even if it's not music, and is also quite practical and lucrative.\n\nI sympathize as someone from a culture where parents' opinions really matter. I disagree with everyone saying \"fuck your parents and do what you want\" and empathize with why you want to appease them. But your life has value too, and if you're at the point where you were close to offing yourself a few times, there has to be some better dialogue about this. Also, never tough out grad school in a topic you hate just to appease your family; it's tough enough even for people who are passionate about their topic. Where is it going to end? After another 8 years of grad school when you get a PhD? After another 20 years of being a lawyer or something? Or maybe when you do off yourself? There's a huge gap between music and a criminology career in terms of other professions/careers, so there *has got to be* a compromise that exists here that both you and your parents could deal with.",
      "author": "valryuu",
      "created": 1635661069,
      "upvotes": 4,
      "replies": {}
    },
    "hiqlbvt": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqlbvt/",
      "text": "Do you/can you support yourself once you graduate? I think if you're financially independent then they can't say much. I'd consider getting a job and start working on building an income from music. There isn't much point in doing a masters in something you don't like. Especially when it's something you can pursue later on.",
      "author": "plurelyPlatonic",
      "created": 1635663596,
      "upvotes": 5,
      "replies": {}
    },
    "hiqr4q9": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqr4q9/",
      "text": "One day you will be dying. Do you want to look back on a life where you've lived out your parents' expectations rather than what you are passionate about?",
      "author": "Blutorangensaft",
      "created": 1635668476,
      "upvotes": 5,
      "replies": {}
    },
    "hir6do1": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hir6do1/",
      "text": "It seems like you are experiencing a crisis bro I had that a few times. Ultimately, you should take time to collect yourself over winter break and sit down and figure out what you really want to do. I also liked both cyber and music bro I ended up getting my computer science degree so I would not be locked into security position. Information systems are also interesting bro IT is the fundamentals for Cyber good luck man there’s so much you can do and still enjoy music as a hobby not everyone is capable of doing a science degree like cs or cyber remember that too. Don’t worry bro I cry a lot too I’m 30 and I wear my tears proudly",
      "author": "INFTCollector",
      "created": 1635680958,
      "upvotes": 4,
      "replies": {}
    },
    "hiqiff2": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqiff2/",
      "text": "My brother does cyber security and what you mentioned isn’t even what it’s about. It’s just a job where you secure network servers , protect from phishing, and provide security for computer networks. It’s not a job for Sherlock Holmes by any means. You can still pursue your interest in music on the side too anyways in your free time. Hell if you don’t like cyber security you can switch too. Though I think what you’re pursuing will give you a sizable and stable paycheck where you will definitely have enough free time for hobbies and pay your bills without a sweat. My brother has so much free time to pursue his interests (creating a business, buying that nice big house, investing in his VR and PlayStation games) because of it and he’s definitely ten times happier because of this job as well. Do what you feel is right for you though.",
      "author": "Snoo31272",
      "created": 1635661144,
      "upvotes": 11,
      "replies": {
        "hird6px": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hird6px/",
          "text": "As a person who is a musician on the side I second this comment fully.  Having a good career that gives me disposable income to buy nice instruments and the free time to play them is so much better than trying to do this as a career and struggling financially.",
          "author": "smmstv",
          "created": 1635685515,
          "upvotes": 5,
          "replies": {}
        },
        "hiqm2zs": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqm2zs/",
          "text": "It's a good gig these days. It's more like accounting than chasing criminals. You make sure that all protocols are followed, records are clean, networks are working.",
          "author": "fwafwa",
          "created": 1635664222,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hiq9s8i": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq9s8i/",
      "text": "Are you seriously considering dedicating the rest of your life to something you hate because mommy and daddy want it?\n\nYou are the one who has to live with your choices. You need to stand up for yourself. This is your life. Why are you throwing it away so carelessly? Are you really going to give up before you've even started? Time is a limited resource.\n\nI know you're better than this and deserve to find happiness. But you have to believe it, too.",
      "author": "sophtine",
      "created": 1635654731,
      "upvotes": 6,
      "replies": {}
    },
    "hiqi53c": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqi53c/",
      "text": "Something tells me OP has no idea what it's like to be poor. Maybe your lawyer parents are onto something. Why don't you live real life without people paying your bills for a year and then decide if you really want to pursue music? \n\nFeel the pressure of having to save up for the menial shit you're used to now. Feel what it's like to watch others buy a house while you rent a small 1BR. Know what it's like to not be able to travel for pleasure, or have to eat canned food because extra expenses ruined the budget last month.  \n\nIt's all nice and romantic to chase your dreams in music, but none of that crap matters when real life hits. Make music your hobby, but support it with a well-paying career",
      "author": "resorcinarene",
      "created": 1635660906,
      "upvotes": 9,
      "replies": {
        "hiqkobv": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqkobv/",
          "text": "https://www.reddit.com/r/GradSchool/comments/qjfold/forced_into_grad_school/hipzvgy?utm_medium=android_app&utm_source=share&context=3\n\nThis is the first I've ever seen someone have a therapist, a life coach, a psychiatrist.",
          "author": "bkalsdiy",
          "created": 1635663031,
          "upvotes": 9,
          "replies": {}
        },
        "hiqrrg5": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqrrg5/",
          "text": "Uhhh except there’s probably a middle ground between OP’s dream career and the dream from OP’s parents??\n\nWhy exactly are we insinuating OP should continue into a grad program in something they hate??",
          "author": "Jwalla83",
          "created": 1635669020,
          "upvotes": 7,
          "replies": {
            "hiswmbv": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiswmbv/",
              "text": "Nobody's insulting OP by being realistic. Nobody insinuated OP should go to grad school. \n\nThe only thing that was suggested is to live under the financial constraints of the career OP is trying to choose. \n\nIt's the naive dream of wanting to do music for a living, yet being unaware of the financial implications behind it, that is being bruised. \n\nDon't conflate that with being given advice to get real life information before making a rash decision. It isn't romantic to be poor while doing something you love. It's bullshit poor people tell themselves to cope",
              "author": "resorcinarene",
              "created": 1635710273,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hirh35g": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirh35g/",
          "text": "> Something tells me OP has no idea what it's like to be poor.\n\nWhile I'm sure covid hit the music industry hard, music majors aren't as poor as people seem to think they are (at least if they're willing to teach). I was a music major and did just fine, as did most of my music major friends. I'm 30 now and have since left music, but most of my friends who haven't now own their own home, and many are raising a family on the money they make. I'm probably poorer than them because I quit to get another degree, lol, while they were continuing to move up in their music careers.\n\nThe caveat is that I live in a large metro with a thriving performing arts scene and a culture that invests in the arts, but still it's silly to act like we're all a bunch of poor people living in our parents' basements or in cardboard boxes.",
          "author": "HumanDrinkingTea",
          "created": 1635687746,
          "upvotes": 4,
          "replies": {}
        },
        "hiqv6ja": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqv6ja/",
          "text": "Not having as much money is absolutely worth not wanting to die from being stuck in a program you hate. Maybe stop being so condescending?",
          "author": "wolfchaldo",
          "created": 1635671997,
          "upvotes": 2,
          "replies": {
            "hisvxyy": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisvxyy/",
              "text": "I'm being realistic. I grew up poor and it sucks. OP has two parents who are lawyers and has probably never experienced a life outside of the middle class. That reality is being taken for granted",
              "author": "resorcinarene",
              "created": 1635709984,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hiqd58z": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqd58z/",
      "text": "I was in the same boat. I sorta enjoyed what I was doing before I changed my major but I wasn't doing it for me. I was with you in almost offing myself as well. After I changed things (I sorta did it without telling my parents)  I was a million times happier and now that I'm in grad school, I could not be here if I didn't want to be here. If someone was pushing me into this against my will, I'd probably survive but things would be a whole lot harder than they are and some days I already question if I'm going to make it through.\n\n&#x200B;\n\nI learned that if you let your parents rule your life for that long, they will keep doing it. It wasn't until college I started pushing back and getting my own autonomy. Remember, this is what path you want to take for the rest of your life not your parents. Yes it can change and you can always change again in the future, but it ultimately needs to be your decision. There's always going to be a chance you'll get into criminology as a worker and actually enjoy it, but do you want to put up with all the schooling and stress to get to that point? Or do you want to go with what you feel \"called\" to and where you feel like you need to go for yourself? It's a hard decision and hard to stand up against your parents when they have things decided for you, but ultimately you'll come out stronger for it.\n\n&#x200B;\n\nJust keep hanging in there! You can get through all this!",
      "author": "CommonKilljoy",
      "created": 1635657066,
      "upvotes": 2,
      "replies": {}
    },
    "hiqgdt6": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqgdt6/",
      "text": "Your out is landing a job.  Start getting resumes to places for after undergrad.  Just do some job somewhere and figure out the rest of life later.",
      "author": "DontRunReds",
      "created": 1635659497,
      "upvotes": 2,
      "replies": {}
    },
    "hir3p5x": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hir3p5x/",
      "text": "I haven’t seen anyone mentioning this but the vast majority of cybersecurity masters programs require a computer science, engineering, or math undergrad. Like almost all of them.",
      "author": "magic1623",
      "created": 1635678917,
      "upvotes": 2,
      "replies": {
        "hir9ezg": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hir9ezg/",
          "text": "Cybercrime is related to criminology",
          "author": "SpicyMayoPacket",
          "created": 1635683127,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hira0ha": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hira0ha/",
      "text": "You're an adult. Take control of your own life. That said, it's not like your only choices are a grad degree in cybercrime or being a musician which is going to be a career path where it's hard to make a stable living. Is there anything else you find interesting? Could something like music education be an option?",
      "author": "mediocre-spice",
      "created": 1635683531,
      "upvotes": 2,
      "replies": {}
    },
    "hircpi4": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hircpi4/",
      "text": "Hey OP, you can always have your main career and do music on the side, as a hobby. That's what the vast majority of musicians who I know do, very few of them do it as a career. You didn't specify what exactly you want to do in music, but if it's playing an instrument, a lot of times that isn't cheap (especially if you're a guitarist like me who insists antiquated 1920s technology *sounds better man)*. If you have a good career, you'll  have plenty of money to spend on really nice equipment, vs if you do music as a main career you might struggle and not be able to get all stuff you'd like.\n\nGranted I don't hate my career but it does get old sometimes. Music for me is a great escape from all of it. In fact, I don't know if I'd want it as a career because then it'd be something I have to do and it'd suck the joy out of it. I think it's important to find a career that you don't hate, but also keep in mind you don't have to do what you love as a career, you can always do it as a hobby. And having a good career and more money to burn on that hobby is just icing on the cake. \n\nAnyway, hope this helps.",
      "author": "smmstv",
      "created": 1635685230,
      "upvotes": 2,
      "replies": {}
    },
    "hird9b4": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hird9b4/",
      "text": "First off, please seek help for the suicidal ideation you're experiencing right now. There are counselors at your university who can help you. \n\nSecond off, you're an adult. You do not have to do anything you don't want to. Don't go to grad school. An undergraduate degree is sufficient. Use that to get a career to support yourself, quit letting your parents pay for and dictate what/when/how you do your life. And work towards figuring out how you can do what you love.",
      "author": "ARTXMSOK",
      "created": 1635685558,
      "upvotes": 2,
      "replies": {}
    },
    "hirru4g": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirru4g/",
      "text": "I think if your this miserable now it would be worth being cut off so you could find happiness.... you can either be near suicide and financially secure or broke as you start your music but happy.. I think most people would chose the second option because security doesn’t matter if your this unhappy! I wish you the best and hope it all works out. Just know your parents opinion doesn’t matter in the long run and this is such a small phase of your life don’t end it over a bad period",
      "author": "Helloooo_ooooo_",
      "created": 1635692938,
      "upvotes": 2,
      "replies": {}
    },
    "hirst15": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirst15/",
      "text": "Could you do music stuff on the side? There are a few famous musicians and producers that were something else then did music on the side. \n\nOak Felder used to be a network engineer doing music on the side. He only quit his job when his music gigs were more stable. There a list of artists who have grad degrees: [https://en.wikipedia.org/wiki/List\\_of\\_artists\\_and\\_entertainers\\_with\\_advanced\\_degrees](https://en.wikipedia.org/wiki/List_of_artists_and_entertainers_with_advanced_degrees)\n\nI'm currently shooting for a Ph.d and I do music production and piano performance on the side. It's a hustle but I enjoy it. It also works out in getting a bit of cash. I also have a good relationship with all the music profs at my uni so they let me sit in their classes. \n\nAlso if you feel like you're being pushed into law maybe instead of cybercrime going into music law. That way you might actually feel like you'd be learning about building a music career for yourself. For me appeasing my family was decently high on my priority list so my conversation with my parents ended up being a negotiation of what I wanted and what was a stable job. \n\nBut if appeasing your parents isn't high on the priority list, I'd just say fuck and go for it.",
      "author": "KingofSheepX",
      "created": 1635693376,
      "upvotes": 2,
      "replies": {}
    },
    "hirun8x": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirun8x/",
      "text": "I'd stick with the cyber security and do music as a hobby. \n\nThat way you will be able to afford all the good stuff. Just saying 👀",
      "author": "heart_diseas",
      "created": 1635694188,
      "upvotes": 2,
      "replies": {}
    },
    "hirvv3d": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirvv3d/",
      "text": "Therapy. \n\nNo one can make you do grad school. \n\nMusic is likely not a path to paying rent (source: I tested the waters on this path) but can be an enriching hobby and way to find community",
      "author": "isaac-get-the-golem",
      "created": 1635694722,
      "upvotes": 2,
      "replies": {
        "hiry1um": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiry1um/",
          "text": "I love ur username lol",
          "author": "SpicyMayoPacket",
          "created": 1635695673,
          "upvotes": 1,
          "replies": {
            "hisajf9": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisajf9/",
              "text": "Thanks hahaha",
              "author": "isaac-get-the-golem",
              "created": 1635701038,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "his0s2d": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/his0s2d/",
      "text": "What you need to do is pick a career you don't hate but will also make you enough money to live while giving you the means to pursue your music on the side. \n\nThere's nothing stopping you from doing both.",
      "author": "stathicus",
      "created": 1635696858,
      "upvotes": 2,
      "replies": {}
    },
    "his5ky1": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/his5ky1/",
      "text": "What does “do music” mean exactly? Are you talking about “be a music teacher”? Or “my band may take off!”? Honestly with a background in cyber security you could probably get a perfectly good 9 to 5 job and do music on your own.",
      "author": "wizardyourlifeforce",
      "created": 1635698935,
      "upvotes": 2,
      "replies": {}
    },
    "hisj24h": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisj24h/",
      "text": "There are more than these two career paths in the world. \n\nFwiw, I have friends who are professional musicians. They make it work, but they also regularly work other odd jobs to keep themselves afloat.",
      "author": "Whoatoxicpillow",
      "created": 1635704645,
      "upvotes": 2,
      "replies": {}
    },
    "hisp3xq": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisp3xq/",
      "text": "My father is an artist.  He was forced into law by his father and he excelled but he wanted to paint. What ended up happening is my grandpa died when my father was in his last year of university and my father gave up his degree even though he had finished almost all of his exams . He did because he felt there was no point in him pursuing law now that his father was dead. \n\nIf I were to go by his experience he does not regret choosing to be an artist but what he did regret is giving up his degree last minute . I'd say since you started it you should get your undergrad degree but definitely don't go to grad school. That doesn't sound like it would be rewarding at all for you. \n\nA lot of cinematographers I know had a similar path but they all ended up doing what they love because if you truly love art its hard to avoid that urge to create . Its a matter of now or later but if you also want to make money off of your art and progress in your art then its always better to start as early as possible for you. \n\nMost artists I know don't make a lot of money (but they pursued their dream later in life and also I live in a country that generally isn't optimal for artists)  but every single one of them says they could not have it any other way so thats the perspective I have to offer.",
      "author": "whyisshesmilingatme",
      "created": 1635707167,
      "upvotes": 2,
      "replies": {}
    },
    "hisqgyw": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisqgyw/",
      "text": "Choosing between music and cybersecurity is a false dilemma. Why not look into other options?",
      "author": "Lower_Roll679",
      "created": 1635707724,
      "upvotes": 2,
      "replies": {}
    },
    "hiq7s4x": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq7s4x/",
      "text": "I think Dr. Edith Eger's books may be helpful, The Choice and The Gift. Here is part of a podcast she had with Brene Brown that I think is relevant:\n\n> EE: That’s why we blame… You’re still like children, because children blame. Why do you blame? You’re still a child. You don’t take responsibility. There is no freedom without responsibility. It’s anarchy. So many times, I ask people, “Would you like to be a baby or a big girl, or a baby and a big boy, because while you’re a baby, you’re sitting in a back seat of the car. You can mess around and do anything because someone is driving. So, do you want to be a driver? Or do you want to be driven?”\n> \n> BB: Yeah, and you know what, sometimes we climb in the back seat because we don’t want the responsibility of driving.\n> \n> EE: Exactly.\n> \n> BB: But then we’re angry that we’re being driven.\n> \n> EE: Exactly. It’s a double-edged sword. Yes, the approach-avoidance conflict, that we talk about in psychology, that I want to approach it and I want to avoid it. And yet, growing up is much more fun than being a child because you are child-like. You ask a child, “Why do you do that?” The kid would say, “Because I feel like it.” The kid doesn’t care about consequences. So, I like my Hungarian chocolate cake, but I know I have a very bad scoliosis, and if I gain weight, I have more pain, so I don’t have to run from the chocolate cake. I can look at it and I can decide whether I will reach for it or not, so that’s why I like the idea of, to being child-like at 93 but not childish, to be not smart but to be wise and decide before I say something. But that it’s really very important that I have to say it, I listen more now and guide people to be very compassionate listeners.",
      "author": "pdx_joe",
      "created": 1635653436,
      "upvotes": 4,
      "replies": {}
    },
    "hipztld": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipztld/",
      "text": "There are a lot of people who change majors late in to their degree. Fuck what your parents want, do what makes you happy.\n\nWhile switching from criminology to music specifically as a major may fuck you for a few years, do that if you want. If you hate criminology too much find a different major that’s closely aligned that you could finish in a year/year and a half. Or say fuck it, get a degree, and try to find work you like that you can get with your degree",
      "author": "Pikalover10",
      "created": 1635648850,
      "upvotes": 2,
      "replies": {
        "hiq0icb": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq0icb/",
          "text": "I’m a semester away from graduating I’m just gonna finish my criminology degree but my real problem is what am I gonna do after?",
          "author": "SpicyMayoPacket",
          "created": 1635649230,
          "upvotes": 6,
          "replies": {
            "hiq1hl4": {
              "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq1hl4/",
              "text": "Well, I’m not going to lie to you the job market can be kinda shitty right now to people. I’m not sure what other things you may have looked at field wise, but I would look and spend some time exploring those options, maybe reaching out to professors at your school in those fields (explain your situation and just ask them questions you have, I’m sure they’ll be willing to help).\n\nYou could also drop by and talk to your department advisor/mentor/favorite professor and talk to them about the situation. I’m sure they’re at least somewhat knowledgeable on at least the other fields people have taken after getting a criminology degree.\n\nHonestly, taking some time off from school (if you find out you want/need to get a masters in another field for the career path you want) has been one of the best decisions for me personally. I wasn’t successful in a career job hunt but I had opportunities to take “grunt work” jobs that would’ve paid me enough to at least pay bills and maybe save a small amount of money, especially if I found a roommate.",
              "author": "Pikalover10",
              "created": 1635649766,
              "upvotes": 3,
              "replies": {
                "hiqep41": {
                  "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqep41/",
                  "text": "To bounce off this, you could also meet with someone from your university's music school, and if they don't have one, reach out to another school! If they won't talk to you, fuck em and try another. You don't want a school who'd treat you like that anyway. They'll talk to you without any commitment and could help give you suggestions on where to start. Or you could start on the hard path and get a shitty grunt work job like was suggested above and make connections there. Lots of what professional music is is connections anyway, so somewhere like an opera house or similar theate may be good, even if it's just a volunteer gig at the start. Volunteer gigs are great for getting your feet wet and generally pretty flexible, plus the added benefit of having that low level experience that's so important.",
                  "author": "signedizzlie",
                  "created": 1635658209,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiqpvrd": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqpvrd/",
      "text": "Become a Stanist.",
      "author": "Proof-Preference-872",
      "created": 1635667425,
      "upvotes": 1,
      "replies": {
        "hir5tkh": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hir5tkh/",
          "text": "A what",
          "author": "SpicyMayoPacket",
          "created": 1635680549,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiraboc": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiraboc/",
      "text": "I know lots of software engineers and such who has music as their side job - they have bands and such. If you will do cybersecurity you also have chances to not work in the crime but for software companies which deal with music and where you could be cybersecurity expert - for example Spotify and SoundCloud usually wants people (even engineers) who have interest in music.",
      "author": "cyjanek528",
      "created": 1635683737,
      "upvotes": 1,
      "replies": {}
    },
    "hirbimi": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirbimi/",
      "text": "be prepared to not have your parents financial help if you decide to continue with music",
      "author": "yikeswithikes",
      "created": 1635684494,
      "upvotes": 1,
      "replies": {}
    },
    "hirgqnq": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirgqnq/",
      "text": "Word to the wise: Don't ever let someone else choose your career path, especially if you wish to preserve that relationship, as you will just end up resenting them for it in the future.",
      "author": "theif519",
      "created": 1635687559,
      "upvotes": 1,
      "replies": {}
    },
    "hirjfg7": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirjfg7/",
      "text": "As it is for many undergrads, it is time to figure out what you want out of your professional life. There are myriad options besides music and crime. Your parents have likely limited your perspective, and that has continued with your undergrad focus among like-minded students and faculty. Please look into career-exploration resources. Good universities offer quite a lot in that regard.\n\nThere is a good chance that you can use skills learned in your undergrad program to do things that you find personally rewarding and enjoy doing day to day. I'd keep that idea in mind as you do structured career exploration.\n\nMusic is a difficult career. That means society has created a lot of other ways to sing. You can always be a singer, with other music lovers. Having a satifying \"day job\" is a useful complement.\n\nAs a grad-admissions person, I strongly advise not aiming for graduate school. Your note is full of the red flags we look for when considering who is most likely to succeed in our program.",
      "author": "IkeRoberts",
      "created": 1635688965,
      "upvotes": 1,
      "replies": {}
    },
    "hirk9mr": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirk9mr/",
      "text": "Fuck that. I just got my masters. I work hard. I like what I do but its stressful.\n\nMy gf works at a nursery. She makes very little, but she gets by and enjoys life on low income. She is not stressed at all, loves her job, and spends all day on the job and off listening to podcasts and books and commentaries and educating herself.\n\nPoint is... if you dont like your education/job and its stressful to begin with... not liking it will make your life hell. Better to get any job you can enjoy that's just enough to get by than do something you know you'll hate.\n\nSure. One day you'll need to think about a retirement fund all that. But if you are this emotionally and mentally harmed by this career trajectory you have to escape it. \n\nOption 1: continue suffering with no end in sight\nOption 2: dramatically change your life, suffer while it happens and as you maneuver your new found freedom, build a life, and fulfill your potential to be happy",
      "author": "bandanajack",
      "created": 1635689387,
      "upvotes": 1,
      "replies": {}
    },
    "hirltvb": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirltvb/",
      "text": "Definitely sounds like counseling would help considering you mentioned you were not a happy person. As far as music goes, maybe talk to a music professor at the school to ask about making it a full time career? I don’t think you should be pushed into a program that you want to do and hope you can have a legit conversation with your parents.",
      "author": "214speaking",
      "created": 1635690144,
      "upvotes": 1,
      "replies": {}
    },
    "hirnnq6": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirnnq6/",
      "text": "Sincerely, do not go to grad school even for a masters for either. I'm doing a masters, and the stress even in my field that I'm passionate about is crazy, especially now that I'm writing my thesis. I feel like it would ruin music for you with the mental state you're in.",
      "author": "suckuma",
      "created": 1635691024,
      "upvotes": 1,
      "replies": {}
    },
    "hirwnxb": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hirwnxb/",
      "text": "You’re an adult. Your happiness is your own responsibility.",
      "author": "bargle0",
      "created": 1635695076,
      "upvotes": 1,
      "replies": {}
    },
    "hisqtve": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hisqtve/",
      "text": "In hopes that this helps, I'll tell you my story.\n\nI graduated from undergrad in 2020, with a psychology/neuroscience degree with honors. Most of that degree was directed towards me going into grad school for neuroscience. I worked my butt off to get a good cv for years. I worked in labs, padded my resume with clubs, published and everything. During interview season, I got interviews with some of the top neuroscience programs in the world. I ended up going to a state school.\n\nI had it made. No loans, guaranteed funding for 5 years, a nice stipend, insurance, the whole nine yards. My wife got a new job, where she was promoted fast and given regular raise. We could afford to live really comfortably in a 3 bedroom house, a nice change from the college days of our 1 bedroom apartment. \n\nI did well my first year. It was pretty easy, I had a 4.0 and everything was going well. But there was something missing.\n\nI hated research. I initially wanted to go to grad school because I wanted to become a professor and teach at the highest level. But doing research everyday and academic politics were daunting. I also found out that I have a higher chance of randomly finding a 4 leaf clover than getting a faculty job. And if you get lucky, the career path is so stressful and uncertain until you get tenure, which the best case could take 7 years as an Assistant professor, but on average it takes longer just to have a stable job. \n\nAs I said before, I hated research but I had developed a love for coding. I took one cs class during the last semester of my senior year in college and I loved it. After long grueling days in the lab, I would come home and code and just learn. I had so much fun learning how to make new things. Recently I felt sort of like op, I hated research to the point I hated waking up in the mornings. It also started to affect my mental health, but coding was my escape. So I made the decision that I would pursue a career doing what made me happy and accept any consequences that came with. So I left my cushy grad school position about a month ago, with no job and some savings. I plan to spend a couple months perfecting my coding skills and studying cs and making cool projects. I bet on myself. When my savings run out, I could either be working as a software engineer or at McDonald's until I can get a coding job. But I made peace with it and this month has been the best month since I started doing research. \n\nWhat I'm trying to say is, you need to figure out what you want, what are the consequences of pursuing it, and if you would be ok with the worst case. If you are then go for it and don't look back.",
      "author": "YungProdigy1119",
      "created": 1635707876,
      "upvotes": 1,
      "replies": {}
    },
    "hit30rr": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hit30rr/",
      "text": "Hey, how are you doing today?",
      "author": "StringOfLights",
      "created": 1635712961,
      "upvotes": 1,
      "replies": {}
    },
    "hit3sw0": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hit3sw0/",
      "text": "Why would you continue to do something that makes you unhappy? \n\nAre you going to wait until your parents pass to do what you want? Can you wait another couple decades? \n\nDo what makes you happy now. Don't wait.",
      "author": "blueevey",
      "created": 1635713302,
      "upvotes": 1,
      "replies": {}
    },
    "hittj7d": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hittj7d/",
      "text": "I'm not sure if someone else mentioned this already, but look up 'entertainment law.' It sounds like an interesting way to combine both your love and your need for financial stability. You can help protect intellectual rights and creative rights of musicians - and that's no small thing! :)",
      "author": "funkykookaburra",
      "created": 1635725776,
      "upvotes": 1,
      "replies": {}
    },
    "hipxc5k": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hipxc5k/",
      "text": "There are many people that make money doing music, playing it, teaching it, writing it, bla bla.  What's wrong w your parents?  You must not be from around here.  Grow up and tell your parents to shove it (not really but do what you want and stop letting them run your life).",
      "author": "zpe2003",
      "created": 1635647529,
      "upvotes": -5,
      "replies": {}
    },
    "hiq4xdh": {
      "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiq4xdh/",
      "text": "Try to do a double major :)",
      "author": "inklingt",
      "created": 1635651721,
      "upvotes": -2,
      "replies": {
        "hiqvpko": {
          "link": "/r/GradSchool/comments/qjfold/forced_into_grad_school/hiqvpko/",
          "text": "Extremely difficult with a music major, especially this late in the game",
          "author": "Unofficial_Overlord",
          "created": 1635672461,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}