{"sid": "puz9tv", "link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/", "title:": "Grad School in the Pandemic- anyone else feel cheated?", "text": "I started my master program in fall of 2020. In the beginning I had the typical imposter syndrome and was just super intimidated all the time. Now that I’m over that, I just feel annoyed and angry. \n\nAll of my classes have been online, so I’ve obviously felt like I’ve missed out on a great deal of practical experience I would have gained otherwise. My virtual seminars are oftentimes just a performative circle jerk of everyone trying to seem the most woke or have the most provocative opinion (If I hear the phrase “you’re so valid” one more time I’ll discorporate). \n\nI’m in this weird loop of thinking that school is holding me back from doing the research and practical work that I love, but feeling like I can’t continue that work without the credentials, while also feeling like those credentials would be hollow. \n\nIs this normal? Should I take a break and reevaluate my goals?", "author": "KudzooHobo", "created": 1632542706, "retrieved": 1632954489, "over_18": false, "upvotes": 276, "upvote_ratio": 0.96, "comments": {"hebirqw": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/hebirqw/", "text": "Honestly, I would have been expelled already if someone said 'you're so valid' because I would have started giggling and in real life, you can't mute or turn off your face. So, I think this online stuff is great and nothing feels better than getting paid to sit at a desk while attending lectures lol.", "author": "isuzuspaghetti", "created": 1632640082, "upvotes": 1}, "heaqw6n": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/heaqw6n/", "text": "> If I hear the phrase “you’re so valid” one more time I’ll discorporate\n\n\nI lol'ed so hard. I feel your pain OP, I really do.", "author": "Bruh-I-Cant-Even", "created": 1632623719, "upvotes": 3}, "he9zyvw": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he9zyvw/", "text": "I feel awful for anyone in school during this pandemic - it just sucks. Particularly at the HS and above level where you start losing things you “can’t get back” (from prom to actually meeting the professor you’re forming over tens of thousands of dollars for). Anyone not in intentionally remote school (like it was that way pre pandemic and the low prices reflect it) got screwed. I can’t imagine not being about to go speak with the professor after class, go to office hours... I do not do well learning online.", "author": "Plantsandanger", "created": 1632610726, "upvotes": 4}, "he9ljdc": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he9ljdc/", "text": "Yup, it way sucks. Every aspect is lower quality. \n\nI was just at a conference where I would have loved to introduce myself to our keynote speaker. I'm an older PhD student and I'm way better interacting in person than over email. But nope! Now I'm essentially gonna cold-message this guy who will have no context about me whatsoever. \n\nThe few classes that I still had to take once the pandemic started where a joke. A fragment of the quality from in-person classes. And now it has been years since I interacted with anybody outside my area specialty. Those in-department / out-of-specialty contacts are valuable, and I dont have 'em, since it's not like people stay and chat for 5 minutes after zoom meetings. \n\nThe pandemic has made me really wish I wasn't in grad school. I didn't have heat for over a year because I couldn't afford to fix my gas lines. Right now I'm super hungry because my refrigerator is broken and I can't figure out how to fix it or afford to buy a new one. So all my meals are either from the cupboard or the freezer. \n\n\nSorry, I'm not having a very good day.", "author": "Pr0gr3s", "created": 1632603931, "upvotes": 1}, "he9bwi8": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he9bwi8/", "text": ">My virtual seminars are oftentimes just a performative circle jerk of everyone trying to seem the most woke or have the most provocative opinion (If I hear the phrase “you’re so valid” one more time I’ll discorporate).\n\nOmg are we in the same program lol", "author": "harrietdunkley", "created": 1632599635, "upvotes": 2}, "he96v2a": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he96v2a/", "text": "Yep. Second-year social science PhD and I got accepted about 2 weeks before the lockdown initially started and now I have a committee chair that I have never met in person", "author": "collinhalss", "created": 1632597393, "upvotes": 1}, "he94kov": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he94kov/", "text": "Yea, I started January 21’ and it has been mostly online. I have no real connection to my cohort or my professors. We are in person now but can’t be in groups, can’t socialize on campus, it’s terrible. We commiserate through text and email.", "author": "Mass2CTnurse", "created": 1632596360, "upvotes": 1}, "he921y1": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he921y1/", "text": "Started my masters in fall 2020 as well coming straight from undergrad and I am now trying to do like 4 semesters of research in 2. The first whole year was a literal joke with online classes. I’m in the process of setting up a good job for when I graduate but all the projects I intended on having completed by graduation are not even close and it’s because everything was online.", "author": "pavlovsdogsitter", "created": 1632595242, "upvotes": 1}, "he8zgtw": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8zgtw/", "text": "I felt more cheated when our commencement was online. I did have some good pie and wine though during our department chair speech.", "author": "Round-Life-1108", "created": 1632594121, "upvotes": 3}, "he8wnwp": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8wnwp/", "text": "I really hate working from home. I did the first half of my MPH in person and THRIVED. Graduated during the pandemic and now I'm dismayed that my PhD is going to start online, and who knows how long it will remain online? Hate it.", "author": "Weaselpanties", "created": 1632592890, "upvotes": 2}, "he8u3y8": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8u3y8/", "text": "Agree with you on the circle jerk part, I've come to really hate the word \"valid\".", "author": "66th_jedi", "created": 1632591743, "upvotes": 1}, "he8tvtu": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8tvtu/", "text": "The biggest thing I'm bummed about is missing in-person conferences. Getting to go an network with others in your field can be very valuable later on. It's a lot tougher to do that when the conference is online.", "author": "almondface", "created": 1632591642, "upvotes": 3}, "he8mqgq": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8mqgq/", "text": "You are not alone - I agree completely. I started my doctorate in a clinical health/rehabilitative medicine science field in Fall 2019 and only had a semester and a half of actual grad school before we left for spring break and never went back. I’m going into major debt for maybe 10% of the experience I signed up for. I’m very COVID-cautious and grateful that my school took precautions seriously, but angry and disillusioned that I’m in six figure debt for this. There weren’t enough fieldwork sites in my grad school city so I had to move home, living with my parents because finding an apartment during Covid with two weeks’ notice was impossible. I’m now finishing my doctorate from my childhood bedroom on a laptop. It’s depressing. \n\nI am actually applying to one-year MPH programs for next year in the hopes that (if financial aid works out - not looking to throw good money after bad) I can redeem this a little and experience grad school the way I always wanted to. \n\nI am so sorry you’ve experienced this, too. It was stolen from us and if my hooding/graduation is virtual in May 2022 I think I’ll lose my mind a little, since that’s been the goal that has kept me motivated through all of this. I think it’s okay to grieve what was stolen. I’m just sorry you have to, too.", "author": "errtffg", "created": 1632588532, "upvotes": 1}, "he8kgcy": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8kgcy/", "text": "The connection between I and my friends in my cohort was one of the most significant things that kept me going through what was a very difficult first semester during my masters and without that I would've given up, no question, and I just can't get that through Zoom or whatever. It seems like I'm feeling the same thing that you are right now in the first term of my PhD. I do feel a little bit cheated about that, but I also feel like I should've seen it coming.\n\nObviously your situation re: COVID isn't normal, but if you feel like you're at odds with the school regarding the work you went there to partake in, it wouldn't be good in a normal time either. I would think that if you really feel like the credential that you're going to get would feel \"empty,\" then I imagine you'd just go through the motions doing the work to earn it, which wouldn't benefit you either in the short nor long term - It'd likely result in lesser-quality work, plus much of what you gain through the act of researching comes through the effort you put in, and if you don't care to put a lot of effort in, you probably wouldn't get the benefits there, either.", "author": "thelowandtobask", "created": 1632587521, "upvotes": 1}, "he8gl73": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8gl73/", "text": "What field are you in? I started my MA fall 2020 and it took a lot of hustle and ridiculousness but I was able to still get a decent experience out of it so far. I DID take a step back and take fewer classes spring 2021 because I despised the zoom format, but have been able to get some research experience (as much as could be expected during a pandemic) and conference presentations under my belt. I'm in a Gen Psych program and did put off proposing my thesis to this semester (no regrets). If this is at all relevant to you feel free to DM me!\n\nI do wish I knew my classmates better, but that is what it is :(", "author": "figuringthingsout--", "created": 1632585782, "upvotes": 1}, "he8c5wi": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8c5wi/", "text": "It's okay. If you think taking some time off is right for your mental health, I'll say go for it.\n\nSource : I'm also doing the same thing", "author": "ruthlessdamien2", "created": 1632583802, "upvotes": 1}, "he8434f": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8434f/", "text": "I’m right there with you. Starting my first dose of antidepressants today. Yippee.", "author": "_johnfketamine", "created": 1632580075, "upvotes": 1}, "he83uef": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he83uef/", "text": "I started my masters at the same time, and have been online for all of it so far. I saw my lab for the first time last week.\nIt's been a largely draining experience. I burned out hard online in the summer, and got nothing done for six weeks. My point is, you're not alone. It really has been tough.\nI want my masters to unlock better job opportunities, but it has been a shell of the experience it should have been.", "author": "Hickiebenz", "created": 1632579959, "upvotes": 1}, "he8243n": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he8243n/", "text": "It happened the same to me… but you know what…. At least I’m already done with it, and closer to get my certification which is all I need. I feel robbed, that I paid so much money for online classes when I was the one teaching myself, and writing a million times more than now that clases are in person", "author": "psycologina", "created": 1632579152, "upvotes": 2}, "he81owt": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he81owt/", "text": "Oh my god half my classes are like that — we’ll break off to ‘discuss’ something and it turns into an echo chamber of wokeness in 0.4 seconds. I’m grateful to have stayed in school and a job through all this but both feel weird from what i pictured theyd be.", "author": "NotMyPotOfTea", "created": 1632578951, "upvotes": 1}, "he7zvtk": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he7zvtk/", "text": "I think the circle jerk is just a feature of grad seminars. Mine are riddled with it as well, either a battle over who is more woke, or a couple people dueling it out on who can regurgitate more theory. \n\nI tend to just do my own thing as a result, though I’m in sociology and we just read at this point in my career. \n\nI think as long as you have a solid advisor and enjoy your topic, your degree won’t be hollow.", "author": "ThinnerSamTarly", "created": 1632578083, "upvotes": 11}, "he7zi0w": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he7zi0w/", "text": "I actually prefer all my classes online, but a good friend of mine has decided to take a semester off to wait and see if classes go back in person. So you’re definitely not alone and I think it’s a great idea to take time off if you know what experience you want in grad school.", "author": "Internal-Bear-8184", "created": 1632577898, "upvotes": 2}, "he7xk2p": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he7xk2p/", "text": "At my school, doing my masters thesis is a two-semester process. The first semester was in Spring 2020. The idea is that during the first semester, you research. Over the Summer you write the rough draft. Then in Fall 2020, you do the finishing touches. I was warned ahead of time that writing a thesis is a lonely process, but then, a few weeks into my research, COVID-19 happened.\n\nMy area of study was local history. All of the local historical societies, where I was expecting to receive half of my research from, closed down. Over half have yet to reopened, and several never will. So basically I did my thesis with half as much information as I needed.", "author": "noravea", "created": 1632576957, "upvotes": 6}, "he7jlts": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he7jlts/", "text": "I feel the exact same. I really was hoping grad school would be full of rigorous debate and open intellectual discussions. Seems like it's all just a competition to make the most anti-empirical but super woke statements, and then just desperately applaud each other for it.", "author": "brundybg", "created": 1632569207, "upvotes": 8}, "he7ghjh": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he7ghjh/", "text": "I'm right there with you man. I'm doing a masters so I'm on my last year but everything has been virtual, not a single exam has been closed book, and even professors cancel class at the last minute.\n\nAll about that piece of paper at the end, I guess, but I'm not learning anything", "author": "hollytot", "created": 1632566997, "upvotes": 4}, "he7fqv4": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he7fqv4/", "text": "Yeah same", "author": "Dustin_Bromain", "created": 1632566441, "upvotes": 3}, "he7d3hf": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he7d3hf/", "text": "“you’re so valid”?? A person is valid? Well of course a human life is valid. Do they mean “I validate your view” or “your thoughts are valid” or something like that?? \nBecause “you are valid” doesn’t make sense. There are not valid human beings and unvalid human beings. There are himans who have validassertions and other humans who have invalid assertions though.\n\nSo that phrase seems incorrect, especially for the intellect level of grad students. \n\nBut to answer your question: yeah, grad school that is in-person would definitely be a different type of experience than all of this virtual stuff. I don’t know if you want to go on leave for a year or so and tgen come back while more things are in-person.", "author": "ADifferentDimension", "created": 1632564305, "upvotes": -6}, "he6yh69": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6yh69/", "text": "Basically in the same boat. Started up in Fall of last year, looks like I will he graduating in May. Moved 2 blocks away from campus. As of now I have never stepped foot in any of the facilities they have touted so much (and continue to charge me for, of course). I know it is partially on me, as the pandemic was very much a thing when I applied back in April.  I guess I naively assumed that it would be resolved in under 2 years.  The class experience has not been that bad tbh, though I do feel like I am overpaying for online college.", "author": "MAGIC_CONCH1", "created": 1632552733, "upvotes": 8}, "he6wx5k": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6wx5k/", "text": "Guess it depends on the field. I’m history, all we do is read.", "author": "ostrogotha", "created": 1632551616, "upvotes": 55}, "he6wuvp": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6wuvp/", "text": "You’re so valid is the most meta fucking millennial thing ever.", "author": "ostrogotha", "created": 1632551569, "upvotes": 7}, "he6urn7": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6urn7/", "text": "I can definitely relate to this! I started my program in 2019 so more than half of it has been online now and last year I missed out on a lot of the practical experience that I was supposed to get in this program. I can also related to the class discussions where everyone is just agreeing with each other. I think that would be similar in person and online based on the people in the class. Luckily, in my final year, I'm actually able to get the practical experience I need to finish this program and get a license in my field. You might want to talk to a program advisor or your research supervisor to see how you can get the experience, research, and skills needed to finish the program and get the career you want!", "author": "lindaedith", "created": 1632550074, "upvotes": 1}, "he6tar8": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6tar8/", "text": ">My virtual seminars are oftentimes just a performative circle jerk\n\nSounds like you're getting the grad school experience just fine", "author": "tchomptchomp", "created": 1632549042, "upvotes": 409}, "he6t2oj": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6t2oj/", "text": "I totally feel you there. A lot of this is what I’m going through too. Today lab broke me. I genuinely don’t care anymore and will just skate by as best I can now to get that stupid piece of paper.", "author": "agarcia0730", "created": 1632548888, "upvotes": 7}, "he6px74": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6px74/", "text": "Yeeeesss! I started spring of 2020, moved to New Orleans, experienced Mardi gras was finally starting to feel normal being in grad classes then everything shutdown. Out of school for 2 months, allowed back in with special accommodations (only 2 people in lab at a time, can't share offices, etc). My classes are super small ~5-6 people so we still had them in person, albeit all masked up, distanced. I've only met ~5 professors in the department and I'm only \"close\" with my main advisor who I hate. Looking to defend this semester and applying to PhD programs and I'm like \"who can I ask for a LOR? I only know Bob!)\n\nStarting to debate whether I should wait another round before apply for phds 🤔😬🙄🧐🤷‍♀️\n\nSo I totally feel you! We will all make it out together somehow 💪", "author": "sunshinesugar754", "created": 1632546829, "upvotes": 4}, "he6oayk": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6oayk/", "text": "I cannot offer great advice, just sympathy. Doing a grad during covid sounds terrible. Honestly, not sure I could have done it; it's already enough of a challenge pre pandemic. May have ended up deferring but not sure I'd have made it back if I did. \n\nIn my experience, class v research are relatively separate unless you can turn a course paper into a journal article. Depends on your relationship with your advisor and your field, but any good advisor will go out of their way to accommodate/help if you're motivated to push your research and you express that to them explicitly (they're still adjusting to the transitions too). \n\nFrom a post grad research hiring perspective, we know how hard this time is for students and take that into considerations.", "author": "HappyHrHero", "created": 1632545823, "upvotes": 23}, "he6krn6": {"link": "/r/GradSchool/comments/puz9tv/grad_school_in_the_pandemic_anyone_else_feel/he6krn6/", "text": "I feel the emotions of intimidation and annoyance and anger, started my masters at the same time as you. However in this second year things have been a lot better, my classes are all IRL and things have come back to normal. Maybe if your university isn’t operating the way you need you could consider a deferral? But on the other hand it might be worthwhile to just get through it and look for good job opportunities on the other side?", "author": "RedJoan333", "created": 1632543679, "upvotes": 16}}}