{
  "sid": "pzexv4",
  "link": "/r/GradSchool/comments/pzexv4/highmidlow_rank_schools/",
  "title:": "High/Mid/Low rank schools",
  "text": "So this might sound like a dumb question but how do you differentiate among high/mid/low rank schools based on world rankings? Like from which rank to which are high,mid and low? (I’m planning for MS in CS)",
  "author": "GoddessaOfChaos",
  "created": 1633115548,
  "updated": 1634100011,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hf1otmv": {
      "link": "/r/GradSchool/comments/pzexv4/highmidlow_rank_schools/hf1otmv/",
      "text": "I would say top 10 is high, maybe 11-40 is mid, and below 40 is low?\n\nReally depends on your field though.  Not sure how many schools are in your field or what your goals are or your frame of reference for what schools are likely your “easy schools to get into” vs “hard schools to get into.”\n\nHigh vs low rank depends highly on that frame of reference.",
      "author": "Weekly-Ad353",
      "created": 1633138734,
      "upvotes": 1,
      "replies": {
        "hf2nsre": {
          "link": "/r/GradSchool/comments/pzexv4/highmidlow_rank_schools/hf2nsre/",
          "text": "I’m in CS and I was looking at the world rankings actually,I’m keeping first thousand schools in consideration",
          "author": "GoddessaOfChaos",
          "created": 1633161102,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hf3oi3i": {
      "link": "/r/GradSchool/comments/pzexv4/highmidlow_rank_schools/hf3oi3i/",
      "text": "I disagree. Basically there is the top top tier that’s like the first 5. Then the top tier that’s like 6-15. These are renowned universities that have stellar technicals. Berkeley is typically in this group. It’s not Harvard. But no one getting a PhD from Harvard or Princeton is any better. It’s the same books. Then like 15-30 is a bit of drop off in terms of the quality of the professors. Then 30-100 is the lowest tier.",
      "author": "LegallyThrownFarAway",
      "created": 1633185244,
      "upvotes": 1,
      "replies": {
        "hf433pp": {
          "link": "/r/GradSchool/comments/pzexv4/highmidlow_rank_schools/hf433pp/",
          "text": "Does that hold water for world rankings too?",
          "author": "GoddessaOfChaos",
          "created": 1633191770,
          "upvotes": 1,
          "replies": {
            "hf48blj": {
              "link": "/r/GradSchool/comments/pzexv4/highmidlow_rank_schools/hf48blj/",
              "text": "You know this is probably not going to go over well. But in general, my opinion is that world rankings are perhaps inaccurate in how they predict performance after grad school and perhaps have more to do with politics than people realize. It’s been my experience that PhDs from US universities tend to out perform other countries. Now that’s just my experience. I think US PhDs tend to be longer and more research focused so the people that make it out tend to be better prepared for experimental research. Perhaps that’s less true for theorists. But in my field that is my experience.",
              "author": "LegallyThrownFarAway",
              "created": 1633193980,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}