{"sid": "pluwo6", "link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/", "title:": "I worked and stressed so hard to get into grad school and now...", "text": "Now I'm immobilized by fear. This is the first week. I have 2 small assignments to complete and 3 different chapter reading plus preparation for my first TA session of a new subject area to complete for submission/ instruction next week. I thought I'd be self motivated for this, I want it so bad. \n\nI also, just can't get up.\n\n\n\nUpdate: Listen, I can't thank you all enough for your support. Thanks to the advice given I found the motivation to get up, make that list and get to scratching things off (super fulfilling btw). I'll leave the post up in case anyone needs encouragement later and for me to reread when things get tough. It's good to know that I'm not an isolated case, I'm not crazy and I'm not alone. ♥️\n\nI noticed alot of persons seem to be slipping into depression and just pushing through because, well, you're already here but please reach out to student counseling resources. Mental health can be a slippery slope. I want us all to achieve our best. You can dm me if you'd like to chat but I am not a therapist/ counselor and can only give basic encourage and advice.", "author": "lavender-trainer", "created": 1631312007, "retrieved": 1632844631, "over_18": false, "upvotes": 184, "upvote_ratio": 0.97, "comments": {"hcg9tcr": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcg9tcr/", "text": "Connect with your cohort, chances are most of them are feeling the same/similar. The first week disbelief hit hard but now I'm motivated to work with these folks to succeed. Collective big brain time.", "author": "a-deer-fox", "created": 1631378245, "upvotes": 2}, "hcfvinr": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcfvinr/", "text": "First year or so is pretty rough until you get used to the workload.  Good luck.", "author": "demerdar", "created": 1631371983, "upvotes": 3}, "hcefgy9": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcefgy9/", "text": "I’m in the same boat as you. First week of grad school, first session of TA next week, and a few short assignments. I’m freaking out as well… but there are many great comments coming from wise individuals in this discussion. I break up my day in chunks. Work on one thing at a time. Make that list! And don’t forget to TAKE BREAKS. I can’t stress that enough. Don’t stare at a screen for two hours. Drink water. Take a small walk. Watch an episode of something. Then get back to work. Oh, and don’t procrastinate (or try not to). If you fall behind on something, you will have a hard time catching up. (I used this routine when I was a research assistant back in my undergrad… my supervisor was basically prepping me for grad school, and this method worked well). \n\nI wish you the best of luck. You got this. remember how hard you worked as an undergrad. I don’t know you but I believe in you!", "author": "Meanwhile_1994", "created": 1631334986, "upvotes": 5}, "hcecynp": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcecynp/", "text": "It sounds like you're carrying a large burden of expectation, that's going to make you tired. Work hard, listen to your body, and rest well, then your energy will shine", "author": "PeaceAndPrajna", "created": 1631333376, "upvotes": 6}, "hceazfa": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hceazfa/", "text": "I feel so similarly. I've only done 1 week and have already had an actual mental breakdown. I considered dropping out! And that was only on orientation day!! But I'm going to keep pushing forward. Baby steps!", "author": "symmetryfairy", "created": 1631332175, "upvotes": 10}, "hce5wym": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hce5wym/", "text": "One day at a time! You can do it. The school certainly thinks you can, they accepted you. Time to show them they were right.", "author": "Historical-Young-464", "created": 1631329268, "upvotes": 6}, "hce31ub": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hce31ub/", "text": "Enjoy this stage. In a few years, the fear may leave and only indifference remains.\n-a bitter grad student", "author": "performanceburst", "created": 1631327720, "upvotes": 15}, "hcdz93t": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcdz93t/", "text": "Yup I'm at that state right now. What I do is break everything into small chunks. If your assignment has 5 problems and is due in 7 days, say \"I will finish problem 1 on the first day, 2 and 3 on day 2 etc.\" This way u have accomplished your part of the project and u feel good and confident about that. Remember break these goals down into smaller, but also DOABLE parts. Make sure u can do them. Other wise u will feel bad for not completing it. Also, remember to do fun things too, watch a movie, get ice cream, get ur favorite coffee.", "author": "Melon_Lord_13", "created": 1631325746, "upvotes": 17}, "hcdxwdy": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcdxwdy/", "text": "I completely understand. I went through something similar. On my 3rd week and I’m still shocked about the whole experience", "author": "darlababy", "created": 1631325055, "upvotes": 4}, "hcdxjvx": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcdxjvx/", "text": "Always, always, always pace yourself. Not trying to be sound obvious, but most often I have learned as a graduate student that one small task may or may not be the most ambitious to your productivity, but it is the most necessary in order to tackle big tasks.", "author": "gabe89san", "created": 1631324876, "upvotes": 4}, "hcdlj0a": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcdlj0a/", "text": "This is normal. You're going to make mistakes, and very soon you won't have time to worry anyway! One thing at a time.", "author": "iliveinyoureyelid", "created": 1631318763, "upvotes": 28}, "hcddhrq": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcddhrq/", "text": "One thing at a time. You can do this!", "author": "RonnyTwoShoes", "created": 1631314778, "upvotes": 18}, "hcd9oqy": {"link": "/r/GradSchool/comments/pluwo6/i_worked_and_stressed_so_hard_to_get_into_grad/hcd9oqy/", "text": "Welcome to grad school!!!! Make a list, break down your tasks into small chunks, space them out, find your most productive time and get work done, don't panic you can do this!!", "author": "MAE2021JM", "created": 1631312946, "upvotes": 131}}}