{
  "sid": "qdsxi5",
  "link": "/r/GradSchool/comments/qdsxi5/turned_in_an_assignment_late/",
  "title:": "Turned in an assignment late",
  "text": "I feel so dumb :( I’m taking an online grad school class and am hoping to apply for my masters, so was taking the class because the subject is good to know for my job and to test the waters and see if I am ok with online classes. We had an assignment due Sunday night and it took way longer than expected because my computer was so slow. Like parts of the assignment that should have taken 2 hours max took me 12. I thought I would have plenty of time to finish but it took so long that I turned it in almost an hour after the midnight deadline. At the time I was so stressed that I didn’t send any emails or anything (literally up until the deadline I kept thinking I could still make it and the computer got slower and slower) and didn’t want to turn it in with almost nothing done so I submitted late. I didn’t feel I had a good excuse so I didn’t send any emails or anything but now I realize I absolutely should have just sent an email to explain. The term ends tomorrow and I still don’t have a grade back for it (it doesn’t say 0, but also just hadn’t been returned). \n\nShould I even bother sending an email at this point (5 days later)? I’m not expecting them to waive the late penalty or anything but it finally hit me today that it looks so bad I didn’t even send an email when I submitted saying something like “I’m so sorry I submitted late, I ran into computer trouble and hope you will still accept it.” If I was actually enrolled I wouldn’t be so worried but I’m freaked out as I will need to submit my grade when I apply to schools this month. I’ve gotten a 100% on my other assignments and all but one of my quizzes 😞",
  "author": "notgoodenoughforjob",
  "created": 1634945033,
  "updated": 1635185386,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hhqvav2": {
      "link": "/r/GradSchool/comments/qdsxi5/turned_in_an_assignment_late/hhqvav2/",
      "text": "You can, but emailing so long after the due date isn't a good look. In the future, email early if you need an extension or are running into issues",
      "author": "ItWasntRigged",
      "created": 1635000278,
      "upvotes": 2,
      "replies": {}
    }
  }
}