{
  "sid": "q88e1k",
  "link": "/r/GradSchool/comments/q88e1k/british_permanent_resident_in_canada/",
  "title:": "British Permanent Resident in Canada.",
  "text": "Hi\n\nOriginally from the UK, moved across to Canada in 2015. I have a four-year Integrated Undergraduate/Masters from the University of Plymouth in the UK. ([https://www.plymouth.ac.uk/courses/undergraduate/mpsych-advanced-psychology](https://www.plymouth.ac.uk/courses/undergraduate/mpsych-advanced-psychology)) Yes i know that's weird but it is seen as a masters-level qualification in the UK! I recently got it assessed by our overseeing body up here, and they gave me 144 credits total.\n\nInitially after graduating, I went travelling (remember those days?!) and lived in Aus/NZ for a few years before moving here. I have since racked up three years clinical therapy experience, and two more as research therapist working for a University over here studying the development of Psychosis. I have been a part of some ground-breaking international studies, although I don't have my name specifically on any of the publications. My supervisor is in the top 1% in her field and I have an unbelievable lab team, so my references when i ask for them should be top dollar.\n\nHowever, when converted, my calculated GPA is a 2.9 on a 4.0 scale. (I should not have gone to university before the age of 22, I was not ready maturity-wise!)\n\nDoes this basically render me inadmissible to pursuing my Doctorate degree here? Or in peoples experience does the work experience I have been a part of help universities overlook such a thing?\n\nSorry if this is a dumb question, I'm totally a fish out of water when it comes to understanding this process on this side of the pond!\n\nCheers all!",
  "author": "CanadianFox94",
  "created": 1634244250,
  "updated": 1634602617,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgrz0uy": {
      "link": "/r/GradSchool/comments/q88e1k/british_permanent_resident_in_canada/hgrz0uy/",
      "text": "While 2.9 does seem very low for grad school admissions, it is not necessarily enough to make you inadmissible to *any* doctoral Psychology program in Canada.\n\nIt is important to note that while GPA is a factor considered in pretty much all admissions decisions, it just one factor. Furthermore, GPA tends to play a smaller role the further into academia you go. At the doctoral level, I would argue that factors such as whether or not an applicant has previous publications, the contents of their previous formal education, previous professional experience, and the applicant's areas of interest and how well these areas match up to potential supervisors are far more important.\n\nObviously, places in doctoral programs can be very competitive and Psychology is a highly competitive field, at least in Canada. You need to understand that part of applying to these programs is making yourself a desirable candidate. I would take a personal inventory of where you are at professional and in your education. Some ways to make yourself more desirable as an applicant may be pursuing further education before applying (this would give you the chance to show that you are capable of scoring higher), working in a position directly related to what you hope to be pursuing, and publishing in relevant and highly regarded journals.\n\nEdit: Another point to keep in mind is that GPA cutoffs are typically used by programs which are inundated with applications every intake. GPA is often used to cut down the stacks of applications which need to be reviewed by humans. As such, I would not recommend applying to UToronto (which is both the highest ranked post-secondary institution in Canada, and has the highest ranked Psychiatry/Psychology program in Canada) with a 2.9, simply because I highly doubt it would even make it to a human through the automated system they use.",
      "author": "Laovvi",
      "created": 1634326496,
      "upvotes": 1,
      "replies": {}
    }
  }
}