{
  "sid": "otg8j7",
  "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/",
  "title:": "I'm not that ambitious. Can anyone else relate?",
  "text": "I'm starting grad school (urban planning) in less than a month and I've come to the conclusion that I'm just not *that* ambitious of a person. As I am preparing, I see the people in my program practically killing themselves just to cram experience into their resume or get access to that connection of a connection of a connection. And while I understand why someone would need to do this for financial reasons or maybe even personal interest, I am just really perplexed at how many unpaid hours of work people are doing for practically no reward in return. I also see this in grad school forums and on Reddit - it seems like so many grad students are obsessed with productivity and ambition, even when it doesn't benefit them.\n\nI seriously admire people who are ambitious in this way. I always thought I was that person, but as years go by I *clearly* am not. I'm really interested in and passionate about what I will be studying, I'm a hard worker that produces good work, and I've done a good job at staying on track in life, but I just can't relate to the amount of work and dedication that seems to be expected out of people in grad school. It's a very weird culture that I guess I'm not used to yet.\n\nCan anyone else relate?",
  "author": "morose_bug",
  "created": 1627497954,
  "over_18": false,
  "upvotes": 488,
  "upvote_ratio": 1.0,
  "comments": {
    "h8vnf2z": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h8vnf2z/",
      "text": "I've worried a lot about this in the leadup to my grad program next month. I keep seeing the other students in my cohort post about their previous experience w/international organizations, their already-secured post-grad jobs, and their plans for field research. Meanwhile, I want to move back home and teach high school after graduation.",
      "author": "ThadeusOfNazereth",
      "created": 1628918872,
      "upvotes": 2,
      "replies": {}
    },
    "h8u6alm": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h8u6alm/",
      "text": "Found this, I’m thinking of getting a masters in urban planning too. I’m also the type that just kinda gets stuff done but doesn’t go crazy with my workload, ahh it’s crazy to even think about grad school lol",
      "author": "ayerk131",
      "created": 1628891847,
      "upvotes": 2,
      "replies": {}
    },
    "h7ppb69": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h7ppb69/",
      "text": "I'm also working on my masters in urban planning (going into what is hopefully my last semester), and I completely understand what you are saying. All through undergrad and my first year or so of grad school, I was the one that was practically killing myself - I was so focused on being the best of the best that if I was not the highest achieving member of my cohort I was mentally unable to handle it. After having made significant progress on my thesis and spending time working in the field outside of school, as well as getting treatment for mental illness/undiagnosed ADHD, school has become simply a means to an end for me. At this point, I love the work I do, the ideas I get to immerse myself in, and the connection between theory and practice in planning as a discipline, but it's merely one part of my life - along with my relationships with my partner and family, my hobbies and interests, traveling, and my friends. As a side note, if you ever want to talk planning, or have any questions about what to expect from planning school, I am happy to discuss with you! Good luck, don't sweat, and enjoy it!",
      "author": "fauxseptum",
      "created": 1628104810,
      "upvotes": 2,
      "replies": {}
    },
    "h6z85ir": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6z85ir/",
      "text": "Oh yeah totally. I just like my work, idgaf about being famous or the best. I just wanna enjoy what I do, not make it my identity or place my value in it.",
      "author": "rtxj89",
      "created": 1627578992,
      "upvotes": 2,
      "replies": {}
    },
    "h6ygsrz": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6ygsrz/",
      "text": "As others have said, don't stress about it. It's incredibly unusual that outside of academia anyone would ever care about your GPA in grad school, and if they do it's highly likely that there are other things to worry about there. If you can graduate and keep the workload at a decent level of management then do it. Don't stress about it!\n\nSource: Worked myself silly for straight A's the first few semesters, talked to a ton of people about this same issue, and got the same response from everyone that I highly respect. I now have 25% of the stress and a B+ average. No one who matters cares about your GPA.",
      "author": "CorpsKernel",
      "created": 1627567392,
      "upvotes": 3,
      "replies": {}
    },
    "h6yg9xc": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6yg9xc/",
      "text": "Hey, I'm at the tail end of a PhD in planning, and I can relate...I would say I'm maybe only the #6 person in the world in order of wanting me to finish, after my advisor, department chair, wife, and parents.\n\nI would say it depends on what you want to do. If you want a TT faculty job in this field, the reality is you probably do need to be laser-focused on putting together a good dissertation and networking. It's the nature of the job market. Back when I thought I wanted that, I applied to 30+ positions and did not even get to the screening interview stage, even though multiple profs in my department (which is \\~top 5 in as much that is a thing in Planning) have said I'm \"one of the best that has ever come through the program\".\n\nIf you want an industry/nonprofit/government job, then yeah, just be you, learn whatever skills seem interesting. But still make sure you're on track to finish, or you'll end up like me in year 7+ (this is a moot point if you're in a masters program). Also probably still need to network, if only just to get a good view of the opportunities that might be out there.\n\n&#x200B;\n\n\\*EDIT to add context. Regarding my job search remarks, the point is that I am probably more like you. I was less ambitious, didn't really focus on publishing a coherent body of work, and kind of just pursued things that were interesting to me. This included teaching a few different classes, doing research on a few disparate topics, taking a couple of interesting internships, all at a pace that allowed me to also maintain a good social life, get married, do lots of recreational travel and so on. I'm happy, but, not marketable for academia. So just be aware.",
      "author": "NoFascistAgreements",
      "created": 1627567147,
      "upvotes": 3,
      "replies": {}
    },
    "h6yaqsp": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6yaqsp/",
      "text": "The fact you Are headed to grad school alone says you are ambitious.  Don't spend too much time comparing yourself to others.  I used to do this all the time and always thought I was doing something wrong since they were studying more than I was, always trying to be busy, etc.  Then I realized I was getting the same grades as there were and had essentially the same CV.  \nJust because someone appears to be working hard doesn't mean they are working efficiently.  Remember that old SAT question, \" if person A takes 5 hours and person B takes 8 hours?\" It's basically the same thing as that.  Why spend 8 hours on a 5 hour job?",
      "author": "ozzykp06",
      "created": 1627564458,
      "upvotes": 3,
      "replies": {}
    },
    "h6xzile": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xzile/",
      "text": "I was ambitious until I got to the point where I'm almost completing my degree. I totally relate. I'm just present,hoping to finish up but super demotivated. I think it's okay to feel that way sometimes, nothing's ever that simple as per say.",
      "author": "swimming-freak",
      "created": 1627557844,
      "upvotes": 4,
      "replies": {}
    },
    "h6xyi0r": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xyi0r/",
      "text": "I can definitely relate to this lmao. I'm in a very competitive field (CS - machine learning) and everyone around me and everyone I hear of literally pour in 80-90 hours of work per week. All they talk about is research research what the newest paper is this idea that idea. I mean, I think they're great and I have a lot of respect for them. I'm just not that kind of person.\n\nI'm from an Asian country and am getting ready to apply for PhD programs abroad. My priority is 1) being able to get along with my advisor and colleagues and 2) enjoy the area I'll be living in. That means that I don't really put a huge emphasis on things like school name or prestige or churning out 2-3 papers a year. Everyone around me can't understand and think I'm \"unmotivated.\"",
      "author": "Seankala",
      "created": 1627557113,
      "upvotes": 3,
      "replies": {}
    },
    "h6xv0hj": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xv0hj/",
      "text": "Interesting. Although most people I encounter in grad school are not so ambitious, they have a life and are mindful of having a work-life balance. Well, I'm one of those ambitious perfectionists who tend to overwork. I don't regret it, but I do envy people who enjoy while they work but don't overcommit.",
      "author": "Meluvis",
      "created": 1627554428,
      "upvotes": 2,
      "replies": {}
    },
    "h6xqbhu": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xqbhu/",
      "text": "Don't admire them, it's \"hustle culture\", it's toxic and it's harmful to themselves and others. It's not entirely their fault, systemic issues are to be blamed first and foremost, but hustle culture, both inside and outside academia, is something to avoid, and if you find yourself within it, something to save yourself from. (I don't want to sound harsh to individuals that find themselves in positions where they *have* to hustle, I understand that it's not always an option to work at healthy doses. I am however critical of those who try to push hustle culture as cool or proper work or desirable. That's nonsense.)\n\nI am personally here because I am curious and I want to do science. I want to be a scientist and a philospher (in the sense that every science is a child of philosophy and every scientist needs to be aware of philosophy as a history and as a method). It's been my dream since childhood, or more like it's felt like the most natural place to be for me, or for me to be me. Of course there's some disillusionment as I meet the realities of academia...\n\nOther than what research they do, I don't care what others do, achieve, acquire, conquer, or whatever. Or how \"smart\" or \"gifted\" they are, which are concepts I don't believe in (I've been the \"gifted kid\", it's bs). So long as I'm in a relaxed, laid back, but honest institution, and in company of honest, ethical and cheerful colleagues, I'm happy, so that's what I'm shooting for as a grad student. I have no interest in competing or building a shiny CV, which IMHO is a distraction from the beauty of science.\n\nMaybe sounds silly and epicurean, but that's what it is for me. So yeah, I really really relate, tho I'm lucky to be in a fairly cozy and humane small department that doesn't hustle.",
      "author": "gkayaalp",
      "created": 1627550384,
      "upvotes": 3,
      "replies": {}
    },
    "h6xq2rd": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xq2rd/",
      "text": "I honestly just want to finish grad school to go sleep",
      "author": "somilikeit",
      "created": 1627550170,
      "upvotes": 4,
      "replies": {}
    },
    "h6xpqtq": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xpqtq/",
      "text": "I did a lot of extra grind in undergrad to beef up my CV and get somewhere nice. I expected that, when I start the PhD, it's gonna be 2/3 creative and smart work, and 1/3 grind. Joke's on me, it's the opposite at best. \n\nI know I can do the ambitious thing because I did before, but if it's for sake of career building or impressing others, nah. That's just en route to burnout without having created anything.",
      "author": "kvragu",
      "created": 1627549868,
      "upvotes": 3,
      "replies": {}
    },
    "h6xpclh": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xpclh/",
      "text": "I often look at the difference between grad students and wonder how much class difference comes into this.\n\nWho had to slave away for minimum wage since they were teenagers? Who had to pay for their own education and possibly go into debt?\n\nWho was born into an elite family and has had everything paid for them by the parental units? Who has never held a 9-5 job they hate out there in the real world?\n\nI wonder which students are \"ambitious\" because they have zero safety net if they fail. I wonder which students kill themselves due to expectations of their elite families. I wonder which students are chill because they, ultimately, are financially secure no matter the outcome.",
      "author": "drunkinmidget",
      "created": 1627549516,
      "upvotes": 7,
      "replies": {}
    },
    "h6xm4th": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xm4th/",
      "text": "You admire them? I saw at them as sad fools that stay in academia making minimum wage forever. I admired people that were able to get shit done and have a life outside of work. I tried to emulate them instead of the sad worker bees",
      "author": "resorcinarene",
      "created": 1627546663,
      "upvotes": 2,
      "replies": {}
    },
    "h6xlamn": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xlamn/",
      "text": "Same feels. I'm in a STEM programme, and I just want to look good, read books, exercise, learn music and get laid regularly.\nI love my subject and I like reading papers during my leisure sometimes too, but I'm only looking to get a mediocre job so I never feel obligated to push myself to produce results.",
      "author": "Necromancer_Jade",
      "created": 1627545919,
      "upvotes": 3,
      "replies": {}
    },
    "h6x8qjj": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6x8qjj/",
      "text": "I have talked about this a lot with grad school mates. We usually are amazed at some of the PIs in our labs, seeing their work rythm and how they seem to seamlessly plan a lot of different projects, read papers as if they were tweets, coordinate labs with PhDs, postdocs, undergrads, international collaborators, review papers for journals... Now I understand that these are the things researchers usually do, but some of them just take it to another level – I really don't know how to explain it better. \n\nThe thing is, not everyone needs/wants to reach that level. Not everyone wants to be the best in their field, and certainly the system does not need that. 'Intermediate' levels are totally necessary, people that are in the labs R running the experiments and collecting data.",
      "author": "rorroverlord",
      "created": 1627535955,
      "upvotes": 7,
      "replies": {}
    },
    "h6x6rnt": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6x6rnt/",
      "text": "Our world is totally fucked. Your only job in life is to enjoy it for yourself. So make of that what you will for your ambition.",
      "author": "jburkek",
      "created": 1627534636,
      "upvotes": 2,
      "replies": {}
    },
    "h6x4myw": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6x4myw/",
      "text": "That's not ambition. It's stupidity,.",
      "author": "RuthlessKittyKat",
      "created": 1627533253,
      "upvotes": 6,
      "replies": {}
    },
    "h6wyuvc": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wyuvc/",
      "text": "I would feel the same way were I going to grad school for urban planning lol",
      "author": "Dear-Joke-1700",
      "created": 1627529839,
      "upvotes": -4,
      "replies": {}
    },
    "h6wy9j6": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wy9j6/",
      "text": "I could see how this might be an advantage. The mindset could help set your expectations to be more realistic and think strategically rather than making sure you've slaved enough hours away.\n\nAlso, your soul doesn't get crushed when you don't make a world-changing discovery as a grad student 🙃.",
      "author": "PaulthePhD",
      "created": 1627529508,
      "upvotes": 4,
      "replies": {}
    },
    "h6wxmwn": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wxmwn/",
      "text": "Honestly I don't associate my unwillingness to kill myself working or cram my resume with me having a lack of \"ambition\". \n\nAlthough perhaps that's because to me this is a word that  has been dirtied with the stink of \"hustle culture\" and capitalist propaganda.\n\nThat aside, I often feel that the people working like this have a kind of anxiety that I do not envy. Also, because it tends to be more focused on numbers of hours rather than outcomes it makes more meaningful work less likely.\n\nNow this definitely doesn't apply to all cases. Some people are just machines - like a Da Vinci or Von Neumann - but I don't think that applies to most of these people overworking.",
      "author": "drcopus",
      "created": 1627529163,
      "upvotes": 9,
      "replies": {}
    },
    "h6wvb8y": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wvb8y/",
      "text": "I've got one year left\n\nEveryone around me seems so much more dedicated, but I'm doing well enough grade wise\n\nI just want to live a comfortable life and play d&d on the weekends",
      "author": "Stumphead101",
      "created": 1627527912,
      "upvotes": 7,
      "replies": {}
    },
    "h6wt5si": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wt5si/",
      "text": "I wasn't one of those people that did countless hours of unpaid labor just for a bullet point on a CV, but I was definitely super ambitious and pursued opportunities and set myself up to pursue opportunities in the future. However, a couple years ago when I went home for Christmas I was talking to my parents and just kind of realized that they're *old*. Then I started to think about Christmases in the future. If I come home once a year, that means I'll probably see my parents about 15-20 times before they *die.* Since then, I've mostly been focused on just graduating and seeing what my options are that provide the best balance of income and quality of life. I want to be able to spend as much time as possible with my family while I still actually have family.",
      "author": "False-Guess",
      "created": 1627526785,
      "upvotes": 19,
      "replies": {
        "h6xr4st": {
          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xr4st/",
          "text": "Seeing your parents 15-20 times...when you put it like that it's truly startling.\nThank you for the wake up call.",
          "author": "Shinyshineshine",
          "created": 1627551117,
          "upvotes": 13,
          "replies": {}
        },
        "h6yj2bh": {
          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6yj2bh/",
          "text": ".... Yeah maybe not even that much depending on whether something happens. Some of my HS classmates have already lost their parents to health conditions. In undergrad it never even occured to me that my time was limited and I'd work 12+ hour days, barely call, find reasons to get out of going home for holidays. But these days I'm 10000000% in agreement with everything you wrote and aiming for a similar balance. I've had too low income for too long, can't visit or join them on trips. \n\nidk if it was the zoom lighting or actually saying out loud \"well you're both 60 now so you're in a higher COVID risk category so... \" but my parents suddenly looked more like my grandparents than my actual parents and I panicked",
          "author": "lithobius1814",
          "created": 1627568440,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h6wryai": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wryai/",
      "text": "I literally want to finish my PhD and then do fuck all for about a year.",
      "author": "rasarota",
      "created": 1627526164,
      "upvotes": 10,
      "replies": {}
    },
    "h6wpo3e": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wpo3e/",
      "text": "I very much relate! I have zero interest in working 80 hours a week and if that means I'll never be the hot researcher in my field, oh well! I'm content with my life and I certainly have a drive to achieve but not nearly as much as many academics.",
      "author": "queennbee",
      "created": 1627525023,
      "upvotes": 9,
      "replies": {}
    },
    "h6woxv3": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6woxv3/",
      "text": "I think for myself, a lot of my “ambition “ faded away as my life was fulfilled in other ways. In undergrad, I was completing an engineering degree in 3 years, doing an internship at NASA, helping a professor with research, and graduating with a 4.0. School was my life. I didn’t really have good friends, hobbies, or goals other than being great at school. It was what defined me. I was the “smart” girl and I was obsessed with the title.\n\nOnce I graduated I started to define myself in other ways. I have a great SO now, hobbies, and friends I hang out often with. It just feels like school isn’t that important to me now. It’s just a tool to help me advance at work long as I can simply pass. I took nearly 7 years to go back for my master’s , which was not what undergrad me would’ve thought would happen. Not to say that everyone who is killing them self for academia is like this, just my experience! I must admit that I’m so much happier in my current outlook!",
      "author": "idontknowwhattodo93",
      "created": 1627524661,
      "upvotes": 8,
      "replies": {}
    },
    "h6wofmt": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wofmt/",
      "text": "Late to the party but this exact same thing happened to me.\n\n>I'm really interested in and passionate about what I will be studying, I'm a hard worker that produces good work, and I've done a good job at staying on track in life, but I just can't relate to the amount of work and dedication that seems to be expected out of people in grad school.  \n\nI could have written this part myself, I feel exactly the same way. I will add that my mental health issues (anxiety and depression) make that level of ambition seem improbable. I entered my program presenting a version of myself that didn't really exist anymore.. the 18-year-old eager and green undergrad who wanted to be a super-successful professor with a PhD before 30 and a house before 32... By the time I got into the program in Sept of 2020 (yes, I started grad school in the middle of the pandemic.. big mistake) I was not the same person I was when I submitted my application in January of 2020.\n\nI know I'm disappointing my advisor because I am not living up to the student I presented myself as when we first met... I feel guilty about that... I also feel weird that I'm not accomplishing as much as some of my peers (even though I know we're all on our own timeline blah blah blah)... I feel bad that I'm not contributing as much to my university/community as much I would have hoped...  It's really fucked with my psyche.... I wonder how much of it is because of COVID... anyway you're far from alone. You'll know deep in your heart if its right and worth it for you. Maybe you won't but will persist with the degree anyway... That's what I'm doing lol",
      "author": "Substantial_Potato",
      "created": 1627524411,
      "upvotes": 6,
      "replies": {
        "h6y1pco": {
          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6y1pco/",
          "text": "Man I relate to this so much.",
          "author": "Clutch_Hutch58",
          "created": 1627559310,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h6wm5g3": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wm5g3/",
      "text": "This conversation makes me feel so seen and safe. But yes I relate. Because of my lack of ambition, I’m almost sure I won’t be in academia lol.",
      "author": "raeee_0710",
      "created": 1627523331,
      "upvotes": 2,
      "replies": {}
    },
    "h6wcjei": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wcjei/",
      "text": "I am 100% in the same boat as you. Especially since the pandemic started, I've had more anxiety in general, and even having one or two meetings on Zoom a day drains me, and I barely have energy to do work. I'm about to start my 2nd year in my PhD program (atmospheric sciences), and I feel nowhere near as productive as other people. I've contemplated leaving, or finishing with the MS and starting to look at jobs. I really don't enjoy academia at all, and I already know I'm not going to stay in academia after grad school.",
      "author": "juliamarcc",
      "created": 1627518650,
      "upvotes": 7,
      "replies": {}
    },
    "h6wblsg": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wblsg/",
      "text": "Starting my 5th year and can completely relate. Besides super busy weeks of my RAship and a few weeks of the year over my time in my program (mid-terms, finals, qualifying exams, submitting a grant, etc), I can honestly say I work anywhere from 10-30 hours a week a given week, no more. But that's calculating time of genuine work, not \"I'm sitting at my computer for 8 hours a day and only working for 2\" kind of work. I see other people in my program complain/humble brag about how they're working 50+ hours but a lot of times it feels like they bring it on themselves and want to be viewed in a certain light for doing that. Me, I like having 3 day weekends almost every week, going out on the weekends, and traveling, and my work is not my life in anyway. And yet I've never had a complaint from anyone I work with! I think it's all about setting boundaries and knowing what you want your life to look like now, and in the future after graduating.",
      "author": "mashathemashedpotato",
      "created": 1627518189,
      "upvotes": 11,
      "replies": {}
    },
    "h6w985x": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w985x/",
      "text": "I’ve noticed this in my grad program. A lot of hyper ambitious people. One female in my group bragging about how over booked her calendar is and that she does an internship and works two jobs. I just don’t feel the need to congratulate people like that. I think the word you’re looking for to describe yourself is knowing how to set a boundary. I see all of these classmates doing internships and working 50 hours a week and I chose to just enter the workforce and move my way up. Does it suck (thinking I won’t get a fellowship right out of graduation), sometimes, but I know I’m not being taken advantage of as an “intern”. I know my limits and that I value having free time. I think you have different values and want different things out of life. All these other people will burn out. It’s also very difficult for me to equate hard work = success as my program is very much about “who you know” and networking. It’s very much useless to put in hours of work when someone who’s dad is a CFO will beat me out for an internship. Just facts that I’ve accepted. I can’t wait for this to be OVER.",
      "author": "9462353",
      "created": 1627517033,
      "upvotes": 4,
      "replies": {}
    },
    "h6w9859": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w9859/",
      "text": "As you said in the second paragraph, you like your field/research, and do a good job at it. Frankly, I think all those other people are the ones who are, as you put it, perplexing. If it's not for financial reasons, I also don't understand this kind of behavior. I think it's really fucked up, encourages burnout, and sets unrealistic expectations for current and future grad students.\n\nThe reason it happens is 1/ because under capitalism we're only valuable insofar as we can produce labor, even if we're not compensated (which, like you said, free labor is absurd, and while connections are great, but they don't pay the bills!) and 2/ because academia is an absolute cesspit. Profs encourage this because they benefit from us working ourselves into the ground, even as they know that it's for literally nothing given that there are little to no TT jobs on the other end. It's the whole \"if I suffered, so do you\" thing, combined with the fact that academia is really garbage at accommodating the current economic, labor, and social conditions of our world.\n\nHonestly, I hate it, and I think it makes us worse scholars and researchers. It's why I won't be getting a PhD in my field after my MA. I also don't think that it's even \"ambition,\" it's just fucked.\n\nedit: thank u for the award, kind stranger!! proud that my first award is for talking about the evils of capitalism 🤩",
      "author": "fluffy_seaotter",
      "created": 1627517033,
      "upvotes": 9,
      "replies": {}
    },
    "h6w92pd": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w92pd/",
      "text": "I've been so underpaid during grad school. Worked my ass off, and while I'm grateful for those experiences and people - they taught me what I like or don't, they made me a better person, and I learned so much - it was at the cost of a lot of anxiety and being burn out in my twenties. I'm tired already and my ambitions have become clearer and simpler. Just want to live well but able to being happy everyday instead of stressed under loads of work and pressure. You are so not wrong on your point.",
      "author": "SarahLynnRoy",
      "created": 1627516960,
      "upvotes": 6,
      "replies": {}
    },
    "h6w7sg7": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w7sg7/",
      "text": "Ambition can mean different things to different people. During grad school, I realized that my future plans were much more focused on having a family and being able to support them while still being part of their lives, rather than become an Ivy League tenured professor (or something stereotypically “ambitious”). I certainly don’t make as much money as someone in that position (but way better than postdoc), but I also come home at 5 every day and haven’t worked a night or weekend in years, and to me that matters much more.",
      "author": "azknight",
      "created": 1627516322,
      "upvotes": 38,
      "replies": {}
    },
    "h6w7jc2": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w7jc2/",
      "text": "I can totally relate. This is one of the main reasons, if not THE reason I decide to leave academia once I finish my PhD. I am not interested in competing with all those people. What's the point of realizing my full potential if it doesn't even benefit myself in a tangible way? I don't get any satisfaction from proving myself to others.",
      "author": "poor_phd_student",
      "created": 1627516195,
      "upvotes": 17,
      "replies": {}
    },
    "h6w74qf": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w74qf/",
      "text": "I can relate soooooooo much.  Like I want to work and get a decent job but at the end of the day that job does not care about you and if you fail they have no problem replacing you.  So why kill yourself for that? Just do what you have to to either stay the same or get a promotion and that all",
      "author": "Shrederjame",
      "created": 1627515997,
      "upvotes": 20,
      "replies": {}
    },
    "h6w6llr": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w6llr/",
      "text": "I worked my ass off in grad school, hoping to land a rare R1 TT position. Failed for multiple years on the job market. Ended up at a community college, which at one point I would have considered a sub-optimal outcome. \n\nYou know what, though? I ended up loving it. I rarely have to work more than 40 hours a week, I have great work-life balance, and I even get a little bit of research/writing done here or there. I wish I had slowed down during grad school because all of the stuff that I did to stand out, mattered little in the eyes of the hiring committee at the CC, which was mainly interested in finding out if I was passionate about teaching and would embrace the CC mission. I could have really enjoyed grad school, and ended up with fewer mental health problems, if I had been less ambitious.",
      "author": "growling_owl",
      "created": 1627515734,
      "upvotes": 52,
      "replies": {
        "h6xy28h": {
          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xy28h/",
          "text": "This. I feel that graduate students are held hostages to their advisor's and program's ambitions to the extent that they don't even have a second to think where their own interests and ambitions lie.",
          "author": "lostintranslation36",
          "created": 1627556793,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "h6w3lmk": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w3lmk/",
      "text": "I guess universities are hubs for networking and reccomendations, people will not know you if you don't put yourself out there.\n\nI am not a fan of the academic system whatsoever however more often than not, some people do not have anything to fill the void outside of their studies and so sink themselves into it as a distraction. That's what it was like for me anyway. But there is definately more to life than work. It's very easy to lose passion and get burnt out.",
      "author": "pikapika505",
      "created": 1627514281,
      "upvotes": 6,
      "replies": {}
    },
    "h6vajh8": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6vajh8/",
      "text": "I wouldn't really tie ambition and productivity together as one. I know what you mean about productivity, I also have many friends doing the same PhD program as I and some in my own lab that have such a powerful push to be productive: some work 12 hr days everyday and then come to the lab virtually every weekend, others are constantly reading papers in their free time at home, and others are going around looking for conferences that would benefit them the most in terms of knowledge, feedback, and networking. I don't do that, I binge work, sometimes 15 hrs in one day, others 6 hrs or even less, and I rarely come on weekends. I come home and I choose to not do anything science related (except of course when I'm just dying of curiosity to know the results of an experiment so I analyze at home). \n\nI've had one person accuse me of lacking ambition actually, and their reasoning was that I was not working hard enough to rise above and beyond everyone and eventually get a tenure track position. I found that hilarious, it's like saying an astronaut is not ambitious because they didn't try to become a president of their country. It's just a different career path, ambition is how far you want to reach in a given path of your choosing. If your career goal does not entail working to the same degree or in the same way as your colleagues, that does not mean you're not ambitious. My career goals lie in the industry, I don't even want to join academia, and for the industry, they look mostly at your skill bank, and not so much on how many nature papers you first authored (sorry if the reference is out of your field, I guess this is turning into a rant haha). \n\nBesides all that, in my experience, hard work plays a generally permissive role in success, it's not exactly linearly related to it. That is, more work =/= more success, but too little work = no success. In the life sciences for instance, honestly... An overwhelming proportion of the propensity to succeed has to do with luck in terms of getting the right research question, getting the high impact result (which is obviously out of your hands), and being in a good (and often rich) lab. So the way I see it.. I'm just gonna work hard enough to succeed in an excellent manner, but I'm not going to sacrifice my social life and physical and mental health for getting no guarantee of \"immense success and fame\" in the future.\n\nOne of the best pieces of advice I heard in grad school is that you should always resist the urge to compare yourself to others. Live your life by your own standards that you set for yourself, it doesn't matter how other people set their standards. At the end of the day, we each live in our own world, our own perception that cannot even possibly overlap with another perception, heck it can't even be communicated, so other people's opinions aren't even logically relevant. If you're satisfied with how your progress is, then it's all good. If your PI isn't, then maybe reconsider your standards, and if you think the expectations of your PI aren't realistic or fair or suitable to you, then reconsider your PI.",
      "author": "ahmadove",
      "created": 1627501475,
      "upvotes": 78,
      "replies": {}
    },
    "h6v912w": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6v912w/",
      "text": "Oh man, I relate so much to you. I see so many people killing themselves for grad school and all I can think of is that there must be something wrong with me because I think what they do is crazy. I like what I do sure, but it is not everything in life. I want to do other things like travel or just hang out. The academic culture is not what I want for my life. You sacrifice so much and I cannot help but wonder if in 10 years from now I am going to look back at this time and realize that maybe it was not all what it was hyped to be. \n\nI honestly cannot wait to move on from this.",
      "author": "a_wandering_Soul1720",
      "created": 1627500835,
      "upvotes": 207,
      "replies": {
        "h6ve4ye": {
          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6ve4ye/",
          "text": "I'm glad someone else is in the same boat. I absolutely hate academia - I feel like there are all these weird rules and politics that I don't understand and have no real bearing on my life but I am supposed to adhere to for some reason. My degree will represent more than a piece of paper to me, but, ultimately, it's not like it's *me*. This is just a chapter of my life (and a short one at that), that I am using to hopefully get to a better chapter. I don't feel like burning out or doing unnecessary work that could be replaced with self-growth, hobbies, friends and family, etc. in the process.",
          "author": "morose_bug",
          "created": 1627502991,
          "upvotes": 85,
          "replies": {
            "h6vqrtt": {
              "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6vqrtt/",
              "text": "[deleted]",
              "author": null,
              "created": 1627508366,
              "upvotes": 62,
              "replies": {
                "h6w8anx": {
                  "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6w8anx/",
                  "text": "This is basically my approach to things. Some people like to come and sit in the office for 8 hours a day, and a lot of the time they are unproductive anyway. I'll maybe show up for 3-4 hours a day, do what I have to do and go. At the end of the day, I don't get paid enough to even justify working 40 hours a week, and as long as I'm making progress toward my degree I'm good with it.",
                  "author": "cman674",
                  "created": 1627516574,
                  "upvotes": 42,
                  "replies": {
                    "h6xzafw": {
                      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xzafw/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1627557685,
                      "upvotes": 6,
                      "replies": {
                        "h6ypzdl": {
                          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6ypzdl/",
                          "text": "Exactly. And my PI doesn't ever actually know or care how long you are there, and neither does the rest of my group.",
                          "author": "cman674",
                          "created": 1627571473,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h6y37c3": {
                  "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6y37c3/",
                  "text": "When you wrote 95%, you spelled 100% wrong ;) It's others pushing to achieve 200%, don't think you're doing less than what's necessary.",
                  "author": null,
                  "created": 1627560251,
                  "upvotes": 3,
                  "replies": {
                    "h6y4mrd": {
                      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6y4mrd/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1627561131,
                      "upvotes": 3,
                      "replies": {
                        "h6y8yqr": {
                          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6y8yqr/",
                          "text": "That's been how we've done stuff as well. If it's a pita to get done, work around it. It can always be a further research project, or a recommendation for further research in the conclusions. Nobody's getting *all* research done...",
                          "author": null,
                          "created": 1627563522,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "h6yg9s2": {
                      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6yg9s2/",
                      "text": "95%, 100%, 200%... this framing is all wonky and doesn't make sense.\n\nNot enough, good enough, excellent execution, beyond what is expected or needed.",
                      "author": "CorpsKernel",
                      "created": 1627567146,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h6ves1p": {
          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6ves1p/",
          "text": "I see LOT of people going for industry jobs exactly because of this, academic culture is toxic and some people do find it worth the benefits for them but MANY people don't and find ways to make it work for them. I feel like we often say (often subtely) that people who go to grad school and end up in industry \"failed\" but honestly they probably have more $ and life balance! It's ok to do either if it fits you but we need to stop seeing it as a one solution fits all...people want and get different things from grad school and that's perfect.",
          "author": "579red",
          "created": 1627503263,
          "upvotes": 33,
          "replies": {}
        },
        "h6wqgtl": {
          "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6wqgtl/",
          "text": ">\tI honestly cannot wait to move on from this.\n\nDon’t worry, these people exist in the corporate world too.",
          "author": "Gambenis",
          "created": 1627525416,
          "upvotes": 14,
          "replies": {
            "h6x4r60": {
              "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6x4r60/",
              "text": "Literally it's the corporate ideology that's infected academia.",
              "author": "RuthlessKittyKat",
              "created": 1627533327,
              "upvotes": 11,
              "replies": {}
            },
            "h6z5wnb": {
              "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6z5wnb/",
              "text": "lol the world is like this no matter where you go. I guess maybe its just being tired of school and needing a change of scenery.",
              "author": "a_wandering_Soul1720",
              "created": 1627578066,
              "upvotes": 3,
              "replies": {}
            },
            "h6xm6bf": {
              "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6xm6bf/",
              "text": "But you are properly compensated in industry",
              "author": "resorcinarene",
              "created": 1627546699,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "h6v7aih": {
      "link": "/r/GradSchool/comments/otg8j7/im_not_that_ambitious_can_anyone_else_relate/h6v7aih/",
      "text": "I can’t relate but I see other people like yourself and I don’t think there’s anything wrong with not being ambitious…your journey is your own, just because someone else puts in more hours doesn’t mean you should too..it depends on the group manager/professor you work with though. My PI knows that everyone has their own way of doing things, so if I or somebody else puts in more hours, he won’t expect that from everyone. It’s also unfair to expect them to put in less hours if they’re really passionate about something. Just do you! Don’t compare yourself with others..",
      "author": "sciencenerd0392",
      "created": 1627500095,
      "upvotes": 18,
      "replies": {}
    }
  },
  "updated": 1634064970
}