{"sid": "pta5yq", "link": "/r/GradSchool/comments/pta5yq/discouraged_over_possibly_not_being_competitive/", "title:": "Discouraged over possibly not being competitive in careers away from the bench?", "text": "As the title suggests, I’m starting to feel very discouraged about being prepared for a career away from bench science. I am currently a fifth year student studying for my PhD in biochemistry and molecular biology. Despite being far along in my program, I don’t have any publications and don’t have a definitive graduation date. My experiences in grad school, especially during the pandemic, have convinced me that I’d like to move away from academia and bench science altogether in my future career. \n\nOne career area that’s super interesting to me is medical affairs or clinical science communication. However, when I read about how to be competitive for these jobs, they usually suggest having experience in a specific treatment area (my work kind of connects to some rare disease states, but it is in basic science) or having something else that makes you stand out from the candidate pool. I’ve tried to get involved in extracurricular stuff that relates to health and medicine, but with COVID still raging, it’s been tough to get started. \n\nWas I just screwed from the start on a potential career because I didn’t do clinical research? Up until the pandemic, I was all-in on teaching and outreach activities to prep for the tenure track - but now that I’ve given up on that dream, it feels like all the effort I spent there can’t be translated into doing something else. Like my potential PhD is going to be worthless for anything except being chained to the bench because I didn’t work hard enough to become “special” enough to escape it. \n\nIs there really any hope? How do I turn this around?", "author": "curvebreaker", "created": 1632325179, "retrieved": 1632952129, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hdw6iml": {"link": "/r/GradSchool/comments/pta5yq/discouraged_over_possibly_not_being_competitive/hdw6iml/", "text": "I'm only a fourth year PhD student, so I obviously can't attest to anything, but I definitely think you have time to turn it around!\n\nI recently began to consider a similar path, geared more towards science writing and communication (my background is in microbiology, so it seems like a good choice given the current state of the world). At least in my experience, there's a lot of virtual experiences you can find related to science communication. I was lucky enough to get connected with a great mentor, and have been writing online blog posts and article summaries. There's also opportunities to do virtual work through infographics, informational videos, or podcasts. I've also seen other people in my groups work on more public health related communication, sometimes working with high schools or creating pamphlets and stuff of that nature. Most of the people I work with aren't even in my area, and probably half of them are in other countries.\n\nFeel free to DM me and I can go into more specifics - best of luck!", "author": "gradhell123", "created": 1632349467, "upvotes": 2}, "hdvc71f": {"link": "/r/GradSchool/comments/pta5yq/discouraged_over_possibly_not_being_competitive/hdvc71f/", "text": "Get a job in the direction of your desired career field, as far shifted in that direction insofar as your experience allows.\n\nUse experience in that job to pivot after a while further over.\n\nRinse and repeat until you’re in an area that feels good.", "author": "Weekly-Ad353", "created": 1632332739, "upvotes": 1}}}