{
  "sid": "qi7eh2",
  "link": "/r/GradSchool/comments/qi7eh2/american_studying_in_denmark/",
  "title:": "American studying in Denmark",
  "text": "hi y'all I'm not sure if this is appropriate to ask here but I am getting desperate. I am an American studying my master's in Denmark (which has free education for EU and Danish citizens) but since I am non-EU, I have to pay tuition. I am desperately trying to find any kind of funding but I am at a loss. Every loan, grant, and scholarship I find is only for schools in the US or Canada and Denmark only has 1 governmental scholarship which I didn't receive. I am a woman in a STEM field, so usually there are good funding options but still everything I have found is for US-based schools. if this is the wrong place to post, I'll remove it. I'm just at a total loss and am trying to think outside the box. I'd appreciate any thoughts/suggestions but will also accept commiseration and pity lol",
  "author": "MissesMistoffelees",
  "created": 1635492890,
  "updated": 1636201569,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hijoelf": {
      "link": "/r/GradSchool/comments/qi7eh2/american_studying_in_denmark/hijoelf/",
      "text": "Is there an office for scholarships/student matter in your institution? If so maybe you are better off bringing it up with a person who knows the system better. There are usually lot's of European programs for women in STEM specifically but there are also funding opportunities for US citizens studying in the EU.  Anyway your best first option would be to discuss this with the administration there probably.",
      "author": "copenmath",
      "created": 1635532893,
      "upvotes": 2,
      "replies": {
        "himb1jf": {
          "link": "/r/GradSchool/comments/qi7eh2/american_studying_in_denmark/himb1jf/",
          "text": "unfortunately there’s not. I’ve been in touch with every office I can imagine is relevant and they’ve been pretty unhelpful. I understand the culture is different because people don’t need funds the same way, but I’ve basically been told “that’s not our problem”. Maybe I’ll look at it from an Americans in the EU perspective and find something that way, thanks",
          "author": "MissesMistoffelees",
          "created": 1635580715,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hijr5e1": {
      "link": "/r/GradSchool/comments/qi7eh2/american_studying_in_denmark/hijr5e1/",
      "text": "That’s a tough situation, sorry. Denmark works really well but only if you’re on the inside.\nTry asking in expat in Denmark  groups on Facebook or the Americans in Denmark group - they have a great community. Depending on your field there might also be research positions that would include options for covering tuitions.",
      "author": "LowCommercial9845",
      "created": 1635533992,
      "upvotes": 2,
      "replies": {
        "himb5gj": {
          "link": "/r/GradSchool/comments/qi7eh2/american_studying_in_denmark/himb5gj/",
          "text": "thanks for the commiseration and yes that’s a perfect way of describing it. I’ve asked in the expat groups and they’ve been lovely but basically concluded what I’ve found - there’s no help available",
          "author": "MissesMistoffelees",
          "created": 1635580807,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiu5944": {
      "link": "/r/GradSchool/comments/qi7eh2/american_studying_in_denmark/hiu5944/",
      "text": "You might consider applying for a Fulbright research grant. I don’t know much about it except that you have to have been accepted for a university graduate program abroad, which it sounds like you have. Tillykke! Held og Lykke! \n\nhttps://us.fulbrightonline.org/applicants/types-of-awards/study-research",
      "author": "momhasbipolar",
      "created": 1635731804,
      "upvotes": 1,
      "replies": {
        "hj4vtbd": {
          "link": "/r/GradSchool/comments/qi7eh2/american_studying_in_denmark/hj4vtbd/",
          "text": "thanks, my findings so far with fullbright are that it's only for the 2022-2023 school year and I'm only looking for funding the first half of 2022, but I will double check. thanks!!",
          "author": "MissesMistoffelees",
          "created": 1635939144,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}