{
  "sid": "c64w1m",
  "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/",
  "title:": "Grad School Can Be Fun!",
  "text": "I remember coming across this subreddit and r/chemistry five years ago. I see it hasn't changed much: A lot of grad students seem to come online to rant about how much their lives suck and about how terrible it is in grad school. It almost dissuaded me from pursuing my PhD back then. I'm *so glad* that it didn't.\n\nI'm an organic chemistry PhD student, and I have had the **time of my life** in grad school. My advisor is great, my labmates are great, my research is awesome, and I feel like I have a purpose. I'm really happy with what I've accomplished and discovered during my PhD studies. Grad school has been a really fucking interesting and engaging part of my life.\n\nI'm not going to write a super long, post, because I really have nothing to rant about. I just wanted to let people know that it's not all bad and, more importantly, that **grad school can be fun!**",
  "author": "PhDtoJD",
  "created": 1561638333,
  "over_18": false,
  "upvotes": 403,
  "upvote_ratio": 0.92,
  "comments": {
    "esavfzm": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/esavfzm/",
      "text": "I think it can be great. It's like going to college a second time except everyone is in their mid 20s  to early 30s and wants to talk about something you're interested in.",
      "author": "PeterMus",
      "created": 1561770001,
      "upvotes": 1,
      "replies": {}
    },
    "es90v7z": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es90v7z/",
      "text": "part of my research in considering grad school was purposefully digging through forums to hear people's stories (rants) to see what can go wrong, so I know what's out there.\n\nI knew going into it, the internet in general has a bias for people talking about negative stuff, cause positive stuff more rarely motivates people to talk about something.\n\nEven so it's easy to forget and think you have to be prepared to sacrifice your arm and soul to go through grad school. I should mention I have yet to talk to someone in real life who doesn't love grad school, whereas I rarely read a post on the internet who isn't absolutely suffering.\n\nThanks for this post!",
      "author": "_welcome",
      "created": 1561723638,
      "upvotes": 1,
      "replies": {}
    },
    "es8zmap": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es8zmap/",
      "text": "That's great! It sure can be fun. But you have to understand that, judging from other peoples experiences, you basically got lucky. Theres no way you could have known beforehand what your particular grad school experience would be like, and this is largely out of your control, which i think is the real take home point here. Unless you can see the future or something, or have delusions about your own abillity to make good life descisions...",
      "author": "Oppqrx",
      "created": 1561722304,
      "upvotes": 3,
      "replies": {}
    },
    "es7sl9j": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7sl9j/",
      "text": "I took a reading break by going onto Reddit for... More reading. Now I'm energized to go back to work!\n\nIn seriousness, I can't agree with you more though, OP. Grad school has given me the Tale of Two Cities, but I'd say it rather enriched my life and is/was the time I truly grew as an individual.\n\nGodspeed to the rest of your program!",
      "author": "ladypimo",
      "created": 1561678704,
      "upvotes": 2,
      "replies": {}
    },
    "es7qgjt": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7qgjt/",
      "text": ">I remember coming across this subreddit and [r/chemistry](https://www.reddit.com/r/chemistry/) five years ago. I see it hasn't changed much: A lot of grad students seem to come online to rant about how much their lives suck and about how terrible it is in grad school. It almost dissuaded me from pursuing my PhD back then. I'm *so glad* that it didn't. \n\nIs this hyperbole or true? Glad you enjoyed, many of us did. I wouldn't say it was 100% rosy all the time but pretty good most days.",
      "author": "wondert",
      "created": 1561677084,
      "upvotes": 1,
      "replies": {}
    },
    "es76lxw": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es76lxw/",
      "text": "I am in a hybrid Masters + PhD training centre (CDT) in the UK (1 year masters + 3 year PhD) and the majority of my masters year made me want to quit every single day. The course was overly basic and felt like an enormous waste of everyone’s time. They mostly repeated undergrad material and had labs that only catered to 1/3 of the course material (I also happen to be the least interested in that 1/3). I spent most of the first term depressed, regretting my decision to do a PhD and looking at jobs online that I could quit for. The only thing that kept me going was that I knew my centre gave us a lot of freedom for picking our own projects/supervisors once the masters year was over. \n\nBut honestly, since I started my PhD, I couldn’t have wished for it to go better. My supervisor is supportive, present and kind. They let me grow as a scientist by picking side-projects with collaborators (that have led to a publication and I’m still in my first year) which stretch my capabilities and always have relevance to my main project. \n\nI have enjoyed every second of my first year, and I’m actually excited about the research I do, and I know what the potential impacts are if it goes well. To top all of that, they’re aware I don’t want to go into academia and actively make an effort to help me develop skills which will make it easier for me to get a job in industry/outside of the field. \n\nGrad school can be incredibly tough, and I know my experience isn’t the norm, which saddens me. Academics should treat their students as their colleagues, not as expendable labourers whose emotional, physical and mental wellbeing are disregarded.",
      "author": "sciencebasedlife",
      "created": 1561664832,
      "upvotes": 2,
      "replies": {}
    },
    "es740wh": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es740wh/",
      "text": "I’m just a masters student in communications, but I agree. I mean I came here to hopefully have someone to come to for advice in case I ever come across something, but so far my first year has been great. I feel like grad school is where the real education begins, and being around so many like-minded people makes me feel less alone. It’s been a wonderful experience so far.",
      "author": "TK-07",
      "created": 1561663417,
      "upvotes": 1,
      "replies": {}
    },
    "es72eyo": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es72eyo/",
      "text": "Thanks for the positivity!",
      "author": "tinybluesatan",
      "created": 1561662503,
      "upvotes": 1,
      "replies": {}
    },
    "es6ru8j": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6ru8j/",
      "text": "I feel like a while ago there was a weekly \"success story\" thread. I think it'd be great to add that in again.",
      "author": "hausdorffparty",
      "created": 1561655941,
      "upvotes": 7,
      "replies": {}
    },
    "es6n5pa": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6n5pa/",
      "text": "How's grad school treating you? I've always hear orgo programs are somewhat...extreme? as far as they go in the chem field. Any advice you wish you were told in your last year of undergrad?\n\nI'm a senior chem undergrad with a year of gen eds left to complete. My plan is to start applying to PhD programs/GRE prep in physical chemistry next summer during a gap year. I'll have 2 years of in field research, a second name publication or two and  two solid letters of rec.",
      "author": "okatubishop",
      "created": 1561653044,
      "upvotes": 1,
      "replies": {
        "es6qjza": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6qjza/",
          "text": "It's a lot of hours, yes. I basically work 10-12 hours a day, six days a week. I force myself to take Saturday off.\n\nIt is so important to choose a good advisor. There are some groups that have a lot of internal competition, and there are a lot of advisors who are bad/incompetent lab managers. I think you should try to choose an advisor who you could be friends with, and you should choose a lab where the students seem to be happy.\n\nAsk the 4th-6th year students which labs to avoid. They know which advisors are bad.",
          "author": "PhDtoJD",
          "created": 1561655145,
          "upvotes": 3,
          "replies": {
            "es8dce9": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es8dce9/",
              "text": ">...work 10-12 hours a day, six days a week. I force myself to take Saturday off.\n\nbruh",
              "author": "zbutton",
              "created": 1561694199,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "es6mdtr": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6mdtr/",
      "text": "I also love grad school!! My PI is my ultimate mentor. I love working with him and the project he has me on right now is fascinating. I'm only staying with him for my masters and then getting a job. I hope he moves universities one day so I can do my PhD with him (I went from UG to my masters at the same university and I will have been with the lab a total of 3 years once I graduate so i can't stay here any longer). \n\n&#x200B;\n\nWhat really gets me down is everyone around me complains and talks about how terrible grad school is. I join along with the talk, but i absolutely fucking love it here. I am going to miss this experience when I graduate. Everyone gives in to the notion that it sucks, and I'm not saying it doesn't, its just we are so lucky to even have the option for a higher education degree. The work is hard, but we are developing ourselves as scientists, which is not an easy task.",
      "author": "mijellerose",
      "created": 1561652562,
      "upvotes": 1,
      "replies": {}
    },
    "es6lkj0": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6lkj0/",
      "text": "I’m starting a molecular biology PhD in August, I really hope my experience is as positive as yours!",
      "author": "microvan",
      "created": 1561652043,
      "upvotes": 3,
      "replies": {}
    },
    "es6dpk9": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6dpk9/",
      "text": "I don't think most grad students hate their lives. I think they hate the factors that are suboptimal regarding grad school. You're a half-adult living on shitty salary, your life is more or less governed by someone who may be unstable, and you can experience burnout in what is supposed to be your dream field. \n\nMy average day is great. I'm so thankful I'm not working a 9-5 job I hate. I don't mind taking my work home with me when it's engaging and interesting. I love talking about things with other grad students and spending time on campus. But when it's bad, it's *bad*. And with a regular job you can complain to anyone and everyone will commiserate. Grad school is unique and not everyone understands the complaints you have, so a unique space is nice to have.",
      "author": "JDaddyFly",
      "created": 1561646923,
      "upvotes": 11,
      "replies": {}
    },
    "es6d8tq": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6d8tq/",
      "text": "I also have had a mostly fantastic experience in my PhD. My master's was brutal though. I get it. This is a place where people have a shared experience, many of which include some really crummy situations. There is a systemic problem in grad school that amplifies this shared experience. In no other job do you get as much responsibility as we do (speaking of STEM not familiar with humanities) and  get paid as little as we do. Many of us are in situations where our advisers are seeking tenure and are either unaware that they are mistreating us, or completely willing to be total monsters. Regardless, It is nice to know that there are people that have dealt with these issues and are willing to offer advice from their own experiences.",
      "author": "Pop_pop_pop",
      "created": 1561646611,
      "upvotes": 2,
      "replies": {}
    },
    "es6cudj": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6cudj/",
      "text": "Same here. Grad school can and should be an enjoyable experience. And I’m someone who transferred out of a horrid abusive lab after 8 months. I think it’s a matter of putting yourself into good conditions - nice lab, good advisor, good peers. Unfortunately that’s not possible for everyone and sometimes you just get stuck, but when it works it WORKS.",
      "author": "ducbo",
      "created": 1561646345,
      "upvotes": 1,
      "replies": {}
    },
    "es6bvmf": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6bvmf/",
      "text": "I started grad school with an abusive advisor, quit, shopped around for a new advisor and school. I ended up with one of the most supportive and encouraging advisors. He also believes in the work-life balance, which is perfect for me as someone with a chronic illness. Grad school doesn't have to be about working yourself to death - it can be about working smart.",
      "author": "bottledutopia",
      "created": 1561645693,
      "upvotes": 24,
      "replies": {
        "es6djdv": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6djdv/",
          "text": "Agreed! I honestly tend to work only about 20-30 solid hours per week, I.e. undistracted “deep work”. more if I’m doing field stuff/teaching. But for many this would be sustainable. \n\nThat being said, I did transfer out of a heavy labwork lab where protocols could take up 40-60 hours a week (granted not all of it is “working” so much as waiting). \n\nI think one of the things people should ask themselves before going to grad school is how much time they want to sink/are able to work. When i realized I’m not willing to stain slides for 60 hours a week, I switched back to ecology. I can merrily catch wild specimens for 60 hours a week in the summer and work for 20-30 for the rest of the year, without reaching total exhaustion.",
          "author": "ducbo",
          "created": 1561646807,
          "upvotes": 12,
          "replies": {}
        },
        "es6cero": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6cero/",
          "text": "Good for you! My SO also switched labs because of an abusive and overbearing advisor. Better to get out than slog through it!",
          "author": "PhDtoJD",
          "created": 1561646052,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "es6a810": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6a810/",
      "text": "Starting my PhD program in two months. This gives me some hope. Glad you have enjoyed your work.",
      "author": "sgaw10",
      "created": 1561644556,
      "upvotes": 2,
      "replies": {
        "es7etkj": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7etkj/",
          "text": "I love grad school. Other than the pay it's much more rewarding than a \"real\" job. Make sure you pick an advisor based on the lab/group environment and not solely on their prestige. Definitely talk to and get advice from older students.\n\nAs much as I love grad school overall there are always going to be shitty times so you just have to keep in mind that things won't stay shitty. I wanted to drop out my first year and now I'm going into year four as happy as could be.",
          "author": "ImJustAverage",
          "created": 1561669408,
          "upvotes": 3,
          "replies": {
            "es7vqgy": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7vqgy/",
              "text": "Honestly, I'm optimistic about the pay because it's a hell of a lot more than what I'm making now. And I'm moving to a city with a lower cost of living, fortunately.\n\nThanks for the words. Great job on sticking with it.",
              "author": "sgaw10",
              "created": 1561681175,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "es67ly0": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es67ly0/",
      "text": "> come online to rant about how much their lives suck\n\nIt is not a rant. Just because you have a good advisor doesn't mean you can dismiss others who are legitimately voicing their dissatisfaction.\n\nI have a great advisor as well but I have seen several close friends in other universities suffering because they had advisors who exploited them and drove them out. I'm happy that you are happy but there is a problem with how poorly grad students are valued. Appreciate what you have but don't look down on someone who has no control over their life and the **only** thing they could do to feel some semblance of control is to make an online post. Have you ever been in that position? Can you empathize?\n\nIf someone was driven away from applying to grad school *just* because they read a bunch of online posts, that person was probably not well suited for grad school anyways.\n\nWhat you don't understand about this sub is that its not just \"GradSchool\" it is a place where people come for some support as well. Because literally no one in their real life tells them \"You can do it!\". But when someone comes here and makes a post about a bad day, there's people who give positive words of encouragement. Even though its anonymous, it gives a huge boost to their morale.\n\nYou haven't actually sat down and thought about all the different reasons why someone might come here (or any online forum for that matter) and make a post about something bad that's going on in their life. Your underlying message \"Grad school can be fun\" is something I agree with 100% but you could've said that without undermining the experiences other less fortunate people have had.",
      "author": "awhead",
      "created": 1561642652,
      "upvotes": 72,
      "replies": {
        "es6cytn": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6cytn/",
          "text": "Yeah, and there’s probably some bias in what gets reported. There are a few happy threads, but few people come here to say “my average day to day is pretty pleasant”. Most come here for support when struggling.",
          "author": "ducbo",
          "created": 1561646427,
          "upvotes": 21,
          "replies": {}
        },
        "es6cszw": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6cszw/",
          "text": "I'm sorry that you felt that I was dismissing or undermining the experiences of people who are having a rough time. I certainly did not intend to do that. Rants are typically true, and there are definitely bad advisors out there.\n\nI just think that negative experiences are overrepresented on this subreddit relative to their prevalence in graduate school.",
          "author": "PhDtoJD",
          "created": 1561646320,
          "upvotes": 32,
          "replies": {
            "es6ih5x": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6ih5x/",
              "text": "I think that's sort of the nature of the beast though, on an anonymous (mostly) forum. \n\nIf you're in a toxic or otherwise unpleasant grad school situation, you're likely not going to feel as if your department (or perhaps even your institution) has the supports you need to get help, or perhaps you're worried about possible retaliation or ramifications - because hey, that does happen.\n\nSo this sub becomes a good outlet and support forum. It's relatively easy to stay anonymous so there's no worries about an unpleasant supervisor or cohort member retaliating, and you can crowd-source ideas on how to resolve things while getting support. \n\nAs others have said, if you're having a great day you're less likely to post about it - though we do get those! - than if you're struggling and in need of supports. I think there's also the fear of bragging, or being seen as rubbing it in or being obnoxious. \n\nI'm having a great grad school experience. My advisor is great, my department is supportive in every possible way and from every possible angle. I've been given amazing opportunities, I get to do what I like, I enjoy my project and I'm having a great time. But I'm not going to make a post about it because I'd feel like a jerk, you know? Imposter syndrome is already such a prevalent thing in academia I feel like if I post about something good that happens to me that I might be kicking someone who's already down, and make them feel not good enough, and I don't want to do that, if that makes sense. \n\nSo I get it, I get why this sub can be depressing (I'll openly admit I don't come here as often as other subs) but I also get why it attracts as many negative posts as it does - whether or not it's an accurate reflection of the grad school experience.",
              "author": "PurrPrinThom",
              "created": 1561650052,
              "upvotes": 12,
              "replies": {}
            },
            "es7kxh6": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7kxh6/",
              "text": "In support of your point, and also not intending to undermine the negative experiences many others on this sub have had, but I would like to see more positve content on this sub. As a fellow happy grad student, its kind of depressing and I've stopped coming on here so much as a result. Of course I can empathise with those experiencing difficulty, but to be honest there's only so much an internet voice can do to help another's situation, which is why I *would* consider it ranting. \n\nIdk, that's just my two cents. Didn't mean to offend anyone!",
              "author": "Vegan_peace",
              "created": 1561673169,
              "upvotes": 8,
              "replies": {
                "es90d7h": {
                  "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es90d7h/",
                  "text": "Maybe the subreddit would benefit from having a weekly thread of \"positive\" news or something similar?",
                  "author": "458steps",
                  "created": 1561723115,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "es842q4": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es842q4/",
              "text": "As someone getting ready for grad school, I so appreciate your post.  Most people make it sound so daunting.",
              "author": "celestial_prism",
              "created": 1561687386,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "es6oy32": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6oy32/",
          "text": "There is also the case where you have a fantastic advisor but your program is still really difficult. And having a fantastic advisor doesn’t eliminate all the uncertainty that comes with graduate school. I think I have just about the best advisor in the world and I am having a horrible time prepping for my thesis defense.",
          "author": "Tookie7",
          "created": 1561654152,
          "upvotes": 4,
          "replies": {}
        },
        "es8csdd": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es8csdd/",
          "text": "I think you’re interpreting OP’s words in the worst way possible and assigning a bad intention to them that wasn’t there. It’s true that the negative side of grad school is over-represented on this sub, and I get it, it’s because those are the people who need to reach out to others for support. But as someone who is starting grad school soon, it does freak me out just a touch. So I appreciated this post.",
          "author": "zbutton",
          "created": 1561693724,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "es66lm1": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es66lm1/",
      "text": "Thank you!  I finished my MS and had a fine time, mostly a good time except during the end there but that was expected.  Now, I'm starting on my Ph.D. at a totally different establishment, in a location that I love, with what seems to be a great adviser and team (humblebrag?), and have been so down at times with the fact that I don't see anyone on here that seems to truly enjoy their Ph.D.  I get not everyone has it great, and the issues are real, but I also feel like part of this can be explained by lack of understanding oneself, and not fully investigating the environment they are going to go into.  I'm so stoked about all of what's about to happen, but I also am stoked for everything that's going to happen OUTSIDE of school too.  \n\n&#x200B;\n\nSo uh, yeah, thanks for giving out hope that this doesn't HAVE to go down hill!",
      "author": null,
      "created": 1561641884,
      "upvotes": 1,
      "replies": {}
    },
    "es66hp2": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es66hp2/",
      "text": "I really do think a lot of us, deep down, persist because we love the work. Grad school can sometimes stamp that out of you, but a good program will nurture that. My PhD has been difficult, scary, and stressful, but I've also had the time of my life. I also think I'll look back on these years as the best years of my life.",
      "author": "Pretzelpalosa",
      "created": 1561641802,
      "upvotes": 5,
      "replies": {}
    },
    "es665x3": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es665x3/",
      "text": "I mean, to be fair, posts like these are becoming common enough that they are getting old as well. This forum is a great resource for people going through things, who have questions about things so specific that only other grad students \\*who have gone through the same crappy situations\\* would be able to help them figure out. It seems that people often post on here because they don't have other people in their community to vent to or ask advice of (whether through lack of understanding of specific situations or shame at asking their geographically-convenient peers hard questions that might make it appear that they don't enjoy what they are doing). I think providing a space for people to talk through things anonymously (and even very dramatically if that's what they need at the time) is invaluable, and especially when isolation is something that grad students often face. As fellow grad students who have gone through some of these things, it is also a great way to feel like, if nothing else, our hiccups and what we have learned from them can potentially help someone else.\n\nI think you'll find that while the threads do often consist of people seeking advice (or ranting sometimes), the comments are predictably filled with people who dedicate a lot of time to offering  advice to help people work through things to try to get their focus back on why they joined grad school--to study what they love. There are also folks that consistently start threads asking about specific successes people have each week. If you don't see those often enough, you can start 'em as frequently as you want. It seems more productive than making a specific post to chastise people who may see this forum as a place where they can find support.",
      "author": "stiltss",
      "created": 1561641552,
      "upvotes": 17,
      "replies": {
        "es679sy": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es679sy/",
          "text": "This sub seems to go through cycles. We'll get into more difficult parts of the academic year (usually the end of terms) and people start posting about all the problems they've had all term, either because of their advisor or their cohort or systematic issues.\n\nThen we get at least a couple \"I'm planning on going to grad school but this sub has me scared!\" posts where people comment how everyone skews negative/people come to vent etc. etc. followed by posts like these, the \"I actually love grad school!\" \n\nThen it gets kinda quiet for a while until the cycle begins anew. \n\nOf course, this isn't to say we don't get other types of posts sprinkled in amongst the ones in the cycle, just that it's pretty predictable, having been subbed for a few years now.",
          "author": "PurrPrinThom",
          "created": 1561642400,
          "upvotes": 9,
          "replies": {}
        },
        "es90lkk": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es90lkk/",
          "text": ">If you don't see those often enough, you can start 'em as frequently as you want. \n\n100% yes.",
          "author": "458steps",
          "created": 1561723357,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "es664xa": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es664xa/",
      "text": "[deleted]",
      "author": null,
      "created": 1561641531,
      "upvotes": -4,
      "replies": {
        "es69e70": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es69e70/",
          "text": "Graduate degrees have something like a 50% completion rate, I do not think this sub is much of a misrepresentation",
          "author": "RenegadeBevo",
          "created": 1561643967,
          "upvotes": 14,
          "replies": {
            "es7gj5m": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7gj5m/",
              "text": "Are you talking about a specific program or can you provide a source for this?",
              "author": "greenbirds",
              "created": 1561670396,
              "upvotes": 1,
              "replies": {
                "es7lqi7": {
                  "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7lqi7/",
                  "text": "https://cgsnet.org/phd-completion-project\n\nThe exact statistic you are looking for would be found in the Analysis of Baseline program data (which is behind a paywall).\n\nIt is cited as around 56% at the time of measurement.",
                  "author": "qpdbag",
                  "created": 1561673729,
                  "upvotes": 1,
                  "replies": {
                    "es7xkkw": {
                      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7xkkw/",
                      "text": "Thank you for the information. \n\nApparently my experience has not been representative of the national average. Just to put into perspective why I am so surprised by this - I have been affiliated at 5 major universities in the past ten years and have not seen or heard of completion rates anywhere close to as low as this except one program which supposedly had notoriously high rate of failing students at their qualifying exams. I would estimate that the completion rate of PhDs and Masters in my experience were closer to 90%. This is all within biomedical sciences, so maybe it is higher in my field than others.",
                      "author": "greenbirds",
                      "created": 1561682680,
                      "upvotes": 1,
                      "replies": {
                        "es89l8z": {
                          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es89l8z/",
                          "text": "That definitely has a factor and also it is an older statistic. I believe rates have gone up but I haven't seen any other large scale assessments that are more recent.",
                          "author": "qpdbag",
                          "created": 1561691178,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "es7m0dl": {
                  "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7m0dl/",
                  "text": "Here are a few links:\n\nhttps://www.statisticssolutions.com/almost-50-of-all-doctoral-students-dont-graduate/\n\nhttps://www.wiley.com/network/researchers/writing-and-conducting-research/improving-phd-completion-rates-where-should-we-start\n\nThat statistic tends to refer to all PhD programs. For comparison, medical schools tend to have a 90% graduation rate, if I remember correctly.",
                  "author": "UpSaltOS",
                  "created": 1561673918,
                  "upvotes": 1,
                  "replies": {
                    "es7xsy1": {
                      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7xsy1/",
                      "text": "Thanks for the info. It is a completely different trend than what I have seen within my own field/institutions but that must not reflect that national average. This is very surprising to me.",
                      "author": "greenbirds",
                      "created": 1561682869,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "es6d5et": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6d5et/",
          "text": "When I was doing my masters I actually felt *guilty* about enjoying it so much because of the  negative posts here. It made me question whether I was working enough or taking it seriously enough. Because I *should* have been miserable right? \n\nHopefully we can change things so the default is “you should be fulfilled and happy and challenged”. If you are not these things, let’s address and fix the problem.",
          "author": "ducbo",
          "created": 1561646548,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "es64hda": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es64hda/",
      "text": "Majority of posts in this sub are about people in shitty situations or struggling with an aspect of grad school. I just came here to say that I loved my job as a master's student, and I love my current job as a PhD student, my research is cool, my lab is great, my workspace is clean and new, my city is awesome, and my advisor is smart and helpful. #school4life",
      "author": "jburkek",
      "created": 1561640189,
      "upvotes": 144,
      "replies": {
        "es6fq74": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6fq74/",
          "text": "It's kind of like product reviews. The ones with the most to complain about often speak the loudest.",
          "author": "sr_crypsis",
          "created": 1561648278,
          "upvotes": 35,
          "replies": {
            "es71kb4": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es71kb4/",
              "text": ">omp\n\nUnless you're on Amazon where 98% 5 star reviews isn't that rare... which is a shame.",
              "author": "jtmooon",
              "created": 1561661967,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "es64a5a": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es64a5a/",
      "text": "Same, I absolutely love grad school. \n\nI never post in this sub because people are so negative. I think my bigger gripe with this sub is a lot people not taking personal accountability for their problems. Everything is other peoples fault and nothing is their own faults/shortcomings that they should work on improving. Oh and the standard answer from others every time some adversity is faced- \"just quit and throw away your whole career!\"",
      "author": "rustyfinna",
      "created": 1561640023,
      "upvotes": 4,
      "replies": {
        "es66t4q": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es66t4q/",
          "text": "I think most people on this subreddit are capable of differentiating between systematic abuse of \"rules\" vs personal accountability towards the problem.",
          "author": "ScreamnMonkey8",
          "created": 1561642045,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "es648od": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es648od/",
      "text": "You have no idea how sad it makes me that my decision to join a particular group turned what could have been great to a \"when will this be over\" situation. However I'm interested in knowing more details about what is making your experience more fun and pleasant. For example how much do you see your advisor? What kind of feedback does he/she give you? What kind of team dynamic does your group have?\n\nOne problem I have is that I don't really know what other groups do to make a healthy environment so I don't know what to _ask_ for in my current group. You can also DM if you want, I'm very interested in this topic!",
      "author": "Sea_of_colors",
      "created": 1561639988,
      "upvotes": 58,
      "replies": {
        "es6c7kv": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6c7kv/",
          "text": "My advisor makes time for me whenever I need to see him. I can see him every day, multiple times if necessary, no appointment required—but usually that's not necessary. I have one mandatory individual meeting each week, plus group meeting.\n\nHe is a brilliant chemist, and he gives me useful and practical advice 90% of the time. 5-10% of the time he is mistaken about something—usually because he is not the one in the lab actually running the reactions—but on those occasions I am able to ignore his advice without consequence. I have also talked with him about other things; for example, he gave me some good relationship advice when I went through the inevitable grad school breakup.\n\nMy lab dynamic is very friendly and collaborative. There's lots of joking around in the office and at group meeting. People will give away samples of their precious compounds and freely offer their own experiences. I think that this is partially a result of my advisor preventing unfriendly people from joining our group. My advisor tries to avoid coming into the lab/office as much as possible, and no one feels like there is a certain work schedule that is expected of us. People usually have their own individual projects, but sometimes multiple people work on one project, and that's OK too.\n\nI'm not sure if that is exactly what you were looking for, but I hope that helps!",
          "author": "PhDtoJD",
          "created": 1561645917,
          "upvotes": 36,
          "replies": {
            "es6qnr1": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6qnr1/",
              "text": "This sounds very much like my group as well, and I too am really enjoying my Phd program. I think the lab culture that your advisor creates is so important to your happiness as a grad student. \n\nFar too many students pick their advisors based on name recognition or because they really really wanna work on some super narrow subject that only that professor is working on, and they end up being miserable as a result because they didnt consider whether working for that advisor is actually enjoyable.",
              "author": "ndrach",
              "created": 1561655209,
              "upvotes": 10,
              "replies": {
                "esnrlbw": {
                  "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/esnrlbw/",
                  "text": "> Far too many students pick their advisors based on name recognition\n\nThis is really common advice here. Two possible conclusions fall out from that sentiment:\n\n* Unpleasant mentors are somehow still producing the best research\n* Recognition is decoupled from quality research, whether it's through professional connections (abusing the system) or an over-emphasis on being prolific (spamming the system) or something else\n\nSince most of the most solidly argued, groundbreaking research in my field comes from highly recognized labs, I tend to think it's the former. I'd love to hear other people's opinions, and maybe this varies by discipline, but could this be a trade-off scenario where shitty advising can be a trade-off with the promise of quality?",
                  "author": "LetThereBeNick",
                  "created": 1562146607,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "es64w1o": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es64w1o/",
          "text": "There’s actually education literature about grad student persistence. I haven’t gone down that rabbit hole myself for two reasons: already not enough hours in the day, and I’m worried it’ll be really depressing.",
          "author": "AceyAceyAcey",
          "created": 1561640525,
          "upvotes": 18,
          "replies": {
            "es65l3r": {
              "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es65l3r/",
              "text": "Interesting. I just looked up one random paper quickly and I can already see the main issues.\n\n(What I'm really looking tbh for is validation for my feelings, proof that it's not me who isn't trying hard enough, but that my situation just isn't great for any normal person to enjoy what they're doing...)",
              "author": "Sea_of_colors",
              "created": 1561641099,
              "upvotes": 11,
              "replies": {
                "es67fnb": {
                  "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es67fnb/",
                  "text": "Oh it’s not just you. I’ve been through two grad STEM programs and my main issue is that most advisors don’t know how to be mentors, they’re just acting like bosses, and not great bosses at that. I’ve also worked with some education advisors, and even the worst Ed prof is a better mentor most days than the best graduate level STEM prof. Last time I had a good mentor in STEM was my undergrad profs at a SLAC, 19 years ago.",
                  "author": "AceyAceyAcey",
                  "created": 1561642522,
                  "upvotes": 23,
                  "replies": {
                    "es6jn4d": {
                      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es6jn4d/",
                      "text": "Yeah unfortunately this seems like the norm..",
                      "author": "Sea_of_colors",
                      "created": 1561650801,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "es720qe": {
                      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es720qe/",
                      "text": ">Many bosses outside of academic life aren't great great or event good bosses either... few teachers are great teachers, I mean, most of people we encounter are, by definition, average. Having worked outside of academia before doing a PhD certainly helped level my expectations.   \n(Edit: hit the save button too fast)",
                      "author": "jtmooon",
                      "created": 1561662253,
                      "upvotes": 1,
                      "replies": {
                        "es72hhj": {
                          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es72hhj/",
                          "text": "My work between the two PhD attempts was as a community college prof. Most grad school profs aren’t nearly as compassionate as CC profs and academic advisors. It was also really fascinating taking graduate classes from profs, then TAing undergrad classes with the same profs, for classes I’d taught more times than some of the profs I was TAing for. Some profs were great at grad and sucked at undergrad, and some were the other way around. Usually the more compassionate profs were better at undergrad, and the more elitist profs were better at grad, not surprisingly.",
                          "author": "AceyAceyAcey",
                          "created": 1561662547,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "es7ehka": {
          "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es7ehka/",
          "text": "I see my advisor on average 3-4 days a week, the only time I don't is if she's working from home or traveling. She's pretty much always easy to reach if she's not physically in her office. She gives positive feedback when there's something that deserves it and negative feedback when something deserves it. The negative feedback is never discouragement or belittling but always constructive and supportive.\n\nOur lab gets along very well. My boss likes having a small lab, there's four of us right now including her. We could easily hire a couple more but keeping the group small keeps us closer (and also gives more money for experiments lol). Grad students get together outside work for drinks, the lab goes for lunch once or twice a month, we sit around and talk during lunch once or twice a week, and generally all know what's going on in each other's lives outside work. My boss has watched my dog a couple of times while I was out of town.\n\nI realize I'm very fortunate to be in this position but I actively sought out this kind of environment. I did rotations in labs that I realized weren't the best environments and decided to not join despite the PIs being highly respected and regularly publishing in top journals.\n\nI don't know how it is everywhere else but at my school all of the older grad students will warn the first years about which professors to avoid, even if it's their own PI. Students here are all generally really supportive of each other.",
          "author": "ImJustAverage",
          "created": 1561669221,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "es645vp": {
      "link": "/r/GradSchool/comments/c64w1m/grad_school_can_be_fun/es645vp/",
      "text": "Come on, tell us about the time you are stressed and miserable. We need to feel better about our situation!",
      "author": null,
      "created": 1561639924,
      "upvotes": 8,
      "replies": {}
    }
  },
  "updated": 1634065769
}