{"sid": "p6cnwz", "link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/", "title:": "Existential dread of starting a PhD in the current world climate", "text": "Saw a post a little while ago expressing a sort of existential dread about entering grad school with the current state/climate of the world and I share that worry. I’m normally an optimist about this kind of stuff, but the state of things (climate change, etc.) continues to get worse and I’m really getting concerned whether spending 5-10 years on a PhD is worth it at this point. I definitely have a lean towards industry as of now, if that has an influence in this.\n\nI’m entering grad school with the intention of getting a PhD (epidemiology/biostats), but now I’m wondering if I should just get my Master’s and move on with my life/career considering there’s a very real possibility we could be in chaos in a few years.\n\nI love my research to death and would love to see it through. I don’t necessarily feel that time would be wasted, but I wonder if it’s “worth” getting a PhD with things going how they are right now.", "author": "artoriVG", "created": 1629234729, "retrieved": 1632846490, "over_18": false, "upvotes": 258, "upvote_ratio": 0.93, "comments": {"h9fmo0c": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9fmo0c/", "text": "I recently spoke with one of the principal biostatisticians at Merck. I asked him a similar question. He told me that if biostatistics in pharmaceuticals is something you want to do, then the PhD is definitely worth it.", "author": "filius_silvae", "created": 1629309262, "upvotes": 1}, "h9enqp8": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9enqp8/", "text": "I'm an epidemiologist who graduated with my MPH 5 years ago and am now starting my doctorate next month. There's no rush. Take your time and make deliberate choices for yourself. Live your life according to what works for you, it's not a race to see who can go from diapers to tenure the fastest.\n\nIdeally you can make decisions which work out both in the medium and long term. For me, I know I'll both enjoy being a graduate student for a few years AND enjoy having that added credential on my resume moving forward. It's not like I'm slogging through the unbearable muck of a PhD hoping that there's light at the end of the tunnel. And that has a lot to do with the fact that I waited until the time was right.\n\nBesides, there are so many opportunities in our field outside of academia which you can pursue with a masters degree, and if you want to go back for a PhD after a couple years you'll have a solid foundation.\n\nWhen it comes to the sense of imminent social and ecological collapse, there's a degree to which people of every generation have felt that existential dread. I'm not saying we're in no worse shape now than in the past, but I don't think it's anything around which to make life plans (unless maybe you're considering purchasing a home in Arizona)", "author": "sublimesam", "created": 1629293344, "upvotes": 1}, "h9ed2lr": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9ed2lr/", "text": "I’ve talked about this with my husband before. I said what’s the point of starting a PhD program if the world is ending?! He said….that’s even more of a reason to do what you love.", "author": "cosmicmermaidmagik", "created": 1629286952, "upvotes": 1}, "h9dslmc": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9dslmc/", "text": "Believe in the force....", "author": "RedFlutterMao", "created": 1629268830, "upvotes": 1}, "h9dr8ox": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9dr8ox/", "text": "I’ve finished the first year of my PhD but might drop it. I’ve applied to several companies in my city. My opinion is if your university is not in top 100 and you’re not very motivated, it makes sense to let go your doctorate", "author": "ilikespoilers", "created": 1629267668, "upvotes": 1}, "h9dmqe5": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9dmqe5/", "text": "The world needs good people that are well-trained. Like you. I would go for the PhD and apply the knowledge and training you will gain to work towards a better future.", "author": "Matthias_Rillig", "created": 1629264030, "upvotes": 1}, "h9dlz57": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9dlz57/", "text": "You should be existentially motivated! Here's a chance to really make a difference in the world! I am sure we will have more global health crises in the future, and we need bright, creative young people to solve them.", "author": "fwafwa", "created": 1629263463, "upvotes": 1}, "h9d8hl1": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9d8hl1/", "text": "We take our chances every single day we are alive. There are many things that are not in our control yet we decide to live that day to the best of our abilities.  Take one day at a time. Have a bigger goal than just making money. When you find your purpose (be it empowering the next generation, or helping the current one), you may feel more at ease with things to come.  We cannot change how the world behaves, but we can do what we can to make it a better place.", "author": "mstalltree", "created": 1629255103, "upvotes": 2}, "h9d606q": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9d606q/", "text": "I made that post- if you wanna talk with another existential dread buddy, DM me.", "author": "throwmedownthequarry", "created": 1629253786, "upvotes": 1}, "h9d1ynh": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9d1ynh/", "text": "The last post about this anxiety really laid out some solid evidence that the likelihood of a catastrophic global climate apocalypse is extremely unlikely in our lifetime.\n\nSure, things will get worse, but if i remember correctly the articles on the last post state that in the next hundred years with current emissions (not including several countries new zero-csrbon foot print progressive movements) were only like to see a 1-2 degree Celsius warming.\n\nAll these scary weather events, we've always had. The earth goes through cycles of catastrophic weather. Our footprint doesn't help the situation, and we obviously need to improve as a species, but it's nothing to have crippling anxiety about.\n\nYou should be more worried about another world war, or worse, a nuclear war. Even that is... Questionable, but I have some anxiety about the whole US-china/Russia relations recent years.\n\nOr something that's more likely to happen, a deadly illness that wipes out a large amount of the population. (COVID variants)", "author": "Emperor-Valtorei", "created": 1629251695, "upvotes": 1}, "h9czjzz": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9czjzz/", "text": "So I graduated last year with my BS in chemistry, and have been working as a temp lab tech for the last 12 months in Industry. I knew I wanted to go to Grad School, but never was sure about it, and when the pandemic hit, it made it unbearable to even think about it. Taking a break between my undergrad and grad school, and especially in and industry relevent to my field, helped tremendously. I work with adhesives so I am learning a bit about polymer chemistry, which I already had some experience with from undergrad research. But it gave me time to think about what matters to me and what I want to do. I started to question whether I want to be in industry, or transition to academia or do government research. But most importantly, I decided I wanted a PhD, and I wanted to pursue nanotechnology and/or catalysis in renewable energy and battery applications. I miss doing research, and with some insight of having worked in industry for a year, I know that I want to also have job security when I'm done with school for good. You can manage with an MS just fine, but if you like research enough to commit for ~5 years, go for the PhD. Getting yourself financially stable and successful will be a matter of education, work experience and networking, just do what you feel will best get you to where you want to be. But I also recommend taking a year off to work in industry, and then decide, but don't take a gap period without having a plan. You could decide you only want an MS and you can have the company help you pay it off. Or you could go back to get a PhD and apply for a stipend. But the climate crisis won't get as bad as you probably think in the next 5 years. You have time, so why not get prepared for when the shit hits the fan? Especially with covid, and other future diseases, a degree in your desired field would be very advantageous. Ask yourself what is important to you, and what would help you best to reach your goal", "author": "AggressiveYou2", "created": 1629250483, "upvotes": 1}, "h9cvz2i": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9cvz2i/", "text": ">considering there’s a very real possibility we could be in chaos in a few years.\n\nThere has always been that threat.  You can't live your life planning for that to happen.  People have been fearing societal collapse for decades.\n\nBe glad this is not the latter decades of the Cold War. When every day, one could wonder if today was the day the USSR and the US were going to plunge the planet into nuclear winter and extinguish almost all life on Earth. Literally. That's the existential angst people lived with.", "author": "raistlin65", "created": 1629248674, "upvotes": 3}, "h9ctl4q": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9ctl4q/", "text": "If things break down you are going to want education, connections, guns and ammo\n\nLong term imo education will be more useful. Lots of changes in industry as tech evolves and we try to deal with climate change. Certain industries won’t exist in the future imo", "author": "Trakeen", "created": 1629247446, "upvotes": 2}, "h9ctfyy": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9ctfyy/", "text": "Certain skills become more valuable after a society collapses. Consider getting into nursing, horticulture, water treatment, engineering.. I'm not smart enough to name them all. But in the event that everything goes to shit, you'll want to use your education. \n\nAlso, and I'm very sincere about this: Depression is  not fun. All grad students need to see therapists. If you're worried about the current world climate (rightly so), you should consider speaking to a therapist *now* in how it's effecting you.", "author": "Individual-Schemes", "created": 1629247374, "upvotes": 2}, "h9cs9lc": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9cs9lc/", "text": "I’ll give you my perspective as someone with a BA working full time in climate: What I wouldn’t give to go back in time right now and get a masters. It’s hard to learn everything I need to know about policy and regulation, data analysis, environmental science, and so on — all on the fly. And most jobs I could move into in my field are looking for masters and above. \n\nIf you have the opportunity ahead of you to not only do grad school but go all the way to a PhD, I say go for it. The shit is hitting the fan more and more and we are in serious need of people who know what they’re talking about in every field there is. Climate is a challenge in every aspect of society. Learn all you can about epidemiology and biostats now. Whether or not the state of the world has you thinking you want to do something climate related down the road… there’s a good chance the road will decide that for you. \n\nKeep thinking, keep exploring, I’m rooting for you however far you study.", "author": "stayonthecloud", "created": 1629246764, "upvotes": 3}, "h9crftq": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9crftq/", "text": "Nooooo go for the PhD if that’s what you really want. The world needs more educated people. And it will continue to need more educated people for as long as the human race exists.", "author": "Dustin_Bromain", "created": 1629246335, "upvotes": 5}, "h9cqor8": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9cqor8/", "text": "[deleted]", "author": null, "created": 1629245948, "upvotes": 2}, "h9cp47j": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9cp47j/", "text": "Many people here have provided excellent arguments why a PhD would empower you to engage more productively with the future. They are completely right.\n\nThat said, until your are 100% behind doing a PhD you are not ready to begin. For the most successful PhDs, nothing else will do. The PhD road is very hard and the road beyond even harder. But if that is the only way you can live your life, you should go with enthusiasm and enjoyment.", "author": "IkeRoberts", "created": 1629245140, "upvotes": 9}, "h9coxtx": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9coxtx/", "text": "Does your program offer a pass through masters? Worst case scenario you can leave your program with a masters once you fulfill those requirements.", "author": "sweatyshambler", "created": 1629245052, "upvotes": 5}, "h9cokg7": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9cokg7/", "text": "I found this a really good article on thinking about the future:\n\nhttps://www.ecosophia.net/the-future-is-a-landscape/\n\nThe author is overall more pessimistic than me, actually one of the most well known “collapse” thinkers out there. But the main thing I hope to express here is the frame of mind of thinking about the future in a more complicated way.\n\nThe tone is basically set in this first paragraph: \n\n> I’ve been reflecting of late about the way that our habitual expectations about change blind us to the way that change actually happens. One of the most important of these is the frankly weird but pervasive notion that the future is a single place, where only one kind of thing happens. It’s always “The Future,” very much in the singular.  To most people these days, of course, “The Future” is either progress as usual or it’s instant apocalypse, and I’ve discussed that before, but let’s look at the broader pattern for a moment.\n\nI think it identifies something in the collective consciousness about this moment in time. Many people feel we’re heading to some apocalyptic event. \n\nWhen really it will be more complex, both spatially and temporally, with different rates going on for different phenomena and in different places.\n\nAnother thing for me is the book I’m currently reading: *The Ministry for the Future* by Kim Stanley Robinson. \n\nThe book starts out right inside one of the most horrible climate catastrophies you can imagine. I won’t spoil anything. But out of that it goes on to tell the story of how, over many decades and in the midst of frequent disasters and crises, a lot of different small bits of action add up and collectively help bend our course towards a much better path. \n\nKind of helped give me some inspiration for how we can act in the face of all this, even when it’s in response to terrible disasters. And how we might actually bend the arc towards good over time if smart and passionate people keep at it. \n\nUltimately I can’t say whether it’s best for you to choose one or the other for your own career and life. I’ve struggled with similar questions. I’m also in a field that’s potentially very helpful for our problems, but not sure if pursuing my own PhD in it is the right move. (Leaning towards yes recently, and actually parts of this thread are also nudging me in that direction).\n\nAll I can say is to recommend living your life in a way that could optimally help if things do go well. (And remember, “well” can coexist with disasters, even really bad ones. The future isn’t a single place it’s a landscape).", "author": "OrbitRock_", "created": 1629244866, "upvotes": 10}, "h9ckpod": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9ckpod/", "text": "It would be if you lived in the Maldives. \n\nIf you are not this is just first world problems.", "author": "MIA_AIM1", "created": 1629242911, "upvotes": 5}, "h9chf6b": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9chf6b/", "text": "Conversely, now is the chance to develop these skills before things get worse.", "author": "TehDing", "created": 1629241297, "upvotes": 19}, "h9cdjlw": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9cdjlw/", "text": "I share your worry in the general, but I think you might have a slightly unrealistic concept of what climate collapse is going to look like. I think this is a common issue among well-meaning people. We all know that \"climate apocalypse\" is coming, but most people don't actually have a good sense of what that really means.\n\nWe're not going to wake up one morning (at least most of us won't) and find that our entire world order has been upended. Instead, this is a slow (but accelerating) process of transformation in lots of different ways, which has already begun.\n\nThe sorts of things that you should be preparing for now are: persistent economic recession; war, famine, disease, and mass migration that begin in parts of the world that are already poorer, hotter, more arid, more densely populated, less politically stable, more vulnerable to natural disasters (think: South Asia, Africa, etc.) and spread over the course of years; and a *gradual* shift in the habitable regions of the world away from the equator and towards the poles. We're talking 10, 20, 50 years for this stuff.\n\nIn my opinion, having a Ph.D. in a key field (epidemiology for sure counts) is going to be a *protective* factor in the coming world. People with in-demand skills are going to be more important then than they are now. An example: what happens if you and your family live somewhere that becomes unsuitable and you need to emigrate? Having a Ph.D. makes that easier, you're a better candidate to would-be host countries. This is already true and it will only become more true.\n\nIn other words, if you believe a Ph.D. is right for you *but* you think the impending climate crisis should change that, I would say to you that in fact I believe the opposite is true. On the other hand, if you aren't actually sure that you want a Ph.D. then you shouldn't do it, for all the common mundane reasons having nothing to do with climate change.", "author": "UmiNotsuki", "created": 1629239433, "upvotes": 248}, "h9caa88": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9caa88/", "text": "I wouldn't start it if I were you. Enjoy the last few years before mass chaos", "author": "thetiniestsquirrel", "created": 1629237916, "upvotes": -11}, "h9ca8t9": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9ca8t9/", "text": "[deleted]", "author": null, "created": 1629237898, "upvotes": 19}, "h9c9bpi": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9c9bpi/", "text": "I'm just starting a PhD in the geosciences/paleoclimatology, and this is something I have thought about too much recently as well. Through listening to The Daily, Pod Save America, How to Save a Planet, Ologies (check these out!) and reading news articles, I've been exposed to a hearty dose of climate stories and I have a few conclusions or mindsets that are helpful for me, although some days I am more worried than others.\n\nHere's a conversation I have with myself to help me figure out the best choice for myself. I think to myself in regards to climate change, what would I be doing if I weren't in grad school. Would I buy a farm in the mountains and start a completely self-reliant lifestyle? I'm totally not trying to sound belittling because that actually does sound awesome (but a ton of work) and I am as environmentally conscious as I can be, but for me, I can't see that fulfilling me. Would I dedicate my life to becoming an activist? Again, for me personally and knowing how I operate, that's just something I can't see myself doing. Everyone should be engaged in activism as much as they can, but I know that if I stopped my PhD in light of these other choices, I don't think the work from these jobs would make me happy. \n\nI feel like I put myself in this scenario in my head where I'm like: \"Ok, so I can either start a self-sufficient farm and create some sort of security for myself in the long term or become a full on activist and fight with everything I've got, or I can get my PhD and just ignore Climate Change & activism.\" But I honestly think this is unfair & unhealthy way of looking at it. It's not black and white or mutually exclusive like this. There's no reason why you can't get your PhD **and** be engaged in outreach & activism organizations. I don't think it's helpful to say to ourselves \"you can only pick one of those choices\" because it's not that simple. Like even if I dropped out and decided to follow a career path that would give myself some extra security (start working sooner, becoming an off grid farmer), there's no way to even know if it would be enough. Would working a few extra years really matter in the end to protect myself from climate change? If food supply lines get disrupted (which they will to some degree at some point), what do I do then? The way I see it, I am betting on scientists, activists, and humanity prevailing (not an easy bet) which means continuing with grad school and getting involved in activism & outreach as much as I can. Because if I did stop my goal, and climate change ends up being *somewhat* manageable throughout my lifetime, I think I will have a ton of regrets. Personally I would rather be hopefully optimistic working towards my PhD and being engaged in activism, promoting civic engagement, etc. along the way than leaving as sort of a safety net. I wouldn't demean anyone for choosing that path, but I can't do it myself.\n\nTL;DR: My advice is to follow your goal/dream but be engaged with activism & outreach fighting climate change and promoting STEM as much as you can. There are LOTS of organizations in the geosciences for this, and I'm sure there are tons in most fields.", "author": "Paulv16", "created": 1629237470, "upvotes": 15}, "h9c7n8f": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9c7n8f/", "text": "If things get bad enough, fast enough for it to be a reason to not do a PhD, it's probably not a good idea to get a job at all now. You should instead invest every minute in prepping... Right? \n\nBe prepared for the pessimistic trajectory, but not at the cost of preparing for the optimistic one.", "author": "Single_Blueberry", "created": 1629236712, "upvotes": 120}, "h9c6s59": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9c6s59/", "text": "Nope you’re right don’t begin", "author": "grandpassacaglia", "created": 1629236326, "upvotes": -11}, "h9c58bt": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9c58bt/", "text": "Are you worried because you'd want to be in a better immediate earning position if things go to hell?\n\nIf you feel that you are strongly worried about these problems, perhaps your research could be oriented towards them? Environmental epidemiology would be an option, and while not a specific field of study, One Health/Planetary Health is becoming more established, which broadly seeks to address climate change in the context of global health.\n\nPersonally, I quit my industry job 1 year ago to go for a PhD researching biodiversity loss and infectious disease emergence (inspired by certain current events...) so I think it's a good idea to be involved as part of the solution. Happy to give more specifics via PM if you'd like.", "author": "EVQuestioner", "created": 1629235653, "upvotes": 10}, "h9c53n5": {"link": "/r/GradSchool/comments/p6cnwz/existential_dread_of_starting_a_phd_in_the/h9c53n5/", "text": "Get ready for 8 vaccinations, goggles, diapers and 9 masks", "author": "RagingPhysicist", "created": 1629235595, "upvotes": -14}}}