{"sid": "pkfnu6", "link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/", "title:": "Does anyone get anxiety attacks before a new semester, regardless of how long you’ve been in school?", "text": "I’m going into my second year of my PhD program (straight out of undergrad; didn’t obtain a Master’s degree like the majority of everyone else in my program) and school starts tomorrow. I’ve never experienced grad school in person (started in Fall 2020 in the midst of the pandemic, have only ever known Zoom seminars) AND I’m going to be TA’ing for the first time. \n\nI am absolutely freaking out and having an all out anxiety attack. I normally get anxiety before every semester, but I feel like it’s been heightened because I haven’t been in a classroom in over a year, have forgotten what it’s like to socialize with fellow students, I feel completely stupid compared to my classmates, and I feel like I have no authority/knowledge to be TA’ing. The imposter syndrome is kicking in strong. \n\nI already take an SSRI but it is not helping right now. Anyone else feeling extra apprehension/fear/anxiety about this semester if you’re going to be in person and/or teaching? How are you approaching and managing it?", "author": "Thoughtgeist", "created": 1631123892, "retrieved": 1632953948, "over_18": false, "upvotes": 355, "upvote_ratio": 0.99, "comments": {"hc6rhir": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc6rhir/", "text": "It’s completely normal! I’m in my final few (fingers crossed) months and I still feel anxious periodically. The first couple years were tough! I can’t imagine how hard it is for you as a newer student coming back after being remote for so long. Even before the pandemic when I was just starting out in grad school my psychiatrist and I decided that it was appropriate to up my SSRI dose, even just for those first few months. If you go the medicine route, adding an anti anxiety med to my SSRI was a godsend. I used to get frequent panic attacks but haven’t since tweaking my meds. Also, if you have the resources at your university, look into counseling or any grad support groups. And if possible, talk to your circle (friends, fam, other grad students) about how you’re feeling. Chances are others in your cohort are feeling very similar things and it’s nice to vent once in a while. Another thing that helps me is getting more exercise, even if it’s just parking in a far away lot and running late to class lol.", "author": "apescapes", "created": 1631199187, "upvotes": 2}, "hc5cxxl": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc5cxxl/", "text": "I used to have the opposite. I loved every new semester because I got to meet new people. It's a matter of perspective", "author": "resorcinarene", "created": 1631163620, "upvotes": 1}, "hc5ce6v": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc5ce6v/", "text": "Hi there. I felt the same way walking into the semester three weeks ago. The anticipation of it all is worse that the workload itself, IMO. Your body is readying you for the hard work ahead. You got this, though. One day at a time. You’re going to learn and grow so much this semester.", "author": "letsrollwithit", "created": 1631163229, "upvotes": 1}, "hc53d9s": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc53d9s/", "text": "Yes. I joked to someone last month that June and July are all fun and games and then August is just the Sunday Scariest for 31 days straight (or 23 days straight for me this year, we've been back for 3 weeks now).\n\nOne thing that helped me was going up to campus before classes started and walking the route of my classes. I also recommend practicing the bus if you'll be taking it, but know that it might be running late/off schedule the first couple weeks (ours made the news for being so sporadic as it got used to having students again 😅).\n\nOther than that, just know that everyone is nervous this year! I'm sorry I couldn't be more help, but hopefully you'll know you're not alone.", "author": "princess_lissie_", "created": 1631157528, "upvotes": 2}, "hc53695": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc53695/", "text": "My boyfriend was so anxious he used to throw up before the first day of school every semester/school year, elementary school through high school. I think college too. No matter what.", "author": "Megasoulflower", "created": 1631157421, "upvotes": 1}, "hc4w9gh": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4w9gh/", "text": "I'm in the same exact position as you- 2nd year PhD, started Fall 2020 with all online classes, never met classmates in person until now. I think it's also related to imposter syndrome, bc I've had these same anxiety attacks before every fall school year since I can remember being in school (my whole life).\n\nI recently started seeing a psych about my anxiety, since it's gotten so bad this past year and a half. I completely understand how you're feeling OP and I hope this semester goes well for both of us! We'll get through it somehow. You're definitely not alone, trust me", "author": "juliamarcc", "created": 1631153835, "upvotes": 2}, "hc4vumz": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4vumz/", "text": "Oh absolutely yes.", "author": "oceanofflavor", "created": 1631153630, "upvotes": 1}, "hc4pcy4": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4pcy4/", "text": "For me it hits at the end of the semester when all the papers come due.", "author": "VexedCoffee", "created": 1631150468, "upvotes": 1}, "hc4mbr8": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4mbr8/", "text": "~Five years out of grad, almost ten since TA'd. I still get anxious dreams about it (and the standard forgetting about a semester paper until days before its due). Cannot imagine the extra anxiety with covid.\n\nGood first step in recognizing it is imposter syndrome, not you not being capable. If you didn't have the authority/knowledge to TA, you wouldn't be getting paid to do it.", "author": "HappyHrHero", "created": 1631149024, "upvotes": 3}, "hc4ick9": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4ick9/", "text": "Even when I don’t think I’m feeling anxious my body still reacts that way when major changes happen. I had to break into my medicine cabinet this morning and I was only showing up for some hands on lab training. That should not have been interpreted as stressful to my brain :(.", "author": "UleeBunny", "created": 1631147135, "upvotes": 1}, "hc4hvpv": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4hvpv/", "text": "No, never", "author": "Manuel_Ad", "created": 1631146912, "upvotes": 1}, "hc4hlht": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4hlht/", "text": "I am a third year PhD. I live in student housing less than one block from campus. I’ve been avoiding it with all of my might for the past two weeks. I’m a TA this semester, but my class are on Mondays so it doesn’t start until next week.\n\nLast week I planned to go to campus and I had a panic attack before I could get out of my apartment. \n\nI have been following subs on CPTSD and disorganized attachment, and so I posted there this morning about my fear, and I was able to actually get dressed and go to campus for lunch\n\nI was met there by two really gentle friends, which is good because I sobbed four separate times. Also ended up seeing a third friend who promised to check in with me. I was there for maybe 90 minutes.", "author": "--ikindahatereddit--", "created": 1631146777, "upvotes": 4}, "hc4gs08": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4gs08/", "text": "I have intense anxiety! You’re not crazy and how you feel is incredibly valid. I think grad students who have never felt dumb compared to everyone else are either asses or they actually are a genius lol. \n\nSomething someone once told me that helped imposter syndrome: “you’re so focused on what you don’t know. Do you ever think about all of the things you DO know?!” Well, no, I hadn’t— \n\nPeople don’t, bc as human beings, we compare ourselves to our peers. We are pack animals, and have a strong (albeit toxic) desire to perform— so we can fit in with our social group. A million years ago, the dummy died or was kicked out of the pack and then died :) and anxiety… it’s just that fear being aroused. A fear that once really helped us, but that no longer serves us.\n\nWhat I’m saying is… your anxiety, though very real, is not the truth about you. You know more than you think. Coming from a girl that thought she was the dumbest girl in the room, always had to work harder than everyone, and who ended up getting the one and only research assistantship with a 4.0  :)", "author": "aka_hopper", "created": 1631146391, "upvotes": 2}, "hc4cn5x": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc4cn5x/", "text": "I started grad school this week and I already have some creeping anxiety and imposter syndrome. I haven't been in school for more than a decade and just looking over the coursework and assignments along with my freelance work and being a mom... I'm gonna need aaalllll the help in the next 2.5 years! Find the things that ground you and schedule some extra therapy if you can! That's what I'm doing.", "author": "ManilaAnimal", "created": 1631144387, "upvotes": 8}, "hc48od8": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc48od8/", "text": "Yes.\n\nI don't know whether it helps, but I kinda ritualize the beginning of a semester by cleaning house, organizing anything I need to organize, make sure I have groceries and all that. That way I have less on my plate and a nice, clean home to start off on a good foot with.\n\nThat did not happen this year.  \n\n\nOH- idk what your system is for getting ready to juggle it all- but I used an excel sheet to record assignments, class topics, and readings for each week and then I'd change the color as I got through each thing. I keep a sticky note pad for my 'to do today' thing on my desk, and start off with high priority stuff and roll low priority stuff to the next day.  \n\n\nYou can do it! You'll find your rhythm. Promise. Also, your first year of a PhD program if there's a master's-en-route is essentially a master's. ;) You got into the same program as your peers, so don't forget- you're CAPABLE!", "author": "Antikythera22", "created": 1631142434, "upvotes": 5}, "hc3iqwq": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc3iqwq/", "text": "Yes", "author": "elidan5", "created": 1631130151, "upvotes": 2}, "hc3ff26": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc3ff26/", "text": "I'm in this same situation, down to the SSRI prescription, and felt the exact same way--until my semester started 2.5 weeks ago. What you are feeling is very real. For me, however, I did find that my fears were, to an extent, a problem of anticipation. I had the memory in my head of how difficult last fall was, and the idea of returning to a similar realm of experience was absolutely terrifying. Even though it was tough, the sheer act of beginning helped to pop the anxiety balloon.\n\nI don't know how exactly your university is handling Covid, but it sounds like you will definitely be spending time in a classroom. For me, this has been a tremendous relief, more so than I could have imagined. Having a shared physical space with peers instead of a purely virtual one has been very soothing.\n\nA lot of my anxiety, at least, comes from the sense that the semester lags on and on forever and submerges and overwhelms you. Two things have been helping me on this point: First, putting everything that I do on my Google calendar, even things like \"Order takeout\" and \"Watch a movie.\" This makes the self-soothing activities and leisure pursuits feel just as important as homework and TA'ing and meetings. And there is no sense of guilt about spending time on these things because they're already built into my time budget, just like all of my obligations are built into the schedule. That knowledge helps keep the tide of anxiety at bay. Secondly, I've developed clear goals for the semester (I'm working on my thesis) that remind me that semesters actually go by incredibly quickly. This gives me a renewed sense of purpose (almost urgency, but in a positive way) that helps cut down on the sense that I somehow might not belong. (However, the sheer fact that you are in your program means that you are meant to be there! You were chosen for a reason!)\n\nIn terms of TA'ing, you know more than your students do. I'm in the humanities and so I have lots of opportunities to incorporate sharing-out activities that keep the students' voices the most active in the room--not mine. I also type out my script before ever recitation session, even down to the \"Good morning!\" I don't read it word-for-word at all when I'm actually in the classroom, but just knowing that I have those notes in my hand increases my confidence.\n\nYou got this!!", "author": "jemma3316", "created": 1631128777, "upvotes": 10}, "hc3elvq": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc3elvq/", "text": "Oh i’m in the exact same situation. 2nd year PhD, out of undergrad. Havent been on campus in years. About to TA first time. Already on an SSRI. I suffer from so many anxiety attacks either caused by or worsened by this career path. Im taking on as little as possible to adjust to being in person and TAing. Only taking one class plus masters thesis work right now. Even thats a lot but everyone else in my cohort seems concerned about how little im taking. Whatever. I need to survive.", "author": "tzssao", "created": 1631128441, "upvotes": 5}, "hc3d9wi": {"link": "/r/GradSchool/comments/pkfnu6/does_anyone_get_anxiety_attacks_before_a_new/hc3d9wi/", "text": "It's totally understandable to feel overwhelmed and nervous about the new semester starting.  Especially since you started during COVID so you never got the on-site \"welcome to the program\" experience.  You're going to do great and the professor you're working with on your TA is going to be very supportive especially since your success is their success (and a good rating on the after-semester survey)!  Remember that everyone's incentivized to help you and to get you situated, so if you need help then reach out to any faculty member!\n\nYou made it into the program.  You're a capable and valid individual who has the skillsets to get it and survive.  You're in the same league as your colleagues.  Some might seem like they have their shit together but it's more just that they're busy trying to stay afloat.\n\nTake it day-by-day.  You'll ease into it.  You'll feel more comfortable being in a classroom setting being the instructor rather than the student.  You'll get more comfortable with your colleagues and friends.  You're going to realize that your role in the program and your research is there ready for you to kick butt on.\n\nYou're going to do great.  Your students are going to love you.  Funny thing, at the end of the semester my students had to design a building and do the entire 9 yards (Environmental assessment, building design, etc.).  They named the building after me.  \"HalfEatenPie Memorial Building\".  Yeah....  I'm not dead yet (far from it I hope).  But it was still a great laugh and heartwarming experience.  A student even made me a christmas card!  You're going to do great.\n\nAs one of the more \"senior\" people, your concerns are understandable.  However, you will do fine.  Do whatever you need to do to take care of yourself, but you're there for a reason and you'll kick ass at it once you start gearing up.", "author": "HalfEatenPie", "created": 1631127895, "upvotes": 38}}}