{"sid": "ppls2q", "link": "/r/GradSchool/comments/ppls2q/do_phd_rejected_applications_at_a_university_gets/", "title:": "Do PhD rejected applications at a university gets automatically considered for there masters programs (for USA universities)?", "text": "If I just apply to PhD -CS at a university and if I am rejected for PhD will my application be automatically considered for there masters -CS program ?\n\nOr do I have to apply to both of the applications (MS and PhD) to have a shot at MSCS at the university?", "author": "Icy_stars", "created": 1631825284, "retrieved": 1632844183, "over_18": false, "upvotes": 4, "upvote_ratio": 0.67, "comments": {"hd7w96c": {"link": "/r/GradSchool/comments/ppls2q/do_phd_rejected_applications_at_a_university_gets/hd7w96c/", "text": "It depends. For CS, I believe CU Boulder and UW Madison did. But other than those, I think you'll just have to read their policy.", "author": "roachRancher", "created": 1631893244, "upvotes": 1}, "hd778uw": {"link": "/r/GradSchool/comments/ppls2q/do_phd_rejected_applications_at_a_university_gets/hd778uw/", "text": "If you are applying for a PhD program, I would advise you to not accept a masters acceptance. It’s just not a good use of your time. Either get a job postgrad and reapply or accept a PhD app. I applied to 12 universities which was way too much. I got accepted to 4 PhD programs. I took the second “best” school I got into because it was a good balance of lifestyle and prestige. I already feel like a PhD can be a bit of a drag sometimes and I’ve really enjoyed my internships. My least favorite part of my PhD so far has been classes… \n\nWeird that the default seems to be if you don’t get into a PhD (which you’re paid to do) is often times to do a masters (which you have to pay even more than you’d be making as a PhD in tuition), when the more pragmatic alternative would just be to apply for jobs and reapply. If anything, a PhD student with industry experience is rid of the anxiety that they “may have liked industry more” which is a huge plus to an advisor since an anxious doubtful student is an unproductive one.", "author": "gentleboys", "created": 1631881909, "upvotes": 2}, "hd6fxei": {"link": "/r/GradSchool/comments/ppls2q/do_phd_rejected_applications_at_a_university_gets/hd6fxei/", "text": "This is something you would have to consult on a department to department basis. Usually this kind of question is in their FAQs", "author": "ULTIMATE_FROG", "created": 1631860231, "upvotes": 1}, "hd62ntw": {"link": "/r/GradSchool/comments/ppls2q/do_phd_rejected_applications_at_a_university_gets/hd62ntw/", "text": "Sometimes. On the application there will sometimes be a box you can check that says you are open to being considered for a masters program. Sometimes you have to apply to both. I applied to PhD, got accepted for masters without applying because I checked that box.", "author": "enginerd826", "created": 1631851396, "upvotes": 5}, "hd4sp5j": {"link": "/r/GradSchool/comments/ppls2q/do_phd_rejected_applications_at_a_university_gets/hd4sp5j/", "text": "Nope. They are different programs and have different program requirements. Get in contact with an admissions rep at the school who handles masters programs and they can tell you the difference between the two and which you should apply for.", "author": "--ikindahatereddit--", "created": 1631829145, "upvotes": 16}, "hd4kdx3": {"link": "/r/GradSchool/comments/ppls2q/do_phd_rejected_applications_at_a_university_gets/hd4kdx3/", "text": "No, you have to apply for both. A masters is not an easier PhD or a worse PhD, they’re entirely separate degrees that mean entirely separate things. You should know what you’re looking for.", "author": "wildechem", "created": 1631825577, "upvotes": 14}}}