{
  "sid": "qf7p3f",
  "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/",
  "title:": "Is feeling like you are ‘not good enough yet’ a good reason to go for a masters instead of a PhD?",
  "text": "Getting a  PhD is my ultimate goal, but I find the idea of applying to one very stressful. While my grades/scores are quite good, and I have substantial work experience I’m my field, I never did any undergraduate research. As such I don’t think any good PhD program will take me seriously. I’m very tempted to hedge my bets and get a masters first, so I have a couple more years to get research experience. Is not feeling worthy of a PhD yet a good reason to get a masters first instead? I just don’t wanna sell myself short.",
  "author": "Greenface1998",
  "created": 1635131280,
  "updated": 1635185315,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.84,
  "comments": {
    "hhy59h8": {
      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhy59h8/",
      "text": "Sounds good. You need to get some real research experience. You may find you don't like research at all or are not good at it. If you do like it and are good at it, you can always move to a PhD program afterwards.",
      "author": "fwafwa",
      "created": 1635134850,
      "upvotes": 18,
      "replies": {
        "hhz97up": {
          "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhz97up/",
          "text": "This wastes time. do a MS for two years then do a PhD for 4-5 so seven years. Or! enter a Ph.D. program and master out in two if you hate it or get a phd in 4-5 so net savings if went for a Ph.D. is about 2 years or more....Never get back the earning potential",
          "author": "rthomas10",
          "created": 1635165805,
          "upvotes": 3,
          "replies": {
            "hhzbghd": {
              "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhzbghd/",
              "text": "How much undergraduate research did you do?",
              "author": "Greenface1998",
              "created": 1635167019,
              "upvotes": 1,
              "replies": {
                "hhzc4en": {
                  "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhzc4en/",
                  "text": "Maybe a few weeks after graduating. I also volunteered in my advisors lab for the summer before starting. He paid me grad wages too. This allowed me to get experience and I had a adviser already when the rest of the class came in.",
                  "author": "rthomas10",
                  "created": 1635167372,
                  "upvotes": 1,
                  "replies": {
                    "hhzdp7c": {
                      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhzdp7c/",
                      "text": "What did you write about in your statement of purpose? That’s what I’m struggling with the most. It seems like I’m expected or have a thorough description of my past research experience and exactly what I wanna do in grad school. I don’t know enough to know just what I wanna do.",
                      "author": "Greenface1998",
                      "created": 1635168184,
                      "upvotes": 2,
                      "replies": {
                        "hhzkz94": {
                          "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhzkz94/",
                          "text": "If you don't know exactly say that but I wanted to be a chemist to help find drugs that benefit man even if I didn't directly contribute during my lifetime. I wanted stretch my knowledge and understanding of chemistry and science in general to better understand how the world around me functions. I think a paragraph or less was specific about Mr research.",
                          "author": "rthomas10",
                          "created": 1635171642,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhyz0oh": {
          "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhyz0oh/",
          "text": "[deleted]",
          "author": null,
          "created": 1635158982,
          "upvotes": -1,
          "replies": {
            "hhz1lln": {
              "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhz1lln/",
              "text": "I think you should read the comment you replied to again. OP was saying you might do research in master's and find out that you don't actually like it or aren't good at it. As in, you might save yourself from wasting time and money on a PhD if those things end up being the case. \n\nWhich also means the reverse could happen as well and you'd like it/be good at it and have a stronger application to a PhD program.",
              "author": "gnmxwazyaojvjthyp",
              "created": 1635160936,
              "upvotes": 2,
              "replies": {
                "hhz556o": {
                  "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhz556o/",
                  "text": "Oh yeah my bad. I was very tired when I first read that.",
                  "author": "Greenface1998",
                  "created": 1635163338,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhya5cl": {
      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhya5cl/",
      "text": "Your industry experience counts. You're not less qualified than a fresh college grad.\n\nYou can always master out of your PhD if it's not to your liking.",
      "author": "beepbooplazer",
      "created": 1635138084,
      "upvotes": 8,
      "replies": {
        "hhz9azf": {
          "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhz9azf/",
          "text": "This is the way.",
          "author": "rthomas10",
          "created": 1635165854,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhy1rly": {
      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhy1rly/",
      "text": "I felt the same as you and decided masters. I’m glad I did (but obviously related to COVID-19). I don’t think I could have done a 6 year program. So, had there not been a pandemic, would I feel the same? Idk. My life, as I am sure many others, would have been on a different path were it not for COVID.",
      "author": "Wait_you_can_see_me",
      "created": 1635132781,
      "upvotes": 5,
      "replies": {}
    },
    "hhyfh97": {
      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhyfh97/",
      "text": "This is how I feel except instead of good grades and scores I have really good research and work experience. I’m applying to both PhD programs and masters programs. Depending on your budget for applications, it may be worth for you to apply to PhD programs you’re interested in and a couple masters programs as a back-up so to say, if you get into a phd; great, if not then it answers your question. Most professors I’ve talked to say that a masters is a waste of time if you know you want a PhD. Of course if you can’t get into a PhD and would like to keep going academically in a mean time, a masters would be the ideal way to do. My grades and test scores make me feel like I’m not good enough so I completely get where you’re coming from. Applying is stressful but what helped me the most was speaking with faculty I’m interested in working with and getting validation for the research I’d like to pursue and asking any questions I may have. Good luck friend, regardless of whether you apply to phd programs or not, you’re enough!",
      "author": "SlothTheScientist",
      "created": 1635142064,
      "upvotes": 1,
      "replies": {}
    },
    "hhyze3q": {
      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhyze3q/",
      "text": "This is what I am doing! It will really help me prepare. Check what kind of requirements you will be exempt from if you continue with the PhD.",
      "author": "iloveregex",
      "created": 1635159274,
      "upvotes": 1,
      "replies": {}
    },
    "hhz0azv": {
      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhz0azv/",
      "text": "I know a ton of people that could not do a PhD without a masters. Some programs don't take students without a masters anyway. \n\nBut what you are feeling may never really go away no matter how far you go. Imposter syndrome is very real.",
      "author": "svBunahobin",
      "created": 1635159972,
      "upvotes": 1,
      "replies": {}
    },
    "hhz90rd": {
      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhz90rd/",
      "text": "no. apply to the PhD program and master out if you are so inclined but pursue your dreams....screw everyone else.",
      "author": "rthomas10",
      "created": 1635165691,
      "upvotes": 1,
      "replies": {
        "hhz9esn": {
          "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhz9esn/",
          "text": "I’m more concerned that I won’t get it. Or won’t get in where I want to get in. I don’t wanna sell myself short by sending out an application which isn’t representative of what I’m capable of research wise.",
          "author": "Greenface1998",
          "created": 1635165913,
          "upvotes": 1,
          "replies": {
            "hhza3xb": {
              "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhza3xb/",
              "text": "believe in yourself. No one, usually, has any research experience coming out of UG. You will get into where you get into. so many factors go into acceptance to grad program",
              "author": "rthomas10",
              "created": 1635166299,
              "upvotes": 1,
              "replies": {
                "hhzatuh": {
                  "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhzatuh/",
                  "text": "‘ you will get into where you get into’, yes , I get that. But like I said I don’t wanna sell myself short. If I could substantially increase the number of options I have for where to go by getting a masters degree first, then I am very tempted to do that. I’m not planning on going into academia after, and I’m in a fairly well paid field (ML), so the financial strain of a masters isn’t as much of an issue. And this field has a reputation for being discriminatory in terms of which programs it hires from. Industrial ML research labs are notoriously picky. So it seems worth it to me.\n\nBut I will  certainly consider it. My current plan is to apply only to places which I’d wanna go to, places which don’t feel like ‘settling for what I can get’, for both masters and PhD. So the safety plan will be to get a masters there, and apply for PhD latter, instead of getting PhD at place I’m not so excited about",
                  "author": "Greenface1998",
                  "created": 1635166685,
                  "upvotes": 1,
                  "replies": {
                    "hhzcax9": {
                      "link": "/r/GradSchool/comments/qf7p3f/is_feeling_like_you_are_not_good_enough_yet_a/hhzcax9/",
                      "text": "To each their own....",
                      "author": "rthomas10",
                      "created": 1635167467,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}