{
  "sid": "qk3gpj",
  "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/",
  "title:": "Graduate assistantships",
  "text": "I'm considering applying for graduate school again (masters programs in mathematics/statistics mainly - I have a B.S. in math at the moment). I applied to 3 university MS programs last year and requested graduate funding but was denied every time. Does anyone have advice on how to improve my chances for obtaining an assistantship - as it is the only way I can afford additional education.\n\nFor reference, the last time I applied I submitted my applications not long before the deadlines and did not apply to any PhD programs.\n\nThanks",
  "author": "Tannir48",
  "created": 1635730284,
  "updated": 1635780428,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "hiu99tl": {
      "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiu99tl/",
      "text": "Don’t apply to programs, apply to advisors. Programs don’t hire you or take you into their labs, advisors do. An advisor might find your app interesting without having talked to you, but if you’ve already spoken to them and built a relationship, you have a 10000% better chance of being accepted.",
      "author": "hiagha",
      "created": 1635733913,
      "upvotes": 11,
      "replies": {
        "hiucajs": {
          "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiucajs/",
          "text": "So you would suggest meeting with academic advisors for these programs before applying?",
          "author": "Tannir48",
          "created": 1635735504,
          "upvotes": 1,
          "replies": {
            "hiueiks": {
              "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiueiks/",
              "text": "Not academic advisors, I mean whoever’s lab you would end up in. The person who you would be doing research with and helping you to develop your thesis project.",
              "author": "hiagha",
              "created": 1635736677,
              "upvotes": 6,
              "replies": {
                "hiuk5mt": {
                  "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiuk5mt/",
                  "text": "Okay I'm a little confused about that and maybe that is because I do not understand these programs very well. How would I find out that information?",
                  "author": "Tannir48",
                  "created": 1635739853,
                  "upvotes": 2,
                  "replies": {
                    "hiulzwr": {
                      "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiulzwr/",
                      "text": "Look up the professors who’s research interests you, then email them to ask more about their research (don’t directly ask for money) and build a relationship with them",
                      "author": "dangernoodle2000",
                      "created": 1635741033,
                      "upvotes": 2,
                      "replies": {
                        "hivgiic": {
                          "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hivgiic/",
                          "text": "Not every master's program is research-based, and in many cases there won't be a research advisor. OP might be applying for a \"taught master's\", especially if outside the US, or in a non-STEM field. I've applied to master's programs with no research components in the past.\n\nI don't totally agree with \"don't directly ask for money\". Professors know that a lot of students depend on assistantships to pay for tuition, but you don't want to have a misunderstanding and end up penniless because you and the advisor never discussed money. If they don't bring it up, you should feel comfortable asking \"is this a funded opportunity?\" But maybe don't start a conversation with \"hi I need money, can I work in your lab?\"\n\nGenerally, master's programs do not offer funding, but PhD programs do (some master's programs allow assistantships only for especially well-prepared students who can teach). PhD programs are generally harder to get into, but most of them allow students to obtain a master's either along the way or if they choose to leave before completing the program. So one option is to apply for PhD programs and get started...if you want to stay on for the PhD (and pass the requirements) that's great, but if not you could leave with the master's.",
                          "author": "Hlgrphc",
                          "created": 1635767109,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "hivou01": {
                      "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hivou01/",
                      "text": "Most masters programs in my field (biology) are paid assistantships. I’m fact, most masters programs that I’m aware of in STEM are paid. Math and stats masters I know are paid. OP if you want to chat about grad school generally, DM me and we can talk about all the details of what is involved, the app process, etc. I’m a fourth year PhD student who would love to help!",
                      "author": "hiagha",
                      "created": 1635772242,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hiu5sje": {
      "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiu5sje/",
      "text": "Find an advisor who's interested in working with you on research ahead of time.  As far as I know funding for MS degrees is relatively rare, but an advisor might be able to tell you whether they'll probably have funding or not.",
      "author": "djp_hydro",
      "created": 1635732081,
      "upvotes": 4,
      "replies": {}
    },
    "hivrr9y": {
      "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hivrr9y/",
      "text": "You likely won't get funding for grad school if you are going for a Masters. Masters degrees are 100% money makers for colleges as they require zero research and are just classes most of the time. Even the small amount of research in a MS program isn't enough to fund a student. I keep pointing this out but it seems that no one is listening. It seems the MS is the next BS now. Everyone went and got a BS and the US is swimming with people with BS degrees and no jobs, Now people are swarming to a MS and soon there will be too many of them but I digress, a MS is not likely to get TA funding or research funding because of the short amount of time in the institution and the lack of research.",
      "author": "rthomas10",
      "created": 1635773787,
      "upvotes": 3,
      "replies": {}
    },
    "hiu5fb9": {
      "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiu5fb9/",
      "text": "You'll probably have better luck getting funding if you apply to PhD programs and then master out of them.",
      "author": "Ford-Fulkerson",
      "created": 1635731893,
      "upvotes": 4,
      "replies": {
        "hiualsm": {
          "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiualsm/",
          "text": "This is probably true, but it's also taking PhD spots from people who potentially *actually* want them.  I get it if you feel like this is your only option but it is not ideal.",
          "author": "CapWasRight",
          "created": 1635734607,
          "upvotes": 10,
          "replies": {}
        },
        "hiukjyx": {
          "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiukjyx/",
          "text": "If I applied for a PhD program I'd be likely to complete it since it is a serious time investment and I am interested in these programs to, primarily, gain further experience and practice in application of upper division mathematics. I am interested in the mathematics masters because I would prefer it to a PhD, though.",
          "author": "Tannir48",
          "created": 1635740101,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hiug54r": {
      "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiug54r/",
      "text": "So I found funding for master’s to be rare, but do exist. They tend to be in lower ranked programs where a TA for college algebra only in the master’s program is useful, for example. Make sure the website explicitly says funding for master’s available.\n\nI have math master’s funding if you want to PM me, I don’t want to put the school on here since the program is tiny.",
      "author": "anonymousbutterfly20",
      "created": 1635737554,
      "upvotes": 2,
      "replies": {
        "hiv2rew": {
          "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hiv2rew/",
          "text": "Hi, can I PM you as well? Looking to go for a master's in math, but I really don't want to take a bunch of loans or anything, and I'm not really sure which universities offer a good amount of funding.",
          "author": "the_silverwastes",
          "created": 1635755278,
          "upvotes": 1,
          "replies": {
            "hivc4qk": {
              "link": "/r/GradSchool/comments/qk3gpj/graduate_assistantships/hivc4qk/",
              "text": "Sure!",
              "author": "anonymousbutterfly20",
              "created": 1635763856,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}