{"sid": "pp3djf", "link": "/r/GradSchool/comments/pp3djf/international_student_grief/", "title:": "International student - grief", "text": "Hi everyone, I’m honestly just venting. I’m an international graduate student in my second semester. Everything was ok starting this semester although I didn’t feel very motivated. \n\nMy grandfather passed away back home a few days and I’ve been really struggling. I feel guilty that I’m unable to work or that I’m using this as an excuse (even though I know this is not true). \n\nIf anyone has gone through something similar how did you cope?", "author": "kairokween", "created": 1631755021, "retrieved": 1632844232, "over_18": false, "upvotes": 22, "upvote_ratio": 0.96, "comments": {"hd2p4ph": {"link": "/r/GradSchool/comments/pp3djf/international_student_grief/hd2p4ph/", "text": "Lost a close family member who I haven't been able to see for 3 years because of the pandemic and other reasons before. I was able to continue my semester, but I wasn't able to focus well at all. I decided that I would take the next semester off to fly back home and get some closure, and put just enough effort that I need to get through the semester. I knew that there is no point in trying to focus on thriving in my program when half my attention was on events in another country.\n\nI get the same feeling of using it as an excuse. It's not true though, I've learned. Grief really affects you unconsciously and maybe even physically, as much as you try to convince yourself otherwise. Whatever your conscious thoughts on it are (\"I should still be able to give 100%\", etc.) you will still be operating at less capacity because of it. \n\nI would suggest taking some time off at an opportune moment to focus your full attention on coming to terms with the loss, then coming back to grad school to focus your full attention there once again. No point in botching two jobs I'd say.", "author": "nbachickenlover", "created": 1631797923, "upvotes": 1}, "hd21rgo": {"link": "/r/GradSchool/comments/pp3djf/international_student_grief/hd21rgo/", "text": "I'm an international phd student and lost my grandma last year, the funeral was my first day of classes. I still have days where I'm struck by the grief and just have to stop what I'm doing. There's a lot of death and loss in the field that I study too, and sometimes I'll do an interview or read an article that sets me off thinking about grandma. It's tough.\n\nSo many people are navigating loss right now and haven't had the space, time, or pause they need. You're definitely not the only one for whom it's affecting their capacity to continue as normal and be as productive as you may have been in the past.\n\nI agree with the other commentor who said to mention it to a supervisor. While not everyone is sympathetic it can sometimes help.\n\nI hope you know that none of this is a reflection on you as a student, and I really hope the days get easier as they pass.", "author": "A1B6", "created": 1631781573, "upvotes": 5}, "hd1y1nb": {"link": "/r/GradSchool/comments/pp3djf/international_student_grief/hd1y1nb/", "text": "My condolences, OP. Been in your shoes and yes, it is tough. Reach out to your support network, or build one as you are doing here — and more importantly, talk. It means a lot to relieve that pain. \n\nMight seem mundane, but drop a note to your supervisor that you have had a bereavement and that its hitting you hard. \n\nTime heals. Holding you and yours in the light.", "author": "snorkgirl92", "created": 1631778077, "upvotes": 2}, "hd1gjn8": {"link": "/r/GradSchool/comments/pp3djf/international_student_grief/hd1gjn8/", "text": "I'm an international student who had my grandfather and cousin pass away when I was overseas studying. I'd be happy to chat if you want!", "author": "StudentAbroad22", "created": 1631765337, "upvotes": 6}, "hd19ae6": {"link": "/r/GradSchool/comments/pp3djf/international_student_grief/hd19ae6/", "text": "I don't really have any advice, I just want to wish you all the best. It sucks when you can't be home when you want to be or near family and friends during a time like this. \\*hugs\\*", "author": "RonnyTwoShoes", "created": 1631761363, "upvotes": 5}}}