{"sid": "pwlw2s", "link": "/r/GradSchool/comments/pwlw2s/making_my_presentation_for_my_thesis_defense_any/", "title:": "Making my presentation for my thesis defense. Any helpful guides?", "text": "I've searched all over my schools website and they only give me a thesis formatting guide not a defense one. Does anyone have any great guides for this?", "author": "suckuma", "created": 1632763386, "retrieved": 1632843943, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hehua7y": {"link": "/r/GradSchool/comments/pwlw2s/making_my_presentation_for_my_thesis_defense_any/hehua7y/", "text": "I had my defense during the pandemic (hit just a month before my defense) and actually had to record mine. I passed fine. If you want DM me and I will send mine to you!\n\nWhat helped me is sit down with a friend and describe my research (I already started mine as we had funding). He stopped me when he wanted more to really understand it. That helped me to notice what I completely thought was a given. Your defense is not only for your advisors, but for the entire department: don’t forget the basics. Also be clear about why your research is needed/important, explain why you have your hypotheses, and be clear about your methods (why those methods? Who used them before? How will it help you answer your questions?). Use your time smartly, but leave some room at the end - we tend to be quickly at presenting when we’re alone, but we need to slow down a bit in the presentation for everyone to follow. Use pictures when you can (methods, background, etc. are good places to use more images than text). Make short bullet points, no full sentences if possible, and do talk about each bullet point. Don’t just put it down so you don’t have to talk about it. People have a hard time reading and listening at the same time - work with that.\n\nEdit: present it to your friends! See if some in your department want to present and give feedback to each other.", "author": "Federwolf", "created": 1632764388, "upvotes": 1}}}