{
  "sid": "qc6c98",
  "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/",
  "title:": "Is it too late to study for the GRE?",
  "text": "I'm a terrible procrastinator. I took a gap year after graduating with my Bachelor's in psychology to work on my resume and prepare for graduate school (and also just to take a mental break after dealing with COVID-ified college). However, I still haven't begun studying for the GRE or done any research to narrow down the schools to which I'd like to apply. Am I just too late to feasibly do these things? Do I have to take another gap year now?",
  "author": "AlphaJerreth",
  "created": 1634751439,
  "updated": 1634849803,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.93,
  "comments": {
    "hhe5x6z": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhe5x6z/",
      "text": "Is it just the general GRE? Before freaking out, take one of the free practice tests. See how your score turns out. If it's high enough for the programs you want to apply to, then you could just take the test. Studying for the GRE is common but by no means necessary if you're already getting the score you want.\n\nYou should definitely start doing these things now, though. You'll need to notify your letter-writers soon. My first applications were due at the end of November when I applied.",
      "author": "passerem",
      "created": 1634754721,
      "upvotes": 21,
      "replies": {
        "hhebvqo": {
          "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhebvqo/",
          "text": "yeah agreed. I didn't really do any prep for the GRE and things turned out fine for me. A practice test will definitely help you identify if your scores are already good enough.",
          "author": "nickyfrags69",
          "created": 1634757111,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hhej3bt": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhej3bt/",
      "text": "My experience with the GRE is not that you really \"study\" for it, but become familiar with the type and format of the questions.  Yeah, there are some things you can study (e.g. word lists of exotic definitions), but for the most part, studying (for me) focused on understanding what the question was asking.\n\nSo, no, you haven't left it too late.  As others of have suggested, a few practice tests should help you a lot.",
      "author": "GamerTnT",
      "created": 1634759918,
      "upvotes": 14,
      "replies": {}
    },
    "hhe7jgg": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhe7jgg/",
      "text": "I think you should sit down and research schools right away because that will tell you how feasible it is to apply in the first place. Like if their deadlines are November 1st, it's probably too late if you haven't taken the GRE yet. But if they're December or January, you still have time. You probably have a list of schools in mind if you think about it, even if it's just ones in areas you'd like to live in. Just sit down and make a spreadsheet.\n\nI also second the person who said to take a practice GRE test after you figure out what deadlines are for programs. It helped me be more efficient in studying since I really didn't need to review every math concept they test on. If you bomb it, next year might be better (start studying earlier!) but if you're already above the cut offs for programs you want to apply to, you can just do maybe a small amount of reviewing and take the test this year.",
      "author": "KiwiTheKitty",
      "created": 1634755370,
      "upvotes": 8,
      "replies": {}
    },
    "hhe4jrw": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhe4jrw/",
      "text": "If you're already registered and you've already paid for it, I would just go ahead and change it. A lot of schools don't even require it any more. Have you looked into which schools you're applying to, and if they require the GRE?",
      "author": "saor_alba17",
      "created": 1634754166,
      "upvotes": 4,
      "replies": {}
    },
    "hhed85z": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhed85z/",
      "text": "Are you aiming for fall 2022? It's not impossible, that's for sure. It's potentially improbable, however, depending on the program you're interested in. If you're applying to a PhD program, it's probably not enough time to get all your ducks in a row - particularly if you haven't taken the GRE or narrowed down the schools.  If you're at that point, particularly the latter, then you haven't really done a lot of the heavy lifting, as what type(s) of programs you apply to can vary greatly between what schools offer what programs, what faculty are there, etc. If you're looking for a more general Master's program though, you have time still. But if you haven't contacted LOR writers, prepared your resume, or written a personal statement, these can take a while (and it can be considered rude to contact LOR writers \"last minute\").\n\nYou mention that you're a procrastinator, but you also had a boatload of time to do this. There could've easily been extenuating circumstances in your life preventing you from getting yourself together, even as simple as focusing on your mental health post-college. However, you should ask yourself if you really want to do this if you've put it off so long. The answer may still be yes, but your actions would indicate otherwise thus far.",
      "author": "nickyfrags69",
      "created": 1634757641,
      "upvotes": 3,
      "replies": {
        "hhfny3g": {
          "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhfny3g/",
          "text": "I don't think you understand how procrastination works.",
          "author": "AlphaJerreth",
          "created": 1634777631,
          "upvotes": -3,
          "replies": {
            "hhg5in9": {
              "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhg5in9/",
              "text": "If your procrastination is so bad that you took one gap year and probably need another because you still didn’t get things done in time, you probably are not cut out for grad school. Grad school consists of deadline after deadline of huge assignments that are never ending. Or you need to seek professional help.",
              "author": "adorationn01",
              "created": 1634785961,
              "upvotes": 5,
              "replies": {}
            },
            "hhill97": {
              "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhill97/",
              "text": "True, don’t bother",
              "author": "animelover9595",
              "created": 1634838145,
              "upvotes": 2,
              "replies": {}
            },
            "hhfokyg": {
              "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhfokyg/",
              "text": "Sounds like you don’t, actually. As a psychology major you should have an understanding that actions tend to be indicative of our true beliefs/attitudes. You had all this time to do this. I understand that you’re a “procrastinator” but for something that’s supposedly this important at some point it should’ve kicked in gear. When I said “you should ask yourself if you really wanna do this” I don’t mean that to be harsh, I’m genuinely trying to help. Because if you really do, you wouldn’t have waited this long in the cycle.\n\nI have ADHD, and I’m a pretty bad procrastinator myself. In almost every instance I’m waiting till the last minute for important things. Yet for something this future determinant (grad school apps) I had my shit in wicked early. Can’t be self handicapping.",
              "author": "nickyfrags69",
              "created": 1634777926,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhfjsn9": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhfjsn9/",
      "text": "Maybe it’s just me but I’m applying to psychology and non-psychology PhD/masters programs. None of which are requiring a GRE, I didn’t take the gre, don’t plan to. Just make a list of programs, check their gre reqs, and reach out to faculty you find an interest in. Most programs now won’t even look at a gre anymore",
      "author": "SlothTheScientist",
      "created": 1634775759,
      "upvotes": 2,
      "replies": {}
    },
    "hhhp782": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhhp782/",
      "text": "Double-check if schools you’re interested in require the GRE. Many programs are no longer requiring it (at least, for biomedical PhDs). \n\nBe a shame to cram for it, only to find it’s not required.",
      "author": "Tritagator",
      "created": 1634824753,
      "upvotes": 2,
      "replies": {}
    },
    "hhg3mlz": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhg3mlz/",
      "text": "Too late, you’ll have to take a gap year. Most programs have a dec 1 deadline. Some of my apps were due in November. It’s unprofessional getting letter writers to write last minute. I guess you theoretically can try to swing it, but you’re pretty late to the game. When I was applying I had my schools all picked out over summer, an excel spreadsheet made, drafts of essays done by September, and finalizing touches all of October and November. Most of my schools required personal statements, statements of purpose, AND diversity statements / writing samples. I wrote lots and lots of essays to tailor them towards the program. It takes time, something that shouldn’t be rushed. This should have all started a lot sooner if it was that important to you.",
      "author": "adorationn01",
      "created": 1634784997,
      "upvotes": 2,
      "replies": {}
    },
    "hhegfds": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhegfds/",
      "text": "Well it certainly is doable, i would suggest doing one of the two free prep tests to see where you're standing. If your scores are not bad the best way to go on about is to get the gregmat subscription and follow the 1 month study plan.\n\n&#x200B;\n\nDepending on your strengths, for example by getting a 160+ on quant on the first prep test, you can adjust your studying accordingly.",
      "author": "Kristitsope",
      "created": 1634758882,
      "upvotes": 1,
      "replies": {}
    },
    "hhevu7r": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhevu7r/",
      "text": "Do you have your reference letters and SOP (mostly) ready to go? In that case like other commenters said just familiarize yourself with the GRE question formats, take it ASAP, and do as best you can. If you haven't started anything at all about the application process you are probably screwed.",
      "author": "DrJPepper",
      "created": 1634765002,
      "upvotes": 1,
      "replies": {}
    },
    "hhexer9": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhexer9/",
      "text": "First make a list of a few schools, even if you're not sure about them, and see if they even want the GRE. \n\nIf most of them do, then it depends on A) how competitive the schools are and B) how bad you expect your baseline score to be (maybe plus a week or two of studying.) \n\nIf there's a huge deficit between A and B, you might be ahead to wait another year. But, since you can always retake the GRE, you have nothing to lose by trying now except for A) a pile of cash for testing fees and B) about half a day of your life.",
      "author": "myristicae",
      "created": 1634765664,
      "upvotes": 1,
      "replies": {}
    },
    "hhfcx82": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhfcx82/",
      "text": "Check out GREMatt on YouTube. I watched and studied of him for a month and got competitive GRE scores.",
      "author": "Diver808",
      "created": 1634772574,
      "upvotes": 1,
      "replies": {}
    },
    "hhfd515": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhfd515/",
      "text": "I think if you're applying for masters it can be done! Also if it doesn't happen you can plan to apply for the Spring semester instead of waiting a whole other year. I didn't do any of my applying until November. (I did take the GRE earlier but only spent about 20 hrs studying for it and didn't do anything else early...) And got into my masters program, it ended up working out well for me but its not how I would recommend doing it... I would spend today taking a GRE practice exam to see where you're at (it can improve a bit with just a little amount of studying but very drastic changes are unlikely. I think both my math and verbal went up maybe 5 pts compared to the first practice exam.) \nI'd spend tomorrow taking a look at schools/advisors  and see if there are at least 3 you'd be interested in & check their GRE requirements.\nIf you decide you are planning on applying now and you haven't yet, on Friday I'd reach out to 3 profs from undergrad and ask if they'd be willing to write you a LOR.",
      "author": "Puzzled_Season_1881",
      "created": 1634772676,
      "upvotes": 1,
      "replies": {}
    },
    "hhhuhab": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhhuhab/",
      "text": "after college I also took a gap year and took the GRE at the last minute because it was kind of a late decision. I \"studied\" by taking a bunch of the practice tests. my score was average but it was good enough with my other application materials since I did pretty well in college. also many schools don't require the GRE anymore in the US. so I think you should still go for it.",
      "author": "LaLexxia",
      "created": 1634827111,
      "upvotes": 1,
      "replies": {}
    },
    "hhhv48c": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhhv48c/",
      "text": "You may not need the GRE at all and if you do, you probably won't need to study for the whole thing.\n\nFor instance, I was a STEM major and made a A in calculus... Back when I took it in hs. I'm good at math, skill-wise, but it's still a use it or lose it kind of thing and I hadn't taken a math class since hs so I worked solely on math. I didn't bother to study for writing or reading (and honestly idk how you would) and did maybe a few days of math prep. I didn't do as well as I could have if I had really crunched on prep but I got above a 50th percentile and had no problem getting into my top choice programs.\n\nThe GRE isn't like the MCAT or LSAT and you likely can take it this month with a bit of prep and do fine on it. Now, in terms of getting letters of rec written and submitted in a timely manner... That might be a different story. I'd say if apps are due Dec or Jan, then you could make it but some probably had Oct 1 cutoff dates.",
      "author": "Lucky-Reporter-6460",
      "created": 1634827386,
      "upvotes": 1,
      "replies": {}
    },
    "hhin6o1": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhin6o1/",
      "text": "I had planned to do a masters in public health (most programs I had didn’t require a GRE) and last minute decided to switch to biomedical sciences. I had about 3.5 weeks (end of October Bc due dates were in Nov.) to study give or take. And my goal was to get a 320. I took a practice test to see what my starting score was and got a practice book off Amazon. I studied everyday for 4hrs min.  Some days more. I took a practice test after 2weeks. Saw what I needed to improve on and made that my main focus for watching supplemental vids on YouTube and just did practice questions over and over.",
      "author": "wordymagic_in_me",
      "created": 1634838792,
      "upvotes": 1,
      "replies": {}
    },
    "hhevn4v": {
      "link": "/r/GradSchool/comments/qc6c98/is_it_too_late_to_study_for_the_gre/hhevn4v/",
      "text": "Studying for the gre is, well, grades 1-12 and college isn't it?",
      "author": "rthomas10",
      "created": 1634764920,
      "upvotes": 0,
      "replies": {}
    }
  }
}