{
  "sid": "idvwyo",
  "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/",
  "title:": "I hope other grad students in California are doing okay",
  "text": "I know we all have our days, but I’ve been feeling really overwhelmed recently and the fires raging across our state are just icing on the cake. Sometimes my only reprieve was going out for a walk outside but now that’s impossible because of the dangerous air quality. \n\nAnyway, I just hope everyone is doing okay and staying safe, especially those of you living in areas that have to be evacuated. For anyone feeling the same way, feel free to PM me if you need to vent.",
  "author": "apescapes",
  "created": 1598013425,
  "over_18": false,
  "upvotes": 408,
  "upvote_ratio": 0.98,
  "comments": {
    "g2emfcr": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2emfcr/",
      "text": "I'm Californian, but am at grad school on the east coast-ish. I hate that CA is burning down. I grew up right next to Yosemite and there's a big fire in my home county (Tuolumne). I'm worried of losing the big trees and biodiversity in northern CA. It's so painful to watch.",
      "author": "Aerismeow",
      "created": 1598068734,
      "upvotes": 3,
      "replies": {}
    },
    "g2elt85": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2elt85/",
      "text": "My lab research has been shut down since late March which was depressing. Being stuck at home all this time is depressing. And now this and weather is the cherry on top. This year has been nothing but exhausting. Hope everyone is doing well",
      "author": "LilDcent",
      "created": 1598068498,
      "upvotes": 2,
      "replies": {}
    },
    "g2e5ol8": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2e5ol8/",
      "text": "Best of luck. My first committee meeting was supposed to be the week after hurricane Harvey and it was a shit show",
      "author": "ImJustAverage",
      "created": 1598062450,
      "upvotes": 3,
      "replies": {}
    },
    "g2cxw4l": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cxw4l/",
      "text": "I'm currently standing in line outside in the smoke with a hundred other coughing students in masks waiting to get keys for the only apartment complex I can afford on my grad student wages. My partner can't help me move my bookshelves because of a hand injury that they can't get treated because the student health center is basically on lockdown, so I'm definitely going to be fined by the unit I'm moving out of. Fire crisis, healthcare crisis, pandemic crisis, academic precarity crisis, rental crisis, all at the same time. I am so tired.",
      "author": "oh_no_not_the_bees",
      "created": 1598038942,
      "upvotes": 7,
      "replies": {}
    },
    "g2cxpte": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cxpte/",
      "text": "What are you guys going to do? I live in northern CA now, but I was supposed to be going to grad school in the UK. Not only has the program changed to an online format, but I can't even move on campus because of visa and immigration issues. I'm just stuck here indefinitely.\n\n\n\n\nI'm cut off from all the support and resources of my international school. There's power outages because of PG&E (just as there were last year, and the year before). The stress of the fires aside, it's also affecting wifi--I'm currently using my phone's data, but I don't have an unlimited plan. I'm at my parent's house because I was supposed to be moving on campus in three weeks--there's no place for me to study here. I don't know what to do, and I don't know if/how I should communicate these concerns to the program director or anyone else at my school.",
      "author": "Gr8panjandrum",
      "created": 1598038858,
      "upvotes": 3,
      "replies": {}
    },
    "g2cn3dm": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cn3dm/",
      "text": "Being told that we might get power outages while taking qualifying exams at home is not fun...  \nThe heat and not being able to open my windows because of the smoke only makes things worse :(",
      "author": "Sleeper4real",
      "created": 1598033796,
      "upvotes": 5,
      "replies": {}
    },
    "g2cm55o": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cm55o/",
      "text": "I've lived in California all my life, in both SoCal and NorCal, and I can't recall wildfires as devastating as in recent years. It's heartbreaking and on top of the pandemic, everything just feels hopeless at times. I'm fortunate that there aren't any fires near me, right now, but  my university (UC Riverside) is pretty close to fire-prone areas. My heart goes out to my fellow grad students up north and by the fires in Oregon. Stay safe everyone! I hope that the weather will turn around and provide some help soon.",
      "author": "CuriosityDreams",
      "created": 1598033331,
      "upvotes": 5,
      "replies": {}
    },
    "g2cjngj": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cjngj/",
      "text": "all four of the people i knew in California PhD programs have quit & are moving/preparing to move, even the ones who were attending top programs in their field(s). this is on top of all the other folks i know who quit their programs for non-fire related reasons in other parts of the country in the last 5 months. i think the solitude & stress of covid really laid bare & made intolerable the worst and ugliest parts of grad school for a lot of people. \n\ni'm so, so sorry for all the absolutely fucked up stuff being listed in this thread--govts & universities should really be ashamed of what they're expecting people to suffer through without any safety nets.",
      "author": "blueberries______",
      "created": 1598032127,
      "upvotes": 8,
      "replies": {}
    },
    "g2ci7th": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2ci7th/",
      "text": "I and half my cohort are out-of-towners who just moved here at max two weeks ago and now I'm trying to figure out who doesn't have a car and where family is so I can get everyone bugged out safely if we get the order. In a pandemic. Where anyone could be an asymptomatic carrier. Oh yeah and classes just started and I already have homework. Plus all the family friends I know in the area that I was going to evac to are also at risk of evacuation.\n\nAccepting a graduate school offer seemed like a great idea before lockdown hit and the fires started",
      "author": "ConfusedCuddlefish",
      "created": 1598031447,
      "upvotes": 9,
      "replies": {
        "g2cm90n": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cm90n/",
          "text": "[deleted]",
          "author": null,
          "created": 1598033385,
          "upvotes": 3,
          "replies": {
            "g2cn9yb": {
              "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cn9yb/",
              "text": "I haven't heard many statements from the uni. The most I know is that a lot of professors have been evacuated already and some classes are cancelled. There seems to just be a giant news freeze as everyone's occupied with the fire",
              "author": "ConfusedCuddlefish",
              "created": 1598033884,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g2ci1hx": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2ci1hx/",
      "text": "My school (UC Davis) is pretty safe because we are surrounded by agricultural land that doesn't burn easily but the air quality is always terrible during fires because of how smoke settles in the Central Valley. I was supposed to go camping this weekend and was really looking forward to getting out of the house for a bit. I originally thought I'd want to stay in California after graduating but this is ridiculous. I'm just hoping I'll be out before next fire season and able to move back to the PNW where I'm from.",
      "author": "MsAggieCoffee",
      "created": 1598031361,
      "upvotes": 8,
      "replies": {
        "g2di39x": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2di39x/",
          "text": "Dude, so much ash coupled with the heat wave here in Davis. We are pretty safe, but I have an evac bag packed just in case. You never know how the winds could change and it's better to be overprepared.",
          "author": "Abiesconcolor",
          "created": 1598049300,
          "upvotes": 3,
          "replies": {
            "g2dkreq": {
              "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2dkreq/",
              "text": "Yeah, I have stuff packed too, and a full tank of gas. I'm prepared and informed, but trying not to worry too much.",
              "author": "MsAggieCoffee",
              "created": 1598050781,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g2c4323": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c4323/",
      "text": "They’re grad students in CA. I don’t think they were ok to begin with.",
      "author": null,
      "created": 1598025315,
      "upvotes": -15,
      "replies": {}
    },
    "g2c0rqr": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c0rqr/",
      "text": "Dude fuck this, this Thursday I get to drive a UHaul while towing a car in between some wildfires DURING A PANDEMIC I guess????? WHAT THE FUCK WHAT MOVIE IS THIS",
      "author": "chonkycatsbestcats",
      "created": 1598023831,
      "upvotes": 160,
      "replies": {
        "g2c2ziw": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c2ziw/",
          "text": "[deleted]",
          "author": null,
          "created": 1598024852,
          "upvotes": 56,
          "replies": {
            "g2ccgj4": {
              "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2ccgj4/",
              "text": "And it's  literally only going to get worse going forwards. Neither American political party is serious about mitigating the looming climate crisis, nor the wildfires, droughts, famines, storms, pestilence, wars, or refugees that will come with it.\n\nAt least I don't have kids.",
              "author": "RagePoop",
              "created": 1598028890,
              "upvotes": 43,
              "replies": {
                "g2chygv": {
                  "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2chygv/",
                  "text": "r/collapse",
                  "author": "rukwitme",
                  "created": 1598031321,
                  "upvotes": 9,
                  "replies": {
                    "g2chzo5": {
                      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2chzo5/",
                      "text": "Here's a sneak peek of /r/collapse using the [top posts](https://np.reddit.com/r/collapse/top/?sort=top&t=year) of the year!\n\n\\#1: [The US is a Shithole Country](https://np.reddit.com/r/collapse/comments/gv7ofn/the_us_is_a_shithole_country/)  \n\\#2: [This is a class war](https://np.reddit.com/r/collapse/comments/h8f1m3/this_is_a_class_war/)  \n\\#3: [Interesting Times](https://i.redd.it/98fyhfza47841.jpg) | [288 comments](https://np.reddit.com/r/collapse/comments/fhzx2q/interesting_times/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                      "author": "sneakpeekbot",
                      "created": 1598031337,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                },
                "g2d8gen": {
                  "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2d8gen/",
                  "text": "I'm not American so I don't know the details, but didn't Biden pledge 2 trillion to the energy transition? Seems serious too me?",
                  "author": "unmistakableregret",
                  "created": 1598044194,
                  "upvotes": 2,
                  "replies": {
                    "g2dabfy": {
                      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2dabfy/",
                      "text": "That people think throwing money at a problem is going to magically solve it is an indictment of how poorly people recognize the scale and immediacy of this threat.\n\n2 trillion dollars in...natural gas and fracking technology, solar panels, and electric cars while doing little else to attack the fundamental problem of overconsumption of energy period.",
                      "author": "eng2016a",
                      "created": 1598045154,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "g2ez433": {
                      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2ez433/",
                      "text": "Right out the gates, a political promise during an election cycle is hardly money in hand, hell it's not even in the bush.\n\nThis crisis is going to require World war level of global mobilization, cooperation, and resources. Everything from R&D on increasing the efficiency and reducing the environmental footprint of green energy sources and water desalinization to revamped thorium salt breeder nuclear reactors, widescale, low-impact, agricultural projects. We need Federal Jobs programs and an international body capable of systematically distributing the hundreds of millions of future climate refugees amongst different new host countries.\n\nInstead the dnc just walked back axing fossil fuel subsidies from the party platform.",
                      "author": "RagePoop",
                      "created": 1598074006,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g2e2lf2": {
              "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2e2lf2/",
              "text": "Meanwhile the CCP media (Chinese state media) released videos of people partying in Wuhan. I don't even know whether I should be angry or not..",
              "author": "vajra_",
              "created": 1598061027,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g2cnl8q": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cnl8q/",
          "text": "I have been to California last year and I must say this is one of the places I would move to stay and work for a long time. Going over these comments I could not imagine the difference between what was etched in my memory and present day reality there.",
          "author": "DSPandML",
          "created": 1598034040,
          "upvotes": 6,
          "replies": {
            "g2cu028": {
              "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cu028/",
              "text": "My take on it from like 8 weeks vacationing or attending conferences there is that it’s pretty much heaven when it’s not on fire, you have money to pay rent, and you have a car (and money for insurance) where public transport is not easy...",
              "author": "chonkycatsbestcats",
              "created": 1598037154,
              "upvotes": 12,
              "replies": {
                "g2cynur": {
                  "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2cynur/",
                  "text": "Yeah I lived there most of my life and that sounds about right.",
                  "author": "lover_of_pancakes",
                  "created": 1598039319,
                  "upvotes": 4,
                  "replies": {}
                },
                "g2daf5n": {
                  "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2daf5n/",
                  "text": "California has lovely weather 10 months out of the year and really the only problems we face are wildfires and the occasional earthquake. It's not like it ever rains or storms here.",
                  "author": "eng2016a",
                  "created": 1598045209,
                  "upvotes": 3,
                  "replies": {
                    "g2f8ifd": {
                      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2f8ifd/",
                      "text": "shh don't tell the bay area",
                      "author": "bigvenusaurguy",
                      "created": 1598077687,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2c0p4y": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c0p4y/",
      "text": "I'm a born and raised Californian but I moved away for grad school. I feel so helpless watching my home state fight off fires and a pandemic from afar. Not that I can do anything to help even if I were home...it just feels extra shitty. There's also the added bonus of being homesick.",
      "author": "mmaireenehc",
      "created": 1598023796,
      "upvotes": 9,
      "replies": {}
    },
    "g2c0mp4": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c0mp4/",
      "text": "We just got an email that the fire is a mile away from our campus, University of California, Santa Cruz.... granted it's a big campus in the middle of the forest, but 1 mile is way too close for comfort. But everyone l know who lives up there is safe and evacuated, so that's a relief.",
      "author": "kodakrat74",
      "created": 1598023762,
      "upvotes": 46,
      "replies": {
        "g2c0yen": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c0yen/",
          "text": "Yeah I’ve been ready to evac at a moment’s notice since campus was evacuated yesterday and I live right on the edge of Pogonip. I was afraid to sleep last night in case conditions changed.",
          "author": "Thalassiosiren",
          "created": 1598023923,
          "upvotes": 5,
          "replies": {
            "g2c3vpf": {
              "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c3vpf/",
              "text": "Yeah that is a little two close for comfort. Faculty housing near Pogonip was evacuated so I'd consider leaving too, if only for piece of mind and better air quality. \n\nBut it's great you're all packed up and ready to go! Here's a fire map I've been using to track it, it's still pretty far from the city:    [https://firms2.modaps.eosdis.nasa.gov/map/#d:2020-08-20..2020-08-21;l:street;@-122.1,37.1,12z](https://firms2.modaps.eosdis.nasa.gov/map/#d:2020-08-20..2020-08-21;l:street;@-122.1,37.1,12z)",
              "author": "kodakrat74",
              "created": 1598025231,
              "upvotes": 2,
              "replies": {
                "g2c58bz": {
                  "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c58bz/",
                  "text": "Thanks! I haven’t used that map site yet but it looks helpful. My former roommate who now lives in Watsonville just offered up his place to me so I’ll probably go there. I hope you are somewhere safe!",
                  "author": "Thalassiosiren",
                  "created": 1598025808,
                  "upvotes": 2,
                  "replies": {
                    "g2c5pxa": {
                      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c5pxa/",
                      "text": "Omg! :( Hopefully, you won't need to evacuate, but hope you stay safe if you do!",
                      "author": "saltedcheesetea",
                      "created": 1598026024,
                      "upvotes": 3,
                      "replies": {
                        "g2ca29d": {
                          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2ca29d/",
                          "text": "Thanks! :)",
                          "author": "Thalassiosiren",
                          "created": 1598027879,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2bzllg": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2bzllg/",
      "text": "I’ve lived in California my whole life but moved away for grad school. It’s devastating to watch this all happen again. I can’t believe how insanely awful the fires have been in the last 5 years - it’s like nothing I’ve seen before. \n\nStay safe and healthy everyone. Wear your masks (now they have two purposes).",
      "author": "banamana27",
      "created": 1598023248,
      "upvotes": 18,
      "replies": {}
    },
    "g2bysg5": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2bysg5/",
      "text": "Same, and my throat has been burning the past few days (not sure if from the smoke or from a potential case of covid) and now I'm self-isolating in my room which is so much harder when you can't open a window. :(",
      "author": "saltedcheesetea",
      "created": 1598022842,
      "upvotes": 23,
      "replies": {
        "g2c13li": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c13li/",
          "text": "Mine too!! I hope it’s the smoke cuz it was fine before",
          "author": "Thalassiosiren",
          "created": 1598023993,
          "upvotes": 3,
          "replies": {
            "g2c5gts": {
              "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2c5gts/",
              "text": "I'm glad to hear it's not just me! Hopefully, it's just from the smoke.",
              "author": "saltedcheesetea",
              "created": 1598025912,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g2bvdde": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2bvdde/",
      "text": "Sending love to all the other Californians.",
      "author": "-unhrdof-",
      "created": 1598021087,
      "upvotes": 8,
      "replies": {}
    },
    "g2bv5vu": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2bv5vu/",
      "text": "My Dad’s house just burned down...it’s all gone. Luckily nobody was home but neighbors were scrambling to get out through the flames. It just swept in so quickly, absolutely terrifying.",
      "author": "UCDeezwalnutz",
      "created": 1598020980,
      "upvotes": 71,
      "replies": {
        "g2bwih4": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2bwih4/",
          "text": "I’m so sorry.",
          "author": "ricflairdripdrop",
          "created": 1598021677,
          "upvotes": 9,
          "replies": {}
        },
        "g2eigls": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2eigls/",
          "text": "I'm sorry :( My best friend's dad just lost his house too, up in Boulder creek. \n\nI'm surprised by how many people even in CA are unaware of how many people have lost their homes. I guess more info will come out when the fires die down and the destroyed structures can be \"officially counted\".",
          "author": "kodakrat74",
          "created": 1598067195,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g2bsay3": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2bsay3/",
      "text": "The air quality has been so awful, and on top of this extreme heat 😞",
      "author": "microvan",
      "created": 1598019471,
      "upvotes": 17,
      "replies": {}
    },
    "g2bqtet": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2bqtet/",
      "text": "Love and support from a grad student in the hurricane cone in Florida ♥️",
      "author": "Novel_Rutabaga",
      "created": 1598018666,
      "upvotes": 31,
      "replies": {}
    },
    "g2boxbg": {
      "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2boxbg/",
      "text": "For real, it’s just getting more apocalyptic. Not great feels.",
      "author": "spacefurl",
      "created": 1598017605,
      "upvotes": 73,
      "replies": {
        "g2crz5k": {
          "link": "/r/GradSchool/comments/idvwyo/i_hope_other_grad_students_in_california_are/g2crz5k/",
          "text": "Not a Californian but a few years ago we had a for nearby. The city gave out asthma inhalers and the smoke was so thick it looked like twilight. You couldn't see across the street. I just remember calling my boyfriend and family. It was eerie. Anyways,  this will hopefully pass. Good luck",
          "author": "bitetheboxer",
          "created": 1598036164,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634067349
}