{"sid": "pvgpje", "link": "/r/GradSchool/comments/pvgpje/interests_are_too_broad/", "title:": "Interests are too broad", "text": "I feel like my interests in my field are too broad to continue into PhD. Honestly, I find that any project that I find interesting as long as it pertains to knowledge is something that I could easily & quickly devote myself to. As I’m in my masters now and struggling by jumping all over the board with potential thesis ideas, I’m concerned this will be a problem if I wanted to do PhD. Seems like people and potential advisors want you to be solely interested in their specific niche. However, I’m personally in the mind set that having a variety of skills in my field will allow me to be a better researcher.\n\nI realize that my projects (thesis/dissertation) would be rather specific, but as far as being able to at least express to people that “oh hey ya I have interest in this and that too” I wish that seemed more common.", "author": "iredditalready13", "created": 1632607843, "retrieved": 1632952027, "over_18": false, "upvotes": 13, "upvote_ratio": 0.93, "comments": {"heaxi7d": {"link": "/r/GradSchool/comments/pvgpje/interests_are_too_broad/heaxi7d/", "text": "Take a break and work. Working in your field will help you narrow down your interests and identify real-world gaps in research. I took 7 years between master's and PhD.", "author": "Interesting-Gold-720", "created": 1632627028, "upvotes": 2}, "heaja45": {"link": "/r/GradSchool/comments/pvgpje/interests_are_too_broad/heaja45/", "text": "Focus and ability to see projects through, even when they're no longer the most interesting thing on your desk, is super important. At least in my experience, that's all that decent advisors demand. Sure, there are definitely advisors that are really territorial and want your full attention on their work and discourage you from having your own collaborations or pursuing parallel training in your field, but they typically are not so great advisors. \n\nAlso, there's variability between fields or even departments within the same field regarding the culture around collaboration and having your fingers in multiple pies. You might find an adjacent or intersecting field that will better support breadth in your area of study.", "author": "aggressive-teaspoon", "created": 1632620031, "upvotes": 3}, "he9zvjo": {"link": "/r/GradSchool/comments/pvgpje/interests_are_too_broad/he9zvjo/", "text": "I think you only consider thesis/dissertation to be the only way of expressing your ideology, and that is not entirely correct. I think thesis and dissertations are more like to coach you on how to write more afterwards in whatsoever area you choose. Try seeing it from this perspective. You can freely write about different topics and get published anytime afterwards, infact your later scholarly works are more authoritative than thesis. I hope I make some sense.", "author": "TrySubstantial7579", "created": 1632610680, "upvotes": 2}, "he9zich": {"link": "/r/GradSchool/comments/pvgpje/interests_are_too_broad/he9zich/", "text": "I don’t think this is a bad thing. Advisors want you to be interested in their area, but that does not mean you can’t have outside interests. Part of doing a PhD is honing those interests.", "author": "RoyalEagle0408", "created": 1632610505, "upvotes": 3}, "he9uq0r": {"link": "/r/GradSchool/comments/pvgpje/interests_are_too_broad/he9uq0r/", "text": "i literally feel the same way..", "author": "LimpAirport", "created": 1632608239, "upvotes": 6}}}