{
  "sid": "po9h6s",
  "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/",
  "title:": "I don't know anyone who's applied for Grad school, please help",
  "text": "Ive sent this to r/gradsadmissions but it got buried rather quickly, so I'll be reposting it here.\n\n(Profile)\n\nI am in my last year of undergrad (B.A) at a middling university in Canada, my current field of studies include all of IR/Poli sci/History, and I have recently decided on pursuing a master's degree. \n\nMy gpa is 2.85 not very good\n\n_______\n\nLet me cut straight to the point, I want to study abroad in another English speaking country, and after looking at several schools I found that the deadlines and rules are so different from school to school, I'm kinda lost.\n\nHow much time do I have to allocate to writing my applications if I were to select say 6-7 schools?\n\nI know of at least two profs that have verbally agreed to write LoRs for me, but how many is a good number? or are they the more the merrier? \n\nHow do LoRs work? Like I don't know how profs send out these letters to every school that the student applies for, and is there a need to contact them months in advance?\n\nFor most American schools that I've checked has a GRE requirement and math is a big concern for me, so how much do GREs matter?\n\nLastly, what are the best schools in America or Britain that I realistically have a shot in? Like schools that aren't IVY or world top 50, has a program that fits my field of expertise, and a flexible requirement.",
  "author": "MemphisCanadians",
  "created": 1631646927,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hcvaes4": {
      "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcvaes4/",
      "text": "The first step in applying to grad school is to contact the advisors you want to work with. 99% of advisors won't admit a student who randomly applies to work with them without having contacted them first. \n\nThe personal statements will all be pretty similar you'll just have to make a few adjustments to each one so that it's unique to the university you're applying to. But to get the overall personal statement done and edited expect to spend ~3 weeks (proof readers need time to give feedback).\n\nIt's a little late to be asking what schools are good so I suggest spending a lot of time researching professors who's interested align with yours. The timeline is usually you'll wanted to have started contacting advisors by the beginning of September in the US bc they can take a couple weeks to respond. \n\nThe number of recommendation letters will be specified in your application. The professors know how to send letters of rec,  they've done it plenty of times before. Don't send more letters of rec than are specified in the application.\n\nIn the US most grad programs are getting rid of the gre requirement but it varies from program to program. If you're applying to a large program then they might require it to weed out some applicants. Also be prepared to explain the low GPA. Most universities want at least a 3.0, but smaller programs can be flexible with this if you can explain it to them.",
      "author": "hakeemalajawan",
      "created": 1631653146,
      "upvotes": 2,
      "replies": {
        "hcvbqdo": {
          "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcvbqdo/",
          "text": "This is very helpful, thank you so much! I didn't know I have to contact the advisors of the respective schools I'm applying to 😅\n\nLemme hand you my free silver",
          "author": "MemphisCanadians",
          "created": 1631653692,
          "upvotes": 2,
          "replies": {
            "hd4q2oj": {
              "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hd4q2oj/",
              "text": "This person has good advice but this is probably totally wrong for your program: \n\n>\tThe first step in applying to grad school is to contact the advisors you want to work with. 99% of advisors won't admit a student who randomly applies to work with them without having contacted them first\n\nThis is the case for STEM degrees, but most Humanities/English/IR/etc (the 'soft' sciences and non-sciences) DO NOT want you to contact potential advisors before applying for a master's. This sub is very STEM-oriented which can cause problems when non-STEM people ask for advice. \n\nI just started my MA Comms program in Canada, 5 out of the 6 schools I applied (mostly in the US) to specifically stated that they did not want us to reach out to profs. Some didn't make it clear on their websites-- I reached out to the program's graduate admissions coordinator and they usually got back to me quickly. \n\nAt the master's level, they don't expect you to know exactly what you want to study. They just want a general idea and for you to mention a few faculty members at the school who have similar interests in your SOP. You'll be assigned an interim advisor upon matriculation, then go on to either make that advisor official or switch to another after you complete your coursework.",
              "author": "zeph_yr",
              "created": 1631827997,
              "upvotes": 2,
              "replies": {
                "hd4se5o": {
                  "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hd4se5o/",
                  "text": "And this is why I felt the need to go ask on reddit, I was looking at the MA East asian studies programs at various schools and was really confused with the requirements. \n\nI'll take another week learning about the process and go from there.",
                  "author": "MemphisCanadians",
                  "created": 1631829011,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hcuxcrb": {
      "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcuxcrb/",
      "text": "What is your timeline here? End goal? \n\nIt seems as if you don’t know what you wanna do and you’re just kind of grasping at straws.",
      "author": "No-Hat1419",
      "created": 1631647972,
      "upvotes": 1,
      "replies": {
        "hcuzg8w": {
          "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcuzg8w/",
          "text": "Apologies, I wrote all that in a rush last night.\n\nHere's my plan for the future, and I'll add that to my post later as well.\n\n\n\nI plan to contact my undergrad profs later this month regarding the LoRs.\n\nI will take the GRE once by December and will apply to up to 7 schools.\n\nI plan to study grad school by Fall 2022.\n\nI am fine with any program that relates to my current field of studies as long as that helps me get accepted to a prestigious university.\n\nMy goal follwing grad school is to literally get a decent full-time job. Can be anything from well known NGOs, to think-tanks, to defense industry, to the media. I don't think that's too ambitious of a goal is it?",
          "author": "MemphisCanadians",
          "created": 1631648797,
          "upvotes": 1,
          "replies": {
            "hcv4dwf": {
              "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcv4dwf/",
              "text": "It seems like you just answered all your own questions here. Execute the plan.",
              "author": "No-Hat1419",
              "created": 1631650742,
              "upvotes": 2,
              "replies": {
                "hcv4zxs": {
                  "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcv4zxs/",
                  "text": "Yeah I got a plan alright, that doesn't mean anything if I don't know which school to apply/what schools are best for me. I still want my Qs answered\n\n> what are the best schools in America or Britain that I realistically have a shot in? Like schools that aren't IVY or world top 50, has a program that fits my field of expertise, and a flexible requirement.",
                  "author": "MemphisCanadians",
                  "created": 1631650982,
                  "upvotes": 0,
                  "replies": {
                    "hcv6i4i": {
                      "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcv6i4i/",
                      "text": "Google it no one can answer that for you. The best school is dependent on your needs, what you wanna research, even what location you can afford or what kind of climate you wanna live in. Too many factors. \n\nYour GRE scores that you haven’t taken yet make a big difference in schools you can apply for. Your GPA is lower. \n\nFigure it out. Not hard just put in the time and google some shit.",
                      "author": "No-Hat1419",
                      "created": 1631651582,
                      "upvotes": 4,
                      "replies": {
                        "hcv6una": {
                          "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcv6una/",
                          "text": "You're as grumpy as the stereotypical grumpy grad student yep\n\n> Google some shit\n\nYou'd think if I found my answer online I wouldn't be asking on frigging reddit.",
                          "author": "MemphisCanadians",
                          "created": 1631651718,
                          "upvotes": -4,
                          "replies": {
                            "hcv7qa3": {
                              "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcv7qa3/",
                              "text": "Harvard, Princeton, Cambridge, Oxford, Yale, Stanford, MIT. \n\nSome random dude on the internet told you to go to those colleges so that’s your plan.",
                              "author": "No-Hat1419",
                              "created": 1631652074,
                              "upvotes": 1,
                              "replies": {
                                "hcvagg7": {
                                  "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcvagg7/",
                                  "text": "Lmao thanks for nothing random dude on the internet",
                                  "author": "MemphisCanadians",
                                  "created": 1631653164,
                                  "upvotes": -1,
                                  "replies": {
                                    "hcwp554": {
                                      "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcwp554/",
                                      "text": "I hate to be a downer, but No-Hat is totally correct, but let me give some more insight. \n\n\r  \nFirstly, it should NOT just be about getting into the most prestigious university. Unfortunately, based on your GPA you are highly unlikely to get into these schools anyways (sorry). BUT think about it this way, going to a less prestigious program usually leaves you with more opportunities and room to stand out. In grad school, the place you got the degree from matters a heck of a lot less than the experiences you got and the skills you gained. \n\n\r  \nI also agree that you are going to need to do some more work. You need to figure out what your exact interests are, not just a field, but what within the field is interesting. For example, my partner is in grad school getting a MA in history. He didn't just google top history schools and apply. He knows he wants to work in archives and has a particular time period he is interested in. So, he looked into schools that have faculty who specialize in those areas. I did the same for my STEM PhD, by picking schools that had faculty who research in my preferred interest area. \r  \nThis will require you to really think about WHY you want to go to grad school. If the answer is just that you want more letters behind your name and to have better job prospects, that unfortunately is not good enough. What are you passionate about and why? \n\n\r  \nI advise you to talk with faculty at your current university to help guide you. Talk to the ones who are writing your LoRs and see what they have to say. \n\n\r  \nFrom there, narrow down those schools. Each school will clearly say on their website what they expect for applications. I totally agree you will have to help explain your low GPA, but don't say something cliche like \"life was just hard because x,y,z\". Many committees look at that and will say that \"everyone has a hard life so this person may not be able to handle grad school\".\r  \nLastly, in your circumstance, with a low GPA, the GRE will probably matter a lot more. They want to see if you are competent and capable, so if you have low scores on both it will not look so good. If you have a low GPA but a great GRE, it won't automatically get you in, but it will look a lot better for you. A lot of the types of programs you will be looking into will pay close attention to the writing and verbal reasoning sections. \n\n\r  \nReally though, it sounds like you need to do a lot more work yourself. It takes many people months and months of research to figure out all of this stuff. There is no easy way out, and turning to Reddit really may not be the best approach. If this is something you really want to do (for the right reasons) you should be working hard at it. \n\n\r  \nBest of luck!",
                                      "author": "Dry-Marsupial4649",
                                      "created": 1631676434,
                                      "upvotes": 1,
                                      "replies": {
                                        "hcxhsor": {
                                          "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcxhsor/",
                                          "text": "You're not a downer, I admit I didn't prepare well and I'm indeed suffering the consequences. You brought a good example in you and your partner, now that I think of it I'll have to narrow down my preferred program much further.\n\nThe problem I had with that person is that they could've been much more diplomatic with me, that's all.\n\n> I advise you to talk with faculty at your current university to help guide you. Talk to the ones who are writing your LoRs and see what they have to say\n\nI did talk with my faculty advisor, who only knows about the application process in Canada, so I didnt press her any further for more info. But I can connect with my closest profs any time and you're right that I shouldn't be shy to ask them.\n\n(Lil rant sorry) Now the only reason my GPA is below 3.0 is because I failed an unimportant lower level course that had nothing to do with my major, I still regret taking that but it is what it is and there shouldn't be any excuses for me. If anything that failure ignited me to take university seriously. I don't expect to do well on GRE because math but it isn't over until it's over, and ill shoot for the stars as long there's a chance.\n\nThank you for your patience and advice.",
                                          "author": "MemphisCanadians",
                                          "created": 1631697247,
                                          "upvotes": 1,
                                          "replies": {
                                            "hcxqq9q": {
                                              "link": "/r/GradSchool/comments/po9h6s/i_dont_know_anyone_whos_applied_for_grad_school/hcxqq9q/",
                                              "text": "Should have mentioned thi in my earlier post, but in your case, I would recommend listing a seperate \"major\" GPA in addition to your overall GPA on your CV. This is sort of common, where people list their GPA for just classes that counted toward their major in situations where they have a few rogue classes outside of their major classes. That could help you out a little bit. \n\nYou don't want it to look like \"because this class wasn't in my major I didn't try\" though too.",
                                              "author": "Dry-Marsupial4649",
                                              "created": 1631704530,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634067386
}