{
  "sid": "q58kyw",
  "link": "/r/GradSchool/comments/q58kyw/questions_to_ask_a_phd_student_from_a_lab_youre/",
  "title:": "Questions to ask a PhD student from a lab you're interested in working in",
  "text": "Hi,\n\nI am a computer science student and I am interested in pursuing a PhD in Applied ML. There is this lab I really like and I am actually meeting a current PhD student from that lab. I only have 30 minutes with them. What questions should I ask to know more about the position, lab and supervisors?\n\n&#x200B;\n\nThere are generic questions of course but for people who have done their PhDs, what do you think would have helped you more if you knew about it before joining the lab?",
  "author": "jaggerman25",
  "created": 1633874422,
  "updated": 1634099768,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.79,
  "comments": {
    "hg45oie": {
      "link": "/r/GradSchool/comments/q58kyw/questions_to_ask_a_phd_student_from_a_lab_youre/hg45oie/",
      "text": "I don’t know how obvious this is- but two things I asked was (1) about work life balance and (2) are they happy? I feel like those are really important compared to anything research related because depression can take you out of any program.",
      "author": "Ok_Cranberry_2936",
      "created": 1633881042,
      "upvotes": 5,
      "replies": {}
    },
    "hg4x44l": {
      "link": "/r/GradSchool/comments/q58kyw/questions_to_ask_a_phd_student_from_a_lab_youre/hg4x44l/",
      "text": "1. Do students get to do internships / develop their skills apart from being in the lab?\n\n2. Does the PI themselves like to write code / do experiments on the bench ?\n\n3. Do multiple lab members collaborate on a project? Or is each project the responsibility of a few? A good way to see this is to look at the papers from the lab, if the PI is the only one common, on the papers, the lab's not very collaborative, and could be structured into silos. Personally, I would prefer a more open, collaborative structure where people work in teams on papers. E.g. student a is first author on journal paper 1, and second author on journal paper 2, and student b is first author on journal paper 2, third author on journal paper 1, etc.",
      "author": "SquirrelOnTheDam",
      "created": 1633892602,
      "upvotes": 4,
      "replies": {
        "hg78fb6": {
          "link": "/r/GradSchool/comments/q58kyw/questions_to_ask_a_phd_student_from_a_lab_youre/hg78fb6/",
          "text": "This makes sense! Thanks!",
          "author": "jaggerman25",
          "created": 1633933699,
          "upvotes": 1,
          "replies": {
            "hg78ic0": {
              "link": "/r/GradSchool/comments/q58kyw/questions_to_ask_a_phd_student_from_a_lab_youre/hg78ic0/",
              "text": "No worries, good luck with your discussion.",
              "author": "SquirrelOnTheDam",
              "created": 1633933759,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg4t2p4": {
      "link": "/r/GradSchool/comments/q58kyw/questions_to_ask_a_phd_student_from_a_lab_youre/hg4t2p4/",
      "text": "Slightly different but I asked my PI what to ask postdocs in labs I'm interested in doing a postdoc in. I was surprised by his response. He said: \"Do you feel like you're doing cutting edge research? Do you feel like your work is part of a global scientific effort? Do you feel like working here has made you a more confident scientist?\"",
      "author": "Monsteriah",
      "created": 1633890934,
      "upvotes": 2,
      "replies": {}
    },
    "hg5ozka": {
      "link": "/r/GradSchool/comments/q58kyw/questions_to_ask_a_phd_student_from_a_lab_youre/hg5ozka/",
      "text": "I tried asking probing questions about whether the PhD advisor was normal or crazy. Turns out they were too scared of him to say out loud that he’s crazy. So it didn’t work. \n\nWhat might be more useful is finding students in other labs and asking about the reputation of the advisor you’re interested in, since they’re a bit more removed.",
      "author": "SomeRandomScientist",
      "created": 1633904260,
      "upvotes": 2,
      "replies": {}
    }
  }
}