{
  "sid": "r2sunr",
  "link": "/r/GradSchool/comments/r2sunr/having_trouble_connecting_with_advisor/",
  "title:": "Having trouble connecting with advisor",
  "text": "TLDR: PhD advisor seems pretty old/traditional and doesn’t seem to prioritize graduate students; feels hard to talk to\n\nI’m finishing my first semester of my first year as a PhD student. I have three years of funding secured and all things considered am in a pretty advantageous spot. \n\nThis professor though, he has a lot of experience and students under his belt, but he’s not the most hands-on professor. Being new to his lab, other students have told me that “hardly knows what’s going on with his graduate students” and that he “won’t help you” with stuff. In talking with him one on one, he’s pretty formal and traditional in how he speaks. I wonder if it’s a cultural/generational thing as well; he’s from India and has been in the United States for a few decades, and we’re located in South Florida. He’s about in his mid sixties also.\n\nIn addition to this, taking his one class, his lectures tend to be pretty rambling/unfocused, relying mostly on the slides. \n\nIt feels awkward asking him questions, like about what journals I should be looking into and what classes I should be focusing on. I sent him an email once asking what I should take for the last class I needed next semester, and he asked me to meet in his office. All just to point to one class in the graduate catalog and reinforce things I already knew in the previous email I sent him.\n\nAm I too demanding, or is this abnormal? Should I reframe how I view this student advisor relationship? Everyone in the lab has been very supportive of me, and there’s this one professor I know I’ll have to work with who I REALLY like (I.e possible committee member). He’s friendly, knowledgeable, and open to helping his students a lot. He’s experienced/a bit older too, and just feels easier to talk to.",
  "author": "danifreedude",
  "created": 1637949159,
  "updated": 1638207993,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "hm6jon4": {
      "link": "/r/GradSchool/comments/r2sunr/having_trouble_connecting_with_advisor/hm6jon4/",
      "text": "This relationship does sound difficult, but it's your first semester so just try and be patient a bit longer. His experience and number of students advised should give confidence he'll help get you to the finish line, even if this semester didn't go too well. Maybe reach out to a recently grad formerly advised by him for advice on this if it continues to be a problem.",
      "author": "saturnineoranje",
      "created": 1637951396,
      "upvotes": 3,
      "replies": {}
    },
    "hmd3tk9": {
      "link": "/r/GradSchool/comments/r2sunr/having_trouble_connecting_with_advisor/hmd3tk9/",
      "text": "Have you considered switching advisors?  I read the first part and was like run, run fast.  Then I read the second part and I’m wondering why you aren’t working with that advisor. But maybe there is something I don’t know.",
      "author": "DicaxErsatz",
      "created": 1638074530,
      "upvotes": 2,
      "replies": {
        "hmd536b": {
          "link": "/r/GradSchool/comments/r2sunr/having_trouble_connecting_with_advisor/hmd536b/",
          "text": "The funding comes from an external donor who owns the property and infrastructure we’ll be using for the project. Theres a student who did her masters thesis on a similar project with them. I’m still new to this whole PhD student thing but switching advisors doesn’t seem like a good idea under those conditions.",
          "author": "danifreedude",
          "created": 1638075222,
          "upvotes": 1,
          "replies": {
            "hmd7nsn": {
              "link": "/r/GradSchool/comments/r2sunr/having_trouble_connecting_with_advisor/hmd7nsn/",
              "text": "Well, if you’ve ruled out switching you can hope that the mentor will adjust their approach.  But honestly that’s unlikely.   You’ve experienced the way it is and other students have confirmed that for you.  Not that people don’t change but they don’t change without motivation to change and there’s likely very little motivation to do that.  Things may improve slightly as they work with you.  You can also be explicit about what you need which may help some too.  But I would start looking for outlets to get the mentoring and support you need to succeed.  The other graduate students are a good source of guidance and support.  I would also work with the professor who inspires you.  I’d be looking for an escape hatch or other outlet of support, likely both.",
              "author": "DicaxErsatz",
              "created": 1638076686,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hm7fb89": {
      "link": "/r/GradSchool/comments/r2sunr/having_trouble_connecting_with_advisor/hm7fb89/",
      "text": "I was in a remarkably similar situation as you (even had 3 years of funding secured! NSF?) just last month. The only big difference between our situations was that my PI was young and I was one of his first students, so I think a lack of experience played a role in his mentoring style. Anyway, I actually ended up switching out of his lab because it just wasn't the right fit for me and now I'm much happier with my new advisor. \n\nI would suggest thinking long and hard about whether this is the lab you want to be in for the next 4-5 years. The other poster suggested being patient since it's just your first semester - I think this is valid, but I also think you should consider the fact that his older students also have trouble with his advising style. To me, this is an indicator that he is set in his ways and won't be changing his advising style any time soon (or ever). Are you okay with that, or do you want/need a stronger connection? If you really don't think this is going to work for you, then would you consider switching labs? For me, I had a huge advantage when switching because I still have all 3 years of my fellowship left, and I was switching early in my PhD. I know another student that switched late into the program and she had a lot more trouble during the process. \n\nIf you'd rather stay in the lab, would you be able to designate a faculty member as a co-advisor (eg. the professor you mention that you really like)? Maybe they could help advise you on classes/questions/etc. instead.\n\nGood luck, and feel free to PM me if you ever have any questions about my experience!",
      "author": "Ground-Squirrel",
      "created": 1637966174,
      "upvotes": 1,
      "replies": {}
    }
  }
}