{"sid": "puzuma", "link": "/r/GradSchool/comments/puzuma/i_think_my_phd_program_destroyed_my_chances_in/", "title:": "I think my phd program destroyed my chances in academia", "text": "This is going to be ranting a little bit, I am sorry in advance...\n\nI started my Ph.D in Architecture in one of the R1 universities in 2015 with great enthusiasm but as I approach the end of my program, I feel so resentful and angry at my program because I feel like they ruined my chances in academia by denying me of any teaching experience. I just submitted my dissertation and will hopefully have my defense in November. As I look for jobs, I find myself in a very weird spot, I find myself specialized somewhere in between social sciences, ethnic studies and urban design - which is not a very cool field in architecture compared to all the computational stuff going on. \n\nI feel like I am specialized in several fields but I do not feel very competent in those fields to teach them, this insecurity also stems from my lack of experience in teaching. In my first year, I was lucky to have a prestigious fellowship - so I didn't have to work. In my second year I was assigned to an introductory course and most of my duties consisted of grading essays and solve attendance/computer issues, which was fine, it was a fun course and I loved the instructor of the course. In my third year I was assigned to the same course - a little weird because people around me had a lot of experience in studio teaching but I was stuck with the same course. This is when I started to feel a little weird about not having teaching experience. I talked with my department head (I'll call him Dr. C) and asked to open a section of the class that I was a TA for in the summer. I though that was I could teach without trying to steal the course from the instructor. On my forth year I was abroad, doing the fieldwork of my research and I was assigned to the same course since most of my duties were online anyways - makes sense. On my fifth year, Dr. C told me that they would not support me as they expected people to have their phd's in 3 years (it was a new program so they didn't know how much time it would take), then he went on sabbatical. With some sheer luck, the interim department head managed to score me another TA position. You guessed right, I was assigned to the SAME COURSE for the forth year. During this time I also started to feel like Dr. C. resented me because I have taken so long to finish. But as opposed to most people in my field, I was doing qualitative research and gathering the data (my fieldwork took 11 months!), transcribing the data and analyzing it takes time (no shade to quantitative researchers, I have mad respect for them since despite taking several years of statistics I am like [this](https://i.kym-cdn.com/entries/icons/original/000/008/342/ihave.jpg)).\n\nI was angry, but I also felt like they were doing me a favor, so I didn't feel like I could say much. I started to look for other ways: I prepared a syllabus for a course I knew we were lacking and went to Dr C. (he was back) and asked whether I could teach it the following semester. I was told they don't allow phd students to teach courses. I mean a lot of people were teaching at this point, even their own courses. I was told that I should find a supervisor to oversee the course. I have hard time understanding this, being an architecture department, more than half of our department are not phd's but they are teaching. Unfortunately although I love my advisor, she has never been a good advocate for me. She told me that it would be too much work and she doesn't want to overtake it. At this point I talked with my fellow phd students, tried to attend their studios, juries, etc as much as possible so that I could get some experience myself. \n\nOn my sixth year (2020-2021), finally they cut my funding. I paid my tuition out of pocket. Then covid happened. I was visiting my family back at home and we all got covid (not because of me). My mom and grandpa were hospitalized and stayed on a ventilator for 3 months. I postponed everything and took a leave of absence for a year. Although my mom had a miraculous recovery, it took too much work as being bed bound for 3 months and very high doses of steroid lead to total loss of all muscle function. My father passed 10 years ago and my sister lives abroad and was not able to take time off work, so I was the main care giver for 8 months. I only intended to visit for a month but ended up staying for 10 months. And it was hard. My husband and my sister was away and I felt very isolated and alone. My mom almost died twice and when my mom was on the ventilator it was a very unstable situation. Even after that, being the primary caregiver took its toll on me psychologically. I developed PTSD and depression and still deal with them. And my grandpa got better too. \n\nDuring all these I was in constant contact with my advisor and our graduate advisor - and even ugly phone cried to my advisor a couple times. Dr. C. was all CC'ed to all our communication and he never reached out or asked me how I am or my mom is doing. Which I found weird and a little offensive. As I am one of the first phd students in my department we always had a good relationship with him. I still feel weird about this. Our head of college provided some covid-related funding and I am good for another semester. I just sent out my dissertation (yay) and should defend soon. \n\nBut I started to have a lot of resentment. Under the covid-related funding I am an RA but the department forgot to assign me to anybody until I had to remind them. They ended up assigning me to my advisor, who doesn't have much work for me. So, I don't work much but get paid. Which seems like free money but my lack of experience bothers me. The course that I TA'ed for for years was given to another instructor who doesn't have a phd. I asked so many times to teach the course and I am getting paid by the college (not the department), so I could teach the course with no cost but I wasn't thought for the position. In addition to this, one of the people from my original cohort started to teach her own course. Like WTF, I was told we couldn't do that? There is this famous professor in my department who does very cool research - all of his students get to have endless funding and teaching opportunities, and I am screwed over.\n\nI just feel so invisible. Like an afterthought. I did so much for the department in terms of university service but this is what I got? And now with my lack of experience, I look at the job ads and they all look for teaching experience. With my grader status for years I do not feel like I can apply to anything. Maybe I am taking stuff to personally? Blaming others for my failure? I don't know but I feel so desperate and resentful. I have no idea what I will do after my defense and this whole experience makes me never go back to academia...", "author": "dondi4444", "created": 1632545056, "retrieved": 1632843990, "over_18": false, "upvotes": 10, "upvote_ratio": 0.86, "comments": {"he9acki": {"link": "/r/GradSchool/comments/puzuma/i_think_my_phd_program_destroyed_my_chances_in/he9acki/", "text": ">In my second year I was assigned to an introductory course and most of my duties consisted of grading essays and solve attendance/computer issues, which was fine, it was a fun course and I loved the instructor of the course. In my third year I was assigned to the same course\n\nSo you do have some teaching experience.\n\nIf you feel it should be more varied, look for a visiting professor instructorship. If you get one of those, that would provide you with an opportunity to do a lot of teaching for a couple of years, while continuing to work on your research agenda.", "author": "raistlin65", "created": 1632598951, "upvotes": 1}, "he8egy9": {"link": "/r/GradSchool/comments/puzuma/i_think_my_phd_program_destroyed_my_chances_in/he8egy9/", "text": "I hear your frustration and anger. And I totally relate and appreciate your comment on how you are emotional and taking things extra personally. Good self reflection.\n\nBut anyway... I don't know your field of academia at all, but in STEM, there are countless professors who teach without any significant prior experience and who don't have a passion for teaching. And you had teaching experience and a tutoring biz during your master's. That counts for something. \n\nI think you need to give yourself some credit. This didn't work out the way you originally hoped, but you got through hell, did successful research, and had funding for almost all of it. And... You're done! Congratulations!\n\nComparison is the thief of joy. Truly you don't know all the details of folks' careers in other labs. You only see the highlight reel and your brain is filling in the gaps to torture you.  You are perfectly qualified to be in academia and if anything you seem to have had more time to focus on your research.\n\nGood luck", "author": "beepbooplazer", "created": 1632584832, "upvotes": 4}, "he80k8c": {"link": "/r/GradSchool/comments/puzuma/i_think_my_phd_program_destroyed_my_chances_in/he80k8c/", "text": "I had something to say, and I want you to know I don’t mean it in a dismissive way :)\n\nFor my math PhD program, teaching is part of my program inherently — I’m instructor of record for a section of one class (Calc 1, 2, 3, linear algebra, etc.). \n\nHaving that has made me realize how lukewarm I am about teaching — and how much time it takes away from research and progress. It made me realize that I don’t want to pursue academic positions, which will have even more teaching / research / misc. responsibilities, which definitely won’t fit in a reasonable work day.\n\nSo I’m saying that, maybe if you’re planning on leaving academia, not having had to teach might not have been such a bad thing after all :) just an idea, and again not trying to dismiss your thoughts.", "author": "realFoobanana", "created": 1632578410, "upvotes": 8}, "he7igs4": {"link": "/r/GradSchool/comments/puzuma/i_think_my_phd_program_destroyed_my_chances_in/he7igs4/", "text": "I hope this doesn’t come off as harsh, but my opinion on some of this stuff:\n\n1) Dr. C is not your advisor and probably very busy. It’s not unusual for dept heads to not have much 1 on 1 contact with students. I would not expect any contact from a dept head unless I directly asked them a question, and then I would expect to be a very low priority.\n\n2) submitting a syllabus and expecting to be given a course to teach is unusual. Another student did it, but it’s still not the norm. Maybe they had an exceptional proposal or it just happened to align with a course they wanted to add, we’ll never know. People will get things that we want (fellowships, grants, papers) and it doesn’t necessarily reflect poorly on those of us who applied for and didn’t get those things.\n\n3) if you think computational research has more impact or another advisor provides better opportunities, it sucks that you’re not in those positions. However, you had a choice in this. A lot of people regret their choice of advisor, and that’s really hard, but that’s also life. If you want to switch fields it’s very possible to do so post-graduate.\n\n4) your personal struggles throughout the pandemic sound very difficult, and I’m sorry you had to go through that. However, your university is still funding you despite being in your 6th year. Funding after 5 years can sometimes be competitive, so that’s really fortunate in my opinion.", "author": "gradthrow59", "created": 1632568413, "upvotes": 20}}}