{
  "sid": "qs498p",
  "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/",
  "title:": "How to be more productive during the week.",
  "text": "Hello, I am curious to hear how everyone goes about their week so they stay on task. These past few weeks seem to go by in a blur and before I know it it's already Friday. I am asking because I am feeling overwhelmed with the tasks I need to do for my own research as I need to submit a paper by the end of the month. Each week I will try to focus on my own research but will lose focus because my professor will assign me to lead another project (which adds stress as I have to play catch up and then lead it in a way of either writing the report or designating work to the undergrads). Basically, it always leads to me trying to figure out what to do in general and in turn I waste time fretting over everything.",
  "author": "qsnipes91",
  "created": 1636694690,
  "updated": 1636745965,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hkbn8m7": {
      "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/hkbn8m7/",
      "text": "Apportioning time through Google Calendar\\* was an absolute life saver for me! That way, you have a view of your week and can divide your time up as you see fit. I found this was enough to focus my attention to the task at hand. Admittedly, this approach is more difficult if you keep getting assigned extra work on an ad hoc basis. Establishing good habits is also key, as an example instead of checking e-mails as soon you get to the office, get your experiments set up in the lab and get them running early. It's amazing how much time you get back if you really consider the way you use your time.  \n\n\\*or insert other generic calendar app of your choice",
      "author": "singinhallelujahtoem",
      "created": 1636718623,
      "upvotes": 3,
      "replies": {
        "hkbye3d": {
          "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/hkbye3d/",
          "text": "This is what I did too. I also create to-do lists (I separate them out by all jobs/projects). I also write hand written  notes for thoughts and each peoject/job has it's own notebook. \n\nThis has helped me on days where I'm feel very lost and I can look to my calendar, see that Friday mornings are for project X, I grab the notebook for it and can quickly refresh my memory on what needs to be done or where I was at. \n\nAlso, I have learned that negative productivity is a thing, so if my brain really doesnt want to work and I try to force it, I can ruin my work day the next day (I call it negative because it feels like I'm running up a  debt). So I also try to match my task with what I'm capable of that day. I have ADHD so maybe that's not a thing every one thinks of",
          "author": "frankie_prince164",
          "created": 1636724972,
          "upvotes": 3,
          "replies": {
            "hkc2l06": {
              "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/hkc2l06/",
              "text": "It sounds like you're more organised than I am 😂, but yes I'd be lost without the notebooks and calendars. \n\nI've never come across negative productivity before, but I know that some days are lost even before I begin. It's just best to accept them and double-down the following day.",
              "author": "singinhallelujahtoem",
              "created": 1636726978,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkc2amb": {
      "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/hkc2amb/",
      "text": "Do you have a cohort? \n\nThe thing I found the most helpful was having brief \"accountability\" meetings. \n\nWe set up an \"accountability group.\" Some people met Mondays, some people filled out a spreadsheet with their goals for the week but we all met up on a Friday for a brief chat and to update each other on what we'd done. \n\nWe all found it very helpful because it sort of forced you to do work because you didn't want to be the only person in the meeting who hadn't done anything.\n\nIt was also, honestly, really relieving, because I think every week we all fell at least a little bit short of what we had intended to do, and it was very heartening to find out that it wasn't just you.",
      "author": "PurrPrinThom",
      "created": 1636726843,
      "upvotes": 1,
      "replies": {
        "hkcrn23": {
          "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/hkcrn23/",
          "text": "My cohort has tried this many times and it would be so nice, but apparently a lot of people need an accountability meeting to keep them accountable for showing up to accountability meetings...",
          "author": "KiwiTheKitty",
          "created": 1636737448,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkcajs1": {
      "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/hkcajs1/",
      "text": "Clockify and splitting my stuff into projects was the key for me. Google Calendar plus clockify is a wonderful combination for saying no to a lot of things. From not checking my emails more than once a day (Often less although it ends up taking about 2h each time I do check) to not taking on side projects for my PI. Budgeting time is key to stopping it running away. At least for me. \n\n&#x200B;\n\nAnd with this post my allotted time for caring about reddit for the day comes to an end.",
      "author": "dmatkin",
      "created": 1636730501,
      "upvotes": 1,
      "replies": {}
    },
    "hkcfem3": {
      "link": "/r/GradSchool/comments/qs498p/how_to_be_more_productive_during_the_week/hkcfem3/",
      "text": "I use a task management app, ClickUp (but trello is similar), to manage my todo lists. Then at the beginning of the week I schedule out in one hour blocks everything I need to do and put those in my calendar, which makes me less anxious. If I know that I have time scheduled for other tasks, I can then focus on what I’m working on at the time. It’s also nice because if something takes less time than I think it will, it makes me feel accomplished and less guilty about taking a break (to check Reddit for example lol). I also schedule time for email (half hour from 11-11:30 for me) so I’m not constantly getting distracted by email. Maybe you can even build in windows of time for your advisor’s “special projects” if they come pretty consistently.\n\nETA: Also schedule out your time strategically, like if you work best in the mornings, make sure the morning is for your own work/writing and then use the afternoons for teaching/other people’s projects. And if you schedule time for writing or working on your own stuff, keep to it! Act like it is any other appointment and don’t schedule other meetings in that window.",
      "author": "artemisiamorisot",
      "created": 1636732504,
      "upvotes": 1,
      "replies": {}
    }
  }
}