{"sid": "nh3lia", "link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/", "title:": "How the fuck do universities not realize that their grad students are people with, y'know, bills?", "text": "I'm going into my fifth year of the program, and this is a constant problem. There is a stipend, and that's great! But it means I have to work part time to make everything work instead of full time. Constantly though the professors and university somehow don't realize that bills are a thing. I had a prof for my orals that was HORRIFIED by my working the summer before them. I didn't know what to say but I wish I could have pointed out that unless he wants to pay my bills, yeah of course I'm working! Do they just not get that the stipends that stay the same for decades don't pay the way anymore? I'm not in a super expensive location thankfully but its still a major city.\n\nOr today, I met with one of my advisors because I'm going to be TAing a class next semester. Only problem is, my part-time gig is teaching a few classes at a local private school. Morning was going to be set aside for TAing and working on my thesis, afternoons for supplementing the stipend. But apparently they changed the time of the class I was going to TA and didn't even think it was necessary to inform the TAs about the change, certainly not asking us if it was possible for us. This is the last requirement except for my thesis, so I need to TA a course. But I also need to be able to actually have some sort of income beyond the paltry stipend (the extra stipend for TAing is something but also not much).\n\nI suppose this ties into the general disregard for life to be affordable based on work, and its a pain. They think they can just throw us around for jack shit and its just not ok. If they want to run my life, pay me enough! In the meantime, I'll chug along with my research and my part-time work so I can live a decent life. That doesn't seem like so much to ask.", "author": "aggie1391", "created": 1621525487, "retrieved": 1632845191, "over_18": false, "upvotes": 861, "upvote_ratio": 0.99, "comments": {"gyxm7le": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyxm7le/", "text": "Our grad assistants have a union that gets raises but the university jacks up the fees elsewhere, often health insurance premiums", "author": "Dorothy_Day", "created": 1621598044, "upvotes": 2}, "gyxkdy0": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyxkdy0/", "text": "There are enough people of privilege in these positions that it doesn't occur to them that mommy/daddy/spouse isn't paying for your life journey. Of course there are many students out there who not only have the financial means to not do anything else but who are prepared to sacrifice their lives. \n\nAs long as people put up with this behavour, the longer it will go on. Academics are used to being the prettiest girls at the party - people are clamouring for those jobs, they are prepared to starve, work crazy hours and so on. So why should they change?", "author": "ourldyofnoassumption", "created": 1621596791, "upvotes": 3}, "gyxbhwk": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyxbhwk/", "text": "Unis in the US sound insane. \n\nTuition for a national uni in Japan is $4.5k. Plus free of charge or halved depending on your earnings and grades. Scholarship (not grants) is generally not granted to those with high earnings. Sounds fair ryt?", "author": "knoxyal", "created": 1621589181, "upvotes": 1}, "gyx6g0b": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyx6g0b/", "text": "My university advised grad students to take student loans. F", "author": "NeuroticKnight", "created": 1621584431, "upvotes": 1}, "gywzzon": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gywzzon/", "text": "It’s crazy when you realize how financially privileged most people in academia are.", "author": "Gerardo1917", "created": 1621578759, "upvotes": 3}, "gywmivh": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gywmivh/", "text": "WAS a grad student in Canada (Quebec), didn't get support, dropped out :/. Being an international student makes it much harder with the 'paying the bills' thing...", "author": "rikionto", "created": 1621568948, "upvotes": 1}, "gywizz4": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gywizz4/", "text": "Lucky us, we are gonna get a 3% raise because of recent petitions in our university system.\n\n\nThat’s less than 50$ extra", "author": "sincere_eel", "created": 1621566870, "upvotes": 2}, "gywait4": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gywait4/", "text": "They do realize. They just ignore the fact so they don't have to use more money.", "author": "Uchuuko", "created": 1621562242, "upvotes": 3}, "gyw9ae2": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyw9ae2/", "text": "This was a major factor for me in deciding between two different paths for postgrad. One faculty realized that most of their postgrad students would still need to keep their jobs, and so offered taught papers in weekend blocks or after office hours. The other faculty had their lectures at times like 11am every Tuesday. I figured that an institution that either hasn't considered or doesn't care about my need to provide for myself is probably going to disadvantage me in other ways later on, too.", "author": "roryana", "created": 1621561587, "upvotes": 1}, "gyw2viw": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyw2viw/", "text": "To anyone looking at potential school look into if the school offers subsidized housing for grad students.  Having housing only be a third of your stipend really helps in living within budget, even with the budget being tiny.", "author": "entropyStable", "created": 1621558187, "upvotes": 1}, "gyw0qqq": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyw0qqq/", "text": "My advisor and person that was in charge of my 25% TA position at the beginning of my masters told me that he “had issues with grad students taking on jobs, gigs, and teaching positions” (I study music), and recommended I just take out more loans to cover cost of living.", "author": "Medeskimartinandwood", "created": 1621557069, "upvotes": 1}, "gyvxumv": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyvxumv/", "text": "God. Reading that is SO frustrating. I recently (Jan 2021) started working full time after graduating from undergrad in May 2020. Fall 2020 I was working “graduate” level jobs, TWO of them. One was ONLY $10 an hour and the other $12 AND BETWEEN THE TWO I COULD ONLY WORK 40 hours (10 hours per role each week) for a pay period (if approved). That is NOT liveable for a recent grad and new grad student in Fall 2020 in a pandemic who has real LIFE needs. I lived mainly on loans in the fall! I asked for a raise and obviously didn’t get it and my advisor was not HAPPY with me working at all!  I found my full time job and it pays me nicely and my advisor was trying to talk me out of it and not take 2 classes (online). My advisor was so against me working and it was weird cause I work full time in higher Ed my program is an online education master’s and I received MEGA push back! It’s either barely work with no academic support, work with no academic support, get a “liveable” stipend with no academic support for working??\n\nUniversity consumerism at its FINEST", "author": "got_tyra", "created": 1621555573, "upvotes": 2}, "gyvxmq5": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyvxmq5/", "text": "A huge problem in the US is the focus on sports. Football coaches make so much money which could be injected into other departments. As well, if you’re department is seen as less valuable you get less money. The US education system is  more business and less education.", "author": "Affectionate-Grand92", "created": 1621555462, "upvotes": 3}, "gyvtavz": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyvtavz/", "text": "I agree with the approach of \"if it's not paying my bills, it doesn't concern me.\" I chose to be in this PhD program and wouldn't still be here if it wasn't something I genuinely wanted to do, but I was not born on this planet to suffer and struggle, so I'm gonna make sure my bills are paid and I have money in my savings, and some leftover to be able to enjoy life. If my part time job is how I do that, then that's my business!", "author": "silkchemise", "created": 1621553227, "upvotes": 1}, "gyvsltu": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyvsltu/", "text": "I live in a really affordable area, our stipend isn’t bad (international students who can’t work more live off of it) but in the past year I worked 3 part time jobs. We even get paid during the summer, but I’m still working full time at one of them and continuing the other on the side. It’s not forbidden in my department but it’s not suggested either. But hey, I’m managing so 🤷🏻‍♀️", "author": "snakesareracist", "created": 1621552866, "upvotes": 1}, "gyvml3c": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyvml3c/", "text": "While it's getting better, academia is still pretty elitist in terms of economic class. I will always remember the shock of learning that 4 of my 10 cohort-mates were being partially or fully supported by their (lawyer/doctor/etc.) parents and they were saving their entire stipends. And I was in a program with a perfectly livable stipend!! There were a lot of faculty in my department who were so out of touch with normal people because they came from upper class households.", "author": "spec_of_cp", "created": 1621549846, "upvotes": 3}, "gyvjlb4": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyvjlb4/", "text": "I had to turn down the one program I got into last year specifically for this reason. The stipend did not cover anywhere a just barely scraping by standard of living and as part of our contract we had to agree to not work anywhere else. They essentially expect you to go $100k+ into debt (which you won't be able to ever pay back with any academic job by the way) in order to do the program.", "author": "squirrel8296", "created": 1621548400, "upvotes": 1}, "gyvcfi5": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyvcfi5/", "text": "I am on the same boat, I got a scholarship that pays monthly and due to the financial aid cap of my institution, I'm always over funded. It takes weeks for financial aid and bursars to clear my check and sometimes they even send letters telling me I owe them money. I have complained with my adviser and her response is always the same you need money go get a job, grad school is not for making money. So I assume they think students come from wealthy families and have 100,000 dollars sitting in the bank as reserve.", "author": "flama_scientist", "created": 1621545129, "upvotes": 1}, "gyv8znx": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyv8znx/", "text": "In Canada, the one good thing is that full time grad student non-TA income (aka stipends from your supervisor) is nontaxable.", "author": "alvarkresh", "created": 1621543612, "upvotes": 1}, "gyv535b": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyv535b/", "text": "This is why I am in no rush to go to grad school. My undergrad was a huge promoter of “you get paid to go to grad school!”. \nWhen I reached out to different programs (Sociology) the money and support was not adding up. \nI still look into different programs here and there but I’m not wasting my time to apply for high stress and pennies. Especially when professor jobs are not in demand right now.", "author": "PinkDove2020", "created": 1621541903, "upvotes": 1}, "gyv40fd": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyv40fd/", "text": "The stipends are a joke. You see them offering 5k a semester sometimes less. I see post all the time and just laugh. I worked FT essentially outside of school with a GA and part time job at dhec. I’m also married so that helps. In my 3rd year coming and I’ve accepted a Ft job cause I’m tired of \n1. No benefits so can’t take a day off without costing me\n2. No benefits again so I’m not saving jack diddly\n3. The poor pay\n4. The obvious idc about you and I’m just cheap labor\n5. The taking advantage of us by working us more than 20 hours a week.\n\nI will be Ft come this fall and in the mean time I have my GA, work at dhec and doing an internship each paid 20 hours a week. I’m taking advantage of the system snd I don’t feel bad about it at all. UNIronically, all these jobs together pay me less than the 1 Ft job I’ve accepted for the fall.", "author": "Jasquirtin", "created": 1621541434, "upvotes": 1}, "gyv3env": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyv3env/", "text": "\"brain worker, you have nothing to lose but your chains\"\n\n&#x200B;\n\n\"but I like my chains\"", "author": "Onion-Fart", "created": 1621541168, "upvotes": 4}, "gyv07vq": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyv07vq/", "text": "For people who wants to go do a PhD, FIND AN ADVISOR WHO IS WILLING TO PETITION FOR YOU INCLUDING MONEY! \n\nMy potential advisors applied extra funding on my behalf. My current advisor petitioned for increased income. Find an advisor who can fight some of the bullshit of academia for you.", "author": "chingalingdingdongpo", "created": 1621539818, "upvotes": 1}, "gyupp45": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyupp45/", "text": "This sort of thing is why I've taken to giving online tutoring for GCSE students. It's flexible, it's not amazing pay but also not bad by any means, and most importantly it's something that *I* control.", "author": "satnavtomington", "created": 1621535413, "upvotes": 1}, "gyum5kc": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyum5kc/", "text": "It depends on a particular program, really. My university pays $25/h, despite being located in somewhat average cost-of-living state. I work from home and never exceed hours I am paid for. I believe that it is a fair compensation. \n\nWhat I don't like is the cap on number of hours worked. I cannot work more than 20 hours as RA, and other job opportunities are basically non-existent for international students.", "author": "n1ck6667", "created": 1621533914, "upvotes": 1}, "gyul5jz": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyul5jz/", "text": "This still surprises me. My advisor always forgets to request the department the payment of my stipend. Is he not aware that my stipend pays my bills? If he had not received his paycheck on time, he would be yelling at people left and right about this.", "author": "Sunglassesandwatches", "created": 1621533490, "upvotes": 3}, "gyukgeu": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyukgeu/", "text": "They know. They don't care. Graduate students are cheap labor, we are desperate for the limited educational/scientific resources available, and are locked into very precarious funding situations which make us effectively captive labor for the length of a PhD. Graduate school historically, or any upper education, has been reserved for the upper classes of the socioeconomic ladder and only recently has that begun shifting in a meaningful way. The institutional and cultural mindset however, still has this view in my opinion, and many professors and admin are mostly either well meaning but elitist liberals at best or vile, social darwinist, technofacists at worst. When the institutional answer to \"my grad students cannot afford to eat\" is \"have faculty donate to a food bank\" rather than \"pay your TA/RAs a living wage\" then that's some Victorian era nonsense placing the blame/responsibility at the individual level. You'd think folks with Dr. next to their name would understand how systems theory works but I digress. \n\nUniversity administrators have enabled and created systems which punish or put undue hardship on the poor (no moonlighting, no startups/IP, fuck you if you don't like wages/terms) while allowing the wealthy and connected to just breeze on through. They designed these institutions to be harder to access if you're poor/black/woman, and then trot you out like a fucking token when you manage to succeed against their stacked deck.", "author": "Outmodeduser", "created": 1621533201, "upvotes": 13}, "gyujui6": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyujui6/", "text": "I'm starting a PhD program this Fall and I was already forced to choose between a fellowship and using my GI Bill for extra income. I chose my GI Bill because the fellowship didn't offer any extra stipend money (only covers my tuition for the department for 1 year) and also adds a bunch of extra tutoring and recruiting responsibilities. Luckily my department supported my decision and was okay with missing out on the tuition money. The fellowship coordinators were also super rude and acted as if I should be grateful for the fellowship despite not receiving any extra compensation. So it felt nice turning them down.", "author": "chemiss715", "created": 1621532949, "upvotes": 3}, "gyujtpl": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyujtpl/", "text": "They know. **But graduate students apply, attend, and accept the provided stipend anyways**", "author": "ricksteer_p333", "created": 1621532939, "upvotes": 8}, "gyuiuyx": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyuiuyx/", "text": "Grad students are considered cheap labor.", "author": "RageA333", "created": 1621532539, "upvotes": 5}, "gyuiiqo": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyuiiqo/", "text": "I mean there are many reasons for this but the main ones that I can think of are that firstly universities, even public ones that get state funding, are for-profit organizations that are selling you a degree and experience. They provide some compensation for research students do for the university but ultimately they are hoping to make money off the student. \n\n I think also there is this expectation that college students, particularly those in graduate school are from middle to upper class and more privileged backgrounds that is in juxtaposition with the reality that more people from lower class and underprivileged backgrounds have been going to college and that they don't  have family paying their way through school. This can be seen when debates over student loans come up with many people suggesting that if you need to take out loans you shouldn't go to school, or that certain majors  that historically make less over one's career should only be available to people who can fully fund their own education. I think also many professors and administrators are unaware or turn a blind eye to the real problems of student poverty that occur.", "author": "94sHippie", "created": 1621532395, "upvotes": 1}, "gyug9jx": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyug9jx/", "text": "LMAO. for undergrad I had a professor that I asked to register me VERY late. I said, I was aware I wanted to take your class for the last 1.5 years, I looked at the 2 year course rotation. I had to wait till I was paid to register. \n\nResponse, no no, silly student, you register and then you pay.\n\nAs though I didn't know that. I would have explained that I was paying off the last semester, the semester BEFORE, but I was getting what I wanted so I just kept my trap shut.", "author": "bitetheboxer", "created": 1621531464, "upvotes": 6}, "gyufuzy": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyufuzy/", "text": "I’m honestly convinced that departments are completely out of touch with reality. The profs in my department are making ~$250K-$350K a year with the university ALONE, while owning houses that are subsidized by the university so the cost is only $200K (and we’re in OC, CA where the average cost in our area is $1.1 million). It’s crazy how they think students are able to survive on barely minimum wage in a high COL area.", "author": "wtfdoyoumeanbro", "created": 1621531296, "upvotes": 9}, "gyufpnv": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyufpnv/", "text": "Because the assumption is that you are a student so you should be paying for your education. The stipend is more of a salary for a job that you were hired to do part-time. It's called American capitalism.", "author": "3akef", "created": 1621531237, "upvotes": 1}, "gyuekqo": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyuekqo/", "text": "I'm incoming PhD this fall. My experience is different, I accepted full time with the stipend, then he asked if I'd be working, as if that was an option, lol. Might have been a mistake, but he offered several different ideas around working and studying, they're going to be very flexible AND make an effort to find me  funding if/when I want it. This is in the Education department at a super liberal university, so YMMV, obviously.", "author": "NotnotNeo", "created": 1621530765, "upvotes": 2}, "gyucgqa": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyucgqa/", "text": "imagine how this goes for international students who aren't allowed to work beyond 20 hours a week on campus, which is usually covered by any standard TA/RA position.", "author": "coyotesandcrickets", "created": 1621529895, "upvotes": 8}, "gyubylj": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyubylj/", "text": "After reading some of the comments in this post I realized I'm super lucky to be at a university that has a strong stipend ($1700+) and doesn't restrict graduate work (currently work 3 jobs with TAing).... I really feel for everyone else though as even the strong amenities I receive are still cutting it close (as far as bills, rent, etc. go).", "author": "Dennarb", "created": 1621529685, "upvotes": 19}, "gyuadco": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyuadco/", "text": "I have to drop my aspirations for my PhD because of this very reason. I have been asking around lately to find out what else is possible with my MS. Thankfully I’m just a first year PhD student and will have at least obtained 2 master’s degrees: one prior to starting PhD and the other during. So I am very very lucky and grateful!\n\nI think it’s evident that PhD programs only cater to those who can get enough support (spousal, familial, etc). While many can still bite the bullet, many of us can’t. \n\nIt is legitimately awful. \n\nOh and isn’t it so annoying when past PhD students or Professors say “well I made it work, you should be able to as well!” WTF…", "author": null, "created": 1621529015, "upvotes": 16}, "gyu9qbe": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu9qbe/", "text": "Yup. I get paid full time 9 months and despite being a GA year round get half pay ($700) three months a year. It’s less than my rent. Banned from moonlighting.  I have to have funds for travel and things for research and teaching field work. And they do not understand at all.", "author": "sylphrena83", "created": 1621528746, "upvotes": 5}, "gyu9n5n": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu9n5n/", "text": "Come to the EU, you should get about 1900/2000 euros a month, net", "author": "BelgianWaffle97", "created": 1621528708, "upvotes": 4}, "gyu99gp": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu99gp/", "text": "[deleted]", "author": null, "created": 1621528547, "upvotes": 93}, "gyu929x": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu929x/", "text": "Is your director providing your stipend? In my opinion you have a responsibility to be available for your phd during normal work hours, or clearly discuss with your director when you don't. If you want extra money I would take a job outside my normal work hours.", "author": "whalewhalewhale8", "created": 1621528463, "upvotes": 1}, "gyu8vnh": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu8vnh/", "text": "To all those saying that you need to contact your union. Graduate assistant/teaching assistant unions are a sham. The student unions are shadow ran by larger organizations that cover many universities and those organizations are designed to keep the students in shifty contacts. They take students money, keep most of it, then give a few students about a 1000 dollars each semester to lose debates with the university over and over. They've had unions for decades and they're all still getting horrible contracts.\n\nIf you want things to change, you need lengthy student walk-outs. Graduate students need to strike.", "author": "Beakersoverflowing", "created": 1621528385, "upvotes": 2}, "gyu8knl": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu8knl/", "text": "Advisors generally don't get it. Many of them think the low stipend falls into their romantic notion of struggling and paying your dues. They fail to realize this, the TAing, doing research in a lab, etc. is a job that needs to pay.", "author": "sciwriterdave", "created": 1621528256, "upvotes": 33}, "gyu8gzx": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu8gzx/", "text": "I've personally heard a head of a department joke \"we don't want you getting too comfortable in the program, which is why we pay just enough to live but not comfortably\" . I've also heard professors bash students for having part time jobs (in the middle of a pandemic), saying that it's not taking academia seriously (and that academia should always be full time). \n\nPeople like this are both why I want to stay in academia (to try to change it) and why I want to leave.", "author": "Dismal-Wallaby-2", "created": 1621528212, "upvotes": 42}, "gyu77cs": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu77cs/", "text": "I mean it’s different for every school right? Just like how policies on every issue today vary by school. I was lucky enough to receive a stipend that more than allows for me to live comfortably in my town, which is a rather large university city. Strange to me is you get extra money for TAing, which we are expected to do and it doesn’t change our stipend at all. I think my point is the university knows what it’s doing, they just don’t care. They see other universities making it work for their students but decide to focus on other things they deem more important, which is awful. Godspeed my friend.", "author": "ayzah", "created": 1621527685, "upvotes": 8}, "gyu74xw": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu74xw/", "text": "We can't unionize or protest, so when professors and grad students alike tried to petition for more than $12/hr (capped at 20hrs/week), the school sent us a super condescending email reassuring us that the food pantry on campus was open 3 days a week! 🙃", "author": "plantsinpants", "created": 1621527657, "upvotes": 407}, "gyu71d7": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu71d7/", "text": "Sounds like your university needs a grad student workers union!", "author": "SlipperyBiscuitBaby", "created": 1621527615, "upvotes": 8}, "gyu70du": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu70du/", "text": "They know exactly how much you make and ensure that most of that money goes back to them via rent, food, etc.", "author": "krazyk1661", "created": 1621527604, "upvotes": 2}, "gyu6we1": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu6we1/", "text": "When I signed my Ra/TA contract there was a part in my contract where I agreed to not seek outside work since I am technically part-time RA/TA and Part-time student. So the years I am a TA they can give me any time slot they want as long as it doesn’t interfere with a class I am taking.", "author": "Idontevenknow5555", "created": 1621527559, "upvotes": 37}, "gyu6ka0": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu6ka0/", "text": "It’s not ideal, but since you’re so close to being done anyway, you could consider taking out a small loan to cover some of your living expenses.", "author": "HouseNegative9428", "created": 1621527418, "upvotes": 1}, "gyu5rks": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu5rks/", "text": "[deleted]", "author": null, "created": 1621527079, "upvotes": 14}, "gyu4i0o": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu4i0o/", "text": "You dictate the terms of your work/life balance, not the school. You're smart enough to get through grad school, and you're smart enough to know how the numbers work. Maybe bring those numbers to the professor, explain your situation, and make it clear that the only way this is going to work is if you're paid enough to offset the part time job? Maybe they'll give you a raise.\n\nAs for why schools get away with it? Because they can.", "author": "PrimarisKevin", "created": 1621526538, "upvotes": 8}, "gyu4fps": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu4fps/", "text": "This sort of thing is why grad students need unions.", "author": "SquareBottle", "created": 1621526512, "upvotes": 89}, "gyu424t": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu424t/", "text": "Who said they don’t know? They don’t care. Big difference.", "author": "ladyshopsalot2626", "created": 1621526355, "upvotes": 280}, "gyu3uv3": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu3uv3/", "text": "[deleted]", "author": null, "created": 1621526269, "upvotes": 25}, "gyu38sq": {"link": "/r/GradSchool/comments/nh3lia/how_the_fuck_do_universities_not_realize_that/gyu38sq/", "text": "When I was in grad school (not that long ago), and had a stipend it was either covered by your advisor or the fact that you were a TA. We didn't get extra money for TAing but that was our income. It wasn't the best, but we were all but banned from moonlighting unless it was to teach another section when the department needed bodies.", "author": "RoyalEagle0408", "created": 1621526012, "upvotes": 113}}}