{"sid": "pm11x8", "link": "/r/GradSchool/comments/pm11x8/i_got_an_awesome_job_thats_not_related_to_my_grad/", "title:": "I got an awesome job that’s not related to my grad program. My career counselor messaged me to ask if it was “relevant to what I want to do with my degree” and now I feel stupid", "text": "I’m in grad school for corporate communications. My ultimate goal when I started the program was to work in Corporate Communications for an entertainment company. I have a strong drive for entertainment and tbh, I was gonna use my degree to try and “sneak in” to the creative side (lesson learned: it doesn’t really work like that lol).\n\nAnyway, I got a dream opportunity as a talent management associate that was due to both the stars aligning and hard work. Someone suggested that I apply to a talent agency, and I’ve come to find that it was probably what I was “meant” to do, thinking even all the way back to my childhood passions. I never had the thought of becoming a talent manager/agent but it sort of happened really fast and feels right. The position has made me happier than I have felt in years. I feel so comfortable to be myself there. I’ve had once in a lifetime experiences on a daily basis, have helped actors that mean a lot to me, and overall it’s just awesome. Honestly, it has made me re-think my career trajectory/grad school. I feel especially self conscious about this because I previously dropped out of an education grad program 3 weeks in because I couldn’t see that life for me and wanted something closer to entertainment.\n\nFast forward: I update my job on LinkedIn. I get a message a few hours later from my career counselor at my school saying congratulations but then she asked, “Is this position relevant to what you want to do with your degree?” She’s a very nice person but I question what she meant, and now I feel increased doubt. \n\nWhat do you think about what she said? Any advice?", "author": "anonymousalligator25", "created": 1631336327, "retrieved": 1632952697, "over_18": false, "upvotes": 9, "upvote_ratio": 1.0, "comments": {"hch2tr6": {"link": "/r/GradSchool/comments/pm11x8/i_got_an_awesome_job_thats_not_related_to_my_grad/hch2tr6/", "text": "I would consider if any of what you're studying will be useful to your career. I don't know anything about talent management, but it seems like communications would be super useful.\n\nI also made a career change from instructional designer to project manager, but my degree is for instructional design. However, project management is incredibly important to the field of instructional design, and many ID skills are incredibly useful for project management.\n\nIt's really just your perspective. I also would say what others are saying: don't look too much into it. My response would be to tell her \"yes\" and then list how communications and talent management share skills. I'm sure there are lots!", "author": "everyoneisflawed", "created": 1631390665, "upvotes": 3}, "hcg7h9a": {"link": "/r/GradSchool/comments/pm11x8/i_got_an_awesome_job_thats_not_related_to_my_grad/hcg7h9a/", "text": "[deleted]", "author": null, "created": 1631377213, "upvotes": 2}, "hcewuyq": {"link": "/r/GradSchool/comments/pm11x8/i_got_an_awesome_job_thats_not_related_to_my_grad/hcewuyq/", "text": "I wouldn't read too much into it. She probably doesn't know how much this position means to you or how much you enjoy it unless you explicitly told her, so she might be concerned that you took a job you potentially dislike and may get distracted.\n\nThe other question, however, is whether the *degree* is relevant to the position you want to ultimately have. A degree in corporate communications might be a good thing to have, but is it necessary for what you want to do? The purpose of getting a degree isn't just to have an expensive piece of wall decoration, it's to equip you with skills that are valuable in the job market. You already have a job, so is the degree necessary?", "author": "False-Guess", "created": 1631348962, "upvotes": 12}, "hcej4z9": {"link": "/r/GradSchool/comments/pm11x8/i_got_an_awesome_job_thats_not_related_to_my_grad/hcej4z9/", "text": "I think she was just asking a genuine question. I don’t think she’s trying to call you out or anything. The degree is what got you there and if it’s how you enjoy using your degree then that should be your answer!", "author": "meo6", "created": 1631337495, "upvotes": 11}}}