{"sid": "ldyxyv", "link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/", "title:": "My bf and I are going to be in grad school at the same time", "text": "I’m nervous. We’ve been together for 4 years and we have a great relationship. I’m scared for the amount of stress we are going to be in & I hope we can help support each other. I should also mention we live together & financially support ourselves. So we will both be working full time as well. Has anyone else been through grad school with their significant other & things turned out okay? Any success stories or advice would be greatly appreciated.", "author": "becca767", "created": 1612622726, "retrieved": 1632954342, "over_18": false, "upvotes": 317, "upvote_ratio": 0.97, "comments": {"gn445a4": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gn445a4/", "text": "My fiancé and I are in the same lab in grad school! We usually get assigned the same projects, too! Personally, I love it. We keep each other focused and sane, and our skills compliment each other. Our lab frequently refers to us by one name (Think bennifer). It’s amazing!", "author": "gloomwithtea", "created": 1613171684, "upvotes": 1}, "gmjdreq": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmjdreq/", "text": "Honestly I think you'll be completely ok.\n\nI'd rather be in a relationship with another grad student than just a regular 9-5 worker somewhere. My relationships with others who never went to grad school were always strained when it because clear that I'm not magically free at 4 or 5pm every day, and that I don't just have a 48 hour block of free time between Friday and Monday. It can put serious strain on relationships.", "author": "Floppy_Mycologist", "created": 1612750355, "upvotes": 1}, "gmfzse2": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmfzse2/", "text": "My husband and I are both in grad school as well as working full time. It can be stressful but it also makes it so much better to understand each other's stress because we are both in the same boat. Setting time where you both study together is a great way to spend time but get work done. Pre pandemic we would go to a tea house and do our homework together, when the weather was nice we'd have a homework picnic. You can still spend quality time together even if you both are reading different books for class. It also helps because we proof read each other's work and it's a mutual helping. If you can, getting classes on the same days helps alot to maximize time outside of class and work together. My husband and i go to different schools but this helps alot with not feeling like we're missing out on too much time together. I would also suggest taking a pto day (if you can) if you have a have a big assignment coming up. I usually take it right before a  final paper is due and it just provides so much more time to work which helps manage the stress.", "author": "donkeypotpie", "created": 1612709598, "upvotes": 2}, "gmf0e9p": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmf0e9p/", "text": "I’m not in a long-term relationship atm but know what both of you need when you’re stressed. And that the other person is not adding onto that stress.", "author": "Ikisfredrikis", "created": 1612700507, "upvotes": 1}, "gmchdh1": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmchdh1/", "text": "We didn’t start grad school together, but we met in grad school. We were both in the same clinical psychology program. He was a third year when I started. Now we are pushing 9 years together, almost five married, 1 kid, and one on the way. The stressful part was that he left for his internship about a year after we started dating, thus a three year long distance (3 hrs, so not bad) relationship. When I applied for internship, there was the stress of not knowing if I would match near him. Then we both had to get post docs and jobs in the same area. It all worked out, but that was hard. The actual school part was easy. He helped motivate me to keep going and we both understood the demands of the program\n\nI’ll add, a lot of our friends met and got married in the program. At least 3 couples right off the bat come to mind. And that’s without straining myself to think about it. It works as long as you make it work. It’s much different having a non grad school partner when you are going into grad school. Everyone I knew who came into grad school with a partner not in grad school wound up broken up.", "author": "whatevaidowhadaiwant", "created": 1612675228, "upvotes": 1}, "gmcd58y": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmcd58y/", "text": "I understand the fear of breaking up, but IMO you already know deep down if your relationship is solid. Grad school stress might be the final straw, but it won't be the fundamental reason for a breakup. After all, truly supportive partners help each other cope in times of stress and will be able to identify each others' needs.\n\n(Please let me rant about my ex for a few moments.) In my case, the relationship was not solid. It never was. It was emotionally abusive but I went years without being able to recognize it, being so young (19yo) when I got into the relationship. Entering grad school and being surrounded by mostly respectful peers who valued my thoughts and feelings was actually very helpful as I learned how to raise standards for myself. (Therapy has helped immensely too.)\n\nMy point is, don't let fear of a breakup bother you beyond a superficial level. It will either work out, or it won't. Either way will be for the best.", "author": "peregrination_", "created": 1612673828, "upvotes": 2}, "gmc6r98": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmc6r98/", "text": "My boyfriend (now husband) and I did the same thing. We moved to a new city together (after being long distance), moved in together, and went to grad school at the same time. \n\nLong story short, there were hard days. But overall, we were able to understand what each other was going through and support each other. It all ended up okay, as we've now been more than happily married for 3 and a half years (and obtained a couple of degrees and started careers in there)! \n\nIt will take work, dedication, and frequent, honest conversations about what you need, what your partner needs, and other needs, including financial. It will take a lot of budgeting, and a lot of patience. But I can tell you that going through that will make you so much stronger on the other side. We're happier than ever now. \n\nBest of luck to you both!!", "author": "Team_Cap", "created": 1612671706, "upvotes": 2}, "gmbolrr": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmbolrr/", "text": "My boyfriend and I were dating for 1.5 years before we moved in together and started grad school! I think going through the process together helped us understand the stress that we were both under. I think finding activities to do by yourself every once in a while is important! Self care will be important for both of you! I would go on walks and listen to podcasts most days as my self care! We are now almost 6 years into our relationship and got engaged last fall :) It’s definitely possible to make it through grad school together and I think it’s made us stronger as a couple!", "author": "ashleyb17", "created": 1612665298, "upvotes": 1}, "gmbn1ct": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmbn1ct/", "text": "For me it was way worse being with someone who was not in grad school. She didn't understand and support me in it at all, so there were definitely deeper issues, but I would imagine it would be good to have someone who understands the demand, the scheduling, the job market, even if the fields are different there would be a certain understanding.", "author": "sayrj2023", "created": 1612664796, "upvotes": 2}, "gmbiomo": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmbiomo/", "text": "I haven’t, but I had the opportunity to (though I declined it). I think it can be a great experience, but, if gone wrong, can be a terrible one. At least for me, the possible benefit didn’t outweigh the possible negative consequences.", "author": null, "created": 1612663370, "upvotes": 1}, "gmb5oki": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmb5oki/", "text": "We did it, it was fine. Just remember to go on dates more frequently", "author": "overtheborder", "created": 1612659653, "upvotes": 1}, "gmb3byn": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmb3byn/", "text": "My SO and I started grad school at the same time after 2.5 years together; it was our first time moving in together too. Sometimes it was stressful: I was burnt out from trying to work and go to school, while he was dealing with an absolutely horrible and abusive supervisor. We had rough times, but were always committed to each other.\n\nNow we've been together almost 7 years and just got engaged. It wasn't the best time in our relationship, but it got stronger due to what we went through. Definitely worth it personally and professionally as we understood what we were each going through and could use our flexibility to help each other.", "author": "0102030405", "created": 1612658961, "upvotes": 1}, "gmb2q6g": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmb2q6g/", "text": "I met my fiancée during grad school interviews, and we've been keeping each other sane as we progress through the program. I see you've gotten a ton of great advice. I just wanted to chime in to say it's totally possible to make things work, and it's wonderful to have someone close to you understand the many stressful moments you're going through. Good luck in grad school!!", "author": "emmenicole", "created": 1612658783, "upvotes": 1}, "gmax9jl": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gmax9jl/", "text": "Grad school at the same time... at the same school? Or long distance?", "author": "overlapping_gen", "created": 1612657165, "upvotes": 1}, "gma76k3": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gma76k3/", "text": "I met my SO in grad school, and we are doing great together! We comfort each other after long days in the lab, and bounce ideas off each other when an experiment isn't working. 10/10 would recommend.", "author": "jentwa97", "created": 1612648712, "upvotes": 1}, "gm9y0s2": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm9y0s2/", "text": "I don't want to be a downer, but it can be a huge source of stress.\n\nMy boyfriend's program is so different from mine that we have completely different schedules. I'm constantly running experiments and he hasn't had to run experiments for a year, but his program is ok with him collecting data for a summer and defending that fall. It's kind of amazing to me because he gets to graduate this December even though he hasn't proposed his research project yet and doesn't have a committee, while my program is constantly up my butt to get more and more experiments done and have more committee meetings.\n\nIt's been incredibly stressful and has definitely pulled us apart. We have a hard time understanding each other and i have very little free time, while he has lots. You have been together for 4 years so hopefully you have a better time understanding each other.", "author": "noface_18", "created": 1612646234, "upvotes": 5}, "gm9l7sk": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm9l7sk/", "text": "My wife is a social work graduate student, I am a public health. We’ve been married for 9 years. I am a full time active duty soldier, she also works. We have a two year old and another on the way. We both graduate in May. It’s doable but takes understanding and sacrifice. Best of luck to you guys.", "author": "Jrwadf1435", "created": 1612642141, "upvotes": 2}, "gm9e5r2": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm9e5r2/", "text": "Absolutely!  Enjoy it!  I loved my time in grad school and my partner and I thrived sharing an apartment. Just like any other stage/setting of life, just do some up front discussion and planning and you’ll be fine.", "author": "RustedRelics", "created": 1612639482, "upvotes": 2}, "gm9a7ei": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm9a7ei/", "text": "My fiancee and I hit 4 years 2 months before we entered the same dual masters program a few months ago. Honestly, it's going great and if anything, we work better as a team in the classes we share. We're taking different tracks and plan to do different things after the masters, so we are also retaining a lot of our individuality. We help each other by being accountability buddies and talk through assignments we don't understand. Really it just gives us more to talk about and relate to with each other. If anything, one of us not being in grad school would be a strain. You're going to be fine. We just started a few months ago, but we finished our bachelors degrees with each other and both work similar jobs on campus across the street from each other. Just communicate and you'll be fine.", "author": "Anonymousanon4079", "created": 1612637774, "upvotes": 1}, "gm98ltx": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm98ltx/", "text": "You are going to be fine. Grad school is a job. But it’s going to require a lot of your personal time. There are going to be moments where it will demand everything from both of you. Be patient. Be supportive. Stick with this. You are going to crush it.", "author": "LegallyThrownFarAway", "created": 1612637070, "upvotes": 2}, "gm97zna": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm97zna/", "text": "One thing that's really helped is to do the work outside the home.\n\nThe library is great, if it's open, and I also find having a study buddy that I am only friends with is great. I can finish the work, shift gears and not bring work and school work stress home with me.", "author": "DJGlennW", "created": 1612636803, "upvotes": 2}, "gm94ths": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm94ths/", "text": "I'm single, so I can't speak on my own experience but from what I heard from my friends, having their partner also go to grad school went very well. Grad school is a bit of bubble, with many unique stresses that are difficult to understand unless you go through it yourself.  Things weren't perfect, but having their partner helped them a lot.   \n\n\nLike I said, I can't speak from the romantic side, but my grad school friends are some of the closest friends I have now. We all bonded with each other going through that stress, and it helps a lot having someone there who can understand what it's like.", "author": "Astsai", "created": 1612635421, "upvotes": 2}, "gm94nzf": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm94nzf/", "text": "Husband and I are in year 5 of the same program. Truly I don't know how we would have gotten this far without each other. It has helped so so much to have a partner in this madness.", "author": "v_jade", "created": 1612635355, "upvotes": 2}, "gm93q0c": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm93q0c/", "text": "My husband and I got married and moved in together during my first year of a biomedical sciences PhD program and the summer before he started medical school. We are in years 4 and 3 of our respective programs and it works really well. \n\nWe both understand that when we have to study that it’s important. We also both get that sometimes you are extra busy with school work and can’t do as much at home and the other person helps pick up the slack at home. Every now and then we are both super busy at the same time and our apartment is an absolute wreck but that is only ever temporary. \n\nI guess my point is you can really empathize with what the other person is going through and be more supportive and understanding.", "author": "lbell2mill", "created": 1612634931, "upvotes": 4}, "gm93h06": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm93h06/", "text": "I’ll be in the situation in the coming year. Currently in a CS PhD program while my partner will be hopefully starting a MSW or SW PhD in the next year after she graduates. Currently trying to help her with the application process but I’m nervous about how our relationship will change when we both move in and start school together.", "author": "stratious", "created": 1612634817, "upvotes": 1}, "gm92a9p": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm92a9p/", "text": "My partner is starting his program in the summer and I’m so relieved because we’ll be on the same schedule  in terms of our classes and studying, plus we found that we work well together when we’re both aiming to accomplish similar goals (tried and true during the lead up to the GRE and grad school applications). I agree with the other commenters, communication is key, there will be times when you’re both too tired to do anything around the house or don’t want to cook, and it’s good to know you’re both in the same boat and can work through it knowing what the other person is dealing with re:school.", "author": "ellensaurus", "created": 1612634279, "upvotes": 1}, "gm91x0l": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm91x0l/", "text": "My partner and I were together for 6 years prior to starting grad school together, and got married right before the program began (in Fall 2019). There are many ways in which being a married grad student makes life easier (double stipend, partner knows what I'm going through, etc). However, the intense stress has really taken a toll on the mental health of each of us, and has negatively impacted our relationship. If we make it through this, I can imagine that our relationship will be strengthened, but we're definitely not there yet.", "author": "SapiosexualStargazer", "created": 1612634111, "upvotes": 2}, "gm8zkyc": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8zkyc/", "text": "I’m doing a PhD and my husband is in law school. We help each other and support each other. We take over daily chores when the other is too busy. It’s great", "author": "Derpazor1", "created": 1612632925, "upvotes": 3}, "gm8wu1q": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8wu1q/", "text": "My boyfriend and I are in the same program, with the same advisors, take all the same classes, and work in the same lab. We don’t live together officially but we do spend about 70% of nights/days in the same home. \n\nIt has definitely been a journey but I wouldn’t have it any other way! Sometimes it can be frustrating because we don’t have a lot of time to enjoy each others company in a non-academic environment. We can’t always go on dates or trips or even spend an entire evening watching movies and hanging out because we’re so busy with school. It has definitely been a chore to find the time to really enjoy ourselves together. Also, sometimes it can be overwhelming because there’s always “something” stressful about school so it always feels like it’s a “bad time” to have serious discussions about our relationship or argue about something, etc. Make sure you aren’t neglecting communication because you’re so focused on homework/research/whatever. \n\nThat said, it’s mostly been a blessing. I love working with him and I really appreciate having a front row seat to watch him learn and grow as a scientist. We understand each other very well and we know exactly what the other is going through because we’re going through it too. It can be an amazing experience.\n\nWe are both graduating this semester with our MA and we’ve been together since the last year of our undergrad at the same university. So I’d say it’s been pretty successful despite everything! I wish you both the best of luck!!", "author": "14kanthropologist", "created": 1612631549, "upvotes": 1}, "gm8wmd5": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8wmd5/", "text": "Whelp my relationship ended when we were both in grad school... but I don’t think it was because of the school part... 😂", "author": "PuzzleMeeka", "created": 1612631441, "upvotes": 3}, "gm8w330": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8w330/", "text": "We were both in grad school and working and we made it! Just got married this past October! It’s not easy all the time but if you communicate and support each other, you can totally make it! It’s always nice to know that your significant other will understand you when academic struggles come up!", "author": "alex_in_the_wild", "created": 1612631167, "upvotes": 2}, "gm8u1ou": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8u1ou/", "text": "Hey hey! Nothing to add except my partner and I will also be starting grad school together this fall (PhD for me, MD/PhD for him). It will be a crazy time but I’m really grateful to have his support! Thank you OP for making this post and thank you commenters for all the helpful thoughts!", "author": "kittensneezesforever", "created": 1612630143, "upvotes": 7}, "gm8tk57": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8tk57/", "text": "Yes, for both my masters and PhD (different partners). What I found thr hardest was having just so many external stressors (toxic supervisors, no external funding, being exploited in research jobs) and everything working out for my partners. But beyond that, it was fine. I'm pretty self aware and can be blunt so I would be honest and say, \"I'm going to be stressed for the next 2 weeks and may not interact all with you\" or if I was having a particularly bad day, I would ask to be left alone so I didnt lash out.\n\nI think the key thing is taking turns taking care of each other. Like if I'm stressed, my partner will take over cooking and vice versa. If we're both stressed, we mutually agree to do take over. Although most times we have some prior warning when stressful times will come so we meal plan. \n\nThe couples that I see fail are when one partner doesnt reciprocate care and understanding when they're not going through the stressful time.", "author": "frankie_prince164", "created": 1612629898, "upvotes": 2}, "gm8s7mg": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8s7mg/", "text": "My husband and I were in the exact situation.  It can be done and honestly it has strengthened our relationship.  My suggestion you for both is to set some time aside each week to hangout and enjoy each other’s company.  But I want to be honest working full time, going to grad school, and holding a relationship together is crazy stressful but worth it.  Enjoy this time of your life.", "author": "22Beebeaker", "created": 1612629214, "upvotes": 4}, "gm8rxxn": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8rxxn/", "text": "I met my now husband in grad school and got married while still in school and we will both hopefully be graduating this year!\n\nHonestly it's been great having a partner who understands the stress and work commitments and can sympathize with you. Honestly the hardest part for us has been finances but it is much easier to live off of 2 stipends than one!\n\nMy advice is be sure to set aside time each day for each other especially when you are taking classes. Meal prep and as others have said setup or discuss how you want to handle housework and chores. And be flexible and have grace for each other because those things may change from semester to semester or week to week depending on your work load. It really just boils down to communication.\n\nIt's totally doable and can be extremely rewarding to have a partner who is also a graduate student! Honestly sometimes I think it's easier because you both understand what the other is going through.", "author": "rubberduckie819", "created": 1612629077, "upvotes": 8}, "gm8qxln": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8qxln/", "text": "My (now) wife and I applied to grad school together, worked 5 years in the same department (got married ~6 months in), shared an office for those 5 years, defended our PhDs one day apart and got postdocs together. Having someone going through the same things was great. We were lucky to have advisors in undergrad and grad school that were part of same-department two-body problems themselves. It can be super stressful, but we found it worth it!", "author": "ouemt", "created": 1612628561, "upvotes": 7}, "gm8qo54": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8qo54/", "text": "I am in an eerily similar situation. We have been together for about 5 years and if anything it has made our relationship stronger. We moved across the country for my grad program (his is online with an in person internship that can be completed anywhere) so that was added stress but it has been great! We understand eachother in a way we never have before. We also are good at keeping eachother on task during the day. My advice is just be honest about your feelings and communicate as much as possible! Grad school brings insane amounts of stress and can be so isolating so you will be thankful you have someone so close that understands.", "author": "spicybigred", "created": 1612628426, "upvotes": 2}, "gm8pnqq": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8pnqq/", "text": "I'm in my second master's program and my wife is in a PhD program while both of us work full time as high school teachers. We have been in school simultaneously and worked full time since we met as undergrads 6 years ago and it has been great. We both get it and encourage each other. On top of that we are moving this summer and career changing out of the hell that is teaching into something new so that will be more stress but it only makes your bond stronger if you lean on each other and are in it together for the Long haul. Don't withdraw inward and remember to set limits and let things go and enjoy life together too. If school becomes the highest priority to the exclusion of other things that is when problems arise.", "author": "tomatillo26", "created": 1612627900, "upvotes": 2}, "gm8pmbi": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8pmbi/", "text": "It should be fine. A few things you should keep in mind:\n\n1. Sort out issues with home chores (cleaning, cooking, laundry, etc) ahead of time, and have them sorted out in an equal way which both of you agree is equal. Have plans for how to deal with these if the person who is responsible for those chores is ultra-busy one week or month (e.g. have a plan for ordering food for delivery, or have a certain amount of clutter that both of you can tolerate, or have a way to swap responsibilities).\n2. Both of you need to figure out how to be comfortable saying no to department or cohort-related social events. Grad students will organize things ALL THE TIME, and at some point it can carve a chunk out of your relationship time, which can cause resentment. This is even worse when your relationship time becomes entirely encompassed by chores or the more difficult aspects of supporting a partner, and the grad school friends are FUN and COOL and have PARTIES with DANCING and whatever. This is a perfect recipe for FOMO if you stay home and a perfect recipe for jealousy (or worse) if you go out, and you're going to be facing the possibility of doing this pretty much 3-4 times a week. Having friends in your cohort is a good thing, but figure out how to balance cohort events with your relationship. Bring your partner and make sure your cohort understands that they are part of the package, or avoid events where your partner's presence is not wanted. Organize smaller events with people you like from your cohort where your partner is an expected and wanted part of the group (board game nights, dinner at a restaurant, pickup soccer or frisbee games in the quad, whatever).\n3. Figure out if your housing situation is organized in a way which will support both of you needing space to work. If you both need your own space and that's not possible with how your place is set up, either figure out how to achieve that, or consider moving somewhere that will have that extra space.\n4. Make time in your schedule to still have date nights from time to time.", "author": "tchomptchomp", "created": 1612627879, "upvotes": 100}, "gm8p9ac": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8p9ac/", "text": "Yes! Except... I went out of state for grad school. So we are long distance now. Its rough, but we have long Skype dates where just both bitch about our respective programs. Lol. \n\nDont be worried! You both will surely be stressed, but you'll always have each other to learn on! It's amazing when your SO understands the stress of grad school.", "author": "rotpotsoup", "created": 1612627691, "upvotes": 9}, "gm8o6e3": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8o6e3/", "text": "We met during undergrad. We did two years together in a master's program and then started a PhD together, and we got married a year and a half ago. :)", "author": "MathMajor7", "created": 1612627132, "upvotes": 4}, "gm8ks7p": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8ks7p/", "text": "Yep! We were together three years before both entering grad school at the same time, and we are now very close to graduating. It’s actually amazing. Yes you’re stressed and busy all the time, but your partner knows exactly what you’re going through and understands the intricacies and weird grad school things that other people don’t. My partner and I are in the same field as well, which we love since we can talk about our projects and bounce ideas off each other. The other side of that is that we sometimes have trouble turning our school side of us off lol. I loved having someone to come home to and commiserate with, as well as having someone to motivate me and cheer me on when I was frustrated and wanted to quit. I think it’s better having someone in the same boat as you who can help you make the best of things, although I understand things would likely be different if we had children (both financially and time management wise). \n\nAdvice wise, you have to have good communication and be willing to compromise on things. Make sure you’re on the same page with finances, as living on measly grad school stipends can add even more pressure. Make sure you take time to be together. It’s very easy to get sucked into the work 24/7 mindset and try to be the most productive you can be, and that will destroy not only you but your relationship as well. Good luck! Honestly, having my partner in grad school at the same time makes it much more bearable, imo.", "author": "bulletproofshadow", "created": 1612625322, "upvotes": 16}, "gm8kemd": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8kemd/", "text": "My now husband and I have gone through this! He finished before me and I’ll be done this year. Not gonna lie, it’s been very hard on our relationship. Financially it was very stressful trying to make ends meet making $800 a month each, but we’ve make it through without any debt. Try to communicate as much as possible and make some genuine time for each other, but also find boundaries for when you need to work. It’s always a choice to work it out...try to remember that it won’t always be so hectic. It helps if you look at them as someone to help make it easier rather than as a burden and try to be that person for your partner. You can get through it though!", "author": "kmaguire0505", "created": 1612625119, "upvotes": 26}, "gm8jzdp": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8jzdp/", "text": "Yes! I was doing an MPH/PhD while my husband was doing an MSW, all with a toddler! Not gonna lie, we had a few tough moments (namingly times where we felt disconnected and apart from each other), but it was doable, we survived, and are thriving today :)", "author": "citwm", "created": 1612624880, "upvotes": 75}, "gm8iejb": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8iejb/", "text": "I love it. We both understand the stress each other is under and I can help him out when I’m less busy and he can help me out when he’s less busy. It’s amazing having that support system. We do not live together though but I don’t think that would really change much", "author": "amls1997", "created": 1612623981, "upvotes": 200}, "gm8haib": {"link": "/r/GradSchool/comments/ldyxyv/my_bf_and_i_are_going_to_be_in_grad_school_at_the/gm8haib/", "text": "We're together during it. It's fantastic, we both know what to expect. Use your words and talk to your partner about this; the stress is expected, just be ready to offgas and destress when needed.", "author": "Dry-Zookeepergame352", "created": 1612623335, "upvotes": 57}}}