{
  "sid": "qg01pm",
  "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/",
  "title:": "How to deal with toxic lab mates?",
  "text": "I just started my MSc early September. At first, everyone was decently friendly and super helpful in my lab. My PI operates on a “hands-off” style and relies on senior grad students to help new ones. Recently, there have been several instances where my lab mates have not treated me very well, and it makes me dread coming into the lab. (For some context, I started the same time as another girl who has 0 experience in the field so she’s been getting help from someone, whereas i’m working on a new solo project)\n\nSome examples are:\n\n1. Blaming me for messes that I didn’t make and then making me clean it up by pressure.\n2. Being incredibly dismissive when I ask legitimate questions\n3. Making jokes about “killing me” if they had the choice to replace me\n4. Making offhand comments about how they like “most” of the people in the lab\n5. Making plans in front of me with other new girl and seemingly purposely not inviting me (which is whatever, they are not obligated to invite me)\n6. Saying *insert equipment name* “is for the boys only” (as a joke, but still annoying)\n7. Snapping at me for doing something incorrectly when everyone else in the lab did too\n\nMost recently, due to a series of events, i ended up at a gathering with them. They somehow brought up how they have to look after me and new girl. Then they started roasting me saying I ask too many questions, and that other new girl is great cause she doesn’t ask questions (she asks me her questions actually, plus they are basically doing her project for her). They said i shouldn’t be asking any theory questions.\n\nThis honestly just made me feel awful, since i already felt that they hated me and i’m feeling the imposter syndrome. \n\nWhat would you do in this scenario? I don’t really want to seem like a snitch and bring it up with my PI, but even talking about it makes me want to cry. I’ve even considered dropping out and applying elsewhere…",
  "author": "NecessaryBowl",
  "created": 1635228489,
  "updated": 1635302959,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 1.0,
  "comments": {
    "hi31m9b": {
      "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi31m9b/",
      "text": "I'll consider recording everything that happens on the lab with your cellphone or another device, have a record of your activities and posible written interactions with them so you can back up that you followed the procedures. You could do some research around to see how previous candidates did on  the lab, and if they were similar cases.\nAfterwards you could try to communicate your points of view with them in a way they can be given notice as to set up an attempt of reconciliation of the situation, so that later when you contact your PI as to inform him/her of what's going on you can have evidence on your side so they can't get away with it.",
      "author": "See-My-Eyes",
      "created": 1635229273,
      "upvotes": 9,
      "replies": {
        "hi31shj": {
          "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi31shj/",
          "text": "There was a sexual aggression allegation against one of the guys, but I spoke with someone and they said it was false (cannot confirm or deny) and that the undergrad made it up cause she didn’t like doing the work and wanted an easy out to keep her UROP money. But who knows, maybe she was treated horribly too?",
          "author": "NecessaryBowl",
          "created": 1635229408,
          "upvotes": 3,
          "replies": {
            "hi320ys": {
              "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi320ys/",
              "text": "It can be, I mean they seem to have taken a fancy on your female colleague so it can be used to back up that they are biased and behaving inappropriately by connecting both views",
              "author": "See-My-Eyes",
              "created": 1635229595,
              "upvotes": 4,
              "replies": {}
            },
            "hi3232p": {
              "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi3232p/",
              "text": "To add to this, another lab mate (i get along with) is basically mastering out because he couldn’t handle the toxic environment (and other mishappenings). He actually warned me against a bunch of people when I started but other people told me he was making it a bigger issue than it was",
              "author": "NecessaryBowl",
              "created": 1635229643,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hi3wtok": {
      "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi3wtok/",
      "text": "I'm so sorry you are putting up with this. Unfortunately some people are such emotional dumpster-fires that they have to build themselves up by putting others down. \n\nTo me, a few things in your list are not like the others. Joking about killing you is totally not OK. Talking about violence, even in supposed \"jest\", absolutely doesn't belong in the workplace. Likewise, saying the \"boys only\" bullshit is sexist. Doesn't matter if they think they're joking around, it makes you uncomfortable so the joke failed and they are responsible for that. Just on those two points alone I'd say you need to talk to your PI. \n\nUnfortunately, even am intervention is unlikely to make any of your labmates decent people and you'll still have to deal with them. If I was in your position I'd try and ask them as few things as possible, even if that means I spend 15 minutes looking for the sonicator or am extra day or two doing titration. I'd also keep my giant headphone on like all the time. Don't take responsibility for and clean up shit that isn't yours. If they are pressuring you then put in your headphones. \n\nAgain - sorry this is happening. There are shitty people in every workplace, but having shitty labmates is particularly hard.",
      "author": "Pr0gr3s",
      "created": 1635252696,
      "upvotes": 7,
      "replies": {}
    },
    "hi310wm": {
      "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi310wm/",
      "text": "talk to your PI or dean of your dept. where are you?",
      "author": "Furthur",
      "created": 1635228803,
      "upvotes": 5,
      "replies": {
        "hi317l0": {
          "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi317l0/",
          "text": "In Canada. I will likely talk to my PI, but I don’t want to come off as someone who’s complaining about others not liking them. I just don’t really know what can be done realistically",
          "author": "NecessaryBowl",
          "created": 1635228950,
          "upvotes": 3,
          "replies": {
            "hi31ghs": {
              "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi31ghs/",
              "text": "homey.... if your cohort sucks  you talk to your PI and faculty about it. if your faculty sucks that's a whole different problem. i have connections at McGill if that's your locale.",
              "author": "Furthur",
              "created": 1635229148,
              "upvotes": 6,
              "replies": {
                "hi31nef": {
                  "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi31nef/",
                  "text": "Not McGill, but close haha. I’m just so frustrated because I turned down an offer in France to be here and now I want to leave after 2 months. The environment makes me hate what I do and there’s no avoiding these people. I mentioned how i felt to the other new girl and she says she loves the guys because of their “sense of humour”, so maybe I’m overly sensitive?",
                  "author": "NecessaryBowl",
                  "created": 1635229297,
                  "upvotes": 2,
                  "replies": {
                    "hi32sc1": {
                      "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi32sc1/",
                      "text": "it could be a Québécois thing? I don’t know but one of my best friends is from that area.  Go talk to your faculty that’s when you know what really matters",
                      "author": "Furthur",
                      "created": 1635230208,
                      "upvotes": 3,
                      "replies": {
                        "hi3318m": {
                          "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi3318m/",
                          "text": "Nah these are anglo out of province students that just happen to live here. I have plenty of québécois friends who haven’t told me they’d kill me lol. I guess I’ll proceed with PI and possibly my program director. Maybe worst case scenario transfer to a different school (although, stem may just be toxic everywhere…)",
                          "author": "NecessaryBowl",
                          "created": 1635230408,
                          "upvotes": 3,
                          "replies": {
                            "hi33jwm": {
                              "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi33jwm/",
                              "text": "naw, ride this out a sec then DM me.  there are chill programs out there.  dont lose motivation! One of my closest friends got her PhD in chemistry at mcgill maybe she can help",
                              "author": "Furthur",
                              "created": 1635230829,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hi4qvsx": {
              "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi4qvsx/",
              "text": "I'm im the situation now and have had 2 jobs now where I got exactly 0 benefit by ignoring drama. Talk to your PI about it. Letting it fester only benefits the abusers.",
              "author": "erehin",
              "created": 1635265577,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4wokn": {
      "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi4wokn/",
      "text": "I would keep a detailed record of these instances of discrimination and give your PI an opportunity to rectify the situation by removing them from the lab, then I would go to the Dean of Students office with the information and see what kind of institutional punishment they can be given. I would also file a hate and bias incident report, and speak to someone at the Title IX office regarding the sexism. \n\n>Making jokes about “killing me” if they had the choice to replace me\n\nThis comment alone would be enough for me to pursue disciplinary action against them. It's not funny, and if you are in a laboratory with potentially dangerous chemicals, it's not appropriate to joke about murdering someone. \n\n\"Joking\" about certain equipment only being for people of a certain sex or gender identity is discriminatory and unacceptable. It's not funny, not professional, and has no place in your lab. Look up what your local laws are regarding recording people. You mentioned you're in Canada so I'm not sure how it works there, but there are many different laws in the US that govern that. If you are not able to record, send emails to yourself detailing each incident as comprehensively as possible. That way, they will be contemporaneous and time stamped. The more detail you can provide, the better (e.g. Susan was wearing a yellow jacket and brown pants) because it can boost your credibility. \n\nWhen you talk about this to your PI or whoever, don't frame it in terms of them not liking you. Frame it in terms of how their behavior and the things they say make you feel uncomfortable and unsafe, and then give clear examples. It's not a matter of them not liking you--you can not like someone and still be professional. This is a matter of them bullying, harassing, and \"othering\" you and creating a hostile (and potentially unsafe) work environment.",
      "author": "False-Guess",
      "created": 1635267840,
      "upvotes": 3,
      "replies": {
        "hi4z796": {
          "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi4z796/",
          "text": "100%, this guy works with cyanide and makes jokes about murder suicide and killing everyone in the lab… \n\nI’m going to start keeping a record of stuff, that’s a good idea. I only have a general idea of when the other stuff happened from my messages with my friends, but I have approximate dates. \n\nI think it’s a good idea to phrase it more than I’m uncomfortable rather than not liked. They could definitely not like me, but they don’t have to harass me…",
          "author": "NecessaryBowl",
          "created": 1635268833,
          "upvotes": 2,
          "replies": {
            "hi5omd5": {
              "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi5omd5/",
              "text": "Cyanide??? I'd be too scared to even joke about it...a little mistake in pH value and you are all done!!! The guy is sick. You should definitely report him, you are being harrassed. Recording stuff is a good idea. Do not let them win, you should not drop your studies.",
              "author": "queenlorraine",
              "created": 1635278747,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi5krjb": {
      "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi5krjb/",
      "text": "I've had to deal with unsavory characters in the lab. I mentioned it to my PI, she asked me to send her an email with all the specific incidents and she would address it. The unsavoury behaviour stopped but the person knew I had complained and was very difficult to work with (until he got fired eventually anyway).\n\nSo my advice is:\nDefinitely address it with your PI, including sending evidence (screenshots of written communication, quotes/details of spoken communication) of specific events to show you're not just moaning about vague social worries and the extent of the issue (as the others will probably refute your complaints by saying you're imagining it/it's lab banter). However, expect they will still be bitter and unhelpful towards you afterwards. Since they're being horrible as it is, you don't have anything to lose and they shouldn't get away with this crap. Also, you will do better the more work you do yourself based on your own understanding of the literature and methods, rather than relying on second hand learning from them.\n\nThey sound like jealous asshats who are threatened by anyone showing genuine enthusiasm for the field. Any good lab member would encourage and welcome questions from new members about what they're doing and why they're doing it.",
      "author": "Fine_Needleworker_69",
      "created": 1635277276,
      "upvotes": 3,
      "replies": {
        "hi5zs22": {
          "link": "/r/GradSchool/comments/qg01pm/how_to_deal_with_toxic_lab_mates/hi5zs22/",
          "text": "That’s what I’m worried about, them being even more nasty if I do complain since they’ll know it was me and it being chalked up to just how boys banter. \n\nI guess they just don’t like me asking questions because it annoys them, but I want to understand what I’m doing instead of having someone do all my work for me blindly.",
          "author": "NecessaryBowl",
          "created": 1635283081,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}