{
  "sid": "qqhkz0",
  "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/",
  "title:": "1st year PhD student and I strongly dislike my classes but like research",
  "text": "I’m a first year PhD student in astronomy. I did astronomy because I did astronomy research as an undergrad and liked it. Even then I didn’t have much interest in my astronomy classes, I noticed I always heavily preferred physics. I loved the use of high level math in physics since I was an astronomy/math double major, and the math in astronomy courses is so boring at least in these classes. We haven’t done anything beyond sophomore level math at best. I am taking one physics class right now in my research area (cosmology) and it is sooo much more interesting then learning about stars which I couldn’t care less about it.\n\nMy advisor has mostly had physics PhD students even though he is in astronomy, so I’ve been debating switching departments. What do I do? I’m only just know realizing this and there’s still so much more left. The thought of taking more boring Astro is killing me. At the end of the day, I know research is what’s most important but it’s hard when you’re spending 40+ hours a week on coursework you hate. I do think I would actually enjoy teaching astronomy 101 over physics 101 although at the high level it’s the opposite for me. What do I do?",
  "author": "holvim",
  "created": 1636504325,
  "updated": 1636656529,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0a5l6": {
      "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk0a5l6/",
      "text": "My advice is to just power through. Classes are not a big part of grad school and you don’t necessarily have to ace them. You’ll be doing research before you know it if you aren’t already and that’s what grad school is all about. There are great and not so great parts to every job and the good news is that the not great part is temporary for you",
      "author": "thatcheekychick",
      "created": 1636504750,
      "upvotes": 12,
      "replies": {
        "hk0ehjp": {
          "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk0ehjp/",
          "text": "Thanks for the advice!",
          "author": "holvim",
          "created": 1636506681,
          "upvotes": 1,
          "replies": {}
        },
        "hk1m379": {
          "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk1m379/",
          "text": "They are a big part of grad school as they take up the majority of my day lol.",
          "author": "grothendieck1",
          "created": 1636531161,
          "upvotes": 1,
          "replies": {}
        },
        "hk30d4a": {
          "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk30d4a/",
          "text": "In addition, while I would imagine you have some core required astrophysics classes, you probably have some room for electives.  May require depatrmnet approval, but you maybe able to get some more math heavy physics classes to count toward your degree.  For my degree in EE, I needed 10 courses, only 4 were specifically required, the other 6 had a fair bit of flexibility.  They needed to be technical and related, but I took a math methods one in the physics dept, ankther materials one in the chemistry department.  Good luck! \n\nEdit:  based on your other reply about having limited flexibility, I would go to the department with a list of alternative classes you would prefer that are relavent to your work and see if they would be willing to sign off on alternative degree requirements.",
          "author": "asanano",
          "created": 1636561017,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk0abh5": {
      "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk0abh5/",
      "text": "Look at your dept handbook or talk to other students or the coordinator to find out how long you actually take classes for. In my dept most students coming directly from undergrad only need to take classes in their first 3 years(total time of ~5y). If you already have a masters, you have less requirements and time.\n\nKnowing how long or how many classes you need may help you either deal with your current situation or horrify you enough to decide to do something else.",
      "author": "72-27",
      "created": 1636504823,
      "upvotes": 3,
      "replies": {}
    },
    "hk0ucar": {
      "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk0ucar/",
      "text": "Just push through. I know it sucks. I’m doing astrophysics in a physics department and I really disliked most of my classes but after that you get to do what you’re really interested in and the coursework doesn’t really matter.",
      "author": "groplittle",
      "created": 1636513824,
      "upvotes": 3,
      "replies": {}
    },
    "hk2dp5x": {
      "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk2dp5x/",
      "text": "How much freedom is there in class choice? Could you get a letter from the department letting you take physics classes that are related to your research?",
      "author": "mrboogs",
      "created": 1636551285,
      "upvotes": 2,
      "replies": {
        "hk2roa5": {
          "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk2roa5/",
          "text": "Pretty much no freedom at all unfortunately",
          "author": "holvim",
          "created": 1636557550,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk1m2dv": {
      "link": "/r/GradSchool/comments/qqhkz0/1st_year_phd_student_and_i_strongly_dislike_my/hk1m2dv/",
      "text": "Same here. Classes are stupid and I don’t understand dont point of them.",
      "author": "grothendieck1",
      "created": 1636531144,
      "upvotes": 1,
      "replies": {}
    }
  }
}