{"sid": "pvqgmr", "link": "/r/GradSchool/comments/pvqgmr/msc_in_artificial_inteligence_or_machine_learning/", "title:": "Msc in Artificial Inteligence or Machine Learning?", "text": "Hey everyone, I write here cause I'm in the need of proper guidance.At this point, I'm finishing my thesis and I'm going to receive my bachelor certificate around 20 of Oct.\n\nMy degree is a 5 year CSE in Greece so it is considered to be a master as well.\n\nAs for the subject, I'd like something related to ai and more specifically to machine learning as I love using the tools of ml in order to train games and other applications. My thesis in fact is a Reinforcement learning simulation game.\n\nMy problem is that I don't want the master I'm looking for to be too specific like ml only for games, but on the other hand I don't want it to be too theoretical either. I'd love it to be a 1 year more practical and project-wise experience.\n\nAbout the location, I have the USA in mind but it is the most costly one. Also after Brexit, i think the UK is out of the game. Also, Athens is a great and free-in-cost solution as well.\n\nI'm starting today to make a list of Universities with their requirements , their budget, and their deadlines.\n\nFinally, I don't know if I'm late but I think that I will definitely need to have the gre tests and a 2-year proficiency English degree, in order to achieve the entrance in a master.\n\nWhat's your opinion on my thoughts? Do you have any Universities to recommend to me?\n\nThanks in advance, Alec :)", "author": "alecfilios2", "created": 1632648120, "retrieved": 1632843969, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hejnckw": {"link": "/r/GradSchool/comments/pvqgmr/msc_in_artificial_inteligence_or_machine_learning/hejnckw/", "text": "I wouldn't worry about being too specific in terms of the types of projects you'll be working on for a degree in ML. As you may know, many benchmarks for reinforcement learning tasks are actually video games so even if you decide to go for a career outside game development you will have an excellent portfolio that potential employers will appreciate. You may also find that once you start taking more classes in ML you'll find there are adjacent fields (control systems, computer vision, navigation, etc.) that use essentially the same skill set.", "author": "not_just_a_pickle", "created": 1632794569, "upvotes": 1}}}