{
  "sid": "q07c6i",
  "link": "/r/GradSchool/comments/q07c6i/my_first_month_in_grad_school/",
  "title:": "My first month in grad school.",
  "text": "This article is also available on my [website](https://ramandutt.super.site/blog/all-articles/settling-in-one-step-at-a-time).\n\n## Starting out - First Day\n\n**13th September 2021** \\- First official day of my life as a graduate student. I was nervous but full of enthusiasm, almost ready to conquer the world . I had been waiting for this day since the past year and a half. Keeping the excitement aside, I had **grand plans** about everything I wanted to do as a graduate student. Anyhow, coming back to the morning of 13th September, I moved into my accommodation in Edinburgh and started preparing to attend the induction session for my program. Since it was the first day, I wanted everything to be perfect, or at least I imagined it to be. I picked out my outfit in advance (for a change), fully-charged my mobile and had my things already packed. This almost made me feel like a kid starting a new year of schooling haha.\n\n## First Week.\n\n**You know when they say life messes up all of your grand scheme of plans?** Right before leaving for the event, I noticed my outfit of choice was full of wrinkles, my phone wasn't charging and my laptop was out of battery too. When I tried following the google maps, I ended up walking around the same block 3 times. So in summary, my first day at Edinburgh was something like this - I was wearing clothes full of wrinkles, navigating using a phone on 15% battery around a city I had no idea about and reached my destination 40 minutes late. For the next few days, almost everything was a mess. I was late to almost every event since I always got lost on the streets, my room seemed like it witnessed a battle, I failed to get my bank account opened, all of my clothes crumbled, I had no idea what to cook for each meal etc etc etc. Life was nothing but constant chaos.\n\n***You see, when we start something new in life, we only focus on the things that excite us. There is nothing wrong in that but it partially blinds us towards the realities of life. And when the reality strikes, we are hugely disappointed and blame our expectations***\\*.\\*\n\n## Second Week.\n\nAfter a few weeks in misery, **things started to settle in**. I unpacked my luggage and my room looked ***less*** messier. My clothes had ***lesser*** wrinkles. I started remembering the streets and was getting lost ***less*** often. I purchased a couple of random vegetables and was eating frozen food ***less*** often. In the next couple of days, I ironed some more of my clothes and arranged all of my luggage. The reason I am focussing on \"less\" is to show that changes take place gradually. Things settle in gradually.\n\n***We often expect everything to become rosy after suffering for some time and this expectation only disappoints us later.***\n\nOpening a bank account opened in UK is a challenge in itself particularly for international students. Students have to wait for months to get an appointment but I couldn't afford this delay since I was supposed to receive my the first instalment of my stipend and I needed an account for that. Hence, I had a goal to *somehow* get an appointment in any bank by the end of the month. When my friends were attending clubs and parties, I was running between HSBC, Natwest and Bank of Scotland. But here is the exciting thing - sometimes, life just works in surprising ways. By a stroke of luck, I got an appointment and managed to get my account opened - *something I planned to do at the end of the month*!\n\n## Compounding effect in life.\n\nI have often observed that many things in life have a **compounding effect**. If you keep feeling helpless, nothing or nobody will help you. Once you start helping yourself, you find people are approaching you for help and things are suddenly starting working out in your favour.  Of course, everyone knows that things take time to settle in but he rapidity of life and success stories on Instagram make one oblivious to that. In my personal experience, *I took each new day as an opportunity to add new layer of routine.* In the next few days, I went to IKEA and my lifeless room had plants and night lamps 🌵, my clothes were better organized 👖. I made new friends who would help me in cooking. I was still finding it hard to plan 3 meals for the day but with *lesser* anxiety :)\n\n***Everyone wants to go from 0 - 100 but nobody thinks about the steps in between even though everyone knows about them***\\*.\\*\n\n## Third Week.\n\nBy this time, I had some idea about the things around me and finally had the courage to go out and explore the city. One day, I decided to take myself out for shopping - alone. I fell in love with Primark and JD Sports 🤣. I spent the entire evening walking on the Princess Street, listening to music and realizing the small steps I was taking to settle in this country.\n\nWorking out has been an important part of my life since my undergrad. In the first two weeks, I observed my class schedule to see how and when was it feasible to workout. **Then, I decided to add another layer to my routine - enrolling in the university gym.** Since a large part of my evening is spent in making dinner, I decided to workout in the morning which is not that difficult. But when you combine it with the Scottish weather, things change 😆\n\nAround this time, we were well into the second week of studies and minor assignments started to kick in. The University of Edinburgh follows a \"flipped classroom\" format where you have to study the course material before the weekly lecture. This is completely opposite to the academic system back in India. In the beginning and even till now, I took me some time to understand what was happening.\n\n***Whenever I felt lost, I thought about my past weeks and how I overcame things one at a time.***\n\n## Present Day.\n\nToday, I complete my first month in Edinburgh. A month that was full of ups and downs, high and lows, self-doubts and questions, hard work and patience. Living abroad is definitely not partying, clubbing and visiting picturesque places, it is managing every minute of your life and living in survival mode - something we don't see in Instagram reels. **Remember when our parents used to put health before everything?** It makes complete sense now. In the initial days, I was questioning every decision I made - studying abroad, pursuing a PhD and what not. A month later, I am able to somewhat believe in myself again :)\n\n>So, the next time you are beginning something new, be kind to yourself and tell yourself that everything (settling in a new place, starting a new job, making new friends) needs time 🌻.\n\n\\---------------------------------------------------------------------------------------------------------------------------------------------\n\n[Twitter](https://twitter.com/RamanDutt4) | [LinkedIn](https://www.linkedin.com/in/raman-dutt/)",
  "author": "mnist07",
  "created": 1633222371,
  "updated": 1634099968,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.65,
  "comments": {}
}