{"sid": "phktul", "link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/", "title:": "THE POWER OF VPN IN GRAD SCHOOL", "text": "I’ve been thinking about visiting my grandparents outside the US for a quick winter break vacation (haven’t seen them in a few years, they’re getting up there in age). \nI just started a completely online Masters program so being anywhere physically is not a worry for me. \n**Has anyone utilized VPN to keep doing your assignments and grad school work while being out of your respective country? Or did online grad school while traveling around?**\nTips, tricks, is it doable?", "author": "Kooky-Blacksmith1342", "created": 1630729676, "retrieved": 1632844799, "over_18": false, "upvotes": 11, "upvote_ratio": 0.87, "comments": {"hbpg5fg": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbpg5fg/", "text": "I don’t *have* to use it for university purposes per say, as I am just traveling outside the country but still want to be able to access my blackboard and resources. So I dunno if the university would give me access to it.\nTherefore, I’m potentially debating just using NordVPN if they don’t but also don’t know how well that would even work. \nBut I understand your point, I use Cisco VPN for my remote work too!", "author": "Kooky-Blacksmith1342", "created": 1630861604, "upvotes": 1}, "hbm6dg4": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbm6dg4/", "text": "My uni is in the UK and I am in Canada. I have a desktop in my office that I connect to remotely. Never had to use a VPN, but one is available through my university. They installed a special protected VPN on my desktop in the UK, which I can enable to secure my connection if I am using public wifi to connect remotely. \n\nNormally, if you need to use a VPN, it would be provided by your university. For example, during my undergrad, we had to install some software on our personal laptop that required to be connected to our uni server to access the licenses. Since this required us to be on campus, the uni made us install a special protected VPN (cisco) so that we could use the software from home.", "author": "methomz", "created": 1630791335, "upvotes": 2}, "hbl30q0": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbl30q0/", "text": "Is your course material region locked or something? Or are you trying to hide the fact that you’re traveling from your program?", "author": "ThrowawayHistory20", "created": 1630773567, "upvotes": 1}, "hbkurra": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbkurra/", "text": "I only used school’s VPN to enroll courses. Then doing online courses (coz of covid) and accessing library without VPN has been working well for me. If your school doesn’t tell you that it’s necessary to use VPN, you’re good to go.", "author": "Godzillavio", "created": 1630769934, "upvotes": 1}, "hbk2zup": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbk2zup/", "text": "I'm no expert, but I'm pretty sure the whole VPN security thing is super overrated. As I understand it, the measures NordVPN and everyone else that sponsors half of YouTube are built into modern websites. But don't take my word for it, I'm an econ major", "author": "ArguablyCanadian", "created": 1630754958, "upvotes": 5}, "hbjt8hb": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbjt8hb/", "text": "I'm not sure how your physical location matters here... Why would the university restrict access based on geography?", "author": "Single_Blueberry", "created": 1630746588, "upvotes": 6}, "hbjhlrf": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbjhlrf/", "text": "VPN is indispensable for me to connect to the high performance clusters at my uni. I'm doing my PhD in a simulation heavy topic and it's the only way to run my experiments. If I was forced to use my laptop, it would take years to run what I usually get done in about a week!", "author": "dxn99", "created": 1630736617, "upvotes": 4}, "hbjestf": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbjestf/", "text": "I've left the US multiple to conduct fieldwork outside the country. Always used my university's preferred VPN service. Its slow at times but gets the job done. It helps if the internet in your host country is decent.", "author": "bobrigado", "created": 1630734518, "upvotes": 2}, "hbja7k7": {"link": "/r/GradSchool/comments/phktul/the_power_of_vpn_in_grad_school/hbja7k7/", "text": "We have to use a VPN to access the library and other resources while off campus. It's a little slower but workable. Just make sure you disconnect before doing any non-school work.", "author": "itsonlyliz", "created": 1630731322, "upvotes": 11}}}