{
  "sid": "q1f9f8",
  "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/",
  "title:": "Experiences with moving family for grad school.",
  "text": "Since I was very young all I’ve ever wanted was to get my PhD, I don’t know why since no one in my life had achieved this. Anyway, long story short, between my undiagnosed ADHD and being a teen mom it took me 14 years to complete my B.A. \n\nCurrently, I’m over 35, married, and pregnant. My partner has a good job in the marijuana industry and is on an upward trajectory so anywhere I apply needs to be a place where he can continue this type of work. This obviously limits where I can go, but I don’t have much of a choice. \n\nI’m just looking for anyone’s experience with a similar situation. How do you justify following your dreams when they impact your family so heavily?",
  "author": "ItsFineImFineNotFine",
  "created": 1633381678,
  "updated": 1634099920,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hff0rve": {
      "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hff0rve/",
      "text": "You get to demonstrate to your children in real time how to work hard and follow your dreams to make the future what you want it.\n\nSeems pretty great to me.\n\nDon’t get me wrong.  It’s going to be crazy hard with a family and it will be essential to have a crazy supportive spouse that picks up a ton of the slack at home.",
      "author": "Weekly-Ad353",
      "created": 1633389964,
      "upvotes": 7,
      "replies": {
        "hffu8ax": {
          "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hffu8ax/",
          "text": "I appreciate the optimism, I needed to hear that. Thanks!",
          "author": "ItsFineImFineNotFine",
          "created": 1633404993,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfh3h2q": {
      "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfh3h2q/",
      "text": "Hey OP. I did not have to move for my PhD, but I have had to make similar sacrifices as I just started my program with a 10 month old (also in my 30s). Matter of fact, my husband is also in the cannabis industry and has a great job. This is one of the main reasons I was able to go back to school since his salary can support our family. While it may be hard, its really the best case scenario right now. I get all my work done at school and  keep a very strict schedule. As soon as I pick up baby work is done and it's mom time! Husband and I make a meal plan each week and whoever gets home first starts on dinner. He takes baby for 3-4 hours somewhere on weekends and I get to spend that time at home either reading or cleaning/laundry (all of which will help my week run more smoothly). I don't have the typical financial stresses of grad student life nor do I have the isolating experience of being a stay-at-home mom during a pandemic. That said I think grad school has positively affected my mental health, which I'm finding is rare. \n\nSome things that have helped along the way include finding the right advisor. My advisor was aware of my situation way before I started my program. He is aware of the boundaries I have to keep in order to separate work from home life. Another thing I recommend is having some dedicated time with your kids. I take Fridays off and spend all day with baby. It's the best end to my week. \n\nAt the end of the day, I'm doing this in order to get my family to a better place, and to instill in my child the importance of and value in education. It sounds like your passion is already there, you just need the cards to line up. Thankfully the cannabis industry is booming and your partner should be able to find a good job if the experience is there. I hope it works out for you and you are able to make those dreams of yours a reality. (Also it sounds like we may be able to connect on many levels so please dm me if you ever want to chat!)",
      "author": "arinko_mi",
      "created": 1633439199,
      "upvotes": 3,
      "replies": {
        "hfhxuaa": {
          "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfhxuaa/",
          "text": "Our similarities give me so much hope! There’s a lot in your post that I think we can make work in our home, and you sound so balanced which is what I will be striving for. \n\nThankfully, there are some programs and people I’d like to work with in the states that have an active cannabis industry. With a little extra planning and discussion with my partner I think we’ll be able to find the right situation for us. \n\nI may take you up on that invitation to reach out!",
          "author": "ItsFineImFineNotFine",
          "created": 1633452465,
          "upvotes": 1,
          "replies": {
            "hfja53j": {
              "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfja53j/",
              "text": "I'm glad you gained some reassurance from my situation. Balance is what I strive for as well so it's nice to hear your impression.\n\nThankfully the legalization of cannabis is becoming more widespread. I am so thankful that my husband got into the field when he did. If your looking for prospects, we are in NV and it seems that there are always jobs available. Schools are limited, but there are a few great programs.\n\nAnd please do reach out if you'd like. Newborn mom life is hard enough. You got this!",
              "author": "arinko_mi",
              "created": 1633473063,
              "upvotes": 2,
              "replies": {
                "hfk1p99": {
                  "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfk1p99/",
                  "text": "We’re in Nevada right now! Got my Bachelors from UNLV. I’m on the fence about applying to a grad program here but it’s still up for debate. My top preferred program right now is actually in Washington but everything is still up in the air as of now.",
                  "author": "ItsFineImFineNotFine",
                  "created": 1633486646,
                  "upvotes": 1,
                  "replies": {
                    "hfmbkd0": {
                      "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfmbkd0/",
                      "text": "Haha!! Hey Reb! We do have a lot in common... I'm sending you a message :)",
                      "author": "arinko_mi",
                      "created": 1633537111,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfgzv8n": {
      "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfgzv8n/",
      "text": "It's difficult! I have a wife and two kids and prioritizing time between family and study is very challenging. I want to be there for my family but, obviously need to do my study. COVID-19 has made things trickier as my eldest can't go to kinder. My wife doesn't work which keeps her at home for better or worse at the moment with our youngest being only one year old. \n\nPlanning out my PhD with family in mind has also been tricky. Ideally I'll be doing field work overseas. Where I want to study is my wife's home country which makes it a little easier, but schooling is a worry as my eldest will be just starting primary school. Add to this we moved to a new city to work on my PhD and it's all just a big muddle. \n\nWhat I will say, is that having family increases the amount of calculations you have to do. It's not just you. If it were, I'd probably happily go off and do field work for 12 months or more. Time management becomes extremely important in finding a balance between the two because a PhD is generally a passion project that you will want to be working at all the time. I currently split my time between research, tutoring and family and it's hard. I generally study 3-5 hours during the day with about 3 hours at night after the kids have gone to sleep. \n\nIn the end, your mileage will vary, the relationship you have with your spouse will make or break the experience.",
      "author": "cynikles",
      "created": 1633437299,
      "upvotes": 2,
      "replies": {
        "hfhyr9o": {
          "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfhyr9o/",
          "text": "You hit the nail on the head when you said if it was just you. That’s exactly how we had thought it was going to be; I was going to apply to all my preferred programs and he was going to follow when he could. But, plans changed and we felt the time was running out to have a baby so here we are. Maneuvering around the tricky planning will be a chore but I think it’ll be worth it. Thanks for sharing your story with me, it’s helpful to hear real life scenarios!",
          "author": "ItsFineImFineNotFine",
          "created": 1633452836,
          "upvotes": 2,
          "replies": {
            "hfjv06j": {
              "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfjv06j/",
              "text": "Since my first child I’ve taken on the mantra that nothing will ever be perfectly planned. COVID actually accelerated my plans to do my PhD as the industry I was in was suffering. Given the funding I’m getting, it was a good decision rather than just waiting around to be given the chop.\n\nIt has however made other calculations difficult, but we saw it as a chance to do what I was passionate about even if the kids aren’t as settled as we’d hoped. Best laid plan, eh.\n\nSounds like you’re in a good place though. Best of luck with it!",
              "author": "cynikles",
              "created": 1633483143,
              "upvotes": 2,
              "replies": {
                "hfk2k1r": {
                  "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfk2k1r/",
                  "text": "Sounds like you have a very supportive partner and I’m lucky to have that as well. He knows how badly I want this so I know he’ll sacrifice to make it happen but the goal is to compromise on our sacrifices. \n\nThanks for the well wishes and I wish you continued success in your journey!",
                  "author": "ItsFineImFineNotFine",
                  "created": 1633487053,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfh9or4": {
      "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfh9or4/",
      "text": ">How do you justify following your dreams when they impact your family so heavily?\n\nBaby steps. Start with the Masters and don't worry about the PhD right now. See where that leads you.",
      "author": "raistlin65",
      "created": 1633442189,
      "upvotes": 2,
      "replies": {
        "hfhwh47": {
          "link": "/r/GradSchool/comments/q1f9f8/experiences_with_moving_family_for_grad_school/hfhwh47/",
          "text": "This is actually very helpful. Helps to ground me because I become quite the alarmist when I put everything in front of me. Thanks for that!",
          "author": "ItsFineImFineNotFine",
          "created": 1633451911,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}