{"sid": "lfi45q", "link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/", "title:": "You may not be hearing back yet because your PI may be waiting on funding", "text": "Just wanted to give some hope in the darkness that is waiting for grad school decisions. I have been in pretty constant contact with my PI. He let me know that I won't hear back about a decision until he gets word on a grant that he submitted. \n\nYour pi may be going through the same thing, so don't panic if some people in your department are getting acceptances and your not yet.", "author": "Expensive_Historian", "created": 1612808610, "retrieved": 1632846196, "over_18": false, "upvotes": 327, "upvote_ratio": 0.99, "comments": {"gmperbu": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmperbu/", "text": "Shoutout to you being in contact with someone because I can't catch anyone at my school. I'm just in limbo and it's extremely frustrating.", "author": "MySonPorygon137", "created": 1612884467, "upvotes": 1}, "gmnv0lh": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmnv0lh/", "text": "Very true. This is solid knowledge for any prospective applicants for grad school. No funding, no student. I saw someone else wrote this comment on this thread but I know for some certain programs, usually it's a red flag for you if the school doesn't give you funding (i.e., asks you to pay).", "author": "Frosted_Cookie", "created": 1612843650, "upvotes": 2}, "gmnujqf": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmnujqf/", "text": "Thanks for writing this. But wouldn't they send unofficial acceptances earlier, and then send out the official offer once the funding has been secured?", "author": "GoatalGoaterer", "created": 1612843385, "upvotes": 1}, "gmms36k": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmms36k/", "text": "Don’t do that. Don’t give me hope.", "author": "ManbearpigDa", "created": 1612823476, "upvotes": 7}, "gmmjy47": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmmjy47/", "text": "Also please do not waste a rotation on a lab with no funding. They are just using you for free labor. If they say they \"might get\" funding ask what the key dates are for when they'll find out. Ask people in the year or two above you if anyone in their cohort rotated in this lab and then ask them directly if they were led to believe a position might become available, then not given the option to join. I hate seeing PIs do this to new students, and I hate that program directors don't do more to prevent it.", "author": "MercuriousPhantasm", "created": 1612819728, "upvotes": 15}, "gmmg8kt": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmmg8kt/", "text": "Very true. I wasn’t accepted to the school I’m at now until April 17, which is pretty late. They were so tight making the decision that I never even got my official acceptance via the school portal or email, they just emailed me as soon as the funding came through.", "author": "whitcantfindme", "created": 1612818052, "upvotes": 2}, "gmme9mn": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmme9mn/", "text": "I third this! I'm on our dept's grad student recruiting committee and we are still waiting to hear how many students our university will permit is to bring on. We give assistantships to every student we accept, and our uni is dragging their feet.", "author": "WhyIDoIt", "created": 1612817175, "upvotes": 11}, "gmm80f7": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmm80f7/", "text": "From your username, I assume you're also applying to history programs, so this comment is probably the most soothing thing I've heard in weeks.  I'm waiting on 5 schools rn, 2 of which have already sent out a couple acceptances and a few rejections according to Gradcafe", "author": "virtualmayhem", "created": 1612814331, "upvotes": 12}, "gmm3gu3": {"link": "/r/GradSchool/comments/lfi45q/you_may_not_be_hearing_back_yet_because_your_pi/gmm3gu3/", "text": "Second this. As a PI, the schedule disconnect between grants and students is super annoying. When grants have 6 month decision time, it's almost impossible to hire new students for August in January. Some departments use TAs to get the students in while the PI waits for funding decisions.", "author": "Plasma4life", "created": 1612812299, "upvotes": 59}}}