{
  "sid": "qhdiho",
  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/",
  "title:": "Suicides in grad school",
  "text": "This is just a reminder to check in on those around you. Also, if you are struggling please go talk to someone. Grad school is never worth your life. \n\nWe have had 4 suicides in my program in the last year and a half. Its awful.",
  "author": null,
  "created": 1635390419,
  "updated": 1636202287,
  "over_18": false,
  "upvotes": 474,
  "upvote_ratio": 1.0,
  "comments": {
    "hic71r3": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hic71r3/",
      "text": "My school isn't much better. The administration treats mental health like a problem endemic to the population, not as something they actively contribute to. All they do is offer counseling services every time something bad happens. \n\nIt's appalling. I'm sorry to hear that it isn't just my school, and my heart breaks for all of you to have suffered such losses.",
      "author": "grad_student_15543",
      "created": 1635392202,
      "upvotes": 130,
      "replies": {
        "hiff07z": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiff07z/",
          "text": "This is my main complaint about how mental health is treated in grad school. My institution has a massive back log in mental health services in addition to keeping super strict policies around marks and standards to keep up with your degree/stay in your program. I get they want to remain among the best institutions but now even MORE people are needing mental health services from witnessing suicides because they happen and are often public (in buildings on campus). Then they go and just fix the area that allowed someone to commit suicide in that method instead of looking at their own policies, the economic and housing pressure these kids are under and how crushing some of the expectations on them are.",
          "author": "No_Income6576",
          "created": 1635453559,
          "upvotes": 4,
          "replies": {}
        },
        "hifnoe2": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hifnoe2/",
          "text": "The responses of department to the increasing number of suicides on campuses throughout North America are indeed appalling. Last time this happened, our cohort received gift cards for candles to pay respect and a link to a help line.",
          "author": "arok9",
          "created": 1635457120,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hic58fh": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hic58fh/",
      "text": "You must go to Vanderbilt. The new administration is ripping everything apart yet doing nothing for mental health. Honestly surprised this issue isn’t gaining more attention. 4 students is outrageous.",
      "author": "Capital_Librarian387",
      "created": 1635391263,
      "upvotes": 192,
      "replies": {
        "hicnh7j": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicnh7j/",
          "text": "Damn, I was accepted to Vanderbilt for grad school, but turned it down for a different place. I remember that it seemed like a stressful environment",
          "author": "Aerismeow",
          "created": 1635402646,
          "upvotes": 58,
          "replies": {
            "hid5ngo": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hid5ngo/",
              "text": "[deleted]",
              "author": null,
              "created": 1635417815,
              "upvotes": 20,
              "replies": {
                "hido7ub": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hido7ub/",
                  "text": "I think it’s going to get worse not better. They’re getting rid of the only people that truly cared about the students (I.e. Beth is getting let go). Kathy is just making IGP awful.",
                  "author": "Capital_Librarian387",
                  "created": 1635428410,
                  "upvotes": 21,
                  "replies": {}
                }
              }
            },
            "hieo8tz": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hieo8tz/",
              "text": "My one friend had the same experience, she interviewed/was accepted to a program at Vanderbilt and said everyone there seemed miserable so turned it down to go somewhere else",
              "author": "IncompletePenetrance",
              "created": 1635442967,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "hidycx7": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidycx7/",
          "text": "The excuse of “mental health services” at vandy is pathetic too. You get 6 free sessions of therapy, after that you have to pay. And the hoops you have to go through to get into therapy are excessive, especially for someone struggling.",
          "author": "throwaway883113",
          "created": 1635432758,
          "upvotes": 26,
          "replies": {
            "hidzxn5": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidzxn5/",
              "text": "[deleted]",
              "author": null,
              "created": 1635433407,
              "upvotes": 8,
              "replies": {
                "hie0ix9": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hie0ix9/",
                  "text": "Yeah it was 6 weeks before I was seen. I told them on intake I was having suicidal ideation, but I guess because I didn’t have a plan it wasn’t urgent?",
                  "author": "throwaway883113",
                  "created": 1635433647,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "hieujka": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hieujka/",
              "text": "Same with Harvard. It is atrocious. I had to find someone outside of their “mental health” services because 20 minutes every month wasn’t cutting it.",
              "author": "GFP-tagged",
              "created": 1635445407,
              "upvotes": 6,
              "replies": {
                "hiif2fw": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiif2fw/",
                  "text": "At UNC we get eight sessions then they will refer you out (you have to pay then). I was willing to pay, but when I asked for a referral near me (I'm 2 hours away from campus) they just said they couldn't help and recommended I Google therapists in my area.\n\nUNC had an attempted and a completed suicide in one week ~3 weeks ago; they sent out lots of platitude-filled emails and cancelled classes. It was a day I didn't have classes and just worked in lab though so business as usual . . .",
                  "author": "Ancient_Winter",
                  "created": 1635514822,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hicck78": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicck78/",
          "text": "I think it was online school year. I really do. All of the stress minus the positive feedback (or at least human interaction) that releases the brain chemicals you need to stay alive.",
          "author": "Vassukhanni",
          "created": 1635395220,
          "upvotes": 68,
          "replies": {
            "hiduxe9": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiduxe9/",
              "text": "Definitely has to be a huge factor. That stretch was extremely isolating, even *with* a good social support network. And for many grad students, they've dropped everything and moved somewhere new, where they almost definitely do *not* have those resources. The lack of human interaction can really fuck up your brain chemistry.",
              "author": "nickyfrags69",
              "created": 1635431341,
              "upvotes": 19,
              "replies": {
                "hieu53w": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hieu53w/",
                  "text": "Idk how to do the fancy Reddit quotes on mobile but: “for many grad students, they’ve dropped everything and moved somewhere new, where they almost definitely do not have those resources.”\n\nI’ve said this almost word for word to my therapist about my own experience. I uprooted my life and moved halfway across the country to a city I didn’t know anyone in, abandoning the support network I’d spent several year building. It was going to be okay because the community in my department was fantastic and my partner and I could thankfully afford to fly and see each other pretty frequently (both on generous fellowships). \n\nThen covid hit my second semester. Suddenly I had no department and it was unsafe to fly (I was considered at risk for covid complications several times over). I would go weeks not having a single in real life conversation with a person and went basically a year without even TOUCHING another human being. And we were just expected to keep going through all of it. \n\nThen I was in Texas and the winter storm hit too and it was so traumatic and a harsh reminder of how isolated and helpless I was. The only reason I didn’t freeze/starve was the help of neighbors who didn’t even know me. \n\nI’m in my third year now and have been seeing a therapist and psychiatrist for a while. At the moment I’m pretty sure I’m going to master out and move back to my partner/friends. Grad school is tough anyways but I think people really gloss over how destructive covid has been for a lot of us.",
                  "author": "anintellectuwoof",
                  "created": 1635445250,
                  "upvotes": 14,
                  "replies": {
                    "hieut0f": {
                      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hieut0f/",
                      "text": "I moved cross country for graduate school as well but started in fall 2020. I understand what you mean and i was severely depressed being locked in my apartment doing online school with no one around me.",
                      "author": "aj-the-queen",
                      "created": 1635445510,
                      "upvotes": 5,
                      "replies": {
                        "hieyp4q": {
                          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hieyp4q/",
                          "text": "Understandably. It’s really depressing circumstances and as supportive as my profs/advisors were, many of them had families (which I understand was hard in its own way) and I don’t think a lot of them appreciated how isolating it was for some grad students",
                          "author": "anintellectuwoof",
                          "created": 1635447041,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hiwu3s7": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiwu3s7/",
                  "text": "Losing that social support network is so difficult. I moved from the US to Europe for an MS program and things have been sort of up in the air all semester as far as exam dates etc. That was already stressful enough, but then another curveball hit today (3 week empty gap between our last lecture and our only in-person final exam) and just completely took the wind out of my sails. Scheduled an appointment with a counselor within 20 minutes of getting that email. FaceTime has been a great tool, but it can only do so much to replace those people in your support network being physically present.",
                  "author": "teddyg027",
                  "created": 1635790599,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hidjje2": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidjje2/",
          "text": "I did a quick google search and barely anything came up. I am also surprised this isn’t gaining more attention",
          "author": "NattyKhala",
          "created": 1635426186,
          "upvotes": 11,
          "replies": {
            "hidjtka": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidjtka/",
              "text": "Yea we get the email or two from the dean with quick condolences. Besides that I think they are trying to keep it under wraps as much as possible",
              "author": "Capital_Librarian387",
              "created": 1635426325,
              "upvotes": 20,
              "replies": {
                "hie1iq0": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hie1iq0/",
                  "text": "You’d think with all the money these universities pull they’d have the resources to do *something*…",
                  "author": "NattyKhala",
                  "created": 1635434059,
                  "upvotes": 8,
                  "replies": {
                    "hiff9bn": {
                      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiff9bn/",
                      "text": "They are doing *something*. They're covering it up.",
                      "author": "Farnswirth",
                      "created": 1635453661,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hid5kef": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hid5kef/",
          "text": "[deleted]",
          "author": null,
          "created": 1635417751,
          "upvotes": 29,
          "replies": {
            "hidh3ie": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidh3ie/",
              "text": "Great job for standing up and trying to do something about it. I wish you the best and hope positive change comes out of your efforts",
              "author": "NattyKhala",
              "created": 1635424940,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hie140p": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hie140p/",
          "text": "I've seen around that number when I was at my undergraduate school and hearing it happen within a cohort is even more depressing.",
          "author": "saucepls042",
          "created": 1635433889,
          "upvotes": 3,
          "replies": {}
        },
        "hifkwmc": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hifkwmc/",
          "text": "I’m applying to the English PhD program at Vandy, but this information is making me hesitant.",
          "author": "LittleFlowers13",
          "created": 1635455961,
          "upvotes": 1,
          "replies": {
            "hji5f4d": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hji5f4d/",
              "text": "The two this semester I believe were in the biological sciences/medicine/stem area, though I can't speak for the other two since this is my first semester. It does feel weird and dystopian that the administration literally just sends one email about it, but for me personally the professors who teach me and that I work under in a lab all at least mentioned it, and how if we need help to reach out. I get how that's not nearly enough, but I think most professors genuinely care but don't know how to help. If you're looking to attend vandy, you're probably looking at a lot of other incredible schools, and I don't think this issue is something that can be avoided by choosing another institution. \n\nTL:DR - administration is out of touch at almost every good university, profs care but don't know what to do, I wouldn't let this completely turn you off",
              "author": "Bi1lNyeTheRussianSpy",
              "created": 1636167035,
              "upvotes": 2,
              "replies": {
                "hjiqq61": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hjiqq61/",
                  "text": "Thanks for the perspective. My current school for my MA is also very out of touch, but it’s still a great school, though we’ve had our own issues this year with SAs being swept under the rug and the higher ups letting the problem persist while pretending nothing is actually happening. It makes sense that each institution has deep rooted issues, it’s just a frightening statistic to read (though I’m sure anyone reading about my school’s would also be frightened, I know I am).",
                  "author": "LittleFlowers13",
                  "created": 1636179851,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hice0cu": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hice0cu/",
      "text": "Wtf, 4 suicides?! Im so sorry to hear that, I know the pandemic is really affecting some people pretty badly.",
      "author": "murfmurf123",
      "created": 1635396057,
      "upvotes": 109,
      "replies": {}
    },
    "hicrk5i": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicrk5i/",
      "text": ">We have had 4 suicides in my program in the last year and a half. Its awful.\n\nI hope that's a big school?  Because that's a lot of people for any educational institution or workplace to withstand.",
      "author": "DontRunReds",
      "created": 1635405935,
      "upvotes": 38,
      "replies": {
        "hicsxq4": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicsxq4/",
          "text": "My cohort is 11 people. Program in total is maybe 45? 4 is a soul crushing number. I can’t imagine losing even one.",
          "author": "MohnJilton",
          "created": 1635407096,
          "upvotes": 49,
          "replies": {
            "hiesid4": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiesid4/",
              "text": "My program is at least 100 and I’d be shocked at one too.",
              "author": "Milch_und_Paprika",
              "created": 1635444612,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "hijhpzx": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hijhpzx/",
          "text": "Suicide prevention researcher here. That number is astonishing. A normal population with 4 suicides in a year (for simplicity sake) should be about 25,000. The number would need to be adjusted for age and sex, but “WHOLY CRAP!” is the professional way to describe it.\n\nThat’s a university chancellors issue right there. Something needs to change",
          "author": "lincoln_hawks1",
          "created": 1635530272,
          "upvotes": 2,
          "replies": {
            "hil6hch": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hil6hch/",
              "text": "> A normal population with 4 suicides in a year (for simplicity sake) should be about 25,000.\n\nThat puts it in perspective for sure.",
              "author": "DontRunReds",
              "created": 1635556146,
              "upvotes": 4,
              "replies": {
                "hitkps9": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hitkps9/",
                  "text": "Yup. I really would like to know how the school is addressing this. There are some strategies that work, but I am guessing administrators are just putting their head in the sand and blaming the dead students",
                  "author": "lincoln_hawks1",
                  "created": 1635721259,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hicgi09": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicgi09/",
      "text": "two suicides from my school. It’s so heartbreaking",
      "author": "haloflower157",
      "created": 1635397621,
      "upvotes": 21,
      "replies": {
        "hiff8a5": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiff8a5/",
          "text": "These people spend their entire lives dedicating themselves to achieving something incredible like getting into grad school, only for the program to drive them to suicide or give them lifelong mental health issues. This system is really killing off the best people we have.",
          "author": "InCoffeeWeTrust",
          "created": 1635453649,
          "upvotes": 1,
          "replies": {
            "hij6qb2": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hij6qb2/",
              "text": "I agree",
              "author": "haloflower157",
              "created": 1635526038,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hidafkb": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidafkb/",
      "text": "Grad school cured my anxiety by not giving af anymore",
      "author": "animelover9595",
      "created": 1635421102,
      "upvotes": 20,
      "replies": {
        "hie8t89": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hie8t89/",
          "text": "ABSOLUTELY THIS!",
          "author": "sallie_bae898",
          "created": 1635436971,
          "upvotes": 1,
          "replies": {}
        },
        "hifzhgx": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hifzhgx/",
          "text": "What do you mean by that?",
          "author": "Out_Of_Work_Clown",
          "created": 1635462440,
          "upvotes": 2,
          "replies": {
            "hig50b2": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hig50b2/",
              "text": "The first 6 months I was chronically anxious and stressed out because I cared about everything that was happening but then I stopped caring and everything stopped being so anxious lol",
              "author": "animelover9595",
              "created": 1635465014,
              "upvotes": 8,
              "replies": {
                "hiighb6": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiighb6/",
                  "text": "Hmm interesting. Thanks!",
                  "author": "Out_Of_Work_Clown",
                  "created": 1635515447,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hice5op": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hice5op/",
      "text": "I asked my school for a Mental health therapist/counselor they replied saying we can't hire one because the teachers don't feel stressed enough and we don't have Bachelors students in our college so ne need, there is no stress.",
      "author": "john_wick__4",
      "created": 1635396144,
      "upvotes": 51,
      "replies": {
        "hickhel": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hickhel/",
          "text": "Wtf",
          "author": "tiptoemicrobe",
          "created": 1635400388,
          "upvotes": 19,
          "replies": {
            "hicnpqq": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicnpqq/",
              "text": "Plenty of Indian schools are like this but Since our college is a Centrally Funded uni I thought things might be different.",
              "author": "john_wick__4",
              "created": 1635402832,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "hid1cl7": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hid1cl7/",
          "text": "My university offers counseling and psychiatry… I’ve been on the wait list to see someone for nearly a year. They said it might be another year before they get me in. (None of the local doctor offices are taking new patients.) I get that there’s short staffing everywhere but this seems like a major issue that people are going downhill fast even though we’re asking and begging for help. I hope you find someone to help you and that students and staff are finding help elsewhere. That’s a horrible excuse they gave you.",
          "author": "jezebel8991",
          "created": 1635414395,
          "upvotes": 15,
          "replies": {}
        },
        "hicz2se": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicz2se/",
          "text": "What ?????",
          "author": "adnanazmee",
          "created": 1635412461,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hictmpg": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hictmpg/",
      "text": "God I am so fucking sorry. I’ve lost two friends.",
      "author": "soytitties",
      "created": 1635407690,
      "upvotes": 13,
      "replies": {}
    },
    "hidh02l": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidh02l/",
      "text": "Which specific program at Vanderbilt?",
      "author": "TheScathingQueef",
      "created": 1635424892,
      "upvotes": 12,
      "replies": {
        "hidjm8m": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidjm8m/",
          "text": "The biomedical sciences umbrella program. So IGP/QCB",
          "author": "Capital_Librarian387",
          "created": 1635426226,
          "upvotes": 19,
          "replies": {
            "hji5val": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hji5val/",
              "text": "Yeah I just started here for BMS this year, but fortunately my PI is very understanding of grad school stress and workload. It was really weird for me to see the first email that we got sent this semester, because the last institution I was at didn't do anything like this",
              "author": "Bi1lNyeTheRussianSpy",
              "created": 1636167260,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hid7vdw": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hid7vdw/",
      "text": "Same with my school. I feel like every other week I'm getting a email that is talking about a student committing suicide. It's really sad and heartbreaking. Please check up on people. Especially if they start to feel distant.",
      "author": "Melon_Lord_13",
      "created": 1635419409,
      "upvotes": 11,
      "replies": {}
    },
    "hidd9t0": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidd9t0/",
      "text": "4 in one year is... A lot. What are people in this school doing to students? It must be a terrible place",
      "author": "Normal_Kaleidoscope",
      "created": 1635422839,
      "upvotes": 10,
      "replies": {
        "hiffm72": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiffm72/",
          "text": "Fyi - to anyone who wants to study in Canada. SFU has the highest suicide rate among all Canadian schools.\n\nEdit: a recent study showed that 11.5% of all students seriously considered and/or attempted suicide. \n\nMore needs to be done to bring crappy schools like this to light.",
          "author": "InCoffeeWeTrust",
          "created": 1635453804,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hidzliw": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidzliw/",
      "text": "Oh that's so awful. :( \n\n&#x200B;\n\nWhen I was in grad school, there was a student that had a full-blown panic attack during class, and another student had to call 911, because the professor was being an ass and assigned them a project on Thursday that was due on Sunday, and the computer labs with the app were only open during the weekdays. The administration walked in right after, and asked the other students what was wrong, and if it was the class. They all shouted, \"It's this damn program!\" \n\n&#x200B;\n\nPersonally, I wasn't any better off either, and attempted while I was in grad school. There really needs to be more support for graduate students. It's as if the admins forgot what it was like to be a student.",
      "author": "carrot_cat",
      "created": 1635433268,
      "upvotes": 10,
      "replies": {
        "higwopq": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/higwopq/",
          "text": "When I was in grad school, I checked myself into a mental hospital because I knew I was about to harm myself. I took leave for a semester, and because I was on leave, I lost my health insurance. There wasn’t even an option for something like COBRA. \n\nBecause I no longer had insurance, I lost my place in the outpatient program that was the condition of my being released from the hospital. The hospital no longer felt the need to help place me in an alternative program, so I was left with zero support or resources. \n\nThere’s only so much we can do to look out for each other. The systems have to change.",
          "author": "Discussion-Level",
          "created": 1635477946,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hic91y7": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hic91y7/",
      "text": "It's a little ominous that this post got deleted?!",
      "author": "Destination_Centauri",
      "created": 1635393282,
      "upvotes": 36,
      "replies": {
        "hicdwmb": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicdwmb/",
          "text": "They almost certainly just don't want to be identified. Its pretty identifiable.",
          "author": "InfuriatingComma",
          "created": 1635395997,
          "upvotes": 69,
          "replies": {}
        }
      }
    },
    "hicmnhl": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicmnhl/",
      "text": "Grad school can often disguise other underlying mental health issues. Learned this the hard way.",
      "author": "alone_in_this_rhythm",
      "created": 1635402012,
      "upvotes": 14,
      "replies": {}
    },
    "hidzdsf": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidzdsf/",
      "text": "I’ve been at NCSU for grad school for 3+ years now and they’re really fantastic, especially in my department. Easily accessible triage therapy (you just walk in) and the school insurance provides free therapy and psychiatry. I got diagnosed with social anxiety, panic disorder, MDD and ADHD and my life has immensely improved from attending this program, even though it brought me to some of my lowest points (just by the nature of grad school). Accommodations are generous too.\n\nEdit: looking at this post, I realized my comment might seem a little callus. I’m incredibly sorry for anyone that’s experienced anything remotely like OP and it’s a huge problem in higher education in general. Sometimes it kind of feels like the standard of the education are getting lower and yet mental health is getting worse and it’s really discouraging. I just wanted to highlight a really good program/school that I’m incredibly grateful for because I did not have remotely as good a time in undergrad.",
      "author": "tjskie",
      "created": 1635433181,
      "upvotes": 5,
      "replies": {
        "higwvui": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/higwvui/",
          "text": "I didn’t read it that way at all. It’s important that we circulate the schools that are harmful AND the ones that are supportive.",
          "author": "Discussion-Level",
          "created": 1635478045,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hidlo6n": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidlo6n/",
      "text": "Fuck. I'm sorry to hear that. Please check on people. I'm so grateful for my department. I don't know about the rest of my school, but they care so much about us here. I broke down because of personal reasons after an exam last night. Not only did my prof check on me, make sure I was ok, but when I explained my headspace during the exam - went through the questions I got wrong and just asked me the answers ( I knew them I just questioned myself during the exam because I'm questioning some personal stuff and it was screwing with my mind - like I'm normally the really cheerful one in class and I broke down crying because contemplating divorce in the middle of grad school with a toddler was not on the agenda).\n\n&#x200B;\n\nAlso, if you don't already have some form of therapy lined up, please get some. I don't want to imagine my state of mind without it.",
      "author": "jouleheretolearn",
      "created": 1635427218,
      "upvotes": 5,
      "replies": {}
    },
    "hiedc8k": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiedc8k/",
      "text": "My program contributed heavily to clinical depression and eventually suicidal thoughts. I left the program. Best thing I ever did with my life.\n\n&#x200B;\n\nTypically, all the power in a grad program rests on the other side of the table. If you're a minority in a program, your power shrinks considerably. Lots of programs are insulated from recognizing and dealing with this abuse of power and many times they reward it. So often it goes unpunished. The best thing you can do is to 1) recognize it 2) get help, and/or 3) remove yourself from the toxic environment. You are still a smart person (arguably more so) even if you abandon a grad program and you'll rediscover that there's lots more to life once you're on the outside.",
      "author": "daphnephoria",
      "created": 1635438745,
      "upvotes": 3,
      "replies": {}
    },
    "hiciahu": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiciahu/",
      "text": "Can someone explain what happened?",
      "author": "grothendieck1",
      "created": 1635398851,
      "upvotes": 8,
      "replies": {
        "hid5xn6": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hid5xn6/",
          "text": "[deleted]",
          "author": null,
          "created": 1635418024,
          "upvotes": 17,
          "replies": {
            "hiddb6i": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiddb6i/",
              "text": "I haven't seen any of Vanderbilt's emails but I've been privy to the drafting of similar communications. Admins have been getting a lot of advice from mental health researchers about contagion, but so far that advice has been reactive -- the note about the first suicide goes out and the experts jump in to say \"No, please don't do it this way next time.\" The other, more common limit is what the family signs off on. These announcements don't go out with more than the bare minimum without the family's blessing.",
              "author": "dcgrey",
              "created": 1635422861,
              "upvotes": 9,
              "replies": {
                "hiddl4i": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiddl4i/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1635423024,
                  "upvotes": 5,
                  "replies": {
                    "hidhart": {
                      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidhart/",
                      "text": "Yep, that's the level of limited info I'm describing, and it does feel off given what we're used to seeing in the past. But it's really a change in advice and thus policy. (Again, this is a general statement about changes in higher ed practices, not specific to Vandy's decisions.)\n\nThe other issue is official cause of death. I recently authored an obit for a faculty member and knew not to include anything more than \"died suddenly\". People who knew the deceased knew it was a heart attack, but the obit had to go out before authorities announced an official cause of death, and the school wasn't going to attach its name to any information that didn't come from local authorities. It would look *more* suspicious if we announced a heart attack and a week later authorities announced cardiac arrest due to a drug overdose.\n\nIn other words, the overall calculation from schools is \"We need to get this news out, we need to make people aware of mental health resources, we can't say anything the family doesn't want us to say, and we won't announce an unofficial cause of death.\" That leaves a pretty bare-bones announcement as the default option.\n\nThat doesn't stop others from reporting a suicide, though. Local news have their own contacts within the medical examiner's office and may report something like \"...in what authorities describe as an apparent suicide.\" Even that practice is changing, though. Reporters are more likely to avoid any mention of cause of death without an on-the-record statement from authorities; instead they stick to bare facts like \"was found dead this morning in their dorm room.\"",
                      "author": "dcgrey",
                      "created": 1635425046,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hidw18w": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hidw18w/",
      "text": "4 is insanely high regardless of cohort size, but it would be particularly damning if it is a smaller cohort. The other crazy part on the school's end is taking on a PhD student is technically a huge investment for the school. Almost everyone in here can probably recall getting some sort of admissions letter stating that you're getting some crazy amount of money in terms of financial commitment. Mine said I was getting roughly $95K yearly when you add up stipend, health insurance, and the cost of tuition (expensive private school in high CoL city). Even when you factor in the arbitrary nature of the cost of tuition, these suicides, among all of the sadness, loss, etc., also represent a massive financial toll for universities that I'm shocked they don't take more seriously, because money tends to be the only thing that these universities truly care about. Because they lose not only those 4 investments, but they also receive a huge hit to reputation, significantly reducing the quality of future applicants and thus perhaps impacting future ability to obtain funding.",
      "author": "nickyfrags69",
      "created": 1635431805,
      "upvotes": 7,
      "replies": {}
    },
    "hie2nq8": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hie2nq8/",
      "text": "We had a recent suicide in my school as well, and as someone who has a history of mental health issues in the past, I do hope that universities can pay more attention to mental health, but considering some of the schools' indifference to these types of issues, the chance is quite dismal tbh.",
      "author": "TheFreeJournalist",
      "created": 1635434521,
      "upvotes": 3,
      "replies": {}
    },
    "hiefkc3": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiefkc3/",
      "text": "the common denominator of those 4 suicides is the school. \n\nYou're right, grad school is never worth your life.",
      "author": "GoneFishing4Chicks",
      "created": 1635439608,
      "upvotes": 3,
      "replies": {}
    },
    "hicxwna": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hicxwna/",
      "text": "Ted Kacynski was right.",
      "author": "actuallynotcanadian",
      "created": 1635411433,
      "upvotes": 11,
      "replies": {}
    },
    "hieg7c0": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hieg7c0/",
      "text": "I think every grad student needs to have a therapist. Full stop",
      "author": "ErwinHeisenberg",
      "created": 1635439856,
      "upvotes": 2,
      "replies": {}
    },
    "hiejwj6": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiejwj6/",
      "text": "Two in my program in the past year",
      "author": "LetsGoGameCrocks",
      "created": 1635441294,
      "upvotes": 2,
      "replies": {}
    },
    "hiewx6u": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiewx6u/",
      "text": "I'm not afraid to say it, but many suicides are caused by malevolence. Higher education continues to lack accountability and psychological and emotional abuse is rampant. Dangerous personalities gravitate towards higher education for many reasons. It's a subject society continues to ignore, but at the end of the day, systems don't cause suffering, people do. I'm sorry to hear, hope you're holding up well.",
      "author": "mindofmitch",
      "created": 1635446343,
      "upvotes": 1,
      "replies": {
        "higd0lf": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/higd0lf/",
          "text": "THIS",
          "author": "excelnotfionado",
          "created": 1635468771,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiektwm": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiektwm/",
      "text": "I'm so sorry to hear for your loss. Our campus just had its second student suicide in two years - one in the final steps of his dissertation and one in his second year of grad school. Suicidal ideation is something I dealt with for several years while in the program and has taken me to several support and therapy groups. - my work hasn't been the most impressive but in all honesty I'm just grateful to have survived my time here.\n\nWe need to take care of each other, and also for our programs to address the systemic and cultural hurdles that make graduate school such a brutal experience. Our school recently started a program for teaching students resiliency, but that's no replacement for comprehensive mentorship training among our faculty and staff.",
      "author": "Qunfang",
      "created": 1635441655,
      "upvotes": 1,
      "replies": {}
    },
    "hiel10p": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiel10p/",
      "text": "I'm so sorry this happened in your program. There needs to be change in grad programs. Depression is huge in graduate students and I would say academia has a mental health (and therefore a disability) problem.\n\nMy program has better advocacy from students but I remember hearing about a student being asked to leave the program after posting concerning things on social media. I admit I don't know the full story but it made me feel hesitant to be too open about specifics of mental health struggles.",
      "author": "Zealousideal_News_18",
      "created": 1635441732,
      "upvotes": 1,
      "replies": {}
    },
    "hievm3c": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hievm3c/",
      "text": "One of my closest friends in graduate school took his own life last year. A faculty member in the same department committed suicide a couple years before. \n\nCheck on those around you, even if they seem like they're doing fine. A lot of us struggle in silence.",
      "author": "yukionna31",
      "created": 1635445829,
      "upvotes": 1,
      "replies": {}
    },
    "hif1oib": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hif1oib/",
      "text": "And this is why I withdrew from my PhD. Academia can fucking *suck it*",
      "author": "ormr_inn_langi",
      "created": 1635448234,
      "upvotes": 1,
      "replies": {}
    },
    "hifeksw": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hifeksw/",
      "text": "It’s posts like these that deeply saddened me, and make me apprehensive to continue on with my graduate studies.",
      "author": "kubrickfanclub_",
      "created": 1635453390,
      "upvotes": 1,
      "replies": {}
    },
    "hifl9ds": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hifl9ds/",
      "text": "I almost became one this week. \n\nCheck in on your friends and please get help if you need it.",
      "author": "inspektorkemp",
      "created": 1635456109,
      "upvotes": 1,
      "replies": {
        "hig3opt": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hig3opt/",
          "text": "So glad you’re still here, feel free to reach out if you need someone to talk to",
          "author": "castor2015",
          "created": 1635464397,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hif08wo": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hif08wo/",
      "text": "Must be a philosophy program. Speciality in Schopenhauer",
      "author": "benfarris46",
      "created": 1635447658,
      "upvotes": 0,
      "replies": {}
    },
    "hifqjs7": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hifqjs7/",
      "text": "I honestly wish someone would just sit me down and tell me to quit at this point.  I know that a lot of my struggles are the result of lacking certain skills that can be learned, but I think I am not ever going to catch up and make up for lost time.",
      "author": "GandalfDoesScience",
      "created": 1635458360,
      "upvotes": 6,
      "replies": {
        "hii2vu2": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hii2vu2/",
          "text": "The fact that you wrote this comment means that a part of you knows something is wrong. Please talk to a neutral person (chaplain, therapist) who can give you that little push you need in the right direction (i.e. maybe quitting). They will give you a fresh perspective that may not be as burdened as your own. My best wishes for you.",
          "author": "funkykookaburra",
          "created": 1635508751,
          "upvotes": 3,
          "replies": {
            "hiiq52i": {
              "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiiq52i/",
              "text": "Thanks for the comment.  What I meant to say, but did not really include in my original comment on account of mindlessly venting, is that I get encouragement from people who tell me I'm doing fine, *but I feel that it would be so much easier if someone just came out and said to give up.*  I have gone the route of mental health services and am learning to adapt my behavior to help me accomplish my goals more effectively, but I just feel that there is a lot of catching up to do.",
              "author": "GandalfDoesScience",
              "created": 1635519483,
              "upvotes": 2,
              "replies": {
                "hik2o00": {
                  "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hik2o00/",
                  "text": "Ah, I understand you now. I'll add myself to the group of people encouraging you on, then!",
                  "author": "funkykookaburra",
                  "created": 1635538499,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "higum9y": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/higum9y/",
      "text": "I may have told this story before, but it merits repeating. A few decades ago, city buses in my home town were bursting into flame. A study was conducted and it was found that it was mainly due to poor maintenance. The solution was to install an emergency exit door in the buses. \n\nCampus mental health services are much like the emergency exit door. They are a temporary solution to a more pervasive problem. The real solution is to have faculty who actually care about their students' training. In my experience, when it comes to faculty, young beats old, up and coming beats established, and international beats domestic. \n\nAdditionally, students' workload ought to be managed better. If you contemplate taking your life, please seek help. Especially in graduate school, you are most certainly not alone.",
      "author": "SquirrelOnTheDam",
      "created": 1635476914,
      "upvotes": 5,
      "replies": {
        "hii30ia": {
          "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hii30ia/",
          "text": "Ah, the classic old 'treating the symptom, but not the cause.' :/ :(",
          "author": "funkykookaburra",
          "created": 1635508826,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hiy1o8e": {
      "link": "/r/GradSchool/comments/qhdiho/suicides_in_grad_school/hiy1o8e/",
      "text": "I don’t want to be the first one in my program",
      "author": "jinglebells23",
      "created": 1635808715,
      "upvotes": 1,
      "replies": {}
    }
  }
}