{"sid": "pobm4k", "link": "/r/GradSchool/comments/pobm4k/missed_a_grant_deadline_and_i_feel_like_such_a/", "title:": "Missed a grant deadline and I feel like such a fool.", "text": "I need to vent somewhere. Maybe the worst part is that the grant itself was done. It was done yesterday. I was waiting on a final sponsor document from my PI (there were a couple that trickled in through the morning). I emailed thirty minutes before deadline, heard nothing, finally got it less than 5 mins before (turns out it was trapped in his drafts). Then as I was uploading, the deadline hit. Tried to email and call, and was politely but firmly told no, they only do extensions if you ask before deadline, this isn't an extenuating circumstance, and I should've submitted earlier to avoid this sort of thing. I know they're right. If I got the ball rolling on everything in my proposal earlier, my PI would also have started his bits earlier too, and I could've submitted well before the deadline. But the part of me that spent so much time and energy on this feels awful. I don't need another week or another day to write or revise. The thing is finished! I just need a few minutes.\n\nPI asked for their email address and I think is now trying to beg/schmooze on my behalf, which is great, in that there might actually be a chance I can still submit -- though also slightly embarrassing that I needed my boss to sweep in to remedy my fuck-up. I think he's probably annoyed at me for understandable reasons.\n\nAnyone wanna commiserate/share tales of unexpected grace shown post-deadline to feed my false hope?", "author": "rudolfvirchowaway", "created": 1631653440, "retrieved": 1632844547, "over_18": false, "upvotes": 6, "upvote_ratio": 0.88, "comments": {"hcy4ygw": {"link": "/r/GradSchool/comments/pobm4k/missed_a_grant_deadline_and_i_feel_like_such_a/hcy4ygw/", "text": "I submitted a grant last month that I worked 8 months nearly every day on. It was my first grant I’d ever written and it had so many parts that it felt like a monster. After the deadline, I got an email that none of my reference letters had been submitted and my grant wouldn’t be considered. Come to find out, I’d given my references the FOA number from the year prior and immediately felt like an idiot. I’d triple checked everything but somehow I missed this. I called and they were able to route my letters to the correct FOA and I think I thanked the guy on the phone at least 500 times. It sounds like your PI is on your side and if they thought there was no chance in fixing things, I don’t think they’d even try to contact the organization. Keep your head up!", "author": "rosahhlee23", "created": 1631712577, "upvotes": 1}, "hcx0b9e": {"link": "/r/GradSchool/comments/pobm4k/missed_a_grant_deadline_and_i_feel_like_such_a/hcx0b9e/", "text": "A very similar thing happened to me. What I learned from it was that big big big things need to be completely finished a day before the deadline.", "author": "youre-a-good-person", "created": 1631682926, "upvotes": 3}, "hcw1vy5": {"link": "/r/GradSchool/comments/pobm4k/missed_a_grant_deadline_and_i_feel_like_such_a/hcw1vy5/", "text": "Any chance of a similar grant opportunity coming up soon that you can easily repurpose your current content for? I once forgot to submit IRB paperwork for a team. I didn’t realize I had been “assigned” or “volunteered” for that task so it wasn’t even on my radar until someone asked me why it was taking so long to get approved and I said that I didn’t know and asked who submitted it. Eyes got big 👀.", "author": "azzhole81", "created": 1631665443, "upvotes": 1}, "hcvtqap": {"link": "/r/GradSchool/comments/pobm4k/missed_a_grant_deadline_and_i_feel_like_such_a/hcvtqap/", "text": "My biggest mistake was designing a box, but somehow writing the height measurement as 1/2 of what it should've been. Cost us a few grand and a month to rebuild.", "author": "PeaceAndPrajna", "created": 1631661655, "upvotes": 1}}}