{
  "sid": "qza7em",
  "link": "/r/GradSchool/comments/qza7em/is_anyone_doing_well_in_there_career_and_thinking/",
  "title:": "Is anyone doing well in there career and thinking about dropping out of grad school?",
  "text": "So I'm male 32. I work in a pretty niche field of data analytics. My career hadn't gone well up until 2017 when I landed the job I'm currently working at. I had gone backwards in my career and then was unemployed for a few months before that.\n\nThis job was by far the best compensated I've ever been in a position, and I was terrified of going backwards in my career and thought I had plateaued what I could achieve with my qualifications so a graduate degree made sense. \n\nWhats changed now, is that while nothing is for certain, I no longer have any job insecurity. I recently got promoted in my position and I already got my programming certification part of the degree which was my primary motivation. I have no energy or will power to do my classes anymore, so assignments take an extraordinary amount of time, detracting from my other priorities like work and getting into shape.\n\nI'm realizing now as a senior analyst, a graduate degree is going to make less of an impact on my career going forward, and it would make more sense an acquire other domain certifications. Two of the past three courses I took a required an extension to complete, I had made excuses for myself, but my current course is shaping the sameway and its absolutely the cause of lack of motivation/necessity on my part.\n\nSo I'm trying to find out if anyone has been in my position, how they were able to motivated themself and if they continued with school. After my current course I only have three classes left, and I receive tuition assistance from my job so it does seem like a shame to quit now, but on the other hand I just don't need it. \n\nAny advice would be appreciated! Sorry for the long post.",
  "author": "Ayiteb",
  "created": 1637546210,
  "updated": 1637689798,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlla5cj": {
      "link": "/r/GradSchool/comments/qza7em/is_anyone_doing_well_in_there_career_and_thinking/hlla5cj/",
      "text": "I should also add, I am no longer interested in leaving this position to work my way up the ladder as I get an annual raise and hope to stay in my current role until I retire.",
      "author": "Ayiteb",
      "created": 1637548394,
      "upvotes": 1,
      "replies": {}
    },
    "hlms0ol": {
      "link": "/r/GradSchool/comments/qza7em/is_anyone_doing_well_in_there_career_and_thinking/hlms0ol/",
      "text": "Their",
      "author": "Acceptable_Ad_5233",
      "created": 1637585001,
      "upvotes": 1,
      "replies": {
        "hlndemi": {
          "link": "/r/GradSchool/comments/qza7em/is_anyone_doing_well_in_there_career_and_thinking/hlndemi/",
          "text": "I saw that already, Reddit won't let you edit a thread's title.",
          "author": "Ayiteb",
          "created": 1637595735,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}