{
  "sid": "beqoaf",
  "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/",
  "title:": "“But we have a student counseling center”",
  "text": "Great. That is taking SUCH good care of our mental health.\n\nResources are available where I can talk to a trainee psychologist about how frustrating and miserable my life is, for a maximum of six sessions, and then afterward I am going to feel so much better that the thought of stepping out in front of a bus will never cross my mind again no matter how much my department and advisor screw around with my funding, future, and sanity.\n\nBut we have posters up on the walls for the counseling center, so everything is OK now and we are doing a great job addressing the issue of graduate student mental health.\n\n**Edit:** Not hating on the counseling centers here, they do the best they can. My complaint is with faculty/departments that think they're \"addressing the issue graduate student mental health\" by putting up posters for the counseling center, instead of addressing that the way the treat us CAUSES a lot of the problems. \"Sure I cut your arm off with a chainsaw, but I told you that we have a cupboard with bandaids...\"",
  "author": "tentkeys",
  "created": 1555621230,
  "over_18": false,
  "upvotes": 407,
  "upvote_ratio": 0.96,
  "comments": {
    "elcy58s": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/elcy58s/",
      "text": "If you are experiencing mental health issues, please seek professional medical help.\n\nYou may also wish to consult with the following subs [/r/Depression](https://www.reddit.com/r/Depression), [/r/Anxiety](https://www.reddit.com/r/Anxiety), [/r/Getting\\_Over\\_It](https://www.reddit.com/r/Getting_Over_It), [r/SuicideWatch](https://www.reddit.com/r/SuicideWatch) for mental health assistance.",
      "author": "tfburns",
      "created": 1555778873,
      "upvotes": 1
    },
    "elb31l0": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/elb31l0/",
      "text": "This is the same with those “because of my disability, I am more responsible!  Contact services for students with disabilities today!”  Bullllllllshit. We do the same work as everyone else, just harder because we don’t have the same privilege as a non-disabled person.  I worked hard and got in. I’m more responsible because of that? Fuck you.  It’s by posters of “feeling depressed, tired, unfocused? Come and talk to your counselors today!”  Fuck you again. Just shows how ignorant and condensing a department and the university can be.",
      "author": "keepthemomentum",
      "created": 1555717087,
      "upvotes": 1,
      "replies": {}
    },
    "elaa04h": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/elaa04h/",
      "text": "I've had nothing but bad experiences with my school's counseling center. Every time I've gone they've tried to pass me off to using my insurance to see someone in town for an arm and a leg instead of getting counseling there. \n\nOne time I went in when I was having a very difficult time managing and the counselor got mad at me for not knowing exactly what I needed from the counseling center and seemed surprised when I said I needed help figuring out what I needed.",
      "author": "mormoerotic",
      "created": 1555697082,
      "upvotes": 1,
      "replies": {}
    },
    "el8zm36": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8zm36/",
      "text": "Our university counseling center is an absolute joke. \"Oh, you're severely depressed from your research? Well we have a huge wait list for people trying to get in to see counselors so maybe in a few months someone will be available to see you.\"\n\nThen, an even bigger joke is the fact that they have these group counseling sessions for grad students, but if less than 4 people show up to a session then they cancel the session. They wait 15 minutes after the sessions are supposed to start and if 4 grad students aren't present after that, then they cancel it. So you waste your time going there and waiting for people to possibly show up, while a counselor sits on her computer because she doesn't want to help the people that are there unless she feels it's worth her time and effort.\n\nAlright sorry, I'm done ranting. It's been a stressful week and I think I need sleep.",
      "author": "NintendoNoNo",
      "created": 1555655939,
      "upvotes": 4,
      "replies": {}
    },
    "el8wgkj": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8wgkj/",
      "text": "I went to the student health center and was told that it was a 4 to 6 week wait (minimum), that I had a limit of 10 sessions, and that they'd recommend I seek services elsewhere. \n\nIf that doesnt scream \"we cant help you\", I dont know what does. It disappoints me that the number of students at my university is cited as the reason, but I feel that it just means the university isn't willing to hire enough staff to serve the mental health needs of the campus.",
      "author": "padfoot1225",
      "created": 1555652005,
      "upvotes": 5,
      "replies": {}
    },
    "el8v0wf": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8v0wf/",
      "text": "I feel you there. I can't help, but I can commiserate. We could all write a book, each contribute one page, about the issues we faced. I hope you find wellness in the future OP. <3",
      "author": "tah_infity_n_beyarnd",
      "created": 1555650452,
      "upvotes": 1,
      "replies": {}
    },
    "el8u2qz": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8u2qz/",
      "text": "There are absolutely people within higher education who don't care. At large, graduate student mental health and graduate culture are definitely messed up.\n\nBut being a doctoral student in psychology, having spent almost all my training in college counseling centers, it's my experience that most of those in college counseling centers do care. Rates and severity of mental illness in higher education are rapidly rising and we don't have the resources to keep up. Session limits are not to screw anyone over, it's to try and allow us to provide care to as many people as we can. It is by no means a perfect solution.\n\nNot that it's anyone responsibility - especially those already struggling - but people should make this frustration not known to their counseling center (trust me, we know) but to their administrations. Many counseling centers are fighting for more resources to help burned-out counselors help a burned-out student body. The only people who can give those - and often withhold them - are administration.",
      "author": "drwhoster",
      "created": 1555649466,
      "upvotes": 6,
      "replies": {
        "el9zya6": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el9zya6/",
          "text": "Agreed. I do not mean to hate on the counseling center or the people there AT ALL.\n\nWhat I hate is the departments who think putting up posters for the counseling center makes them “mental health friendly” and “doing their part to address the graduate student mental health crisis” when the shitty ways the treat us are actually playing a huge role in CAUSING the problem in the first place and they won’t even acknowledge (let alone try to change) that.",
          "author": "tentkeys",
          "created": 1555690979,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "el8ol0e": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8ol0e/",
      "text": "So so real. I feel you. <3 \n\n&#x200B;\n\nAt the counseling center, I finally found someone I could talk to and then the rug was pulled under my feet when I reached my max number of sessions. Then, when I went out into the \"community\" (university speak for the rest of the world), it took me a long time to actually find a therapist and psychiatrist that worked for me. \n\n&#x200B;\n\nNow, our university-backed health insurance is changing and neither my psychiatrist nor my therapist take the new plan. \n\n&#x200B;\n\nBut, there's a counseling center...",
      "author": "renibear",
      "created": 1555644419,
      "upvotes": 7,
      "replies": {}
    },
    "el8o7mm": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8o7mm/",
      "text": "Came here to say you might want to check out the PhDepression",
      "author": "themoonsaidyes",
      "created": 1555644115,
      "upvotes": 3,
      "replies": {
        "el8ptm0": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8ptm0/",
          "text": "Came here to say that posts by PhDepression actually worsened my anxiety about grad school. Too much negativity, not enough evidence-based solutions.",
          "author": "purple_dancer12",
          "created": 1555645480,
          "upvotes": 5,
          "replies": {
            "el8q160": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8q160/",
              "text": "Oh no, really? I'm sorry to hear that! I was passing along since I heard about it at a grad school mental health day event, but I have not used it as a resource myself",
              "author": "themoonsaidyes",
              "created": 1555645664,
              "upvotes": 3,
              "replies": {
                "el8q662": {
                  "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8q662/",
                  "text": "I think there are other social media accounts that do a better job. I think they’re trying, but not in the right ways.",
                  "author": "purple_dancer12",
                  "created": 1555645790,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "el8l7wd": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8l7wd/",
      "text": "How about you just go to an off campus psychologist? I've done it myself since undergrad. I'm sure your student health plan offers plans for seeing a provider off-campus. Ignore campus health resources. I always have.",
      "author": "grajmiss",
      "created": 1555641732,
      "upvotes": 1,
      "replies": {}
    },
    "el8kylr": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8kylr/",
      "text": "Don’t hate on counselors in training. \nWe’re more up to date than most licensed counselors are. \nYes it sucks that you only get x amount of sessions, but depending on how big your university is there can only be so many sessions available per student. If you need further assistance, a lot of counseling places offer sliding scale for students.",
      "author": "orangeyoulovely",
      "created": 1555641531,
      "upvotes": 11,
      "replies": {
        "el8mtz7": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8mtz7/",
          "text": "Yes, and we're just as frustrated with situation but at least we're trying to help.",
          "author": "lurkhippo",
          "created": 1555643026,
          "upvotes": 11,
          "replies": {}
        },
        "el9zbyg": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el9zbyg/",
          "text": "Oh no - definitely NOT intending to hate on you guys. You are doing the best you can under a shitty situation that you were not responsible for creating.\n\nWho I am hating on is people who treat PhD students as slaves, keep us in a constant state of stress and uncertainty, push us to work way more hours than is healthy, harm our future career prospects for their own self-interest, and generally treat us like shit... and then want to pat themselves on the back for “taking action to address the graduate student mental health crisis” because they put up posters for the counseling center.\n\nWe don’t need posters. We need them to stop CAUSING the graduate student mental health crisis.",
          "author": "tentkeys",
          "created": 1555690596,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "el8klz3": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8klz3/",
      "text": "Oh man. When I confronted my first PhD advisor about his toxic behavior and total lack of supervision his reaction was to tell me to go to the counseling center if I couldn’t handle it. Not you know change his fucking toxic behavior that drove me to tears multiple times. \n\nSo glad to be out of there.",
      "author": "Andromeda321",
      "created": 1555641252,
      "upvotes": 16,
      "replies": {}
    },
    "el8jaft": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8jaft/",
      "text": "It's understandable you felt that way. Counseling services at our universities are mostly programmed these days - most of the trainees just lack the knowledge to humanize the whole experience. You can however ask the counselor to refer you to a real psychologist, if that helps.",
      "author": null,
      "created": 1555640229,
      "upvotes": 1,
      "replies": {}
    },
    "el8i86a": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8i86a/",
      "text": "If you just want to chat with someone supportive, may I recommend trying the “Two Cups of Tea” app? \n\nIt really helped me before I found an antidepressant that works for me. I highly recommend it, no, I’m not affiliated with them. It’s a free app anyway.",
      "author": "ihateflyingthings",
      "created": 1555639408,
      "upvotes": 2,
      "replies": {}
    },
    "el8h4mj": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8h4mj/",
      "text": "Yup. I legit just hit my cap of 10 session this week and can’t use the free services for the rest of the year. I also definitely don’t make enough money to see someone in the community because I don’t have health insurance... it’s a vicious cycle. \n\nI’ve thought about making a support group or something for grad students but it’s obviously not the same as actual counseling.",
      "author": "MeowMeScience1031",
      "created": 1555638562,
      "upvotes": 5,
      "replies": {}
    },
    "el8f9c5": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8f9c5/",
      "text": "The point of mental health professionals is to provide lip service to your intractable problems.  So if I want to feel like I helped you, I could give myself that feeling by pointing you to a mental health professional.  That way, when you step out in front of that bus I'll shrug and say I did my best.",
      "author": "iyzie",
      "created": 1555637101,
      "upvotes": -12,
      "replies": {
        "el8jhf4": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8jhf4/",
          "text": "I wouldn't say that's the point of mental health professionals themselves... most of them really do want to help.\n\nBut the people who want to fob you off mental health professionals, when your problems are largely due to a shitty stressful situation and they are the ones responsible for that shitty stressful situation... fuck them.\n\n\"Yes I cut your arm off with a chainsaw, but I did tell you that we have a cupboard with bandaids, so I've done what I can...\"",
          "author": "tentkeys",
          "created": 1555640383,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "el8ey88": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8ey88/",
      "text": "Mine has a visit cap too. I think 8. What a load of crap",
      "author": "iammaxhailme",
      "created": 1555636866,
      "upvotes": 4,
      "replies": {}
    },
    "el8anpd": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8anpd/",
      "text": "I'm an online student in a different state than where my school is. So while mental health resources exist at my school, I'm not allowed to use them (I was pushed away with no referrals or searches for resources in my area). I understand that you need a state-specific license to practice counseling or therapy or a state-specific license to counsel students in a different state, but do you need a license to hear someone vent? Do you need a license to be compassionate and to tell about free/reduced mental health services in the student's area that may not come up with a Google search? Appparently, the answer is yes to all of those questions.",
      "author": "butnobodycame123",
      "created": 1555633498,
      "upvotes": 3,
      "replies": {
        "el8mpxo": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8mpxo/",
          "text": "Yeah, it's really shitty but they do that because if you're venting and say \"my advisor sucks so much I'm killing myself\" it's a liability nightmare. But that's zero excuse for your school not to help you with at least resources because it should feel like a liability to them that you don't get help. I feel you though my fucking program in clinical psychology won't even offer us any sessions at all and yet I work for free providing therapy at the University counseling center for undergrads. When I've asked my professors who are licensed psychologists where I can go to get help they've basically told me to figure it out myself.  It's disgraceful how schools treat grad students especially around mental health.",
          "author": "lurkhippo",
          "created": 1555642936,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "el86nvm": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el86nvm/",
      "text": "This is especially ironic if you're a psychology grad student. Like, we study the lasting negative consequences of burnout/workplace stress and anxiety, and we can't get it together ourselves. And there's STILL a stigma that if you suffer, there's some personal failing or you're \"just not cut out for the harsh environment of graduate school\" or whatever. Sorry you're going through it :/",
      "author": "coatcheckgirl",
      "created": 1555630343,
      "upvotes": 57,
      "replies": {
        "el89xav": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el89xav/",
          "text": "This, plus the fact that you can’t use the campus mental health services because you are either actively providing the campus mental health services yourself or you know all the current providers because they’re your colleagues 😞",
          "author": "escapevelocity11",
          "created": 1555632922,
          "upvotes": 37,
          "replies": {
            "el8l3wq": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8l3wq/",
              "text": "It’s even better when you live in a small town and can’t use any of the providers in town because they’re all affiliated in some way with your program. 😞",
              "author": "facelessmage",
              "created": 1555641647,
              "upvotes": 15,
              "replies": {}
            },
            "el8nxat": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8nxat/",
              "text": "Plus you have limited options in the community if you are trying to maintain the possibility of working at adult, therapy-oriented externship sites!",
              "author": "intangiblemango",
              "created": 1555643881,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "elbghur": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/elbghur/",
          "text": "> we study the lasting negative consequences of burnout/workplace stress and anxiety, and we can't get it together ourselves\n\nWhenever I see my primary care physician he's always running at least 20 mins late, sometimes over an hour, and he's so rushed and exhausted all the time. One time I swear he was wearing two black sneakers that weren't even the same brand as each other. But he's very kind and cares a lot about patients and he provides great care.\n\nWhenever I leave he'll give me this giant smile and say \"Take care of yourself!\" and I'll think uhhh, you too buddy, you're my age and you look fifty...you too.",
          "author": "doobeedoo3",
          "created": 1555727956,
          "upvotes": 2,
          "replies": {}
        },
        "el8fdoj": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8fdoj/",
          "text": "^ THIS 👏👏👏",
          "author": "Aenouz",
          "created": 1555637198,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "el85vex": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el85vex/",
      "text": "I was just talking to my own therapist at the university counseling center about this shit. \n\nShe recognizes we all have similar problems. She wants to get a grad student group going. \n\nIn another conversation with a colleague, we recognized that our department, too, only gives lip service to MI shit. My advisor and department head are both fed up with me because I fucked up massively this semester. Yet when I explained the severe emotional challenges I was having, they had nothing really to suggest beyond “get it together”.",
      "author": "EmpathyIsAHabit",
      "created": 1555629737,
      "upvotes": 22,
      "replies": {
        "el8dh6a": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8dh6a/",
          "text": "“Get it together” is such a great piece of advice... right up there with “stop having cancer”",
          "author": "tentkeys",
          "created": 1555635702,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "el854sx": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el854sx/",
      "text": "Our school requires having insurance (in the US), and they charge students a lot for it.  If you have that, maybe you can get counseling through your insurance at a private provider?\n\nIf you're low income (likely, as a grad student), see if there are any services from your city or county.  NAMI might be a good place to start.",
      "author": "grandzooby",
      "created": 1555629179,
      "upvotes": 7,
      "replies": {
        "el8cz4f": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8cz4f/",
          "text": "Often the student health insurance must go through the student health center or it's pretty minimal and doesn't include things like mental health, dental, etc, etc. I'm staying on my parents' plan until 26 because the alternative is such mediocre coverage.",
          "author": "mediocre-spice",
          "created": 1555635310,
          "upvotes": 3,
          "replies": {
            "el8dpsq": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8dpsq/",
              "text": "At my school, the student health center is covered by a set of mandatory fees, while the mandatory insurance (if you don't have other qualifying insurance) fee is separate.  But I think you're able to use it at other places.  Though they try to force you through the school provider first and the URL for external providers is hidden at the bottom of a lot of text.",
              "author": "grandzooby",
              "created": 1555635892,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "el84j5z": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el84j5z/",
      "text": "maaaan, I feel this. \n\nGraduate student groups are free on campus... with the caveat that there are about 12 slots per group and 4 total groups for a campus that serves nearly 10,000 grad students. It's against policy to permit people who know each other into the same group, which means that I'm SOL because I know people in allllll the groups. Sigh. \nToday the university had yet another suicide on campus. The second one on campus that made the news in the past three months.",
      "author": null,
      "created": 1555628727,
      "upvotes": 13,
      "replies": {}
    },
    "el83ga4": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el83ga4/",
      "text": "Bonus: it’s the same center the undergrads use, so there’s always a chance you’ll run into one of your students!\n\nThis actually happened to someone I know.",
      "author": null,
      "created": 1555627919,
      "upvotes": 127,
      "replies": {
        "el8hkwh": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8hkwh/",
          "text": "[deleted]",
          "author": null,
          "created": 1555638914,
          "upvotes": 120,
          "replies": {}
        },
        "el8o8y0": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8o8y0/",
          "text": "My university luckily funded two grad-specific counselors in a different building to avoid this. It’s a pilot though so I don’t know if it’ll last 😔",
          "author": "cm0011",
          "created": 1555644144,
          "upvotes": 12,
          "replies": {
            "ela4gjk": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/ela4gjk/",
              "text": "That's what my school does. It's also walk-in and not appointment based so that you're not in the appointment system.",
              "author": "Aerokicks",
              "created": 1555693715,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "el8uyyt": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8uyyt/",
          "text": "I'd hate to run into one of my students at my therapist's office, but I actually made a friend of another PhD student in my department this way! Caught him on the way out of the office when I was heading in and bonded a bit over grad school mental health stuff.",
          "author": "j-universe",
          "created": 1555650393,
          "upvotes": 4,
          "replies": {
            "el975h7": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el975h7/",
              "text": "Bonding over suffering can be dangerous though. It can be self reinforcing.",
              "author": "abloblololo",
              "created": 1555667812,
              "upvotes": 10,
              "replies": {
                "ela07dq": {
                  "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/ela07dq/",
                  "text": "That's definitely something to be wary about. I have had relationships with people where we end up just bringing each other further down, but I've also had ones where we can just commiserate a little and then laugh about it. You never really know which it's going to be til you get to know a person.",
                  "author": "j-universe",
                  "created": 1555691129,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "el7z89l": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el7z89l/",
      "text": "[deleted]",
      "author": null,
      "created": 1555624809,
      "upvotes": 76,
      "replies": {
        "elaa22w": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/elaa22w/",
          "text": "I've had this happen too.",
          "author": "mormoerotic",
          "created": 1555697113,
          "upvotes": 1,
          "replies": {}
        },
        "el83q4y": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el83q4y/",
          "text": "[deleted]",
          "author": null,
          "created": 1555628124,
          "upvotes": -15,
          "replies": {
            "el85o6o": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el85o6o/",
              "text": "[deleted]",
              "author": null,
              "created": 1555629583,
              "upvotes": 32,
              "replies": {
                "el8ns8d": {
                  "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8ns8d/",
                  "text": "> There's also a difference between counseling and clinical psychology, with the latter being focused on more serious pathology like depression and anxiety. So it really depends on the profession those trainees are working towards unfortunately.\n\nWhat? No. \n\nCounseling Psych PhD student here who is currently doing a practicum at a college counseling center (and also works in an inpatient mental health facility with severe mental illness). \n\n1. (Virtually) All mental health professionals treat anxiety and depression. Indeed, to bill insurance, you MUST have a DSM diagnosis. \n\n2. Counseling Centers absolutely deal with anxiety and depression. I would say that it is 90% of what I see in that setting (in my inpatient setting, we have a lot more diversity of diagnoses). \n\n3. Counseling Psychologists are licensed exactly the same way Clinical Psychologists are licensed-- as psychologist. At the end of everything you're a licensed psychologist. That means you ABSOLUTELY have to be able to handle common shit like anxiety and depression. I can't imagine how little you think of your fellow psychologists if you think that is outside of our scope. (We also meet the exact same APA accreditation requirements as clinical psych.)\n\nThere are absolutely situations where is warranted to refer someone to a community provider. Counseling Centers are typically a short term therapy model, so, for example, someone who comes in with adequate insurance and a plan to see a therapist weekly over the long term is probably not a good fit. If someone is actively psychotic, they might need a more intensive program than what is typically offered on campus. Or if the waitlist is hella long, I might talk to someone about community providers who are current accepting clients, so students don't have to wait three months for a first appointment when their problem is happening NOW. But people are not deferring anyone with any mental health issues; that would make our services useless. \n\nI obviously cannot speak for all schools, but I am familiar with procedures at the school where I am getting my PhD and the school where I am a therapist. \n\nTl;dr: This is misinformation.",
                  "author": "intangiblemango",
                  "created": 1555643765,
                  "upvotes": 10,
                  "replies": {
                    "el8q7oo": {
                      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8q7oo/",
                      "text": "I think they meant counseling (the masters level degree) vs clinical psychology (the doctoral level degree), not counseling psychology vs clinical psychology (the distinction you're making).",
                      "author": "MidnightSlinks",
                      "created": 1555645827,
                      "upvotes": 3,
                      "replies": {
                        "el8r4od": {
                          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8r4od/",
                          "text": "That is possible but 1. counseling center placements are typically (not always, but typically) PhD students and 2. counseling Master's students also work with psychopathology, so this would still be incorrect. Anyone who wants to work as a therapist works with diagnosable mental illness; it's necessary if you are going to bill insurance. \n\nI work closely with a number of Master's level clinicians in a variety of settings. They do all the stuff. The difference between a Master's level clinician and a psychologist (who works in a clinical setting) isn't in the therapy they do, it's all the other stuff on top of therapy (e.g. psychological assessment, supervision of future psychologists, research background). \n\nIf this was what was being said, I actually think it's borderline dangerous to suggest that LMHCs/LPCs (and future LMHCs/LPCs) don't work with issues like anxiety and depression, as it can discourage folks to seek out fully competent clinicians who are more accessible. In many areas, access to mental health is super limited, and many psychologists really just do assessment work. Additionally, psychologists are typically more expensive per session (meaning more expensive copays as well), which can create artificial financial barriers for folks who think they need someone with a PhD to manage anxiety. \n\nThis isn't to minimize the impact of either anxiety or depression. More, it is to make it clear that this is within the scope of any competent mental health practitioner.",
                          "author": "intangiblemango",
                          "created": 1555646653,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "el87jcz": {
                  "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el87jcz/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1555631022,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "el86xgl": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el86xgl/",
              "text": "well, yes it kind of does. counselors, therapists, clinicians etc are ethically bound to refer clients out if their issues are outside of the realm of their competence (i.e. their scope of practice). a practitioner who does not have adequate training is very likely to make those issues worse. This is why people specialize to certain client populations and part of the reason why different counselling/therapy/etc training pathways exist.",
              "author": "KatieYijes",
              "created": 1555630548,
              "upvotes": 23,
              "replies": {
                "el87bvd": {
                  "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el87bvd/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1555630858,
                  "upvotes": -3,
                  "replies": {
                    "el8afpj": {
                      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8afpj/",
                      "text": "At the PhD level your training should be developmentally appropriate and progressive in difficulty. In my program, the student counseling center on campus is our first practicum experience (although this may not generalize to other training programs). Once I was a more advanced clinician I started at other pracs in the community where I worked with more complicated or difficult cases. In the final year of training we do a year-long internship (usually not affiliated your program - like a medical residency) of full time clinical work where you further develop your competence to act as an independent psychologist. We definitely learn to deal with difficult cases, but you have to learn basic therapy skills first. \n\nI don’t want to undermine the competence of therapists in university clinics. Just providing some context that it is often a starting point for beginners which is why there are often limitations on things like serious mental illness and suicide risk.",
                      "author": "escapevelocity11",
                      "created": 1555633322,
                      "upvotes": 13,
                      "replies": {
                        "el8bdtg": {
                          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8bdtg/",
                          "text": "You said everything I was going to say in my reply, but much more eloquently. thanks for this response!",
                          "author": "KatieYijes",
                          "created": 1555634074,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    },
                    "el8hkoy": {
                      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8hkoy/",
                      "text": "Just want to throw it out there that if student health clinics had seriously untrained therapists taking on serious cases of psychopathology, there would be equal if not greater uproar that such a scenario was 1) a danger to the individual in need of appropriate support, 2) unfair to the trainee trying to learn and provide care, and 3) a sign that the administrations were not taking mental health seriously.",
                      "author": "islandermine",
                      "created": 1555638910,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "el85ihx": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el85ihx/",
              "text": "Yeah it will. In the real world, counselors/psychologist who have a specialty will refer out if they feel a situation/case is beyond the scope of their training. It’s not a bad thing for a professional to say “I can’t help you” unless it’s not followed up with “but here’s someone who may be able to”.",
              "author": "EmpathyIsAHabit",
              "created": 1555629463,
              "upvotes": 10,
              "replies": {}
            },
            "el880ez": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el880ez/",
              "text": "No, but good therapists do not practice outside of their scope of expertise. Just like you wouldn’t go to your GP for knee surgery",
              "author": "sleepybear7",
              "created": 1555631389,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "el7z6cd": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el7z6cd/",
      "text": "I'm sorry you are struggling. I have had considerable difficulty managing my mental health during grad school. I was able to find a therapist in the community who offers a student rate. It's annoying that my university didn't offer more on campus, but I ended up very happy with the therapist I found. Is there anyone in your community who offers a student rate or sliding scale for payment? That way you won't have to deal with the six session maximum.",
      "author": "MichaelWithAOnTheEnd",
      "created": 1555624772,
      "upvotes": 9,
      "replies": {}
    },
    "el7y2h7": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el7y2h7/",
      "text": "1st world problem. You are in grad school, have funding, not starving or homeless? Cry a river.",
      "author": null,
      "created": 1555623980,
      "upvotes": -63,
      "replies": {
        "el841i7": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el841i7/",
          "text": "[deleted]",
          "author": null,
          "created": 1555628355,
          "upvotes": 26,
          "replies": {
            "el8mubq": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8mubq/",
              "text": "Not to mention the fact that financial struggles do significantly contribute to stress in grad school. There are real fears of being homeless or not being able to afford food.",
              "author": "statsigfig",
              "created": 1555643034,
              "upvotes": 5,
              "replies": {}
            },
            "el870aj": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el870aj/",
              "text": "They’re not warded off by crying on Reddit either. Snowflakes",
              "author": null,
              "created": 1555630607,
              "upvotes": -24,
              "replies": {
                "el87449": {
                  "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el87449/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1555630690,
                  "upvotes": 10,
                  "replies": {
                    "el8uyvm": {
                      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8uyvm/",
                      "text": "I mean, isn't this whole forum an open sounding board for ALL kinds of concerns and topics? Why are we calling people snowflakes for this issue specifically? Tsk tsk.",
                      "author": "tah_infity_n_beyarnd",
                      "created": 1555650390,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "el8uus0": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8uus0/",
          "text": "> 1st world problem. You are in grad school, have funding, not starving or homeless? Cry a river.\n\n^ This perspective is toxically part of the problem, not the solution.",
          "author": "tah_infity_n_beyarnd",
          "created": 1555650270,
          "upvotes": 4,
          "replies": {}
        },
        "el83ak6": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el83ak6/",
          "text": "“oTHeR PeOpLE ArE woRSe OfF THaN yOU”",
          "author": "realFoobanana",
          "created": 1555627801,
          "upvotes": 12,
          "replies": {}
        },
        "el7zb1k": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el7zb1k/",
          "text": "Oh, hi you <3",
          "author": "doobeedoo3",
          "created": 1555624863,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "el7x4xx": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el7x4xx/",
      "text": "I understand how you feel.  It is a very frustrating thing to be trying to tackle grad school and mental health at the same time! :(",
      "author": null,
      "created": 1555623325,
      "upvotes": 4,
      "replies": {}
    },
    "el7vdm0": {
      "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el7vdm0/",
      "text": "In an ideal world, the student counseling center would be for short-term management of less severe situations, with the counselor referring people out into the community if someone else seemed like a better fit - a psychiatrist, or a long-term therapist for example, who was low cost or did sliding scale. A provider at a university hospital clinic can be much cheaper. Speaking from my own experiences, I've found the session limits pretty flexible. I did have to pay after six sessions, I think, but I was seen much more than six times over the course of about five years (I would guess 20 times).\n\nBut, that's not addressing the bigger question, which is that counseling services can't fix adviser bullshit or funding scarcity or the generally broken system. That reflects the wider world, though. How does therapy fix my financial problems? It doesn't. How can therapy get my boss to stop dropping me from projects? It can't. It can give you the tools you need to make changes in your life, but it's not a magic wand. Academia doesn't want anyone getting a hold of the magic wand.",
      "author": "doobeedoo3",
      "created": 1555622097,
      "upvotes": 131,
      "replies": {
        "el7vweq": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el7vweq/",
          "text": "Exactly. There is a very, very easy way to address the graduate student mental health crisis: Stop treating graduate students like shit.\n\nBut they don’t want to do that, so we get posters instead.\n\nAnd then if we’re still stressed out and miserable, maybe we just haven’t been doing enough mindfulness and deep breathing. It’s clearly nothing at all to do with the situation that we’re in.",
          "author": "tentkeys",
          "created": 1555622463,
          "upvotes": 117,
          "replies": {
            "elab63w": {
              "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/elab63w/",
              "text": "AMEN. SPEAKIN THE TRUTH",
              "author": null,
              "created": 1555697775,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ela7iwc": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/ela7iwc/",
          "text": "> counseling services can't fix adviser bullshit or funding scarcity or the generally broken system.\n\nIt's amazing how most of my anxiety, poor sleep, zero self-worth and general shit mood were like 95% cured once I was no longer under an unhelpful and toxic adviser. The other 5% went back to pre-gradschool levels once I landed a job with a livable wage and had a clear path to graduation instead of someone toying me around to their whims and me having no control over that.\n\nNo amount of counseling would have changed the fact that my adviser was awful and the department was fundamentally unhelpful and apathetic in finding a solution to that.",
          "author": "Guavaberry27",
          "created": 1555695559,
          "upvotes": 7,
          "replies": {}
        },
        "el8l0ur": {
          "link": "/r/GradSchool/comments/beqoaf/but_we_have_a_student_counseling_center/el8l0ur/",
          "text": "I find it very frustrating that there's so little discussion of the root causes. 6x doesn't just happen because of self-selection. Something is massively fucked up and I won't say nobody is interested in fixing it because otherwise that article wouldn't have been written....but clearly not enough people in power.",
          "author": "WhoThrewPoo",
          "created": 1555641581,
          "upvotes": 12,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634065650
}