{
  "sid": "hpxy2v",
  "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/",
  "title:": "Is anyone else worried about the return of undergrads?",
  "text": "I'm 4 years into a 5 year Chemistry PhD. Currently my University is only allowing 2 people per lab at a time for those approved to return. There's currently 3 students in my lab so the one closest to finishing gets all day while the other person and I get 4 hour shifts. My ability to get things done is now cut in half and I'm worried that when all the undergrads return there's going to be another shut down. I'm in a state that originally was doing good and now we're surging since everyone thought green meant the virus magically dissapeared. \n\nThere's no way they can keep all the students in line. So far the plan is to do a hybrid method of online and in person, but I have little faith in that. There's not enough staff to sanitize each room after classes, we either have giant halls or the smallest conference rooms, and can we really believe that students are going to take their \"mandatory daily community wellness oath\" seriously and leave the mask on *correctly* at all times until they get back to their dorm? Plus they're told they can't leave, but seeing that most of them are local or close enough to wherever they came from they go home every weekend, I doubt it'll be enforced. \n\nWe have to teach all 5 years as part of our contracts to get paid. Right now I feel okay-ish because I only really work with one other person that I know has been isolating this whole time and we're both real good about sanitizing, mask wearing, and washing up after our shifts. But when I have to teach a whole lab of kids multiple days a week? I'm nervous that I could either get sick and get sent home, or the lab gets shut down because one member could pass it on to the others and all work stops again, OR I take it home and potentially give it to someone that is compromised. \n\nPeople in the department are at 2 extremes: super worried about everyone coming back -or- \"they're young and can handle it\". You'd think in a science based department we'd be a little better at handling this. I know it's selfish, but I was told if this didn't happen I would have graduated a semester early. Now I'm worried about having to stay an extra semester or even a year + possibly having/passing on a deadly disease. Part of me just wants to wait for the 2 papers I have in the works to be published and then duck out with a masters thesis so I don't have to be involved in the major dumpster fire that is about to be college campuses, but I feel like I'd be throwing so much away. \n\nSorry if this is a long ramble. Everyone around me is acting like it'll be fine and I feel a little on edge about it.\n\nTL;DR: Undergrads are supposed to return to campus. Can we really expect there not to be major campus outbreaks?",
  "author": "Its_Just_Jen",
  "created": 1594573927,
  "over_18": false,
  "upvotes": 276,
  "upvote_ratio": 0.96,
  "comments": {
    "fy7hfvo": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fy7hfvo/",
      "text": "I'm worried too. Fortunately, I work in a medical research building that doesn't get many undergrads. I'm hoping they social distance the fuck away from me.",
      "author": "bio-nerd",
      "created": 1594862605,
      "upvotes": 1,
      "replies": {}
    },
    "fxyiz4x": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxyiz4x/",
      "text": "Some of us in Georgia are writing the Board of Regents about these and similar issues. We've gotten almost 700 signatures since it started circulating Thursday: [https://forms.gle/Z22y5PTivrvZj2yY9](https://forms.gle/Z22y5PTivrvZj2yY9)",
      "author": "Firm-Snow",
      "created": 1594667661,
      "upvotes": 2,
      "replies": {}
    },
    "fxwgxx9": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxwgxx9/",
      "text": "Stile with your grad student organization. You have the power!",
      "author": "memercopter",
      "created": 1594617041,
      "upvotes": 1,
      "replies": {}
    },
    "fxw0b86": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxw0b86/",
      "text": "I think we're all feeling this stress. My university (a large public ivy) is apparently making any class over 35 students do remote instruction. This saves me from being in a room with 350 undergrads (I TA intro psych courses), but just returning to campus at all and being around hundreds of students is terrifying. Our grad courses are apparently still going to be taught in person but I KNOW these smaller conference rooms don't get cleaned regularly because I had to clean up after departmental talks as a first year. Not to mention any other public spaces like bathrooms, study areas, etc. I don't see how this isn't going to end in disaster.",
      "author": "_annacat",
      "created": 1594605605,
      "upvotes": 5,
      "replies": {}
    },
    "fxvxwec": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvxwec/",
      "text": "Yep. Since the undergrads left the campus I felt so much safer (because I still had to work on campus in the lab). \n\nI literally overheard some undergrads in my apartment saying “DiD u HeAr TheY’Re ReqUiRiNg eVeRyOnE To WeAr mAsKs iN THe FaLL?11?! ThaT’s sO DumB!!1!!1!!!1”\n\nI wear a mask every time I go out in public. Good thing I’m graduating this summer. Stay safe out there. I wish I could do more to help, but it will be impossible to get everyone to follow the guidelines.",
      "author": "alien81055",
      "created": 1594604126,
      "upvotes": 10,
      "replies": {
        "fxvy65r": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvy65r/",
          "text": "Our undergrads were more angry about the can't go home on weekends thing. I can understand if you're taking care of someone or something, but in that case take the option for at home studies. At the least my college is offering online to anyone who wants it.",
          "author": "Its_Just_Jen",
          "created": 1594604292,
          "upvotes": 2,
          "replies": {
            "fxwe6wt": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxwe6wt/",
              "text": "How do they stop them from going home?",
              "author": "theif519",
              "created": 1594614886,
              "upvotes": 1,
              "replies": {
                "fxwer6l": {
                  "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxwer6l/",
                  "text": "I dunno. They haven't said, but I bet it's part of that \"oath\" thing",
                  "author": "Its_Just_Jen",
                  "created": 1594615310,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fxvwq89": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvwq89/",
      "text": ">There's currently 3 students in my lab so the one closest to finishing gets all day while the other person and I get 4 hour shifts. My ability to get things done is now cut in half\n\nThere are 24 hours in a day...each of you could be working an 8 hour shift if you wanted, with not egregious compromises. Someone works 6a-2p, and the night own works 2-10. Hell even if you two wanted to increase your hours by 50% to 6 hours a day, one person works 8a-2p, and the other works 2p-8p.",
      "author": "Dathadorne",
      "created": 1594603407,
      "upvotes": -6,
      "replies": {
        "fxvx092": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvx092/",
          "text": "We're limited to operating hours only (8-5) and no weekends. Also if our PI is late or can't be present that day we lose that time. It's currently very restrictive.",
          "author": "Its_Just_Jen",
          "created": 1594603578,
          "upvotes": 5,
          "replies": {
            "fxvxilk": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvxilk/",
              "text": "This is very strange, why would you be limited to those operating hours? Not that way at my uni (in a science dept). We've got people working here running animals 24 hours a day, 7 days a week.",
              "author": "Dathadorne",
              "created": 1594603889,
              "upvotes": 1,
              "replies": {
                "fxvxta2": {
                  "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvxta2/",
                  "text": "That's just how the dean/provost/EH&S office decided how it would be done. We're mostly left in the dark on the decisions and the faculty barely knows what's going on because the message is one thing one day and another the next. Originally we were only supposed to be in from 9-4, but we got it expanded a little bit. Technically the PI can appoint another faculty member to be there if they can't be, but that's only reserved for emergency reasons. Unfortunately my boss is not in the best health already so there are a lot of times we can't be in til the afternoon. I sneak around this by working closely with my collaborator, but he has a lot of students so I maybe only get an extra 2 hours from him.",
                  "author": "Its_Just_Jen",
                  "created": 1594604072,
                  "upvotes": 1,
                  "replies": {
                    "fxw5lll": {
                      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxw5lll/",
                      "text": "That sucks ass. Sounds like your department head needs to go up to bat for you guys. The whole point of social distancing is to split people up and be working 24/7, not condense everyone to a narrow window. That makes it worse, not better.",
                      "author": "Dathadorne",
                      "created": 1594608954,
                      "upvotes": 3,
                      "replies": {
                        "fxw601k": {
                          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxw601k/",
                          "text": "Guess who the department chair is... My boss",
                          "author": "Its_Just_Jen",
                          "created": 1594609217,
                          "upvotes": 2,
                          "replies": {
                            "fxw7lmt": {
                              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxw7lmt/",
                              "text": "I'd make that Item #1 this week during your one-on-one",
                              "author": "Dathadorne",
                              "created": 1594610276,
                              "upvotes": 1,
                              "replies": {
                                "fxw7vc8": {
                                  "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxw7vc8/",
                                  "text": "I'll give it a shot, but seeing that she avoids conflict at all costs it probably won't do anything. And the students that are back are more content with shoving everything they have to do in 4 hours than sitting in endless meetings they usually make us do. Or their advisors also don't care. It's a weird department.",
                                  "author": "Its_Just_Jen",
                                  "created": 1594610455,
                                  "upvotes": 2,
                                  "replies": {
                                    "fxw8zpe": {
                                      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxw8zpe/",
                                      "text": "Good luck. The biggest lesson that I learned from grad school was that no one cares about me or my project, and it's up to me to get it across the line, and stand up for myself.",
                                      "author": "Dathadorne",
                                      "created": 1594611205,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fxvw4pk": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvw4pk/",
      "text": "Upgrade from a mask to a respirator, AND wear gloves, AND wear goggles when in public.",
      "author": "PyrocumulusLightning",
      "created": 1594603042,
      "upvotes": -1,
      "replies": {}
    },
    "fxvtqdb": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvtqdb/",
      "text": "I work in a basement, so I am just adjusting my work schedule to avoid most the hours undergrads are on campus. I would only see them during lunch or goi g to. The bathroom, but I'd like. To avoid even that.",
      "author": "Lord_Blackthorn",
      "created": 1594601571,
      "upvotes": 2,
      "replies": {}
    },
    "fxvnf8u": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvnf8u/",
      "text": "My school plans to start online and gradually transition back to campus. I'm only doing a quick 2 year masters but coronavirus has ensured that those two years will be anything but easy. That said computer science is the type of subject that can easily be taught online. The smarter thing to do would have been to do it on a department by department basis.",
      "author": "lead999x",
      "created": 1594597716,
      "upvotes": 1,
      "replies": {}
    },
    "fxvmak7": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvmak7/",
      "text": "Yeah, I'm terrified. I'm a masters student at the largest university in the United States (I think?) and we're in a small, isolated metro area. The locals here haven't been taking shit seriously and we're already near our hospital bed capacity. And we're about to add 70,000 students to the mix? Forget about it. Not to mention that they insist that football is still going to happen, which would mean as many as 102,000 people shoulder to shoulder every week",
      "author": "Americ-anfootball",
      "created": 1594597041,
      "upvotes": 3,
      "replies": {}
    },
    "fxvlr1q": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvlr1q/",
      "text": "Haven’t heard of massive covid outbreaks on campus outside the US where schools were kept open. But given the poor track record of US-based institutions and how widespread the virus already is in that country, it’d be unwise to expect the same from them.",
      "author": "geometer2015",
      "created": 1594596719,
      "upvotes": 4,
      "replies": {}
    },
    "fxvgr4i": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvgr4i/",
      "text": "My university announced a hybrid format where no one is forced to go to class or teach in person if they don't want to... but most of the population is expected to return to campus, live in dorms and interest houses. I just don't understand how it would at all go well, just from people socializing outside of class.",
      "author": "garulous",
      "created": 1594593824,
      "upvotes": 7,
      "replies": {}
    },
    "fxvd5ix": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvd5ix/",
      "text": "I definitely feel you. I am the lab manager so I have to return and we have 2 student workers as well as 5 other grad students. I desperately want to tell my PI to not allow student workers back into the lab unless it’s absolutely necessary since I am immunocompromised and if undergrads are going to classes in person and living with roommates, there’s too many variables. I’m nervous in asking because I don’t necessarily want to put them out of a job but right now I feel like my health is more important. Plus our research relies on human subjects so I really doubt we will be doing much of anything.",
      "author": "foodgeek19",
      "created": 1594591784,
      "upvotes": 4,
      "replies": {}
    },
    "fxvd0a2": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvd0a2/",
      "text": "My university is testing every single undergrad that will be on campus this fall (and paying lab employees to run all the tests by the end of August), and still there will be outbreaks I’m sure. \n\nI’m not in a building that interacts with undergrads, but I still don’t want them back in the labs. I feel like our building has a good protocol for maintaining good practice and everything, and I don’t trust the undergrads further than I can throw them. My PI has opted not to accept any this semester because of that, but I’m sure they’ll still be around. Not a fan, not looking forward to it.",
      "author": "Team_Cap",
      "created": 1594591705,
      "upvotes": 5,
      "replies": {}
    },
    "fxuzn27": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxuzn27/",
      "text": "Grad students: most live and work on campus with many teaching, it makes sense to have small grad student courses in person but everyone should have the online option\n\nFreshman: the on-campus experience is important, but they really wont be getting that and the risk isn't worth the modified on-campus experience.\n\nSeniors: many are doing capstones which is difficult but doable from a distance. Many are also working on job/grad school search which is helped by on-campus resources but the resources likely wont be available. Overall not much reward and high risk.\n\nSophomore/Juniors: I cant think of any reasonable excuse to bring them back. Yes, in-person education is important but not worth the risk. Personally, if I was in this position I'd be taking courses online from a local state/community college to save cash and not even think about going back to school.",
      "author": null,
      "created": 1594584446,
      "upvotes": 10,
      "replies": {
        "fxv6dbh": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxv6dbh/",
          "text": "All students pay the same tuition. Can’t let seniors in without the sophomores and juniors. The fairest approach is online only but then the student will feel robbed. Lower tuition + online only is the way to go. Less rent money is most likely not enough",
          "author": "ThrowOkraAway",
          "created": 1594588095,
          "upvotes": 6,
          "replies": {
            "fxv7eq8": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxv7eq8/",
              "text": ">All students pay the same tuition\n\nI mean no they don't at all even if you ignore class-related fees nor should how much one pays determine access to quality education. \n\n>Can’t let seniors in without the sophomores and juniors.\n\nYou absolutely can, its pretty simple but thats not what I proposed.\n\n>The fairest approach is online only but then the student will feel robbed.\n\nAs long as the school makes the decision before students pay, thats the students fault. If students don't feel its worth it, they shouldn't attend.\n\n>Lower tuition + online only is the way to go. Less rent money is most likely not enough\n\nOnline only for undergrads is definitely the way to go, but good luck getting places to lower tuition. Their costs have risen, they arent going to lower revenue. Smart students will do a semester at a cheap alternative like community/state colleges but expecting your school to lower costs is as useful as daydreaming.",
              "author": null,
              "created": 1594588667,
              "upvotes": 4,
              "replies": {
                "fxv9k09": {
                  "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxv9k09/",
                  "text": "They’re paying for access to educations. That’s just the  way it is. \n\n+ The students didn’t sign up for whatever the fuck online schooling is. \n\n+ if they can’t lower tuition, then universities stand no ground to force student to pay the same tuition for a online education. \n\nThe money makers for these schools are undergrads. So that’s really what important to universities. \n\nEveryone attending know they can take classes at state colleges but they go to the university they go to because of other reason. They most likely have thought out all these pros and cons better than you and me so let’s not try to tell them what to do. \n\nBy your logic, smart students might as well just transfer to state colleges, which is absurd. Again, they know better than me and you",
                  "author": "ThrowOkraAway",
                  "created": 1594589853,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fxwatkn": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxwatkn/",
          "text": ">Personally, if I was in this position I'd be taking courses online from a local state/community college to save cash and not even think about going back to school.\n\nAbsolutely. I work at a big university and a community college, and the big school is trying to open while the CC has seen the writing on the wall and is already going online for the fall",
          "author": "BassPhisherman",
          "created": 1594612468,
          "upvotes": 2,
          "replies": {}
        },
        "fxw2dau": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxw2dau/",
          "text": "The undergrads aren't just paying for the credits, they are paying for the access to educated connections, both among their peers and occasionally the faculty.",
          "author": "ChillyBearGrylls",
          "created": 1594606887,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "fxuthyu": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxuthyu/",
      "text": "Reopening in this situation is clearly nuts and you shouldn't have to do it.\n\nBut, you're in a department\n\n* that has homogeneous contracts\n* that relies on a lot of grad student labor (everyone, all 5 years)\n* in which all students (not just first years) are similarly affected by the teaching situation.\n\nThat means you grad students have a lot of collective power, or at least the potential to claim such. Do you have a union? What is the union doing or debating about the situation? If nothing's happening on that front, have you talked to any other students about organizing?\n\nHow many grad students organizing a teaching stoppage would it take to force the department to negotiate for less student exposure?",
      "author": "i8i0",
      "created": 1594581157,
      "upvotes": 31,
      "replies": {
        "fxuvl8k": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxuvl8k/",
          "text": "So the idea of forming a union has been bounced around since my first year since a neighboring school started being more vocal about it. We've brought it up to each other a few times but I don't think anyone wants to take on the work load with everything else we have to do, plus our department has shown before that those that don't play nice with their system don't make it too far... It's complete bs I know, but I don't think I can do it alone and no one else seems to want to (though maybe that'll change). Right now they have us videotaping labs so I think a lot of TAs are under the assumption we most likely won't have to teach, but similarly to the union issue, I doubt they'll try a teaching stoppage. The closest thing we got to that is when the college tried to tell us they might not have our contracts ready but we'd still have to work. We did actually organize and cause a lot of noise then (I posted about that a bit ago) which worked, but we found out it was mostly the idiot secretary that always chodes the worst way to word emails. So happy ending there, but maybe a union is on the horizon.",
          "author": "Its_Just_Jen",
          "created": 1594582274,
          "upvotes": 8,
          "replies": {
            "fxvg4zi": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxvg4zi/",
              "text": "Sounds reasonable. Best of luck, and I'm glad to hear that when things get bad enough, yall are able to organize against bs.",
              "author": "i8i0",
              "created": 1594593472,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fxuotn6": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxuotn6/",
      "text": "There will be major campus outbreaks. Schools will have deaths on their hands by allowing campuses to re-open, even under whatever “safety” protocols they want to enact. My university is intending to allow 700 students back to campus and making all dorms single-occupancy. Despite this, I highly doubt undergrads will social distance or wear masks when socializing outside of campus or after classes. Coronavirus cases will spike because of this and the risk of re-opening the school under current outbreak conditions is too great. Had we social distanced once states started to re-open or controlled outbreaks by tracking infected cases I’d be much more comfortable with going back. I’ve petitioned my school to remain off campus during the fall but since I TA I highly doubt it’ll get approved. It was really more of a political move on my part to add just that much more pressure on the school to remain closed, no matter how small my voice may be due to my status as a grad student.\n\n/U Captain_Of_All, my heart goes out to all international students that are forced to endure the political moves and whims of our president. I believe that the supreme court will declare this unconstitutional. Additionally, many universities are creating options like 1 credit courses that will be held “on-campus” even though there may not actually be any meeting times or sessions. Other universities are preparing lawsuits to fight this unjust and racially charged mandate. I doubt that it will hold up, rather I believe Trump is trying to shore up his base by inciting class rage and distrust in the “intelligencia” of our country due to this year being an election year. The more he can declare life has returned to “normal”, the better his odds are of winning the election; one of the reasons why he included his name on stimulus checks.\n\nUltimately, the risks of returning to campus should not be worth the reward. I’m going to grad school to further my career goals, not hinder them. If I can’t get out of bed or have trouble walking around the block or have long-term memory issues then who the fuck is that helping? As much as I want to return to campus, continue my research, and get grad school over with, I can’t accept the risks associated with it, and neither should anyone be required to risk their lives in this way just so some undergrads can “have the college experience”. The world is fucked right now and we all need to accept that nothing is going the way we want. But if we’re patient and react as new data arrise, say for a vaccine to come out, or for cases to drop, like they did in Europe, then maybe we can start to claw our way back to some sort of normal life.\n\nI wrote way more than I intended but this has been a huge point of anxiety and stress for me.\n\nBest of luck with everything OP and most importantly, take care of your health, now more than ever.",
      "author": "nothing_to_be",
      "created": 1594578685,
      "upvotes": 113,
      "replies": {
        "fxutt4h": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxutt4h/",
          "text": "I'm scheduled for 2 labs in the upcoming semester at Georgia Tech (Atlanta). What do I do as an undergrad? Online labs aren't anything like actually doing lab work. But I don't want to compromise my health.",
          "author": "JustAGrump1",
          "created": 1594581325,
          "upvotes": 18,
          "replies": {
            "fxuzwhj": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxuzwhj/",
              "text": "Wear a mask, sanitize often, distance when you can, and expect things to go back online ~3 weeks in",
              "author": null,
              "created": 1594584587,
              "upvotes": 36,
              "replies": {
                "fxva9xg": {
                  "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxva9xg/",
                  "text": "Literally once we’re past the tuition refund deadline, they’ll slam the campus shut. They get their money, and they can say they’re “responding” to whatever form the crisis takes by going online and they’ll get praised. It’s win win for the admins.",
                  "author": null,
                  "created": 1594590244,
                  "upvotes": 47,
                  "replies": {}
                }
              }
            },
            "fxv25g9": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxv25g9/",
              "text": "For sure. I completely understand your frustration and feeling of hopelessness right now. I'd love for nothing more than to go back to campus and have my fucking life back. This has been so taxing on my mental health and my ability to do my research. My fund-raising has all been in vain, my travel plans all scrapped, I'm living in an out-building on my sister's property rent free right now as a 33 year old FFS. It sucks. However my situation is probably a lot better than others, it's just hard to see past everything that was in vain. I have spent two years writing grants and getting my drone pilot's license and receiving funding and presenting at national and international conferences for what feels like nothing. My whole project is now GIS-based.\n\n\nHowever this is temporary vs. the opposite of this, (living my life care-free, with the consequences of long-term impairment or death, or my actions causing the death of others) which is permanent.\n\nI actually did my entire undergrad online while living overseas and I found I had as good as or better of an educational experience than most people. I spent my free time volunteering at labs, or state and federal agencies while working full time at a job I hated. \n\nIf you're in a state where you mental health is compromised I completely get it and am sorry you're dealing with all this at such a young age (I'm assuming you're younger cause you're an undergrad. Sorry if I'm mistaken). But if your campus is online this might not be a bad time to consider doing something like volunteering or getting some hours in your desired field. A lot of organizations are really hurting for volunteers right now and I bet there's something you can do in your area.\n\nIf you're in the wildlife field I know of a lot of resources I would be happy to share with you. \n\nBest of luck to you and stay safe. There is an end-date to this and life will resume to some extent of what it used to be. The knowing when part is really hard.",
              "author": "nothing_to_be",
              "created": 1594585810,
              "upvotes": 12,
              "replies": {
                "fxv2icn": {
                  "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxv2icn/",
                  "text": "I'm studying biochemistry to become a pharmacist and do research. What organizations would take me as a volunteer with that in mind, and where could I actually get hours in my field? The closest job hub is a military base with no interest in chemists.",
                  "author": "JustAGrump1",
                  "created": 1594586003,
                  "upvotes": 4,
                  "replies": {
                    "fxv3fzd": {
                      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxv3fzd/",
                      "text": "I feel you. When I was an undergrad the amount of local opportunities were limited, so I left.\n\nI traveled across the country and worked for multiple state and federal agencies as well as a number of universities and nonprofits in Texas, Barbados, South Carolina, Georgia, Maine, Oregon, Washington, and Japan over three years. \n\nGiven the current state of things a lot of that is off the table. One thing all these jobs and internships have in common is I found 90% of them from a collective job board directly related to my field. I'm not sure where to start but there probably a number of chemistry-related job boards hosted by different universities and organizations. USAJobs has a pathways program for undergrads and recent graduates that might have something. I'm not sure. You could start by getting in touch with your undergraduate advisor or other people in your department and asking them about this.\n\nBut also I could see how you wouldn't want to or be able to do that. Which all I can say is I'm sorry you're frustrated about all this; I am too.\n\nThe good news is that this won't be forever and I imagine when a vaccine becomes widespread we'll be able to resume some form of normalcy. Hang in there and best of luck to you.",
                      "author": "nothing_to_be",
                      "created": 1594586508,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fxupbef": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxupbef/",
          "text": "I feel the anxiety and stress. All my University has done I show us a bare bones plan with the word \"dedensifying\" used every other bullet point. They won't give us specific numbers at all for how many kids are allowed in a room, hall, dorm, etc. I'm trying to grind out as much data as possible before the inevitable second shut down so I can continue to write. I got to go back at the beginning of July, but I don't know how much I'll get done in 2 months at half time.",
          "author": "Its_Just_Jen",
          "created": 1594578939,
          "upvotes": 8,
          "replies": {
            "fxv2cxe": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxv2cxe/",
              "text": "This. My university may have well thrown in a bunch of words like synergy and their plan would sound more cohesive than it does right now.",
              "author": "nothing_to_be",
              "created": 1594585922,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "fxuscgx": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxuscgx/",
          "text": "Couldn't agree more with everything you said.",
          "author": "PumpkinCrumpet",
          "created": 1594580542,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fxuiw00": {
      "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxuiw00/",
      "text": "On the contrary, I am more worried about undergrads not being able to come back at my university since they announced only seniors will be coming back. This means international undergrads will be deported, based on the recent update in visa rules by ICE and DHS. Just pointing out that many of us are facing even bigger problems on top of COVID. The uncertainty of the current visa situation has created a lot of worry and chaos among international grad and undergrad students.",
      "author": "Captain_Of_All",
      "created": 1594575579,
      "upvotes": 38,
      "replies": {
        "fxujc1g": {
          "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxujc1g/",
          "text": "That is a major worry too. I know 2 of the neighboring universities by me are trying to fight it, but I don't know how successful that will be. I honestly don't understand why we would deport any of the students. It will create a massive disruption in their education and potentially derail the research they've been doing that could benefit us all. I didn't mean to downplay/ignore the visa situation. We don't have a lot of international students in my department any more so it isn't a huge factor in our bubble, but down the road from us a ton of really bright and great people are facing some scarier times.\n\nEdit: Also, we could be sending those students back to a COVID hotspot which would be terrible. Or on the flip side, since the US has handled this in the worst way possible, possibly cause a surge back home.",
          "author": "Its_Just_Jen",
          "created": 1594575807,
          "upvotes": 6,
          "replies": {
            "fxukymg": {
              "link": "/r/GradSchool/comments/hpxy2v/is_anyone_else_worried_about_the_return_of/fxukymg/",
              "text": "Yeah, there don't seem to be any good options. Hopefully the courts can put a stay on the new order.\n\nAlthough I would point that some universities (Cornell I think?) have argued that it is safer to bring back undergrads on campus since they can be regularly tested, have contact tracing available and live under strict social distancing. MIT argued the same while deciding to bring back seniors. Not sure if every university has such testing and tracing capabilities or the ability to implement strict guidelines.",
              "author": "Captain_Of_All",
              "created": 1594576655,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634065033
}