{"sid": "gty5kr", "link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/", "title:": "If you’re looking to get into academia, PhD thesis is just a school project that you should not obsess over, but focus on publishing", "text": "It’s been an eye-opening advice for me. Anyone agrees or disagrees, based on your experiences?\n\n(Might be true only for social sciences and humanities)", "author": "cilbirwithostrichegg", "created": 1590927762, "retrieved": 1632953753, "over_18": false, "upvotes": 463, "upvote_ratio": 0.98, "comments": {"fsjh30m": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsjh30m/", "text": "This advice was also given to me regarding my undergraduate thesis, and really took a load off of my shoulders. I understood logically that an undergraduate thesis is far more inconsequential than a graduate level thesis but the compulsive perfectionist in me needed to hear it explicitly from my advisor for it to really sink in. I’m glad to know the same advice can be applied to graduates theses, too.", "author": "toasty_bean", "created": 1591029677, "upvotes": 1}, "fsi8pae": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsi8pae/", "text": "Country and field dependent. Anyone who considers following this advice should first be sure to check if it is true for their specific situation. In my case the PhD is really scrutinised and only two articles are required (a bad thesis will lock you out of anything beyond being part-time / contractualised)", "author": "throwrugcity", "created": 1590997527, "upvotes": 1}, "fshofip": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fshofip/", "text": "I needed this. Currently writing.", "author": "jo_mom", "created": 1590982038, "upvotes": 2}, "fshe2gn": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fshe2gn/", "text": "Agreed. The dissertation is a training exercise. I wish I had spent less effort on it and pushed some of my other papers forward.", "author": "kevintaylor", "created": 1590975865, "upvotes": 2}, "fsh7hgx": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsh7hgx/", "text": "After I defended my master thesis, my supervisor asked me \"What do you think that your thesis will end up?\" I was so excited until he showed me the trash bin. He added that it will be same for PhD theses as well. What matters is publications, otherwise you, your supervisors and examiners(if they read properly) will be the only people aware of your research.", "author": "Existenceisfutile1", "created": 1590972080, "upvotes": 3}, "fsh74sd": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsh74sd/", "text": "Yes in STEM the mantra is \"Publish or Perish\". \n\nIf you want a future in academia you are only as good as your # of papers and their impact factor. It's also important that you are first author on a number of them.\n\nThere's also tons of other silent rules like over 5 years of post doc-ing is considered too much and becomes much harder to get a job. Having years where you didn't publish looks bad unless you have a good reason (but your clock only starts when you start your PhD, not before that). You usually need a first-author high impact paper in your late PhD or during your post doc to be invited for an interview.\n\nNetworking is your best friend. Publishing is your life-long partner. And all the stress and anxiety it causes to get 1 spot in the whole country out of thousands of applicants after 10+ years of work is hard, so mental health issues are your annoying neighbor that's always home...", "author": "neuromission", "created": 1590971880, "upvotes": 7}, "fsgqeaw": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsgqeaw/", "text": "PhD in Medical Science here. The thesis format in my university is the traditional one. Apart from writing the traditional style thesis, we are required to publish 2 papers in Q2 or Q1 publisher.", "author": "Corpus_calosum", "created": 1590962707, "upvotes": 1}, "fsg0u8j": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsg0u8j/", "text": "That sounds like sound advice.", "author": "MrUnknown1996", "created": 1590949398, "upvotes": 2}, "fsfqvo7": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsfqvo7/", "text": "If anything, the humanities seem to be the last holdout for the monolithic thesis, perhaps because they tend to be book fields. Instead, it is extremely common for theses in STEM to be structured as individual publishable papers, tied together by an introduction and a conclusion/future directions chapter.", "author": "mleok", "created": 1590944315, "upvotes": 7}, "fsfqbu3": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsfqbu3/", "text": "PhD in electrical engineering here. I couldn't agree more. A fatal mistake is to get emotionally attached to your project. The purpose should always be to try and graduate ASAP.", "author": "fixed-point-learning", "created": 1590944029, "upvotes": 20}, "fsfj23l": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsfj23l/", "text": "Sandwich dissertation, yes. But often when you focus on publishing you end up with a better (science-wise) thesis anyways. I spent some time on formatting, etc for vanity reasons and because I wanted to have something nice at the end for myself (academic souvenir?) but I am not expecting any return in terms of career.\n\nIt’s okay because not everything in life has to do with your academic career. You can have some fun while being a grad student. Since nobody is going to read my dissertation, I can basically do whatever I want with it. Journal articles tend to reflect reviewer opinions often too strongly. For example, I had to create an entire appendix out of a section for one paper because of one reviewer’s (reviewer 2) strong opinion but I think it actually just flows nicer to keep that section in the body, so I did spend some time to move that section back into the body of my dissertation. But it was probably a waste of time and effort.", "author": "geometer2015", "created": 1590940161, "upvotes": 3}, "fsfhyhd": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsfhyhd/", "text": "If you are doing a sandwich thesis, which is what most grad schools require you to submit these days, you don't have to worry about writing an entire \"PhD thesis\". The format is usually: introduction, 3 papers, conclusion. Each department differs but usually only the first paper has to be accepted, and the other two have to be submitted.", "author": "darrenmk", "created": 1590939561, "upvotes": 11}, "fsfgsm0": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsfgsm0/", "text": "My thesis is composed is mostly composed of my publications. Not everyone I know had enough publishable materials to put in their thesis though.", "author": "Unturned1", "created": 1590938919, "upvotes": 1}, "fsfgfby": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsfgfby/", "text": "Also true for STEM.  Time and energy should be spent in writing papers, then you reprint those papers in your dissertation.  With this approach you only have to write the introduction and conclusion chapters to tie those papers together as a coherent story.", "author": "maxchem6", "created": 1590938714, "upvotes": 3}, "fsffwqc": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsffwqc/", "text": "My advisors advice for my thesis is to take published papers and staple them together, then write an intro and conclusion.", "author": "identicalgamer", "created": 1590938421, "upvotes": 16}, "fsf8ift": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsf8ift/", "text": "This is good to know. I'm starting a PhD program in the fall after a few years in industry, so this is good advice. Any other tips on hitting the ground running with research/publishing?", "author": "guitard00d123", "created": 1590933973, "upvotes": 9}, "fsf82j8": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsf82j8/", "text": "This was helpful for me when I was in the job market. It turns out, the hiring committee narrowed it down to me who recently graduated and a professor who was already teaching for 3-4 years. We had about the same amount of publications and both were hired. It's a teaching university,  but they are starting to emphasize research so I think this helped.  I did the optional journal format for my thesis.", "author": "itry12", "created": 1590933675, "upvotes": 20}, "fsf71x8": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsf71x8/", "text": "This is not true for all of the humanities. The vast majority of people come out with 0-1 publications and that is expected. Lots of publications can actually be a bad sign that you are publishing when you haven’t had time to put in the work required on these projects (explained further below. Basically it is a waste of time to publish in anything but the top tier journals which you won’t have time to prepare something that will actually be accepted).\n\nEdited to add: this may be more specific to my admittedly very small field.", "author": "lionofyhwh", "created": 1590932977, "upvotes": 20}, "fsf6fap": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsf6fap/", "text": "This is also standard advice for STEM PhD students.  The best thesis is a finished thesis, no more.  Every PhD graduate has a thesis on their CV; it's your papers, skills, and ideas that set you apart.", "author": "polyphonal", "created": 1590932512, "upvotes": 194}, "fsf5uhj": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsf5uhj/", "text": "In my field, in most of the 'good' schools the PhD thesis is combination of three published/submitted journal papers. It is like:  \n\\-Intro  \n\\-Paper 1  \n\\-Paper 2  \n\\-Paper 3  \n\\-Conclusion\n\nSo it is seen as a formality and is already just a combination of few papers.", "author": "spacekittenzzz", "created": 1590932114, "upvotes": 133}, "fsf48ma": {"link": "/r/GradSchool/comments/gty5kr/if_youre_looking_to_get_into_academia_phd_thesis/fsf48ma/", "text": "Coming from life/medical sciences, this is also true. If anything, focus more on your paper output if possible, then your thesis essentially writes itself by the end. Energy spent fretting about every little detail in your thesis document is wasted, considering very few people outside your committee will actually read it", "author": null, "created": 1590930963, "upvotes": 139}}}