{
  "sid": "qk3lq7",
  "link": "/r/GradSchool/comments/qk3lq7/not_sure_if_i_picked_the_right_path/",
  "title:": "Not sure if I picked the right path",
  "text": "I'm a first-year MA student who's currently on a foreign language fellowship. The stipulations of the fellowship are that it covers all of my tuition, but I must maintain at least an 85% in the foreign language class, otherwise I lose the fellowship and potentially have to repay what it covered.\n\nI'm in a third-year foreign language course, which is mostly undergrads (several people in my program are in it too, so I'm not alone as far as that goes). I've technically already taken this course in undergrad, but I barely learned anything and honestly have no clue how I even passed it. \n\nCurrently, I have a 91%, which isn't *terrible* per se, but I'm really beginning to freak out. I recently submitted a rough draft for a big project, and I was fairly confident in how well I did—sure, I expected to make a few errors, but considering I had three years worth of textbooks to reference I thought I would do okay.  My professor messaged me letting me know she's very concerned about how many errors I made, and she wants to talk to me during her office hours about it.\n\nI already bombed the first test. I did well in the multiple choice section, but I did really bad on the free response sections (part of it was probably because I did not manage my time well during the test, and was running out of time and had to half-ass some answers, but still).  If I do poorly on this project or our next test, that will most likely tank my grade below the threshold, and if I don't manage to get it up by the end of the semester I'm gone. The only reason why I'm able to attend this program is because of the fellowship.\n\nI'm beginning to wonder if I'm really in the right program. If foreign language isn't coming as quickly to me as it is to my peers, is this really something I want to do for the rest of my life? I really enjoy the *other* parts of the program, and I do genuinely want to learn this language, but it seems like no matter how hard I try it just doesn't seem to stick.\n\nI'm not really sure if I'm looking for advice (though it's welcome!), I just wanted to vent.",
  "author": "MiyaDoesThings",
  "created": 1635730798,
  "updated": 1635780430,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hiu535u": {
      "link": "/r/GradSchool/comments/qk3lq7/not_sure_if_i_picked_the_right_path/hiu535u/",
      "text": "Just because it’s challenging, doesn’t mean it isn’t right for you!  If you enjoy it that’s really what matters! I’d say share all of these reservations with your professor! She may have some good feedback/advice for succeeding in the class!",
      "author": "DrBatman23",
      "created": 1635731718,
      "upvotes": 1,
      "replies": {}
    }
  }
}