{
  "sid": "q0gqh2",
  "link": "/r/GradSchool/comments/q0gqh2/where_should_i_study_in_europe_please_read_for/",
  "title:": "Where should I study in Europe? (Please read for all necessary context!)",
  "text": "Essentially, I am a 25 year old American who started a Master's program in the Netherlands this fall. I have absolutely fallen in love with the program, with living abroad, and with the lifestyle of being a student in Europe. The program I am currently enrolled in is only for one year and I received scholarships sufficient to cover my tuition and living expenses while here, so I have found myself with more disposable savings and the desire to extend my stay abroad for a few years. \n\nSince my program is specialized and multidisciplinary, I can also see an advantage in undertaking another master's program related to Global Health. I have a shortlist of programs that are attractive to me, but since I am casting a much wider net in my search this time around, I am a little overwhelmed at the variations in both price and geographic regions. Here is my shortlist of universities:\n\nTrinity College Dublin\n\nLondon School of Economics\n\nUniversity of Glasgow\n\nUniversity of Copenhagen\n\nUppsala University\n\nUniversity of Oslo\n\nGhent University (combination program)\n\nOther considerations are that I 1) have to study in English and 2) am looking for an internationally-orientated program. Another program in the Netherlands is unfortunately not an option, as I received a national scholarship that can only be awarded one time in NL. My experience abroad has been incredibly positive so far and I definitely like the feel of a metropolitan, diverse, vibrant student city. If anyone has any experience living in these cities or studying at these universities, I would love to hear your experience and accept any advice. Thank you!",
  "author": "lostmypaige",
  "created": 1633263932,
  "updated": 1634099965,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.56,
  "comments": {
    "hf90z56": {
      "link": "/r/GradSchool/comments/q0gqh2/where_should_i_study_in_europe_please_read_for/hf90z56/",
      "text": "I’d suggest avoiding the UK - they’re still dealing with the aftermath of Brexit, and there’s also a lot more alcohol-related problems than some of the other countries you’re considering (normalization of excessive drinking and of bad/obnoxious behavior from drunk people). Also less of a cultural emphasis on work/life balance and quality of life, and more income inequality, poverty, and homelessness. You could still go to the UK and have a good time, but expect the cities there to feel rougher and more depressing, not as pleasant and safe as what you got used to in The Netherlands.\n\nIf you had a good time in The Netherlands, you’ll probably also enjoy Copenhagen - good bicycle infrastructure and public transport, pretty cosmopolitan, and possible to get by mostly in English.",
      "author": "tentkeys",
      "created": 1633283301,
      "upvotes": 3,
      "replies": {
        "hfgxwi4": {
          "link": "/r/GradSchool/comments/q0gqh2/where_should_i_study_in_europe_please_read_for/hfgxwi4/",
          "text": "I think London is alright. Unis tend to be in nice areas. Brexit has fucked a lot of things though",
          "author": "avocado_vine",
          "created": 1633436154,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hf7xx9j": {
      "link": "/r/GradSchool/comments/q0gqh2/where_should_i_study_in_europe_please_read_for/hf7xx9j/",
      "text": "I have studied at one of the above, and taught at two of the above. I'd love to help but I don't know what to tell you, really. \n\nTrinity will not fund you, if that's a concern. There's barely funding for PhD candidates, much less master's candidates. There's also a serious housing crisis in Dublin which can make living there very expensive. As an American you might be able to get a Fulbright? I genuinely don't know. But Trinity (and Ireland as a whole) will have limited to no funding options for you.",
      "author": "PurrPrinThom",
      "created": 1633265494,
      "upvotes": 2,
      "replies": {}
    },
    "hfa7oc0": {
      "link": "/r/GradSchool/comments/q0gqh2/where_should_i_study_in_europe_please_read_for/hfa7oc0/",
      "text": "Glasgow is extremely cold and rainy.",
      "author": "JamesfEngland",
      "created": 1633300851,
      "upvotes": 1,
      "replies": {}
    }
  }
}