{
  "sid": "qd4nrc",
  "link": "/r/GradSchool/comments/qd4nrc/is_this_normal_for_a_grad_level_course_that/",
  "title:": "Is this normal for a grad level course that doubles as an undergrad level course?",
  "text": "Hi there, first year grad student working towards a masters degree in history. I’m taking two courses that double as undergraduate level courses, meaning there’s an extra component for graduate students to take. One class, taught by the head of the department, was quite straight forward and manageable. However, the other class has a component that makes no sense. \n\nIt’s a field paper, but he’s given no advice on where to begin or anything. For example, when the class began he said (in a short meeting held with just the grad students after the first class) that we would only need to find 15-20 sources. However, now he is saying 30-45+. Is it normal for this to change so drastically in a graduate level course? He doesn’t respond to emails so I’m quite lost at the moment of where to approach next.",
  "author": "Eeeeeeeeeeeeeek12",
  "created": 1634860545,
  "updated": 1635185462,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hhk7us0": {
      "link": "/r/GradSchool/comments/qd4nrc/is_this_normal_for_a_grad_level_course_that/hhk7us0/",
      "text": "It is normal for there to be additional work for graduate students in a co-listed course like the ones you described. It is not normal, however, for requirements of that sort to change so drastically over time. I would assume the requirements are listed in the syllabus or some kind of project document. If I were in your situation, after class one day I would approach the Professor and say something like “I noticed the syllabus says the field paper requires X number of sources, is this accurate?” and go from there. If they are reasonable you should be able to get to the bottom of the confusion.",
      "author": "SnoopDoggnYay",
      "created": 1634863222,
      "upvotes": 7,
      "replies": {}
    },
    "hhkk07p": {
      "link": "/r/GradSchool/comments/qd4nrc/is_this_normal_for_a_grad_level_course_that/hhkk07p/",
      "text": "Does the syllabus specify the page length of the paper? From my own experience in my grad program and looking at syllabi from North Texas' history department (one of the institutions I'm applying to for doctoral study), grad papers range from 15-25 pages. 30-45+ sources is definitely overkill for a paper of such length. Also, I have never heard of historians writing a \"field paper.\" That sounds like a term for a paper written by anthropologists or sociologists. \n\nI recommend talking with your fellow grad students and working out a common position with which to confront your instructor.",
      "author": "qwertyrdw",
      "created": 1634868920,
      "upvotes": 4,
      "replies": {
        "hhkkfza": {
          "link": "/r/GradSchool/comments/qd4nrc/is_this_normal_for_a_grad_level_course_that/hhkkfza/",
          "text": "See, that’s what I thought too with the field paper. I had never heard of such a thing in my undergraduate studies and when googling the term I mostly got anthropology and sociology examples. There isn’t a page minimum or maximum listed at all in the syllabus, in fact the paper he handed out is very outdated (last updated in 2014) and has incorrect due dates as he never changed them from the first printing. Honestly, this professor is rather horrendous and has horrid reviews from other students. I’ll definitely reach out to the other grad students, but the two others in my class are also grad assistants and seem to worship the ground he walks on so we’ll see if it does anything.",
          "author": "Eeeeeeeeeeeeeek12",
          "created": 1634869126,
          "upvotes": 1,
          "replies": {
            "hhkljao": {
              "link": "/r/GradSchool/comments/qd4nrc/is_this_normal_for_a_grad_level_course_that/hhkljao/",
              "text": "Nice to know I was write re: anthropology and sociology. lol So how do historians write a \"field paper\"? I know how we do reaction papers, book reviews, historiographical essays and research papers, but not \"field papers\". \n\nThis sounds like a nightmare of a guy who is too lazy to go in and update his syllabus templates with proper dates each semester. No mix/max page counts, and this lends the notion that his mind is a very haphazard, slipshod zone. \n\nThe two GA's are probably his advisees on they're both eyeing him as a likely member of their dissertation committees. You may not get far with forming a united front, OR they might be able to tell you what a \"field paper\" is and help you survive. Proceed with care when talking with them.",
              "author": "qwertyrdw",
              "created": 1634869654,
              "upvotes": 1,
              "replies": {
                "hhkrix3": {
                  "link": "/r/GradSchool/comments/qd4nrc/is_this_normal_for_a_grad_level_course_that/hhkrix3/",
                  "text": "I honestly have no idea how historians would write a field paper lmfao. I’m at the point with this professor where I’m ready to throw in the towel and talk to my advisor about withdrawing from the class. There’s other things this professor has done over the semester that has aggravated me and this assignment has basically crossed the line for me. 30-45+ sources is ridiculous, I think I used 35 sources in my entire undergrad thesis — and that was 42 pages!",
                  "author": "Eeeeeeeeeeeeeek12",
                  "created": 1634872621,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}