{"sid": "asibpy", "link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/", "title:": "PSA: You have until April 15th to make a decision! Don't let programs strong arm you into a decision you don't want to make!", "text": "Congratulations on your admission into graduate school! Now that you have an offer in hand, please be aware of your rights! \n\nMost major graduate programs are subject to the April 15 Resolution (https://cgsnet.org/april-15-resolution)! If you have been offered funding of any kind, they cannot rescind the offer before April 15th. Many professors and program directors will either be unaware of (or willingly ignoring) this rule. In doing so, they undermine other programs and put you in a bad situation.\n\nAs a graduate student, you will be in a position very low on the totem pole for quite a while. It is important that we, together as grad students, do not let those above us beat us around anymore than they already do. If a program refuses to stand by the April 15 Resolution, please contact the departments relevant deans so that others will not be taken advantage of in the future. And you probably don't want to be involved with such a program anyway.\n\nP. S. Feel free to reach out if you need any additional advice regarding pressure to make a decision from a program. I'd be happy to help where I can.\n\nEdit: Clarified that this applies to funding offers. A list of universities this applies to can be found on the linked site. ", "author": "bvdzag", "created": 1550627195, "retrieved": 1632846396, "over_18": false, "upvotes": 290, "upvote_ratio": 0.96, "comments": {"egx9vpe": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egx9vpe/", "text": "I am amazed how many people think that this is a \"rule\" and it amounts to a \"right\". From my reading of this, and from my own interactions on campus, it seems like nothing more than a gentleman's agreement between schools who are members of the CGC. While it would be nice for everyone to follow suit, there might be local (school/college/department) realities and deadlines that necessitate earlier deadlines. ", "author": "AdmiralAK", "created": 1550714204, "upvotes": 2}, "egvz8rg": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egvz8rg/", "text": "LOL. Respond by the dates they tell you to if you actually want to keep your offer. It is common and possible to get reasonable extensions from the program directors. Also don't drag on an offer you are not seriously considering, you keep people who may really want that offer on the wait list. ", "author": "nbx909", "created": 1550681843, "upvotes": 4}, "egvqi8b": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egvqi8b/", "text": "My top choice program (aka, the one I'm committing to) sent a whole PDF outlining the April 15th Resolution and what it means for me. I'm so thankful that they're explicitly reminding me of my rights so that I don't feel any pressure, I think it bodes well for how they'll treat me as a grad student. I'm still accepting before April 15th though, just because I 100% know where I'm going and I want to free up my other offers for waitlist people. ", "author": "Psychological_Divide", "created": 1550675693, "upvotes": 8}, "egv3bmi": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egv3bmi/", "text": "Wish I had known that. I got pressured into accepting an offer March 1 (at one of those schools on the list). I’ve made it out but the strong arming was definitely a red flag. ", "author": "fog_in_eucalyptus", "created": 1550646328, "upvotes": 3}, "egv1r14": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egv1r14/", "text": "This is super dependent on the country.", "author": "doornroosje", "created": 1550644277, "upvotes": 9}, "egus5kn": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egus5kn/", "text": "Devil's advocate, if you know you have multiple offers and you know you don't want to go with one, please tell them as soon as you make that decision. Waiting until the deadline prevents them from getting to extend the offer to another student for whom the school might have been their 1st choice but they ended up having to go somewhere else. ", "author": "purdueGRADlife", "created": 1550634621, "upvotes": 124}, "eguqudh": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/eguqudh/", "text": "After being in my program for the past 7 months and now witnessing the admission process from \"the other side\" I feel like it's such a load of BS.", "author": "butdontcallmebae", "created": 1550633559, "upvotes": 11}, "eguppat": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/eguppat/", "text": "Does this include if you're in an MA program?", "author": "alan2542", "created": 1550632642, "upvotes": 2}, "egun614": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egun614/", "text": "I believe that this only applies to school that are members of the cgs. Not all programs have agreed to these rules. I know of quite a few in my field that are not cgs members. ", "author": "Hereformyhobbies", "created": 1550630645, "upvotes": 53}, "egumt1o": {"link": "/r/GradSchool/comments/asibpy/psa_you_have_until_april_15th_to_make_a_decision/egumt1o/", "text": "Has this been crossposted in r/gradadmissions?", "author": "lea949", "created": 1550630366, "upvotes": 16}}}