{
  "sid": "qmabqt",
  "link": "/r/GradSchool/comments/qmabqt/really_needing_some_opinions_folks/",
  "title:": "Really Needing Some Opinions Folks",
  "text": "Hey all,\n\nI'm a STEM master's student looking to get a PhD in the future and in a weird spot, bear with me. Ok, so to make a long story a tad bit shorter, the pandemic really screwed my academic and professional plans as well as my finances. I had to apply pretty late in the cycle being that I was still paying tuition off and couldn't get transcripts, which meant there were very few options left in my discipline to even put in for by the time I was completing apps.\n\nI got into an in-state program that doesn't fund students (and was pretty much the only school in my field with an open application, I was never keen on it). A transcript mailing error kept my application from being processed by the program I actually wanted to go to. I chose the in-state program bc of cost, a non-thesis science master's that promised hands-on bench work, heavy exposure to research, and an internship with a report in place of a thesis.\n\nFast forward to zoom orientation and we're told that the program is no longer focused on providing research experience and that there won't be any in the program, nor would there be any bench work or time in the lab anymore. It is essentially a course-based MS/MA now. My head went spinning, of course, and at the start of my first semester of grad school, I found myself scrambling to apply to whatever suitable program I could find at the same school. Got accepted to a thesis MS (that I also am not that crazy about) that kind of-ish matches my interests in a department that's a mess, and I'm somewhat miserable.\n\n**THEN**, last week I got an email from the program I really wanted to be a part of, and I was offered a fully funded RA position with a tuition waiver starting Spring '22 and a spot in the program. (They roll over applications to future semesters, apparently). Thing is, I would be expected to complete my thesis in the PI's lab that I'd be an RA for. Though I am interested in their research, I don't necessarily want to use it for my thesis. On the other hand, the one saving grace of the program I'm currently in is that I've been allowed to do the research I want outside of the department, and the opportunities \"to science\" here are pretty damn good (it's an R1 with a huge rep in the research world), and I've found some pretty kick-ass mentors. What would you all do in my situation? Would you pick up and move to the other program? I'm always thinking of the finances and the thought of attending school for free seems alluring as all get-out. It is also the exact discipline I wanted, while the other one is a related discipline but not what I really want to do. ",
  "author": "BritO26",
  "created": 1635991643,
  "updated": 1636138134,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hj8r262": {
      "link": "/r/GradSchool/comments/qmabqt/really_needing_some_opinions_folks/hj8r262/",
      "text": "I’m not sure exactly what field you’re in, but in many bench science disciplines, it’s the norm that your thesis research is the same as your RA research. \n\nYou work in a PIs lab, they have grants that fund you, and that work make up your thesis. \n\nOn a more general note, I think you’d benefit from not rushing into a second graduate program: take the time it takes to get a funded position in the program you want.",
      "author": "Eigengrad",
      "created": 1635998496,
      "upvotes": 3,
      "replies": {
        "hj8rtm5": {
          "link": "/r/GradSchool/comments/qmabqt/really_needing_some_opinions_folks/hj8rtm5/",
          "text": "Yeah I learned that after enrolling where I’m at now. \nBut I’m currently in the biomedical sciences in an unfunded masters that doesn’t offer assistantships unfortunately.",
          "author": "BritO26",
          "created": 1635998939,
          "upvotes": 1,
          "replies": {
            "hj8shrb": {
              "link": "/r/GradSchool/comments/qmabqt/really_needing_some_opinions_folks/hj8shrb/",
              "text": "Why not leave the current unfounded school?\n\nIf you know you want to be there and it’s costing you money, I’m not sure why you’re staying?\n\nAt least in the US, I’d say the norm for lab based biomedical sciences to be that your thesis work is the same as your RA position.",
              "author": "Eigengrad",
              "created": 1635999339,
              "upvotes": 1,
              "replies": {
                "hjf4jg5": {
                  "link": "/r/GradSchool/comments/qmabqt/really_needing_some_opinions_folks/hjf4jg5/",
                  "text": "Essentially my parents (only been to undergrad so they're not familiar with the grad world) think moving again wouldn't make sense, but I think they're missing the bigger picture.",
                  "author": "BritO26",
                  "created": 1636123089,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hj8q5da": {
      "link": "/r/GradSchool/comments/qmabqt/really_needing_some_opinions_folks/hj8q5da/",
      "text": "> Thing is, I would be expected to complete my thesis in the PI's lab that I'd be an RA for.\n\nI can't comment on general advice, but it might be worth checking how exactly aligned your thesis has to be.  My school requires the thesis to align with the RAship as well, but I've gotten away with having a thesis that (at least for now) is very peripherally connected to my RA research.",
      "author": "djp_hydro",
      "created": 1635997973,
      "upvotes": 2,
      "replies": {
        "hj8qptb": {
          "link": "/r/GradSchool/comments/qmabqt/really_needing_some_opinions_folks/hj8qptb/",
          "text": "I will definitely look in to this !",
          "author": "BritO26",
          "created": 1635998299,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}