{
  "sid": "pvxq6k",
  "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/",
  "title:": "Went back to my lab after graduation",
  "text": "And it was eye-opening experience.\n\nTo preface I had an ok relationship w my advisor.  I was in a stem PhD program at a big university. He was great about responding to my messages, put a lot of effort into papers, and was generally “there.” However, I rarely felt like he really valued me or my contributions or my ideas. He was habitually combative in conversations about my STEM subject. Sometimes my ideas were met with curiosity and interest, and sometimes they were met with scoffing. \n\nI graduated, got a job not in academia that pays well and has good work-life balance. My co-workers have nearly always been kind in interactions, especially when it comes to working through ideas. It’s very possible to disagree with a person’s idea without aiming to shame them for having it.\n\nI had lunch with my old labmates and advisor recently and ended up experiencing the same kind of combative interaction w my advisor! Except I wasn’t used to it anymore. I brought up a pretty reasonable idea- not to actually implement, but to casually explore in conversation what’s possible. He quickly dismissed everything I was saying.\n\nI continued to defend my idea and he continued to dismiss it- making almost absurd claims. For example I mentioned I was interviewing for a new job where the main responsibility was simulating particular physical behavior. My old advisor said the relevant physics problem was “solved.” Like it is? So this company is throwing 6 figures a year at an already solved problem?\n\nI checked in with another former person in the lab who witnessed the interaction and she said she felt it was a really uncomfortable situation as well, and she thought my (very general) idea made sense.\n\nIt made me wonder how many other times I let him make me feel stupid unnecessarily because I had some degree of trust in him. It makes me never want to come back to academia.\n\nEdited wording for clarity",
  "author": "ktittythc",
  "created": 1632675542,
  "over_18": false,
  "upvotes": 262,
  "upvote_ratio": 0.98,
  "comments": {
    "heh8bbg": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heh8bbg/",
      "text": "This is not a good advisor in general. They likely do not have the full picture. Out of curiosity, I'm not sure if you're female, and your advisor is particularly combative with women in general (this sometimes happens in male dominated fields, and you mentioned that the other person you checked with was female). Without more context about the general idea or problem, its difficult to decide whether your advisor is right and knows an approach you might not have considered, or if he is relying on an outdated or incomplete picture of problem. \n\nIt is fine to be combative in academia or a research setting, as long as you know when to accept that you were wrong, otherwise you just look silly defending a position you dreamed up yourself. It may also be that your advisor may be insecure and felt the need to show off on his 'turf' in the lab, so even after you have left, he still sees you as his student, rather than a research professional in your own right. The problem your advisor is talking about may indeed be 'solved', but under some constraints, or may be impractical to implement in industry, the company is probably looking for a different perspective.",
      "author": "SquirrelOnTheDam",
      "created": 1632754685,
      "upvotes": 2,
      "replies": {
        "hezxlid": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hezxlid/",
          "text": "Thanks for your response!! Yes I am a woman and he’s a man :/. I know other women who have had negative interactions with him. Our lab used to be all men and I sometimes get the sense that my old advisor missed that. There was a student that actually mirrored his dismissive ness who he loved.\n\nI feel extremely confident that my advisor was speaking out of line. I was speaking from my knowledge of internal documents at my large company who is working with state of the art technology- tons of phds. My work now is only tangentially related to my PhD work. My postdoc also agreed my idea was reasonable. Even if my old advisor had actual insight to share, he certainly didn’t make a convincing argument by being dismissive.\n\nI wouldn’t have minded combativeness with more specific criticisms, but they were all basically judgment calls from a place of unearned authority. \n\nThanks for the opportunity to talk this out 😅",
          "author": "ktittythc",
          "created": 1633109136,
          "upvotes": 2,
          "replies": {
            "hf39y3c": {
              "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hf39y3c/",
              "text": "No worries, hope things work out with respect to the problem for you.",
              "author": "SquirrelOnTheDam",
              "created": 1633177844,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hegefwf": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hegefwf/",
      "text": "Well done OP, you must've made him jealous.\n\nOh just to add, if this employer pays you 6-figure salary, it's most likely spending 7-figure budgets or more in related technologies and (of course) employing talented people like yourself. So... I think odds are in your favor.",
      "author": "GoofyMaximus",
      "created": 1632737944,
      "upvotes": 2,
      "replies": {}
    },
    "hegb2ux": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hegb2ux/",
      "text": "And here I am thinking of going back to academia to get my doctorate.",
      "author": "jubjub7",
      "created": 1632734750,
      "upvotes": 3,
      "replies": {}
    },
    "hefpuyp": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hefpuyp/",
      "text": "My advisor was somewhat like yours. I talked with him about the work I was doing, and he basically poo pooed it saying it would never amount to anything more than an academic curiosity, as it was just buzzwords for proposals.\n\n\"Oh, that's an interesting opinion. We just landed some of my stuff on Mars the other month.\"\n\nGoddamn that felt so good.",
      "author": "racinreaver",
      "created": 1632716863,
      "upvotes": 12,
      "replies": {
        "heh20ki": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heh20ki/",
          "text": "Yes!! I bet that felt so good.",
          "author": "ktittythc",
          "created": 1632751933,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hefj2sq": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hefj2sq/",
      "text": "Ha. Hahaha. HAHAHAHA.\n\nCongratulations, OP. Your advisor is either jealous of you, threatened by you, or just didn't think you'd make it and is having a hard time stomaching the taste of all that crow.\n\nThe average CS prof makes about $90K a year. Do you think your advisor is making six figures? Probably not. Why do you think that is? Maybe he just prefers academia and the lower salary. Maybe he wanted the exact kind of job you have but never could get it. What do you think his work-life balance is like? It's probably pretty shit, except during the summer.\n\nI'd be willing to bet that this professor is not happy. Happy people celebrate the successes of others. Good teachers feel proud when their students are successful. He saw that you were happy, and he feels like you don't deserve it, like you're getting something he deserves and doesn't have. He made you feel stupid on purpose because your success makes him feel insecure.\n\nI don't normally jump to this conclusion, but in your situation, it feels like Occam's Razor to me.",
      "author": "titlit_vv",
      "created": 1632712856,
      "upvotes": 15,
      "replies": {
        "hefl0iv": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hefl0iv/",
          "text": "Wow thanks for this comment. I think you hit the nail on the head.",
          "author": "ktittythc",
          "created": 1632713853,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hefisln": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hefisln/",
      "text": "I left my PhD and got a job at a nonprofit. If my former PI behaved the way she does where I work now she would be fired.",
      "author": "lauriceman",
      "created": 1632712707,
      "upvotes": 6,
      "replies": {}
    },
    "hefgc7h": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hefgc7h/",
      "text": "This isn't to write over your experience, but if your advisor made you feel stupid—no matter how \"there\" he was—he was a bad advisor.",
      "author": "callednotqualified",
      "created": 1632711491,
      "upvotes": 11,
      "replies": {
        "hezy89s": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hezy89s/",
          "text": "This really made me think, thank you. I guess I could argue that the description of “OK” was relative to other profs I know. I felt like almost everyone I knew in grad school had a story to tell about their toxic advisor.. I just heard a story about a really passionate/hard-working grad student from my old program who lamented that she was her advisor’s first “average” student :/.\n\nBut I do think that verbiage does encourage me to minimize the harm done.",
          "author": "ktittythc",
          "created": 1633109412,
          "upvotes": 2,
          "replies": {
            "hf0hp5i": {
              "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hf0hp5i/",
              "text": "Exactly. Good is relative, but that shouldn't make average or toxic professorship permissible. It's possible to have understanding without giving compassion where it isn't due.",
              "author": "callednotqualified",
              "created": 1633117947,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "heerc04": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heerc04/",
      "text": "Dam I’m also in physics. Just curious what is your general area of research?",
      "author": "puddingpiler420",
      "created": 1632699277,
      "upvotes": 2,
      "replies": {
        "heerzxh": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heerzxh/",
          "text": "it was experimental and theoretical atomic/molecular/optical physics",
          "author": "ktittythc",
          "created": 1632699600,
          "upvotes": 2,
          "replies": {
            "heflyol": {
              "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heflyol/",
              "text": "It is my experience (albeit limited, given that I have two full semesters of major classes left) that approximately half of CS professors pretend to have more in-depth knowledge than they actually do. You know what they have in-depth knowledge about? The specific course material they're teaching and the specific subjects they're researching. This professor does not have the understanding of physics necessary to have this conversation/debate at your level, which is why he uses maneuvers like ludicrous statements, making you feel stupid, dismissing you, and shutting down the conversation: to avoid being exposed as, well, a bit of a fraud.\n\nI've taken a hiatus from my uni to knock out my next few maths at community college. They're offering some Java classes so I figured, why not take them for fun even though they're too low-level to transfer? I thought the prof was just a lazy asshole until I started noticing red flags in how she teaches / grades / etc. that signal she may just be less knowledgeable than she claims. For ex, she claims she gets paid a lot of money to correct errors in other people's code. Okay, so... why do you need to teach at a community college then? I got curious and did some research. The college is having a hard time filling vacant positions. She got some kind of IT management degree, and I looked at her school's course requirements. She was required to take maybe three Java classes, and the rest of her classes were about management of employees, communication, etc., which means I have had more coding classes than her and know (the basics of) more languages. I think she can tell, and she does not like it -- because she acts just like OP's prof.",
              "author": "titlit_vv",
              "created": 1632714435,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "heecv3s": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heecv3s/",
      "text": "Congratulations, you won at life. Don't go back if you're treated like that (especially if you're a minority and EVEN WORSE as a minority woman). \n\nYou might as well build a life for yourself that's worth living as you are doing now.  Congratulations.",
      "author": "GoneFishing4Chicks",
      "created": 1632692534,
      "upvotes": 17,
      "replies": {}
    },
    "heebjj4": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heebjj4/",
      "text": "> My old advisor said the relevant physics problem was “solved.”\n\nIt probably is if we assume the main component is a sphere and then ignore gravity and air resistance :D.",
      "author": "CheeseWheels38",
      "created": 1632691958,
      "upvotes": 52,
      "replies": {
        "heerw1r": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heerw1r/",
          "text": "Exactly!!",
          "author": "ktittythc",
          "created": 1632699548,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "hee5e0z": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hee5e0z/",
      "text": "Hey, congrats on the 6 figures though. That’s awesome.",
      "author": "Reverie_39",
      "created": 1632689315,
      "upvotes": 5,
      "replies": {}
    },
    "hee575d": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hee575d/",
      "text": "There is such a culture of shame and silence that eats away at academia, why do you think there are such high levels of mental illness and imposter syndrome? Sometimes I feel like academics don’t know that workplace relationships can be generally positive because most have never worked outside academia (especially the older generations). I think all the people I see on here that say to grin and bear it, to focus on what you can get out the situation might lack healthy relationships in other areas of their life. I’m really sick of the attitude that academia just sucks and that’s how it is and it’s still worth it. Who told you guys to have this attitude, and who benefits from it? It just blows my mind how willing academics are to let others exploit them. I’ve had so many coworkers tell me that the situation is that we are mutually exploiting each other, what the fuck? There is some seriously shitty libertarian ideas and sentiments that have propagated in biomedical sciences in academia, in my experience. I don’t think honest collaborative science occurs in the current paradigm. I think it’s mostly corrupt entrenched labs exploiting junior workers to publish rushed and improper science. It is seriously fucked up and I wish there was a way forward. It’s time that people start seriously talking about organization in academia.",
      "author": "otterpigeon",
      "created": 1632689236,
      "upvotes": 84,
      "replies": {
        "heertsx": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heertsx/",
          "text": ">Who told you guys to have this attitude, and who benefits from it?\n\nYes exactly! Certainly not grad students. \n\nIt seems like in industry, people are generally able to be more mobile- ie managers are more replaceable than PI's, and one can leave a toxic environment without essentially throwing years' worth of work away. \n\nThinking about my job, if my manager made nasty remarks to me, I could always bring it up to HIS manager or HR. I could also just leave and find a reasonably similar situation. The mechanism for a grad student is way less smooth.",
          "author": "ktittythc",
          "created": 1632699518,
          "upvotes": 30,
          "replies": {
            "heezfmr": {
              "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heezfmr/",
              "text": "Reference letters and the mentor/mentee relationship combined with a high level of ESL speakers and J1 scholars in the workforce is a situation ripe for isolation and abuse by an American gatekeeper.",
              "author": "otterpigeon",
              "created": 1632703225,
              "upvotes": 23,
              "replies": {
                "heezyhz": {
                  "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heezyhz/",
                  "text": "All good points!",
                  "author": "ktittythc",
                  "created": 1632703479,
                  "upvotes": 4,
                  "replies": {
                    "hef1vft": {
                      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hef1vft/",
                      "text": "Your point on horizontal mobility I think is important. If it was more normal for people to move between academia and industry, I firmly believe both sectors would be improved. What I think holds back science policy the most is a Stockholm syndrome like attitude in  academics where they think, “we have higher levels of depression and suicide just because we’re so quirky and neurotic lol!” Is some seriously saddening internalized abuse. Think of all the stereotypes of scientists in our media, with unkempt clothes and hair, obsessiveness towards their work and a blindness to themselves. None of these things are specific to scientists nor are they what make scientists competent. They are residues of the abusive systems we work in.",
                      "author": "otterpigeon",
                      "created": 1632704372,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hefxt44": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hefxt44/",
          "text": "That's why I'm super happy I did teaching. It know it isn't as prestigious, but the fact that my professors are trained in, well, teaching, means they actually know how to treat their students with respect, have realistic understandings, and understand positive reinforcement, and even that failure is an opportunity for learning. My professors are on way less of a power trip compared to a lot of stories I hear.",
          "author": "greatteachermichael",
          "created": 1632722435,
          "upvotes": 3,
          "replies": {
            "hegqty6": {
              "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hegqty6/",
              "text": "I agree, I have had the same experience with educator-professors being kind and mature people. Sadly because of the incentives and how abusive workplaces are encouraged, the nice guys get shouldered out of research institutions. That teaching has workers with a healthier mindset doesn’t mean that much to me as I want to do research.",
              "author": "otterpigeon",
              "created": 1632746363,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hee1wkx": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hee1wkx/",
      "text": ">It made me wonder how many other times I let him make me feel stupid unnecessarily because I had some degree of trust in him. It makes me never want to come back to academia.\n\nI mean, you run into people like that in industry, too. C'est la vie.",
      "author": "giziti",
      "created": 1632687861,
      "upvotes": 28,
      "replies": {
        "hee5e7s": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hee5e7s/",
          "text": "Definitely. I think a myriad of structures in academia can lend itself to this behavior though.",
          "author": "ktittythc",
          "created": 1632689317,
          "upvotes": 21,
          "replies": {
            "hefgjwn": {
              "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hefgjwn/",
              "text": "People who act like this in industry usually have this behavior catch up with them. Also being able to deal with such a person at work and still go home with $100K and not having your entire livelihood lean on a single project allows you to separate work from home easier and make it much more bearable.",
              "author": "JHDog93",
              "created": 1632711596,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "hedvsrm": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hedvsrm/",
      "text": "I'm not sure I follow, so you had advisor A during your PhD program. You graduated, went to industry and then you went back to you old lab to visit them and during that visit you spoke to advisor A again?",
      "author": "abstractgoomba",
      "created": 1632685421,
      "upvotes": 7,
      "replies": {
        "hedvw9i": {
          "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hedvw9i/",
          "text": "Exactly",
          "author": "ktittythc",
          "created": 1632685460,
          "upvotes": 14,
          "replies": {
            "heedi61": {
              "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heedi61/",
              "text": "Thanks for clarifying!\nI think it's a huge red flag when people simply dismiss ideas. Like it could be that maybe the physics is solved but then why not elaborate, why the attitude. I feel like there's something else going on.\nI have a colleague who I've always thought of as smart. He's pretty good with words and he seems to know a lot about my field even though his field is different from mine. Often I feel stupid when I hear him talking about \"smart\" sounding ideas. A lot of times I also had no way of verifying on the spot if what he's saying is actually true. But after a while I started questioning him and noticed that he either gets super defensive and that he dodges my questions. Which made me reevaluate my impression of him. Now whenever I talk to him I make an effort to keep in mind that he might just be trying to impress me or whoever is around and to take what he says with a grain of salt.",
              "author": "abstractgoomba",
              "created": 1632692822,
              "upvotes": 13,
              "replies": {
                "heesj34": {
                  "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/heesj34/",
                  "text": ">Like it could be that maybe the physics is solved but then why not elaborate, why the attitude. \n\nYes! I felt like during grad school I justified his attitude in maybe he doesn't want to encourage ideas that might be a waste of time. But here there was no such implication, I was half expecting the conversation to go in an imaginative, exploratory direction.. especially since it was a lunch get-together.\n\n> But after a while I started questioning him and noticed that he either gets super defensive and that he dodges my questions. \n\nYeah I think if he were truly interested in this ideas vs trying to flex, he'd be excited to get into the details. But sadly some people are attracted to these big ideas in large part for flexing.",
                  "author": "ktittythc",
                  "created": 1632699861,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hedp89u": {
      "link": "/r/GradSchool/comments/pvxq6k/went_back_to_my_lab_after_graduation/hedp89u/",
      "text": "Congrats for leaving the ivory tower :)",
      "author": "QxV",
      "created": 1632682776,
      "upvotes": 111,
      "replies": {}
    }
  },
  "updated": 1634064743
}