{
  "sid": "q46bk3",
  "link": "/r/GradSchool/comments/q46bk3/feel_like_my_uni_is_holding_me_hostage_on_my/",
  "title:": "Feel like my Uni is holding me hostage on my postgraduate degree",
  "text": "I just started my postgrad degree (UK) two weeks ago and I can already tell that this is not what I want to do. I have spoken to a supervisor in my department and she basically spent an hour telling me that everything would be fine and that I’m just overwhelmed at the moment and told me to wait until I have at least completed the third week before making a decision.\n\nThis causes a big issue:\n\nAt my Uni, you have to pay a big portion of the tuition fees if you quit after the first two weeks. For me, this comes to about 5k, which is massive. \n\nI technically could only have made this decision a few days ago as weirdly, even though the official start date for my course was last week, the actual induction was only a few days ago, and that was when I realised that I didn’t want to be doing this. \n\nSo yeah, first problem: if I want to save 5k, I CAN’T wait until after the third week, I HAVE to quit within the next few days. \n\nSecond problem: in order to withdraw, I need to confirm (and name) a person in the department who I discussed leaving with. I didn’t actually get to discuss much of the leaving with this supervisor as she spent 90% of the conversation trying to convince me to stay and guilting me and because I’m a pussy, I basically just melted and half agreed with her that I MIGHT stay and see how it goes. So when my application to leave inevitably goes through her, I’m not sure how that will turn out. Also, it’s the weekend so I can’t actually talk with her again before I have to make the decision.\n\nAny ideas or opinions at all?",
  "author": "Top_Selection_603",
  "created": 1633725571,
  "updated": 1634099819,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hfwe8zs": {
      "link": "/r/GradSchool/comments/q46bk3/feel_like_my_uni_is_holding_me_hostage_on_my/hfwe8zs/",
      "text": "What’s right for you is right for you; conversely, what’s wrong for you is wrong for you. It sounds like you have made the decision that you want to leave your program, and that doing so now will save you £5,000. Makes sense. So, I don’t understand what’s stopping you. If it’s because that advisor tried to convince you to stay, my response is: do you owe them anything? Will you ever see them again? Will you need to rely on them for anything in the future? If the answer to the third question is “yes,” then take more time to consider your situation. Otherwise, take the plunge and leave. That way, you can start down a path that does make sense for you—and save a ton of money in the process. Good luck. I’m rooting for you, friend! 🤙🏼\n\nETA: you’re not the first person in this situation, and you won’t be the last. That advisor has seen it before, and they likely know what they’re talking about. But I guarantee that if you leave, they really won’t think anything of it, so I wouldn’t worry about that if I were you. No one will think of it in the long run but you. Choose wisely, but go with your gut.",
      "author": "KaFaraqGatri07",
      "created": 1633725949,
      "upvotes": 9,
      "replies": {
        "hfwhkg3": {
          "link": "/r/GradSchool/comments/q46bk3/feel_like_my_uni_is_holding_me_hostage_on_my/hfwhkg3/",
          "text": "Thank you for the advice and encouragement, I appreciate it! \nI think I’m largely worried about the technicalities behind my leaving. As in, I’m not sure how the formal process works, but when my withdrawal application goes through her and she sees that I’ve put her name down as the person who I discussed this with, I’m scared that she might dispute it or something? Because like I said I didn’t even really manage to talk to her about the actual issue, which is me quitting. \n\nI also do just feel terrible. I know that I’ll probably never see her again, but I left our meeting on such a positive note, basically saying that I would tough it out for now and do as she suggests, basically, so I imagine her getting told in two days time that I’m applying to leave would be pretty insulting…",
          "author": "Top_Selection_603",
          "created": 1633727355,
          "upvotes": 3,
          "replies": {
            "hfwpawu": {
              "link": "/r/GradSchool/comments/q46bk3/feel_like_my_uni_is_holding_me_hostage_on_my/hfwpawu/",
              "text": "Technically, even if the discussion was fairly one-sided, it still counts as a discussion. The rules didn’t state it had to be it to be a fair and even debate on both sides.\n\nWhen there is an imbalance of power or you have a non-confronting personality saying something noncommittal like “I’ll try to stick it out” is close enough to making it known the discussion was that you want the program in my thoughts, you just did not rubber stamp it yet…",
              "author": "UleeBunny",
              "created": 1633730681,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}