{
  "sid": "q8xjzv",
  "link": "/r/GradSchool/comments/q8xjzv/any_tips_or_tricks_for_taking_the_gre/",
  "title:": "Any tips or tricks for taking the GRE?",
  "text": "Hi everyone,\nSo I’m in the process of getting ready to take the GRE so I can better my chances of getting accepted into a grad program that rejected me. It would honestly be the best place for me to go since there are no prerequisite course to take. In other places there are, and I hadn’t taken any of them. They’re looking for a quantitative score of 151. I’ve been taking the practice tests and just feel so drained midway through. The analytical writing and verbal reasoning sections are pretty wordy and take all of my concentration. By the time I get to quantitative reasoning I’m pretty drained. Any tips or trick to feel energized through the whole thing and get the score I need? Thanks",
  "author": "mynameizham",
  "created": 1634332126,
  "updated": 1634605139,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgvcy3a": {
      "link": "/r/GradSchool/comments/q8xjzv/any_tips_or_tricks_for_taking_the_gre/hgvcy3a/",
      "text": "Practice till you make it. But 151 is actually quite easy to attain, are you not getting that score on the mock test?",
      "author": "dailysoyhojichalatte",
      "created": 1634399038,
      "upvotes": 1,
      "replies": {
        "hgvpomc": {
          "link": "/r/GradSchool/comments/q8xjzv/any_tips_or_tricks_for_taking_the_gre/hgvpomc/",
          "text": "I was taking a mock test the other day. I was really concentrating on the verbal and vocab part. By the time I got to the quantitative section I was pretty mentally fatigued. I saved and quit at that point. I’m about to go out soon to get the study guide for it.",
          "author": "mynameizham",
          "created": 1634404602,
          "upvotes": 1,
          "replies": {
            "hgvqlqx": {
              "link": "/r/GradSchool/comments/q8xjzv/any_tips_or_tricks_for_taking_the_gre/hgvqlqx/",
              "text": "How's your verbal score? I didn't focus on verbal that much because i knew i wont do well for it (got 153 for it). Didn't felt too tired when i start on quant, maybe because I didn't really use much brain power on verbal (not like i understand the questions anyway). \n\nHonestly speaking i don't think u need a study guide for quant unless u haven't done much math/stat recently. I haven't touched much advance math for years when I did my GRE and still did decent for quant (didn't prep for it as well because i was yolo-ing).\n\nPractice does help though, my first run on mock test was really draining but it was ok on actual test day.",
              "author": "dailysoyhojichalatte",
              "created": 1634404981,
              "upvotes": 1,
              "replies": {
                "hgwsg6s": {
                  "link": "/r/GradSchool/comments/q8xjzv/any_tips_or_tricks_for_taking_the_gre/hgwsg6s/",
                  "text": "Verbal’s ok I think. Some questions are manageable but others are like I’ve never even heard of these words before. I also had like $40 worth of Barnes and Noble gift cards that I didn’t have any other use for so I figured I would. B and N is expensive AF. What did you get on the quant?",
                  "author": "mynameizham",
                  "created": 1634421411,
                  "upvotes": 1,
                  "replies": {
                    "hgy885s": {
                      "link": "/r/GradSchool/comments/q8xjzv/any_tips_or_tricks_for_taking_the_gre/hgy885s/",
                      "text": "My quant is 166. I think out of the 40 qns in two rounds, only two qns used concepts that I never heard before. I think there's a free study guide by the gre company if u search their website but it's kinda long so i gave up reading.",
                      "author": "dailysoyhojichalatte",
                      "created": 1634447274,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}