{"sid": "pua3x4", "link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/", "title:": "Why grad school and not work directly?", "text": "Hello, sorry this must be a common theme as seen in:\n\n[https://www.reddit.com/r/GradSchool/comments/64c2ly/job\\_or\\_grad\\_school\\_right\\_after\\_undergrad/](https://www.reddit.com/r/GradSchool/comments/64c2ly/job_or_grad_school_right_after_undergrad/)\n\n[https://www.reddit.com/r/GradSchool/comments/2n03b5/did\\_you\\_go\\_to\\_grad\\_school\\_right\\_after\\_undergrad/](https://www.reddit.com/r/GradSchool/comments/2n03b5/did_you_go_to_grad_school_right_after_undergrad/)\n\n[https://www.reddit.com/r/GradSchool/comments/alb7qd/whats\\_harder\\_for\\_you\\_grad\\_school\\_or\\_working\\_a\\_job/](https://www.reddit.com/r/GradSchool/comments/alb7qd/whats_harder_for_you_grad_school_or_working_a_job/)\n\n[https://www.reddit.com/r/GradSchool/comments/mnfjqh/anyone\\_else\\_thankful\\_they\\_had\\_work\\_experience/](https://www.reddit.com/r/GradSchool/comments/mnfjqh/anyone_else_thankful_they_had_work_experience/)\n\nand I assume many others\n\nbut\n\nSome answers speak how its hard to go from job (more money and more time) to grad school which has less of both. Others say it help them to work first due to making them more responsable. Quoting apollo405 :  the longer you (a) don't have to do homework and (b) make a lot more money than you do now, the motivation to go back and finish will exponentially decrease. \n\nI want to know the current new perspectives, my first 3 links are before covid. Sorry if there are newer and I suck at googling.\n\nI want to work as a Data scientist, machine learning, but my mayor is mechatronics, more mechanics than anything. \n\nSome even told me experience is better than a master. Tell me what you believe.", "author": "Z1lar", "created": 1632449400, "retrieved": 1632844019, "over_18": false, "upvotes": 6, "upvote_ratio": 0.72, "comments": {"he2x6x0": {"link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/he2x6x0/", "text": "So I work as a data scientist and am going to grad school. \nI think the answer to your question, really depends on your field, however for data science (lots of degrees can work here, but assuming your looking at one related) in my opinion having some experience is essential. The real issue in data science is being able to understand a problem. We don’t need people who can pick the best model for Kagel so they get the best match.. but people who can look at a real world problem, look at the data, and figure out which variables to use, and which model/techniques to use, knowing the training data will always be at least a little different than the test data. \n\nI think at least some real world experience helps here. Now if you can’t get a job that gives you exposure to these types of problems, sure go to school straight away.. in my opinion a lot of field is better to take grad school slow and do it while working.", "author": "runslow0148", "created": 1632484607, "upvotes": 2}, "he2qn2i": {"link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/he2qn2i/", "text": "I did Bachelor, Master and PhD (German system) one after another.  \nI now decided that Academia is not for me and wished that I had left earlier. The job I'm working literally just requests that I have *any* degree in computer science, so in theory even the Master was time wasted.\n\nOne of my bosses also said when I joined \"Once you start working no one actually cares about your exact degrees, they just become fun stories to tell\".  \n\nSeeing how I'm now in my early thirties and basically work an entry level job I sometimes wish that I looked earlier in alternative routes for my career. I was focused on becoming an academic only to realize after three degrees that I don't like the lifestyle, so going earlier into working a similar job sounds very attractive. That said, I love my job and of course would have ended up somewhere else, but that's kind of a deep \"what if\" scenario where anyways no one can tell you if the situation world have been better or worse. I'm happy where I am but if I would have to do everything over again I probably would at least seek out more info, maybe apply to a few jobs to see what my actual realistic options are. And it's likely I wouldn't do the PhD then.", "author": "LittlePrimate", "created": 1632480344, "upvotes": 2}, "he2k2c9": {"link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/he2k2c9/", "text": "The philosophy that convinced me to go straight into grad school after undergrad instead of entering the workforce for 2-3 years (my original plan) was this: if you *know* that you are definitely going to need a graduate degree (and what kind) for your career path and are able to get in, then it's better to do it sooner rather than later.", "author": "aggressive-teaspoon", "created": 1632474904, "upvotes": 7}, "he24rsr": {"link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/he24rsr/", "text": "Working full time with my masters degree, I can confirm that it is really freaking difficult.\n\nI'm a Masters in Science for engineering though so I would just say temper your expectation based on what you are trying to get out of it. A degree is good, but a masters teaches you how to learn better than you knew in undergrad", "author": "Big_Faithlessness625", "created": 1632462066, "upvotes": 3}, "he1yvji": {"link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/he1yvji/", "text": "I did an undergrad in STEM in 1998-2002 then went to work as a software engineer. Went back for a history BA online at 43 now on my way to a masters. You just gotta make it work. I make a fuckload more as an engineer than a historian will ever make so I’ll probably keep doing both.", "author": "ostrogotha", "created": 1632458207, "upvotes": 6}, "he1prxs": {"link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/he1prxs/", "text": "I honestly was going to go straight into a job but Covid had just started so there were no jobs. Now I’m super happy I waited because I’m in a great program moving into a field that’s super high in demand (bioinformatics).   \n\nI find that the whole “experience is better than school” thing is total bs. An entry level job will likely land you a job doing low-level repetitive tasks until you work your way up. As an example for my field (molecular biology), I could’ve gotten a job after my BSc as a lab technician. The job would’ve been something like carrying out bench protocols all day, keeping notes, maybe some data analysis? But that’s mostly it. As a grad student, my supervisor has been great getting me involved in side projects, so I’ve got several papers that I’ll be coauthor on, data analysis experience for multiple different labs, an industry contract, and overall tons of experience processing and plotting data.   \n\nIn my opinion, all that is worth way more than just being a set of hands. Especially since you can have a full cv with publications, projects, conferences, presentations, etc.", "author": "You_Stole_My_Hot_Dog", "created": 1632453060, "upvotes": 9}, "he1n6pr": {"link": "/r/GradSchool/comments/pua3x4/why_grad_school_and_not_work_directly/he1n6pr/", "text": "Work full time and go to grad school somewhere that works around that schedule, or online.", "author": "Biggeasy", "created": 1632451729, "upvotes": 2}}}