{"sid": "lviokp", "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/", "title:": "Coping with the suicide of a labmate", "text": "My lab recently learned that we lost a labmate due to a probable suicide. I am wracked with guilt and regret that we could have done more to support her. We have a nose to the grindstone lab culture that does not leave ample room for social relationships. As a result I don’t feel that I knew her on a deep level but I am profoundly shaken by her death. I don’t know how to cope with these feelings or how to move forward. I feel angry at myself and my lab that we let her down. It feels wrong to throw myself back into my work and work towards research deadlines again but I don’t know what else to do.", "author": "moonlight_wanders808", "created": 1614628284, "retrieved": 1632953246, "over_18": false, "upvotes": 702, "upvote_ratio": 0.99, "comments": {"gpfbomr": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpfbomr/", "text": "It sounds like you should really consider how this environment could be detrimental to your mental health. Labs can be very toxic environments, working people to the absolute edge. I work in two grad labs and it’s sad to see the mental health status of everyone that works in them. I hope you can heal from this while also reflecting on your own situation. I know how hard it can be to leave a position when you worked so hard to to get there.", "author": "Nuttafux", "created": 1614700260, "upvotes": 1}, "gpf61mi": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpf61mi/", "text": "Just want to send you my condolences. I cannot imagine the feeling. \n\nI see that you already have a therapist. Even if you already had a meeting recently, don't hesitate to call / write directly to see if you can have another earlier. If she/he has a spot they will probably oblige.\n\nTake care... I wish you the best.", "author": "jtmooon", "created": 1614697669, "upvotes": 2}, "gperrle": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gperrle/", "text": "I’m so sorry for your loss. You’ve gotten some comments on this post that offer great advice and I hope that you’re able to take the time you need to process this event and move forward. \n\nThere’s a graduate student organization at my school designed to help students early in the program and prevent these things from happening. There are also similar organizations at other schools. As one commenter said, having a purpose and something to do may be helpful to you here, and if that would work for you, getting a group of students together and starting an organization like this on your campus could be something you could do to satisfy that need.", "author": "unicornsanshorn", "created": 1614689939, "upvotes": 1}, "gpehy77": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpehy77/", "text": "I’m so sorry that this happened to you and your class.\n\nMy closely-knit program lost one of our peers to a horrifically violent murder last year. We were obviously devastated, and our program faculty found itself in a conundrum due to the rigor of our program curriculum  that seemed to exist in conflict with our need to grieve and process this loss and trauma.  They did grant us some leniency with our assignments for a few weeks following the event, with the expectation that we would take the initiative to reach out to them if we needed an extension on a deadline. \n\nSomething that was tremendously helpful in giving us space to process our loss while staying on track academically was to hold a group counseling session with our school therapist.  I honestly felt apprehensive going into the session, but I noticed a major shift in the energy and outlook of my group as a whole, and feel that many of us turned a corner after that.  It’s so important to have space to fully process and move through these experiences.", "author": "PTAcrobat", "created": 1614682040, "upvotes": 1}, "gpdxsym": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdxsym/", "text": "I am so sorry this happened and you are going through this. We lost a student in my program a little over a year ago, and I unfortunately think I know some of the feelings you are describing. Your lab mates may be processing these same feelings as well, and I hope you can be a source of support for each other. Please know and trust yourself in that you did the best you could with the information you had at the time.", "author": "kangarookarate", "created": 1614663700, "upvotes": 1}, "gpdjk01": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdjk01/", "text": "I'm sorry for your loss. I think your feelings are normal, and I would definitely talk to someone about it, whether it is your therapist or a grief counselor, or both. I also think it's important to practice self care, whatever that looks like for you. Someone mentioned to be wary of advice suggesting that you throw yourself into your work, and I agree depending on who it's coming from. If it is helpful for *you* to take your mind off of things rather than watch Netflix and eat takeout, then I'd consider that part of self-care. If your PI is the one giving that advice, I'd look at it with some serious side eye. Work *can* be helpful for individuals experiencing a loss or some trauma, but it isn't always or for everyone, so I think the focus should be on your mental health, what you want to do, and what is best for you. \n\nI also very much agree with others suggesting that a serious look at the lab culture needs to take place. It's a huge red flag to me that you said your lab culture does not leave room for social relationships. Your PI's work is not that important, regardless what they think or what they say. You are human beings, not slaves or drones, and you have social needs as any human being does. If the lab work does not leave room for social relationships, then the lab work needs to change. I also feel like it's handicapping you and your labmates, because part of the educational experience in graduate school is networking. Unfortunately, it's not always what you know that helps secure a job, but who you know, so I think networking should be an integral part of any graduate education.\n\nIf your PI's work environment is one that gives you anxiety and depression, or contributes to it, that is a toxic environment. I know someone who was in a toxic lab and justified it for years before finally having a breakdown. They were diagnosed with PTSD. Any PI that contributes to a culture that gives their students the same mental disorder combat veterans get should be jailed, and blacklisted for all academic and research institutions for life. It's honestly not that hard to not abuse your students. I'd pay critical attention to how your labmate's suicide is addressed moving forward. Serious changes *should* be made moving forward and things should not just go back to normal in a week or two. This is a serious and traumatizing experience and needs to be treated as such, not just like a break from research or an inconvenience. It's good that he reached out via email, but the conspiratorial side of me wonders if he did that because email is official university communication and he reached out so there'd be a record. His actions moving forward would shed more light on whether this was genuine or something he felt like he had to do in case there was any questions.", "author": "False-Guess", "created": 1614655098, "upvotes": 2}, "gpdibh2": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdibh2/", "text": "You seem to be compassionate and empathetic which is why you're feeling this so intensely. But please know the suicide had nothing to do with you and there was nothing you could have done. One of my colleagues committed suicide about ten years ago and afterward all of us wondered if we could have done something. But in all honesty, we had no idea what she was dealing with in her personal life. We had no idea why. All we could do is celebrate the time we had and tell her family stories about the time she worked with us. That meant a lot to her family and to our work group. I hope you can find a way to feel the feelings but not get too sucked into them.", "author": "SpiderDogLion", "created": 1614654429, "upvotes": 6}, "gpdhluv": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdhluv/", "text": "I just listened to a recent episode, We Believe Each Other into Being, in the podcast On Being, and it really consoled me to listen their conversation on suicide. Check it out if you are a podcast listener.", "author": "gingeroo96", "created": 1614654048, "upvotes": 2}, "gpd8yo0": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd8yo0/", "text": "I am absolutely sorry for your loss.  Please, PLEASE, please take advantage of on-campus resources like psychological counseling center and the student health center.", "author": "apl2291", "created": 1614649435, "upvotes": 1}, "gpd8jwb": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd8jwb/", "text": "It’s not your fault. People punch out for selfish reasons", "author": "FeistyHelicopter3687", "created": 1614649220, "upvotes": -13}, "gpd7pt0": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd7pt0/", "text": "I am so sorry.\n\nPlease just remember you had no idea this was gonna happen, and that you did al you could.", "author": "doingasifeel", "created": 1614648780, "upvotes": 1}, "gpd0yo1": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd0yo1/", "text": "Honestly, I don't have much to give in terms of advice for how to cope. I can only relate to the labmate, where I felt really alone and isolated in my grindstone lab/department culture, and have seriously contemplated suicide. I don't think it's your fault, and I think a lot of it can be blamed on the culture of your lab. Sometimes, this kind of behaviour and culture was started from a few extremist students a while ago and just perpetuates for a long time, long past their graduation. Support and guidance for this kind of thing needs to come from the top-down, too, so the PI of the lab needs to also do more to foster a more open lab. If anything, I'd try to focus on yourself first to make sure you feel like you have enough social support so you wouldn't be next to suffer poor mental health, since it's apparent that your lab culture can cultivate it. Maybe also try to push for more openness in your lab now to try and prevent the cycle from perpetuating.", "author": "valryuu", "created": 1614645159, "upvotes": 8}, "gpcznvv": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcznvv/", "text": "I have no advice for you except to affirm one thing: you have a right to be shaken up here, regardless of your relationship or closeness to that person. This is a perfectly normal reaction to witnessing or learning of a traumatic event. Allow yourself to feel that way without guilt or shame.", "author": "stolid_agnostic", "created": 1614644466, "upvotes": 2}, "gpcw2aa": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcw2aa/", "text": "I've posted this on another thread in this sub but I'll repeat what I said there and some more:\n\nTake your time to grieve. It's natural and more importantly, human, to feel the loss of a life. It's important that you don't lose your empathy especially during this time and you are doing a good job of being empathetic. Do not change that. \n\nNext thing - it's not your fault. I've lost a few friends to suicide and if I could have, I would have treated all of them differently. But i cannot because that's how life is. Do not beat yourself up but rather reflect on whatever good times you shared. \n\nIf you wanna talk, my DMs are open. \n\nStay strong, OP.", "author": "kruger_schmidt", "created": 1614642568, "upvotes": 6}, "gpcrlu8": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcrlu8/", "text": "All of the feelings you have right now are normal. It will take a lot of honesty and rawness to get through the work it will take to heal - but it will get better, if you take care of yourself.\n\nAt one point in my life, I was a teacher. One of my middle school students took his own life. I was the last teacher to talk to him that day and I was not in a great mood for a variety of reasons. I wasn't outwardly rude to him or anything, but I was usually a warm and fuzzy teacher and wasn't that day. If I'm totally honest, I still feel a twinge of guilt, but I have come to the realization that I was just one slice of my student's life. My interactions that day did not cause a young person to take their life. He made his horrible mistake based on a combination of factors that I probably could not have individually have stopped. \n\nI don't say any of that to gain sympathy here, but to say that I feel like you are where I was those years ago when it happened. It was not your fault. You are going to work through this and be kind to yourself. It was not your fault.", "author": null, "created": 1614640268, "upvotes": 18}, "gpci24b": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpci24b/", "text": "I am so sorry for your loss. I don't have advice other than make sure you are taking care of yourself during this time. There is no wrong or right thing to do. If you want to keep working that's fine, but if you want to take a couple days off to process that is also okay. I can relate to what you're feeling right now, I was in an extremely similar situation a couple years ago. A couple months after I left my undergrad lab to go to grad school in a different state one of the grad students committed suicide. Our lab was extremely close, everyone (21+ undergrads, grad students, the PI) would go for drinks a couple times a month and we would hang out together outside of the lab often. None of us knew the grad student was struggling and even with being across the country I felt like I let them down because we texted the day before and I didn't sense anything wrong. I just want you to know that it'll get better with time and to reach out to a therapist/grief counselor or even your PI/lab members because they are likely feeling the same as you are right now.", "author": "DesertDreamer491", "created": 1614635603, "upvotes": 10}, "gpc7wby": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpc7wby/", "text": "I'm so so sorry. I see that you have a therapist, which is so important, and I want to encourage you to give yourself time and soace to process. That said, don't feel guilty about wanting to work, and if people judge you for that they don't get it.\n\nMy dad passed away about a year ago, he was losing his life to cancer but his passing was still unexpectedly soon. I was in lab when I got the news, I had a literal 24 experiment planned for that day (breaks every ~6 hours, but timepoints over 24 hours). Luckily my lab mates were able to cover my next time point so I could go home and bawl. But that night, I felt the overwhelming need for some kind of control or action in my life, and because there was absolutely nothing I could do about my father's death, I decided to go back into lab and finish the last late night/early morning time points. Probably looked crazy from the outside, but I had already talked on the phone will all my (small) family, couldn't start planning any services (everything was closed), and I don't know how to describe it, other than that accomplishing anything that day felt important for my soul? After that I took 2 full weeks out of lab for myself, which I also needed, but sometimes normalcy and productivity in small doses can be just as healing as other forms of self care.", "author": "kronning", "created": 1614631015, "upvotes": 65}, "gpc2pph": {"link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpc2pph/", "text": "I’m sorry for your loss. As someone who has lost two people I knew fairly well to suicide, I can tell you that feelings of grief are normal. Does your program have counseling or therapy for students? If so, I’d talk to a professional in your case. Even if it’s just over zoom, they can be a good resource to understanding your feelings.", "author": "PsychologicalAd489", "created": 1614628736, "upvotes": 208}}}