{"sid": "bo75u4", "link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/", "title:": "My wife and I just walked for our PhDs. My thoughts on starting a family during graduate school.", "text": "Hey guys, like the title states, my wife and I both defended last June (Molecular Microbiology), and walked on Saturday. We met a half a year before our programs began, and we married and had a kid 2 years in.\n\nStarting a family in grad school is definitely doable, depending on your lab situation. We had zero proximal family support, so we had our son in daycare during the weekdays, and we took turns watching the little guy on the weekends and weeknights when one or the other of us had to put in a lot of work. Not trying to violate rule 9 here, but we collectively published 12 times (4 first author, 5 co-author, three reviews) as PhD students, so I would dare to say that we didn't half-ass it because of the kid.\n\nVarious (usually older) faculty told us that we were making a mistake when my wife got pregnant (on purpose), and our school offered zero support for graduate student mothers apart from the mandatory, unpaid FMLA weeks (my wife took 6 weeks plus her two weeks of vacation). Luckily, our mentor was extremely supportive and absolutely thrilled to have a lab baby (she even babysat for us a couple of times).\n\nSo, if you are considering getting married and/or having a kid in grad school, never let anybody tell you that you ***have*** to put your life on hold, especially if raising a family is a high priority for you; those mid 30s come up real fast. Talk to your mentor, look at what resources your school/state/country offers, get advice from others who have gone through the same thing, and do your research about the child care options in your area. Most importantly, find a work/life balance that works for both of you, and be sure to create some quality family time (weekend \"daycations\" and babysitter-allowed date-nights kept us sane).", "author": "Took-the-Blue-Pill", "created": 1557771861, "retrieved": 1632953775, "over_18": false, "upvotes": 449, "upvote_ratio": 0.97, "comments": {"enhntst": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/enhntst/", "text": "This is a huge achievement to be celebrated. May I add that having parents from both sides close by also helps big time.", "author": "cfso2017", "created": 1557854725, "upvotes": 2}, "enh5q68": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/enh5q68/", "text": "This is really reassuring. I'm 25, married, and one year into graduate school...I feel better after reading this", "author": "cshack29", "created": 1557846529, "upvotes": 3}, "enfrzfi": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/enfrzfi/", "text": "Congratulations! That’s really nice. My partner wants a child sometimes, but we are too uncertain of our futures. I’m concerned about placement after the fact. Does your discipline have an abundance of job opportunities? If not, is that a concern for where you both end up? Or is one willing to settle?", "author": "thoughtfulhooligan", "created": 1557821253, "upvotes": 3}, "enfcyzv": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/enfcyzv/", "text": "Congratulations!!! 🎉🎉 wow! Thank you for the encouragement. Did you guys start and finish the phD program in 2 years? Are you guys both professors? Were you guys both( or was one of you) employed? I am sorry to ask so many questions, but I re-read your post again. I am thinking of doing a phD, but I have read that it takes many years. How did you guys manage to finish in 2 years...if you don't mind me asking?\n\nThank you again for this encouraging post.", "author": "dulceariel", "created": 1557813415, "upvotes": 0}, "enf6i88": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/enf6i88/", "text": "Needed to hear this, thank you, and I’m so happy for you and your family!", "author": "snacks_lite", "created": 1557810290, "upvotes": 2}, "enewfe0": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/enewfe0/", "text": "[deleted]", "author": null, "created": 1557805706, "upvotes": 3}, "ene580x": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/ene580x/", "text": "I plan to defend while pregnant. Hard question....? Owwwwww contraction!!!!", "author": "BiologyBae", "created": 1557793795, "upvotes": 26}, "ene2tzz": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/ene2tzz/", "text": "Are lab babies now the PhD advisor equivalent of grandchildren?", "author": "TheMechEPhD", "created": 1557792325, "upvotes": 8}, "ene1z2g": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/ene1z2g/", "text": "First off congrats.\n\n\nSecondly I'm in a similar position. Have a young baby (6 months). I'm in a phd program and wife is doing masters (at half load for this year). We purposely did it this way to add flexibility we wouldn't have if we were working. It's working out fantastic for us. I'd make the same choice again in a flash\n\n\n\nI'd only add make sure your finances are good. We can only do it because we're using some of our savings. You don't want to be broke, on a stipend and with a kid.", "author": null, "created": 1557791792, "upvotes": 7}, "ene174c": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/ene174c/", "text": "As someone looking to make an engagement ring and get into a PhD program in the mext year, thank you. This is very encouraging to know grad school amd family aren't mutually exclusive!", "author": "Istalriblaka", "created": 1557791316, "upvotes": 13}, "endflt1": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/endflt1/", "text": "This is such a relief to hear as I'm starting my master's this fall and hope to get married one day. Career and family are both pretty important to me, and I've often struggled to believe that I wouldn't have to give up one for another, so it's always such a relief and inspiration to see other folks following their dreams, academia and all!", "author": "UsualMacaroon", "created": 1557782076, "upvotes": 5}, "end6eeo": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/end6eeo/", "text": "Had a TA for an Ethics class this semester, and his wife recently gave birth to a baby girl. If I recall, she’s less than a year old. The TA is also from Europe and his family doesn’t live here, so he doesn’t have that support system immediately available. I still don’t know how he manages to do it all.", "author": "redflavormp3", "created": 1557778457, "upvotes": 8}, "end2srk": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/end2srk/", "text": "Thanks for this! Currently sitting with my 5mo daughter (i'm the mom), working on my second year of my PhD and hoping I passed my qualifying exams! It's definitely possible!", "author": "INeedToPeeSoBad", "created": 1557776968, "upvotes": 38}, "encz82c": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/encz82c/", "text": "How many years? If you were to plot your productivity over the years, how does it look?", "author": "handpaw", "created": 1557775441, "upvotes": 5}, "encyg27": {"link": "/r/GradSchool/comments/bo75u4/my_wife_and_i_just_walked_for_our_phds_my/encyg27/", "text": "Thank you for sharing! I'd be interested in hearing your wife's perspective as well, since having children is typically more of a career risk for women. Did the 8 weeks off affect her degree progress at all? If you don't mind elaborating, how did you both deal with the unsupportive comments and criticism? Was it financially difficult to manage childcare costs on grad student salaries?", "author": "geosynchronousorbit", "created": 1557775117, "upvotes": 104}}}