{"sid": "px3nva", "link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/", "title:": "My spark is gone", "text": "I recently had a realisation that whilst I enjoy the concept of a PhD, I really don’t enjoy the actual work. I’m in my first year and all I’ve done so far is work from home. I haven’t even physically met the people in my department or the other PhD students. \n\nTry as they might, I simply can’t garner the same enthusiasm and spark for learning I had as an undergraduate student. Maybe it’s because I’ve had very limited social contact but I’m just not feeling it any more. \n\nWhat should I do?", "author": "Nuclear_Fermion", "created": 1632825792, "retrieved": 1632843693, "over_18": false, "upvotes": 25, "upvote_ratio": 0.93, "comments": {"helnm90": {"link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/helnm90/", "text": "I have the same sort of feelings and I'm about 2 months in to my Master's program. I'm sticking through at least until Christmas before I start thinking about exit plans, but I hope to be able to push through and finish the program.", "author": "rowantreewitch", "created": 1632840562, "upvotes": 1}, "hellzc6": {"link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/hellzc6/", "text": "I tell my incoming physics grad students (I assume you're in physics because of your username!) to \"get out right now, unless you can't picture yourself doing anything else in life\".  Grad school is a big ol' grind and even folks who enjoy the work tend to feel burnt out by it at points.  If you successfully complete the Ph.D. the reward is ... that you get to do more of the same.  For folks with a certain \"bent\" toward physics, that's a really great enticement.  For ordinary folks (even very smart ones) it might be the opposite.\n\nThat said: first year (of graduate programs in physics) is deliberately designed by most schools to be brutal, with classes that explore the limits of physics (as of about 30 years ago) and include problem sets that won people the Nobel Prize the first time they were solved.  Doing the Big Three (Classical, Quantum, and E&M) during COVID would be extra awful, because the classmate connection and joint work that form a good (if grueling) first year experience were almost nonexistent during the peak of the pandemic.  So you might want to stick it out through at least another semester or two, to see if things get better with in-person schooling.", "author": "drzowie", "created": 1632839862, "upvotes": 1}, "helj65p": {"link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/helj65p/", "text": "I recently left a PhD program. My closest friend in my unit was one year ahead of me, and she told me that the year before I got there was by far the best year she'd ever had (and of course clarified that that wasn't to do with me, ha!). The department was full of students at all stages of their degrees, and there was a ton of cross-specialty collaboration. A conversation over the water kettle would turn into a collaborative poster idea for a conference, and people could rubber ducky out their ideas rapid fire. However, all of our advisors were later-career and considering retirement, so took fewer students. My year was smaller, and those later-stage students left were deep into their theses so had no time to chat, are were often not even in the offices while away writing. I was there for three years, and each year we had fewer and fewer until my friend and I were the only ones consistently on campus. Sadly, what with the pandemic, I think she is the only one in the office most days now.\n\n&#x200B;\n\nCommunity is HUGE in grad school. The high-level conversations that are produced by talking to people with hugely varying levels of familiarity with the subject, as well as the unofficial mentorship of seeing what the older students do, all of that is so vital. It's what I miss about grad school most. I'm sorry that you are isolated and I wish I had aa solution for you. I know we all have Zoom fatigue, but would a department Zoom happy hour or some way of looping in more people for unstructured chats help?", "author": "quoththeraven929", "created": 1632838654, "upvotes": 2}, "helgd9q": {"link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/helgd9q/", "text": "I've found this is me after the pandemic, my 4th and now 5th year in my PhD program. It might not just be grad school, it might be all of the other things going on. It's so much tougher, right now.", "author": "ckvp", "created": 1632837388, "upvotes": 1}, "hel7wp0": {"link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/hel7wp0/", "text": "The research you do for the PhD is a completely different kind of learning from the one you did as an undergraduate. Since you have not had a chance to experience it yet, it is probably premature to decide it is not for you.\n\nWorking in isolation is not for you, and it isn't for most of us. But that is a different matter.\n\nNevertheless, a PhD, and a research career that requires that training is definitely not for everyone. It is a really small proportion fo the population. I'd say is is less than half of the people who \"enjoy the concept of a PhD.\" \n\nI encourage you to give the full on research experience a try in the coming year if it is available to you. If it turns out not to be exciting and rewarding, then find something that is. You would be completely normal in doing so.", "author": "IkeRoberts", "created": 1632833308, "upvotes": 2}, "hel2apn": {"link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/hel2apn/", "text": "Isolation is a terrible thing. While I agree that there is absolutely no shame in dropping out, you might want to consider whether this decision would come from a good place. For example, would you actually be happier in a different job if it turns out to be completely remote as well? Is there any perspective for the situation at your university/group to change in the near future, so that you may meet your colleagues and work with them in person? If so, it might be worth to wait a bit more and see if the spark returns.", "author": "huehue12132", "created": 1632830071, "upvotes": 3}, "hekyn9f": {"link": "/r/GradSchool/comments/px3nva/my_spark_is_gone/hekyn9f/", "text": "A PhD isn't for everyone. Some people know before starting one and get a job, some figure out after starting. A PhD is basically a job – if it's not a good fit, there's nothing wrong with looking for another job. You want to be sure – it's not good to leave then find out you want to go back.", "author": "someth1ng_au", "created": 1632827677, "upvotes": 12}}}