{"sid": "loy63w", "link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/", "title:": "MIT to offer \"guaranteed transitional funding for all students across MIT who wish to leave an unhealthy advising relationship\"", "text": "I'm lucky to have a great relationship with my advisor, but others aren't so fortunate. Good on MIT for addressing this problem. \n\n[https://rise4mit.medium.com/rise-update-on-guaranteed-transitional-funding-211a2bd67ebc](https://rise4mit.medium.com/rise-update-on-guaranteed-transitional-funding-211a2bd67ebc)", "author": "Dawalkingdude", "created": 1613917808, "retrieved": 1632953181, "over_18": false, "upvotes": 1149, "upvote_ratio": 0.99, "comments": {"gobsc7s": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/gobsc7s/", "text": "not having funding after leaving my advisor (in my case, my advisor leaving the uni suddenly) is a big reason why I didn't stick it out and finish with someone else. Glad to hear they are progressing on this issue", "author": "iammaxhailme", "created": 1613989663, "upvotes": 3}, "gobafbf": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/gobafbf/", "text": "So, one thing I find really interesting is the fact that many programs at MIT still do not guaranteed funding for X (~5) years.\n\nAt many universities, STEM Ph.D.s give you a guaranteed funding of 5 years when sending out the offer letter. So if you end up changling labs and are in a transitionary period, your funding is not impacted. In fact, I needed to change labs this summer (best decision of my graduate life so far!) and did not have a lab a little over a month. When I asked my DGS about funding, she said it would continue as I have guaranteed funding of 5 years and if I can't find a lab within a semester, then I'd be put on academic probation (switched shortly after).\n\nThis is a great development for MIT, but I think they eventually need to adop the guaranteed funding practice. My friend at MIT EECS PhD program was surprised to hear about my guaranteed funding, and I was surprised to hear that MIT, of all places, didn't offer him guaranteed funding at admission.", "author": "ceriolie", "created": 1613973998, "upvotes": 1}, "go9bbm3": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go9bbm3/", "text": "This isn’t relevant to me, but it’s *super* awesome to see.\n\nGood luck, genuinely, to anyone who’s facing this kind of issue.", "author": "idcydwlsnsmplmnds", "created": 1613936399, "upvotes": 2}, "go92hby": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go92hby/", "text": "This is not only great in the practical sense, but it also normalize the idea of leaving bad mentors. I struggled with leaving my former mentor because it seemed like I would be entering uncharted territory.", "author": "snoop_pugg", "created": 1613932745, "upvotes": 14}, "go8pcv7": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8pcv7/", "text": "Change? For the better?  :0", "author": "peregrination_", "created": 1613926677, "upvotes": 2}, "go8n8b7": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8n8b7/", "text": "Im confused, does this mean they don’t have guaranteed funding in the form of a TAship? In my dept when you’re accepted you automatically have several years as a TA guaranteed (independent of advisors money,it comes from the dept) so if you wanted to switch advisors the main barrier is just that it’s really hard to switch projects after the first few years without adding lots of time to your degree.", "author": "medusawakened5", "created": 1613925625, "upvotes": 4}, "go8lf9y": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8lf9y/", "text": "I spoke to grad students in my field at mit and I hope this really helps people. While there are some good ones, others were very very toxic and it seems agreed that mit does nothing make mental health a priority and one even said “pretends it doesn’t exist.” So this seems like a good first step.", "author": "sylphrena83", "created": 1613924734, "upvotes": 25}, "go8gwhe": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8gwhe/", "text": "I kind of feel like the current focus on ‘toxicity’ is creating a generation of pussies who need validation vs tenacious research scientists that will actually succeed on the the merits of their work.", "author": "FeistyHelicopter3687", "created": 1613922435, "upvotes": -69}, "go8fwjw": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8fwjw/", "text": "This is great. I hope more schools enact things like this. Additional support mechanisms would also be nice. I'm in a program that has guaranteed funding for students and it's still an upward battle to change advisors when abuse and negligence are involved. And these advisors don't face any sort of consequences.", "author": "JamesTiberiusChirp", "created": 1613921913, "upvotes": 19}, "go8dshf": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8dshf/", "text": "This is an awesome initiative and those grad students are very brave for pushing it through. At my school, your old advisor is asked to fund you for two additional months while you look for a different advisor. But if that person cannot/will not or if you don't find someone else to cover you after that, then you're out of luck.\n\nIt's also hard to find a different advisor when you can no longer get any recommendation letter from your former one. If your department is on your advisor's side, you can be hit with reviews blaming you for failing to perform to standard, failing this and that, and rumors being spread that you're incompetent, difficult to work with, etc. Few faculty want to be entangled in that kind of political drama. So officially people may tell you that they can't take you because of funding, but unofficially you know that they absolutely have money and are looking for students but they're not taking you so they don't step on the toes of your former advisor and his/her allies.\n\nThere is so much power imbalance between faculty and their grad students that some protection for the students is really needed here.", "author": "PumpkinCrumpet", "created": 1613920782, "upvotes": 173}, "go8dedg": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8dedg/", "text": "Top comment on this on Twitter was “well, if MIT just gave everyone 5 years guaranteed funding *like my school does*, this wouldn’t be needed,” and man, I can think of only a very few less helpful comments than that.", "author": "AceyAceyAcey", "created": 1613920564, "upvotes": 45}, "go8aozl": {"link": "/r/GradSchool/comments/loy63w/mit_to_offer_guaranteed_transitional_funding_for/go8aozl/", "text": "Commenting because I know someone that could use something like this.", "author": "the-duck-butter-er", "created": 1613918986, "upvotes": 71}}}