{"sid": "pmd8ea", "link": "/r/GradSchool/comments/pmd8ea/should_i_get_an_online_masters_in_early_childhood/", "title:": "Should I get an online Master's in Early Childhood Education?", "text": "Hello everyone! I'm not sure if this is a good sub to post this, but I've been lurking here for a little while, so I figured I'd just go ahead. \n\nI've had to pause my Online Bachelor's in Elementary Education (grades 1-6 licensure) due to a family emergency. My husband lost his job and we have a newborn, so my working is a necessity, at the moment, to pay for rent, health insurance, food, etc. I have taken every class (and every state test) except for student teaching, but will be able to finish it August-December of 2022. \n\nMeanwhile, I'm considering taking an online Master's degree in Early Childhood, since I am required to have one within 5 years of teaching in my state, anyway, to become a fully licensed teacher. Depending on the district, my salary would also increase $2,000-$5,000 with my Master's and I'd have a higher salary cap. \n\nHowever, my ultimate career goal is to open and run a high-quality, private preschool. However, that requires experience and funding! I love teaching and it is definitely a passion of mine, so I plan to teach for the next 5-10 years to gain experience and to pay off my student loans, car loan, etc. then start actively planning my preschool. \n\nI believe that a Master's Degree in Early Childhood would help me accomplish both my short-term and long-term career goals, as well as still provide me with a backup plan should my school fall through, for some reason. \n\nDoes this make sense? Should I get another degree (like school leadership) instead?", "author": "elemental333", "created": 1631386713, "retrieved": 1632844636, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hci93mq": {"link": "/r/GradSchool/comments/pmd8ea/should_i_get_an_online_masters_in_early_childhood/hci93mq/", "text": "Hi! I just finished a Masters in ECE. I would encourage you to do it!", "author": "Expensive-Mountain-9", "created": 1631409267, "upvotes": 1}, "hci7lc3": {"link": "/r/GradSchool/comments/pmd8ea/should_i_get_an_online_masters_in_early_childhood/hci7lc3/", "text": "I don't really have any experience with what you're dealing with, but it sounds great to me", "author": "Anarchy_Lurker", "created": 1631408565, "upvotes": 1}, "hci4gaw": {"link": "/r/GradSchool/comments/pmd8ea/should_i_get_an_online_masters_in_early_childhood/hci4gaw/", "text": "Sounds like you really want to get your masters, so I say get it. I'm a principal so I have my masters in leadership. Really, if you don't want to go into administration, there's no reason to get one. That's just my experience.", "author": "thastablegenius", "created": 1631407037, "upvotes": 1}}}