{"sid": "pxrsf5", "link": "/r/GradSchool/comments/pxrsf5/are_joint_labs_a_thing/", "title:": "Are joint labs a thing?", "text": "I’m not sure this is the best place to ask this question, and it’s probably aimed at those of you who are in the life/medical sciences. But are joint labs a thing in different countries? What I mean is that 2 people are the PI of one lab. I’ve seen it a couple of times now (I’m UK-based) with 2 people being the head of one group, and it actually sounds like it’d be nice. Has anyone seen this anywhere else, does anyone know how the logistics of this would work in terms of funding etc.?", "author": "unemployedgraduate12", "created": 1632907711, "retrieved": 1632951905, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"herb8ny": {"link": "/r/GradSchool/comments/pxrsf5/are_joint_labs_a_thing/herb8ny/", "text": "I've seen this happen in Japan as well but the two PIs aren't on \"equal levels\".  There's a more senior professor and then a junior professor who runs the lab.  \n\nIn my specific field, it's not a thing.  But hey I'm not in life sciences.", "author": "HalfEatenPie", "created": 1632942738, "upvotes": 2}, "heqfp5r": {"link": "/r/GradSchool/comments/pxrsf5/are_joint_labs_a_thing/heqfp5r/", "text": "In the US, it's not uncommon to see two labs that are very closely intertwined with collaborations and shared resources, but I think they mostly are represented as separate labs to the public and on paper by convention. \n\nI don't know if this is the entire reason, but at least part of the issue is that tenure and promotion focus a lot on individual contributions. This means that it's more advantageous to have the semblance of separate labs and official assignment of ownership of resources, contributions, trainees, etc.", "author": "aggressive-teaspoon", "created": 1632929956, "upvotes": 5}, "hepufn5": {"link": "/r/GradSchool/comments/pxrsf5/are_joint_labs_a_thing/hepufn5/", "text": "In the US they're definitely a thing in practice, although I don't know how much that changes for the PIs in terms of official stuff. I've heard of a good handful of labs at the places I've gone to school/ worked at with 2-3 PIs but I've never been in a group like that so I don't know how far it goes beyond joint lab meetings and coordinating projects. This is in bio/ecology/ag fields.", "author": "KiwiTheKitty", "created": 1632920578, "upvotes": 3}, "hephthv": {"link": "/r/GradSchool/comments/pxrsf5/are_joint_labs_a_thing/hephthv/", "text": "I think it’s quite common in Australia. My lab has 8 principle researchers. (Also life science). It’s great to be in a large group because I get exposed to a huge range of research topics every day.", "author": "SunburntWombat", "created": 1632912868, "upvotes": 4}}}