{
  "sid": "pjrl2s",
  "link": "/r/GradSchool/comments/pjrl2s/my_thoughts_three_weeks_into_my_phd_lost_and/",
  "title:": "my thoughts, three weeks into my PhD: lost and confused",
  "text": "I just started my PhD at my dream school in bioengineering three weeks ago, and I graduated from undergrad in May at 21. You'd want to think that my life is perfect, that I'm enjoying it all, but... I see my classmates and friends from undergrad go get master's or jobs immediately after undergrad, travel, and even GET ENGAGED AND MARRIED. I know a few people who got engaged and posted photos on their social media (I only started checking my IG recently, like once a week for the past two months or so, previously I quit it cold turkey except to post like once every three months)... and it makes me feel odd. It makes me feel like my life has no meaning, or that I'm getting nowhere.\n\n&#x200B;\n\nLike, you'd want to think that I'm super happy and content with my life, and that I'm living the dream. In a way, I am. I'm living in the Bay Area, going to grad school and doing amazing science, meeting wonderful people and making amazing friends... but you then see your friends move on with their lives and find love and get settled... meanwhile you're staying in lab running experiments for your paper deadline, and going to class and writing grants, having sleepless nights and crying... even though you strive to have a work-life balance and play sports and have amazing friends and it works out 80% of the time... I just feel like I'm working towards nothing, you know.\n\nYou see me getting excited about a nice meal, an unexpected day off, going to San Francisco for the day, in some way I still feel like I enjoy the tiny things in life like a college student would, not like an adult would. My dreams are really simple: either go to law school or med school after my PhD, and advocate for affordable healthcare and equitable access to new biomedical innovations, and try every bubble tea shop in the Bay Area before my PhD is done. \n\n&#x200B;\n\nI don't know, I feel like I'm living for nothing, and that I'm stuck in the cycle of seeking knowledge. It's my favorite thing, and I'm happiest when I'm discovering something new, but I also can't help but feel futile.",
  "author": "nietzschesoptimism",
  "created": 1631035366,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.75,
  "comments": {
    "hddrq9w": {
      "link": "/r/GradSchool/comments/pjrl2s/my_thoughts_three_weeks_into_my_phd_lost_and/hddrq9w/",
      "text": "The path of seeking knowledge, it seems, has always been quite a lonely one. There are piles and piles of quotes and poems and books about it في التراث العربي. And historically it seems the natural sciences and engineering have always been particularly difficult paths and particularly thankless pursuits even for people who made breakthrough innovations. It's actually something I've been meaning to make a bit of a YouTube series about because I care about it so passionately, find it so reassuring and have to dig really deep to explore. I guess what I'm trying to say is you're not alone on that path, it's only a path someone should take if they have very high moral character, real conviction in the value of what they are doing, and sincere intention devoting their work to God in the sense that it is furthering humanity so whatever life throws one's way it is our personal struggle in this life. If the pursuit succeeds or falls flat on its face is immaterial.\n\nAs for the loneliness, well it's reassuring to see a woman who feels this way, in my world there are a lot of decent young men who seem to hit a brick wall with Muslim women because the latter appear to be uninterested in marriage and family. We are all navigating a new reality in which we are the first generation coping with life as it is today. We can't do what our parents did and we can't do what our society is doing. And again the only solution, in my view, is to pursue what God has prescribed for us as the way - maintaining decent standards in our conduct while seriously endeavouring and striving. Asking around, getting to know the right people, signing up to matrimonial sites, whatever it is. Just as with work and life, with marriage too, the famous rule stands true that it will work out if you strive, and it will work out in a way you never anticipated. Even if it doesn't work out that will be part of something bigger that makes sense: fate, which we should be at peace with.\n\nومن يتق الله يجعل له مخرجا و يرزقه من حيث لا يحتسب قد جعل الله لكل قدر سببا \n\n(Which everyone has heard of, but today I learnt is in the surah of divorce, so there you go)\n\nEdit: okay let me follow this up. I had the privelige of attending a top institution in the UK. Exclusive enough that if I mention it I would be doxxing myself. Anyway while there I received some very important advice that people at the top of their game don't seem to get enough. Sometimes, we have a responsibility to give back. To give to our community, our family, our society. In ways that we see as trivial. In washing dishes, in sitting with a parent to do a mundane chore, in babysitting, whatever it is. With great knowledge and position comes great responsibility to be humble enough to accept that we have to spend our time and ability on what we perceive as dumb meaningless wastes of time, because God has made it our duty to take care of these simpler tasks just as he has made the big bits of the world accessible to us. I don't know if that came across clearly.",
      "author": "albadil",
      "created": 1632000847,
      "upvotes": 2,
      "replies": {}
    },
    "hc0afdw": {
      "link": "/r/GradSchool/comments/pjrl2s/my_thoughts_three_weeks_into_my_phd_lost_and/hc0afdw/",
      "text": "Here's a research question for you: What makes a person happy and feel like their life is meaningful?",
      "author": "ScaryPillow",
      "created": 1631065642,
      "upvotes": 1,
      "replies": {}
    },
    "hc01alg": {
      "link": "/r/GradSchool/comments/pjrl2s/my_thoughts_three_weeks_into_my_phd_lost_and/hc01alg/",
      "text": "Every path is different! It's tough, without a doubt. My husband and I both did grad school just about right out of undergrad and it feels like we're just now getting our lives started and we're almost 30. But, having the PhD, being in a stable and enjoyable career, and getting to now enjoy that life was worth it. You find happiness where you can, and don't put pressure on yourself to feel \"adult\". I still get excited about an unexpected day off! \nSomedays feel futile. I had days, weeks, months where I was like, what is the point. And ultimately, I left academia because of that feeling (and it was 100% the right choice for me!). I don't think that feeling is unusual, you just have to sort of fight through it and find the point. I'm a means to an end kinda person, so I always focused on that in the rough patches. \nOne of the best nuggets of wisdom my PI gave me during my PhD was never to compare myself to others. Even though that's all you feel like when you're in the situation, I said something about another student and he looked at me and was like, who the **** cares about them? We're talking about you. Maybe it was the fact that he was British and everything he said was 10x more intense than anyone I'd ever met, but that always stuck with me. You do you, and don't let other people's lives make you question your goals. \n\nEasier said than done, but worth it on the other side. Best of luck!",
      "author": "Team_Cap",
      "created": 1631061396,
      "upvotes": 1,
      "replies": {}
    },
    "hbyt4ex": {
      "link": "/r/GradSchool/comments/pjrl2s/my_thoughts_three_weeks_into_my_phd_lost_and/hbyt4ex/",
      "text": "Stop comparing yourself to other people. Life will get a lot better when you do that. Also, you'll feel a lot less of the need to brag.",
      "author": "ProprioCode",
      "created": 1631042030,
      "upvotes": 1,
      "replies": {}
    },
    "hbyg8rf": {
      "link": "/r/GradSchool/comments/pjrl2s/my_thoughts_three_weeks_into_my_phd_lost_and/hbyg8rf/",
      "text": "everybody's path is different just focus on your own shit. all trees don't grow at the same exact time!",
      "author": "Brotendo88",
      "created": 1631036672,
      "upvotes": 12,
      "replies": {}
    },
    "hbyg0n6": {
      "link": "/r/GradSchool/comments/pjrl2s/my_thoughts_three_weeks_into_my_phd_lost_and/hbyg0n6/",
      "text": "I understand how you feel. Most of my friends graduated and got jobs they loved, got married started a family, etc. While I was stuck in a crummy job going nowhere. After a year off I went back and got my masters. Got a slightly better job but not something utilizing either of my degrees. 2 years later I got a promotion and felt like I was starting to “catch up” with my classmates, then I decided to go back for a PhD. \n\nI started my PhD a few days after turning 30 and I’ve struggled with being one of the “older” students in my program (not that 30 is old), and also watching friends have babies, get their dream jobs etc. There are times I look back and wonder if this was all just a waste, but I love learning and research and if I can help one person through my research or (one day) being a teacher/mentor then it will be worth it.\n\nI’m a 3rd year and I can say you will go through highs and lows, but when I start feeling down and question my decision to do a PhD I just spent d some time reading the literature around my topic. Spending time just reading and not worrying about projects or my thesis or anything else helps me get the “spark” back. \n\nIf you ever need someone to vent to or want to chat feel free to DM me 🙂",
      "author": "Megabec",
      "created": 1631036579,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634065385
}