{
  "sid": "qh9uja",
  "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/",
  "title:": "How much effort should I be putting in as a TA? How do I know if I’m doing enough?",
  "text": "I find that I can answer a the majority of the questions, but there’s maybe 10% of questions I get cause I just don’t know (I’m not super versed on the content, maybe 90%). Any ideas if I’m doing enough?",
  "author": "grothendieck1",
  "created": 1635378430,
  "updated": 1635457634,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.82,
  "comments": {
    "hibfwgg": {
      "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hibfwgg/",
      "text": "It's OK to not know every answer.\n\nWhen that happens, it's an opportunity to show your students how to find answers.",
      "author": "Mr_Morrid",
      "created": 1635379821,
      "upvotes": 16,
      "replies": {
        "hibhclw": {
          "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hibhclw/",
          "text": "As long as you explain something about the question--even where to begin searching for answers--you've done well.",
          "author": "qwertyrdw",
          "created": 1635380456,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hibdz6g": {
      "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hibdz6g/",
      "text": "I go out of my way to learn the material to answer questions. \n\nThat said I am really strict about responding to emails. If a student emails me after 5 (usually it actually ends up being 6) or on a weekend they are not getting a response till the next business day. I told them this at the beginning of the semester and they seemed to finally get the idea 2/3 of the way through. I have my own stuff to do, and I am also trying to instill the idea that they should look for work/life balance also. I know that last bit is rich considering I am in grad school, but still.",
      "author": "Theredwalker666",
      "created": 1635378967,
      "upvotes": 7,
      "replies": {
        "hibnlva": {
          "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hibnlva/",
          "text": ">I go out of my way to learn the material to answer questions.\n\nYikes maybe I should be doing more. I'm so busy at the moment with my own classes and applying to fellowships, I barely have time to learn 100% material.",
          "author": "grothendieck1",
          "created": 1635383208,
          "upvotes": 2,
          "replies": {
            "hic0ouz": {
              "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hic0ouz/",
              "text": "Do not internalize this as a necessity if teaching is not your priority. Think through your goals and prioritize accordingly. It is perfectly okay to not know all the answers. It is perfectly okay to not prioritize learning all the answers.\n\nWhen possible, guide students to where they may be able to find the answers independently.",
              "author": "Jwalla83",
              "created": 1635389057,
              "upvotes": 4,
              "replies": {}
            },
            "hibqy5n": {
              "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hibqy5n/",
              "text": "I totally get that. I don't know where you are in your program, but I am a bit further down the line so I have less classwork which makes what I am doing possible. If I had to TA my first or second semester there would have been no way to do it.",
              "author": "Theredwalker666",
              "created": 1635384704,
              "upvotes": 1,
              "replies": {
                "hic49bd": {
                  "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hic49bd/",
                  "text": "Yup that’s me lol. It’s my first year and I got no idea what I’m doing. The only questions I can answer are programming related so there’s that at least",
                  "author": "grothendieck1",
                  "created": 1635390769,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hibr7x3": {
      "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hibr7x3/",
      "text": "If it's a question that is very much needed to answer the homework or an essential part of the class, it would be great for you to know the answer or work to find it. If it's a more abstract question or going farther into the topic than the class covers, it is very much ok to not have the answer. It would be good to help the student find the answer (suggest a reading, suggestion who to talk to, ...) but if you have no idea that's fine too.",
      "author": "PurpleMermaid16",
      "created": 1635384823,
      "upvotes": 2,
      "replies": {}
    },
    "hic1nzo": {
      "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hic1nzo/",
      "text": "You don’t have to know everything. I often didn’t know most of the problems but the student and I could figure them out together and in doing so they can see how to approach something they don’t know how to do at first glance. You don’t have to be the best TA in the world. That’s not why you’re in grad school. Be a good enough TA.",
      "author": "Ru-tris-bpy",
      "created": 1635389507,
      "upvotes": 1,
      "replies": {}
    },
    "hif02dx": {
      "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hif02dx/",
      "text": "When your fellow grads come after you you are slacking",
      "author": "rthomas10",
      "created": 1635447587,
      "upvotes": 1,
      "replies": {}
    },
    "hibh2qj": {
      "link": "/r/GradSchool/comments/qh9uja/how_much_effort_should_i_be_putting_in_as_a_ta/hibh2qj/",
      "text": "When I was an undergrad, I had two profs--a historian and a political scientist--ask me to review their notes on World War II. I was quite honored. They knew I was more up-to-date on the literature then they were and knew I would be humble about it.",
      "author": "qwertyrdw",
      "created": 1635380339,
      "upvotes": -15,
      "replies": {}
    }
  }
}