{"sid": "jdhehk", "link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/", "title:": "there is literally too much work", "text": "I feel like some of my Professors have been overcompensating for Covid by adding work and I can't keep up with all of it. I've stopped doing some of my readings for class just to keep up with project deadlines.\n\n\\*also, I still have to do some of the god damn readings (which is fine) because they literally track if we're doing our readings with weekly graded Blackboard posts....\n\nIs this normal? Do Profs not realize how much is on our plates right now? A lot of the workload could just be cut down by some of the readings.", "author": null, "created": 1603031974, "retrieved": 1632953829, "over_18": false, "upvotes": 415, "upvote_ratio": 0.97, "comments": {"g9c4q77": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g9c4q77/", "text": "I have had this exact same issue. Two of my classes are fairly manageable but the third one just feels like I'm drowning and I'm about to fail. Like I try as hard as I possibly can, but I still just feel like all the busy work is killing me.", "author": "Appropriate_Cobbler", "created": 1603122727, "upvotes": 1}, "g9aprsw": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g9aprsw/", "text": "I’ve been fortunate in the fact that the vast majority of my profs have been really flexible due to COVID but I am still struuuugling. My first year of grad school sucked but the second year (thus far) has been even worse. Day by day, I just feel less and less invested. With classes being online, I push things off and do the absolute bare minimum. I’m extremely frustrated with myself and although I know I’m the only one that can change it, I am so drained that I don’t even want to. I jumped straight from undergrad to grad school with no break in between. The fatigue is really catching up to me. I’m grateful that I am able to work from home but working from home + online classes is really beginning to mess with my head. I really think the breaking point was when my program gave us the news that spring semester will also be online (with the exception of a few hybrid classes). It just feels like there’s no end in sight. I completely understand why things need to be this way & I support it but I guess I am struggling with what I imagined grad school would be like, in my head, and the actual reality of it all.", "author": "PersonalRelease", "created": 1603084624, "upvotes": 1}, "g99tluv": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g99tluv/", "text": "It is normal for me, which explains my tendency to adapt to this mindset that the walls are closing in.", "author": "gabe89san", "created": 1603064072, "upvotes": 1}, "g99p48i": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g99p48i/", "text": "When you stop doing some (or all) of the assigned readings, you start to be a real grad student.", "author": "kitten_twinkletoes", "created": 1603061475, "upvotes": 5}, "g99mofd": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g99mofd/", "text": "I feel this so hard right now - I feel like I have so much I am doing, so many deadlines every week that nothing I produce is quality and my quality of work is just shit. I'm applying to a fellowship right now and have had barely anytime to work on the personal statement portion of it.... what's the point in adding extra work (aka fellowship applications) if I can't dedicate the time things deserve?\n\nI'd rather do fewer things better but there always seems to be more and more and more", "author": "succulent_124", "created": 1603060096, "upvotes": 3}, "g99fie8": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g99fie8/", "text": "I got my MA in English Literature online, so you can probably imagine the amount of reading and writing I had to do (I wrote around 8-10K words every week for two and a half years - more when major assignments were due!) I'm also a college English instructional assistant during these Plague Days 2020, so I see the negative effects of ripping students out of the classroom and into a digital learning environment.\n\nMy advice is to prioritize the readings you *have* to do and skim the readings you *ought* to do. The most effective way of skimming is to read the abstract, the introduction, the first and last sentence of every paragraph, and the conclusion (remember when you took English 1 and we were all Thesis! Topic sentence! Transition! - this is the point). This will also help you identify which paragraphs seem most relevant; read those. \n\nIf you are reading PDFs or anything digital, mostly, Ctrl+F (or command on Mac) is your new best friend. Search for important terms and maybe some synonyms, and read the surrounding paragraphs. This is especially useful for research! If you're looking for research on high school classrooms, you don't want to be half way through and figure out the article only discusses ECE, y'know?\n\nThe BEST discussions are the ones that ask questions. Professors love that shit. This also helps your classmates respond and will make you more popular, lol. Good questions are based on questions you had while reading, so don't overthink them and just ask about that term's social meaning, how it applies to classroom learning, and why the author only cited themselves (looking at you, Chompsky)! I always tell my students, be stupid simple. It's better to be straightforward and clear than clever and vague.\n\nI hope those helps in some capacity! Lmk if you need clarification/have questions. <3", "author": "bomdiggitybee", "created": 1603056176, "upvotes": 8}, "g998puk": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g998puk/", "text": "I feel exactly the same. Was wondering if others felt the same. Not sure what the solution is but doesn’t seem sustainable", "author": "nerv737", "created": 1603052708, "upvotes": 3}, "g998p2n": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g998p2n/", "text": "Agreed, my first year as a grad student was stressful but nothing like this. I have an autoimmune disease so I haven't been going to classes nor lab so I'm on the computer all week. I get tired and have been taking a lot more naps and have had such low motivation to do any of my work.. On top of it, our lab manager constantly reminds us we should be putting in extra hours on WFH (esp myself) since I can't be in the field. \n\nSo far I've been able to keep up but I'm just ready for this to be over with.", "author": "BusyPlum", "created": 1603052698, "upvotes": 3}, "g98yv0g": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98yv0g/", "text": "One interesting thing we've noticed is how much *easier* it is to assign more work in an online setting. If I want to I can very easily set up a quiz or assignment for basically every class, some of which can be graded automatically. Also I'm finding I'm able to grade much faster due to centralization + ease of use for our online platform. It makes it very tempting to up student workloads to our capacity to assign, rather than their capacity to learn.", "author": "jimmychim", "created": 1603048067, "upvotes": 3}, "g98y83j": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98y83j/", "text": "💯 feel this. Combined with teaching, it’s too much for me. I cannot relax on weekends for too long. I calculated the amount of hours just by class, teaching, and meetings (based on the idea that for 1 credit hr you devote 3 hr) and it came to 9 hrs per day 7 days per week, not even factoring in research time. I work/attend/do assignments for ~ 9-12, sometimes 14-18 hr per day just to keep up. KEEP UP. Not actually doing deep thinking and learning. It’s exhausting. It was not as bad as this before covid in my experience. Edit: still, I understand the need for hard boundaries and self preservation. It’s still a totally different beast for me from my masters.", "author": "coffeejaunt", "created": 1603047757, "upvotes": 3}, "g98ws8o": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98ws8o/", "text": "I feel you, we are more pressured to \"evidence\" work than really dig and understand. From all my courses only 1 of them I'd say is genuinely being a learning experience. \n\nI'm not saying I want this, because I don't, yet am accepting that this historical context is bringing a lot of paradoxes one of them (at least in my experience) is blunt banking education.", "author": "BlissMeli", "created": 1603047049, "upvotes": 1}, "g98u51d": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98u51d/", "text": "I feel you, but from the other side. I'm teaching three courses this term (one undergrad, two grad) and it's getting pretty crazy. I'm cutting readings left and right, but everyone is struggling right now. We're definitely all on the same body of water (not quite the same boat).", "author": "purple_ombudsman", "created": 1603045718, "upvotes": 3}, "g98qpfv": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98qpfv/", "text": "I also feel this, my school cut out all breaks for the full year and shortened the semesters. \n\nAltogether, each semester has 3 weeks less class time, but the courses are maintaining the amount of work from previous years, just in the shorter time frame. \n\nThis week I looked at roughly how much work my cohort was doing outside of our GA requirements. The average was 40 hours of course related work per week, per student for taking 9 credits (our GA positions are another 20 hours on top of that). Though, most of this is not due to our department, but rather the school's policies on the conduct of courses and payment/duties of GAs.", "author": "the_Q_spice", "created": 1603044041, "upvotes": 10}, "g98qkr0": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98qkr0/", "text": "I feel like this to some extent as well. At the beginning of the semester, most professors in my department were very good about acknowledging how COVID would complicate graduate students' ability to be as productive as in the before times. Although one of my professors is very understanding and has eliminated all assignments except for weekly reading and response papers (i.e., no term paper, research design, etc.), my other two have been less accommodating. I'm just trying to do my best. Fortunately, my classes end on November 10 and my assignments are due a week later. Almost done.", "author": "sozialwissenschaft97", "created": 1603043979, "upvotes": 6}, "g98qgpr": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98qgpr/", "text": "Wow, I have been really struggling with this, but since it’s my first semester in grad school I just figured it was normal. I understand it’s probably something to do with having to do all of my work at home, and that’s why it feels like more, but damn. I’m halfway through my first semester and I’m already depressed as hell.", "author": "ObviouslyGinger", "created": 1603043925, "upvotes": 2}, "g98nlqo": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98nlqo/", "text": "I was talking about this exact issue with my therapist. Seeing as she has her master’s degree, this was her advice (not verbatim, my memory’s not that good)- “You can’t do it all. They assign too many readings in grad school. You don’t have time to do it all, and it’s okay to just do your best.”", "author": "BearsandBeetsPaperCo", "created": 1603042530, "upvotes": 51}, "g98mehn": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98mehn/", "text": "If you're in a biology field, this approach might help with academic article consumption:\n\n* Print the article out. Devote your attention to this task without distraction. \n* Decide *a priori* how relevant the paper is to your research. If it's for lab journal club, treat it as highly relevant. If it's for a class the treat it as lower relevance. \n* For low relevance, read the abstract carefully, look at the figures, and their descriptions, if necessary to understand. If you get the story, you can move on. If you don't get it, skim the results section to see if it can help you make sense of their narrative. Skip the introduction, methods and discussion unless there's something that catches your eye. Write the narrative in your own words either on the front page, or beside the figures. \n* For high relevance, do the above first, and the read the whole damn paper. The methodology section becomes super important here. Take copious notes. Go through the author's logic piece by piece. Think about whether there are alternative explanations that fit the data. Identify the gaps in knowledge. Then read it again, but this time think about how it relates to your own research. Take more notes. \n\nYou will forget what you've read. But you will hopefully remember your notes and why you wrote those notes. \n\nNot all papers deserve the same degree of attention to serve your purpose. You can churn through a lot of papers relatively quickly by just getting the gist of it and moving on.\n\nNB: you really need to read a lot of papers first before you get a feel for understanding a narrative from the abstract and figures alone. But as with anything, the more practice you have at something, the better you'll get at it.\n\nNB2: I have no idea what other STEM field papers look like and I don't have a clue about non-STEM fields. I suspect a similar attention-priority approach is generally applicable.", "author": "retsamerol", "created": 1603041946, "upvotes": 11}, "g98iakj": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98iakj/", "text": "I can't help, but just want to say that I totally feel this. \n\nMy profs are trying to compensate for the in-class vibe by encouraging us to discuss all the readings online (which also forms part of our mark). I appreciate what they are trying to do, but it is exhausting, especially when it's 3 classes a week all with different deadlines and with project deadlines on top of that. \n\nI am hyper-organized but I also work very hard and I am just about keeping my head above water. The one thing I am trying to take comfort in, is that it's ok to give 80% sometimes. Skimming the readings and taking away key points is sometimes sufficient.\n\nI get that everybody is trying to figure this out as we go, and there are parts of the in-person experience that profs are trying to replicate, but cumulatively it is so overwhelming.", "author": "doodahdoo", "created": 1603039810, "upvotes": 29}, "g98hnpu": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98hnpu/", "text": "Have you told them it’s too much? Often people don’t realise until they are told and generally react quite well and are understanding but you need to communicate that with them", "author": "Molefucker", "created": 1603039452, "upvotes": 3}, "g98h1jp": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98h1jp/", "text": "That’s odd. I feel like my work load has generally _reduced_ because of COVID. Everyone’s work capacity—students and professors both—has lowered under the current circumstances. And while we have less mental space for work, my professors additionally have less mental space to lesson plan and grade work.\n\nI don’t write this to pile on or make you feel worse about your situation; you simply asked, and I thought I’d say this is not universally the case. My professors have made a lot of required readings optional and have even cut some assignments or have been more flexible with their deadlines.\n\nI was struggling to get IRB approval for one of my projects, for example, and the professor basically is allowing me to just submit all progress reports in November. I don’t think under normal circumstances such accommodations would be made.", "author": "Im_A_Quiet_Kid_AMA", "created": 1603039108, "upvotes": 4}, "g98gesk": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98gesk/", "text": "Honestly, after aproaching my first year in the most naive way possible, I understood something. \n\nThey will always want more work from you, you are the donkey pulling the carriage. But, they also expect you to plan your own time properly, which low key  means telling them no sometimes. \n\nBy no I mean to the deadline, god forbids for the projects ( although in that too some arguments we had about the way things done lead to better solutions! )\n\nI feel like we need to care for ourselves and the work load we have, no one else would.\n\n\"I'm sorry, I first need to do this and that\", \"I'll do my best but ...\" But not everytime of course, not to turn to a box full of excuses.", "author": "lolchan55", "created": 1603038754, "upvotes": 80}, "g98b17q": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98b17q/", "text": "I also feel like this. This is my second year in grad school, and the first year I never felt like I was drowning in work but now I do. I work all day and still don’t feel like I’m even close to catching myself up. I’ve been struggling with my mental health a bit so that doesn’t help. I’m sorry you’re struggling as well with being overloaded :/ I hope it gets better for you hang in there", "author": "EastWestSkies", "created": 1603035849, "upvotes": 167}, "g98a5h6": {"link": "/r/GradSchool/comments/jdhehk/there_is_literally_too_much_work/g98a5h6/", "text": "There are a few reasons it's more difficult these days, one of the reasons is that you're doing all the work at home and home is not a good place to do work. \n\nI'm not a professor myself but I work with them on a daily basis, most of them are trying their best to not overload you and not to overload themselves with work. Many assignments that used to be group assignments have to be handed in individually. While that seems like much more work for you, doing an assignment on your own you have to consider the people going over the assignments.\n\nLast year I was assisting in teaching the same course of genetics I'm helping with now, we had approximately the same amount of students but instead of 160 students handing in roughly 60 assignments I'm getting the full 160 assignments to grade. This actually forced me to simplify the assignment just so I could get through grading them on top of everything else I have to do.\n\nWe're all struggling, the students, the teachers and the TA's. \n\nAlso, not to sound too mean, but how do you know it's more work due to COVID-19? Unless you've taken all those courses before and have some frame of reference for the workload?", "author": "biochem-dude", "created": 1603035383, "upvotes": 54}}}