{
  "sid": "qc4lq8",
  "link": "/r/GradSchool/comments/qc4lq8/desperate/",
  "title:": "Desperate.",
  "text": "Preface: This is a really big emotional rant. If this isn't compliant with the rules of the sub, please alert me to it. It would be great if I could be redirected to the appropriate sub, if applicable. I would not like to post this in r/math, since that is primarily for informed mathematics discussion, and I am anything but an informed mathematician. Also, if anyone has any paragraph chunk issues, yell at me.\n\nI black out during tests. Every test I’ve had. Undergrad through now. In my undergraduate institution, I was able to secure extended time for my exams and my exam grades shot up. Every time I forfeited this option (usually for ego reasons) I ended up with something horrendous that I could hardly recognize and that I didn’t even remember doing. \n\nBackground: \n\nI study math. I struggled with it growing up (I mean, I literally went into college unable to multiply exponents or add fractions or explain what a function on a graph was) and clawed and fought my way through hordes of adults telling me I wasn’t talented enough to become a CS/Math student in undergrad, with mostly As to show for it (after 18 years of Ds.)\n\nMy undergraduate professors all noticed my inconsistent exam performance, and luckily, one of them was extremely adamant that I get sensory/time accommodations for exams, so I did. I am interested in pursuing graduate Theoretical Computer Science and work full time as a cybersecurity engineer, so I’m going to grad school part time. \n\nI have been doing excellent in my abstract algebra course thus far, if you judged me by the proofs I do in my assignments. I’m usually at the top of the class here. I like doing the assignments. I sometimes do harder problems for fun, to test my understanding. I find excuses to use abstract algebra at work. I can't fucking stop bringing up things I learn in class to my coworkers, boyfriend, etc, and inevitably end up teaching them (and myself) the material.\n\nBut of course, we just had our first exam. I thought I knew everything, and I thought that the professor (who is a somewhat crotchety old guy) would think I was stupid if I requested extended time, so I didn't.\n\nI remember a conversation I had with another student prior to the test, and I explained some concepts to him that he found confusing. He remarked I’d probably do well and I shouldn't be anxious. I knew he was wrong. I don't remember taking the test. I don't remember how I got to some of the absolutely absurd conclusions I came to.\n\nI don't know why I did anything. I should have been able to do everything, but my brain would not. Fucking. Concentrate. It would loop over stupid things over and over again and mess up basic arithmetic; stuff that should have been second nature by now got thrown out the window in favor of complete gibberish.\n\nIt was like I was operating in a fourth language, like one half of my brain was inadequately functioning in overdrive and the other half decided to sedate itself. I could not pull myself to attention no matter how much effort I exerted. I still cannot explain this. It took me TWENTY MINUTES to do ONE INVERSE OF A 2X2 FUCKING MATRIX. YOU KNOW. THE EASY ONES FROM UNDERGRADUATE LINEAR ALGEBRA. I kept scribbling over stuff over and over again, panic swelling up and taking up space in my head and clouding my vision over and over again...\n\nMy professor recently pulled me aside and expressed concern over my exam. I was initially confused, because I studied hard and could do every problem. He said my answers were, to be verbatim, \"incomprehensible.\" He asked how I was doing in the program, and I said that I had gotten an A- in a statistics course (the exam was a take-home with an in-class portion. You can guess how I got the minus.) I talked about the in-class portion of that exam and how I could not process one of the questions at all, no matter how I read it, even though it was supposed to be easier than the take-home portion. He wanted to attribute my nonsensical answers to a complete lack of understanding of the (very basic - I'm literally talking just properties of groups and subgroups) material (which I had in undergrad! And did well in! And did on the homework assignments! I cannot stress enough how ANGRY I am about that!).\n\nI ended up getting frustrated, throwing my hands up in the air in front of him, muttering in between attempts to suppress the emotion: \"I don't know, I don't know why I did anything. I can't explain it. I'm just really stupid.\"\n\nI am demoralized. I don't feel like I have any talent for math. I really never did. I do proofs in my spare time because I enjoy them. I work regularly with algebraic structures (finite fields are generally a godsend in my area.) But now all I want to do is drop out. I don't know where to go or where to turn for help. I don't know how to progress knowing that there are students who don't do this, who are more talented and smarter than I am, who would destroy me in any PhD candidacy exam. I want to be normal, and I want to be intelligent. I don't want...whatever this is. I want advice, I don't know. I study hard. I am vigilant about completing quality work. And yet, tiny details and time limits destroy me. It's pretty pathetic. I want to know what you're supposed to do when you commit to graduate study and you find out that you really, really, suck, and you likely always will.",
  "author": "the_naturalest_log",
  "created": 1634746784,
  "updated": 1634750799,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhdq3mv": {
      "link": "/r/GradSchool/comments/qc4lq8/desperate/hhdq3mv/",
      "text": "That's rough, OP. Sounds like you have a pretty severe form of test anxiety. I'm in math too, and one thing to keep in mind (at least in my PhD program), is that we really just need to get through the 2 or so years of classes so we can move onto research. It sounds like once you get to that point, you will be in good shape.\n\nThat said, if I was in your shoes I would probably try to discuss accommodations with your advisor and maybe have another talk with this professor. I know you don't think he will be understanding, but he has already tried to discuss his concerns with you about your performance. That shows he cares at least a little about how you are doing, and he also seems to care about how you're doing in the program in general. But people won't know how to help you or what the issue is if you don't tell them. I know it is frustrating, and not everyone will be understanding, but people might surprise you in a good way as well.\n\nThis doesn't make you stupid or untalented, I know plenty of students who just \"get through\" classes and then do good quality research later on. Good luck with things!",
      "author": "new_eclipse",
      "created": 1634748435,
      "upvotes": 1,
      "replies": {}
    }
  }
}