{"sid": "pon0fb", "link": "/r/GradSchool/comments/pon0fb/applying_to_a_new_phd_position/", "title:": "Applying to a new PhD position", "text": "I am a PhD student suffering from many related problems: an absent advisor that exists only in papers, lack of research activities, lack of experts around me, a very bad and non-healthy working environment, ...etc. Despite all that I managed to learn few things in my field and do research on my own at the point to write a paper and submit it. Recently I found another PhD position abroad in a country very known for its traditions in mathematics, and its very good universities and laboratories, the position is very appealing to me and I want to apply for it, and I would like to be advised in that matter in regards to some points, which are the following:\n\n\\- How can I motivate the fact that I want to resign from my actual PhD and go for another one? Even though I have my reasons but I find it somehow non-professional criticising my department and advisor, and this is what I have been told before.\n\n\\-How can I mention the issues that are pushing me to this change and be professional?\n\n\\-Anyone went through the same process? Please let me learn from your experience.\n\n\\-Are there any pieces of advice or tips that you would like to share with me, please?\n\nThank you so much in advance!", "author": "Mikahopff", "created": 1631699606, "retrieved": 1632844538, "over_18": false, "upvotes": 6, "upvote_ratio": 0.88, "comments": {"hcxy6t1": {"link": "/r/GradSchool/comments/pon0fb/applying_to_a_new_phd_position/hcxy6t1/", "text": "Just like PhD students often change labs and, consequently, their advisors, I don’t see a problem in applying for a different PhD program. Also, you don’t have to mention you are in a PhD program when applying for a new position. At the same time, if you are unsure your current program is not fit for you, you can let your advisor or the program’s chair, for instance, know about it. Mention your reasons. To me, it seems you are in no need of your advisor, or anyone for that matter, to carry on with your work. However, there must be something I am missing. In any case, if your advisor and other administrative personnel care about your academic success, then they will understand. In my case, my former advisor and I were not a match. We often disagreed, and I lacked his support on following my own ventures and research. My chair understood it and signed off on any required paperwork.", "author": "dlaesker", "created": 1631709114, "upvotes": 3}}}