{
  "sid": "qhql3e",
  "link": "/r/GradSchool/comments/qhql3e/need_help_deciding_whether_to_retake_toefl/",
  "title:": "Need help deciding whether to retake TOEFL",
  "text": "Hi everyone,\n\nThis is my first time posting to this subreddit, so I apologize if I am not following the norm. I have been writing SOPs for Ph.D. applications in Mathematics (Algebra).  The problem that has been bothering me like anything is that I recently took the TOEFL iBT test and scored a total of 108/120 with a 23 in Speaking. Now, I am eligible to apply to most of the universities I have been targeting except a few, for example, University of Oregon (Min. S: 26), University of Arizona (Min. S: 24), Northwestern (Min. S: 26). Since I have only one month to write SOP till the application deadline, I am a bit worried that if I retake TOEFL then I wouldn't have sufficient time and would end up writing a mediocre or bad SOP. Can somebody help me decide whether I should retake the TOEFL test, based on my profile. Here is a bit of information regarding my profile: \n\nTOEFL: 108/120; R: 30, L: 28, S: 23, W: 27\n\nGeneral GRE: 159 V, 168 Q, 4.5 AWA\n\nSubject GRE: Score awaited, would probably score around 800-850\n\nBachelor's and Master's University: Among top 10 institutes in India for Science\n\nGPA: 3.68/4.0, Major GPA: 3.78/4.0\n\nProjects: 1) Did a reading project in Differential Geometry in my 2nd year\n\n2) Survey of 'Local Fields' (3rd year summer project)\n\n3) An year long survey of Weil's paper on Algebraic groups where I learned about the theory of central simple algebras and Galois cohomology with a heavy focus on Galois descent.\n\nPlease let me know if you need any further info.",
  "author": "aroy9870",
  "created": 1635437928,
  "updated": 1635457616,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hiflnul": {
      "link": "/r/GradSchool/comments/qhql3e/need_help_deciding_whether_to_retake_toefl/hiflnul/",
      "text": "May want to post to r/Gradadmissions",
      "author": "werpicus",
      "created": 1635456277,
      "upvotes": 1,
      "replies": {}
    }
  }
}