{"sid": "kyu6vg", "link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/", "title:": "University of New Mexico Seeks to strip grad workers of right to form union", "text": "Hey all, PhD student at UNM here. It's a minority-serving institution in one of the poorest US states. We get $14k/year for 50% FTE and are forming a union so we can be part of the conversation on our wages. This post doesn't appear to violate the subreddit rules, so I wanted to share what's going on here:\n\n>In response to a petition for union recognition in December, the University of New Mexico has filed a motion seeking to strip graduate employees of the right to unionize under state law, reneging on its prior public commitment to respect the rights of graduate workers to organize. UNM claims that graduate workers are not employees and do not share a community of interest.  \n>  \n>In describing their new position to the state Labor Board, UNM cites a proposed rule from the Trump-appointed National Labor Relations Board (NLRB) that seeks to rob the union rights of graduate workers at private institutions, arguing that New Mexico should apply the Trump administration proposal to graduate workers at public universities in the state.\n\nStatement from the Union:\n\n>\"We decided to unionize in response to long-standing issues of job insecurity, inadequate benefits, excessive workloads, and low compensation that leaves many workers below the poverty line. We know that without our labor and the labor of other workers on campus, the university cannot function. We teach thousands of undergraduate students, grade and provide feedback on countless exams and essays, work on research to improve our communities, and much more.\"  \n>  \n>\"In October, UNM Provost James Holloway said in a statement to the Albuquerque Journal that **“the university recognizes the rights of our graduate students to decide to organize.”** Now, UNM is backtracking and claiming that we are not “regular employees” and that our right to collective bargaining should not be recognized. In describing their new position to the state Labor Board, UNM cites a proposed Trump administration rule that seeks to rob the union rights of graduate workers at private institutions, arguing that New Mexico should apply the Trump administration proposal to graduate workers at public universities in the state.\"  \n>  \n>\"As of today, nearly 1,000 graduate workers at UNM have joined the union because we believe that we are stronger together.\"\n\nAnyone can sign the union's petition here:\n\n[https://actionnetwork.org/petitions/sign-the-petition-unm-should-recognize-graduate-workers-right-to-unionize](https://actionnetwork.org/petitions/sign-the-petition-unm-should-recognize-graduate-workers-right-to-unionize)", "author": "SassySkeptic", "created": 1610840049, "retrieved": 1632953352, "over_18": false, "upvotes": 535, "upvote_ratio": 0.98, "comments": {"gjnmrpe": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjnmrpe/", "text": "You've got to love the \"graduate workers are not employees,\" except every single one of us has to go through the faculty/staff portal and take the same HIPAA/FERPA exams that state employees do.", "author": "Angry-Ewok", "created": 1610922021, "upvotes": 2}, "gjmtfdn": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjmtfdn/", "text": "Solidarity from Stony Brook!", "author": "Wu-Tang_Hoplite", "created": 1610909091, "upvotes": 1}, "gjmkijr": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjmkijr/", "text": "I interviewed for a PhD program at UNM that seemed promising, and now I'm glad I didn't take it. Big oof. \n\nSigned, good luck to y'all.", "author": null, "created": 1610906667, "upvotes": 2}, "gjmhexy": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjmhexy/", "text": "Jesus Christ, You guys are making $14k? Is that for all majors? We get paid $28k here in chemical engineering at the University of Houston and we don't even have a union. Not sure about economics here but that kind of salary is just disgraceful to the university and department. Hope you guys unionize.", "author": "CarlFriedrichGauss", "created": 1610905778, "upvotes": 1}, "gjmgmso": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjmgmso/", "text": "Signed! Solidarity from the University of Wisconsin–Madison.", "author": "SartreCam", "created": 1610905536, "upvotes": 1}, "gjm37d9": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjm37d9/", "text": "Signed! Wouldn't have made it through my program if not for the union", "author": "sixof14", "created": 1610901837, "upvotes": 1}, "gjlolgq": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjlolgq/", "text": "I’ve been a member of my graduate assistant union for three years and happily pay my dues for the union to negotiate my salary and support all graduate student workers. I’ve signed and support you!!", "author": "dawnfae", "created": 1610897959, "upvotes": 3}, "gjlntxe": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjlntxe/", "text": "This is going to be the new normal. Universities are taking a big hit on tuition and are looking for ways to make up the difference, and grad students lack a lot of the legal protections of \"real\" employees. Any university with a union and livable contracts will be trying to challenge those contracts under the Trump policies before Biden gets a chance to change those policies.\n\nRealistically what we need is to get these protections imposed on institutions by funding orgs, e.g. NSF or NIH grants can only pay for graduate student RAs if they get paid X amount and have XYZ benefits, AND the university must also apply these standards for all grad students in thesis-based programs. Established NSF/NIH minimum contracts for postdocs has been a major force for good, and we need to extend that to grad students as well.", "author": "tchomptchomp", "created": 1610897761, "upvotes": 9}, "gjl3wg1": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjl3wg1/", "text": "I hope this fails. You are students", "author": "FeistyHelicopter3687", "created": 1610891184, "upvotes": -25}, "gjks7m0": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjks7m0/", "text": "Isn't UNM a public university that receives federal and state funding? How are they trying to use a Trump-made policy that applies to private institutions?\n\nAlso, universities can't even factually argue that grad students don't work for them. We TA, we teach, we represent and promote our universities when we present and publish our research, and we are the reason faculty can get grants that generate large amounts of funding and advertisinf for the university. \n\nPaying grad students a livable wage should be a commom sense decision. The reason you pay grad students in the first place is so they aren't working other jobs and can perform research and publish papers in a timely manner and without distraction.  Part-time grad students don't get to do much research due to working so they can pay rent and eat, and most grants provide short-term funding. \n\nI am signing and supporting y'all.", "author": "ChurchOfJamesCameron", "created": 1610886764, "upvotes": 11}, "gjk7ddg": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjk7ddg/", "text": "Better call Saul!", "author": "blind-boi", "created": 1610875062, "upvotes": 3}, "gjk3xgb": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjk3xgb/", "text": "Signed!", "author": "yayitsjess", "created": 1610871586, "upvotes": 1}, "gjjwiwd": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjwiwd/", "text": "As someone who just finished their application to UNM, this is very worrisome. Signed and I hope this does not go through.", "author": "tinjinkin", "created": 1610865153, "upvotes": 3}, "gjjtmlt": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjtmlt/", "text": "Did my BA in econ at UNM, I’m so sorry to see the university try to shaft you. Signed. Wishing you the best!", "author": "JustTryingToRant", "created": 1610863006, "upvotes": 3}, "gjjscoh": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjscoh/", "text": "Solidarity from OSU", "author": "mjsielerjr", "created": 1610862101, "upvotes": 4}, "gjjofsh": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjofsh/", "text": "Just signed! Are you guys in touch with Nick Estes? He has a huge following and I’m sure would signal boost the petition.", "author": "ohsideSHOWbob", "created": 1610859511, "upvotes": 10}, "gjjmb7t": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjmb7t/", "text": "Solidarity from Buffalo, we had the same deal but organizing and protests successfully got us to a base of $20k just two years ago. It can be done! Don’t give up ⚡️", "author": "NarciSZA", "created": 1610858184, "upvotes": 16}, "gjjljzw": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjljzw/", "text": "I'm very thankful that my university already had a strong graduate union when I started. I hope UNM graduate students prevail and form a union.", "author": "schroedingersmeerkat", "created": 1610857735, "upvotes": 12}, "gjjlcwt": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjlcwt/", "text": "Can’t say I’m surprised, living in Socorro and going to Tech, it’s always the same story: UNM can’t get out of its own way, is greedy, and mismanaged. \n\nWish y’all the best.", "author": "Rushderp", "created": 1610857620, "upvotes": 15}, "gjjk57p": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjk57p/", "text": "Signed and solidarity from Philly. Graduate students are among the most exploited class of workers. Union efforts have made my life a little better as a graduate student.", "author": "gestalt_switching", "created": 1610856936, "upvotes": 25}, "gjjju12": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjju12/", "text": "My state doesn't recognize unions of any kind... still with you in solidarity!", "author": null, "created": 1610856765, "upvotes": 9}, "gjjdskx": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjdskx/", "text": "The US government has a long history of wanting to pipe grad students. My aunt was a microbio grad student in the 80s, and they decided to tax her as a contractor, i.e., pay income AND payroll tax. Keep in mind that all of the work you do at the university is under the assumption that you are an employee. Your name may be on what you accomplish, but they take ownership of any valuable IP.", "author": "schweppes-ginger-ale", "created": 1610853555, "upvotes": 51}, "gjjd7c6": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjd7c6/", "text": "Signed! Thank you for sharing. I got my BA at UNM and hate to see this happening.", "author": "saffronnectar", "created": 1610853233, "upvotes": 14}, "gjjbzk5": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjjbzk5/", "text": "Solidarity from Portland! Just shared this to our union’s Slack channel. We’ll get the word out best we can. Keep up the good fight!!!", "author": "Shootslasersatrocks", "created": 1610852562, "upvotes": 44}, "gjj5qby": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjj5qby/", "text": "From UAW 2865, signed! Solidarity from California.", "author": "doomparrot42", "created": 1610849179, "upvotes": 65}, "gjivg26": {"link": "/r/GradSchool/comments/kyu6vg/university_of_new_mexico_seeks_to_strip_grad/gjivg26/", "text": "Thanks for sharing, solidarity with you all! I hope the administration doesn't get away with that shit", "author": "acid_zaddy", "created": 1610843643, "upvotes": 115}}}