{
  "sid": "r38vjb",
  "link": "/r/GradSchool/comments/r38vjb/who_do_i_talk_to_about_money/",
  "title:": "Who do I talk to about money",
  "text": "Hey Hi Hello,\n\nI’ve recently submitted my applications for a few PhD programs and a couple MA programs. I’ve been kind of stressed about going into a program as a low-income candidate.\n\nWho do I talk to about need-based grants and scholarships? I guess anywhere to get money. I really don’t know about that stuff. I’m afraid to ask professors because I feel like they’ll look down on me for not already know what grants and stuff I want to apply to. Most grad students I’ve spoken to have money from previous work, merits, or familial contribution. \n\nI do have money saved up, and luckily don’t have any loans from undergrad. But I’m really unsure who to talk to or where to look for grants. Am I too late on applying for most grants/scholarships/fellowships/etc? \n\nAny resources/advice would be great. Thank you T-T",
  "author": "SlothTheScientist",
  "created": 1638000486,
  "updated": 1638207986,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hmau53y": {
      "link": "/r/GradSchool/comments/r38vjb/who_do_i_talk_to_about_money/hmau53y/",
      "text": "Did you do your FAFSA? You may be eligible for things like FWS as a masters student (I was).\nYou can also just ask admissions or a program director if there are internal grants or scholarships you can apply to. They should know what is available at their program. You may not be able to apply to grants before being accepted. \nMany PhDs are fully funded  and you should NOT go to one that isn't, so this will mostly be an issue for masters programs.",
      "author": "public_health_nerd",
      "created": 1638037365,
      "upvotes": 3,
      "replies": {
        "hmc7daz": {
          "link": "/r/GradSchool/comments/r38vjb/who_do_i_talk_to_about_money/hmc7daz/",
          "text": "Yeah, I have my FAFSA complete. I haven't heard of FWS, I'll look into that. Yeah that makes sense that admissions and other program roles would know what grants/scholarships there are. I'll reach out to them. Yes, all PhD programs I'm applying to are fully funded. The masters program I'm applying to does have potential TAships but it's not guaranteed. Thank you for the info!",
          "author": "SlothTheScientist",
          "created": 1638058623,
          "upvotes": 1,
          "replies": {
            "hmd5w65": {
              "link": "/r/GradSchool/comments/r38vjb/who_do_i_talk_to_about_money/hmd5w65/",
              "text": "FWS: Federal work study\nThe government pays most of your wage up to a certain threshold, so it is easier to get interesting paid gigs that align with your goals.",
              "author": "public_health_nerd",
              "created": 1638075667,
              "upvotes": 2,
              "replies": {
                "hmd6kbj": {
                  "link": "/r/GradSchool/comments/r38vjb/who_do_i_talk_to_about_money/hmd6kbj/",
                  "text": "Oh! that’s really neat, thank you!",
                  "author": "SlothTheScientist",
                  "created": 1638076046,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}