{
  "sid": "qjtqj8",
  "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/",
  "title:": "How do you present things confidently?",
  "text": "I have an annual review and unrelated project presentation coming up and I realise my public speaking/presenting skills are very sub par.\n\nDoes anyone have some tips on how to confidently present and answer questions in an academic setting? I often freeze up if asked a difficult question and I occasionally blank tbroigh nervousness too :(",
  "author": "Weekend_metalhead",
  "created": 1635699598,
  "updated": 1635780425,
  "over_18": false,
  "upvotes": 59,
  "upvote_ratio": 0.96,
  "comments": {
    "hisc981": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hisc981/",
      "text": "I feel you, friend! My first ever conference, I got a question from a hostile-ish listener and I totally froze. Didn't even know what they asked in the first place let alone answer it. Lol.\n\nI decided to learn from other speakers, see how they reacted to (tough) questions, how they formulate the answers etc. Starting with that is an interesting question, thank you, is a good idea; it gives you some precious seconds to think about a potential answer and sometimes just speaking a few words kickstarts your brain into action. Another possibilty is to say something along the lines of thank you for the question, I had not considered this line of thinking but will be sure to examine it in the future (even if you don't), or this is a very contentious issue in the literature because xyz and these are some options they mention, but for reason zyx it can't currently be resolved...\n\nHope this helps! I'm not an expert on public speaking at all, and the pandemic didn't help my budding skills, but I have learned a lot in the past three years since my first conference.",
      "author": "opheliazzz",
      "created": 1635701742,
      "upvotes": 37,
      "replies": {}
    },
    "hiskkuy": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hiskkuy/",
      "text": "Knowing how to respond to stuff you don't know graciously while acknowledging that you, in fact, just haven't thought of that, as u/opheliazzz points out, is a key thing to know. Having that in your back pocket can help take the edge off.\n\nBut there is no substitute for simply rehearsing your presentation. Pretend you have a full audience in front of you (whatever that means for you, it could be 30 people or 300). Give your presentation out loud, in full setences, presentation slides and all--no shortcuts!--before this imaginary audience.\n\nThen do it at least six more times.\n\nYou won't necessarily \\*feel\\* less nervous or more prepared. (The literature on speaker apprehension tells us that people appear to be much less nervous as perceived by audiences than those people feel internally when speaking.) But you will in fact be more prepared.",
      "author": "toberrmorry",
      "created": 1635705276,
      "upvotes": 22,
      "replies": {
        "hiv5nku": {
          "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hiv5nku/",
          "text": "Yep, you can't skip on being well prepared. Goes without saying",
          "author": "opheliazzz",
          "created": 1635758140,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hisnn5j": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hisnn5j/",
      "text": "Write down the question (or keywords that are part of it) as it is being asked to you. Like writing lecture notes, it helps your mind focus on what's being asked, and sets your mind to start connecting essential words, concepts, ideas, and potential responses. When you're nervous, your mind can't juggle as many things at once: by writing the question down, you also don't have to waste precious bandwidth trying to hold the question in your mind, and can focus on coming up with the answer instead. This works even better when the questioner uses way more words than necessary to ask their question, or uses time after the question to start rambling on their own ideas about the topic, during which you can basically tune them out and get a head start on thinking through responses.",
      "author": "Timmyc62",
      "created": 1635706558,
      "upvotes": 7,
      "replies": {}
    },
    "hisph8a": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hisph8a/",
      "text": "On presenting confidently: practice helps a lot! Both for practising your particular presentation, and also presenting more often. I started doing outreach just to practice talking to an audience as the idea terrified me, and it helped a lot.\n\nFor answering difficult questions... Well, I still suck at it! I've never been good at thinking on my feet or under pressure, let alone in front of an audience and on a difficult topic. I also have a terrible habit of assuming I don't know the answer and panic and try to justify why I don't know it. I still run on nervous autopilot during question time. Taking a deep breath and taking time to think, and rephrasing the question back to the asker to make sure I understand what they're asking, can help calm. I still usually struggle with answering but the world hasnt ended yet and I'm the only person who seems to remember my fails. So that's something!\n\nEdit: being a good speaker seems to redeem my uselessness at answering questions. I put a lot of time and effort into my presentation anyway, but that helps me feel better to balance out how bad I felt about answering questions.",
      "author": "ADPhD-hi",
      "created": 1635707319,
      "upvotes": 5,
      "replies": {}
    },
    "histt4m": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/histt4m/",
      "text": "As others have said, practice! One thing that really boosted my confidence though was having someone who I could trust to give harsh critique. I started off really bad at presentations and because my mentor was able to tell me exactly what I was doing wrong, I learned how to incorporate that into my presentations and got better and better over time. It's also the best confidence booster when a harsh mentor tells you you've done a great job - then you know they really mean it.",
      "author": "peladine",
      "created": 1635709101,
      "upvotes": 4,
      "replies": {}
    },
    "hit33ty": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hit33ty/",
      "text": "Try and answer the question as best you can quickly or just say something like \"That's really interesting, maybe we can talk about this question more after the session.\" I'd say from watching a lot of talks in academia by now that most of the time people don't understand the questions being asked of them, and the most of the time the asker doesn't understand the answer given to them in response, and 99% of people just say \"thank you\" no matter what you say in response and everyone moves on with their day.",
      "author": "bigvenusaurguy",
      "created": 1635712998,
      "upvotes": 4,
      "replies": {}
    },
    "hitki1q": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hitki1q/",
      "text": "I'm super interested in my research and I view my audience less as people I need to impress but more my captives who are being forced to listen to me bc no one else in my life will let me talk about my work for 50 minutes",
      "author": "EmmasDragon",
      "created": 1635721151,
      "upvotes": 3,
      "replies": {}
    },
    "hiss0jv": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hiss0jv/",
      "text": "if you're presenting to a research group or a group of similar small size, then knowing your audience is pretty important. i would guess potential questions my previous advisors could ask with a pretty high accuracy, since they tended to dwell on details and connecting key features to topics i should have (and generally did) learn in class. now with my new advisor, i asked around his current and previous phd students what he'd look out for during presentations, and i did reasonably well for my first time. so yeah, get to know your audience.\n\nsecondly, as others have already pointed out, practice. make mental notes of what to point out in your slides. personally, i don't like to present with prepared speeches since they tend to come out unnatural, and the structure of my speech could be at risk if someone were to ask a very 'destructive' question. so i tend to go with a somewhat planned flow, if that makes any sense.",
      "author": "HLA-AIRE-VIT1",
      "created": 1635708367,
      "upvotes": 2,
      "replies": {}
    },
    "hisvnuz": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hisvnuz/",
      "text": "I have a tendency to get nervous when I'm presenting too. So far, the best thing I have found is to just take a couple deep breaths if I notice myself getting too shaky or speaking too fast. I used to worry about creating awkward pauses, but it's much less awkward to take a moment to compose yourself between slides than to keep going and getting more nervous.\n\nAlso, if someone asks a question I don't know, I do one of two things. My first choice is to answer a similar question if possible. If someone asks a question about one set of data and I know the answer for another set, I might mention that and draw a comparison. Otherwise, if I'm really unsure, I try to be upfront about it. If it's a good idea I hadn't thought of, I'll say that as well. People will generally be more understanding of that than some bs answer, and it also prevents people from asking further questions about any bs.",
      "author": "new_eclipse",
      "created": 1635709868,
      "upvotes": 2,
      "replies": {}
    },
    "hisxo3p": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hisxo3p/",
      "text": "Prof here now. Had extreme speaking anxiety during undergrad well into grad school. I still have generalized anxiety. \n\nAnyway, I've posted a few things about this AND I'll be making a video specifically focusing on this as soon as I can get time to do so between grading/video lectures. \n\nLink is below. I hope there might be something helpful there. If not, you might give r/PublicSpeaking a look. \n\n[https://www.youtube.com/c/DigitalPedagogy01/videos](https://www.youtube.com/c/DigitalPedagogy01/videos)",
      "author": "Mtt76812",
      "created": 1635710711,
      "upvotes": 2,
      "replies": {}
    },
    "hit0udw": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hit0udw/",
      "text": "The only proven way is to do it a lot.  The first dozen or so presentations will always feel awkward and uncertain.",
      "author": "drzowie",
      "created": 1635712028,
      "upvotes": 2,
      "replies": {
        "hit3bq1": {
          "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hit3bq1/",
          "text": "You know you've made it in your field when you can cobble together your boiler plate half hour talk with some stale figures and slides sitting on your computer in about a half hours time.",
          "author": "bigvenusaurguy",
          "created": 1635713093,
          "upvotes": 1,
          "replies": {
            "hit48dr": {
              "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hit48dr/",
              "text": "Absolutely!  In the old days before PowerPoint, we used to joke (only serious) about the importance of designing transparencies so you could re-use them.",
              "author": "drzowie",
              "created": 1635713497,
              "upvotes": 2,
              "replies": {
                "hitsecm": {
                  "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hitsecm/",
                  "text": "Wow transparencies. That takes me back….",
                  "author": "dramaturgicaldyad",
                  "created": 1635725182,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiu1abw": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hiu1abw/",
      "text": "I pretend I’m someone who is not nervous. Maybe that sounds lame, but I ask myself “How would a confident person act?” Then I try to embody their tone of voice, speed of delivery, etc.",
      "author": "rumorgoingaround",
      "created": 1635729760,
      "upvotes": 2,
      "replies": {}
    },
    "hisdlqq": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hisdlqq/",
      "text": "Something that boosts my confidence is the quality of my presentation. Your content can lack quality, but your presentation doesn't. Fill it with gifs, pictures, art, make it look fun, intuitive, and interactive. It boosts my confidence knowing I actually am presenting something that looks fun.",
      "author": "grothendieck1",
      "created": 1635702388,
      "upvotes": 2,
      "replies": {}
    },
    "hitcxiq": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hitcxiq/",
      "text": "1. Go ahead and announce that you're a bit nervous and to please be patient. Once it is out in the open you don't have to try to hide it and that is often a huge weight off your shoulders.\n2. repeat the question in your own words and ask if you understood the question correctly.\n3. don't bs an answer, if you don't know, say that you don't know and will look into it or would love to talk to the asker after to discuss it further.\n4. if you can't answer a question in 2 minutes or less, try to present a summary of a complex answer and then ask the person if they would like to discuss it further afterward.",
      "author": "JenAnnMad",
      "created": 1635717463,
      "upvotes": 2,
      "replies": {}
    },
    "hisxao4": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hisxao4/",
      "text": "If you don't understand the question asked don't be afraid to ask for clarification. I also usually end with \"does that answer your question?\" or \"I'm not sure if that answers your question?\" if I'm not totally sure.\n\nAs someone else said, I also will say \"that's a good question, I actually don't have an answer for/hadn't though of\" and people are usually pretty understanding about that. I usually try not to BS answers too much because I've see situations where speakers try to do that and step backwards into opening themselves up to more questions based on something included in their answer.\n\nIf you want to stall and are tripped up by a question you can also always ask them to repeat it.\n\nI should add that I get super nervous presenting too and haven't mastered most aspects of it, but question & answer usually goes better than expected in my experience (if only because I tend to expect the worst). You can always have someone review your presentation ahead of time to give you some ideas about what questions may arise, or you can try to anticipate them yourself and then prepare answers for the ones you think are likely to come up (though often will end up being pretty random vs. expectations).",
      "author": "wknd_worrier",
      "created": 1635710554,
      "upvotes": 1,
      "replies": {}
    },
    "hit29zx": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hit29zx/",
      "text": "I know this is much easier said that done, but my honest advice is to just relax! Think of your presentation more as a conversation, like you just have some interesting thoughts to share. Don’t have a script ready, don’t rush, speak slowly and take your time; before moving on look at your slides and think critically about what you want to say and get across. Let some silences happen, it’s hard for someone watching to keep up with people talking fast with no breaks. With regards to questions, just be honest! Think about what was asked and answer directly, take a few moments to consider the question and repeat it if necessary. \n\nTl;dr: try your best to approach it as a casual, lighthearted conversation. You will have a good time and your audience will probably have a good time too!",
      "author": "gradthrow59",
      "created": 1635712640,
      "upvotes": 1,
      "replies": {}
    },
    "hiu9ygd": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hiu9ygd/",
      "text": "My University has an office called the \"Career Center\" where they help you develop your CV and host professional development seminars. One service they offer letting you present to them so they can offer you feedback and give you tips for staying calm as you present. You might see if something similar is offered at your institution.\n\nEdit: One thing I do is practice answering questions I might be asked (no matter how closely related or off topic), so if I blank when I'm on stage I have some sort of mental template of how to respond. It sounds silly, but surprisingly it helps me out.",
      "author": "Current_North1366",
      "created": 1635734269,
      "upvotes": 1,
      "replies": {}
    },
    "hivkhz0": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hivkhz0/",
      "text": "Practice your presentation and convince yourself that you’re presenting the best thing since that guy who proposed iPhones. If it seems like you’re enthusiastic enough and you believe it, then other people will believe it. The other thing is being able to anticipate questions + doing the prior reading that could allow you to at least guess / generate discussion regarding people’s questions. It doesn’t have to be the right answer, but it does have to sound like you’re a thoughtful critical thinker.",
      "author": "soundstragic",
      "created": 1635769738,
      "upvotes": 1,
      "replies": {}
    },
    "hiw0rpo": {
      "link": "/r/GradSchool/comments/qjtqj8/how_do_you_present_things_confidently/hiw0rpo/",
      "text": "I use a script and practice. I also try to distract myself by being anxious about something unrelated (somehow that makes me relax when presenting because it isn’t what I’m focused on haha), and then I end up speaking better lol.",
      "author": "medusawakened5",
      "created": 1635778055,
      "upvotes": 1,
      "replies": {}
    }
  }
}