{"sid": "pio8tw", "link": "/r/GradSchool/comments/pio8tw/is_it_normal_to_feel_bitter_towards_people_who/", "title:": "Is it normal to feel bitter towards people who receive a lot of help from their advisors?", "text": "I'm currently a master's student looking to apply for PhD programs for fall 2022. My field's CS and I've already had an unsuccessful application round for 2021. I'm in ML as well, btw.\n\nAs probably anybody in any research field knows, CS is extremely competitive and ML is particularly competitive within CS. I hear stories of even undergraduate applicants who have first-authored publications in prestigious conferences and journals. As a master's student who still doesn't have one of those, I feel very inadequate.\n\nWhen I talk with students who are able to achieve first-authored publications within their undergrad or master's, one common denominator seems to stand out: they receive a lot of high-quality guidance from their advisors.\n\nI'm not trying to discredit these people's efforts, but I think anyone in this industry can agree how important your advisor is. My advisor is pretty much absent and is more focused on making products for his startup than he is research. Most of the work from our lab gets published when there's another advisor figure from another lab or school that we're collaborating with and my advisor doesn't exactly participate but has his name on the list of authors since he provides the funding.\n\nIt sucks because when I spoke with some faculty members last round they told me \"you'll be graduating with a master's and you still don't have a first-authored publication\" to which I rarely have anything to say.\n\nIt's unhealthy and pointless to feel bitter about this reality but I'm not sure what else I should be feeling. Anyone else go through this? I'm not sure how common this would be.", "author": "Seankala", "created": 1630886275, "retrieved": 1632953004, "over_18": false, "upvotes": 15, "upvote_ratio": 0.9, "comments": {"hc0314h": {"link": "/r/GradSchool/comments/pio8tw/is_it_normal_to_feel_bitter_towards_people_who/hc0314h/", "text": "This is exactly why looking at the publication records of undergrads is a terrible metric for how good someone will be as a graduate student. There are so many factors that feed into whether or not they have a publication record, such as the advising, generosity of the others with authorship, and just the luck of how successful their project ended up being. I have had faculty tell me that they don't care about publication records for PhD applicants (even if they have a masters), and care far more about the letters of recommendation and a history of research experience.\n\nI myself had extensive undergrad research experience and was in a masters degree when I applied to PhD programs - with no publications. Heck, my research experience was all neuroscience and human subjects work, not the robotics I was applying for. I still got into every program I applied to, and I'm now less than a year away from getting my PhD in CS. There's a huge amount of luck involved, but don't count yourself out.", "author": "pterencephalon", "created": 1631062200, "upvotes": 2}, "hbrqmrv": {"link": "/r/GradSchool/comments/pio8tw/is_it_normal_to_feel_bitter_towards_people_who/hbrqmrv/", "text": "I can understand the feeling.  But in the end it's just different qualities in advisors.  There are a lot of famous intelligent professors out there who aren't the best in advising, whereas there are also a ton of people who put effort into advising.  \n\nIt also depends on who you work with and what kind of research style they have.  Most I've experienced are those who require direct questions instead of generalized \"what should I do\".  I ended up having to advise and provide guidance to a few other grad students when they felt their advisors weren't helpful.  \n\nAsk for resources.  Ask a more senior grad student for guidance.  Restructure your questions to hit the target of what you need answered.  It just means you have to do more leg work to understand the literature and what you need to do.", "author": "HalfEatenPie", "created": 1630900864, "upvotes": 4}, "hbr39rt": {"link": "/r/GradSchool/comments/pio8tw/is_it_normal_to_feel_bitter_towards_people_who/hbr39rt/", "text": "I'm not in your field, but I was a post-bacc researcher and had a terrible advisor. The most productive I ever was was when I had a post doc in the lab who could give me clear guidance. My performance pretty much tanked once that post doc left for a faculty position. A lot of my peers got like 1 publication out of their post-bacc experience, I got none. \n\nThere's no point in feeling bitter, but I definitely felt it too. Actually, I really really resented my PI for how absent they were and how much they lacked any ability to communicate clearly or even communicate at all, all while I was busting my ass and giving my work far too much emotional energy.  \n\nI had to really hone in on how this wasn't about me. My PI honestly was just a dysfunctional person. At some points I felt empathy for how much I could tell they were struggling with basic management tasks. In the end I decided I needed to quit, and the second I was free all my resentment was gone. That probably won't help you, but maybe what would is trying to foster some collaborations so you can get the guidance you need. While its true you're experiencing a hard situation, this situation isn't happening *to* you, nor is it about you as a person. You deserve an attentive advisor, but in the absence of it you really have to sit down and get creative about how you can chase after the mentorship you need because I promise this won't be the last time this happens in your career.", "author": "caoutcouc1231", "created": 1630888999, "upvotes": 8}}}