{
  "sid": "pmzvho",
  "link": "/r/GradSchool/comments/pmzvho/questions_for_those_in_a_healthcare_related_grad/",
  "title:": "Questions for those in a healthcare related grad program.",
  "text": "Hey everyone! I will be starting my graduate school program tomorrow in a healthcare related field and am incredibly nervous. My program isnt structured like a traditional degree based program and has a lot of practicum involved compared to course work.\n\nThe break down involves 3 classes on one day followed by 40 weeks of placement in order to gain skills to fulfill certain indicators to become an entry level dietitian. I have worked extensively hard to get here and I am keep hearing mixed reviews about grad school and have some questions.\n\n1. I hear that some people say it is easier than undergraduate while some people say it is more difficult but not impossible. Our cohort is only 25 students so I wanted to hear peoples opinion on that.\n\n2. How did you manage doing readings, research, assignments, and practicum or other work related obligations along with social life? I am scared I wont have time for doing things like hanging out with friends or relaxing during my grad year. \n\n3. What tips would you have for someone who is just starting? My profs all feel very kind and confident and have heard from them and recent graduates that you have to try to actually fail out of the program. I wanted to see if anyone had specific tips that could help. It could be with readings, mental health, stress management, placement etc.\n\nAny help is much appreciated!",
  "author": "GrimR3eaper99",
  "created": 1631476658,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hcpoe2h": {
      "link": "/r/GradSchool/comments/pmzvho/questions_for_those_in_a_healthcare_related_grad/hcpoe2h/",
      "text": "Hey, figured I'd chime in on some of your questions:\n\n1. I would say graduate school in the health sciences (and in any field to be honest) is more difficult than undergrad. Not necessarily because of the workload per say, but more so because of the higher level of thinking you are expected to achieve. You aren't just going to be memorizing and reciting material anymore. You now have to process all of this information, form your own opinions about it, and then defend it. It's great that you have a cohort with you! It makes starting off easier in that you get to see the same people every week. Try to make connections with them and make some friends! It'll definitely help you get through your program!\n2. It's definitely doable to juggle all of your obligations and still have a social life. If you don't already have some system in place to plan out your time (e.g. bullet journal, online calender, etc.), set one up now. Also, not everything is going to be a priority. Sometimes \"good enough\" is all that you need to do to get the task done. Definitely do not skip out on social/you time. I take Saturdays off from work. You may not be able to do that, but at least find some time in your week to recharge.\n3. Some tips that I have include:\n   1. Get into the habit of reading articles. The more you read and get familiar with the literature, the easier it will be to put your work into context. It'll also make reading manuscripts easier.\n   2. Take advantage of all the resources your university offers! You'd be surprised how much they give you for free or reduced price.\n   3. Try to build a good relationship with your advisor or whoever is helping you along in your program\n   4. Have a life outside of your studies. \n   5. Have fun! Grad school is a journey and will make you grow a lot. Enjoy the process!\n\nI'm going to go back to my own work, but I'm happy to answer some more questions if you have them.",
      "author": "BrownBear_96",
      "created": 1631553341,
      "upvotes": 1,
      "replies": {
        "hdi0kif": {
          "link": "/r/GradSchool/comments/pmzvho/questions_for_those_in_a_healthcare_related_grad/hdi0kif/",
          "text": "Hey Brownbear thanks for the response and sorry for the delay.\n\nI am definitely more nervous now than I was in undergrad since I mainly have to create a bunch of material and not just regurgitate it. I just worry that my school projects are going to be not good enough and I have a constant fear of failing.\n\nNo one has every failed out of this program but I just get nervous thinking about all of this content I have to produce.",
          "author": "GrimR3eaper99",
          "created": 1632079577,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064593
}