{
  "sid": "r3q4rv",
  "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/",
  "title:": "Do I include an abstract on my PhD application?",
  "text": "Finishing up my CV for my PhD application due in a couple of days. I'll have a manuscript published in the next few weeks, so unfortunately that means my only publication as of now is a 250 word abstract, in which I am listed as a corresponding author. Is this appropriate to include on my CV?\n\nAdditionally, my recommenders have made sure to mention my in-progress manuscript in their letters, but should I notify the schools once that is formally published? If so, how?\n\n\\- A PhD hopeful with zero guidance :)",
  "author": "sarahdarah123",
  "created": 1638056366,
  "updated": 1638207974,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hmcevkj": {
      "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmcevkj/",
      "text": "If you haven’t submitted this paper for a journal to review then you can only list it under your research experience on your CV, and not a publication or publication in review, because as it stands, it is neither. It is not necessary to inform the schools once the paper is published because it’ll probably already be past the deadline to submit your application, and they don’t let you add more information to your application.",
      "author": "physics_masochist",
      "created": 1638062125,
      "upvotes": 2,
      "replies": {
        "hmcmt2p": {
          "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmcmt2p/",
          "text": "Understood! However I was wondering whether I should include the abstract (entirely unrelated to the manuscript), which has already been published. I'm just unsure whether it's normal practice to include abstracts or not😅 appreciate the help!",
          "author": "sarahdarah123",
          "created": 1638065892,
          "upvotes": 1,
          "replies": {
            "hmcs6yf": {
              "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmcs6yf/",
              "text": "How/where is the abstract published?? This seems really odd to me. Maybe it's something specific to your discipline? My guess is that no, you shouldn't include this on your CV. But I don't think I really understand the situation well enough.",
              "author": "ucscpsychgrad",
              "created": 1638068537,
              "upvotes": 1,
              "replies": {
                "hmcvkcr": {
                  "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmcvkcr/",
                  "text": "The journal of diabetes.. however based on what I am hearing I think it sounds like it should probably not be included. Will leave it off for now. Thanks so much for the advice!! :)",
                  "author": "sarahdarah123",
                  "created": 1638070224,
                  "upvotes": 1,
                  "replies": {
                    "hmd3d54": {
                      "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmd3d54/",
                      "text": "This helps clarify, thanks!\n\nMy impression then is that this is a published abstract of a presentation you gave at something? (Or will give?)\n\nIf so: I think the abstract maybe shouldn't go on your CV, but the presentation definitely should!\n\nMy impression is also that this is a relatively uncommon thing that most disciplines/conferences/journals don't do. Most commonly there's just no direct connection between conference presentations and journal articles. Some conferences in some fields publish full papers from conferences as \"Conference Proceedings,\" which are essentially the same as journal articles.\n\nBelow are some more informed previous threads on this more specific issue. Sounds like opinions are varied and some folks do feel like this is worth including on a CV, but clearly marked in its own section.\n\n[https://www.reddit.com/r/labrats/comments/bp4b8e/is\\_a\\_published\\_abstract\\_considered\\_a\\_publication/](https://www.reddit.com/r/labrats/comments/bp4b8e/is_a_published_abstract_considered_a_publication/)\n\n[https://academia.stackexchange.com/questions/54087/could-a-paper-thats-just-a-title-and-abstract-be-listed-as-a-publication-in-cv](https://academia.stackexchange.com/questions/54087/could-a-paper-thats-just-a-title-and-abstract-be-listed-as-a-publication-in-cv)\n\nIdeally, you might find some other folks working in this specific field and chat with them about how they handle this on their CVs.",
                      "author": "ucscpsychgrad",
                      "created": 1638074275,
                      "upvotes": 1,
                      "replies": {
                        "hmd60zx": {
                          "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmd60zx/",
                          "text": "I probably got more interested in this than there is any reasonable reason to, but... \n\nHere's one example of a professional CV where the last thing listed does appear to be a meeting abstract: [https://library.med.nyu.edu/api/publications/?person=gallam08](https://library.med.nyu.edu/api/publications/?person=gallam08)\n\nAnd this looks to me like a full section of a profile listing similar kinds of meeting abstracts under a \"Conference Proceedings\" section: [https://profiles.stanford.edu/priya-prahalad?tab=publications](https://profiles.stanford.edu/priya-prahalad?tab=publications)",
                          "author": "ucscpsychgrad",
                          "created": 1638075742,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hmd6di5": {
              "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmd6di5/",
              "text": "Well you wouldn’t put the abstract, just the title of the soon paper, and this would go under your research experience section. You generally don’t put the actual abstract on a CV",
              "author": "physics_masochist",
              "created": 1638075939,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmdhqf7": {
      "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmdhqf7/",
      "text": ">I'll have a manuscript published in the next few weeks,\n\nHas it already been accepted for publication, you know the publication date?\n\nIf so you can list it under publications and put \"Accepted\" at the end the listing.",
      "author": "raistlin65",
      "created": 1638083138,
      "upvotes": 2,
      "replies": {}
    },
    "hmecnr7": {
      "link": "/r/GradSchool/comments/r3q4rv/do_i_include_an_abstract_on_my_phd_application/hmecnr7/",
      "text": "Here’s how i do it:\n**my fucking name**, co-worker I respect, et. al. “Full title” *official journal abbreviation*, year [either in preparation, submitted, in review or accepted] \n\nIn prep means I have a half written article on my google drive somewhere :)\n\nSubmitted means I just sent it in and the editors didn’t have time to do desk reject yet.\n\nIn review means, I sent it in and haven’t heard anything for over a week so I guess it’s in review.\n\nAccepted means I’m sending in high rez pics etc. (science is sound)\n\nAnother option is to put you manuscript in an online archive, ie preprint\n\nToot your own horn; no one else will!\n\nOne more hint - if you ever do joint first authorships make sure you write somewhere in acknowledgements that the co-first authors may put their own name first in any personal use documents, ie cv/resume!",
      "author": "LowCommercial9845",
      "created": 1638106271,
      "upvotes": 1,
      "replies": {}
    }
  }
}