{"sid": "hsl7rb", "link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/", "title:": "On PhD, Covid, and Why You Shouldn't Buy a House While Writing Your Dissertation", "text": "Y'all, I'm so close. I defend on August 6th, but it feels like an eternity. I've been basically existing on coffee and anxiety. I turn in my dissertation in one week! \n\nAmidst this, my husband and I started looking at houses with intent to buy after I get settled into my job. Lololol we liked a house, put in an offer, and got it like idiots. Don't get me wrong, we're so lucky to have found a place, but the crazy market here made this happen much faster than we expected. My husband has been an absolute saint dealing with everything house related while I write/have panic attacks, but today the bank needed verification of employment from the university. I had just sat down to work when my (still saintly, if not poorly timed) husband reminded me. Thanks to Covid, the HR department was only open Monday and Thursday, so this had to happen today. I may or may not have had a panic attack getting ready to leave because I had work to do obviously! \n\nIt's just the absolute dumbest things that make me insane right now, and I'm pretty done with it. May my experience be a warning for you all. And may the committee gods be generous.", "author": "PurplePhysics", "created": 1594943444, "retrieved": 1632954176, "over_18": false, "upvotes": 328, "upvote_ratio": 0.96, "comments": {"fye5787": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fye5787/", "text": "lol\n\nWe bought a house last year (closed in October) and then had to do extensive renovations before we could move into it. We moved in end of January and lived in the upstairs as the main floor continued to be worked on. The house wasn't done until May - well into COVID-19 closures. To make matters worse - when our main floor (where the kitchen is) was done - none of our appliances (dish washer, fridge, or range) worked!\n\nThat was all during my last semester of course work. Now I'm starting my dissertation, hoping to defend my proposal in October.\n\nI will add, having a house, picking out wall colors, cabinets, tiles, etc has been fun.", "author": "rlpw", "created": 1595015257, "upvotes": 2}, "fyd2fun": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fyd2fun/", "text": "I bought a place last July and it was truly a nightmare as a student. They didn’t recognize my casual income and it was a constant back and forth. A year later I wouldn’t trade it for the world. It won’t be easy but it’ll be worth it. Good luck ❤️", "author": "smzzzy", "created": 1594996340, "upvotes": 2}, "fyd14i6": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fyd14i6/", "text": "It was actually cheaper for me to get a house with 4 bedrooms than it was to rent a 2 bedroom apartment in terms of mortgage vs rent and homeowners vs renters Insurance.\n\nThis town is wierd.", "author": "Lord_Blackthorn", "created": 1594995680, "upvotes": 4}, "fyc3nxr": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fyc3nxr/", "text": "I also bought a house mid PhD. In another city from my university. All on the condition that my boyfriend does all the physical work and I live upstairs in the study. Well, we broke up during covid and now it's all my responsibility. I move today.", "author": "denimbastard", "created": 1594967682, "upvotes": 73}, "fybwuko": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fybwuko/", "text": "Take it from me, don’t have a kid while writing your dissertation", "author": "Juggernaut1210", "created": 1594962013, "upvotes": 41}, "fybwpqz": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fybwpqz/", "text": "[deleted]", "author": null, "created": 1594961910, "upvotes": 7}, "fybtqno": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fybtqno/", "text": "You've got this!", "author": "wabisabicloud", "created": 1594959717, "upvotes": 3}, "fybs6ke": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fybs6ke/", "text": "Did the deal go through yet? If not, maybe consider waiting until the market crashes and get in when the market is more favorable. If the house is too good to pass up, congrats either way", "author": "resorcinarene", "created": 1594958639, "upvotes": 1}, "fybqef9": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fybqef9/", "text": "Hang in there! It seems like you’ve got a great partner, it really helps to have a companion through all the craziness. You’re so close, good luck!", "author": "who_u_callinpinhead", "created": 1594957443, "upvotes": 15}, "fyblowu": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fyblowu/", "text": "Congrats on being a homeowner!", "author": "Hayw00dUBl0wMe", "created": 1594954412, "upvotes": 27}, "fybibta": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fybibta/", "text": "First world problems! \\s", "author": null, "created": 1594952300, "upvotes": -47}, "fyb3n9r": {"link": "/r/GradSchool/comments/hsl7rb/on_phd_covid_and_why_you_shouldnt_buy_a_house/fyb3n9r/", "text": "Good luck!! 👍🏼🍀", "author": "TGMPY", "created": 1594943574, "upvotes": 45}}}