{
  "sid": "qb6hc6",
  "link": "/r/GradSchool/comments/qb6hc6/organising_open_tabswebpages_for_later_use/",
  "title:": "Organising open tabs/webpages for later use?",
  "text": "I'm in my second semester of grad school containing classes as well as a dissertation. The amount of webpages I have open since the beginning of the year is SHOCKING. I always leave webpages there \"in case I need it for later\" or \"when I have the energy to read it\" but never get around to organising because I am so overwhelmed. I've accumulated so many tabs for different classes/assignments/break pages. When I am working on multiple things it gets so difficult to navigate and switch between them.\n\nDo you have a method for organising them?\n\nIt would be good if I could have a separate desktop type accounts for each class that I can switch between so I don't see the other class or assignment tabs when I'm working on one in particular. I prefer to have them open and not bookmarks or folders otherwise I'd probably never look at them again!\n\nThank you in advance :)",
  "author": "princesssslut",
  "created": 1634628914,
  "updated": 1634655383,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hh7ooh6": {
      "link": "/r/GradSchool/comments/qb6hc6/organising_open_tabswebpages_for_later_use/hh7ooh6/",
      "text": "Use one tab for Chrome, really good",
      "author": "Weekend_metalhead",
      "created": 1634635191,
      "upvotes": 1,
      "replies": {
        "hh7qufm": {
          "link": "/r/GradSchool/comments/qb6hc6/organising_open_tabswebpages_for_later_use/hh7qufm/",
          "text": "Amazing! I'll try this :)",
          "author": "princesssslut",
          "created": 1634637141,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh7pljp": {
      "link": "/r/GradSchool/comments/qb6hc6/organising_open_tabswebpages_for_later_use/hh7pljp/",
      "text": "Different windows :) \n\nOne for class, one for research, one for stupid random things \n\nIf it gets to the point that you can even read the tabs you have to many tabs. CLOSE TABS! Lol you either won’t go back and read or should just bookmark the site",
      "author": "FutureDrDr",
      "created": 1634636031,
      "upvotes": 1,
      "replies": {
        "hh7qfyg": {
          "link": "/r/GradSchool/comments/qb6hc6/organising_open_tabswebpages_for_later_use/hh7qfyg/",
          "text": "I have too many windows with tabs I can't read. Maybe I just need a deep cleanse :P",
          "author": "princesssslut",
          "created": 1634636786,
          "upvotes": 1,
          "replies": {
            "hh7tc5p": {
              "link": "/r/GradSchool/comments/qb6hc6/organising_open_tabswebpages_for_later_use/hh7tc5p/",
              "text": "Lol definitely time to deep cleanse, if you haven’t read that “really important article” yet you won’t or you’ll find it again one day if it was meant to be 😂",
              "author": "FutureDrDr",
              "created": 1634639279,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh8ae9n": {
      "link": "/r/GradSchool/comments/qb6hc6/organising_open_tabswebpages_for_later_use/hh8ae9n/",
      "text": "Ah yes the good ol \"I'll might need this information some day\" tabs. I also suffer from this and don't know how to handle this. I used to bookmark pages. But I kind of stopped when reaching 1500 bookmarked pages in Chrome (not everything was university realated though, but much of it was).\n\nI tried working with multiple virtual desktops in Windows but stopped for some reason. This thread might be enough motivation to pick that habit up again. I think it solved some issues of having too much \"clutter\" on my computer. But I still have problems with writing an enourmous amount of (physical) notebook scribblings with mysterious notes and remarks that I've made.",
      "author": "Golgamel",
      "created": 1634649910,
      "upvotes": 1,
      "replies": {}
    }
  }
}