{"sid": "k7z604", "link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/", "title:": "End of semester wall", "text": "Anyone else feel like they've hit a wall? I'm so burnt out at the end of this virtual semester and don't even feel like I even really did all that much? Feel free to share your strategies for pushing through this last bit of the sem if you are successfully pushing through... I have so much to do this coming week and I have no energy for any of it.", "author": "allagashtree_", "created": 1607279603, "retrieved": 1632953769, "over_18": false, "upvotes": 454, "upvote_ratio": 0.99, "comments": {"gf0wgb8": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gf0wgb8/", "text": "Thanks good luck you too", "author": "riyad96", "created": 1607403405, "upvotes": 1}, "geyxm1r": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/geyxm1r/", "text": "I'm screwing my professional life here, without even starting it, I don't know if I'll pass this semester", "author": "riyad96", "created": 1607367064, "upvotes": 4}, "geyfqpt": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/geyfqpt/", "text": "yes, I feel absolutely brain dead... and I have like three 13-18ish page papers to write and a presentation to create over the next 2 weeks.", "author": "raskolnikova", "created": 1607359966, "upvotes": 3}, "gexu79x": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gexu79x/", "text": "Hey there, I just submitted my thesis last week. My strategy to surviving a painfully routine day during a pandemic is to not put things off until the last minute. I break things down into smaller tasks and leave room for breaks during the week (meaning some off days where i feel like not doing anything). I stick to those bullet points I make for myself every day and slowly I manage to complete everything. I have no energy for anything as well so I feel you....", "author": "givemeyourdonut", "created": 1607348065, "upvotes": 3}, "gexq7yg": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gexq7yg/", "text": "I was failed my first grad school attempt. And the devastation I felt then, plus the years of being stuck in my career without any advancement; is now a huge motivation not to screw up again. Anytime I feel that way, I think about how much this degree means  to me. I look at all the possible jobs I could get with it compared to my current position. And I think I am so close to the finish line. Just stick to it and I will be exactly where I want to be.", "author": null, "created": 1607345034, "upvotes": 3}, "gex4esq": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gex4esq/", "text": "I feel like I’ve got essentially nothing done. I took a class, worked on multiple papers, and yet, I feel like I have failed. I know that I should have made more progress on my papers, and I should have done better in my class. However, I still feel inadequate. It’s been really difficult.", "author": "yeastleesi", "created": 1607323019, "upvotes": 4}, "gex2vzx": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gex2vzx/", "text": "Same, it's exhausting! I've got a 20pg paper due Wednesday night and only an outline so far. I just finished a 12pg one that took me a week to write. My friends are having the same problem. \n\nIt's especially hard cause these terms papers are for classes that are required, but so far off from my actual research interests. So it's hard to motivate when you really don't care about the topic.\n\nBut a weird thing I discovered yesterday: I have a pair of those blue-light blocking glasses cause I get migraines occasionally and light gets painful. I was wearing them while I worked and some nerdyness vibe came out and I felt like I was in writing-mode™. Idk why it happened, but I've been relatively productive when I sit down with the intention to work and have them on. It's ridiculous that that triggers such a strong work-time environment, but it works for me and I'm desperate! All of that to suggest to find something to condition yourself to associate with work.  I also like gum, so I'll often tell myself that I'm gonna sit and work hard until the gum looses flavor, then I get a break. Between that and the glasses, I was able to power through a miserable paper!", "author": "amwisesay_amgeegay", "created": 1607321749, "upvotes": 3}, "gewxtj2": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewxtj2/", "text": "No advice, I have one test left in less than 48hrs and 0 motivation to study. Killer part is I need to do well to maintain my grade, and I write this as the opening credits of another episode of the show I’m currently binging are flashing by. I’ll study after this episode, after I meal prep, scrub the baseboards, whatever! I don’t know how I’ve managed to lie to myself so effectively the last few days.", "author": "shadiett", "created": 1607317824, "upvotes": 7}, "gewud6t": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewud6t/", "text": "I just finished my finals in planetary geology. the professor said “ItLl bE sHoRt I JuSt wAnNa mAkE SuRe YoU lEaRnEd” -Dr. M in the last synchronous session. The exam was anything but, it was two very open-ended questions covering everything we learned with no guidelines on how long or how in depth you should go haha. Im just glad its over, I should have an A in the course when all is said and done.", "author": "Sudestbrewer", "created": 1607315454, "upvotes": 4}, "gewu0wd": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewu0wd/", "text": "I have three papers left including one this Wednesday. Half way through the course I realized that I have absolutely no interest in the subject matter. I have 1500 words out of 5000 done and have no clue how to fill up the rest of them.", "author": null, "created": 1607315234, "upvotes": 5}, "gewst9x": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewst9x/", "text": "oh my god. yes. getting myself to work on my finals this week feels impossible. and i just.... i just want it to end", "author": "jesspwnsnoobs", "created": 1607314478, "upvotes": 6}, "gewoajl": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewoajl/", "text": "Yep. I haven’t started my paper or poster. It’s due on Tuesday. I have a meeting with my PI Wednesday. I have to present this shit virtually and I literally do no give a fuck about what I’m writing anymore.", "author": "Thecatofirvine", "created": 1607311708, "upvotes": 6}, "gewmvn3": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewmvn3/", "text": "I am supposed to be written a 10 page paper. But after teaching myself finance and doing that final on Tues. Class on Wed. Additional homework that took me all morning today. I just dont have it in me to write this paper. (Its not even that long) \n\nI just want to be done. I switched grad programs because I didn't want to be online. Then covid made all my classes online. So.tired.", "author": "DemonSemenVaccine", "created": 1607310880, "upvotes": 4}, "gewhlil": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewhlil/", "text": "100%. Since March when COVID hit and our lab shut down, I wrote a review, had my first committee meeting/submitted my thesis proposal, took two classes, TA’d a course, did bonus grading for extra money, and just submitted a large grant. Oh and I adopted a dog. I’m toast. I feel like I’m absolutely at 0 and I need a long vacation (meanwhile, can’t even safely visit my family for a long weekend)", "author": "deerstalkers", "created": 1607307883, "upvotes": 6}, "gewh8f1": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewh8f1/", "text": "Yea! I hit that wall hard...", "author": "dfarris13", "created": 1607307681, "upvotes": 4}, "gewfjtw": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewfjtw/", "text": "Almost burnt out too. But that's because I really pushed it between mid-november and now to have a more relaxed end of semester. I'm pretty advanced in my final essays, the big chunks are done. Only a few fixes to highten coherence of thoughts and gramatical review remains.\n\nMy strategies are to spread the workload out on the full semester, to only read the material which (after reading the resume) seems valuable for my master thesis goals, not procastinate and take a day off every week. \n\nThe semester has been incredible knowledge wise. It also confirmed my passion for research.", "author": "Ejszaka", "created": 1607306768, "upvotes": 5}, "gewbvgn": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewbvgn/", "text": "Completely feel your pain! At this point the only motivation I have is that Cyberpunk 2077 comes out in a few days and really want to spend whole day, on my couch or in bed playing it. I have 50 exams and 20 more term papers to grade, I have grades to submit for three classes, a final project and rewrite to complete. My hope is to get through with most of it by Thursday night and so I'm just pushing through, with the occasional glass of wine and occasional breaks here and there. Just pace yourself, fam. You'll get there!", "author": "Kidtendo", "created": 1607304708, "upvotes": 4}, "gewasur": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewasur/", "text": "Same. I spent this semester completely by myself, barely leaving the house unless grocery shopping or dropping off my ballot, and I feel dead inside. I don't know if I'm unhappy in my program, or it's just the pandemic. I'm busy every day but I've barely actually accomplished anything, and I don't feel like I'm learning anything. I'm not excited for next semester, I kind of just want to go hibernate with the squirrels. \n\nI have a conference deadline Friday that's motivating me but after that I think I might just spend a couple days staring at a wall.", "author": "Look_a_Jax", "created": 1607304111, "upvotes": 11}, "gewasdi": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewasdi/", "text": "*PREACH*", "author": null, "created": 1607304103, "upvotes": 3}, "gewa0sg": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gewa0sg/", "text": "YES. One more week and I’m done with my last final so I’m just focusing that it’s almost over and I can relax a bit. You’re almost at the finish line!", "author": "WannabeBadGalRiri", "created": 1607303678, "upvotes": 3}, "gew2qrh": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gew2qrh/", "text": "My soul is tired.\n\nI taught my last class on Friday and the internet kept dropping out, which meant that none of what I wanted to accomplish happened. When I logged out, I put my head on my table and sobbed. It had just been so much. \n\nAnd then I realized that I cried the first day of school, too. Fall 2020 has been such a shitshow, and almost nothing has gone right, but! Whenever I popped I hear my students talking to each other about the subject of the course. By the way that they talked about, I could tell that despite everything, they got something out of the class. I try to remember that.\n\nI did some meal prepping tonight. Hopefully that makes the next couple days easier, and I can just ride the next week out.\n\nSending yall love and light. Hang in there. We are almost there. \n💛💛💛💛", "author": "CeeCee123456789", "created": 1607299701, "upvotes": 14}, "gew2oin": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gew2oin/", "text": "Ugh. Yep.  I'm down to a single paper and that's it.  I just need to add about 150ish words and finalize my references and I'm done. I could have easily done these things in the amount of time I've spent on Reddit just now.  But no, that has not happened.", "author": "terrafreaky", "created": 1607299669, "upvotes": 10}, "gew29ul": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gew29ul/", "text": "Yeah, I couldn’t agree more. The majority of my last spring semester was virtual too, and it sounds like next semester will be no different. This might sound terrible, but I’ve lowered my expectations for productivity. I’ve stopped beating myself up over not getting as much done as I used to pre-covid. At the end of the day, pat yourself on the back for sticking through it. If there was ever an excuse to drop out, this is it. Be proud that you’re still pushing forward!", "author": "SatanOnSaturn", "created": 1607299459, "upvotes": 7}, "gew029q": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gew029q/", "text": "Dude I was just venting to my friends about that. \nOur teachers decided to have us do the finals right after Thanksgiving, so now I have 2 more weeks of class but my brain already hit vacation mode. Problem is: I still have written and presentation projects, one of which is due tomorrow night, that's of course alongside lengthy lab work that I have during the day (consumes most of my day time)\nI am operating on ungodly amounts of caffeine + angry and sad music. But those only give me 30min boosts. I too am looking for advices on how to stay productive. I need this friggin A in class and I worked real hard so far but the project(s) are worth quite a lot.\nI used to be able to pull all nighters and still manage to get up early after very little sleep, but now in gradschool I no longer can. I mean I can stay up, I just won't have the brain power to accomplish anything. All nighters woulda been helpful rn but yea", "author": "ItsYaCarboiii", "created": 1607298338, "upvotes": 5}, "gevyxup": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevyxup/", "text": "So many of us are in the same boat... that is sad ofc but these are crazy times and there is strength in community support!! We got this everyone! We have all powered through this semester (in this case powering through is just getting through it) and we can all be proud of that... thanks everyone for the supportive comments and for sharing. Good vibes to you all!", "author": "allagashtree_", "created": 1607297746, "upvotes": 4}, "gevx74i": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevx74i/", "text": "To reiterate others, the best grad school assignment is a finished grad school assignment. Shit does not need to be perfect, it just needs to be done. Also, I try to ground myself with the knowledge that my professors are burnt out too, and given my experience with grad school so far, they're loathe to grade you harshly, especially during a pandemic. God speed, friend.", "author": "kokopellifacetatt0o", "created": 1607296849, "upvotes": 22}, "gevvzwf": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevvzwf/", "text": "Not the perfect solution, but going for 30+ minutes walk or working out for 30+ minutes before doing any work helps a bit", "author": "CandyBoBandDandy", "created": 1607296238, "upvotes": 8}, "gevv9wu": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevv9wu/", "text": "Ugh same. I have finals coming up and I just...don't want to. I feel so done with it and yet I've done like basically nothing so far.", "author": "uglycontest", "created": 1607295862, "upvotes": 4}, "gevuf34": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevuf34/", "text": "This is unsustainable but at this point the only thing keeping me going is that there's 23 hours and 4 minutes left before the semester ends and I can metaphorically curl up in a corner and cry for a few weeks", "author": "Dysvalence", "created": 1607295423, "upvotes": 5}, "gevtadt": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevtadt/", "text": "Yup and working full time as well. I just keep telling myself it will be over soon but my weekends are pretty much spent forcing myself to work when I'm exhausted.", "author": "Ok-Guidance5576", "created": 1607294832, "upvotes": 11}, "gevo7a2": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevo7a2/", "text": "Same here - this virtual semester really kicked my butt.", "author": "TheRealDrRat", "created": 1607292219, "upvotes": 8}, "gevjgkn": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevjgkn/", "text": "God, I feel this on an emotional level. I have a huge presentation this wednesday as well as a ton of grading for my TA job and I just want to sleep for a week and not do anything. I am ready to take a couple days off for the holidays....", "author": "Vividersplash26", "created": 1607289885, "upvotes": 9}, "gevihgw": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevihgw/", "text": "I spent my undergrad obsessing over turning in perfect assignments/exams. After entering grad school, I am thankful to simply turn shit in. This entire experience has taught me that I was taking myself way too seriously. Sending you good vibes so you can get through this semester and rest!", "author": "Awkward-Salad", "created": 1607289423, "upvotes": 67}, "gevgzm2": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevgzm2/", "text": "Make a list with deadlines that give you enough cushion to get the next item done.\n\nFocus only on the item you're working on. That's all you have to do. Turn it in by your personal deadline, check it off the list, and drink a margarita.\n\nRepeat until it's over.\n\nI have two things left out of 14 from two weeks ago! Too bad they're huge", "author": "PyrocumulusLightning", "created": 1607288754, "upvotes": 15}, "gevgo8d": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevgo8d/", "text": "Im so disengaged with my work im not even sure if im progressing well at this point", "author": "onechamp27", "created": 1607288607, "upvotes": 16}, "gevfzqu": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevfzqu/", "text": "I've been working every day in the lab alone for the past 2 months, I'm almost ready to run my samples for analysis next week. I'm so over it, but That's been my focus for so long and I know I'm going to CRASH when I finish. I've been rewarding myself with sugary Starbucks lattes because it brings me a tiny amount of joy.", "author": "pyritepyrate", "created": 1607288286, "upvotes": 8}, "gevdh7j": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevdh7j/", "text": "I am burnt out bad. This is my first semester of grad school and i never got burnt out in undergrad...  I have two finals, two papers, and a presentation left and I dont feel like doing a damn thing", "author": "Redd889", "created": 1607287101, "upvotes": 45}, "gevchfz": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevchfz/", "text": "Yuppppp just asked for an extension on a paper. On top of the end of semester, my brother went into the psych ward a few weeks ago and i went through a breakup this week. Ugh", "author": "kyokogodai", "created": 1607286633, "upvotes": 20}, "gevb9yy": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gevb9yy/", "text": "Solidarity, my friend. I'm just sort of trying to put myself on autopilot. I know the work I produce over the next couple of weeks will be far from My Best, but also everything is highkey awful right now and it's fine to just...tread water and do the bare minimum. See where you can lower your own expectations of yourself. Not because you're not smart and capable, but because we are all! So! Stressed! and shouldn't be asking or expecting ourselves to be functioning at peak right now. Little by little.", "author": "parsleybutter", "created": 1607286044, "upvotes": 20}, "gev9ew8": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gev9ew8/", "text": "I have a week left but my brain has decided to take start vacation early (except when I need to sleep... then it's hyperactive). Coffee, very stupid inner pep talks, and giving myself mini rewards for finishing tasks are keeping me going right now.", "author": "City-Slickin-G", "created": 1607285139, "upvotes": 46}, "gev9c5r": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/gev9c5r/", "text": "I find weird things comforting so u might find this to be totally useless but here goes. I read a book a long time ago about a guy who lived through the holocaust. He always noted that each individual day felt like it was an eternity of suffering. But when he'd stop to think about a week or month that had gone by it felt like it went by in a flash. Obviously as students were not in something that extreme but it still stands. When I think back on a semester like now, I feel like I've done very little. But in reality thats not true. Each day was just as hard as today. Try to keep in mind how your mind distorts time because you deserve a lot more credit than you're giving yourself.", "author": "stefanevada1", "created": 1607285102, "upvotes": 73}, "geuwiao": {"link": "/r/GradSchool/comments/k7z604/end_of_semester_wall/geuwiao/", "text": "God, I feel you. I got COVID exposed (dodged actually getting it, thank god) and spent two weeks in my room, one of which was our Thanksgiving break, and completely forgot how to be a functional student. I'm out now, but our library is closed 'cause the county is spiking in cases, so my study space is limited to my room again. My productivity is absolutely WRECKED.\n\nCurrently keeping me going is large amounts of very sugary coffee. My final big project is tomorrow, so that should be enough. That's hilariously unhelpful (and probably unhealthy) but there ya go. Rough fuckin week.", "author": "wildechem", "created": 1607280442, "upvotes": 117}}}