{
  "sid": "ptjh79",
  "link": "/r/GradSchool/comments/ptjh79/i_dont_like_grad_school_and_dont_know_what_to_do/",
  "title:": "I don't like grad school and don't know what to do with my life",
  "text": "I started grad school a few weeks ago and am already questioning whether or not I want to continue.  I'm not sure if it's the academic environment, or the degree itself that I don't like.  For years, I thought this was the path for me.  I put in so much effort into my grad school applications and was so happy when I got accepted.  I didn't realize how intense it would be.  I have been feeling very overwhelmed with my workload, so I cut back to part time to see if I feel any different.  Nope, I still don't like it.  I struggle with depression and anxiety which has gotten worse with school.  I chose to study in a helping profession because I want to help people.  I don't know if I want to go into debt for something I'm not sure about and something that's causing me tons of anxiety, yet I have no idea what I want to do with my life.  I am almost 36 and have no idea where my life is going.  I feel lost.  The school seems to be trying to persuade me to stay.  Even though I have already expressed my reluctance to continue, they keep telling me it's normal.  I think it comes down to not enjoying the material.  My dilemma is whether I should take a leave of absence now (before I get into student loan debt) or keep going and see if I feel differently in a few months.  My gut is telling me this isn't the program for me, yet I'm scared of missing out on an opportunity towards a successful career.  I'm just not sure what my next steps are.  I do know I prefer online studying that allows some flexibility, but my state doesn't offer any in my field of interest.  II didn't go to class today to think things through.  I feel very lost and worthless.",
  "author": "ferventsoul",
  "created": 1632356487,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "heanbfc": {
      "link": "/r/GradSchool/comments/ptjh79/i_dont_like_grad_school_and_dont_know_what_to_do/heanbfc/",
      "text": "I ended up not going to class this past week.  I'm just too overwhelmed with everything.",
      "author": "ferventsoul",
      "created": 1632621987,
      "upvotes": 1,
      "replies": {}
    },
    "hdxjvdb": {
      "link": "/r/GradSchool/comments/ptjh79/i_dont_like_grad_school_and_dont_know_what_to_do/hdxjvdb/",
      "text": "Sorry you feel like that, please speak to a mental health professional on campus, or your department graduate co-ordinator or PI. If you have to quit, do so early. There is no shame in quitting. The publish or perish culture has turned academia into a predatory institution that preys on students' creativity, dreams and hard work. Hope you feel better soon.",
      "author": "SquirrelOnTheDam",
      "created": 1632374797,
      "upvotes": 4,
      "replies": {
        "hdzbcmo": {
          "link": "/r/GradSchool/comments/ptjh79/i_dont_like_grad_school_and_dont_know_what_to_do/hdzbcmo/",
          "text": "Thank you.  I have a therapist outside of school.  I'm not sure I want to discuss this with people who work in my department.   You're absolutely right about the academia world.   I really can't stand it.",
          "author": "ferventsoul",
          "created": 1632414326,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hdwzd0d": {
      "link": "/r/GradSchool/comments/ptjh79/i_dont_like_grad_school_and_dont_know_what_to_do/hdwzd0d/",
      "text": "Hey. I’m so sorry and thank you for sharing this. You aren’t worthless. I’m sorry that you feel lost. You sound like a really kind and empathetic person from this brief post. Grad school is so hard! You’ve done so well to get accepted. Please have faith. I believe in you! I hope it will get better.",
      "author": "janie-jones",
      "created": 1632363073,
      "upvotes": 4,
      "replies": {
        "hean97c": {
          "link": "/r/GradSchool/comments/ptjh79/i_dont_like_grad_school_and_dont_know_what_to_do/hean97c/",
          "text": "Thank you very much. I appreciate your kind words.",
          "author": "ferventsoul",
          "created": 1632621956,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066773
}