{
  "sid": "pmdpza",
  "link": "/r/GradSchool/comments/pmdpza/faculty_dont_share_research_interests/",
  "title:": "Faculty don’t share research interests?",
  "text": "I’m starting to think about possibly applying for PhD programs for Fall 2023, I’m currently a Masters student in a social science program where getting a PhD isn’t an option for me at this school. I have looked at the faculty at the schools I want to apply to, but none really share my research interests. Should I reach out to faculty members and attempt to start a dialogue (not right now, but eventually)?",
  "author": "Ok-Huckleberry-2818",
  "created": 1631388365,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hcj5vak": {
      "link": "/r/GradSchool/comments/pmdpza/faculty_dont_share_research_interests/hcj5vak/",
      "text": "It's worth asking yourself how sure you are that *you* know what you're interested in working on. Earning a Ph.D. is an extremely involved, often personally transforming process. Some of the best advice that I ever recieved was not to focus too much on what I *thought* I wanted to do, and instead to choose a topic that I merely didn't hate and trust that I would grow to love it.\n\nI had never even *heard* of the topic I did my Ph.D. in before I started my program, but I sure do love it now!",
      "author": "UmiNotsuki",
      "created": 1631426545,
      "upvotes": 4,
      "replies": {
        "hcjcjp2": {
          "link": "/r/GradSchool/comments/pmdpza/faculty_dont_share_research_interests/hcjcjp2/",
          "text": "Thank you for the reply!",
          "author": "Ok-Huckleberry-2818",
          "created": 1631431462,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hcgzjka": {
      "link": "/r/GradSchool/comments/pmdpza/faculty_dont_share_research_interests/hcgzjka/",
      "text": "So why do you want to apply to that school if you aren't interested? Maybe check out other schools/programs.",
      "author": "gothturnip",
      "created": 1631389287,
      "upvotes": 7,
      "replies": {
        "hcgztt2": {
          "link": "/r/GradSchool/comments/pmdpza/faculty_dont_share_research_interests/hcgztt2/",
          "text": "I can’t move due to  my full-time job. I’m a non-traditional grad student. The schools I’m looking at have the program that I want, but the faculty interests don’t really match up with mine.\n\nEdited to add: sorry, I didn’t explain that very well in the original post",
          "author": "Ok-Huckleberry-2818",
          "created": 1631389403,
          "upvotes": 3,
          "replies": {
            "hch16l9": {
              "link": "/r/GradSchool/comments/pmdpza/faculty_dont_share_research_interests/hch16l9/",
              "text": "Oh that makes a lot of sense! I would imagine it would be hard to do a PhD in a project you don't connect with, but sometimes PIs have more side projects in the works. Maybe if you read some of their papers and are interested in a particular angle that they could explore further? A lot of students find that once they get into a lab, they connect with projects they didn't necessarily expect to.\n\nI would say it might be helpful to talk to a PI and ask more about their work to maybe develop a stronger interest, but don't say outright that everything is boring to you, since nobody wants to mentor someone who doesn't care at all.",
              "author": "gothturnip",
              "created": 1631389970,
              "upvotes": 2,
              "replies": {
                "hcjcj5e": {
                  "link": "/r/GradSchool/comments/pmdpza/faculty_dont_share_research_interests/hcjcj5e/",
                  "text": "Thank you for the reply!",
                  "author": "Ok-Huckleberry-2818",
                  "created": 1631431449,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634066166
}