{
  "sid": "qvj4hz",
  "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/",
  "title:": "Anyone else doing fine in grad school but you want to quit?",
  "text": "Is anyone else doing fine in grad school & have a great advisor & labmates but you want to quit?\n\n2nd year. Published paper first year. But I can’t bring myself to work more than one day of the week on my research and it’s just turned into a frustrating, hateful cycle. And now I constantly stress about whether I should drop out or not. Plus my PhD is in ME & my research is in machine learning. Bc of my research + last internship, I realized I want my career to be in ML or CS related (nothing at all to do with mechanical engineering). So now that’s also weighing on me— the fact that if I wanted a job in these industries I wouldn’t be very competitive after grad school (bc I’m pretty much self studying programming and some of ML as I go). Plus it feels silly having a PhD in ME when I don’t even like ME anymore. No passion or interest for it anymore. \n\nI’m just lost on what to do because the topic, advisor, and lab are all great but I just can’t self- motivate myself anymore. Probably bc of anxiety I feel related to my future career & how what I’m doing now doesn’t best align with it (especially compared to just getting an MS in CS). \n\nAnyone else in the same boat?",
  "author": "Careless_Drummer_208",
  "created": 1637099462,
  "updated": 1637415500,
  "over_18": false,
  "upvotes": 44,
  "upvote_ratio": 0.96,
  "comments": {
    "hkx1gm8": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkx1gm8/",
      "text": "Goodness, me too. First-year of a PhD in English. I'm doing surprisingly well given how little I want to keep doing this, I feel like I'm putting effort in but it's just out of like... not having anything else to do rather than any sort of passion I may have had at one point. I feel like I should be failing, at least I feel like I've failed in every sense but the marks I've been getting in my coursework - I'm emotionally disconsolate, I'm stringing everything together by the skin of my teeth, I'm running out of money, but I'm getting through nonetheless.\n\nFor what it's worth, I'm in my first term of a four-year program so it's probably easier for me to leave than it would be for you (and I am going to leave). But your situation sounds similar to mine, you might question whether the misery is worth it for an end you don't care about anymore.",
      "author": "thelowandtobask",
      "created": 1637104754,
      "upvotes": 12,
      "replies": {
        "hkx9s97": {
          "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkx9s97/",
          "text": "Same! In my first semester, doing fine but leaving as well.",
          "author": "emsadsm",
          "created": 1637108384,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkxg4io": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkxg4io/",
      "text": "I’m in my first semester of working on my dissertation, so fourth year in an English PhD program, after two years in a masters program, and on paper, everything looks fantastic… Let’s just say I understand why people leave programs ABD now. I just can’t convince myself to care.",
      "author": "Frosty-Hour5112",
      "created": 1637111186,
      "upvotes": 7,
      "replies": {
        "hkxgqqy": {
          "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkxgqqy/",
          "text": "What’s ABD?",
          "author": "Careless_Drummer_208",
          "created": 1637111460,
          "upvotes": 1,
          "replies": {
            "hkxjtj7": {
              "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkxjtj7/",
              "text": "It stands for all but dissertation. Means you have your coursework done, comprehensive exams done, and dissertation proposal approved. So “all” you have left is the dissertation.",
              "author": "Frosty-Hour5112",
              "created": 1637112825,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "hkxqogq": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkxqogq/",
      "text": "Hey, we’re in the exact same field: PhD, Machine Learning, Mechanical engineering. \n\nI will say that one of my cohorts, who was also Machine/Deep Learning +  Mechanical Engineering got a job in the computer science industry. I’m not sure if it was difficult or not since this person was gone by the time I got there but it is definitely possible. \n\nI’m pretty sure this person did not start off with ML. It seemed like half their PhD was on mechanical engineering research and the the other half was using machine learning. \n\nI would say that you would be pretty competitive if you graduate grad school with ML projects under your belt. If you have any question you can DM.",
      "author": "Shinie_a",
      "created": 1637115808,
      "upvotes": 4,
      "replies": {
        "hkxyse6": {
          "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkxyse6/",
          "text": "This made me feel better. Thanks for commenting. Feel free to message me too!",
          "author": "Careless_Drummer_208",
          "created": 1637119455,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkxxhvn": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkxxhvn/",
      "text": "I think it depends how you want to apply it. If you’re interested in ML in embedded systems, it doesn’t hurt to stay the course. You may even be able to switch over to EE on paper but keep the same advisor? Or have a nominal advisor in EE but still mostly work with your current lab group. \n\nOn the wanting to quit thing: I’m going through my 3rd academic year now and am back and forth on this all the time for the last year. Take some time away if you can, and if not, try to immerse yourself in something totally new to rekindle the spark: a conference, trip to another nearby institution, work directly with a collaborator for a bit - anything to break the current day-to-day which gets insufferable, if for no other reason than that it seems endless and relentless. Try to close that chapter for a bit and turn to something new if you can.",
      "author": "simplysalamander",
      "created": 1637118859,
      "upvotes": 4,
      "replies": {}
    },
    "hkycpqb": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkycpqb/",
      "text": "I sometimes go through phases when I also struggle with my work and consider quitting. I’m doing quite well, but have hit some nasty bumps along my journey, which largely stemmed from my PI. \n\nMy research, while incredibly interesting… relies on a demanding process. Most of my work is in vivo, and a full experiment can take months. I don’t particularly care for some of the unpleasant tasks (harvesting blood and organs at 5am, then staying into the late evening in a single day). It’s really disheartening when you have to repeat those experiments. 2 months lost, life lost, an 18 hour day wasted. \n\nWhenever I start to feel this way, I’ve learned to take a small break. I’ll change up my routine and focus on writing for a bit, or just take some time to have fun. I find that once I have a breather, I can get back into the game and enjoy my research more. \n\nHowever, if you constantly dislike your research, or the research process… it could be a sign that this isn’t the right career for you. And that’s totally okay!",
      "author": "BiologyPhDHopeful",
      "created": 1637126723,
      "upvotes": 4,
      "replies": {}
    },
    "hky0sv0": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hky0sv0/",
      "text": "Yeah, I'm the same. i set aside today to catch up in the class but I just couldn't. I'll try again over the weekend. And let my professor know I'm thinking of withdrawing. None of this is worth my mental well being.",
      "author": "I_Burke",
      "created": 1637120395,
      "upvotes": 3,
      "replies": {}
    },
    "hkzusc7": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkzusc7/",
      "text": "You’re not alone.",
      "author": "Internal-Bear-8184",
      "created": 1637162167,
      "upvotes": 3,
      "replies": {}
    },
    "hkzwanq": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hkzwanq/",
      "text": "Most forward-thinking companies appreciate any graduate degree for a technical job even if it's nontraditional. For example I studied math and work as a software engineer even though my programming skills were self-taught and sorta limited. Given that you're performing well in your program, I think you'd still be competitive in these kinds of interviews if you prepare a bit beforehand and should have no problem getting your dream job!",
      "author": "saturnineoranje",
      "created": 1637162791,
      "upvotes": 2,
      "replies": {}
    },
    "hl2kx1o": {
      "link": "/r/GradSchool/comments/qvj4hz/anyone_else_doing_fine_in_grad_school_but_you/hl2kx1o/",
      "text": "I’m doing well academically, I like my advisor and my thesis, but I feel my institution is corrupt. It makes me want to leave because I want nothing to do with them.",
      "author": "Sriracha11235",
      "created": 1637203022,
      "upvotes": 2,
      "replies": {}
    }
  }
}