{"sid": "jzue20", "link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/", "title:": "Question about living on a $900/month stipend...", "text": "2nd year grad student here. I just learned that I will be receiving a generous stipend of $900/ month in return for me TA-ing two classes. I have some questions about living on $900/month and was hoping someone could answer them for me.  \n\n\nWhat kind of Cat food tastes the best and is the cheapest? I was thinking of getting fancy feast but its a little big more expensive than other wet foods. Dry food makes me too thirsty so i stay away from it\n\n  \nWhat are some good free alternatives to toilet paper? There are a lot of dead leaves on the ground near my house but they're pretty dry. I was thinking of using snow but its been a warm winter.\n\nHow much extra income can I make as a male escort? how fat can an escort be and still find clients? Is being an \"escort\" technically legal?\n\n&#x200B;\n\nAny help is greatly appreciated thanks!", "author": "Porkalork", "created": 1606178090, "retrieved": 1632845160, "over_18": false, "upvotes": 1396, "upvote_ratio": 0.98, "comments": {"gx8h7xk": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gx8h7xk/", "text": "I have a job and I make less than 900/month", "author": "yungScooter30", "created": 1620359282, "upvotes": 1}, "gf52nw7": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gf52nw7/", "text": "Make sure you get an only fans as well", "author": "Equivalent_Age", "created": 1607491893, "upvotes": 1}, "ge41ju6": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/ge41ju6/", "text": "Also, get some undergrads with meal plans to use a guest pass on you to the dining hall, bring tupperware and steal a week's worth of whatever food is the least shit. If the uni is paying a starvation wage the least you can do is make them literally feed you.", "author": "Sadbag_Dave", "created": 1606705584, "upvotes": 1}, "ge41c9c": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/ge41c9c/", "text": "Become good friends with ebay. In undergrad I made 40-50k a year selling shit from yard sales on ebay. Your only hard deadline is saturday morning from about 6am to 2 pm and it will make your life worth living. The rest of your work schedule is a floating one as long as you ship your sales on time, list when you have time and you have a 3 day buffer to ship.", "author": "Sadbag_Dave", "created": 1606705457, "upvotes": 1}, "gdu8koc": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdu8koc/", "text": "Back in 1991 I was being paid $700 to TA 2 courses.  It sounds like $900 has grossly lagged with inflation", "author": "AllofaSuddenStory", "created": 1606541329, "upvotes": 1}, "gdk1awx": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdk1awx/", "text": "あなたはとても幸運です", "author": "RedFlutterMao", "created": 1606314880, "upvotes": 1}, "gdiukuc": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdiukuc/", "text": "I was paid 3x that in the Midwest, even while on medical leave. Your situation sounds ridiculous to me, although it sounds like we’re in very different disciplines. If you have a car I would consider being a driver for a ride share program. It sucks during the pandemic and all, but there are ways to mitigate risk", "author": "CharlieMayne", "created": 1606279470, "upvotes": 1}, "gdhudys": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdhudys/", "text": "Where do you live. \n\n$900 a month would make my life much easier. Lol", "author": "Hmtnsw", "created": 1606259109, "upvotes": 1}, "gdhfdd2": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdhfdd2/", "text": "check out local foodbanks and charity options", "author": "microwav3d", "created": 1606251636, "upvotes": 1}, "gdh86yv": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdh86yv/", "text": "Cat food is expensive my brother, just show up to campus gatherings (if they return once COVID goes away), act like you belong, eat some food, then leave.", "author": "kitten_twinkletoes", "created": 1606248220, "upvotes": 1}, "gdgzs16": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgzs16/", "text": "Are you really getting only $900 dollars a month?", "author": "AlphaBetablue", "created": 1606244277, "upvotes": 1}, "gdgx8j4": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgx8j4/", "text": "Seeking Arrangements might help you find a Sugar Mama (or Daddy if you're willing cuz that would be easier to find)? There is also Onlyfans??", "author": "not_my_birthday_", "created": 1606243108, "upvotes": 2}, "gdgvuhw": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgvuhw/", "text": "Load up on k-cups from the grad lounge", "author": "clutchcity93", "created": 1606242462, "upvotes": 1}, "gdgu8kw": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgu8kw/", "text": "I think someone else said it, but look into plasma donations. Some places will offer almost $50 a donation, and you can go twice a week. That's like a 150% increase in your monthly stipend!", "author": "M4xusV4ltr0n", "created": 1606241715, "upvotes": 1}, "gdgnju5": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgnju5/", "text": "As someone who has a... *checks notes* $550/month GA position, I would recommend tender vittles.", "author": "HappyAntonym", "created": 1606238682, "upvotes": 1}, "gdgj7x1": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgj7x1/", "text": "In all seriousness, maybe get a bidet attachment. They're like $50 for a decent one, which is an investment, but you won't have to buy TP again", "author": "abbystarheart1", "created": 1606236689, "upvotes": 1}, "gdgf0gc": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgf0gc/", "text": "Pay to go to the dining hall and then fill your backpack with loafs of bread and fruit", "author": "Firstmate_Ishmad", "created": 1606234732, "upvotes": 1}, "gdgdjlm": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgdjlm/", "text": "Apply for anything you think you may qualify for. Here in CA they made it where students qualify for cal fresh (food stamps). Also might have to try to get a very part time job like 1-2 shifts a week. Caregivers are making good money right now with the pandemic. Honestly you’ll probably make more without the TA job. I’d just work outside the school.", "author": "edaum0726", "created": 1606234036, "upvotes": 1}, "gdgcyhp": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgcyhp/", "text": "Obvious answer is hit the dating apps and find a partner that can financially support you! If you plan to enter the academic job market this is pretty much essential", "author": "suhawhee", "created": 1606233754, "upvotes": 1}, "gdgbqyl": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdgbqyl/", "text": "COVID is messing up my strategy, but in normal times there are always free sandwiches hanging around after seminars.\n\nAlso, just work all the time and don’t bother sleeping so you can get your PhD done faster.", "author": "sexy_bellsprout", "created": 1606233171, "upvotes": 1}, "gdg6gfd": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdg6gfd/", "text": "The original version of toilet paper according to a podcast I listened to used to be torn-out pages of old Sears magazines and so what I'm saying is you should spend a lot of your time as a TA pooping at work.", "author": "Mythsterious", "created": 1606230708, "upvotes": 1}, "gdg1z55": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdg1z55/", "text": "I drew the short straw and didn’t get funding or a stipend for my first year (thank God I have both now).\n\nHere’s what I learned being poor AF during that time (pre-COVID):\n\n-Most universities have a food pantry\n\n-Substitute teaching is a hella easy job to land, pays roughly 100 dollars a day, and lets you choose if you want to work on any given day. I did my reading at work everyday.\n\n-It is very easy to take all the TP and soap you need from public bathrooms at the university.\n\n-if you have the funds up front, a 50lbs bag of rice and a 50lbs bag of beans can last months. I bought eggs and hot sauce to go with it week to week.\n\n-Living like this SUCKS but you can handle it because you have to.", "author": "Norin_was_taken", "created": 1606228404, "upvotes": 3}, "gdfywrr": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfywrr/", "text": "Would you mind just sharing what field/course of study and geographical area you are having to deal with this in? Get that free lunch, that pay is absurd!", "author": "completelylegithuman", "created": 1606226916, "upvotes": 1}, "gdfyk8r": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfyk8r/", "text": "Since the stipend is 900 I imagine you'll get quite skinny until you fetch a good price as a male escort, at which point you'll make more money and get heavy, and lose clients. I imagine this cycle will continue until you reach an equilibrium point and can use that as the basis for your economics PhD.", "author": "anointed9", "created": 1606226753, "upvotes": 6}, "gdfw5se": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfw5se/", "text": "Can you sell plasma? I get around $300/mo", "author": "punnugget42", "created": 1606225545, "upvotes": 1}, "gdfs5uy": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfs5uy/", "text": "Make sure to go to the graduate student food pantry if you’re at a big enough university. \n\nAnd also contact your department secretary for info on how to receive food stamps.\n\nOh! Make sure to check the dumpsters behind pizza chains for fresh throwaways right after closing.", "author": "nerdhappyjq", "created": 1606223444, "upvotes": 2}, "gdflt70": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdflt70/", "text": "You’re gonna want to go for Purina Friskies wet food. The cans are big and you’ll get the most for your 52 cents each. Also, one public restroom roll of toilet paper that you steal from you university should last you quite a while so I would consider that. I’m not sure about the escorting, I would check your states laws because I believe it may vary state to state. Good luck!", "author": "4ordersofwendysfries", "created": 1606219743, "upvotes": 1}, "gdfjrfi": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfjrfi/", "text": "You're hilarious!\n\nOn a serious note, cheese, sauce, and spice may be a life-saver if you're living on a veggie-heavy diet. It adds flavor and makes your steamed veg taste like more of a meal. Milk (i.e. dairy products) and Spinach cover 14 out of the 15 daily nutrient requirements and if you add fortified cereal you should be alright on the staying alive front. Baby spinach tastes better than regular spinach if you want a change in taste.\n\nPS There is a market for feet and hand pics. A weird, but apparently kind of lucrative market. \n\nGood luck! :)", "author": "CG_blue", "created": 1606217962, "upvotes": 1}, "gdfhj73": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfhj73/", "text": "As an international prospective student, I am surprised to see this post. I have been told that living(rent+utilities+food) in the US costs approx 500-600$/month, granted you live in a shared space (with 2-3 people or 4-5 if in places like California). When I initially saw $900/month, I thought that this is actually a generous amount and that the op is just being sarcastic about the cat food and tp..!!!\n\nCan someone help me out here? How much does it actually cost per month to live in the US as a grad student?!", "author": "helloim-tryingmybest", "created": 1606215832, "upvotes": 1}, "gdfdq1a": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfdq1a/", "text": "Other day pizza hut was giving out fliers and i honestly thought about getting a weekend job doing it.", "author": "NeuroticKnight", "created": 1606211854, "upvotes": 2}, "gdfa1q6": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdfa1q6/", "text": "My uni pays us twice as much and healthcare too - unionize!", "author": "tacobellisadrugfront", "created": 1606208035, "upvotes": 3}, "gdf9bgh": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdf9bgh/", "text": "You can also stop yourself from *wasting* money on rent by getting a sleeping bag and staying in your office! You will no longer have to worry about electricity, heating, water, and internet bills either. Use the department kitchen and fridge for your cooking needs. The only issue is you may need to find a shower, but you can probably use the campus gym's shower for that! And in case there are rules on campus that disallow staying overnight, just tell anyone who checks on you that you're pulling an all-nighter for research (which is probably true anyway)!\n\n^(~~This may have almost become a true story.~~)", "author": "valryuu", "created": 1606207311, "upvotes": 5}, "gdf4rlo": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdf4rlo/", "text": "Well, this my salary on a good month as a grad student.", "author": "Nevermindever", "created": 1606203109, "upvotes": 2}, "gdf47g5": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdf47g5/", "text": "Food bank.\n\nOatmeal and fruit (don't get instant).\n\nBrown rice and beans with cheap chopped veggies, a spoonful of tahini, nutritional yeast and salsa. I lived on that for so long.\n\nI've also eaten a lot - a LOT - of expired food. It's very eco-friendly to turn yourself into a compost bin.", "author": "PyrocumulusLightning", "created": 1606202618, "upvotes": 15}, "gdf2z2k": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdf2z2k/", "text": "SNAP AKA  food assistance (food stamps) from the government if you're in the US. How I'm affording rent rn.", "author": "scratchedstopsign", "created": 1606201538, "upvotes": 2}, "gdeye9n": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeye9n/", "text": "I had to go on food stamps and Medicare after my first year. I also donate plasma when I can. Haven’t had to go to food banks yet, but that is an option. \n\nPS — You’ve got a great sense of humor. Your post made me laugh a little to hard. Best wishes getting through all this.", "author": "1503O", "created": 1606197795, "upvotes": 12}, "gdey4ac": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdey4ac/", "text": "Most often, I buy butcher/manager sales meat that you have to cook that day itself. Try to be friendly with the butcher, them they might hook you up to some discounted chicken thighs, ground beef or stew meat. Look out for sales in dairy section too. 5dozen walmart eggs are less than $10, they are my staple. Buy one or two spices and mayo, you are good to go. Asian groceries sell odd cuts and organ meats that are nutritious and cheap too.  If you want to go the vegetarian route, eat rice, beans and potatoes. Don't bother with salads and greens, they are expensive. Cabbage, cauliflower and few in-season vegetables can be good option or else frozen veggies. Don't buy snacks or treats and eat big meals! Hang in there, bud!", "author": "troy_lc", "created": 1606197585, "upvotes": 3}, "gdexhzf": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdexhzf/", "text": "Jesus. Someone needs to tell Americans that not how anyone is supposed to live. Go burn down your government or sumfin", "author": "Operatorerror34", "created": 1606197120, "upvotes": 15}, "gdexft6": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdexft6/", "text": "That's less than $11k a year, right? That amount would put you under the poverty line, if I remember correctly. I wonders...could you apply for welfare based on that?", "author": "TracyJackson23", "created": 1606197073, "upvotes": 6}, "gdevhv6": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdevhv6/", "text": "I know this may sound bad at first, but stay with me here.\n\nDonate plasma. \n\nSeriously. It pays, and we have a massive shortage of plasma. I'm currently on a life-saving treatment that uses plasma, and they're having to cut people's dosages down because of lack of supply. And now covid has driven that demand up even more. \n\n\nEven if you don't want the money... Donate plasma if you can.", "author": "penguinhearts", "created": 1606195672, "upvotes": 10}, "gdeuxin": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeuxin/", "text": "My advisor told me to take out student loans. Which is exactly what another redditor told me to do. \n\nIdk human, you can’t be successful living on a Dickensian wage. I wasn’t. Anybody who says they were are lying or had it subsidized through some other means.", "author": "EmpathyIsAHabit", "created": 1606195273, "upvotes": 7}, "gdeuo8x": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeuo8x/", "text": "as an escort, there’ll be a tradeoff between looks and safety; you’ll just have to get a bit dirtier than the rest", "author": "thkimde", "created": 1606195095, "upvotes": 7}, "gdes0lc": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdes0lc/", "text": "Boil a serving of frozen veggies (I prefer broccoli florets, my daughter likes when I use the peas and carrots mix, so play around and mix it up), add in some ramen noodles, and a soft boiled egg. Super cheap, easy, fills the basics and the belly. Apple or banana for dessert. Broad multivitamin at bedtime or breakfast to cover what’s missing nutritionally. You can use different stuff to change the flavor. I like cumin and garlic. Soy sauce is nice. I do usually stay away from the flavor packet bc it’s a crazy amount of salt. Don’t knock the time honored college student tradition of cereal and milk. Cooking food yourself is always cheaper. A crock pot would make cooking a lot easier if time was a huge factor. Dump stuff in first thing in the morning and it’s done by dinner. Meal prep and freeze.\n\nFind roommates. Offer to tutor someone for a bit of cash? Proctor exams for a bit of extra cash? Use a bidet instead of toilet paper. Go to the dollar store for stuff like trash bags and shampoo. Use wash cloths instead of paper towels. Use a shaved bar of laundry soap with some washing soda (not baking soda) and borax instead of tide. Use wool dryer balls to speed up the clothes drying in a dryer or if you can hang clothes to dry on a rack in your room. Apply for food assistance. Find a food bank. Ask a charity for assistance. Dog walking gig? \n\nI hope this sparks some ideas.", "author": "savalana", "created": 1606193294, "upvotes": 22}, "gderf6d": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gderf6d/", "text": "lol, a lot of  people on unemployment get less money than that. You'll be fine.", "author": "SaintEmprime", "created": 1606192902, "upvotes": -14}, "gderekc": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gderekc/", "text": "[removed]", "author": null, "created": 1606192892, "upvotes": 1}, "gdepy52": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdepy52/", "text": "I lived on $900/month for 5 years during my PhD while teaching between 3-5 classes/week. I picked up a restaurant job, worked as a research assistant/editor for a professor, was the super of my\napartment building for money off rent, and I ate a lot of beans and bulk oatmeal. It is doable if you hustle. Those 3 letters after your name for life are worth the short term struggle!", "author": "ahg220", "created": 1606191976, "upvotes": -6}, "gdeo3fh": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeo3fh/", "text": "I used to steal hand paper towels for my lab... You could use that idea for TP but it'll be a little coarse", "author": "spruce-it-up", "created": 1606190881, "upvotes": 3}, "gdentkp": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdentkp/", "text": "You’re in luck that as a graduate student you are seen as a more eligible candidate for sperm donation. You can make 4,000$ in as little as 6 months!", "author": "LiveNDiiirect", "created": 1606190714, "upvotes": 27}, "gdenobe": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdenobe/", "text": "When I lived off ~800 CAD/mo (~700-750 USD at the time) in Vancouver as an undergrad more than a decade ago, I took advantage of the free coffee in the lab as an appetite suppressant. Caffeine helps you feel hunger less. There was lots of rice, but that went up in price. Events on campus with free food. On-campus student family housing was a nice source of, err, cheap paper-trail-free sublets, or so I heard from a friend. Just make sure you have alternative washroom arrangements for when the family of four with kids needs to, well, do basic life things that take as long as one would expect from a family of four with kids. Still not sure how the math worked out those few months. I certainly don't have the mental fortitude to pull off something like that anymore.\n\n\nThe fact that you're making basically that today as a freaking *working* Masters student is beyond shameful. I'm sorry. And at a time when free food, the very foundation of campus life, primary producer of the ecosystem if you will, is no longer a thing because COVID...", "author": "Hemimastix", "created": 1606190629, "upvotes": 9}, "gdencmk": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdencmk/", "text": "Our university doesn't allow us to work a second job on our $1000/month stipend so make sure you follow the rules. Escorting may be considered a job so double-check with your advisor.\n\nIf you stay late enough you can sleep/live in the office/lab without anyone noticing. You may even get commended for your hard work.", "author": "nothing_to_be", "created": 1606190439, "upvotes": 40}, "gdelyo9": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdelyo9/", "text": "Holy crap. I TA’d one ONLINE class this semester, literally answered maybe 4 questions and graded 3 labs. And I make $1600/mo stipend", "author": "Rebel228", "created": 1606189641, "upvotes": 5}, "gdekx51": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdekx51/", "text": "I had to turn down a school because they were only going to offer me $800 a month... In a west coast(ish) city... that wasn't even the rent of most studios there. Literally a university in Indiana, one of lowest costs of living in the US, offered me more.", "author": "Bugsnatch", "created": 1606189048, "upvotes": 4}, "gdekvj7": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdekvj7/", "text": "Go vegetarian. The earth is covered in salad.", "author": "jkittylitty", "created": 1606189022, "upvotes": 24}, "gdekff1": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdekff1/", "text": "As someone who has a stipend of $500 a month I am awaiting these replies!!", "author": "ennyj1993", "created": 1606188773, "upvotes": 38}, "gdek147": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdek147/", "text": "Basically got all I could from food banks & the rest from donating plasma twice a week for $70 a week. \"Borrow\" a little extra toilet paper each time you go at school & ride out Ramen, rice & beans for awhile. It passes quickly when you're busy!", "author": "AnesthesiaDReamer", "created": 1606188562, "upvotes": 8}, "gdejuyf": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdejuyf/", "text": "That's...highway fucking robbery. Holy hell. A stipend that paltry should be a given, and then supplemented with a teaching assistantship. When I was doing my PhD my university gave me more than that, converted to CAD and everything, for doing one course. I'm so sorry.\n\nUniversities don't value graduate students or postdocs anymore. Even the professors are a toss-up nowadays.", "author": "purple_ombudsman", "created": 1606188467, "upvotes": 18}, "gdejuan": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdejuan/", "text": "$900 for two classes!? That is so not right. Aldi has some pretty good inexpensive but quality cat food...and people food as well.", "author": "elfears11", "created": 1606188456, "upvotes": 8}, "gdejeqa": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdejeqa/", "text": "You should take the advice my grad program advisor gave me when I almost didn’t get funding— sublet your apartment and rotate around friends’ couches for the semester. Then maybe you can afford the occasional roll of toilet paper.", "author": "eagey1193", "created": 1606188213, "upvotes": 14}, "gdej452": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdej452/", "text": "Here’s a tip: fasting and then eating one bigger meal per day will make you feel more full than eating multiple meals that are too small throughout the day. That’s because when you get used to fasting, your body suppresses hunger signals, partially because you’re not spiking insulin levels repeatedly.", "author": "HouseNegative9428", "created": 1606188051, "upvotes": 12}, "gdehwyy": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdehwyy/", "text": ">What are some good free alternatives to toilet paper?\n\nNot entirely free because of the up-front cost, but I would highly recommend a bidet!", "author": "langmuir1", "created": 1606187388, "upvotes": 6}, "gdehtpq": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdehtpq/", "text": "\nTwo words = intermittently fasting. \nClearly ‘Big Intermittent Fasting’ is pulling the strings to determine stipends. \n\nJokes aside: sorry you’re in this position. This is atrocious. My university has a higher stipend for TAing a single class.", "author": "sciencechick92", "created": 1606187339, "upvotes": 9}, "gdehca0": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdehca0/", "text": "Made me giggle out of spite", "author": "didtjdcns", "created": 1606187076, "upvotes": 17}, "gdeharo": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeharo/", "text": "Bwahahahaha. \n\nMy uni pays me $1600/mo for 15-hours/wk on a single class, but I have to pay tuition off it so my stipend ended up being $900/mo. \n\nGranted I live in one of the cheapest states in the union, and I’m still scrambling to get enough to pay for the egregious international student insurance bill ($780 out of my budget because I’m a dumbass who forgot about it in my calculations). \n\nLots of chicken, rice and noodles. Lots of veggies. Eggs and bread for breakfast. Dinner is optional and often replaced by peanut butter sandwiches. \n\nLots of coffee and water and that’s it. No luxuries, drive as less as you can, it’s tight as hell but being busy 24/7 also helps in minimal spending. A beer with a friend once in a while ended up being a bottle of wine a week thanks to Dr. Corona, but eh. If you don’t drink, substitute that massive expense with a rewarding No. 4 combo from McDonalds to celebrate another week of not starving to death and barely sleeping. \n\nThis is the life we chose lol. I somewhat and somehow like it. It’s all in the passion for your field...and not going out...and having sponsor friends from time to time God please end me soon.", "author": "Missapizza", "created": 1606187054, "upvotes": 44}, "gdeh6sx": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeh6sx/", "text": "In all seriousness, please check if your university has a food pantry! Many do and are open to students, staff, and faculty, and they should have a \"no questions asked\" policy.", "author": "nitro1542", "created": 1606186993, "upvotes": 144}, "gdegclr": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdegclr/", "text": "Instacart has been a blessing to me. Good luck!", "author": "ProfRavenclaw", "created": 1606186531, "upvotes": 8}, "gdeg65b": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeg65b/", "text": "Not saying you should do this, as I'm sure it is highly illegal, but I may have allegedly lived in my office for a while when not being able to afford a car payment and having awful public transport 🤐", "author": "shunbrella", "created": 1606186435, "upvotes": 176}, "gdefnpi": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdefnpi/", "text": "Non traditional Master’s student here. Are you all serious about the cat food? I am so sorry!", "author": "iopsychhopeful", "created": 1606186160, "upvotes": 7}, "gdefdca": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdefdca/", "text": "Beans and rice boys!\n*Beans and rice*", "author": "Mangek_Eou", "created": 1606186006, "upvotes": 29}, "gdedli4": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdedli4/", "text": "Are you a PhD or MS?", "author": "rooster_comb", "created": 1606185061, "upvotes": 17}, "gdec2na": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdec2na/", "text": "Jeez what university gives $900 a month? and for two classes? mine gives much more and we're only responsible for one (or some not at all depending on funding path)", "author": "nickyfrags69", "created": 1606184270, "upvotes": 73}, "gdebnp0": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdebnp0/", "text": "Damn that's about what I got for my masters stipend (2011-2013)... I'm so sorry.\n\nI ate free food in campus at least once a week from various activities I wasn't involved in, and sometimes took some home. I also ate lots of canned beans, frozen vegetables, and rice/pasta.", "author": "1piperpiping", "created": 1606184049, "upvotes": 76}, "gdebdty": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdebdty/", "text": "I go for dry cat food in bulk and soften with water personally. \n\nAlso for anyone who is may be struggling financially to eat or is looking to stretch their budget further, there is r/eatcheapandhealthy", "author": "TBUmp17", "created": 1606183905, "upvotes": 39}, "gdeba3s": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gdeba3s/", "text": "Wet cat food? Wow so much for class solidarity, Mr. Bourgeois over here. You can get the best calorie/$ from the closest Mars warehouse's expired candy, usually reserved for cattle feed", "author": "dark_rug", "created": 1606183851, "upvotes": 107}, "gde9q7g": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gde9q7g/", "text": "Get yourself a sugar mamma! College students get a free account", "author": "coops389", "created": 1606183027, "upvotes": 57}, "gde9g0z": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gde9g0z/", "text": "You can always make an OnlyFans. I have a guy friend who actually makes okay money from that (supplementary to his TA stipend). So, you don’t have to technically be an “escort.”", "author": "PaleoNimbus", "created": 1606182878, "upvotes": 175}, "gde7cmj": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gde7cmj/", "text": "[deleted]", "author": null, "created": 1606181756, "upvotes": -22}, "gde5umt": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gde5umt/", "text": "Make sure you steal TP from the university. That’ll show them!", "author": "stickittothe", "created": 1606180947, "upvotes": 611}, "gde2f00": {"link": "/r/GradSchool/comments/jzue20/question_about_living_on_a_900month_stipend/gde2f00/", "text": "You'll want the wet cat food because you can just get your daily moisture needs from there rather than turning on a tap and wasting water by drinking it, so just get Friskies. It has larger portions and is way cheaper than Fancy Feast.\n\nSteal tp from any establishment that's still open to the public. Car dealerships are great for this. Many of them also have free snacks if you want a change from the Friskies.\n\nNo one cares how fat you are if you show feet and/or hole. Go wild!\n\nMe, I had no choice but to take out a student loan. Terrible, I know. 😔\n\nEdit: I'm not kidding about the car dealerships...", "author": "ozamatazbuckshank11", "created": 1606179086, "upvotes": 194}}}