{
  "sid": "qr2b0d",
  "link": "/r/GradSchool/comments/qr2b0d/is_it_harder_to_find_a_entry_level_job_in_the/",
  "title:": "Is it harder to find a entry level job in the summer or fall semester?",
  "text": "I was planning to graduate in the summer but was told that this would reduce my employability since 'most entry levels jobs are offered in the spring'.  Now I'm worried and am considering moving my graduation forward to get a better chance of finding a job.  Is this true at all? I feel like there would also be more competition in the spring due to more graduations occurring during that time which would counteract this.  What are your experiences?  Thanks",
  "author": "dirtsquared",
  "created": 1636573078,
  "updated": 1636656518,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk42k8g": {
      "link": "/r/GradSchool/comments/qr2b0d/is_it_harder_to_find_a_entry_level_job_in_the/hk42k8g/",
      "text": "I think the first of all, this could easily vary by discipline and vary by graduate degree type.\n\nThen, given the pandemic, what happened in 2020 could definitely be different from the past.\n\nAnd then how likely are you to find someone who looked at the job market carefully in both semesters?\n\nIn other words, this question seems unanswerable with any degree of reliability. At the very least, you should edit your original post and say what discipline you're in, the degree you'll have, and what kind of job you're looking for.",
      "author": "raistlin65",
      "created": 1636575818,
      "upvotes": 3,
      "replies": {
        "hk7ivbb": {
          "link": "/r/GradSchool/comments/qr2b0d/is_it_harder_to_find_a_entry_level_job_in_the/hk7ivbb/",
          "text": "I'm graduating with an MS related to computer vision.  I'm looking for jobs in computer vision, robotics, data science / machine learning and programming in that order.",
          "author": "dirtsquared",
          "created": 1636642829,
          "upvotes": 1,
          "replies": {
            "hk7ji6z": {
              "link": "/r/GradSchool/comments/qr2b0d/is_it_harder_to_find_a_entry_level_job_in_the/hk7ji6z/",
              "text": ">At the very least, you should *edit your original post*\n\nAnd you should do that, because people don't always read through all the comments on Reddit if they can't address your original post.\n\nGiven that it's now been almost a full day, you may need to repost your question with a more contextualized explanation for it to get attention. And it would certainly help to put the field of study in the title, so that people familiar with your field don't skip reading your post.",
              "author": "raistlin65",
              "created": 1636643114,
              "upvotes": 1,
              "replies": {
                "hk7mvbj": {
                  "link": "/r/GradSchool/comments/qr2b0d/is_it_harder_to_find_a_entry_level_job_in_the/hk7mvbj/",
                  "text": "Thanks, I will consider reposting",
                  "author": "dirtsquared",
                  "created": 1636644595,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk6amfe": {
      "link": "/r/GradSchool/comments/qr2b0d/is_it_harder_to_find_a_entry_level_job_in_the/hk6amfe/",
      "text": "People are telling you a bunch of nonsense. Jobs open all the time. Particularly right now, employers are having more vacancies and having a harder time filling them. Start looking for jobs when you get closer to gratuation. Don't limit yourself to \"entry level\" if you are qualified for more.",
      "author": "IkeRoberts",
      "created": 1636612843,
      "upvotes": 1,
      "replies": {}
    }
  }
}