{"sid": "pn8hgc", "link": "/r/GradSchool/comments/pn8hgc/should_i_dropout_i_dont_know_what_to_do/", "title:": "Should I dropout? I don't know what to do.", "text": "I don't know if I'm smart enough for grad school. I've never had so many thoughts of wanting to drop out of school or just wishing I'd die so I don't have to continue. \n\nIt's just one course I need to get through and I would be okay but I don't even know if I'll pass. I've been looking for tutor but no luck. I have an apartment lease of 18 mos and I've been looking at either breaking the lease or finding a job here so I can just pay the rent and leave the city after. \n\nWhat should I do? I've never been so overwhelmed by school, I don't even know if it's the actual grad school itself or the one course at this point but I have buyers remorse and I want a refund...", "author": "ShrimpyleShrimp", "created": 1631507747, "retrieved": 1632844600, "over_18": false, "upvotes": 12, "upvote_ratio": 1.0, "comments": {"hcoal5v": {"link": "/r/GradSchool/comments/pn8hgc/should_i_dropout_i_dont_know_what_to_do/hcoal5v/", "text": "I’m very concerned that you said you wish you would die so that you don’t have to continue. Maybe you were exaggerating to make a point, but if you are not (with my last job I would debate driving my car into a pole on the side of the road on the way to work on a weekly basis so I would end up in the hospital for a while and not have to deal with the unbearable stress) please speak to a professional ASAP or get out. You have other options for the direction your life takes now. You have none if you are dead.", "author": "UleeBunny", "created": 1631528607, "upvotes": 4}, "hcnokt5": {"link": "/r/GradSchool/comments/pn8hgc/should_i_dropout_i_dont_know_what_to_do/hcnokt5/", "text": "Hmm.. at least knock out 1 year.  Since you just started, you haven’t really experienced anything.  Coffee will help a lot and hopefully you can make some friends in the program to make the experience more pleasant!", "author": "carawaythecat", "created": 1631509883, "upvotes": 1}, "hcnn3c0": {"link": "/r/GradSchool/comments/pn8hgc/should_i_dropout_i_dont_know_what_to_do/hcnn3c0/", "text": "How sucky it may sound, it would be best to finish if it is only one course left, otherwise all your other work up until this point would have been for practically nothing.  And it does sound a bit like you have a case of imposter syndrome. Because you don't think you are smart enough and yet you completed all the courses except one. Sounds pretty smart to me.\n\nBut if it makes you feel better, you could start looking for a job and if it turn out you can't finish, then make a switch, but never give up because you think it is going to be hard as I can assure you, you will regret that afterwards. Just keep your head up and try your best. And remember your almost done.", "author": "robidaan", "created": 1631508875, "upvotes": 5}, "hcnmn4l": {"link": "/r/GradSchool/comments/pn8hgc/should_i_dropout_i_dont_know_what_to_do/hcnmn4l/", "text": "Dropping out of grad school was one of the best life decisions I ever made. If you’re deep into it, maybe just fight to the end.  If you’re early, then follow your gut. Real Life and grad school are completely different, and I hate to break it to you, but as it concerns real jobs/ real $$$, few people are less hireable than freshly-minted PhDs.", "author": "carawaythecat", "created": 1631508587, "upvotes": 0}}}