{"sid": "pr6d5i", "link": "/r/GradSchool/comments/pr6d5i/would_it_be_possible_to_apply_for_a_social/", "title:": "Would it be possible to apply for a social science Masters with a humanities degree?", "text": "Not sure if this is the right place to post this, if not please delete. \n\nI’m currently doing a humanities and language degree (french and Philosophy) and I really want to study a social science (sociology) after completing my undergrad. \n\nI was wondering if there’s anything I can do now, in my first year, to bolster my future application and ensure I’m a viable candidate and able to compete with sociology undergrads. \n\nThanks.", "author": "frantzcanon", "created": 1632051606, "retrieved": 1632952197, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"hdhn1hp": {"link": "/r/GradSchool/comments/pr6d5i/would_it_be_possible_to_apply_for_a_social/hdhn1hp/", "text": "I might be wrong, but my understanding was that outside the hard sciences, most masters degrees were pretty flexible about what degrees you’d done at undergrad, mostly due to the fact that many of them don’t have a direct path into them anyway.", "author": "Gauntlets28", "created": 1632074239, "upvotes": 2}, "hdh7qrh": {"link": "/r/GradSchool/comments/pr6d5i/would_it_be_possible_to_apply_for_a_social/hdh7qrh/", "text": "Absolutely. I went from humanities to social science.\n\nA couple things. First, you’re a first year student? Why not change majors? If for some reason that’s just not an option, second, take as many elective sociology courses as you can. Third, take some math, stats, and maybe CS courses, I wish I had taken way more than I did.", "author": "ThrowawayHistory20", "created": 1632068151, "upvotes": 4}, "hdgrz6p": {"link": "/r/GradSchool/comments/pr6d5i/would_it_be_possible_to_apply_for_a_social/hdgrz6p/", "text": "My undergrad was in history and French and I had no trouble getting into a social science/business masters (now in a PhD program). Lack of experience in stats might put you at a slight disadvantage but nothing that can’t be fixed with one, maybe two courses which might be required of everyone in the masters program anyway. Especially if you can leverage your experience studying French and philosophy into your sociology interests, at least for the application process, you’re in a better position than you think.", "author": "squeezicks", "created": 1632061424, "upvotes": 2}, "hdgfmkb": {"link": "/r/GradSchool/comments/pr6d5i/would_it_be_possible_to_apply_for_a_social/hdgfmkb/", "text": "I did an undergrad in Philosophy with a couple of electives in maths, communication, media, etc. I have also been interested in branching out into social sciences at some point. Currently, I'm doing my masters in Philosophy with some courses from social sciences.\n\nWhen I was applying for grad schools the previous fall, I realised that grad schools in social sciences usually require atleast some coursework in statistics, some maths, research methods, and of course, genuine interest in topics of social sciences and how they connect to what you're studying now. \n\nProbably you don't need to worry too much at this point, but just keep taking courses which will help broaden your understanding of social sciences and how it can be connected to philosophy and french. For example, a course in Philosophy of Social Science, Social Metaphysics, Philosophy of Science, etc. will definitely help. If possible, audit courses or take electives from the department of sociology. Just stay in touch with people from multiple backgrounds and try to attend their events! In your grad school applications, you can always stand out because of your diverse background and interests, rather than thinking of it as a 'weakeness'. Just depends on what you can bring to the table.", "author": "breadjupiter", "created": 1632055049, "upvotes": 2}}}