{"sid": "ll30p3", "link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/", "title:": "What’s your favorite “he’s a doctor now” story?", "text": "Maybe it’s about your undergrad or your masters student. Maybe it’s about your PI. Maybe it’s about you! But we all have stories about knucklehead moves in the lab from people who go on to become doctors. My story is about Jerry.\n\nJerry wanted to make 10X PBS. I pointed him, for the third time, towards our binder of lab recipes. I reminded him that we were low on NaCl, of all things, because he hadn’t ordered it after dropping the container weeks ago. I suggested making half of the recipe. Half a liter, instead of a liter.\n\n*Half a liter?*\n\nHe always repeated my instructions in question form.\n\nI nodded. He didn’t move. I gave him time to think.\n\n*What size beaker should I use?* \n\nHe wasn’t the most independent student.\n\n*One that fits half a liter, at least.*\n\nHe nodded and mulled things over in front of the glassware cabinet, eventually settling on a 2L beaker. \n\nI watched to make sure he used the right tap before turning back to my dissection.\n\n*What do I add next?*\n\nI kept my eyes on the microscope. \n\n*It’s in the recipe book.*\n\nI heard him flipping through the pages and then I heard him mutter. \n\n*80 grams.*\n\nI looked up. \n\n*Jerry.* \n\nHe looked at me.\n\n*Half a liter, instead of a liter.*\n\nHe looked at the beaker.\n\nHe looked at me.\n\nHe looked at the beaker.\n\n*But I already put the water in.*\n\nI turned back to my dissection.\n\n*It’s just water, Jerry.*\n\nHe didn’t move. \n\n*It’s just water, Jerry. Pour half of it out, pour it all out and start over, whatever you want.*\n\nHe didn’t move. I waited for him to repeat my instructions in question form.\n\n*Pour it out?*\n\nI looked up from my dissection and nodded. \n\nHE POURED IT OUT RIGHT THERE ON THE FLOOR, GUYS.\n\nTo give credit where credit isn’t really due, he did realize something was wrong the moment the first drop hit the ground. He looked at me and made the face that I can only assume inspired the 😬 emoji.\n\n*I... I guess I should do that in the sink?*\n\nJerry is a doctor now.", "author": "sirtwixalert", "created": 1613479343, "retrieved": 1632845170, "over_18": false, "upvotes": 1117, "upvote_ratio": 0.99, "comments": {"gnrmw99": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnrmw99/", "text": "I'm in a DVM/PhD program, almost finished with my PhD. Every time I get frustrated with my undergrads for doing dumb things, I remind myself of my first experience shadowing at a veterinary hospital.\n\nVery nice vet came over, handed me vaccine vials, and said, here, you can get some practice drawing these up.\n\nI asked the vet how much of the vaccine to draw up.\n\nHe said, all of it.\n\nAnd I could literally feel my brain splutter. Those words had no meaning to me in that moment.\n\nBut...How much do I draw up?\n\nVet patiently says ...All of it.\n\nI swear this exchange happened twice more before he just took the vials from me, said \"We'll try again another time\", and never asked me to do anything again for the duration of my time there. \n\nI was very successful as a veterinary assistant a few years later, I swear.", "author": "biologynerd3", "created": 1613572408, "upvotes": 5}, "gnqxday": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnqxday/", "text": "As a self proclaimed idiot, this post gives me a lot of hope", "author": "friedchicken_legs", "created": 1613552274, "upvotes": 2}, "gnqd0ta": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnqd0ta/", "text": "Please don't rag on Jerry, this was kind of me not too long ago :( I think it was the nervousness of being asked to do something on the spot and do computations in front of everybody for the measurements, and then everybody watching me as I did it.", "author": "deepfriedokra", "created": 1613537340, "upvotes": 7}, "gnppp2u": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnppp2u/", "text": "This thread is infuriating", "author": "corgibot55", "created": 1613524753, "upvotes": 1}, "gnphgcs": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnphgcs/", "text": "Not a doctor but a nurse. \n\nAbout four years ago, my high school honors A&P course, we had a lab where we took each other’s blood pressure. This girl didn’t read the lab manual, had never taken anyone’s bp, strapped the cuff onto my arm and started inflating. She started over and attempted taking my bp NINE times in thirty minutes.  had legitimate bruises after that class. She also got a D or lower on every exam in that class, which was a lot less extensive than college A&P. She’s a nurse now. I hope she got a lot better at it 😂", "author": "nik_amber", "created": 1613520503, "upvotes": 11}, "gnpcmih": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnpcmih/", "text": "I have said some of the stupidest things ever during class discussions, and my sweet advisor/prof has always found a way to make it make sense and ask me if that’s what I meant. Like I remember saying something antithetical to one of the most basic things in our field and everyone looking at each other kinda shocked/confused. Which yikes. I think what happened was I had a good point that was validated and then I just kept talking until I was wrong... idk. He’s like quickly and graciously swept my Jerryness under the rug, which I am very thankful for", "author": "xAhaMomentx", "created": 1613518077, "upvotes": 4}, "gnpcexb": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnpcexb/", "text": "I work in a microfabrication research lab and my Jerry is a junior PhD student. Let’s call her Irene. \n\nI was helping Irene with a simple aluminum deposition onto a silicon wafer to make back contacts for her device. After the deposition is done, I check her wafer and everything is a-ok. I leave her to finish the rest of her device and measure it, and go on my way.\n\nA few days later, the postdoc in charge of Irene’s project messages me. “Are you sure Irene’s wafer had metal on it?” I said I was sure. Apparently, all the metal had disappeared off of Irene’s wafer overnight. And oh yeah, Irene only thought to mention this fact to the postdoc after she had already finished fabricating and measuring the device (which had no back contacts and was basically missing a major component to make it functional).\n\nWe grilled Irene: “are you sure you cleaned the wafer properly? Did you store it properly?” Etc. Irene is adamant she did everything correctly, and the metal just fell off and disappeared overnight.\n\nI mention this issue to a senior research associate in my lab. Research associate tells me, “That’s impossible. Either the deposition never happened, or she has the wrong wafer.” \n\nI tell Irene to check her samples again. It turns out, Irene had 2 silicon wafers stored in similar-looking sample holders, one that she deposited the metal on, and one that she didn’t. Guess which one she grabbed by accident and ended up using for her (non-functional) device? Without a word, Irene repeated the entire fabrication process onto the correct sample. \n\nI would say that the Mystery of the Disappearing Aluminum easily ranks in the top 5 stupidest mysteries I have ever had to solve in my life.", "author": "Lpcvd", "created": 1613517973, "upvotes": 8}, "gnp91yc": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnp91yc/", "text": "As an undergrad, I had a geology professor who HATED one of his grad students for, from what I could tell, being more or less a copy of Jerry.", "author": "stolid_agnostic", "created": 1613516315, "upvotes": 3}, "gnomkgw": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnomkgw/", "text": "Masters student 1 holding a bottle of chloroform, jokingly: \"does this smell like chloroform to you?\"\n\nSheltered and naive masters student proceeds to take the bottle and take off the lid and lift it towards his face.\n\nMS1: \"No no nonononononono don't do that! ...It's a joke. It's really chloroform.\" \n\nSaNMS: stares blankly. \n\nWe honestly all thought the unscrewing etc was an elaborate play-along. It wasn't. \n\nSame person was asked if he understood a particular technology in his phd viva (obviously progressed). Gave a confident yes. Things fell apart when they were told to proceed and rather than backing down just wildly grabbed at technical-sounding words involving electron transfers of dyes producing light. Reviewers were just looking shocked at each other like \"did that just happen?\" \n\nTBF, I only know that story because the person was self-deprecating enough to tell me about it straight after. \n\nAlso once asked me if women could orgasm during sex. 26 years old. Like I say, naive. \n\nIs now an absolutely excellent post-doctoral scientist, who understands the techniques they do. Also has a wife and kids, so hopefully the orgasm talk was successful.", "author": "flashmeterred", "created": 1613506170, "upvotes": 26}, "gnokvwo": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnokvwo/", "text": "Solid topic, op. I love these types of posts. I have some stories...just need the time and energy to write em out.", "author": "Suhnami", "created": 1613505404, "upvotes": 17}, "gnodku4": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnodku4/", "text": "Had a summer student join the lab next to mine. He lied on his CV and said he knew how to do stuff that he didn’t know how to do, so the PI, who had clinical duties, relied on us to teach him.\n\nFirst off, the first thing that annoyed everyone was that he was a follower of the pickup artist/redpill crew that rely on “negging” women in order to gain their attention (this was like 10 years ago). So that was happening. \n\nHe was doing his first ever western blot, and whoever showed him how to use the developer thought it was okay to leave him in there alone. He comes back with an empty film.\n\n “It didn’t work”.  He says as he returns to our area.\n\nWe start inspecting the blot, and it was completely blank. \n\n“Alright, I guess we need to do a longer exposure. Pull your blots out and we’ll redo the detection reagent.”\n\n“The machine took them” he states.\n\n...\n\n“What do you mean the machine took them?!”\n\nHe then opens the cassette, showing us that he indeed no longer had the blots or even the white insert that sits in the cassette as well.\n\nI’ve never seen 2 techs and a grad student sprint so fast to the dark room. We enter, to find the machine beeping and alarming and the blots are nowhere to be found.\n\nWe ended up needing to call someone to repair the machine, as he had apparently fed not only the blots, the cardboard, but also NINE films that never came out the other end. \n\nIt doesn’t end there. After proving utter incompetence in the lab, this guy is relegated to outlining a review for the PI. Halfway through the summer, he decides he’s done doing that and decides that he’s just going to spend the summer going clubbing and studying for his MCAT. So he would come in at 11 every morning, hungover, and study from noon until 3, and then leave. His PI stopped interacting with him once it became clear he was no longer doing any relevant work.\n\nOn his last week, he marches into the PI’s office with an outline not of the review, but of a letter of recommendation that he would like her to write. She said to him that on no uncertain terms would she be writing a letter of recommendation for him. Not only did he lie on his resume, but he did absolutely zero lab work during the months of July and August. He stormed out muttering something about “a waste of a summer with no letter” and the PI thought that was the last she would hear of him.\n\nNope.\n\nThe following week she received an email, basically saying now that she’s had time to “cool off” would she consider doing the right thing and wrote the letter. The PI reaffirmed her firm position, and he proceeded to threaten her with violence. He knew where she lived, as she had had a lab dinner at the start of the summer, and she also lived alone. So she was rightfully terrified and reported him to the police. He was banned from campus for life.\n\nHe’s also a doctor now is my understanding", "author": "Chahles88", "created": 1613502099, "upvotes": 52}, "gnoafef": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnoafef/", "text": "I had a student who was an undergrad at a top 5 research institution who liked to occasionally get high before coming into lab. He thought we didn’t know, but he seemed to forget that we were all once in college too. He was extremely intelligent, but coming in high was pretty unacceptable. He would often sneak in and start working with his headphones in so no one would to talk to him, so there were times when he’d go 45 minutes before we realized he was high as hell.\n\nHe would do repetitive tasks like grind up tissue for us. One day, he was grinding mouse aortas with a mechanical homogenizer, it looked kind of like a tiny immersion blender. Well, after he was done and handed off the “ground” tissue, I took a look at the homogenizer to realize there were like 3 or 4 WHOLE aortas tangled up in the teeth. \n\nI point this out to him. It was the first time I talked to him all day, and I realize he’s high as hell on a Friday afternoon. \n\nSooo.... I sent him on a wild goose chase. I told him we needed a special piece of equipment called a “tissue magnet” to get all the aorta out of the teeth. I sent him to the tech in the next lab over, then to the grad students across the hall, then to the post doc in our lab, and finally to the lab manager, all of whom were in on it and all of whom knew exactly what was up and proceeded to give him the runaround for the better part of an hour. \n\nFinally, I asked him to think about whether a tissue magnet could even exist. “Oh, you mean like I need to invent one in order to clean this thing?” No dumbass, stop coming to lab high. Get out. \n\n...he’s got an md/PhD now.", "author": "Chahles88", "created": 1613500742, "upvotes": 65}, "gno9h2j": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gno9h2j/", "text": "Ooof in my friend's lab they had a grad student boil **9 molar nitric** **acid** out on a bench top, unsupervised *over the weekend*. Best part was it wasn't even for lab stuff it was a personal project. He was gonna use it to make some treatment for his garden. Anyway everyone in there had to fill out OSHA forms after that and get checked out by a doctor because of the **9 molar acid ambiently boiling away for days.** He was asked to leave the lab after that.\n\nAnother time that was kinda funny: one of the masters students in our lab was working with Androgen receptor KO mice for a sex difference experiment. For maybe 5 months she was only getting female mice. Every litter. 100% female mice. She couldn't figure it out, my PI even was baffled. They were checking the temperature in the facility, scratching their head. And then they remembered that Androgen receptor KO male mice do not mature sexually and present as females. The entire scope of their experiment was sex differences and they just forgot about that. She genotyped her mice from there on out.", "author": "raucous_Toad", "created": 1613500324, "upvotes": 53}, "gno922t": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gno922t/", "text": "Just in solidarity to Jerry, I had a lab interview where I was asked to calculate grams or molarity of a substance for a buffer. Well to save my life I couldn't remember C1V1=C2V2 and just stood in abject horror and embarrassment. I remembered later on in the interview and told the interviewer, but I'm sure she thought I was an idiot. Yet she was nice enough to not only hire me, but I have recently been accepted to do a Master's in her lab, so happy ending in the end. I always think of that equation before I talk to other PIs though, just in case haha", "author": "comphypotato", "created": 1613500141, "upvotes": 22}, "gno88n5": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gno88n5/", "text": "Helping a fellow student troubleshoot a PCR, \n\nI said “Let’s double check your primers, and make sure they’re the correct sequence.” \n\nSo I walk over to their computer and sit, with intention toward looking at the file containing primer sequences. \n\n“Alright pull them up”. \n\nSo they get up and walk away, leaving me very confused. They come back 5 minutes later with the tray of frozen primers, like the tubes they get shipped in, and they pull the two primers out in question and hold them up to the light, visually inspecting the clear liquid. \n\nNow I, playing along because I’m understanding the massive misunderstanding,  stand up and also take a look at the clear tubes. \n\n“Well, the tubes look great, now let’s take a look at the sequences on your computer”\n\nsuddenly they turn beet red when they realize that they’ve clearly misunderstood and we both couldn’t help but laugh our asses off for 5 minutes.", "author": "Chahles88", "created": 1613499785, "upvotes": 46}, "gno57xi": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gno57xi/", "text": "Poor Jerry, frightened to his wits. I can imagine that he didn’t understand what he was doing, or what for.", "author": "knoxyal", "created": 1613498466, "upvotes": 11}, "gno31i4": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gno31i4/", "text": "This was technically in undergrad, but enjoy. In my physiology lab our TA had little anatomy experience and I worked as a veterinary technician while going to school. Due to my animal anatomy experience, our professor had me provide support during labs quite frequently.\n\nDuring a class experiment on testosterone in rats we had several that we had to castrate. One student (who I shared a research lab with) asked me why the testicle he was about to ligate appeared so....see through.....it was the bladder. That classmate is a doctor now....MD.", "author": "SlarfBucket", "created": 1613497517, "upvotes": 22}, "gnnv59j": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnv59j/", "text": "You have Jerry; I have Andy.\n\nAndy was a first year med student doing an optional research lab rotation. Andy required weekly in-depth discussions on why he could not replace my De-ionized water with water from the regular tap (I even sourced KahnAcademy videos   for him.) This is not about Andy’s refusal to understand not all water is equal.\n\nAndy was working on an experiment that required measuring out 5mg of a caustic powder. I had throughly lectured Andy the prior two weeks on how to use the fume hood, PPE, and he quite irritably told me he could handle it  and yes he knew what he was doing (fine, I likely was being overbearing after once again making him get the correct type of water.) I turned to my own computer writing work.\n\nOne of my (precious, precocious) undergrads came into the lab a few minutes later, wandered over to Andy to observe, and loudly exclaimed “Dude, are you supposed to be doing that?!”\n\nI rush over to find that, in trying to measure out 5mg of a powder, Andy upended over half the bottle directly onto the lab bench. He was the  scooping the top of the pile directly onto my poor microbalance. Additionally, all of this was done outside of the fume hood and he had no gloves, mask, or PPE other than his precious short white coat (does that even count?) Andy was not allowed to be unsupervised for his remaining 2 months in the lab but got his MD in less time than I got my PhD. \n\nBonus: Much, Much too long after he left my (poor, naive, non-chemistry knowledgeable) advisor asked me if “Andy used up all of that chemical he ordered?”  ‘Chemical?’ I thought, ‘what chemical?’ After doing an exhaustive inventory search, I found 3gal of Picric Acid with maybe 100mL removed, and crystals most definitely forming on the screw lid.\nFor those unaware, picric acid left too long can very, very easily go Big Boom in such conditions. That was removed ASAP.", "author": "graygoohasinvadedme", "created": 1613494061, "upvotes": 133}, "gnnv2s6": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnv2s6/", "text": "My SO's story - undergrad micro lab, swab lab partners throat as a negative control, and compare with positive control with live S. pyogenes.  Yes, they swabbed their partner with a clearly labeled positive control and inoculated them with S. Pyo, and gave them strep throat.", "author": "wutwasthatagain", "created": 1613494030, "upvotes": 229}, "gnnnrj1": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnnrj1/", "text": "Ha! Who else is reading through these to make sure none of these stories are about themselves?", "author": "dogbonej", "created": 1613490757, "upvotes": 54}, "gnnktox": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnktox/", "text": "Not exactly grad school related, but similar energy.\n\nThis guy who lived across the hall in my freshman dorm got a 35 on the ACT and was a TRIPLE major. Math, physics, something else that was STEM related which I forget. He was incredibly smart, but had zero motivation to go to class or do any assignments. He felt he could play Call of Duty for hours on end every day, waltz into the midterms and final and save his grade that way.\n\nHis GPA after the first semester was abysmal, floating around the 1.0 out of 4 mark. He lost his full ride and later dropped out.\n\nA few years later, he's now a nuclear technician on a submarine for the Navy. I hope that makes you sleep better at night.", "author": "brofession", "created": 1613489396, "upvotes": 114}, "gnnjt9c": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnjt9c/", "text": "My friend told me about a fourth-year med student who rotated through the lab. He was melting the agarose in the microwave... in a flask capped with aluminum foil.", "author": "BelgaerThinker", "created": 1613488922, "upvotes": 67}, "gnnis1j": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnis1j/", "text": "Master's student trying to teach him tissue culture.\nOur cells needed extra stuff added to media so we'd make an aliquot based on how many/size of wells each time we changed media. He would always make 10mL whether he had 1 well of a 12 well (he wasn't good at keeping them alive) or he had three 6 well plates he hadn't killed yet. Everytime he would be surprised when he had so much left or ran out early.\nHe did not get his Masters'...(For other reasons such as not showing up and not reading or writing anything).", "author": "laziestindian", "created": 1613488426, "upvotes": 19}, "gnni9lk": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnni9lk/", "text": "idk, everyone ragging on Jerry but I'm lowkey identifying with him. Some of these kinds of mistakes or completely dumb moves can come from a place of severe anxiety and not necessarily incompetence... I've forgotten basic things and done idiotic stuff just from being so damn scared of making a mistake...", "author": "terminus1256", "created": 1613488178, "upvotes": 314}, "gnni9j6": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnni9j6/", "text": "[deleted]", "author": null, "created": 1613488177, "upvotes": 58}, "gnnh94f": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnh94f/", "text": "I wouldn’t be able to work with Jerry. \n\nSomething I read on Reddit chemistry couple weeks ago holds true (not in this class cause MS not PhD):\n“Just cause you have a PhD doesn’t mean you’re not an idiot”", "author": "Redd889", "created": 1613487675, "upvotes": 41}, "gnnfdym": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnfdym/", "text": "I actually laughed out loud", "author": "hasitsung", "created": 1613486748, "upvotes": 16}, "gnnerxf": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnerxf/", "text": "I used to work as a technician in a rodent lab, not involved with the studies, just swapping out dirty cages for clean, reporting births and deaths, and some minor medical care. I've had PIs ask me what's wrong with their rats (they didn't know rats have giant balls), why did their mice breed (they put male and female mice together), I've seen them put about 30 mice in one very small cage to euthanize them (HUGE NO), and I've seen cases where the PI just doesn't understand you have to euthanize the mice at a certain point. I think that was the worst, they had some study on cancer and they'd just let the tumors take over, push out through the skin, get infected, chewed on by roommates, etc. The PI thought they were allowed to just let the mice die on their own and would get mad when the in house veterinarian euthanized them. \n\nSo more of a \"those people are doctors??\"", "author": "FurretsOotersMinks", "created": 1613486434, "upvotes": 176}, "gnnd7n2": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnd7n2/", "text": "r/storiesaboutkevin", "author": "flybluejayfly", "created": 1613485620, "upvotes": 13}, "gnnagj9": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnnagj9/", "text": "In a lab I was doing a summer internship at the time as an undergrad, we got 2 new rotation students (both eventually ended up joining the lab). A postdoc was showing both of them how to pour agar plates...how to heat up the agar, when to add the antibiotics, etc. \n\n\nWhere the mess happened was when the postdoc instructed them to pour the agar into the petri dishes, after having laid them all out on the bench. I guess he forgot to mention he should take the lids off to pour, because they started pouring with all the lids on and it turned into a huge, jello-ey mess all over his bench. The postdoc just pinched the bridge of his nose is disbelief and told them to clean it up as he was walking away. Both of those grad students were able to get good papers out and graduate, so I suppose they learned their lesson!\n\n\nI have a lot of stories about another guy who was a grad student when I was an undergrad in a different lab. He made a ton of rather silly/borderline angering mistakes, but the oddest thing was that if I was doing tissue culture in well-plates or dishes, he would always marvel that it is a wonder that the cells could stay sterile in that environment. Making the comment once is okay I guess, but it was almost like he was newly marveled by the fact every. single. time. he saw me with a stack of plates.", "author": "bowdownpeasants", "created": 1613484120, "upvotes": 78}, "gnn9y4m": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnn9y4m/", "text": "If Ralph Wiggum got a PhD...", "author": "False-Guess", "created": 1613483834, "upvotes": 30}, "gnn9tr0": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnn9tr0/", "text": "We had a medic intercalate into lab, back when we were heavily into tissue culture. He wasn't very good, so there was a lot of hand-holding.\n\nOne evening, while working through a treatment protocol, and having prepared several 50 ml tubes of cells in suspension, he was told the following:\n\n\"OK, now take these cells, and put them in the water bath\".\n\nThe water bath had two inches of scuzzy water in it at 37C, and a couple of tubes in a rack.\n\nLaddie walked up to the bath, unscrewed the tops off his tubes, and dumped the contents into the water bath.\n\nHis supervisor caught the movement only as he emptied out the last tube.\n\nThere was a pause.\n\n\"OK. Now take them out.\"", "author": "Hasefet", "created": 1613483765, "upvotes": 334}, "gnn5h62": {"link": "/r/GradSchool/comments/ll30p3/whats_your_favorite_hes_a_doctor_now_story/gnn5h62/", "text": "How did Jerry pass prelim?", "author": "alalalal12345", "created": 1613481118, "upvotes": 53}}}