{"sid": "ce0mvt", "link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/", "title:": "Want to see your director of graduate studies squirm? Ask them about these career statistics! [Biology] / [Biomedical] / [STEM]", "text": "Hi Dr. DGS, thanks for taking time to meet with me :)\n\nI'm really looking forward to graduating with a PhD in [*insert biomedical field here*]. Now, we both know I'm probably not cut out for staying in academia, after all, only [10%](http://science.sciencemag.org/content/352/6286/663) of biological or life science PhDs land a tenure-track job within 5 years of graduation. And let's be honest, [*insert university name here*] isn't one of the top 25% of schools, which together account for [71-86%](https://advances.sciencemag.org/content/1/1/e1400005) of all new faculty. \n\nI *could* do a postdoc, but do I really want to work [50+](https://academic.oup.com/bioscience/article/63/4/245/253174)  hours / week to get paid [less](https://www.nature.com/articles/d41586-019-00587-y) than a new [college graduate](https://money.cnn.com/2018/05/14/pf/college/class-of-2018-starting-salary/index.html) even though I'll be [~9](https://www.nsf.gov/statistics/2018/nsf18304/datatables/tab27.htm) years older than said college grad? I mean, I definitely would if there were data that showed doing a postdoc would help my career in the private sector, but --*whoops!*\n\n[*accidentally drop studies (1-3) showing there isn’t any evidence a postdoc will actually benefit seekers of non-academic jobs.*]\n\nI mean what's gonna happen? It's not like if I do a postdoc, like most bio PhDs will, and then go into industry, I'll end up making [$12,000](https://www.nature.com/articles/nbt.3766)  per year less than if I had just skipped the postdoc altogether? Right?\n\nAnd do you think once I've got my PhD, and I'm making [~$37,000](http://science.sciencemag.org/content/350/6266/1367), will that be more or less than the salary of someone who skipped grad school all together and just got a bachelors in [philosophy?](https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors/page/8?orderBy=EarlyCareerPay&ascending=false) How about if I went into industry ([~$48,000/yr](http://science.sciencemag.org/content/sci/suppl/2015/12/09/350.6266.1367.DC1/aac5949_Zolas-SM.pdf)), would that still be less than the median for a new college graduate ([~$50,000](https://money.cnn.com/2018/05/14/pf/college/class-of-2018-starting-salary/index.html))? Should I be heartened to think that eventually a [biology PhD working the private sector](https://www.nsf.gov/statistics/2018/nsf18304/datatables/tab48.htm) will make more than [someone with a bachelors](https://data.bls.gov/PDQWeb/le) or should I keep in mind that data from middle aged workers all come from a market where PhDs were rare and can't adjust for the last several decades of record PhD production?\n\nHm, I guess I could always teach... which would probably mean adjunct status, since they teach [most](https://www.forbes.com/sites/noodleeducation/2015/05/28/more-than-half-of-college-faculty-are-adjuncts-should-you-care/) of the courses nowadays. If I went that route, I'd make about $25-40K/yr with little to no benefits, or I guess you could say: it would pay better to teach high school than college, which is kinda weird, but okay.\n\nBut gosh, I just love research! Maybe I should go private sector. I sure hope sticking with research doesn't mean I can expect to earn [less](https://pubsonline.informs.org/doi/pdf/10.1287/mnsc.1040.0241). And how many private sector bio PhDs get to actually stick with research anyway? Would you say the proportion of biomedical PhDs that stay in some form of research in the private sector is between 45-72% like in [this](https://www.nature.com/articles/nbt.3766) study? Or less than 10% like in [this](http://science.sciencemag.org/content/350/6266/1367) one? Because getting to pursue my (employer's) research interests was sort of central to the whole idea of getting a PhD in the first place!\n\nI just can't wait to really start my career! I bet you felt the same way back when more NIH funding went to “early-career” researchers (≤ 40 years old) compared to researchers ≥ 50 years old at a ratio of greater than 10. [*insert wry chuckle here*] Of course, nowadays that ratio has totally flipped and ten times more money goes to the older researchers. Maybe that's why some [74%](http://www.insidehighered.com/news/2013/06/17/data-suggest-baby-boomer-faculty-are-putting-retirement) of professors aged 49-67 plan to delay retirement past age 65 or never retire at all. I mean, do you think if you graphed the age distribution of NIH PIs from [1980 to 2010](https://nexus.od.nih.gov/all/2012/02/13/age-distribution-of-nih-principal-investigators-and-medical-school-faculty/) you'd actually be able to *see* the Baby Boomers get hold of the funding and then just hoard it? Heck, I bet there are more researchers with a major grant [75 years and older than there are 33 years or less](https://twitter.com/aarmey/status/565674331792244737)! No seriously, wanna bet? Let's put some money down; my stipend is paltry and I want to remember what meat tastes like.\n\nI sure am glad I was one of the lucky [30%](http://www.nature.com/naturejobs/science/articles/10.1038/nj7574-597a) of American grad students to report obtaining useful career advice from their institutions and not one of those other poor souls enmeshed in an exploitative pyramid scheme where the half-life of a researcher is only [5 years](https://www.pnas.org/content/early/2018/12/05/1800478115) and it doesn't even matter how much you produce. Ha! Publish and still perish! Am I right?\n\nCheers!\n\n[1] http://science.sciencemag.org/content/352/6286/663\n\n[2] https://www.nature.com/articles/nbt.3766\n\n[3] https://www.sciencedirect.com/science/article/pii/S0048733318302312#bib0465", "author": "Bill_Nihilist", "created": 1563300237, "retrieved": 1632846362, "over_18": false, "upvotes": 303, "upvote_ratio": 0.92, "comments": {"eu2xy5t": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/eu2xy5t/", "text": "Since most of the discussions here are regarding salary, I want to mention that the BioSpace Life Science Salary Report for 2019 is up: [**https://biospace.businesscatalyst.com/2019%20US%20Salary%20Survey.pdf**](https://hs-4413123.t.hubspotemail.net/e2t/c/*W5rh1lL2GCXQDV7GjnH3NK_Rb0/*W70tf768Bt-s3N6NZyM5Y4HbP0/5/f18dQhb0SnG_9jgNT8W4pD0kp799MphVxwylc2slCf_W3264L96DKzpBW1m2Dkx99bM-DW96R2lp7mWm7mW634p296b-FY_W50CtBc5twsQjW7nwMJH2z8ZWPW6c-1n_73j7ygN1P_hNTJ1tDcW1yss041BpBhJW1L4LKy2WtZKJW2GFmQX6zBgfKW89-wlQ7_JCwcMRBd_gMP9D0N95sM9DQJJn6W3LqnkD5w6MQpW1q7m9R8t7_VnW8m7Y9z5wM1V8W8q5FTl6rlG5bW8tzC3F8q-1tCN430mvlRFkK4W5G18Kh3y9KYQN3dgtM7DG_ZlW13pVkC8dLm8nN3jcgGlNFkT2N8yTTy_Cj0G3W3Q1vwR13lFMCW3C39m05PYn22W3y8g9c5RvfzHW3fLGvP3MpvJ3N3GYvC4-tSh1W5F3xX338__FCW3sFPqb8MMvHrW5lgqg514_bd0N6wydXJQC4XnN2zmswYVzQv-VVn7DD8G42D5W328Q638VSC40W7ynbwy6N8Cr-V42cYP3nNLKrW6pgKWz66rZCFW7ZdRXD8sg0twN44K1bVwN9DpW4zwk566gVCkGw3RHVgW9h5f6dK94p02)\n\nNot terrifically helpful because a lot of information is omitted to simplify graphs and several potential careers are left out, but at least something to breeze through for those freaked out by the OP.", "author": "theoinkypenguin", "created": 1563400658, "upvotes": 3}, "eu2f82d": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/eu2f82d/", "text": "It's moments like these that I realize how great my director is for telling me this kind of shit rather than lie to me. Straight up said that I would be good with just a masters for my career path", "author": "ashfneixbd", "created": 1563388818, "upvotes": 2}, "eu0ohu3": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/eu0ohu3/", "text": "LOL, joke's on you,  DGSs don't read student's emails.", "author": "asterysk", "created": 1563351876, "upvotes": 3}, "eu0myhh": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/eu0myhh/", "text": "I take issue with the age stuff. All the stats are true, but many of people's proposed solutions (get all the dinosaurs out) are suicide. Imo the only time I see \"young\"= college rhetoric is when I'm dealing with rich white people that can do k-12+. Studies actually show most undergrads 36-75% (depending on whether you count community college and online) are non-traditional students (parents, veterans, second career, older, doing a degree over twice as long etc). We will finish our phds in our 40s and 50s, not 20s like our privileged advisors. We will have so much debt we need to work till we are 85-90. We have no retirement and likely never will. I'd like a chance before I even start. But that's ageism for you... Works both ways. Destroyed my chances of advancing when I was too young, so I started a new career and now I'm too old. FML.\n\nAnyway, I would use phrases like \"new ideas\" and not young ideas or whatever else. Old bodies can have fresh, ahead of the curve ideas and young, thin, rich, white bodies can have monstrous ideas.\n\nI imagine that eventually we'll all unionize if we are lucky and probably come up with bargaining option that spreads resources fairly between newer academics and those with experience and tenure (which is fair). BUT will base that not on graduation dates, but on age (which is illegal). After we get that seemingly wonderful deal, a year will pass, we'll get a job or not and then eventually go to draw on those new faculty resources only to be told too old. Then we'll beg to keep our jobs but eventually be told no, too old. We'll default on our debt, end up homeless. But there's a silver lining!!! At least we don't have kids, because we were struggling financially so bad that 50% or so of us will choose to not have kids even though we want to. See, not too bad.", "author": "Astra_Starr", "created": 1563351151, "upvotes": 1}, "etzxxx8": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etzxxx8/", "text": "Oh God it burns.", "author": "TorchIt", "created": 1563338701, "upvotes": 2}, "etzxpco": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etzxpco/", "text": "Take heart, biomed PhDs... there are industry jobs, I even recommend going outside direct biotech into classic tech looking for a bio-angle. Classic tech/engineering payscales are far higher than biomed.\n\nFor example, I skipped a post-doc and applied to roughly 100 jobs looking in a very specific, non-bio rich area and received two offers. One from a large biotech conglomerate who offered $64k a year with paltry benefits and one in a traditional engineering company who offered $92k a year with not excellent, but solid bennies. I took the second offer and I love it. I am in the minority as a biologist, but that's a good thing in my line of work. I have received pay raises in 3 years that increased my salary over 10k in 3 years, plus bonus, plus other incentives. I have several patent apps, I love my work, it's engaging, and I am still involved with biotech 100%.\n\n&#x200B;\n\nI'm not a stellar candidate, I didn't have high impact first author publications or go to a top 25 undergrad or grad school. But I fit a niche and it's worked out well. Search long and hard and learn how to sell the skills you gain in grad school- the teaching you do is communicating with diverse backgrounds about technical topics. The dissertation topic you research is how you execute a plan you've devised and work collaboratively to achieve your goals. Learn some program/project management speak and figure out how to hit those notes in a resume. And most of all, get an industry internship if your advisor will support it. It's typically the biggest barrier to hiring a PhD, that they don't have actual industry experience. The biggest shock to my system was taking a corporate job that had requirements I did not expect and I needed to adapt very quickly to a new work environment.", "author": "thrombolytic", "created": 1563338598, "upvotes": 5}, "etzhlob": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etzhlob/", "text": "Good thing you started grad school because you enjoy science and not to get paid. \n\nWhen I started grad school all I knew was that I wanted to do science and be around people that were less annoyed than olmost when I inessently asked \"why\". I (naively) presumed that everything would fall into place afterwards. \n\nLuckily, for me it did. Knowing what I know now, I wouldn't have done it. I got super lucky.", "author": "wickzer", "created": 1563331896, "upvotes": 12}, "etze5ov": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etze5ov/", "text": "Sounds like grad school isn't for you", "author": "elainejftwk", "created": 1563330568, "upvotes": 1}, "etzddht": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etzddht/", "text": "Or you can become a consultant and create seminars abt how Phds can get jobs in industry. Guffaw\n\nOur best paid recent grad is selling big ticket lab equipment.\n\nWould someone tell me the value in myIDP, if any.", "author": "Dorothy_Day", "created": 1563330275, "upvotes": 3}, "etz7q3w": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etz7q3w/", "text": "All departments, regardless of field, should be providing formal training for non-academic careers, even if it means adjusting hiring priorities for faculty. The current hierarchy is honestly pretty effective in terms of producing good research, but sucks terribly the majority of those who reach the PhD stage through the postdoc stage. Professors borderline promise TT level position to 7+ PhD students through their careers, but only the very best advisers will even manage to train PhDs at TT replacement level. So the vast majority of professors are horribly overselling the benefits of the degree.\n\nI think NIH, NSF, USDA, etc. should ALL begin mandating this as part of their funding agreements. Show in your grant how those line-item PhD students/postdocs are going to be better prepared for the real world because of this project, or find a better use for the money. I'm not jaded enough to not think that the excess PhDs out there aren't benefiting society in some way, but the current system crushes souls because it puts way too much of the burden on us to figure out how to do that.", "author": "bvdzag", "created": 1563328070, "upvotes": 16}, "etz149v": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etz149v/", "text": "Who the fuck is making $50k in industry?", "author": "airwalker12", "created": 1563325488, "upvotes": 1}, "etykwov": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etykwov/", "text": "I have a cousin who left home to get her PhD in \\*insert biomedical field\\* in the US. Everyone in the family was and still is so proud of her. They spent their savings helping her with the application process and living expenses... She is currently applying for her third postdoc. They don't understand what a \"postdoc\" means in academia. Even I only understood when I moved to the US for my Ph.D. ( in a field with better prospects, thank god). My family thinks she is getting her second ( and now third) PhD. I didn't have the heart to tell them the truth that my cousin is struggling to find a job and is working 60 hour weeks for shit pay. Academia is rough.", "author": "nanon_2", "created": 1563319343, "upvotes": 58}, "etycdb7": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etycdb7/", "text": "This is why I cant, in good faith, ever encourage my students to do a PhD. It's a dumb financial decision in today's job market.", "author": "anonanemany", "created": 1563316159, "upvotes": 23}, "etyadut": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etyadut/", "text": "Hey, as someone studying philosophy, at least you have an industry outside of academia to go into.", "author": "balderdash9", "created": 1563315425, "upvotes": 29}, "ety3n77": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/ety3n77/", "text": "Pshaw, I'm in humanities.  Our Director of Grad Studies knows exactly the career statistics.\n\nOne.\n\nOne PhD student in the last 10 years (and we average maybe 8 PhD students a year) has gotten a tenure track job in our department.\n\nHe knows it's only one, because he brags about it... because HE advised the only ONE student to get a TT job.  And somehow, he converts that into a plus of the department and his advising abilities.", "author": "bitparity", "created": 1563312563, "upvotes": 62}, "ety158n": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/ety158n/", "text": "It's not like that in other areas, right? Please tell me it's not, lol.", "author": "Revlong57", "created": 1563311417, "upvotes": 1}, "ety0g5g": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/ety0g5g/", "text": "Well, damn, I went back to school later in life, leaving a decently paying but unfulfilling technician role, to do my PhD with hopes of managing/running a lab in biotech/pharma.  I'm just finishing my first year, so there's still time to quit right? /s\n\nIn all seriousness, this negativity is making me depressed and feeling like there's no hope I'll find some gainful employment when I'm done (and I have no desire to postdoc...)", "author": "trashpandalikespizza", "created": 1563311079, "upvotes": 17}, "etxt6qy": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxt6qy/", "text": "Ugh inject this straight into my veins. Cynical sarcasm with factual citations is my drug of choice.", "author": null, "created": 1563306819, "upvotes": 70}, "etxs3ly": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxs3ly/", "text": "That’s why you take your math and programming classes y’all! I’m starting a PhD so I’m still at the start but I went ahead and got an MS in applied math before hand; if at any time I decide academia is no longer for me, I can fuck off to be a data scientist in Menlo Park and make $250k at FaceBook (which is what a lot of graduates from my masters program do). The good news? All the skills you need can be learned *in grad school* or, if you’re late, afterwards through programs like the Insight Data Fellowship. We can’t all be professors but at least we can all make fat stacksss 💵💵💵", "author": "Stereoisomer", "created": 1563306134, "upvotes": 20}, "etxriym": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxriym/", "text": "To my institution's credit, they have started offering a \"career week\" where one of the professors straight up presents a lot of this information to us and then we have a bunch of other talks/workshops on alternatives. \n\nPretty sobering to see the post-doc statistics. He directly said \"if you want to shoot for academia, here are the numbers for that, and you will need a post-doc. However, if you don't, then don't bother, because you will make far less money.\"\n\nThe boomer shit is new to me though. I knew funding was tight and that the old folks in my department were sticking around forever, but I didn't realize that the new funding disparity was that extreme. \n\nAll the more reason to talk about structural changes that can happen in academia. That will take political organizing, though, which, as someone who has tried to talk to colleagues about unionization, is hard with scientists sometimes. Sure people generally have liberal views, but everyone is busy and focused on their own stuff and sometimes have been trained to value competition over cooperation. \n\nYou can see it in the comments of this post; \"if it's so bad, just leave.\" We could do something about this with lobbying and mass-action. Some democratic candidates are touting free college; could graduate and academic reform be a part of higher education reform in general?\n\nOP's post is controversial and sarcastic, but I'm glad it's being talked about. Most of the time I just try not to think about it, but here we are, let's talk.", "author": "phaeodactylum", "created": 1563305769, "upvotes": 77}, "etxqbjj": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxqbjj/", "text": "I don't really disagree with you OP, but posting this hard of a takedown without any solutions offered just makes you seem salty and bitter. \n\nThings are better than they were decades ago (during graduate school). We now have NIH minimum stipends, health insurance, better wages, etc. \n\nAfter GS is a different animal. It certainly should be a mission of graduate schools to prepare you for what happens after, but they can't control it themselves. What can a director of graduate studies do about where NIH funding goes? the best they can do is prepare you for the reality of post-GS life, which many big schools are doing. My school has excellent certificate programs, offices, and centers to prepare you to live a life free of tenure. Certainly all schools should strive towards this, but I think you're placing way too much on the school.", "author": null, "created": 1563305001, "upvotes": 12}, "etxow8s": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxow8s/", "text": ">And do you think once I've got my PhD, and I'm making [\\~$37,000](http://science.sciencemag.org/content/350/6266/1367), will that be more or less than the salary of someone who skipped grad school all together and just got a bachelors in [philosophy?](https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors/page/8?orderBy=EarlyCareerPay&ascending=false)\n\nI don't really get that from the data. It reports the mean income of the first year outside of a PhD (not mean income of PhD holders). Your source even states that there are quite a few people hovering under $50K particularly in biology, chemistry, and health sciences, which it attributes to many people taking postdoc positions immediately after graduating.\n\nI mean, postdoc salaries are pretty low, but everyone knows that.", "author": "mafematiks", "created": 1563304099, "upvotes": 29}, "etxmy0z": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxmy0z/", "text": "Well now I'm depressed...", "author": "crazyladyscientist", "created": 1563302858, "upvotes": 14}, "etxmh4i": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxmh4i/", "text": "Damn, if you're that salty you probably should drop out. Why are you doing this to yourself anyways if you hate it so much? \n\nPerhaps you should have considered originally just doing a Masters instead of a PhD. It's not like the reality of academia isn't driven over and over and over into you the moment you start working in a lab.... Either you were oblivious to the nature of the beast or originally convinced that you were god's gift to science (or some combination of both). Regardless, it seems like you're only just now coming to grips with the actual truth, so please spare us your toxicity, as we've already come to terms with it.", "author": "avianaltercations", "created": 1563302565, "upvotes": 5}, "etxlknp": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxlknp/", "text": "I don't know why that would make them squirm. I think they'd be confused as to why you're telling them all of this. \n\nIf it's not for you, then quit your phd. Nothing wrong or shamful about that. Unless your graduate school is telling you there's tons of jobs available and everything will be great, then why is it his problem? I've never heard of graduate programs advertising that. so I wouldn't really blame him.", "author": "Average650", "created": 1563301992, "upvotes": 35}, "etxlhdr": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxlhdr/", "text": ">  Let's put some money down; my stipend is paltry and I want to remember what meat tastes like. \n\nThis made me lol in sympathy because that's so me right now.", "author": "Euwana_Phoukmibhouti", "created": 1563301935, "upvotes": 124}, "etxl403": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxl403/", "text": "This is exactly what I needed to read today /s", "author": "jburkek", "created": 1563301698, "upvotes": 12}, "etxl0gd": {"link": "/r/GradSchool/comments/ce0mvt/want_to_see_your_director_of_graduate_studies/etxl0gd/", "text": "Oh my god you’re so obnoxious. Believe it or not, not everyone who goes into grad school and academia is concerned about earning big money. Some of us actually (*gasp*) have a genuine love of research and science and would rather do that for a living and be happy instead of being a sad and lonely person living alone in a big house because all we ever chased was money.\n\nGetting real sick of this anti-education sentiment that is infecting our society.", "author": "IvesMeow", "created": 1563301635, "upvotes": -29}}}