{"sid": "a7ca37", "link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/", "title:": "I got an A in a class I thought I was going to fail!!", "text": "Just wrapped up my first semester of graduate school in a new field (psychology to statistics) and I finally got my grades and found out I not only passed, but I got A’s!! Still can’t quite believe it.\n\nI’m just so excited and felt the need to share, because I started off the semester seriously struggling.\n\nI was dealing with really bad anxiety and imposter syndrome all semester and thought that maybe I wasn’t cut out for the program, but I decided I would stick it through unless they failed me out and kicked me out, haha. \n\nTo anybody who is questioning whether or not they deserve to be here, you do. You can do it. \n\nCheers and happy holidays everyone. ♥️\n\nEdit: spelling error ", "author": "Passacagalia", "created": 1545148659, "retrieved": 1632846399, "over_18": false, "upvotes": 291, "upvote_ratio": 0.96, "comments": {"elikxuq": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/elikxuq/", "text": "Was that curved to an A and that's why you didn't know? Congrats", "author": "AlissonLeech", "created": 1555960235, "upvotes": 1}, "ec368d8": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec368d8/", "text": "Yay!!!! Me too! The relief is indescribable! \n\nNow you can really enjoy the holidays.  ", "author": "sleepytimeghee", "created": 1545187496, "upvotes": 1}, "ec30svc": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec30svc/", "text": "congrats!!!! keep it up!!", "author": "thevillaincassiopeia", "created": 1545182941, "upvotes": 1}, "ec2m13z": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec2m13z/", "text": "Congrats! I'm in that nervous boat right now. Not sure if I passed my cognitive assessment class yet. 🤯", "author": "stupidiot49", "created": 1545170375, "upvotes": 2}, "ec2d0lm": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec2d0lm/", "text": "Congrats! It happened once with me as well. Was pretty much bottom after midterm, but turns out that got me to really put in the effort for the finals.", "author": "gandalf_sucks", "created": 1545163622, "upvotes": 1}, "ec2c9r9": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec2c9r9/", "text": "This literally just happened to me. I had similar problems all semester and almost decided to give up. Just got my grades and just like you I got all As! Best of luck in the rest of your studies, OP!", "author": "bloomingtonrail", "created": 1545163051, "upvotes": 1}, "ec2auo6": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec2auo6/", "text": "Really happy to hear that! Congratulations!\n\nI definitely get the imposter syndrome feeling 100%. Currently experiencing it. Just trying to stick to what I know and be honest about what I don't.", "author": "Frozen_Tony", "created": 1545161971, "upvotes": 2}, "ec2ahn1": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec2ahn1/", "text": "I’m at the opposite end. Went into this semester feeling pretty good. My imposter syndrome is at an all time high, second year in coursework. All As, but that’s kinda meaningless. Maybe it’s not imposter syndrome but actual imposter... I have this weird feeling of humiliation now that the semester is over. Yuck.", "author": "capaldithenewblack", "created": 1545161697, "upvotes": 2}, "ec27cck": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec27cck/", "text": "That's the best feeling in the world! Congrats!\n\n&#x200B;\n\nI totally understand your feelings of imposter syndrome. I'm currently in a social work graduate program and I felt like an outsider in my cohort. Everyone has so much clinical experience, and I have a background in research (psychology and human development). It can definitely be tough to keep motivating yourself to go through the program, but it is so worth it. Just finished up my first semester with A's, too. We can do this!", "author": "hotpocketsrhot", "created": 1545159300, "upvotes": 3}, "ec24nrj": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec24nrj/", "text": "Are you me??? I also just started graduate school, in a new field, and thought I was going to do poorly in one of my classes. I ended up getting the highest grade on the last exam but was still surprised I got that 4.0. Perhaps the prof was feeling generous 🤷‍♂️🤗.\n\nSeriously though, great job on not giving up! You definitely deserve to be here! ", "author": "Gradschool88", "created": 1545157296, "upvotes": 2}, "ec237u2": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec237u2/", "text": "Congrats!! \n\nI think that it's a common problem among high achievers (especially high-achieving women and minorities, although I don't know if either applies to you) to think that we're going to fail horribly, even when the evidence suggests otherwise. The impostor syndrome is *so real*.\n\nEvery assignment and project and paper I've turned in this semester, I've been convinced was total shit and that I was going to fail out. And then... I have some of the highest grades in the classes? (Heavy disclaimer: one class had many undergrads, the other many first-year MS students; I'm a PhD student.) \n\n**TL;DR** Congratulations! Impostor syndrome is a bitch and a half; I hope moving forward you have more confidence in yourself and your abilities, because you clearly deserve it. ", "author": "hgranger79", "created": 1545156245, "upvotes": 6}, "ec221qm": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec221qm/", "text": "Congratulations! I’ve been there. This is a testament to your hard work and persistence. Celebrate! And use the momentum to continue the climb. You’ve got this.", "author": "designchaos", "created": 1545155407, "upvotes": 1}, "ec1x9mg": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec1x9mg/", "text": "Congrats! But this is an obvious sign that your prof is terrible and needs some serious adjustments to their teaching methods. Be sure to note your experience on course evals or to your dgs. This was a consistent problem in a first-year course in my program and after a couple of years the dgs sat down with the prof and told him to cut it out. Our first-years seem a bit happier now, but it's a long slog.", "author": "bvdzag", "created": 1545151778, "upvotes": 7}, "ec1x6k3": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec1x6k3/", "text": "Your expectation is way off......no wonder you have imposter syndrome and other mental-health related issues. Are you working on a PhD? I would recommend focusing entirely on learning and understanding if you are in PhD and less on the grading itself. For masters, you may still wanna focus on getting good grades just in case.  ", "author": "cfso2017", "created": 1545151712, "upvotes": 5}, "ec1wg71": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec1wg71/", "text": "This is great, but I wonder why your expectations were so off?", "author": "cwkid", "created": 1545151149, "upvotes": 18}, "ec1vfu8": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec1vfu8/", "text": "Congratulations!! I had the same first semester experience: new field of study, soul-crushing impostor syndrome, and anxiety like you wouldn't believe while awaiting my final grades. I was going hard into catastrophe thinking: I'm going to do badly on my finals, flunk out of grad school, have to start my whole life over again and figure out a new plan because I have no skills and am terrible at everything, dishonor on me and my family and my cow, etc.\n\nThere's nothing quite so sweet as seeing that A when you were sure you were going downhill fast. Congratulations again, and here's to a kickass spring semester!!", "author": "stinkyhat", "created": 1545150371, "upvotes": 9}, "ec1v1bo": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec1v1bo/", "text": "I keep hearing that will also happen to us (first years taking their first grad school classes). Apparently it’s a grad school thing... still prepared for the worst though ", "author": "tardigradesrawesome", "created": 1545150061, "upvotes": 10}, "ec1uway": {"link": "/r/GradSchool/comments/a7ca37/i_got_an_a_in_a_class_i_thought_i_was_going_to/ec1uway/", "text": "Congrats!!!! Happened to me last year and I'm still completely thrilled whenever I think about it", "author": null, "created": 1545149955, "upvotes": 31}}}