{
  "sid": "q3fhyw",
  "link": "/r/GradSchool/comments/q3fhyw/significance_of_pass_no_passrigor_during_covid/",
  "title:": "Significance of pass no pass/rigor during Covid",
  "text": "Chemistry undergrad applying to T10 PhD chem programs (probably too ambitiously)\n\nSo I was privileged enough to keep going to college and take summer classes through Covid, and join a computational chemistry lab for my online year. I also took everything for a grade, and did good enough for my standards.\n\nI would simply not mention any of this, except I do want to show that because of my efforts (lots of stress from online classes, lots of self teaching, and had classmates who messed up curves by cheating.....ugh), I managed to free up my senior fall semester for full time research, so I applied for coops. In the end, my summer internship simply hired me on as a temporary full time lab worker, and I'm continuing my research project. I feel that because of this extended full time experience, I'm really learning a lot, and I want to show that in my application. Like I own my project, I plan and run my experiments, I do analysis, I propose ideas...this are all things I could not do before.\n\nI really have strong feelings against my undergrad at this point, because I've never really been supported there despite how much I tried to get research experience, since there was no undergrad chem research support really. I've worked with two PIs at my school, and both were nice and have written good letters for me, which is a blessing, but my school itself is a mess for chemistry. I really just have a lot of weird emotions looking back. I really dislike my undergrad peers after this online semester. I burnt myself out pretty badly (also I'm ASD lol). I still have to return to finish two classes and graduate. I really don't want to. I'm really much happier at my internship. It made me really love research (and that's definitely not because things went well always lmao).\n\nBut I digress really. All I want right now is to be able to acknowledge my efforts during Covid on my applications. I don't know how to show my coursework rigor (gpa isn't enough since everyone else simply pass/no passed their classes) nor my research experience right now. I'll sound like an asshole in my application if I tell them \"You see I didn't pass no pass anything? I'm a \"good\" student. I managed to replace my cancelled 2020 summer internship with a fall internship, and look my 2021 summer internship even wanted me back.\" Because I understand others might have lost income or gotten sick or had a poor home environment to work in.....",
  "author": "Kizukaku",
  "created": 1633631648,
  "updated": 1634099853,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfreanx": {
      "link": "/r/GradSchool/comments/q3fhyw/significance_of_pass_no_passrigor_during_covid/hfreanx/",
      "text": ">\"You see I didn't pass no pass anything?\n\nThere's nothing wrong with taking a few pass/no pass classes as an undergrad. Or as a grad student, if it's allowed. \n\nSo forget about that. Focus on how to write up a good CV that details your research experience.",
      "author": "raistlin65",
      "created": 1633632175,
      "upvotes": 1,
      "replies": {
        "hfreg67": {
          "link": "/r/GradSchool/comments/q3fhyw/significance_of_pass_no_passrigor_during_covid/hfreg67/",
          "text": "Yea you're right. I just need to calm the heck down, this whole process is stressful and I'm being irrational lol",
          "author": "Kizukaku",
          "created": 1633632238,
          "upvotes": 1,
          "replies": {
            "hfrg27p": {
              "link": "/r/GradSchool/comments/q3fhyw/significance_of_pass_no_passrigor_during_covid/hfrg27p/",
              "text": "Well, on the upside, depending upon your requirements for graduation, you might be able to take one or two of those final classes pass/fail and make things easier on yourself.",
              "author": "raistlin65",
              "created": 1633632904,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}