{
  "sid": "qsf4cr",
  "link": "/r/GradSchool/comments/qsf4cr/push_through_or_take_time_out/",
  "title:": "Push through or take time out?",
  "text": "First year here with results that are once again poor, meaning I’ll have to repeat the same experiment I’ve been troubleshooting/doing all year. \n\nThe last month has really spiralled out of control - I’m sleeping about 30 minutes a night and constantly thinking about how to fix my work. I try to make an effort to go to social events every now and then but the same thing happens. Constantly teary and nauseated. I feel inadequate and like a failure, and have told my advisors that I’m thinking of quitting.\n\nI know my results are not reflective of my self worth… or at least I did at the start of the PhD. Now I feel like a burden to the lab and like everyone would be better off without me. \n\nI know I just need to keep trying but I feel like a wreck. I’m sure people have been in a similar slump - do you take time off or just push through and keep working and working on it? I find if I even take a day off I’m just curled up thinking about my experiment, but I also can barely function at the lab.",
  "author": "docdoc_2",
  "created": 1636735083,
  "updated": 1637415961,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkcm783": {
      "link": "/r/GradSchool/comments/qsf4cr/push_through_or_take_time_out/hkcm783/",
      "text": "I am a post-doc and spent a good chunk of the summer troubleshooting the same experiment. This is how research goes.\n\nI think you need to push through in terms of sticking with grad school, but a break is definitely in order. Take a week or two away, have a meeting with your advisor about what the issues with the experiment could be and then recalibrate yourself. It’s tough, and if you don’t start sleeping more you’re never going to fix the experiment.",
      "author": "RoyalEagle0408",
      "created": 1636735259,
      "upvotes": 4,
      "replies": {}
    },
    "hkct2bj": {
      "link": "/r/GradSchool/comments/qsf4cr/push_through_or_take_time_out/hkct2bj/",
      "text": ">The last month has really spiralled out of control - I’m sleeping about 30 minutes a night\n\nDo what you can to address your sleep issues. That could easily be the root of your problem. Insomnia can be brutal on mental health.\n\nThere is excellent advice at the end of this article for things you need to do to be able to overcome insomnia\n\nhttps://www.health.harvard.edu/staying-healthy/insomnia-restoring-restful-sleep",
      "author": "raistlin65",
      "created": 1636738020,
      "upvotes": 1,
      "replies": {}
    },
    "hkedzp1": {
      "link": "/r/GradSchool/comments/qsf4cr/push_through_or_take_time_out/hkedzp1/",
      "text": "Right now you need to listen to what your body is telling you, and you need to take a break. Working on 30 mins of sleep won’t help you push through, it’ll actively hinder you. Take a break to recharge yourself, maybe like one or two weeks, and then you can come back to your problem with a rested mind and new perspectives. You’re going to burn yourself out if you try run on empty.",
      "author": "queenestiu",
      "created": 1636762867,
      "upvotes": 3,
      "replies": {}
    }
  }
}