{"sid": "pkqsu6", "link": "/r/GradSchool/comments/pkqsu6/is_going_on_a_study_abroad_program_a_good_idea_if/", "title:": "Is going on a study abroad program a good idea if I'm applying to grad school (CS)?", "text": "I'm considering applying to grad school in computer science. I'm currently a junior and I'm halfway through my registration for a study abroad program for the spring. I sort of planned to study abroad a long time ago when I didn't have a clear plan for my major/life after college.\n\nWhat makes me hesitate now is that:\n\nThe program isn't academically rigorous at all - it's more like a cultural exchange. It's not at a specific university but just a \"program\". It doesn't offer many advanced courses related to CS, and I'll just be taking mostly liberal arts classes for college requirements. Since the grad school will look at the transcripts until senior fall, I'm worried if my spring semester abroad will look bad because I'll only take 1 CS course for the whole semester. \n\nIf I stay in my college, I could take harder, more relevant courses for junior spring, although study abroad sounds like a good life experience. It is mostly just for the cultural experience, basically for fun, but studying abroad in senior spring is not allowed.\n\nThus, I'm wondering if a semester studying abroad taking less CS-related courses would negatively affect my grad school application and thus if it's a good idea to do so at all.\n\nAny advice? Thanks:)", "author": "guckmalmensch", "created": 1631162275, "retrieved": 1632952757, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hcb03rt": {"link": "/r/GradSchool/comments/pkqsu6/is_going_on_a_study_abroad_program_a_good_idea_if/hcb03rt/", "text": "Study abroad is an opportunity you should definitely take. Grad school will always be there.", "author": "iloveregex", "created": 1631277833, "upvotes": 2}, "hc5e9d1": {"link": "/r/GradSchool/comments/pkqsu6/is_going_on_a_study_abroad_program_a_good_idea_if/hc5e9d1/", "text": "I wouldn't think it would hurt you much. Taking a CS class while you're there is good enough. I spent a semester abroad in Germany late in my undergrad career and took *nothing* related to my major, and still made it into grad school in my first choice program; of course that's anecdotal, but that was my experience. I think it's more important to be doing well in the classes you *do* take, than overwhelming yourself by taking more classes than you need.\n\nI would say if you have the opportunity and ability to do so, *go*. Studying abroad is an extremely unique experience that you'll almost certainly never have the opportunity for again once you're done school.", "author": "SuperGanondorf", "created": 1631164548, "upvotes": 1}}}