{"sid": "pmlf5b", "link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/", "title:": "What kind of side hustles are feasible as a grad student? Is it even manageable to have a side hustle?", "text": "So I'm a newly admitted PhD student (three weeks in). I am supported by a stipend but if I choose to lease a car, I will not be able to afford it with just my stipend. Right now I'm car-less and I feel suffocated. The nearest grocery store is miles away and uber is unideal for frequent transportation. \n\nMy first idea for a side hustle is one that I was planning to work on before grad school but never got the chance. And that's audiobook narration. I have all the equipment and know how to edit. \n\nAnyhow, have you managed side hustles as a graduate student? If so, what did you do and how did you do it?", "author": "mybicepsarenoodles", "created": 1631418117, "retrieved": 1632952671, "over_18": false, "upvotes": 42, "upvote_ratio": 0.95, "comments": {"hcnkw28": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcnkw28/", "text": ">but if I choose to lease a car\n\nI'll second the \"do not lease a car\" advice. That's *almost* as expensive as buying new and generally a terrible deal. There are a very small number of people in really weird situations for whom leasing makes sense. Buying a beat up used car is probably the better option, if you wind up deciding that you absolutely need a car to buy food. \n\nOther options that might or might not be available/realistic depending on factors I don't know:  \n\n* Carpooling to shop with other graduate students  \n* Using a grocery delivery service (these popped up all over the place during the pandemic)\n* Getting a bicycle with a basket on it  \n\nIt's probably a good idea to ask around. Students who have been in your program longer than three weeks have presumably been getting food somehow. Maybe they all just have cars. But if that's *not* the case then whatever they've figured out might also work for you. Maybe there's a bus route you don't know about. Maybe there's already a carpool for this in your department. Maybe there's a tiny family owned grocery store tucked away near campus that doesn't show up on Google maps. Maybe all the grad students have a mutualist agri-co-op on the roof of the building that they've hidden from maintenance for years via a series of progressively less and less plausible hijinks. You never know. \n\nSide hustles the I've done/heard of people doing:\n\n* Tutoring can be good money, depending on the area. $50 or $60 per hour wouldn't be weird where I am, and it's not a crazy HCOL area or anything. Being beholden to undergrads' schedules is a bit annoying, though. \n* Editing papers for authors for whom English is a second language to make them sound more fluent. The pay was *horrid* but the flexibility was awesome. I could earn less than minimum wage *whenever I wanted from home!* There was a service I signed onto that paid per paper over PayPal which has since disappeared, but I'm sure something similar still exists if you snoop around.   \n* Straight up being faculty at a community college (probably only possible post-masters). You'd need a car for this but it could basically be a 20 hr. per week job that pays better than your stipend and at that point you could probably afford it. This would *likely* be a violation of something you signed to receive that stipend so... tread carefully. The person I knew who did that did it after their teaching stipend ran out, not before.", "author": "InfanticideAquifer", "created": 1631507485, "upvotes": 1}, "hcn0g6w": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcn0g6w/", "text": "Tutoring. Highschool students, if you can swing it. Parents pay like crazy.", "author": "wildechem", "created": 1631496779, "upvotes": 2}, "hcmjaw6": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcmjaw6/", "text": "Make sure your program allows outside work. I'm in a STEM field and my contract says I'm not allowed to have another job without approval from the department. \n\nOn top of that most of the grad student in my program can really only manage some tutoring", "author": "PaperPhD", "created": 1631488662, "upvotes": 1}, "hcmdg78": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcmdg78/", "text": "I work full-time remotely as a GIS analyst. It's very flexible and I have no issues with the grad program and work schedule", "author": "dainty_frog", "created": 1631486121, "upvotes": 1}, "hcm70l0": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcm70l0/", "text": "I knew a PhD student who was a bouncer/doorman for a local undergrad bar. Minimal effort, when asked said,  \"I'm not doing anything better Friday night anyways.\"", "author": "geneogon", "created": 1631483380, "upvotes": 2}, "hcm3ryi": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcm3ryi/", "text": "During my master's, I wrote for a company that provided \"example papers\" for college students. Basically I was doing undergrad homework. But if you like writing, it's a pretty easy gig.", "author": "suicidebomberbarbie", "created": 1631482011, "upvotes": 1}, "hcm3n20": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcm3n20/", "text": "1) Don't lease, buy an older car.\n\n2) If you're in the US, tutoring non-US citizens is ridiculously lucrative, particularly in STEM subjects. Foreign students tend to come from loaded families and will pay obscene rates for tutoring in physics, calculus, chemistry, and what not.", "author": "r3dl3g", "created": 1631481954, "upvotes": 3}, "hcm3j2g": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcm3j2g/", "text": "Tutoring - make your own schedule, set your own rates. There are options to work for agencies/companies out there that handle the admin side for you, but you’re practically guaranteed to make better money on your own.", "author": "themathymaestro", "created": 1631481908, "upvotes": 1}, "hclptrj": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hclptrj/", "text": "Don't get a car. Not only do you have to pay a lease but you also need to pay for maintenance, gas, and insurance. Ubering to get groceries (or better yet, just getting them delivered) is 100% a better solution. Is there no public transportation system in your area? What do other grad students do for groceries? You guys can even pool together for uber rides to the grocery store every week to save money.\n\nI personally took on extra teaching responsibilities to get a larger stipend, but I've heard others go into tutoring. If you can score an internship over the summer, some of those can be very lucrative. In my field, I know of people taking summer internships that pay more in 10 weeks than they make in 9 months as a PhD student.", "author": "CorporateHobbyist", "created": 1631476393, "upvotes": 3}, "hcljfad": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcljfad/", "text": "A classmate of mine pet sits (started on Rover, now just through word of mouth) and makes a few hundred dollars a month. They stay overnight in the homes and that helps shake the grad school blues a bit too (nice, quiet places to study with good AC and fast WiFi).", "author": "dustonthedash", "created": 1631473900, "upvotes": 3}, "hcl5jm4": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcl5jm4/", "text": "Donating blood plasma twice a week will net you bare minimum $120/week without bonuses. Not a grad student (yet) but it's gotten me through three years of undergrad. Takes up about two hours of my week and the demand never goes down", "author": "LadyMoiraine", "created": 1631468579, "upvotes": 10}, "hcl092t": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcl092t/", "text": "Grant/fellowship hunting to top-off your assistantship. They snowball, get someone to give you $ and it makes others more likely to cause someone else trusted you with $. Don't pay for grad school and also get paycheck out of it.", "author": "Latticed", "created": 1631466500, "upvotes": 5}, "hckv21z": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hckv21z/", "text": "I tutor privately.  I charge 30-40 an hour which is much better than Instacart or something. I have only one student at the moment and make 500 a month working 5 hours a week. I could easily have more students and I have in the past but I don’t have the time.", "author": "jeddalyn", "created": 1631464340, "upvotes": 3}, "hckrq7c": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hckrq7c/", "text": "See if any department in your university needs test subjects. I frequently am a paid volunteer for MRI studies. I was a paid volunteer for a study on smokers. If research is happening, they likely need paid volunteers. \n\nSounds like you’re rural, so this might not be an option, but see if there’s a product testing place. I often get paid to test shampoos, lotions, etc. \n\nThese types of things are really easy money, pay fairly well, and you can just sign up when you have time, so it’s lower commitment than getting a side job.\n\nYou could also try tutoring undergrads! Charge like $40 an hour.", "author": "the-tautologist", "created": 1631462920, "upvotes": 5}, "hckkdgt": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hckkdgt/", "text": "You might wanna check out PreScouter for side consulting gigs that are related to your domain of expertise. You can adjust your income based on the amount of time you wanna dedicate to each project. Plus it looks really good on your CV if you apply to industry jobs after your PhD.\n\nYou could also look at Fiverr for some freelancing options on audiobook reading. It'll take a while to build your reputation and clientele but it could be worth it in the long term\n\nGood luck!", "author": "crastersson", "created": 1631459698, "upvotes": 2}, "hckj470": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hckj470/", "text": "I tutored. It helped a lot.", "author": "kimmibeans", "created": 1631459138, "upvotes": 8}, "hckffw4": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hckffw4/", "text": "I didn't and I never had any money to spare, but, I focused in my classes and research specially at the beginning. Later in my program my advisor got me an awesome gig for the summers. Do whatever you want, but I suggest you to build relationships with your classmates and professors. Good luck!!!", "author": "DogDaysAreOverHere", "created": 1631457475, "upvotes": 4}, "hckeyxs": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hckeyxs/", "text": "I bartend at an upscale hotel. Far better tips and clientele that way", "author": "MrWickPhD", "created": 1631457259, "upvotes": 2}, "hcke0jl": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcke0jl/", "text": "Don’t lease a car, buy a super cheap shitty one that will get you to the grocery store.\n\nYou don’t make enough money to have nice things in grad school, for the most part, especially big nice things like a nice car.\n\nYou don’t need to spend $200-300 a month to help you purchase $400 a month in groceries.  That’s the dumbest math in the world.  You could rent a private car every time you needed to go shopping for that amount of money.", "author": "Weekly-Ad353", "created": 1631456828, "upvotes": 31}, "hck8zjs": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hck8zjs/", "text": "Depends on your subject. I'm a chemist and we worked maybe 16 hours a day for our stipends....lab work, two classes to proctor MWF, lab work, two labs TTH, lab work, grading papers, lab work, Grad classes, lab work, Journal club, lab work, cumulative exams.....you get the idea. Depending on your subject you are expected to work on your degree especially if you are a PhD.\n\nI took out a student loan at the end of my grad school career as I needed a car to get to my new job.\n\n&#x200B;\n\n(costco, ramen, spam, peanut butter, crackers, bread....in the desk in the lab...I know Safety Officer, but that's where my desk is.)", "author": "rthomas10", "created": 1631454488, "upvotes": 3}, "hck57hd": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hck57hd/", "text": "I'm adjunct teaching on the side (online). Not bad for some side cash.", "author": "tabbykiki", "created": 1631452625, "upvotes": 4}, "hck3p3j": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hck3p3j/", "text": "I rent my spare room out on Airbnb.  The time involved is pretty minimal.", "author": "mldonahu", "created": 1631451811, "upvotes": 9}, "hcjyned": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcjyned/", "text": "It is very difficult to be successful as a grad student and managing any kind of business simultaneously. Usually you are better off focusing on the PhD and making all your other choices around facilitating that.\n\nAs a side note, idk if you have any experience in the industry but voice acting (audio book narration) is a very competitive professional field, if you do not have contacts/an agent already, it will be very difficult to do that while also working on a PhD as those are both full time jobs.", "author": "gwsteve43", "created": 1631448794, "upvotes": 7}, "hcjwsi3": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcjwsi3/", "text": "I managed a pool during summers. Yea I was less productive than some over the summer, but I basically made 3/4ths of my TA stipend in 3 months. This means I could avoid teaching a ton during the school year (adjuncting on top of the TA stuff) so I was maybe more productive then during the year.", "author": "DocVafli", "created": 1631447541, "upvotes": 3}, "hcj6cqd": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcj6cqd/", "text": "I teach music lessons but I’m sure that won’t help. Tutoring is always worth looking into", "author": "Unofficial_Overlord", "created": 1631426878, "upvotes": 11}, "hcj64sf": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcj64sf/", "text": "I'd suggest not getting a car. There's probably a zipcar location on campus for when you need one for things like shopping.", "author": "DJGlennW", "created": 1631426726, "upvotes": 33}, "hcj1r0n": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcj1r0n/", "text": "Onlyfans", "author": "PsychAce", "created": 1631423743, "upvotes": 22}, "hciyf9z": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hciyf9z/", "text": "Depending on your PhD, doing some work in the industry may be best per hour rate.", "author": "Blabitybla2021", "created": 1631421713, "upvotes": 34}, "hcissu9": {"link": "/r/GradSchool/comments/pmlf5b/what_kind_of_side_hustles_are_feasible_as_a_grad/hcissu9/", "text": "My friend makes some bank bartending on the side, maybe try that.", "author": "DikkDowg", "created": 1631418667, "upvotes": 16}}}