{
  "sid": "qxiz10",
  "link": "/r/GradSchool/comments/qxiz10/help_professor_wants_me_to_use_a_3rd_party/",
  "title:": "Help! Professor wants me to use a 3rd party service to upload rec letters for grad school",
  "text": "Hey guys,\n\nI  have good in-person rapport with this professor I worked under awhile ago. However suddenly over email he's being really short -- he had me write the letter, and now he's asking me to \"arrange a 3rd party to distribute recommendation letters\". I'm only asking him to send the same letter to three schools, and I've already had schools send out their requests to him.\n\nIs a \"3rd party service\" a thing? If not, should I tell him that or chalk this up as a complete loss?",
  "author": "x60s",
  "created": 1637336831,
  "updated": 1637354441,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl9lzb5": {
      "link": "/r/GradSchool/comments/qxiz10/help_professor_wants_me_to_use_a_3rd_party/hl9lzb5/",
      "text": "It’s a thing. I had to use it for my grad/law school applications.  Ask which service he wants to use and communicate the places you’ve applied to are not or are taking them via third party.",
      "author": "NinjaWaffle1911",
      "created": 1637337007,
      "upvotes": 3,
      "replies": {}
    },
    "hla1746": {
      "link": "/r/GradSchool/comments/qxiz10/help_professor_wants_me_to_use_a_3rd_party/hla1746/",
      "text": "Interfolio will do this for you, and there are a number of letters you can send for free. Very easy to use and highly recommend. You would sign up, and through Interfolio send your professor a link that he would follow to upload his letter. Then, you can direct Interfolio to release the letters to the schools you are applying to -- it is able to send the letter to an email address, upload to application systems, and more, all while keeping the letter confidential.",
      "author": "Galactica13x",
      "created": 1637343015,
      "upvotes": 1,
      "replies": {}
    }
  }
}