{"sid": "prj84k", "link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/", "title:": "How many days off do you guys take per week?", "text": "I usually take one, witch is Saturday, but sometimes I feel like I need to spend the Sunday taking care of myself too. The thing is: I feel terrible. I feel lazy and useless. I'm aware of the importance of taking a day to rest and do whatever you want, but I just can't stop thinking about the research, other assignments and I sit to try to do something, but nothing comes out, and when it does, it's shit.\n\nHow do you guys would deal/deal with this?", "author": "zirtty", "created": 1632094993, "retrieved": 1632952165, "over_18": false, "upvotes": 157, "upvote_ratio": 0.99, "comments": {"hdn0rh1": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdn0rh1/", "text": "Sundays are non-negotiable for me. \n\nI’m a little more flexible with my schedule, so I won’t work 9-5 everyday but by hours per week instead. In a normal week I do 40hrs, if I have seminar or classes to give I do 44hrs. I might work 4hrs on a Saturday if I stop working earlier on Friday, flexible things like that, but I do plan before hand. \n\nI used to feel lazy and useless like you during my Masters, was either doing research or reading everyday. What ended up happening is that I burned out, my grades went down and I got sick, and the incessant negativity around my leisure / rest was getting on the way of me getting better. So it was all very counter productive (and harmful!) and I ended up in counseling for it. It helped a lot. \n\nSome days the negativity still shows up, so I make a point of acknowledging it and doing a small task, like cleaning up a spreadsheet, checking a couple of articles on jstor, it helps me.", "author": "HubbiAnn", "created": 1632171998, "upvotes": 1}, "hdmrmtp": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdmrmtp/", "text": "I was doing 9-5 with evenings and weekends off, mostly, for my first year. Since my second year started 3 weeks ago I’ve been working basically every day because I have so much on and it SUCKS. I’m now going to  be very strict about taking weekends off because I’m already exhausted and I don’t want to have a breakdown, fuck up something important or get sick. My supervisors understand. Rest is so important and vital for health, and the success of your PhD.", "author": "ilovegalaxies", "created": 1632168235, "upvotes": 1}, "hdmngvj": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdmngvj/", "text": "> The thing is: I feel terrible. I feel lazy and useless. I'm aware of the importance of taking a day to rest and do whatever you want, but I just can't stop thinking about the research\n\nThe dirty truth in academia is that it's a lifestyle, not a job. They *want* you to feel this way, so that you're always in the lab or wherever, working away. Your time in grad school will not be respected. So you have to find a balance between being efficient, taking on tasks/projects to be busy, but not losing your own life. Nobody will stop you from not working. Only you can make that a priority", "author": "Asteroth555", "created": 1632166531, "upvotes": 1}, "hdm3lj4": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdm3lj4/", "text": "Lol wtf? No you get two days off. Being a slave won’t get you far in life.", "author": "ThatGirl50", "created": 1632158381, "upvotes": 2}, "hdlt6zt": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdlt6zt/", "text": "I work 8.30 - 5.30 M-F. Evenings and weekends if needed and if it makes more sense than putting things off, but if I do work late or weekends I'll read a book and take a long lunch etc. That time is my time, if I choose to be there then it's because I'd rather be doing it than whatever I'd do otherwise, not because I feel like I have to. Don't push yourself too hard, it's a marathon not a sprint and burnout won't help anything.", "author": "UsernamesAreHard2684", "created": 1632154182, "upvotes": 3}, "hdlhs97": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdlhs97/", "text": "Lol, I only have sometimes one day that I don't spend on school and that's mainly because I have a full time job and I don't often feel like doing homework after working all day. But even then, I feel like it's not the number of days per se but rather total overall hours spent studying and then having enough time between sessions for your brain to process the information.", "author": "suicidebomberbarbie", "created": 1632149428, "upvotes": 2}, "hdlgnhl": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdlgnhl/", "text": "2 days and I count my time using the app “Forest”. As soon as I have covered the hours for each course (26x2/week), I am done.", "author": "MythicalPan", "created": 1632148942, "upvotes": 2}, "hdl6cp4": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdl6cp4/", "text": "I take full Saturday and Sunday off and I work at it like a job, 8-4. Sometimes I have to work longer hours and that’s fine but I also want to have a life. I have my husband and family to see and I really just want to be happy.", "author": "Derpazor1", "created": 1632144258, "upvotes": 3}, "hdl1s4c": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdl1s4c/", "text": "I literally only work on the weekend if I have a huge deadline coming up or I can't fit a long lab procedure in anywhere else. There's no reason to kill myself working over my degree, even though I like it, it's never going to be worth my mental health. It's good practice to force yourself to do other things, way too many people in research never do that and go their whole careers working an ungodly amount.", "author": "KiwiTheKitty", "created": 1632141934, "upvotes": 2}, "hdl1h93": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdl1h93/", "text": "Usually 2, sometimes instrument and experiment availability make that 1, but then I'll take a 3 day weekend to compensate somewhere in the future. I did R&D in industry for a few years before coming back to grad school, and we all got plenty of work done with a 9-5, M-F, work schedule. We had paid sick days, flex time, and 2 weeks paid vacation (would have had 3 if I stuck around).\n\nI do get dragged into the work after hours by my own interest, or at the very least am left thinking about it, and I think that guilt I'd feel not working more stems from the alienation of being the sole researcher on a project, with little oversight, and driving that bus yourself. You feel responsible for it, and you are, but people who aren't you also get credit. The reality is research does take a lot of time but you've got a lot of time to do it in. Don't push yourself too hard and burn yourself out trying to impress others, deliver a bunch of results, or publish 20 papers in your PhD.\n\nYou'll have plenty of time to do that in your career. I also like to remember the Haymarket Affair or other great struggles of organized labor every time I take my weekend off in full. People fought and died for our ability to enjoy the fruits of our labor, they weren't lazy and neither are you!", "author": "Outmodeduser", "created": 1632141769, "upvotes": 3}, "hdkx0by": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdkx0by/", "text": "I take 1 or 2 days off depending on where I am in the semester. Right now, I’m working on finishing my thesis and need to be done within a week or two, so no breaks for the moment, but generally, 1-2 days a week.\n\nPlease don’t feel guilty for taking care of yourself! It’s so important", "author": "smolderbyboi", "created": 1632139169, "upvotes": 3}, "hdkvpn7": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdkvpn7/", "text": "Zero days off. I work every day for 8 hours. I was able to obtain my masters quickly with distinction because I worked everyday. Now, I am simply addicted to my work, and can't imagine doing anything else with my time apart from my hobbies. I feel empty without work.", "author": "ResponsibilityNeat98", "created": 1632138344, "upvotes": 3}, "hdksoxe": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdksoxe/", "text": "When I was in grad school i worked 9/10a to 4p M-F. \n\nGrad school/research isn't school, its your career disguised as \"school.\" Separate work and life and be sure to do so with strict hours and days.", "author": "CptSmarty", "created": 1632136274, "upvotes": 3}, "hdkf68k": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdkf68k/", "text": "I learned this the hard way, from working 60-80 hours down to at most 60 hours (I won't exceed 60 on a packed week). Doing just work all week long took a toll on my mental and physical health, and it sort of peaked around a post I made here, on this subreddit. \n\nWhat I do now is take the weekends off. At minimum Saturday off, and Sunday some work, mainly planning and some maintenance tasks. During the week, I do work on assignments and such at night, but I try not to go over 11pm. Same goes for talking with colleagues and friends, I try not to exceed 11:30pm at the latest. If someone texts or emails, I automatically have my devices set to 'Do Not Disturb' mode at these times. \n\nSame as you, I used to think about how I am not getting *insert thing here* done. As a suggestion, instead of having only grad school related goals, have personal goals you want to work on, like getting through a book you wanted to read or watch a genre of movies and tv shows by the end of the year or something. My current one is to read 8 books (not in relation to what I'm studying or productivity) by the end of this year and learning to cook many different dishes. It helps me focus on something else rather than my anxiety of not doing something looked as 'productive.'", "author": "datdestructor", "created": 1632124429, "upvotes": 2}, "hdkcq1x": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdkcq1x/", "text": "I'm a fully-funded master's student with TA responsibilities. \n\nI swap between two extremes - 6 days a week of 4-6 hour days and 3 days a week of 12 hour days. I try to stick to the latter, because I like having long periods of time off to go camping, rock climbing, surfing, etc. without a worry. If I need to grade something that's time sensitive, then I'll put in an extra day or extra hours. \n\nI've primarily worked in wildland firefighting and forestry the last couple where I've had non-traditional work schedules. One job I worked 8 days on with 6 days off. Wildland firefighting is a seasonal gig where you typically get 4-6 months off straight. Both jobs had me working like a dog, but it is worth it to be able to fully decompress at the end of your stint.", "author": "AZPolicyGuy", "created": 1632122256, "upvotes": 3}, "hdkbjve": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdkbjve/", "text": "I am currently an MA student, I do not have any day offs but what I usually do is chunk up my assignments, by that if I have 89 pages of readings that needs to be completed between Tuesday until Monday, I do each reading per day and manage to enjoy all of my days equally without additional stress, I managed to do just fine with that plan and will keep on adhering to it accordingly.", "author": "Jarrah965", "created": 1632121269, "upvotes": 1}, "hdk6zad": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdk6zad/", "text": "1 or 1/2 a day. Fridays basically. My cat this week laid on my laptop so I couldn’t study. Sometimes I work every other Friday so it’s half day then.", "author": "beanie1816", "created": 1632117693, "upvotes": 2}, "hdk2lxn": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdk2lxn/", "text": "I'm already burnt out one month in, and I did NOTHING this weekend. I did nothing last weekend too. Very bad decision on my part, but I'm so burnt out and I can't stop crying every. single. damn. day.", "author": "nietzschesoptimism", "created": 1632114596, "upvotes": 3}, "hdk26uo": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdk26uo/", "text": "I am a PhD student so my grades didn’t really matter as long as I passed classes. I always tried to be strategic about where I put my time and energy for assignments. I would calculate out the minimum points I needed to get a decent grade and shoot for that. Some weeks I would turn in assignments that said “I’m intentionally not doing this because I don’t need the points” so my prof / TA wouldn’t email me. \n\nNow that I am done with classes and only have research to focus on, I work 10-6 M-F. I came to this mindset by doing a lot of research about overwork (it’s bad for your health) and productivity (drops off severely after ~45 hours). I am very strict about this. I am a TA and tell the students at the beginning of the quarter that I do not respond to email outside of working hours, and to plan accordingly. I also got really good at saying no. Sometimes that sounds like “there are five things that need doing, but I only have the capacity to do three. Which three are the highest priority?”\n\nAnother thing that really helps is looking and planning ahead. If I have a big deadline coming up, I move as many things as possible so I can focus solely on that deadline. Same goes for any vacations, major projects, or predictable mental health days (eg late grandfathers birthday, etc).", "author": "banamana27", "created": 1632114312, "upvotes": 14}, "hdk1qvs": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdk1qvs/", "text": "0", "author": "Antikythera22", "created": 1632114012, "upvotes": 1}, "hdk0fih": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdk0fih/", "text": "I have spent the last ten years really taking no time off because I worked and raised my kids through school. Now that the kids are grown and I'm in a funded PhD program, I'm hoping to approach it like I have ONE job, which feels like a bit of a novelty, and work 40 hours a week.", "author": "Weaselpanties", "created": 1632113141, "upvotes": 3}, "hdjz5ck": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjz5ck/", "text": "I take all days off and eventually the dread of failure makes me motivated", "author": "thecrimsonfucker12", "created": 1632112330, "upvotes": 3}, "hdjyssk": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjyssk/", "text": "3-4 days.", "author": "FeatherineAu", "created": 1632112113, "upvotes": 2}, "hdjv98k": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjv98k/", "text": "Two and an half, Friday is a bit of a half day but not fully if I have work to do.", "author": "Beor_The_Old", "created": 1632109993, "upvotes": 3}, "hdjum4x": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjum4x/", "text": "Right now I'm working every day, because I have a deadline coming but the date is indeterminate - it could be next week, or it could be in 2 months. The uncertainty is stressing me out so I'm just working all the time now. However my productivity outside of business hours is really low, because I'm usually working while watching TV/youtube and taking lots of breaks. Multitasking is what makes it bearable.", "author": "ezemasterrace", "created": 1632109631, "upvotes": 2}, "hdju6fl": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdju6fl/", "text": "Honestly jealous you're able to strike a balance where you can take a day off. I have not been able to take even one day off/week without being so crippled by anxiety afterwards that it's not worth it...so I've taken to doing a little each day.", "author": "xoxo_angelica", "created": 1632109385, "upvotes": 2}, "hdjt2o1": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjt2o1/", "text": "Like many others here, I try to treat it as much like a normal day job as possible. I have fixed times I work every weekday, be it writing or teaching, and I take 1.5 to 2 days a week off - usually weekends but I’m relatively flexible on which days it falls on! \n\nbut as a caveat, I came to university (undergrad and all that followed) late and after serious physical and mental health issues - I know my limits and have to stick to them for my own sanity/safety. my illnesses have gotten in the way a few times and often make me unable to work as long hours as I hope to/should, while the medications I’m on make me exhausted/sedated so it’s hard. My phd is taking longer than anticipated because of this but I am doing my best!!", "author": "coyotesandcrickets", "created": 1632108780, "upvotes": 1}, "hdjt06t": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjt06t/", "text": "I'm not fully funded and this is done at my own time. Right now, life is so crazy with a bunch of health issues and way too many responsibilities and I'm going to pause my project until I get through this class (psychoanalysis, completely irrelevant to my project). I'm gonna focus on this last horrid class and that's gonna be that.\n\nI'd rather come from behind a little bit and graduate a bit late than burn out completely and have wasted the money I've already spent. Take breaks, it's a marathon not a sprint. A bit more debt is a drop in the pond for most of us.", "author": "ajs423", "created": 1632108743, "upvotes": 6}, "hdjr7ru": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjr7ru/", "text": "I take one, Saturday, on Sunday though I'm not so intense about what I am studying. Meaning I'll do readings, take some notes, review the language I'm studying a little...but I'll take 2 hour breaks in between where I just veg out or watch a movie. \n\nGrad school is a pretty intense process, if you're doing a master's it's learning everything you can get your hands on for you field. Idk about a doctorate but I have a feeling it's kinda the same", "author": "thelaughingmansghost", "created": 1632107854, "upvotes": 2}, "hdjp20w": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjp20w/", "text": "I work every day (for the most part), but rarely 8-hour days (usually only 4 hours of dedicated research a day). In the end, it probably rounds out to 40+ hours a week with coursework.", "author": "Tilted_reality", "created": 1632106751, "upvotes": 3}, "hdjouk6": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjouk6/", "text": "I usually work a regulars day-job schedule 9-5 (but recently I've been working later). I only go in on weekends if I want to. Minimum one full day off to self care, and at least some social time on weekends (a half day). Depends on if I'm feeling good or not. Some weeks I go home early because of burnout. The group dynamic plays a big role.\n\nI've been thinking about taking Wednesday and Thursday as my days off and working Saturday and Sunday. Better able to do my hobbies. \n\nIf you're feeling burnt out, take time off! Go on a vacation, spend time with family, be a couch potato for a few days, do a hobby, whatever. It'll pay dividends later. My advisor is understanding so I'm lucky to be able to do this.\n\nPhD in chemistry", "author": "yamanp", "created": 1632106646, "upvotes": 2}, "hdjnaro": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjnaro/", "text": "I often take 2 days off, but not always weekend days. If I have a big deadline I might work over the weekend, but then I create my own weekend to compensate for it. This week the weekend was Sunday - Monday because I had a big project that I had to work on most of Saturday.\n\nI also sometimes take more than 2 days off or less than 2 days off. If I'm working on something (like an article) and having a lovely time, I'll just keep going if I'm having fun. This is especially true for collaborative papers with friends. We often order some pizzas and have a write-a-long on Saturday afternoon or something. Both productive and delicious. If there's nothing terribly urgent happening that week and I want to decompress after a conference, big project, or watch 9 movies in a row, I will take 3. \n\nFor me it's less about how many days am I working and more 'have I accomplished what I aimed to accomplish.' \n\nI just graduated last month so now I can only disappoint myself (ha), but my PI was of a similar mind. He very much believed that if the lab was productive and collaborative, you should be able to follow your own process. I was very fortunate to find him as a supervisor, especially because laboratory set-ups are uncommon in my field.", "author": "EpicDestroyer52", "created": 1632105874, "upvotes": 5}, "hdjn7r0": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjn7r0/", "text": "Friday night to Sunday night. Friday night and sometimes Saturday morning are to recover from the week. The rest of the time is to socialize and/or have me time with hobbies and gaming. Only some exceptions are made, like when there are urgent deadlines.\n\nI stopped caring about the academia guilt after I crashed hard from not taking any proper breaks for 2 years. My productivity and mental health took a huge dive. I was doing even less work because I was so tired all the time. I ended up having to take 2 terms off to recover. Research and work will *always* be waiting for you, but productivity won't mean *shit* if you've completely snapped and broken from the stress. The thing is, even as relatively good my advisor is, academia doesn't give a shit about my well-being. So why should I give a shit about being productive for it? What is truly at stake if I don't spend my weekends doing work? My advisor's reputation/funding? My graduation date? Are either of those worth my literal sanity? When I've almost tried to take my own life over the stress that academia gave me?\n\nNow, I just do the best I can during work hours, and I give myself stricter boundaries for not doing work. I do what is required of me, and I spend my extra work hours on what I think will actually further my career goals (because the route I was taking was a dead end in the job market).\n\nThere's one thing I usually tell people dealing with burnout. We usually tend to think that we're more productive the more hours we put into something. The problem is that our brain isn't a machine. If you ran several marathons, your muscles would give out eventually and you wouldn't be able to continue moving. Almost nobody would argue that you need to take a break if that happens. Why should that be any different for the brain? Your brain needs breaks just like your muscles, or else it won't be able to be anywhere close to max efficiency. So, *meaningful* breaks *are* considered productive, too.", "author": "valryuu", "created": 1632105831, "upvotes": 10}, "hdjlq17": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjlq17/", "text": "I take the weekends off. I tend to work from 9:30 to 6pm, and then I stop working for the evening on the weekdays.", "author": "HistoryCat42", "created": 1632105094, "upvotes": 8}, "hdjilet": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjilet/", "text": "At the beginning of my PhD., I was eating fire TA, collecting field data and taking my courses I took no days off . The tail end of my coursework and the rise of the pandemic burn me out. After I took my comps last spring I decided to take two days off and limit my workload to 8 hours a day \"mostly writting\".", "author": "flama_scientist", "created": 1632103580, "upvotes": 2}, "hdjdfcb": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjdfcb/", "text": "Average of 1\n\nSome weeks I take 2 or 1 1/2, some weeks I don’t take any", "author": "plz-wash-your-hands", "created": 1632101083, "upvotes": 2}, "hdjcva4": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjcva4/", "text": "I usually take the weekends (Sat and Sun) off since I found that I can't really take a break + do my chores/errands (groceries/cleaning/meal prep for the week/laundry etc) if I only take one day a week.\n\nI have a labmate that does one day breaks per week, however he usually gets his groceries delivered and is married so he shares housework and chores with his wife.\n\nI also felt the same way as you previously, since I can see that labmate of mine making it work. I felt guilty that I had to take 2 days but he can only do it with 1. So I tried to push myself what that labmate was doing and ended up burning myself out. It was only after I met with a counsellor (service provided by my uni) that I accepted that I should not feel guilty for taking breaks and that it's unfair to me to compare myself to my labmate since he has a different setting with me (he has a partner to share chores with, I'm single and have to do everything myself). \n\nMy counsellor also suggested that I do things in my break that aren't related to my research e.g. take up new hobbies, pick up old hobbies, try something new etc as a way to not carry over the stress of what I' m doing in the lab during my weekend breaks. And so far it has been working. I signed up and got a library card from my city's library and started reading books unrelated to my research again, something that I thought I wouldn't have time to do when I started my candidature. So I suggest doing the same as what my counsellor advised me. Hopefully it also works for you!", "author": "peppergirl24", "created": 1632100818, "upvotes": 7}, "hdjc90c": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdjc90c/", "text": "My rule when I was doing a PhD was: if there's no urgent deadline coming up, I'm not working on weekends. Finished my PhD the same way I would if worked 7 days a week... but happier.\n\nIn ny masters I used to work all the time, always busy. By the end of it I realized the results would have been the sam anyways, so I took that lesson into my PhD", "author": "Populus_alba", "created": 1632100519, "upvotes": 46}, "hdj8zz6": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdj8zz6/", "text": "I took 1- Sunday’s.  That was standard at my school and all similarly ranked schools in my field.\n\nI have since learned there are some exceptions, but the data also suggests those are few and far between.\n\nEdit: I love how people downvote facts they disagree with.  It’s so dumb.  I understand downvoting opinions you disagree with, but it is a fact that in my field, at top universities, the gold standard in like 90+% of labs is that you’ll be expected to work 6 days a week.", "author": "Weekly-Ad353", "created": 1632098976, "upvotes": -5}, "hdj8kxs": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdj8kxs/", "text": "Sunday is completely off, it's non-negotiable. I might answer an email / slack message or two, but nothing else.\n \nSaturday is usually a half-day. I try to leave lighter stuff to then, say just typing some stuff up, answering messages, reading some papers etc. Sometimes I take a day off on a weekday, and when I do I convert Sat. to a full day.\n\nOtherwise I try to get a full 6-8 hours on the weekdays, leaving 7PM past for my hobbies.\n\n> can't stop thinking about the research, other assignments and I sit to try to do something, but nothing comes out, and when it does, it's shit.\n\nUsually when I feel like this, I write down the idea in my journal and leave it for Monday. I find that this is enough to keep it from bouncing around in my head while also saving it for a more productive me.", "author": "TrostAft", "created": 1632098773, "upvotes": 30}, "hdj5f00": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdj5f00/", "text": "I rarely take full days off, but I work a lot of half days instead. And the work I do on the weekends tends to be stuff I can do while watching TV  or sitting outside (i.e. cleaning spreadsheets of data, grading, etc). It helps to keep me motivated because if I take a day totally off I have a really hard time starting back up work the next day.", "author": "archaeob", "created": 1632097246, "upvotes": 51}, "hdj3su5": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdj3su5/", "text": "I usually take Saturday and Sunday off, although if I have a deadline or something, I might work one of those days. But I try to stick to five-day work weeks\n\nI deal with it by being happy with what I accomplish during the week. I feel like if I am making progress, then I'm good. My mental health is too important (fragile) to push too hard. I worked way too much my first year and it was not good for me", "author": "Drell-Yan", "created": 1632096457, "upvotes": 82}, "hdj1t7f": {"link": "/r/GradSchool/comments/prj84k/how_many_days_off_do_you_guys_take_per_week/hdj1t7f/", "text": "I take minimum 2 days (Saturday and Sunday). I treat grad school as a job (I'm fully funded) so I start around 8 am and stop working after 4/5 pm M-F. If something doesn't get done during that time, it can wait until the next day/week. Of course some days can be longer but I compensate by taking more time off some other day/week.\n\nThere's more to life than school, and if you stretch yourself too thin working on it then you're going to be less productive in the long run. Life is short, take a break and enjoy it often :)", "author": "rootusercyclone", "created": 1632095500, "upvotes": 374}}}