{
  "sid": "qr4qkq",
  "link": "/r/GradSchool/comments/qr4qkq/renege_postdoc_because_of_medical_issues/",
  "title:": "Renege postdoc because of medical issues?",
  "text": "I know reneging is super frowned upon but I have a weird situation that I need advice on...\n\n**I signed a postdoc offer** from a reputable national lab which would require me to move out of state. I was excited for it!\n\n**Then I got diagnosed with cancer a couple weeks later.**\n\nI'm currently a patient at one of the top cancer centers, which is in my current city. My family is also here, and they've been an amazing support network. So **I want to stay in my current city** until the cancer is treated and surveillance is less frequent (doctors estimate 1-2 years).\n\nI told my postdoc manager, and he said **the postdoc is not a work from home position**, but he'll contact higher ups to see if that's a possibility.\n\nSo I started looking for other opportunities and **I got an industry scientist offer in my current city**.\n\nThe industry job pays significantly more than the postdoc and the research is still aligned with my goals.\n\n**Then my postdoc manager came back and said work from home would be fine.**\n\nI don't know how I feel about working from home, however, because I really value face-to-face contact and teamwork.\n\n**I would be the only person at the national lab working from home. I would feel like that \"missing sick guy\" who no one actually gets to know.**\n\nI'm therefore thinking about reneging my signed postdoc offer to go for the industry job...\n\nI know it's frowned upon, but I need more money (I've learned insurance doesn't always cover everything) and I don't feel comfortable being the only person at the national lab who is working from home.\n\n**I want to tell my postdoc manager that long-term I want to be at the national lab (which is definitely true), but right now I want to work in my city with colleagues face-to-face.**\n\nI don't know how this will be handled... **Will I ruin my image at this national lab? Will my reputation be tainted?**\n\nI feel so bad about even thinking about this... But at the same time I know it's the best decision for me.\n\n**TL;DR:** Accepted postdoc position at a national lab, got cancer, they offered to make it work from home, but then I got an industry offer in my current city and I want to take it.",
  "author": "thermokopf",
  "created": 1636579873,
  "updated": 1636656516,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk4or9d": {
      "link": "/r/GradSchool/comments/qr4qkq/renege_postdoc_because_of_medical_issues/hk4or9d/",
      "text": ">I want to tell my postdoc manager that long-term I want to be at the national lab (which is definitely true), but right now I want to work in my city and develop professional contacts face-to-face.\n\nIt sounds like you don't want to burn that bridge, so maybe the best thing to do is be honest, as you have done in this post. \n\nLet them know you really need the extra money, and you're worried about not being able to work face-to-face with colleagues. Tell them how much you really want to work for them *in* their lab. But due to the cancer, you're going to have to apply again at a later point in your life when you're able to physically move there.\n\nAfter all, it sounds like they like you. And the vast majority of people would be understanding in this kind of situation.",
      "author": "raistlin65",
      "created": 1636584601,
      "upvotes": 7,
      "replies": {
        "hk4qh0f": {
          "link": "/r/GradSchool/comments/qr4qkq/renege_postdoc_because_of_medical_issues/hk4qh0f/",
          "text": ">Tell them how much you really want to work for them *in* their lab.\n\nThis part is really important and really summarizes my problem. Thank you so much!",
          "author": "thermokopf",
          "created": 1636585318,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hk5m7a6": {
      "link": "/r/GradSchool/comments/qr4qkq/renege_postdoc_because_of_medical_issues/hk5m7a6/",
      "text": "I totally get your concern, but absolutely do what’s best for you and your family right now and don’t feel bad for a second. \n\nYou can easily express your sincere regret that some awful circumstances have prevented you from accepting this postdoc. You are grateful for the opportunity and were so excited to join the lab, but right now your cancer treatment takes precedence. My god, if that burns a bridge… that’s not on you. I know it sucks to think about, but you are clearly professional, courteous, and a great candidate for this research. The lab should wish you well. \n\nCongratulations on two pretty cool job offers! Now go kick cancer’s butt – I hope your treatment goes well.",
      "author": "StringOfLights",
      "created": 1636599402,
      "upvotes": 4,
      "replies": {}
    }
  }
}