{"sid": "id9zbu", "link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/", "title:": "Writing is so damn hard.", "text": "That’s it. That’s the post.", "author": "skakkuru", "created": 1597928973, "retrieved": 1632845275, "over_18": false, "upvotes": 615, "upvote_ratio": 0.98, "comments": {"g2ap5fe": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g2ap5fe/", "text": "Daily to myself or my cat: “Just write.... something. Anything. Nobody will ever read it. You can edit it. You can’t edit nothing. Do it, do it, do it now. Okay now. Now do it. You can delete it if it’s bad.” And so on until I abandon all hope and check on the progress of whatever project is running and make a drink", "author": "clumsykitty", "created": 1597986111, "upvotes": 1}, "g2ahwds": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g2ahwds/", "text": "It is. My biggest struggle was to actually get off my couch, turn off the TV and get to my desk.\n\nEven in the days I was able to make it to the desk, I managed to get distracted with all the email offers I get. Smh", "author": "jo_mom", "created": 1597981252, "upvotes": 2}, "g2agl1s": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g2agl1s/", "text": "Write drunk, edit sober.", "author": "SBR249", "created": 1597980440, "upvotes": 1}, "g29uxc8": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g29uxc8/", "text": "Yes", "author": "Sancheneering", "created": 1597968491, "upvotes": 1}, "g29q1vn": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g29q1vn/", "text": "This is not graduate level writing! hahahaha", "author": "MAJORMETAL84", "created": 1597965803, "upvotes": 1}, "g29jfpe": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g29jfpe/", "text": "Have you ever spent five months revising a paper with your advisor’s help to then be told that all your analyses are actually shit and you should start over?", "author": "monicatitude", "created": 1597962288, "upvotes": 3}, "g29g4by": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g29g4by/", "text": "I have this weird habit of writing things and editing them midsentence. My girlfriend has seen me write a paragraph and delete all but one word and be like... what are you doing? She was saying how fast she could write papers and that It would take me forever because I would edit every single sentence. She's watched me do it.", "author": "bryce-jun", "created": 1597960668, "upvotes": 2}, "g29e09j": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g29e09j/", "text": "The worst part about writing is knowing that no one is even going to give a shit or read it. The few that do will skim.", "author": "Spenceyfox", "created": 1597959649, "upvotes": 6}, "g297nlu": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g297nlu/", "text": "yes. that’s all i can muster up.", "author": "uhimsyd", "created": 1597956809, "upvotes": 1}, "g28q3w7": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g28q3w7/", "text": "I feel you. I have a thesis advisory committee meeting tomorrow, and even writing the pre-report was death. Granted, my PI insisted I write up my results as if it were exactly for my thesis to guarantee my committee would yet again, confirm I’m okay to set a defense date since I’m already writing the damn thesis. \n\nWhat’s even better is when your data just doesn’t make sense at all but your PI and advisory committee don’t tend to supervise masters students and expect a PhD level thesis with meaningful, troubleshooted explanations in a goddamn global pandemic 🙃\n\nOh, and did I mention this is all part time while I’m full time in med school? Fml", "author": "liz-can-too", "created": 1597949548, "upvotes": 1}, "g28pxt6": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g28pxt6/", "text": "Too hard to write a longer post?\n\nHot take: writings not THAT hard. Organizing's hard, plannings hard, re-evaluating the plans hard, understanding your citations is hard... making figures is hard. Basically everythings hard other than blabbing on the page once you have all the other stuff figured out.", "author": "seismic_swarm", "created": 1597949472, "upvotes": -7}, "g28oq34": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g28oq34/", "text": "Writing is most often hard because folks don't do it right.  The symptom is that it's hard to get words on paper.  The problem is often just that one's thoughts are not fully organized yet.  If you're getting writer's block, try outlining and/or refining that outline.  \n\nMost of us are pretty good at writing 5-10 paragraph essays by the time we get to graduate school.  If you're good enough at it, you're used to shooting from the hip and just ... writing.  It works because your thoughts are already pretty organized, so you can pick your way through a few paragraphs naturally.  The thing is, inspiration like that doesn't scale.  Outlining does -- you can use it both to organize your thoughts and to separate the different parts of your larger work.  \n\nThat last aspect (separation) lets you write one part of your article or dissertation, while the other is still \"shaking out\".  That's important because at the dissertation scale you actually *can't* keep everything in your head all at once to let it shake out.  Practically nobody can just sit down and write even a rough draft dissertation from start to finish -- and if it were possible, we'd just set aspirations higher.    So you have to be able to push aside most of the work in order to focus on the details in any one section.  That is what an outline is for.", "author": "drzowie", "created": 1597948939, "upvotes": 7}, "g28m4lc": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g28m4lc/", "text": "Yep.\n\nHang in there", "author": "evaj95", "created": 1597947751, "upvotes": 2}, "g28gv6b": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g28gv6b/", "text": "When I want to write, writing is easy and enjoyable. But persuading myself to want to write? Man that’s extremely damn hard!", "author": "Poti0nsMaster", "created": 1597945370, "upvotes": 8}, "g28fshy": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g28fshy/", "text": "I'm a grad assistant at my uni's writing center. If anyone is having an especially difficult time, I'm happy to brainstorm with you or review your work! Google docs is an absolute gift from heaven lol", "author": null, "created": 1597944884, "upvotes": 2}, "g28d6rh": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g28d6rh/", "text": "OMG, for me, writing is almost as hard as pushing out a baby. \n\nI sometimes have some good results, though, with writing out a “spew draft” or “brain dump.” Somehow, giving myself that permission to write something really crappy at first can help a lot!", "author": "jadynfirehawk", "created": 1597943666, "upvotes": 5}, "g2898y3": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g2898y3/", "text": "It’s now noon for me and I’m laying on my couch procrastinating my document", "author": "youngsmeg", "created": 1597941869, "upvotes": 3}, "g286l3e": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g286l3e/", "text": "I recently sent a draft to my advisor and had written \"nonpolar\" when it was clearly supposed to be \"nonplanar\" (very obvious by context, and no significance on my interpretation). Advisor wrote a long comment instead of just correcting it and sent me back the whole uncorrected draft. I couldn't open that file for a week.", "author": "phangirloftheopera", "created": 1597940575, "upvotes": 15}, "g286eww": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g286eww/", "text": "I hate writing so much... so much... just let me do work and talk about it in groups...", "author": "Lord_Blackthorn", "created": 1597940493, "upvotes": 1}, "g285v1j": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g285v1j/", "text": "If anyone is struggling with how to write better in general I am currently reading Style- The Basics of Clarity and Grace and it is such an eye opener! I am regretting taking English Lit as my required English in undergrad because nobody ever taught me how to write.", "author": "squidp", "created": 1597940222, "upvotes": 3}, "g285qaa": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g285qaa/", "text": "I feel this so so hard. I’ve been trying to write two entire chapters of my dissertation over the last few months and I’m really struggling to get anything done. My primary advisor on my committee is going to be super disappointed in me and will definitely tell me I’m not working hard enough or taking this seriously but I’m really trying the best I can and it’s just extremely hard right now. I’m totally with you right now!!", "author": "douche-chills", "created": 1597940158, "upvotes": 7}, "g284vde": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g284vde/", "text": "Ugh, yes. I defended and now have to make edits to my thesis, but really I don’t even want to open the thing, much less revise it.", "author": "kd4444", "created": 1597939738, "upvotes": 3}, "g281pls": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g281pls/", "text": "Sure it is. I don't event type this comment", "author": "kotobuki09", "created": 1597938257, "upvotes": 1}, "g27xd5w": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27xd5w/", "text": "Trying to finish the first chapter of my thesis today. I'm reading this post instead. Not sure if this is the motivation I needed or didn't need.", "author": "wolfpackgolfer", "created": 1597936254, "upvotes": 9}, "g27w4bx": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27w4bx/", "text": "I have to revise an academic journal article for re-submission and I'm so anxious about it I can't even focus", "author": "carlaacat", "created": 1597935665, "upvotes": 8}, "g27sfkj": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27sfkj/", "text": "Just don't think that simply re-writing is going to make any change.", "author": "philolover7", "created": 1597933871, "upvotes": 1}, "g27rww0": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27rww0/", "text": "The more I write the more I forget how to write", "author": "Francescodepazzi", "created": 1597933607, "upvotes": 33}, "g27rucp": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27rucp/", "text": "I feel so bad for grad students working on dissertations this year. After my prelims, I spent a year basically doing nothing, just exploring research options, reading literature, and mapping out potential projects. I finally started writing about a year after prelims, and it was such a struggle most days to sit myself down and say \"okay, you're going to finish this section of this chapter today\". I had days where I just needed to play video games all day and not think about writing at all. I finished the damn thing and graduated, but if you asked me *how* I did that, I couldn't tell you. It's all a blur.\n\nTo imagine all that on top of a global pandemic and the intense disruption that has caused is difficult. I deeply empathize (and sympathize) with you all! Good luck, and just do the best you can.", "author": "KaesekopfNW", "created": 1597933572, "upvotes": 155}, "g27rip4": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27rip4/", "text": "Comments from your advisor:\n\n* Don’t start a sentence with the gerund form.\n* Use of expletives is unacceptable academic prose.\n* “Hard” means difficult to penetrate, or solid. You meant “difficult.”\n* I wrote about the difficulties of prose composition at length in my last book. You should cite me, and these other twenty sources you clearly haven’t read.\n* Expand.", "author": "Protean_Protein", "created": 1597933410, "upvotes": 62}, "g27pmv2": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27pmv2/", "text": "I've been spending 3-4 hours a day writing drafts and proposals for one of my exams. I just feel so burnt out and we're only 4 days in to the semester!", "author": "Dawalkingdude", "created": 1597932443, "upvotes": 17}, "g27pgpx": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27pgpx/", "text": "Oof. This is such a mood. I'm currently writing three different papers, and I feel like I'm drowning.", "author": "bunny_ducky", "created": 1597932357, "upvotes": 51}, "g27p3im": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27p3im/", "text": "This post would have taken me a week to write.", "author": "Dr-dumb", "created": 1597932151, "upvotes": 268}, "g27m637": {"link": "/r/GradSchool/comments/id9zbu/writing_is_so_damn_hard/g27m637/", "text": "There is nothing usable here. You need to scrap it and start fresh.", "author": "offalt", "created": 1597930592, "upvotes": 313}}}