{
  "sid": "qf96py",
  "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/",
  "title:": "Talking to professor about poor assignment grades?",
  "text": "I am a MSc student taking courses at the start of my degree. I am taking one course with a professor I have known since I was an undergrad, and who is well respected in the field. On the last few assignments I have performed poorly, I could have easily scored 85+ but achieved 70s due to silly/careless errors. I am currently working two jobs (my stipend is quite small and I am about to start paying off my student loans) and have had a hard time managing the workload. However, I know school is my top priority and have decided to quit one job and reduce my hours at the other - I’m already feeling better about life, sleeping better, and am way less strung out. I wanted to approach my professor and sort of explain myself/apologize for my lack of effort in the class and show them I am taking the steps to do better - I feel that my poor grades make it seem like I am being disrespectful by not giving the class the attention it deserves and I don’t want to give off the impression of someone that doesn’t care. \n\nAny advice for this situation? The midterm for the class is this week and I expect to do well, and on the next assignment as well due the day before. Would an email be good in this situation, or better to do it face to face after my next class? For context, the class has about 7-8 students at the masters and PhD level combined. Thanks in advance, guys.",
  "author": "vector_detector",
  "created": 1635136971,
  "updated": 1635185326,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {
    "hhyudbq": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhyudbq/",
      "text": "I would not suggest trying to get them to raise your grades. This may seem heartless, but your life situation isn't really grounds for anything here. You said yourself, you made the mistakes. Asking the professor to overlook them and give you an unfair grade is wrong.",
      "author": "Laovvi",
      "created": 1635155056,
      "upvotes": 10,
      "replies": {
        "hhzms9r": {
          "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzms9r/",
          "text": "Fair enough, the goal isn’t to get them to raise any grades, just to say like “hey sorry for being a shitty student lately, here are the steps I am taking to do better”. But it sounds like in this case actions will speak louder than words so I plan on keeping my mouth shut",
          "author": "vector_detector",
          "created": 1635172470,
          "upvotes": 2,
          "replies": {
            "hhzng3w": {
              "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzng3w/",
              "text": "Sorry, I misunderstood  your intentions. I can appreciate the desire to let them know what's been happening. If you have in-person contact with them, I would suggest just very quickly being like \"hey, I recognize I've dropped the ball and I'm working on doing better\". But I wouldn't send an email just to say this because I'm sure we all know how quickly email inboxes get clogged up.\nBest luck with your studies!",
              "author": "Laovvi",
              "created": 1635172755,
              "upvotes": 2,
              "replies": {
                "hhzqy7i": {
                  "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzqy7i/",
                  "text": "Noted. Thanks a lot :)",
                  "author": "vector_detector",
                  "created": 1635174267,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhz54ff": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhz54ff/",
      "text": "If I were the prof, this would just come across as awkward. If you want to improve your grades, just do it. You get what you get.",
      "author": "ArnieAndTheWaves",
      "created": 1635163324,
      "upvotes": 8,
      "replies": {
        "hhzmt7r": {
          "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzmt7r/",
          "text": "Seems reasonable. Thanks",
          "author": "vector_detector",
          "created": 1635172482,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhzgj20": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzgj20/",
      "text": "Don't tell people you will do better. Just do better.",
      "author": "Altorode",
      "created": 1635169564,
      "upvotes": 4,
      "replies": {
        "hhzmx2d": {
          "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzmx2d/",
          "text": "Already on it. Thanks for the input",
          "author": "vector_detector",
          "created": 1635172530,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhyappi": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhyappi/",
      "text": "Honestly, no. Your professor likely isn't interested. I get these emails by the dozen. Life does get in the way, and I am sympathetic. I have been there. But I honestly just don't have time to read a hundred of these emails a day and I'm not particularly interested in excuses. He will ask if he's really concerned. \n\nBut the best way to show your professor that you are going to improve things is by doing it. Show, don't tell.",
      "author": "Ophelia550",
      "created": 1635138488,
      "upvotes": 14,
      "replies": {
        "hi0119x": {
          "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hi0119x/",
          "text": "Yikes. That's probably why when I said I was dealing with neurological problems because of Covid nobody cared. Good to know. It makes me sad to think it's just a factory. Get em in and get em out. Like i get people have a lot of work to do but why should I care if you don't?",
          "author": "vezione",
          "created": 1635178479,
          "upvotes": 1,
          "replies": {
            "hi02bz3": {
              "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hi02bz3/",
              "text": "What are you even talking about?\n\nThis person was talking about making silly mistakes and being busy. That's the story of a lot of students. I am not qualified to diagnose your medical problems and to lay that at my feet is totally ridiculous.\n\nIf a student is having a legitimate problem - an illness, a family problem, legal issues, etc - then of course I will work with them. But making mistakes and promising to do better is common. \n\nIf you are disabled, work with the disability office. I am not qualified to determine anyone's level of disability, nor should I. \n\nStudents looking to be victims and being hostile like you are are definitely not going to gain any sympathy.",
              "author": "Ophelia550",
              "created": 1635179000,
              "upvotes": 1,
              "replies": {
                "hi04kx1": {
                  "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hi04kx1/",
                  "text": "Oh I see. I misinterpreted what you were referring to. But wow. I'm looking to be a victim is fun to think about. I might have been wrong about some things in my Initial comments but you're definitely the one being hostile. 🤷",
                  "author": "vezione",
                  "created": 1635179938,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "hhzmtzy": {
          "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzmtzy/",
          "text": "Good advice, thank you",
          "author": "vector_detector",
          "created": 1635172492,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhyhm5b": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhyhm5b/",
      "text": "Just do it. Less talk, more action.",
      "author": "fwafwa",
      "created": 1635143792,
      "upvotes": 8,
      "replies": {
        "hhzmvfk": {
          "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhzmvfk/",
          "text": "Seems to be the consensus here. Thanks for the input",
          "author": "vector_detector",
          "created": 1635172510,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi00ef0": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hi00ef0/",
      "text": "Just talk to them asap. There's a good chance they'll appreciate you came to them letting them know. Always talk to your professors even if you have nothing to say.",
      "author": "vezione",
      "created": 1635178218,
      "upvotes": 2,
      "replies": {}
    },
    "hi04qs8": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hi04qs8/",
      "text": "Once you have completed an assignment, one that your professor has looked at, where you have managed to improve significantly, then go and talk to them. Let them know that your work will continue to be improved from now on.",
      "author": "raistlin65",
      "created": 1635180006,
      "upvotes": 2,
      "replies": {
        "hi0ewmo": {
          "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hi0ewmo/",
          "text": "I think this is what I am leaning towards - better to show it first, and then talk about it, rather than end up over-promising and under-delivering. Cheers",
          "author": "vector_detector",
          "created": 1635184167,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhya8zn": {
      "link": "/r/GradSchool/comments/qf96py/talking_to_professor_about_poor_assignment_grades/hhya8zn/",
      "text": "Don't overthink it. If you're comfortable with the professor just do it.",
      "author": "beepbooplazer",
      "created": 1635138158,
      "upvotes": -5,
      "replies": {}
    }
  }
}