{
  "sid": "q7jo1n",
  "link": "/r/GradSchool/comments/q7jo1n/what_is_a_normal_number_of_hours_for_a_grad/",
  "title:": "What is a normal number of hours for a grad student to work?",
  "text": "I am working on my PhD in physics. I work a minimum of 50 hours a week in the lab, usually closer to 60. I am only taking two courses each semester but I barely have time to do the homework, much less do anything fun outside of work/school. I talked to my advisor about working fewer hours and he basically said if I was being a wimp and if I want to get anywhere in academia I need to be working that much. Before I started this program I definitely wanted to get my PhD and do research in the field I am currently working in, but if this is the reality of that I am not sure.\n\n&#x200B;\n\nHow many hours do y'all work in the lab? Am I just being a wimp about it or is too much being asked of me?",
  "author": "JimTuesday",
  "created": 1634156113,
  "updated": 1634167795,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hgj2ke7": {
      "link": "/r/GradSchool/comments/q7jo1n/what_is_a_normal_number_of_hours_for_a_grad/hgj2ke7/",
      "text": "i’m in psychology. my advisor expects me to spend 40hours/week on classes and research (that includes designing studies, collecting data, writing, etc). like you, i’m taking two courses each semester. i usually spend two days on classes/class work (readings, writing, etc.) and the other three days on my own specific research. of course when there are strict external deadlines (grants, conferences) i work more and may work weekends. \n\non the other hand one of my cohortmates works from 10am to 2am daily, six days a week. i would not encourage that and tbh i think he just isn’t managing his time well. i also don’t know how much of that 10am–2am of his is *actually* spent working.",
      "author": "victoria-lobster",
      "created": 1634157660,
      "upvotes": 4,
      "replies": {}
    },
    "hgj3t7i": {
      "link": "/r/GradSchool/comments/q7jo1n/what_is_a_normal_number_of_hours_for_a_grad/hgj3t7i/",
      "text": "i think on average 60 is how many hours an organic chemist phd puts in. personally i was on the low end, as i did not work or do \"homework\" on weekends. I probably worked 40-60, with 50 likely being the average. You really need to figure out what is important. Why are you so worried about doing homework for classes? research should really be your focus, and homework should be included in your work hours for the week. I assume next year you will not have homework. For example, if you are used to class all day and homework all night, you need to change that attitude. adjust down your research hours and do homework during that time during the day. Ideally you should not have to spend much time on homework, because you just need to pass the classes. It will be your research that moves you into the next stage of your career, not some foolish grades. grad students are adults and humans too and they deserve good things and time to themselves. you are not just punching a clock, be successful and efficient rather than just an hour-counter. make your phd your own.",
      "author": "pprovencher",
      "created": 1634158172,
      "upvotes": 1,
      "replies": {}
    },
    "hgjf97v": {
      "link": "/r/GradSchool/comments/q7jo1n/what_is_a_normal_number_of_hours_for_a_grad/hgjf97v/",
      "text": "In my MS I was paid for 20 hours but expected to work, at minimum, 50. It was brutal. In my PhD (different school and field) I am strongly discouraged from working more than I am being paid for, which is currently 10 (but looking at being bumped to 20).",
      "author": "Weaselpanties",
      "created": 1634163056,
      "upvotes": 1,
      "replies": {}
    }
  }
}