{
  "sid": "qin7i0",
  "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/",
  "title:": "Lack of direction as a 1st year PhD?",
  "text": "I'm required to do an independent research project for my program in my first year as a PhD student. Most students base their projects off of a larger research project they work on with their PI. I got admitted on fellowship and I'm not affiliated with any current project. \n\nI know I'm very lucky to not have to juggle TA or project responsibilities but I am feeling overwhelmed. I don't have the resources other students have to conduct research because I'm not affiliated with a project. I am feeling paralyzed on this independent project without having any set limitations.\n\nMy advisor has similar interests to me and is brilliant, but I keep feeling he expects more independence from me because I got myself admitted on fellowship. I feel like I constantly disappoint him because I am months into this program now and still don't have a clear research question to pursue. I entered this program with specific interests, but I feel like I'm reading and reading on my own and am not getting anywhere with it. I frankly feel so undeserving of this fellowship and feel like I've done nothing with my time here so far.\n\nHow do I ask my advisor for more support? Or how do I figure this out on my own / find other resources to be a more productive scholar? Thanks for any advice, I'm a first gen student and academia is such a foreign place for me!\n\nEdit: I am in STEM Education!",
  "author": "ibalboa",
  "created": 1635544014,
  "updated": 1635780465,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hikkfsz": {
      "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hikkfsz/",
      "text": "Probably would help to edit your original post and say what discipline you're in. As the answers could certainly vary depending on that.",
      "author": "raistlin65",
      "created": 1635545832,
      "upvotes": 5,
      "replies": {
        "hikmw4c": {
          "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hikmw4c/",
          "text": "Thank you, that makes sense! I am in STEM Education, so \"resources\" are often school partnerships, access to human subjects, long term community projects etc. I can't imagine building this infrastructure as a lonely grad student (I did so over several years as a job before going to grad school)",
          "author": "ibalboa",
          "created": 1635546916,
          "upvotes": 4,
          "replies": {
            "hiknzcl": {
              "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hiknzcl/",
              "text": "It would even help to say which part of STEM you're in.\n\nThere are people with discipline specific knowledge that hang out on here who might be able to help you.",
              "author": "raistlin65",
              "created": 1635547395,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hipux87": {
      "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hipux87/",
      "text": "I don't know if it's helpful, but I think I felt kind of similar to how you feel in my first year, too. I'm coming at this from a Psychology / Cognitive Neuroscience perspective.\n\n I wasn't on Fellowship, but I was the first grad student my advisor ever took. While most people in my cohort came into Labs that had established collaborator networks, senior grad students, pre-established data processing pipelines, and data sets, I had none of that, and it bummed me out a bit. I knew coming in I'd be doing a lot of this, but I underestimated how much time it would take for me to build all of this, how much of the responsibility would fall on me, and how much it would slow down my own personal progress. The final for my first class in grad school demanded that we use a pre-existing data set to answer a novel question; basically writing an entire manusript. Everybody else just pulled data that their lab collected and tweaked a question. I, unfortunately, having just started grad school and not knowing what question to ask, was spending weeks sifting through publicly accessible data sets with little luck. That project was horrible. I can count on one hand the number of times I've felt like sad crying in the past fifteen years and yet I almost broke into tears presenting it because the feedback I got was so bad.\n\nI wasted a lot of time that others in my cohort didn't have to just trying to build a structure in my lab and find a direction. I think I put in more hours than anyone else in the damn program just to try to catch up to everyone else, but in that process I also developed a lot of skills others in my cohort don't have. I've become a go-to person to consult with when people have advanced statistical questions or neuroimaging methodology. I've been asked to give presentations and run training workshops on coding in R and bash. I managed to pop out 3 first author papers and get authorship on like 8 other papers at differing stages of production in my first two years just because I kept jumping on projects to explore things. I also found out I'm light-years ahead of everyone else I know in terms of study coordination and regulatory management.\n\nMy advice is just keep in mind that exploration is part of the process. Advisors know that. Grad schools all about exploring weird places and seeing what you find. You never know what you're gonna get out of it; what things you're gonna like and what skills you're gonna figure out you are good at. The pandemic definitely didn't make this process any easier on me but hopefully you don't have to worry about that as much now. Say yes to a lot of different things and you'll eventually start to see a theme in the stuff you like. It feels super uncomfortable, and I don't know that that ever really goes away, but you kind of get used to it.",
      "author": "DonHedger",
      "created": 1635646253,
      "upvotes": 2,
      "replies": {
        "hiqyee5": {
          "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hiqyee5/",
          "text": "Thank you so much for sharing your experience! This is exactly how I feel and this is super helpful for helping me reflect on why I feel so stuck. My advisor is also fairly new and I've found myself having to build a lot of processes on my own, not to mention finding opportunities and getting projects off the ground during COVID.\n\nI am glad to hear it has gotten better for you and you ended up getting a lot out of grad school.",
          "author": "ibalboa",
          "created": 1635674783,
          "upvotes": 1,
          "replies": {
            "hird018": {
              "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hird018/",
              "text": "Great glad to hear it. I'm in my third year now, so still getting plenty out of grad school. Good luck! And congrats on the fellowship",
              "author": "DonHedger",
              "created": 1635685405,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiltw76": {
      "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hiltw76/",
      "text": "In a doctoral program, you are expected to learn how to be self-guided, get resources and be productive in an unstructured and ambiguous situation. Those are all challenging to learn, and sometimes you are not told that these are the critical subjects. Get your advisor to help develop a plan for you. \n\nBecoming \"paralyzed\" in the face of uncertainty will prevent any other success, so your alarm about feeling that way is well justified.",
      "author": "IkeRoberts",
      "created": 1635568292,
      "upvotes": 2,
      "replies": {
        "hiqz49g": {
          "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hiqz49g/",
          "text": "Thank you! I'll definitely talk to my advisor more about this. In thinking about this more, I think I've been missing cues from my advisor about how to be more productive and finding a research direction.",
          "author": "ibalboa",
          "created": 1635675395,
          "upvotes": 1,
          "replies": {
            "hirjqjk": {
              "link": "/r/GradSchool/comments/qin7i0/lack_of_direction_as_a_1st_year_phd/hirjqjk/",
              "text": "Good luck! These are all things we need to learn, they don't come to us automatically.",
              "author": "IkeRoberts",
              "created": 1635689119,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}