{"sid": "pr78ow", "link": "/r/GradSchool/comments/pr78ow/europeans_going_to_grad_school_in/", "title:": "Europeans going to grad school in Canada/Australia/NZ?", "text": "Hi everyone,\n\nI'm from Europe and I'd like to know how is grad school in non-US overseas Anglo countries is. Here in Europe grad school is usually treated more as a job than as a part of college - you get a proper salary, you don't have to hunt for grants and you're not extremely overworked. However, grad prospects might not be as excellent and competitive as in the US. So I was wondering how the model in Canada/Australia/NZ is, and also how the entry process is; these countries are sometimes described as a \"happy medium\" between Europe and the US so I was curious to know if any of you have some experiences.", "author": "apfelplumcake", "created": 1632055436, "retrieved": 1632952199, "over_18": false, "upvotes": 2, "upvote_ratio": 0.75, "comments": {"hdk18uw": {"link": "/r/GradSchool/comments/pr78ow/europeans_going_to_grad_school_in/hdk18uw/", "text": "Forget Australia. They are having a hard lockdown until 2022.", "author": "articlesarestupid", "created": 1632113676, "upvotes": 1}, "hdhl082": {"link": "/r/GradSchool/comments/pr78ow/europeans_going_to_grad_school_in/hdhl082/", "text": "I'm in Canada (Toronto); I don't really feel overworked but we have a responsibility to apply  for external funding. We don't get as much salary as you guys (it's enough for one person to live on but if you have dependents then it's probably not possible). Admissions process is the same as US. \n\nThis is for computer science.", "author": "ning7", "created": 1632073458, "upvotes": 1}, "hdghuua": {"link": "/r/GradSchool/comments/pr78ow/europeans_going_to_grad_school_in/hdghuua/", "text": "My experience in Canadian grad school is that it's much like how people describe the US (US citizens studying with me said so too). I am now studying in Europe and while it's more chill I do think that grad school is just generally a lot of work.\n\nEdit/disclaimer: I'm a Canadian studying in Europe (who transferred from a Canadian PhD).", "author": "Phlippieskezer", "created": 1632056331, "upvotes": 2}}}