{
  "sid": "r34qpw",
  "link": "/r/GradSchool/comments/r34qpw/feeling_lost_and_unmotivated/",
  "title:": "Feeling lost and unmotivated",
  "text": "I'm doing an MSc at an Australian university partly because I had no idea what to do and can't find an ideal job when I was graduated from college. I did ok in most coding courses and particularly well in scientific computation/data analysis so I felt like it would be safe to apply for an MSc in applied math and keep on doing what I did great in my undergrad years.\n\nI did enjoy the first semester of MSc and nailed yet another scientific computation course, which gave me a huge boost in confidence that I probably should consider doing a PhD or something. But the program does not offer any breadth or track related to scientific computation or data analysis so I had a talk with the program director and we decided to switch my track to operations research to see how it goes. And it turned out to be not that bad and I did find a great supervisor who is always nice and willing to work with me even if I literally knew nothing about OR before switching.\n\nBut then I had a tough semester outside class and did really bad in one of the courses (not compulsory but it is listed as a key elective). It felt like I'm getting crushed by this bad performance and stuck in a weird loophole of self-questioning. I always identify myself to be more of a practical than theoretical mind as I did quite well in courses that involve more coding or modeling and less justifications or proofs. But then it felt like I was just trying to find an excuse for not pushing myself and the fact you need both practical and theoretical knowledge to establish a strong argument to even apply for a PhD makes me feel even worse. I was doing ok in my research and got approved by my supervisor quite often but now I feel like he was just being respectful and maybe it was all but child's play of what I've been doing. \n\nI know that it is probably still too early to give up but I'm not sure what can I do to get myself back. Maybe I should contact the university that I'm interested in and see how they evaluate candidates or how grades are converted. Or maybe I should talk with my supervisor to see if I can use some of my master thesis to get a publication or something, but that just seems too bright to even think of as I'm about to graduate next year.\n\nSorry for all this hectic nonsense and poorly organized post. I'm just feeling really bad and gloomy about my future.",
  "author": "Alhazar",
  "created": 1637985521,
  "updated": 1638207991,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {}
}