{
  "sid": "qsme8c",
  "link": "/r/GradSchool/comments/qsme8c/interview_tips_for_counselling_and_clinical/",
  "title:": "Interview Tips for Counselling and Clinical Psychology Programs",
  "text": "Hi everyone! I’m currently a counselling psychology masters student and I wanted to share some tips for other students who are thinking of going down this path. I did an honours thesis with a clinical psychology professor during my undergrad program and this is some of the advice she gave me for grad school interviews (this was for counselling and clinical psychology programs but it may be helpful for other grad school interviews too).\n\n\\-Prepare for the questions! Write up a list of all the possible questions you might be asked. Get your friends to do the same. Ask your professors what kinds of questions they ask, or were asked (same for graduate students).\n\n\\-Be prepared to talk about your research, or what kind of research you would do if you had the chance. My professor said she knew of a student who was asked what hypotheses he would test, what measures he would use, and other details about data analysis of a hypothetical future study.\n\n\\-Be prepared to talk about the major issues/controversies in your field. Know names! You might be asked things like, “tell me about an article you read recently and how it influenced your thinking in this area.”\n\n\\-Also think about your strengths and weakness (research and personal), why this program, what would prevent you from accepting, any glaring inconsistencies in your application, etc. etc.\n\n\\-Be prepared for general questions – e.g., tell me about yourself\n\n\\-Make sure you prepare questions for the interviewers. Ask them about their research if you are interested in working on with them, or ask them about the program/clinical experiences etc. If you can get them talking and have a good discussion about research that will speak well for your chances!\n\n\\-Often, even when you are not being formally interviewed you are still under observation. Present your best to the staff, students and faculty at all times. You never know who might have input with the admissions committee.\n\n\\-It is critical that you speak with multiple graduate students in the program. You should have a set of questions for the students and it is ok to ask the same questions of different people. Don’t make decisions about programs until you’ve talked with people who work with your potential advisor.\n\n\\-Write a thank you (email is fine) to the people who interviewed you, also to any staff who were particularly helpful.\n\nI also made a video where I talk a bit more about these tips and other advice for doing well in grad school interviews if anyone is interested: [https://youtu.be/vNXcbFT59e8](https://youtu.be/vNXcbFT59e8)\n\nGood luck in your applications and interviews! (:",
  "author": "lindaedith",
  "created": 1636755585,
  "updated": 1637182755,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkgwsk0": {
      "link": "/r/GradSchool/comments/qsme8c/interview_tips_for_counselling_and_clinical/hkgwsk0/",
      "text": "I just want to reiterate the bits about connecting with the current grad students and presenting yourself well even at casual events. My program takes grad student input seriously, and we’ve seen some really unprofessional behavior outside of interview times that hurts our impression of the applicant.\n\nLike, if you’re staying at a grad student’s home for interviews and you both discuss needing to leave by 7:30am for the interview day, don’t oversleep and make them wake you up at 7:45 😅",
      "author": "Jwalla83",
      "created": 1636819768,
      "upvotes": 2,
      "replies": {
        "hkikotz": {
          "link": "/r/GradSchool/comments/qsme8c/interview_tips_for_counselling_and_clinical/hkikotz/",
          "text": "Thanks for sharing this! I can't even imagine a potential grad student acting that way, did that happen? haha\n\nI think most people would focus on presenting themselves well in front of the admissions committee and potential supervisors, but overlook the input of grad students. Don't make that mistake!",
          "author": "lindaedith",
          "created": 1636845381,
          "upvotes": 1,
          "replies": {
            "hkip8xn": {
              "link": "/r/GradSchool/comments/qsme8c/interview_tips_for_counselling_and_clinical/hkip8xn/",
              "text": "Oh yes it happened lol. I had to wake him up and his first priority was to smoke a cigarette 🤷‍♀️",
              "author": "Jwalla83",
              "created": 1636847312,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}