{
  "sid": "qjr27d",
  "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/",
  "title:": "Being pushed into doing thesis work. How to proceed?",
  "text": "Hi guys, I'll try to keep this short. I enrolled in grad school two semesters ago under my school's non-thesis curriculum. This route only requires one extra class and a special projects stipulation (I'll get back to this part later). Compared to the thesis route, the non-thesis option does not take any longer and is a lot less stressful. Actually, it might even be shorter. \n\nMy advisor and professor I work under (same person) initially kept saying things such as \"If you choose to do the thesis route\" whenever I first joined. However, these things slowly turned into \"For your thesis\" and I found myself doing research for him day and night, year-round. I am not sure when, but at some point I fell out of the normal non-thesis Master's route and ended up being pushed into doing thesis work. Scheduling for next semester is coming up and upon looking at my needed workload, I realized I can graduate next semester.\n\nThis is where the problem comes in. To graduate under the non-thesis option, I need to complete 3 hours of a special projects course. However, each time you register and complete a projects course, it is up to the professor's discretion on how many credits to award you with. I talked to my professor about my desire to graduate soon and reaffirmed how I am not enrolled in the thesis route. Needless to say, he was pretty livid but this is besides the point. Being that I only need 3 hours for the projects course, I would simply take it next semester. Normally, people only take this once as a semester's worth 3 credit hours. However, he told me that he will only award me one credit hour for each special projects course, meaning it will take me an extra year to continue with my non-thesis option. What should I do and how should I proceed?",
  "author": "SantiagoOrDunbar",
  "created": 1635691790,
  "updated": 1635780433,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.88,
  "comments": {
    "hirrjco": {
      "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/hirrjco/",
      "text": "Go over their head. Your being picked on here out of pure anger and spite",
      "author": "Detozi",
      "created": 1635692802,
      "upvotes": 37,
      "replies": {
        "hirzfbs": {
          "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/hirzfbs/",
          "text": "After talking with other Masters students in my department, I finally realize how cheated I’ve been. Working 60+ hours a week outside of my schoolwork, plus the hours put into my thesis work, for far too long.",
          "author": "SantiagoOrDunbar",
          "created": 1635696273,
          "upvotes": 21,
          "replies": {
            "hisa2ea": {
              "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/hisa2ea/",
              "text": "Maybe you can get switched to another advisor so you can graduate? Keep any documentation you have, like him asking/telling you to do thesis work for him, etc",
              "author": "greensleeves97",
              "created": 1635700844,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "hitsj53": {
          "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/hitsj53/",
          "text": "This.  If your PI went way out of line go talk directly to their boss (Dean, head of dept, etc.) and explain their inappropriate behavior, then explain how it affects (delays) your PhD progress. Mention you have reiterated your plans to PI before and has still not complied.",
          "author": "TomBanj0",
          "created": 1635725249,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hirzcys": {
      "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/hirzcys/",
      "text": "Do you have a university Graduate Studies Office? Talk to them. If not, talk to an advisor in your college dean's office.",
      "author": "raistlin65",
      "created": 1635696244,
      "upvotes": 7,
      "replies": {}
    },
    "hitdj3q": {
      "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/hitdj3q/",
      "text": "Fuck your advisor. It's your degree, not theirs. I would also report that asap.",
      "author": "callednotqualified",
      "created": 1635717747,
      "upvotes": 5,
      "replies": {}
    },
    "hiu7zxw": {
      "link": "/r/GradSchool/comments/qjr27d/being_pushed_into_doing_thesis_work_how_to_proceed/hiu7zxw/",
      "text": "Graduate with a different advisor. This person is pissed they aren’t getting free labor anymore. That’s unacceptable. Go to your DGS and department head and ask them to give you a different advisor to graduate with.",
      "author": "hiagha",
      "created": 1635733244,
      "upvotes": 3,
      "replies": {}
    }
  }
}