{"sid": "a08z8x", "link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/", "title:": "Research culture is toxic", "text": "Being praised for working 10 hours each weekend day instead of having a life outside of research\n\nBeing berated for not doing enough and not knowing what you're doing\n\nBeing told to stick it out even though it's hell\n\nMissing out on family events\n\nMissing out on moments with friends\n\nResearch culture is toxic and I'm not sure how much longer I can stick it out", "author": "Yardledy", "created": 1543156997, "retrieved": 1632845248, "over_18": false, "upvotes": 671, "upvote_ratio": 0.94, "comments": {"eajb7dh": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eajb7dh/", "text": "Research culture isn't toxic. It's just some workplace culture may be toxic.\n\nFirst, learn to say \"no\". Know what your options cost you and grant you, then make the decision. Don't make blanket choices of 'yes' to every person who makes a request. ", "author": "First_Foundationeer", "created": 1543275263, "upvotes": 5}, "eaihfqh": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eaihfqh/", "text": "Thank you for this. My advisors are the only ones in our department that encourage a lifestyle like this, and it has made my Master's experience hell. I am working really hard to set my own boundaries, and while it has been very difficult, my anxiety and depression have been helped a ton by trying to achieve some semblance of a work-life balance.", "author": "Umaritimus", "created": 1543253208, "upvotes": 2}, "eai20no": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eai20no/", "text": "You don’t need to conform. If that’s the attitude they want then why stay? Do what suits you, and if they don’t like it they can kick you out. So what.", "author": null, "created": 1543240439, "upvotes": 2}, "eahwvle": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eahwvle/", "text": "I suggest seeing a mental health counselor at your school and sharing these concerns with him or her or them. The counselor will help give you the tools to address these concerns and suggest ways of communicating with your PI that can help out.\n\nResearch culture is for sure somewhat toxic, but at the end of the day if what you love gets you out of bed in the morning then you should continue to do it, not many people have that luxury in life.\n\nGood luck!", "author": "damiandiflorio", "created": 1543233716, "upvotes": 1}, "eahsc69": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eahsc69/", "text": "I had the same experience in my lab. I left after I defended my Master's thesis and never looked back, and 1.5 years later I make almost 6 figures and manage a major east coast section of the private industry company I work for. I have an excellent work-life balance. No matter what pressure your department tries to put on you, don't be afraid to leave. The grass IS greener on the other side.", "author": "KatharticHymen", "created": 1543223562, "upvotes": 2}, "eahomdg": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eahomdg/", "text": "That's heavy and definitely not normal.\n\nYes, too many people work to many hours, but missing family events or not being able to meet friends is extreme and has nothing to do with research culture.\n\nI did a lab rotation with a PI who was quite demanding and always told me to do another experiment and stay longer when I wanted to leave before a certain time (ignoring on how many hours we agreed before) but even he knew that holidays are holidays.\n\nThe other people I worked with never tried that nonsense. The postdoc I was a research assistant for wanted me to write down my hours, but only because he had no idea what was doable. So for that job I needed to be \"on point\".  \nThe other people I worked with were all super relaxed and generally were/are more interested in how much I get done, not whether or not I work a certain number of hours.  \nIf I leave my current lab at, say, 3p.m. noone bats an eye. I usually don't work on weekends, if I have to, it's just the bare minimum (so one day, max 3 hours).  \nI might work between Christmas and New Years Eve, to keep my experiments running, but again, I'll just do the bare minimum, not working a full day. If I would take vacation, noone would say anything (but then my experiments would pause). In fact, most people will be on vacation themselves.", "author": "LittlePrimate", "created": 1543217102, "upvotes": 1}, "eahde6z": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eahde6z/", "text": "Culture in YOUR lab is toxic. Yes, a lot of labs have toxic culture, but there are also those that don't.", "author": "airwalker12", "created": 1543203845, "upvotes": 2}, "eahc97q": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eahc97q/", "text": "You're a worker, not a slave.", "author": "moistfetus_", "created": 1543202769, "upvotes": 2}, "eah5f1e": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eah5f1e/", "text": "Are you a woman? I’m not being sexist, it’s just that women tend to value things outside the workplace like family and personal time. It’s a very male oriented culture, particularly in stem and it’s not toxic, it just may not suit you. There are other fields that may be more suited for you and at your pace. Have you considered a more educational role, perhaps teaching schoolchildren your subject? That gets rid of the nasty stress of research, plus you get to work with children! A win-win. Just a suggestion. That kind of thing is usually far more rewarding and has softer work requirements. \n\nThe culture is no different than that of Goldman Sachs, you’re a grunt at the highest level of your field and you’re expected to slave away. That’s just the way things are. It’s not toxic, it’s simply how the highest echelons of literally anything at all operate. ", "author": "faguzzi", "created": 1543196538, "upvotes": -13}, "eah54ra": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eah54ra/", "text": "Sounds like most jobs.\n\nEdit: Some of you are going to be in for a rude wake up call.", "author": "HistoryBoof", "created": 1543196289, "upvotes": -2}, "eah534w": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eah534w/", "text": "This isn’t going to be the empathetic response you might be looking for...  It’s not research culture.  It’s the demands of professional career development.  Professional development in law, finance, medicine, the military... it’s all about the same with respect to the demands on our time, effort, and capacity for delayed gratification.  Leaders in any of these fields, including your own PI, have endured the challenges you’ve described.  There’s no shame in finding a job to work, enjoying your free time, and building meaningful relationships.  That being said, learning to balance work with recreation is a critical skill for all of us, and it does take effort.  ", "author": null, "created": 1543196249, "upvotes": -2}, "eah1z1p": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eah1z1p/", "text": "amen", "author": "sarasotadude", "created": 1543193656, "upvotes": 2}, "eagv3ij": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagv3ij/", "text": "This isn’t a research culture thing. I’m in a STEM PhD and the only people who work like this are the ones that fail to set their own boundaries. Oh and the students of that one weird professor in my department who still insists on speaking in Chinese to everyone for some reason. ", "author": "vaishnavitata95", "created": 1543188223, "upvotes": 4}, "eagu0zv": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagu0zv/", "text": "It doesn't have to be like this. The day I got an email at 11pm and was accused of \"abandoning the lab\" because I didn't respond by 7am the next morning was the day I decided to look for other PIs. Even though some PIs may want you to think otherwise, grad students have options!\n\n&#x200B;\n\nEDIT: Grammar", "author": "ben_bitdiddle", "created": 1543187365, "upvotes": 6}, "eagtbr1": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagtbr1/", "text": "What's worst for me existentially and practically is... I never ever cared about money until grad school. I cared about science, about ideals, about contributing to society, blah, blah. But now I'm afraid that with this graduate stipend, I am utterly and completely unable to deal with serious emergencies if they arise. \n\nThe admin people in my program always tries to force us to believe that we should be thankful for the graduate stipend. In a way, I am. But on the other hand, such low graduate pay indicates that society in general has fucked up priorities. ", "author": "UnluckyInformation", "created": 1543186817, "upvotes": 5}, "eagk1j2": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagk1j2/", "text": "[deleted]", "author": null, "created": 1543179908, "upvotes": 6}, "eaggb86": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eaggb86/", "text": "It is also highly discriminatory. No matter how hard you work, unless you have the pedigree, or if you luck out, your skin color and gender will be more important than your accomplishments. ", "author": null, "created": 1543177471, "upvotes": -5}, "eagfvhd": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagfvhd/", "text": "I left science because of this. It was my lifelong dream to become a scientist. It was tough to find out I wasn't cut out for it - not because I didn't have the talent, but because I couldn't take the work culture.", "author": "JohnPaston", "created": 1543177187, "upvotes": 6}, "eagf62j": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagf62j/", "text": "I actually had a similar situation during my MS, and I learned a few lessons that helped me through it.\n\n1. Do not place your self-worth into how your research is going and don't allow your PI to convince you that this is the case. You are a graduate student doing research, you're human and have so much more to your identity than simply the number of hours you put in.\n\n2. Keep a work-life balance by setting boundaries. Happy grad students are productive grad students, and separating work from the rest of my life really helped with that. While I still might think about a research problem at home, I've made it a point not to go into lab on the weekends.\n\n3. Recognize that this is YOUR grad school experience. Not your PI's, not your cohort's, yours. You may share this experience with all of them, but you ultimately have a great deal of control in how this will end up.\n\n4. Document everything. Your PI sounds quite abusive, and I would definitely make sure I had everything filed. It helped me when I moved forward with a complaint later on.\n\n5. Recognize the problem is with your PI, not with you. If your PI is unable to deliver concrete examples of how you're failing, then you probably aren't. \n\nHow early on in your grad school career are you? If you are early on and feel like you want to quit, I would switch labs ASAP. \n\nI wish you the best of luck.\n", "author": null, "created": 1543176718, "upvotes": 7}, "eagde42": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagde42/", "text": "I also want to add that while this kind of culture does often come from the top down, having it perpetuated and normalized by other grad students can make it even worse. This will obviously vary by lab/department, but I can think of a couple grad students I know right off the top of my head who constantly want to 'one-up' everyone in how much they've been working, how much of a life they don't have outside of their work, etc... It's almost as if they're proud of how miserable they are, and I really can't stand that kind of energy. I think as much as possible being supportive of other grad students and not falling into these kind of thought patterns can at least help with some of this. None of us knows everything and we're not going to be perfect, this is especially true very early on. There's enough places to get this kind of negativity without us putting it on each other. ", "author": "no_iiiim_dirtydan", "created": 1543175506, "upvotes": 5}, "eagctlp": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagctlp/", "text": "I had to take a break from school so i could sneak wine to my grandma while she was in a nursing home.  Havent gone back yet.", "author": null, "created": 1543175088, "upvotes": 4}, "eagbidq": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagbidq/", "text": "Sounds like victimhood culture that is rife in upper levels of University. ", "author": "_Schwing", "created": 1543174151, "upvotes": 1}, "eagb2lr": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eagb2lr/", "text": "Most anyone experiences this at the outset of their career. Doctors, lawyers, auditors, political aids, engineers, etc. It’s just the cutting teeth bullshit phase of your life. ", "author": null, "created": 1543173851, "upvotes": 4}, "eag9w6b": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eag9w6b/", "text": "Set boundaries. Unless you sign a contract or some formal agreement with an “employer”/university etc, you aren’t obligated to work more than 40 hrs per week, or 8 hrs per day. I would just stop working that much and re-condition your PI to not expect more from you. This type of life is not ok. You need to have some work-life balance.", "author": "FemaleScientist17", "created": 1543173030, "upvotes": 4}, "eag957s": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eag957s/", "text": "My PI always tells us to take a long weekend and do all this fun stuff he did as a postdoc and grad student. Then you actually do one of those activities and they get onto you for not putting in the extra hours but then tells you not to work too hard and get burned out.... ", "author": "LipidDrop18", "created": 1543172499, "upvotes": 17}, "eag8xm4": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eag8xm4/", "text": "Everyone in my lab spends 12+ hours a day in lab. My PI leaves after midnight lol.", "author": "lolicon112233", "created": 1543172353, "upvotes": 6}, "eag5z8e": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eag5z8e/", "text": "Research culture is fine. Your lab sounds a little bad though.", "author": "tchomptchomp", "created": 1543170287, "upvotes": 5}, "eafzdjj": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafzdjj/", "text": "I don't know about you, but I took time off in between undergrad and grad school and that has made the difference for me. I pick what's important. When I applied to schools I picked ones with the work environment I wanted. You can't change that now, but you can reset your work boundaries. Work doesn't equal life. It's okay to assert that. ", "author": "hangryforknowledge", "created": 1543166056, "upvotes": 3}, "eafx8b6": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafx8b6/", "text": "The PI who says this also says you’re a tech without any job prospects wo pubs\nWhat are you doing in terms of pistdocs or industry jobs\nHow close are you to pubs: dint wait for him or her\nI know this is easier said than done and who knows who will get the awesome Postdoc or $$ industry job\nIn my dept, it was the person w the LOwest Gres and did not have unanimous support for admission\nNow has a $100k job. I am not kidding \nAnother person just wrote to me two weeks after the thesis deadline and said can you please review my thesis today ? THAT person gets a decent PD??? \n", "author": "Dorothy_Day", "created": 1543164750, "upvotes": -4}, "eafweqy": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafweqy/", "text": "There is hope outside of research. You can use your skills literally in any other field and have a work life balance.", "author": "tnoms", "created": 1543164250, "upvotes": 3}, "eafuevg": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafuevg/", "text": "There is a growing shift away from this toxicity. My institution has begun making mental health more of a priority. The PIs today come from that toxic culture, however I believe this generation will help change it. I refuse to come in on the weekends and holidays unless the project has some good exciting momentum. Otherwise the experiment can wait until Monday. Setting boundaries and making your health a known priority is important to keep afloat. And there's no shame in learning that the grad school track isn't for you. Stick it out (or don't) for you. By the way, you got into grad school, so you're awesome and you've done a lot of impressive work just to get there. You can apply that drive to anything you want. ", "author": "sneakypickle25", "created": 1543163050, "upvotes": 11}, "eafr813": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafr813/", "text": "It's not the research culture, it's your PI. Don't let him/her drag you down into their miserable lifestyle. Learn how to say no.", "author": "ModernBaloney", "created": 1543161159, "upvotes": 9}, "eafppm8": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafppm8/", "text": "Some PIs are more \"research is now your profession, treat it as such\" than others. Though honestly I'm not entirely sure what that even means. I know plenty of 'Professionals' that take time off from work to do things with friends and family. While there's nothing I can do about it, I'm sorry that your work environment is a toxic mess. \n\nI've known some PIs to give their students work that overwhelms them and some PIs that just want their students to be successful. The former are unfortunately fairly common and often I don't feel like the students that come out of those labs have a good feeling about continuing research in the future either in academia or industry nor do they have a truly solid PhD thesis. If you're doing parts of 10 other projects that belong to other people how can you focus on your own?\n\nSet your boundaries: if your PI doesn't respect that then I highly consider finding a different lab to work in. Clearly they're looking at you as cheap labor as opposed to a person with their own personal needs.", "author": "thatwombat", "created": 1543160200, "upvotes": 20}, "eafopdh": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafopdh/", "text": "This was my MS lab, as well. Horribly toxic, and an advisor who alternated between absent (literally, as in out of the country) and verbally abusive. \n\nI've moved on to a different field and it's not like that where I am now.  ", "author": "Weaselpanties", "created": 1543159438, "upvotes": 20}, "eafngzs": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafngzs/", "text": "It's not research culture that's toxic; it's your lab/PI/department. Don't let what they're telling you normalize the behavior. It'd be like someone in an abusive relationship saying that all relationships are toxic. No, no, no. There are good people out there. Missing family events for grad school is not normal. Being berated is not normal.  ", "author": "islandermine", "created": 1543158596, "upvotes": 81}, "eafn1lu": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafn1lu/", "text": "I really want to stress this.\n\nThe toxicity is not research culture.  It's departmental culture.  My current department actively promotes self-care, and we work hard not to shame anyone for needing to take mental health days.  \n\nI can't say the same for other departments I've seen...", "author": "bitparity", "created": 1543158289, "upvotes": 265}, "eafmyih": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafmyih/", "text": "This sounds more like your lab/research group is toxic. Not everyone operates like this. I don't know how far along you are, but there's always the option of switching advisors (or quitting entirely....no shame in that if you realize you aren't getting anything out of it). I've seen people switch even in years 3 and 4 and be much better off for it. Grad school is hard, but the life you describe should not be the \"expectation\".", "author": "azknight", "created": 1543158215, "upvotes": 174}, "eafms67": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafms67/", "text": "Many labs are like this but they aren't all. If you have the chance to change advisor/PI/whatever, do it.", "author": "iammaxhailme", "created": 1543158055, "upvotes": 17}, "eafmmch": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafmmch/", "text": "[deleted]", "author": null, "created": 1543157915, "upvotes": 384}, "eafmmb6": {"link": "/r/GradSchool/comments/a08z8x/research_culture_is_toxic/eafmmb6/", "text": "Sounds you're working in a toxic lab, just like I did back in the day. Sorry about that. What you have to keep in mind is that you're not the only person who's having a daunting experience in grad school and you always have the possibility to quit and get a job in industry which will give you a decent salary while offering you a better work/social life balance. \n\nI spent so much time working in grad school (evenings and weekends spent in the lab or testing in the field) that I gained weight, my body aged quite a bit and my social skills eroded. I declined so many invites that eventually, some friends stopped inviting me and basically wrote me off. I used to mark undergrad students' homework until 1 am on campus while being sometimes ignored sometimes scolded by my PI. One time, I got to the lab on a Friday morning and didn't leave campus until Sunday afternoon.", "author": null, "created": 1543157914, "upvotes": 22}}}