{
  "sid": "qhzr5g",
  "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/",
  "title:": "Is depression common in your first year of grad school?",
  "text": "Basically the title. I’m a first year PhD student. I’m a little over 3 months in and honestly I love it so far. My students actually seem to like my as a TA, I aced both my midterms (take that, imposter syndrome!) and I think I have a great chance of getting into my top choice lab (fingers crossed) \n\nBut lately, I’ve been having a hard time eating and getting out of bed. I feel like I’ve been dragging myself through the week just waiting for the weekend, and then when it is the weekend I spend it dreading the next week. I can’t pay attention and often just feel numb. Don’t worry, I’ve reached out to mental health services on campus and am going to try to find a therapist in the area. But I honestly feel like I’m losing it. Everything external is going well and I have more free time and am taking more care of myself than I did in undergrad. Yet I feel like crap. Is this normal during your first year? Or at least common…",
  "author": "castor2015",
  "created": 1635464955,
  "updated": 1635780484,
  "over_18": false,
  "upvotes": 29,
  "upvote_ratio": 0.95,
  "comments": {
    "hig5duy": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/hig5duy/",
      "text": "Dude abso-freakin-loutely! I’m chemistry too and let me tell you my first year sucked. I felt disconnected, alone and I just couldn’t handle the monotony anymore. Well after contemplating dropping out many times, I chose to stick it out and I gotta say grad school has become one of the best chapters of my life. Great friends, amazing advisor, dating life is solid, exciting research. Stick it out and do what you can now (work out, meditate, meet people) and things will fall into place",
      "author": "T-bewlee",
      "created": 1635465191,
      "upvotes": 20,
      "replies": {
        "hig5tgg": {
          "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/hig5tgg/",
          "text": "Yeah the monotony is killing me. That and the stress of lab joining. I’ve been talking to my first choice advisor since April and going to his group meetings remotely since then as well… but it turns out he’s only taking 3 people and 4 minimum are putting him as their top choice. Stressful as hell. \n\nThank you though. I’m glad to hear  it gets better.",
          "author": "castor2015",
          "created": 1635465397,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "higzm3y": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/higzm3y/",
      "text": "I have found that grad school can be very isolating. You may have moved to a new place, far away from loved ones. You’re in your program, seeing the same folks every day, spending lots of time in the department. You’re dedicating lots of time to your work. The power dynamic that grad students deal with can be stressful, even if everything is great with your advisor. There are just a lot of factors that can take a toll on your mental health. \n\nI’m glad you’ve reached out for some mental health support. Now is the time to work on this, not waiting for it to get worse. Definitely give yourself a big pat on the back for being proactive. \n\nAlso, I recommend aggressively scheduling time for things like hobbies and exercise. Schedule them like you schedule a class time. Make sure you’re fully disconnecting for a bit. Your brain needs the downtime! \n\nYou’re definitely not alone in your experience. You’re doing a great job working through it.",
      "author": "StringOfLights",
      "created": 1635479404,
      "upvotes": 10,
      "replies": {}
    },
    "higfvva": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/higfvva/",
      "text": "My first semester (Fall 2020) really took a toll on me, especially during the last 5 or so weeks. I think a good part of it was because it was fully online, on top of the stress of the election, the exploding covid cases in CA, and preliminary exams I needed to take shortly after the first semester. \n\nAfter taking and passing the prelims, things got better, despite having more work to do than the previous semster.  People in my department told me that the first year here is the hardest, and I think they're right. Now that I'm in my second year in person and almost fully invested in research, I've felt happier, and I've been getting along with my cohort way better. The end of the semester slog still gets to me, but I think that's just the nature of academia.\n\nI'm chalking up my first year struggles to adjusting to grad school and the extraordinary circumstances I had.",
      "author": "westscott6",
      "created": 1635470100,
      "upvotes": 6,
      "replies": {}
    },
    "higt74n": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/higt74n/",
      "text": "Lol its common in every year of grad school.",
      "author": "mas63520",
      "created": 1635476207,
      "upvotes": 5,
      "replies": {}
    },
    "hihez6v": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/hihez6v/",
      "text": "I think it could also be COVID making things worse. My first year was depressing even though I have a great advisor, friends, etc. I think it's just the loneliness + FOMO seeing my friends who got FT jobs instead of going to grad school living their lives.",
      "author": "phdreaming234",
      "created": 1635489671,
      "upvotes": 4,
      "replies": {}
    },
    "higvg3d": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/higvg3d/",
      "text": "Mine wasn't related to the first year (I'm year 3) but over the past year I noticed it getting worse.\n\nTraditional students are around the age for some mental challenges to present themselves or get worse (also pandemic). So I would suggest keeping track of when, what and how you feel. You might find triggers in doing certain activities, days of the week or month.\n\nIf you don't notice patterns or it is systemic/worsening I would suggest reaching out to your PCP. Talking can help but it might take some medication to have you feeling normal again. \n\nI never considered that how I used to feel was harder/worse than I needed to (because the onset over the last few years was so gradual). I'm not artificially happy all the time, but I'm more in control of myself and don't have those big dips that take so much out of you. Reading journal articles can still be a drag, but it no longer feels like absolute torture. \n\nIt sounds like you are reaching out for help, which is the first and often hardest step. Don't stop looking for help until you find what works for you. Best of luck in your health and academic journey!",
      "author": "johonnamarie",
      "created": 1635477330,
      "upvotes": 3,
      "replies": {}
    },
    "hii20ii": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/hii20ii/",
      "text": "I think it’s super common! A lot of my people in my program (cohort members and more advanced students) have talked about having mental health struggles in the first year. It’s just a huge, stressful adjustment, and that sense of competition you mentioned sounds really difficult too. Best wishes from an internet stranger - I hope everything goes well, that you’re able to find good support, and that things start looking up for you soon! I’ve struggled with some of the feelings you mentioned, and one thing that helped was not beating myself up for feeling them. I think I was making everything worse by internally criticizing myself for feeling bad (I hesitate to give other people’s brains extra words to use against themselves, but my thought process was like “why aren’t you incredibly happy?!? this is your dream program, are you just terrible at knowing what you want??”) Once it clicked for me that I don’t have to feel bad for feeling bad, I was able to start pulling myself up a bit - it didn’t fix everything and I’m still looking for external mental health support, but I’ve been able to pay more attention in class lately and feel less lousy about waking up in the morning.",
      "author": "imitationpeaches",
      "created": 1635508226,
      "upvotes": 3,
      "replies": {}
    },
    "hiiiikn": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/hiiiikn/",
      "text": ">But lately, I’ve been having a hard time eating and getting out of bed. \n\nTry to follow best practices for sleeping a regular schedule, make certain you're not skipping meals, and get some exercise everyday. Even if it's a half hour brisk walk.\n\nIt's so easy to fall into bad habits, which when all combined together can be deleterious for mental health.",
      "author": "raistlin65",
      "created": 1635516334,
      "upvotes": 3,
      "replies": {
        "hikqznz": {
          "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/hikqznz/",
          "text": "That’s the thing. I honestly workout more than anyone else in my cohort. I make sure I go to the gym at least 5 days a week for an hour and I’m training for a 10k. It just sucks because I’m doing everything “right” but still feel like crap.",
          "author": "castor2015",
          "created": 1635548754,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hii989s": {
      "link": "/r/GradSchool/comments/qhzr5g/is_depression_common_in_your_first_year_of_grad/hii989s/",
      "text": "I am in the exact same position as you also a chem PhD student also first year and semester. I am doing fine in almost all aspects yet I just cannot shake this kinda of feeling off being fed up and down. It's boredom of the same thing day in and day out I guess. Either feel free to message me if you want to vent to a another person in the same position your in.\n\nGood luck",
      "author": "Sentinel312",
      "created": 1635512117,
      "upvotes": 1,
      "replies": {}
    }
  }
}