{
  "sid": "qifx4p",
  "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/",
  "title:": "Ghosted by assigned academic advisor",
  "text": "Basically the title, I've sent this person 4-5 emails (copy pasting so I don't think the wording should have varied between emails) over the past 2 weeks asking to meet her so I can ask some questions about course registration. Attempts to go to office hours/ask other people have led to all of them kicking me downstream to this advisor and not answering the questions. \n\nCourse registration is happening at the crack of dawn on Monday so I'm probably just going to ask my classmates for advice later this afternoon. Normally if an email was ignored once I'd chalk it up to stuff  being buried but 4 times???",
  "author": "NoComfortable7128",
  "created": 1635522856,
  "updated": 1635780476,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hij42rf": {
      "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/hij42rf/",
      "text": "Are you a masters student or PhD student, and is this person a professor with a large research group?",
      "author": "Big_Faithlessness625",
      "created": 1635525006,
      "upvotes": 4,
      "replies": {
        "hijbh7y": {
          "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/hijbh7y/",
          "text": "Masters student and this person isn't a professor, she's an advisor/administrator in charge of course registration and doesn't teach classes",
          "author": "NoComfortable7128",
          "created": 1635527875,
          "upvotes": 2,
          "replies": {
            "hijtz1z": {
              "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/hijtz1z/",
              "text": "Yeah I would just complain to the school, if you're planning ahead of time enough they should be able to respect a 2 week timeline",
              "author": "Big_Faithlessness625",
              "created": 1635535120,
              "upvotes": 2,
              "replies": {}
            },
            "hikqtnf": {
              "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/hikqtnf/",
              "text": "This makes it worse...Like, that's her job. \n\nIf she was booked and couldn't meet with you, she should have just told you that. It's weird she ignored your emails. \n\nMy experience is that the first week or so tends to be somewhat in flux, so after you talk to classmates and do some of your own research, register for classes as best you can. Then if you have to drop one and enroll in another, it should be relatively smooth. I've had to do that a few times during my studies for one reason or another.",
              "author": "False-Guess",
              "created": 1635548679,
              "upvotes": 2,
              "replies": {
                "hinxm23": {
                  "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/hinxm23/",
                  "text": "Yeah, we get a 1 week grace period to change classes and it's also possible to send  Karen emails to the registrar threatening to graduate late if you really can't get a class you need (and we have a lot of mandatory courses, like recommended load per semester is 15 credits and 12 of those are for courses required for graduation). Hopefully it won't come to that.",
                  "author": "NoComfortable7128",
                  "created": 1635614266,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hij6w98": {
      "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/hij6w98/",
      "text": "I think it’s unlikely that the email was lost four times. Probably a good idea to register for classes that peers in a similar path are enrolling to on Monday just in case the classes fill up early.  I wonder if you could get a new academic advisor or maybe emailing them your updated course list could prompt a meeting with them?",
      "author": "chemdisco",
      "created": 1635526102,
      "upvotes": 1,
      "replies": {}
    },
    "hijn95v": {
      "link": "/r/GradSchool/comments/qifx4p/ghosted_by_assigned_academic_advisor/hijn95v/",
      "text": ">Course registration is happening at the crack of dawn on Monday so I'm probably just going to ask my classmates for advice later this afternoon.\n\nYou should also look through the course catalog and review the requirements for graduating with your degree. Don't depend on your classmates for making sure you get that right.",
      "author": "raistlin65",
      "created": 1635532435,
      "upvotes": 1,
      "replies": {}
    }
  }
}