{
  "sid": "qeuxhk",
  "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/",
  "title:": "Can I get into the MFA Graphic Design(Prelim) at Yale?",
  "text": "Hi guys! I am interested in the three year MFA Graphic Design program at Yale and wanted to know whether I have any chance of getting in. I talked to one of the graduate students of this program and I was told that this three year program is open to students who don't have a Bachelor's in the field.\nI am a CS graduate from India. \n\n8.6 CGPA (A+), 2nd rank in the whole University. \n97% (science stream) in higher secondary exams.\nIELTS: Overall 8 band. \nExtracurriculars: Was elected into the student union of our college as Magazine editor. I designed compiled and edited the whole magazine by myself. \nPrizes in cartooning, English poetry and story writing.  Was head girl during my high school days.\n\nVolunteer experience: Volunteer artist/graphic designer at three organizations.\n\nJob experience: One month as creative associate at a sustainability focused start up. \nI'm freelancing now.\n\n\nNow, my family is very poor so I cannot afford to pay the expensive tuition but I heard that Yale offers need based scholarships. Does that apply to art school too? Also, there's another hindrance I face. My Bachelor's degree was only three years long and I wonder if that would be a problem. \nPlease do help me guys, it would be much appreciated!",
  "author": "Hooded_enigma",
  "created": 1635090971,
  "updated": 1635185349,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hhvqcwl": {
      "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhvqcwl/",
      "text": "You can definitely get in, but the Master's program you're going for is a [cash cow degree](https://slate.com/business/2021/07/masters-degrees-debt-loans-worth-it.html).\n\nJust because it's Ivy League doesn't mean you're going to land a good enough salary to justify the enormous cost of your degree. You're essentially paying a fortune for bragging rights and little else.",
      "author": "66th_jedi",
      "created": 1635094880,
      "upvotes": 4,
      "replies": {
        "hhvrbme": {
          "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhvrbme/",
          "text": "Well. This sounds alarming. I wanted to pursue a Master's in a reputed institution in order to build connections, and to possibly find a job outside India. I know that skills matter a lot when it comes to fields like design, but idk, connections matter too don't they?",
          "author": "Hooded_enigma",
          "created": 1635095279,
          "upvotes": 2,
          "replies": {
            "hhw01uv": {
              "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhw01uv/",
              "text": "If you’ve got your heart set on an MFA, there are several fully-funded programs across the US at very reputable universities.",
              "author": "ScamIam",
              "created": 1635098785,
              "upvotes": 3,
              "replies": {
                "hhw16zq": {
                  "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhw16zq/",
                  "text": "Really? But, I don't think I'd be able to get any merit based scholarship. I liked Yale cuz of their need based scholarships.",
                  "author": "Hooded_enigma",
                  "created": 1635099231,
                  "upvotes": 1,
                  "replies": {
                    "hhw4j5d": {
                      "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhw4j5d/",
                      "text": "Funded programs aren’t merit scholarships. They pay your tuition and a living stipend in exchange for an assistantship, which could be teaching undergrads or helping professors.",
                      "author": "ScamIam",
                      "created": 1635100547,
                      "upvotes": 2,
                      "replies": {
                        "hhw58se": {
                          "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhw58se/",
                          "text": "That's a relief. But this brings me to my biggest issue. Universities in the USA typically don't accept 3 year undergraduate degrees right. I don't know what I can do about that.",
                          "author": "Hooded_enigma",
                          "created": 1635100822,
                          "upvotes": 1,
                          "replies": {
                            "hhwcj0z": {
                              "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhwcj0z/",
                              "text": "That’s not as big of a deal. They will likely make you send your transcripts to a credentials evaluator who will determine if your degree is on par with a “typical” US bachelors.",
                              "author": "ScamIam",
                              "created": 1635103763,
                              "upvotes": 2,
                              "replies": {
                                "hhwemkf": {
                                  "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhwemkf/",
                                  "text": "This gives me hope. Thankyou! Do you know where I can find a list of the institutions offering fully funded programs for BFA?",
                                  "author": "Hooded_enigma",
                                  "created": 1635104599,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhyfzqt": {
          "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhyfzqt/",
          "text": "Oof, I second this.\n\nMasters at Ivy-Leagues are brand name disguises that will lead you to financial suicide.\n\nThe “scholarships and aid” they offer covers up to 25%. Which isn’t much when they’re charging $70k per YEAR, and that’s not even including housing.\n\nUnless you’re rich, I’d stay far FAR away from these programs.",
          "author": "affennlight",
          "created": 1635142474,
          "upvotes": 2,
          "replies": {
            "hhyivxi": {
              "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhyivxi/",
              "text": "Right? I know too many people who've been sucked into these programs, only to come out claiming that the crushing debt was worth it because without an Ivy League education, they wouldn't be making (*insert ridiculously low salary here*) today. \n\nIt's always the insecure people chasing that sort of validation, too.",
              "author": "66th_jedi",
              "created": 1635144856,
              "upvotes": 1,
              "replies": {
                "hhyjllp": {
                  "link": "/r/GradSchool/comments/qeuxhk/can_i_get_into_the_mfa_graphic_designprelim_at/hhyjllp/",
                  "text": "As disgusting as they are, I don’t think they’ll be going anywhere anytime soon.\n\nThey’ll just keep milking it. Because why not? These college get their money either way.\n\nIt sucks, but they’re basically consolation prizes for people who didn’t get into elite undergrads.\n\nIt’s like: elite undergrads get a gold medal for free. Then these masters degrees are like paying $200k for a BRONZE.",
                  "author": "affennlight",
                  "created": 1635145434,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}