{
  "sid": "q8xq1n",
  "link": "/r/GradSchool/comments/q8xq1n/how_to_letters_of_rec_work_with_online/",
  "title:": "How to letters of rec. work with online applications?",
  "text": "I’m getting ready to ask for letters of recommendation but I’m not sure how the process works with online applications. Do I need to send the letter writer a list of the programs I’m applying to? Do they give me the letter and I then submit it myself? Is it something else entirely? I don’t want to ask for something that I don’t understand myself, so any help is appreciated!",
  "author": "Meellie",
  "created": 1634332642,
  "updated": 1634605032,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgsdk1x": {
      "link": "/r/GradSchool/comments/q8xq1n/how_to_letters_of_rec_work_with_online/hgsdk1x/",
      "text": "You usually upload the contact information of the person whom you asked beforehand for a letter of recommendation. The system will proceed to provide the contact with the information regarding how to upload/send the letter.",
      "author": "Tau_Forest_Dreams",
      "created": 1634332853,
      "upvotes": 2,
      "replies": {
        "hgshxvh": {
          "link": "/r/GradSchool/comments/q8xq1n/how_to_letters_of_rec_work_with_online/hgshxvh/",
          "text": "Ah, that makes sense! Thank you, it didn't seem fair to ask for letters when I wasn't even sure how the process worked myself. I appreciate your help!",
          "author": "Meellie",
          "created": 1634334895,
          "upvotes": 1,
          "replies": {
            "hguzqs0": {
              "link": "/r/GradSchool/comments/q8xq1n/how_to_letters_of_rec_work_with_online/hguzqs0/",
              "text": "Generally, if a program requires you to upload the letters yourself, they will say so (mine did). I made sure I had that information when I asked for letters, so I could make sure the person knew whether or not I would be seeing the letter.",
              "author": "starryeyesmaia",
              "created": 1634392627,
              "upvotes": 2,
              "replies": {
                "hgxz1pa": {
                  "link": "/r/GradSchool/comments/q8xq1n/how_to_letters_of_rec_work_with_online/hgxz1pa/",
                  "text": "None of the programs I'm looking at mentioned that but I'll double check before asking! Thanks for letting me know!",
                  "author": "Meellie",
                  "created": 1634441936,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}