{
  "sid": "q0r6hu",
  "link": "/r/GradSchool/comments/q0r6hu/how_bad_is_it_to_withdrawal_from_a_class/",
  "title:": "How bad is it to withdrawal from a class?",
  "text": "I signed up for an advanced level mapping/statistics course and feel like I'm in over my head. With the amount of time I need to spent on research field work this semester I'm not sure I can study enough to do very well in the course (like maybe a C) . Would withdrawing look too bad on my transcript to be worth it?",
  "author": "bandanna77",
  "created": 1633296345,
  "updated": 1634099957,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.76,
  "comments": {
    "hf9zywn": {
      "link": "/r/GradSchool/comments/q0r6hu/how_bad_is_it_to_withdrawal_from_a_class/hf9zywn/",
      "text": "If you can properly justify the withdrawal, then no problem. Lack of time because of extra duties would be a good enough reason to me but you would need to make sure that you really did not have time. If you are easily overwhelmed with simple tasks, then that would not be a good reason to me and a proper red flag.",
      "author": "ko_nuts",
      "created": 1633297501,
      "upvotes": 3,
      "replies": {}
    },
    "hfaa78l": {
      "link": "/r/GradSchool/comments/q0r6hu/how_bad_is_it_to_withdrawal_from_a_class/hfaa78l/",
      "text": "It might depend slightly whether your are in a masters or PhD/doctoral program. \n\nFor what it’s worth, I withdrew from a class during my PhD (as the material was far less in-depth than my own research in the same area). I had no issues with my department, committee, etc for doing that. Usually for a terminal degree, your transcripts don’t matter as much, provided you’re doing well and in good academic standing.",
      "author": "BiologyPhDHopeful",
      "created": 1633301990,
      "upvotes": 3,
      "replies": {
        "hfadtoh": {
          "link": "/r/GradSchool/comments/q0r6hu/how_bad_is_it_to_withdrawal_from_a_class/hfadtoh/",
          "text": "I am an MS student!",
          "author": "bandanna77",
          "created": 1633303690,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}