{"sid": "i6y1dc", "link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/", "title:": "Anyone feels that isolation is affecting their motivation?", "text": "I am close to the mid-way point of my phD and I feel very socially isolated. The COVID crisis makes it worse because I can't visit my friends who are at the other end of the country from me. Frankly speaking, Zoom meetings are okay for work, but is completely awkward for purely social gatherings. Also, if you wanna bitch about people, Zoom is not exactly the most secure way of doing so.\n\nFor this summer, I was maybe 70% productive and I did get some work done. But as the summer concludes, I am struggling to work even the minimal amount of work that a phD student has to accomplish as a research assistant. \n\nBecause my work can be performed entirely remotely, using COVID as a excuse doesn't work for me.\n\nI do have hobbies like exercising, reading books and video games etc... But I am capping my hours spent on my hobbies - I can easily get obsessed with my hobbies and spend the entire week not working. \n\nI tried tele-therapy for a month or so but my therapist seem to spent the minimal effort on me by simply lending a ear for my rants. She did not prepare the more standard clinical psychology techniques on me so I stopped it as I feel like it wasn't helping much.\n\nNGL, I do have some psychological issues even before COVID. But my 'lows' in productivity now can reach a whole new level, and sometimes I spend almost the entire week accomplishing nothing.", "author": null, "created": 1597033026, "retrieved": 1632953857, "over_18": false, "upvotes": 404, "upvote_ratio": 0.99, "comments": {"g11qvdh": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g11qvdh/", "text": "It doesn't affect me as much now, I've just resorted to doing what I need to do then rewarding myself with a hobby.  I also take an hour in the morning doing things that inspire me and reminds me of what I'm doing this for.  I try not to get everything done in one sitting because I will not have enough motivation for that lol. But I will get small parts done throughout the day.", "author": "lifealumni", "created": 1597103074, "upvotes": 1}, "g11llme": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g11llme/", "text": "100% I was incredibly productive the late 2019 and the first 3 months of 2020. Since then it has been difficult to do anything.", "author": "NecessaryCobbler3", "created": 1597100254, "upvotes": 1}, "g11lca0": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g11lca0/", "text": "I don’t wanna come in with a bunch of fixes without saying first, that sucks dude :( I’m sorry that’s happening and I definitely hope it gets better!\n\nMyself, I’ve been gaming with friends online instead of alone (like a friend hosts a terraria server). It might also be good (if your funding allows) to think about going home or somewhere else, honestly; staying in an apartment alone for months is definitely fucked up tbh, cuz people aren’t meant to do that :/", "author": "realFoobanana", "created": 1597100118, "upvotes": 2}, "g11ev33": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g11ev33/", "text": "This is like almost exactly me. I wish I had more advice except to stick with it and just do your best.", "author": "queennbee", "created": 1597096848, "upvotes": 1}, "g11b68b": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g11b68b/", "text": "Absolutely, I was loving the whole MSc experience until COVID struck. \n\nNow I just feel anxious about finishing and can't wait to move on.", "author": "Superhuzza", "created": 1597095043, "upvotes": 1}, "g118mz9": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g118mz9/", "text": "I’m in this boat too. I’m about to wrap up my first year and my qualifying exam is in 2 weeks. It was supposed to be in May, but due to everything, it’s been pushed back so there’s been a huge lag time between my last core class and the exam. This has been a huge issue because I’ve forgotten so much of my course material and have zero motivation to study. My project has also stalled for the past 4 weeks due to my lack of productivity. I miss the social interaction of going into the office everyday. I’m thinking about seeing a therapist about my problems and also planning to take a week long vacation to reset myself after my qualifier is over.", "author": "IndoorCloud25", "created": 1597093820, "upvotes": 1}, "g114ord": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g114ord/", "text": "Definitely. I'm taking a gap year because I'm completely screwed mentally. I didn't write anything for my thesis so far and I was supposed to be done in May.", "author": "Lady_of_Ironrath", "created": 1597091927, "upvotes": 2}, "g10mdq0": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g10mdq0/", "text": "I am having exactly the same issue. I have had a few weeks with near zero accomplishment.", "author": "Gucci_Brain", "created": 1597083103, "upvotes": 3}, "g10m0zy": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g10m0zy/", "text": "Oof same. And because I can do my work remotely, I'm expected to stay home indefinitely. Which like I get for public health but my productivity is dying when I need to be doing more than ever and it's depressing", "author": "tonightbeyoncerides", "created": 1597082933, "upvotes": 1}, "g10lc4n": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g10lc4n/", "text": "Tough to keep up with labmates both socially and productively when barely seeing them face-to-face", "author": "jburkek", "created": 1597082596, "upvotes": 1}, "g10c1bx": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g10c1bx/", "text": "Having a group of other folks doing their thesis was so helpful for me", "author": "poiseandnerve", "created": 1597078131, "upvotes": 1}, "g102zev": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g102zev/", "text": "My university writing center has been doing Zoom writing group, where once or twice a week we check in, say what we want to get done today, then just sit with our webcams on and write for a few hours before checking in again at the end. \n\nTwo of my cohort couldn't make that writing group so we just set a time to meet on Zoom and do the same thing-- talk about what we did or plan to do, then sit with the webcams on and work for a while.\n\nIt might not work for everyone but it's helped me be accountable and feel more like I have some community that is in the same situation (as opposed to chatting with friends who have \"normal\" jobs).", "author": "carlaacat", "created": 1597073632, "upvotes": 7}, "g0zngqu": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0zngqu/", "text": "Hey man, you are not alone in this as am going into my third year and find it harder and harder to work. My hobbies have taken up nearly all my time ( decided to build a server during quarantine to host many of the apps I use daily, shout out to r/selfhosted )and I am trying to devote more time to work. Some days I question if I have lost the passion for the work/field I am in, or its simply that since my routine was disrupted and in social isolation for so long.", "author": "Sir_Chilliam", "created": 1597064903, "upvotes": 3}, "g0zlpj4": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0zlpj4/", "text": "You definitely need therapy. Keep changing therapists until you get a good match but don't stop altogether.", "author": "simorgh12", "created": 1597063691, "upvotes": 3}, "g0zl24z": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0zl24z/", "text": "You're not alone, so many of us are feeling the same way. I am starting my fifth year and I was hoping to finish by May of 2021 but that is no longer possible due to COVID.  I am also back in my research lab (returned mid June after three months at home) and I am still struggling to be productive.  I have my own lab and office currently since I am the only grad student in my group but the inability to just go chat with my fellow grad students, see friends and family, and other simple things like having a real date night with my husband without one of us having to cook is taking a toll.  I was the most unproductive I've ever been in grad school while home so I do not envy those still stuck in that situation.\n\nWe will get through this though, I just keep reminding myself how fortunate I actually am, my my family, friends and I are healthy, my husband and I have paychecks and I will finish even if its a bit later than I wanted.", "author": "PaperPhD", "created": 1597063228, "upvotes": 6}, "g0zdo88": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0zdo88/", "text": "It’s tough for sure. Things that would take me one day at uni would take me 3 days from home. That on top of internet and laptop struggles made for a pretty miserable few months as far as research goes. Unfortunately, some faculties still expect the same level of output when working from home as when you’re in the department. You also lack that collaborative environment and drive you get from being around your colleagues.\n\nOne thing I really missed doing (which I didn’t expect to miss) was the commute to and from campus. A half hour train ride does more for me mentally than I would’ve expected. I loved having that chill time to catch up on what’s happening in the world after a long day and it did wonders when I’d have to spend the night working as well.", "author": "mel5159", "created": 1597057011, "upvotes": 18}, "g0z6oi4": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0z6oi4/", "text": "At first, I felt myself less motivated and felt like there was nothing that interested me at all. I didn't see the point in anything at all. However, I decided that it was time to take care about my mental health since being isolated affected me much. That is why I decided to practice yoga and meditation and I should say it helped a lot. I look at the situation from the different perspective now, I am more concentrated and more motivated. It really helps. Try it as well and I am sure it will help you during these severe times of pandemic", "author": "Kate_is_", "created": 1597049794, "upvotes": 5}, "g0z5q5m": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0z5q5m/", "text": "I totally relate to everything you said.. I'm just getting started with research and doing everything alone and remotely is tough.\nI try to stay positive and remind myself how lucky I am to have something to do right now as many of my friends who graduated and didn't go to grad school are struggling to get jobs etc..", "author": "ML_girl", "created": 1597048785, "upvotes": 2}, "g0z4ccz": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0z4ccz/", "text": "I absolutely feel this. I'm a master's student and didn't get any writing done on my thesis this summer. my advisor tried asking me why and all I could say was that things have been hard and I've lost my direction. school starts in a few days and now that I'll have routine I'll get back to work! and I know it will be ok!\n\nwe can do this. we've done hard things before. we can do it again.", "author": "itbehayley", "created": 1597047320, "upvotes": 11}, "g0z2mi4": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0z2mi4/", "text": "I have daily anxiety because of my lack of productivity and progress on my dissertation the past several months.", "author": "New_Hawaialawan", "created": 1597045503, "upvotes": 126}, "g0z2b4c": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0z2b4c/", "text": "So right before quarantine I burned out hard from getting a publication. The first month or two I was ok. As a computational chemist, I like you was not technically affected by having to work from home, but I came to realize this was a total lie. By month 3, (May) I was totally shot. I was probably only working 10-15 hours a week honestly. That may not be totally accurate but I lost track. \n\nThen I lost my father in June. I’ve been in quarantine since and haven't worked once in the last 3 months. Therapy has helped but I can tell you that you aren’t alone in feeling this way. Quarantine has amplified every feeling, distraction, emotion, etc.... and for people who thrive in structured environments I think it has taken a heavy toll. I learned a lot about myself in these last few months, especially my work habits. My advisors don’t really give a damn but that’s besides the point.\n\n\nI’ve started to find my work ethic again slowly. A few hours here and there when I can. When the depression isn’t what dictates my life. I can only suggest trying to find structure again. If you spend 5 hours a week working, embrace it. Dont feel shame. And if you can, set a goal for 10 or 20 the next week. And if you can’t, don’t punish yourself for it either. \n\nMany people struggle to work from home. Especially when your a poor grad student living in a small ass apartment. But our homes are where we build our lives. Our homes are where we go to escape work, relax, unwind, and take a moment away from the stress of grad school. It was always going to be incredibly difficult for me (and maybe you and others) to suddenly try to be 80hrs/week productive in our home environment. I maintain any advisor who thinks it was possible is out of their mind.\n\nI can only tell you to keep pushing on, and really remember the situation we are in. If you’re like me, structure is key. And if you can build structure slowly, piece by piece, it may help. Just remember to take it slow and everything will come, one way or another, one day or another. \n\nBest of luck to you.\n\n*Edit: Just a note about therapy. I too entered therapy on a weekly basis when my father first fell sick. I think I had the same reaction as you did. That all I did was talk and all they did was listen. It sucked because I was angry and wanted answers (like most grad students, I think we want to live in a world of absolutes). I dont know when it clicked but eventually I realized what my therapists role was. A bad therapist either 1.) just listens and nods along and offers platitudes, or 2.) tries to give advice to every problem you have. I think personally, a good therapist offers perspective. They give perspective to your emotions, thoughts, reactions, problems, whatever, because it is ultimately up to you to arrive at a place that allows you to feel better. And better doesn't always mean happy. Ultimately there is no correct advice for ones problems, but perspective in how I deal with and approach my problems and who I am has helped me greatly by allowing me to come to my own conclusions. Finding a good therapist is critical, but understanding their true role in your health is just as important. **THIS IS ALL MY OWN, PERSONAL OPINION THOUGH...**", "author": "IrishAmericanWhiskey", "created": 1597045165, "upvotes": 22}, "g0z1lil": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0z1lil/", "text": "I’ve been through a lot of crappy therapists in the past. Don’t give up! Try and find one that will treat you better if you can. I’m seeing one in person currently, and I feel like that makes a difference too. He’s tested every week for Covid, and checks my temperature at the door. \n\nI feel like I’ve been way less than 70% productive though. I was talking to my fellow grad friend about it, and we agreed that it’s in large part because there’s no reward system, really, with social distancing. If you’re doing it right, you can’t hit the bars and blow off steam after finishing a large project, for example, like we would normally. Instead it’s just more of the same. \n\nI hope your teachers take it easy on you this fall. I hope mine do too. I plan to go as easy as I can on my own students.", "author": "lala__", "created": 1597044425, "upvotes": 6}, "g0yzj7c": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0yzj7c/", "text": "I think that the change in structure for daily routine is what's impacted a lot of people's productivity. Personally, I was in an all-online program before covid so while it didn't impact school, switching from working in an office to working at home with reduced hours to job searching, wanting to keep up with coursework has slacked.\n\nIt's too bad that your therapist seemed distant in your sessions, but maybe you can talk to someone else in their office or find a new way to interact with your friends digitally. And this might be a dumb suggestion but you could always incentivize your hobbies as rewards for getting work done - like reading a chapter for each big task you complete.", "author": "PeachRing23", "created": 1597042400, "upvotes": 28}, "g0ys34z": {"link": "/r/GradSchool/comments/i6y1dc/anyone_feels_that_isolation_is_affecting_their/g0ys34z/", "text": ">Also, if you wanna bitch about people, Zoom is not exactly the most secure way of doing so.\n\nSounds like your head is in a pretty toxic state right now. Maybe commit more to therapy and try to not rant / \"bitch about other people\" to them and figure out what it is that is causing you problems.", "author": "wretched_beasties", "created": 1597035924, "upvotes": -25}}}