{"sid": "mksrsc", "link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/", "title:": "Is Grad School Supposed to Be Traumatic?", "text": "Genuine question to everyone. My graduate program offers almost no mentoring support and without a ton of searching, it's almost impossible to figure out what the graduation requirements are.\n\nOn top of all this, we've had multiple faculty members \"disappear\" from the program due to misconduct and get put on administrative leave. Other graduate students have committed actual crimes against each other like assault or stalking and the rest of us were case witnesses to these things and had to help report to the police to make it stop.\n\nJust the work would've been hard enough but I feel that my program environment is unreconcilably dangerous at this point.\n\nHas anyone else been utterly traumatized by grad school? How do you escape the toxicity?\n\nEdit: Thank you all for the perspective. I've been in this environment for so long that I thought I was weak for asking about this. I'm post-proposal ABD so I've decided to just push through and graduate ASAP and then never talk to anyone from here again. \n\nEdit 2: I'm also going to warn any prospectives who will talk to me to avoid. It's the least I can do.", "author": "Content_Bowl", "created": 1617651007, "retrieved": 1632953920, "over_18": false, "upvotes": 370, "upvote_ratio": 0.97, "comments": {"gtptcug": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtptcug/", "text": "You're not going to change the system, see if you can transfer or find a way out sooner rather than later.", "author": "PeaceAndPrajna", "created": 1617819878, "upvotes": 1}, "gtn2vsx": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtn2vsx/", "text": "No, grad school should absolutely not be this traumatic. My grad program was fantastic and I feel like I won the lottery sometimes. \n\nEveryone was EXTREMELY supportive (students and faculty alike). I never felt scared asking for help. All professors make themselves readily available to grad students. My advisor scheduled weekly meetings for us to chat. There was no micromanaging which was great, but faculty were more than willing to help you whenever you needed it. There was also no hounding committee members to review your paper. You give them a deadline (usually 2 weeks) and they all get back to you within that deadline with great comments. \n\nMental health was recognized as being very important. My advisor strongly recommended I work Monday to Friday from 9-5 and that's it. She also recommended I take about 3 weeks of vacation per year. This is what most grad students did from my experiences (the ones that worked in a lab had a bit longer schedules, but most of us didn't work in a lab). \n\nThere were also great opportunities to present at national and international conferences. I had the pleasure of presenting at an international conference. \n\nThe environment wasn't toxic at all. And I really wish all grad programs were like that. The cut-throat attitude is insane.", "author": "Gryffindor1994", "created": 1617759829, "upvotes": 1}, "gtm55xs": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtm55xs/", "text": "No, it is not supposed to be traumatic, but it can be. \n\nI got a full time gig that paid for the rest of my degree so I ditched my funding. I was told I would never finish, but I did. \n\nThat's not possible in all programs (and I got a full time job at a college, so I was still in academia which helped) but if you can't transfer finding a way out of being around the people is lovely.", "author": "phoenix-corn", "created": 1617743010, "upvotes": 1}, "gtkae9d": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtkae9d/", "text": "[deleted]", "author": null, "created": 1617713020, "upvotes": 1}, "gtjumnc": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtjumnc/", "text": ">My graduate program offers almost no mentoring support and without a ton of searching, it's almost impossible to figure out what the graduation requirements are.\n\n\nNormal. Although that's been my experience in the UK not the US; I had loads of handholding with my undergrad honors thesis in the US, pretty much no support with postgrad in the UK. \n\n\n\n>Other graduate students have committed actual crimes against each other like assault or stalking \n\n\n\nNot totally abnormal at any school. I know a guy who was recently expelled for sexual assault (he had a big reputation before someone finally put an end to it--I knew of him from multiple women before I ever met him). \n\n\n>Faculty members \"disappear\" from the program due to misconduct and get put on administrative leave\n\n\nFucking what?? Sabbatical or unplanned leave for personal reasons is totally normal, or occasionally being let go for utter incompetence, THAT is not.", "author": "Gr8panjandrum", "created": 1617700804, "upvotes": 1}, "gtjl5lg": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtjl5lg/", "text": "I wanna say no it's not supposed to be, but it frequently is.", "author": "Naxek", "created": 1617691354, "upvotes": 2}, "gtja4rh": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtja4rh/", "text": "I hate it right now. I’m in a accelerated masters in psych. I enjoy my concentration. But the fact that it’s school and being graded is depressing to me. I’m having such a hard time in regards to motivation. I have two weeks left of classes this semester and four final big projects. I’m terrified of them. I’m worried and don’t want to do it. I’ve been putting it all to the side. Worst of all I got injured healed up then re injured even worse in MMA. And the pain won’t let me concentrate. My birthday was recent and I didn’t even enjoy it that much. I didn’t care.\n\nI’m fighting the urge to drop it all. I’ve spent $9000 so far. I don’t want that to go to the drain. I want to cry I want to disappear. It’s the worst feeling ever. I’m going to take a 1 month break from sports. I’ve been stress eating and I’m gaining weight lmao. This experience so far has encouraged me not to go for my PhD. I don’t care how much money I make in life. Nothing is worth going through this again. I’m going to try and finish. I wish you luck my friend.", "author": "Busted2002", "created": 1617682607, "upvotes": 1}, "gtj50t1": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtj50t1/", "text": "Yes. The answer might surprise you, becuz big yes.", "author": "Thecatofirvine", "created": 1617679475, "upvotes": 2}, "gtj2e8c": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtj2e8c/", "text": "Y I K E S. My program definitely lied about offering a lot of their courses (i.e. 80% of your \"classes\" have to be arranged as an independent study), plus when I arrived the guidance for how to form a committee and how to pass your comps was \"email people with similar interests and ask if they want to join your committee, then just ask your committee when you're ready to hold comps and make sure you do it by X number of years.\" Also, you have to reapply for half-funding every year and it may or may not come with medical insurance depending on if they feel like giving you a TA half-line or an adjunct half-line. ETA also my program has literally no \\*actual\\* faculty members and everyone just teaches classes in the program but works for different depts.  \n\n\nSo my program is pretty shitty in a lot of ways, but your situation sounds even worse and concerning in terms of physical safety as well as mental health. As others have said, if you talk to an ombudsman they hold everything you say in strict confidentiality and even if they can't help they know whom to contact so you can get help...Also, keep a record of any and every email exchanged with your dept about these issues, with the police, etc. so that you have evidence in case it's needed to submit to, say, an ombudsman, union, etc.", "author": "CarrotGratin", "created": 1617678015, "upvotes": 3}, "gtj20kt": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtj20kt/", "text": "This is actually my area of research. We should be building less toxic educational systems. But in the meantime -- if you can't or would rather not choose to transfer programs, which I would strongly encourage -- find yourself a support system. There have got to be some people in your program (or even a related program) who aren't toxic, build a relationship with them. Counseling would also be something to think about. And all the other self-care tools that we all hear about. But build a social support system asap.", "author": null, "created": 1617677809, "upvotes": 2}, "gtipf1g": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtipf1g/", "text": "That’s way too crazy. My entire grad experience can be summarized as staring at zoom and wondering why professors won’t explain how to do their assignments.", "author": "Dustin_Bromain", "created": 1617671196, "upvotes": 6}, "gtioj4q": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtioj4q/", "text": "Already been utterly traumatized multiple times and I've only been here since September.  It's gonna be a LONG 5-7 years...", "author": "LadyWolfshadow", "created": 1617670729, "upvotes": 3}, "gtim80e": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtim80e/", "text": "To start, no.\n\nWhile some people's experience unfortunately is traumatic, too many in fact, this is different than anything I've heard of. It doesn't sound like success is likely in this situation for you, so I would evaluate whether it's worth staying.", "author": "0102030405", "created": 1617669563, "upvotes": 2}, "gtilzq3": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtilzq3/", "text": "Im split on this answer. Because the stalking thing sounds terrible, but a lot of the other stuff is par for the course. It's not \"supposed to be\" but in a lot of cases it IS.  Traumatic grad school experienced is like a bell curve, and you may be the 85th+ percentile, but the mean is still pretty shit.", "author": "fiftycamelsworth", "created": 1617669447, "upvotes": 7}, "gtilgcd": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtilgcd/", "text": "It’s supposed to be challenging, not traumatic. \n\nAnd this means intellectually challenged. Overcoming obstacles and working through problems is what makes your time there worth a PhD. \n\nThe people that are intentionally “hard” on students, whether they’re bosses or colleagues, should be reported and removed without a second chance. This is hard enough without having to deal with sabotage. One of the main problems of academia, in my opinion, is survivor’s biais. People who think because they hard a hard time in grad school and they “made it”, all grad students must also have a hard time. We all have to fight against that culture.", "author": "pascalerc", "created": 1617669193, "upvotes": 6}, "gtil8i3": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtil8i3/", "text": "That sounds like theres something wrong with the school. Grad school can be mentally exhausting for everyone but what y'all have sounds more like there's a problem at the core that isn't being taken care of. \n\nAlso not being able to figure out what is needed for you to graduate...is that really not included in the department handbook for graduate students?? Could you illuminate on some other things going on here? (If you're comfortable with it). Just really curious what you're studying thats making everyone either leave or start attacking each other.", "author": "thelaughingmansghost", "created": 1617669084, "upvotes": 5}, "gtik4u0": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtik4u0/", "text": "I've had many PI tell me it's supposed to be traumatic. \n\nWhile we may not like it, the facts on the ground indicate that many senior level individuals would agree with OPs statement.", "author": "lednakashim", "created": 1617668521, "upvotes": 3}, "gtiinoi": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtiinoi/", "text": "It can get bad, sure, but I don't think I've ever see or heard of it getting that bad.", "author": "Do_Not_Go_In_There", "created": 1617667761, "upvotes": 3}, "gtii0uc": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtii0uc/", "text": "First of all, is this in the United States?", "author": "ggplot6", "created": 1617667450, "upvotes": 4}, "gtih6hs": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtih6hs/", "text": "Sounds about normal, I was told enjoy the process.\n\nEdit: Being facetious on the internet sometimes goes wrong.", "author": "MESElectronics", "created": 1617667005, "upvotes": -1}, "gtih5dc": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtih5dc/", "text": "Yes. You have to get hazed like everyone else...", "author": "Onyxsarah", "created": 1617666989, "upvotes": -15}, "gti7tf8": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gti7tf8/", "text": "This is not normal, although I'm sad to say that my program has traumatized me too. Go to the ombudsman on campus asap.", "author": "make_cake_", "created": 1617662213, "upvotes": 7}, "gti5h05": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gti5h05/", "text": "It sounds like you're in a scam school.", "author": null, "created": 1617661038, "upvotes": 8}, "gti2dp2": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gti2dp2/", "text": "Sounds like an extremely and unusually bad environment. That said, in my capacity as union organizer/steward in a highly-regarded department, I have heard stories similar to what you've described that are not widely known, but that would absolutely rock the department (even the field) in a similar way. I think that while some departments have relatively healthy environments (the environment where I did my master's was much healthier), any organization that relies on extremely strict hierarchy (ie most grad programs) will inevitably be rife with at least some abuse of power. Especially in venues where the perceived stakes of every interaction with superiors are very high.", "author": "Argikeraunos", "created": 1617659513, "upvotes": 10}, "gti0jav": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gti0jav/", "text": "Dude no wtf, it is nowhere near as bad in my place. Some pressure, sure. But assault and stalking is not normal at all. Not by a long shot.", "author": "sight19", "created": 1617658629, "upvotes": 89}, "gthvoek": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gthvoek/", "text": "No, that absolutely isn't normal and grad school isn't supposed to be traumatic.\n\nSome parts of it are tough. We're all adults here and we're capable of figuring out what needs to be done ourselves, so no one should expect all information to be handed to them on a silver platter, but it shouldn't be *too* hard to find your graduation requirements. I'd expect it to take me ~30-60 minutes of searching through my university's ordinances, which is significantly less time than it takes to figure out rental laws or tax codes. \n\nIt's normal for any department or place of employment to have a few assholes, and maybe you'd be unlucky enough to have a major asshole who commits something as serious as assault, but if the majority of the people around you are terrible then that's not normal. With that many bad apples I wouldn't trust their judgement in admitting students. They might be admitting bad/incompetent students because they are also bad/incompetent. So not only do you want to leave because the place is toxic, but you also want to leave because it won't reflect well on you to carry this reputation with you.  Your department is likely already well-known to be terrible within your field.", "author": "officially_anxious", "created": 1617656335, "upvotes": 24}, "gtho84w": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gtho84w/", "text": "That's def worst than the \"usual\" toxic behaviours in academia and mess of administration. This sounds like a tv show caricature of a bad department with drama to keep the views up, I'm so sorry you are actually living this.\n\nNo idea where you are but maybe looking for a transfer somewhere safer and better would be a good idea at this point. I know it can make your studies longer but you probably don't want to be associated with this type of culture and network for your career after the phd...\n\n\\-You could have to search for the graduation policies if they are not sent or accessible online easily and have a supervisor who helps you in this too\n\n\\-faculty members can get sick or overworked but it's not supposed to be an epidemic/ not come back\n\n\\-graduate students assault when the school does nothing, well I think you can guess this is absolutely NOT normal (well more or less depending on the country you live in sadly...)\n\nThe \"usual toxic stuff\":\n\n\\-feeling like you have to do more and more and more work to keep up / imposter syndrome\n\n\\-feeling in competition and stressing about this for future careers (more or less depending on the departmental/ lab culture\n\n\\-having issues managing your time with all the work, side projects and conferences, etc.\n\n\\-cash worries\n\n\\-feeling like you have to perform no matter what and think you'll leave your health there", "author": "579red", "created": 1617652930, "upvotes": 37}, "gthmiuy": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gthmiuy/", "text": "That's a little worse than normal, I'd say. I've had to be a witness to a sexual harassment/assault case, and I definitely got moderately traumatized in some classes, but yeah, it sounds like the Riverdale version of grad school lmao. I'm so sorry.", "author": "doingthebergamost", "created": 1617652165, "upvotes": 71}, "gthlj7p": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gthlj7p/", "text": "yikes. Some of that rings true, i.e. being dumped into the deep end but your situation seems much worse than the average. Is there some graduate professional student association, a grad union? I've also had good luck reaching out to the omsbud.", "author": "OmicronCeti", "created": 1617651712, "upvotes": 152}, "gthkhp2": {"link": "/r/GradSchool/comments/mksrsc/is_grad_school_supposed_to_be_traumatic/gthkhp2/", "text": "Are you sure you’re in a graduate program and not an authoritarian regime? Because this sounds like East Germany", "author": null, "created": 1617651232, "upvotes": 129}}}