{
  "sid": "qkwgrw",
  "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/",
  "title:": "Is intelligence a required trait to get a PH.D.?",
  "text": "I know you guys get a million posts a day about grad students not feeling smart enough, and subsequently suffering from serious Imposter Syndrome. Most of the time, the conclusion of these posts is \"You're smart enough, it's okay to feel dumb.\" What about people who are actually dumb? Is it possible to go through grad school through pure force of will, or is some amount of intelligence a prerequisite?\n\nSome background info on me, I'm a pretty unintelligent student. It takes me around 4 hours of studying to get a 91 on a test while the majority who don't study get a >95. I'm not very insecure about this though, since I've been able to get through my academic career via an abnormal dedication of time. Is this something I can keep up in grad school, or do you need to be naturally \"quick\" to have a hope of surviving it? Thanks for your time guys.",
  "author": "brainfrog32",
  "created": 1635827733,
  "updated": 1635891357,
  "over_18": false,
  "upvotes": 152,
  "upvote_ratio": 0.89,
  "comments": {
    "hiz9pp7": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hiz9pp7/",
      "text": "It's not about content memorization but knowledge production.  Can you write in a well organized and coherent manner? Can you take existing ideas and synthesize them into something new? Can you make persuasive arguments to defend your ideas and your work?  These are the skills that PhDs need, not being able to memorize a text book (which is kind of what you have to do in the 1st half of Med School and Law School)",
      "author": "ExternalSeat",
      "created": 1635831032,
      "upvotes": 219,
      "replies": {
        "hj1cwg5": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1cwg5/",
          "text": "Yeah also an underrated quality I’ve learned is “marketing”. It’s not enough to have good ideas, you gotta sell them to people. Make everyone think you have a really exciting project",
          "author": "lurkergroove2",
          "created": 1635875172,
          "upvotes": 21,
          "replies": {}
        },
        "hj0ef57": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0ef57/",
          "text": "Not only that you have to be very social. You have to be able to make sense, you have to cut through the politics of a department, and survive a hazing in your defense.",
          "author": "suckuma",
          "created": 1635860919,
          "upvotes": 27,
          "replies": {
            "hj1qd4p": {
              "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1qd4p/",
              "text": "I wouldn't say it's a matter of being social. I'm a hugely asocial person (autistic), but I can still give good presentations, and write nice proposals, and deal with all the politics because it's all just *acting*. You just have to be able to put up a persona and maintain it. Even if you are actively asocial, have terrible anxiety, and/or have a literal social communication disability like me, you can learn to pretend. Those people who seem to make such persuasive, energetic shows are just acting.",
              "author": "officially_anxious",
              "created": 1635880392,
              "upvotes": 12,
              "replies": {
                "hj2cqop": {
                  "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj2cqop/",
                  "text": "I got diagnosed with ADD because I was having so much trouble writing my thesis. Talking to my Psychiatrist has been the best thing ever.",
                  "author": "suckuma",
                  "created": 1635888970,
                  "upvotes": 2,
                  "replies": {}
                },
                "hj285cw": {
                  "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj285cw/",
                  "text": "autistic huh",
                  "author": "drkestxelmo2",
                  "created": 1635887205,
                  "upvotes": -5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiz6jw2": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hiz6jw2/",
      "text": "Nah, it is actually better to be consistent than smart. The process for research is actually very repetitive and \"boring\" most of the time, with a few moments where you find the hassle worth it. \n\n\nBeing smart might help you work in an efficient manner from the get go, but this is nothing your advisor cannot help you with. \n\n\nOnce you have results, most of the time you will be cross checked anyway, so even if you make data interpretation mistakes you will be corrected and prompted to try again. I believe anyone who gets into a PhD is already \"smart enough\" to finish it, and people who fail have other reasons, usually time management. If you are consistent, you should have no trouble.",
      "author": "ReynelJ",
      "created": 1635828758,
      "upvotes": 163,
      "replies": {}
    },
    "hiz5pft": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hiz5pft/",
      "text": "Nah, just persistence.",
      "author": "c-guzman104",
      "created": 1635828192,
      "upvotes": 86,
      "replies": {
        "hiznd58": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hiznd58/",
          "text": "Yeah, a doing a PhD is really saying ‘I’m going to do this thing, and I’m not going to stop until I’m done no matter how hard it is.’ Persistence, grit, gumption, whatever word you want to use for that ‘keep moving forward’ attitude.",
          "author": "alwaysalwaysastudent",
          "created": 1635842887,
          "upvotes": 42,
          "replies": {}
        },
        "hj0y48y": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0y48y/",
          "text": "My running joke is a PhD is just a degree in being stubborn.",
          "author": "Meaningfulgibberish",
          "created": 1635869264,
          "upvotes": 15,
          "replies": {}
        },
        "hj0kcoy": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0kcoy/",
          "text": "This. I am currently learning a program/skill I have literally zero previous experience in. Matter of fact, I am way behind in it and no idea if I will actually catch up and get a grade good enough to pass and move on to the next level of insanity and avoid academic probation, the latter of which sucks but is not the end of the world if you can pull out of it. But persistence. I'm about that life. Probably putting in entire days where someone else might put a couple of hours, give/take.\n\nI keep reminding myself and listening to others who are mentoring and helping me that the people who wrote my recommendations and let me in believed I'm good enough. Imposter syndrome is real, and I thought I had it bad in undergraduate lol. But I remember I never thought I'd actually be here, and that I do belong.",
          "author": "digitalapples-",
          "created": 1635863532,
          "upvotes": 8,
          "replies": {}
        },
        "hj1yom5": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1yom5/",
          "text": "Absolutely this. Most of the people I know who didn't finish the PhD were smart, successful students that lost interest in seeing the PhD through.",
          "author": "HighestIQInFresno",
          "created": 1635883612,
          "upvotes": 1,
          "replies": {}
        },
        "hj21g04": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj21g04/",
          "text": "I use the term resilience. Gotta emphasize the amount of suffering you have to endure as you persist",
          "author": "cloverdoodles",
          "created": 1635884676,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hizjs7f": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizjs7f/",
      "text": "No. Nobel prize winning physicist Kip Thorne has said he was average at best. Consistency is much more important. If you are able to score 91, that itself is good enough if you ask me. There's nothing more admirable than a passionate researcher.",
      "author": "Annyunatom",
      "created": 1635839537,
      "upvotes": 61,
      "replies": {
        "hj1kd1i": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1kd1i/",
          "text": "Proof by example is not a proof. \n\nKip Thorne was \"average at best\" at Caltech and Princeton University. This is far from being average in general.",
          "author": "ko_nuts",
          "created": 1635878085,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "hj0hszx": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0hszx/",
      "text": "This is going to an unpopular opinion. \n\nI think you need to “be able to learn” more than you “need to be smart”. And you need to be able to do that learning without someone teaching you. However you do it. YouTube. Papers. Doesn’t matter. You have to be able to figure stuff out.\n\nAnd learning isn’t about getting As on tests. It’s about retaining knowledge and understanding how to apply it. That happens after the test.\n\nI had to work harder than everyone else just to get grades that were middle of the pack too. Don’t let it discourage you if you are struggling now. It’s hardening you. I can’t tell you how many of peers didn’t not know how to work hard and failed because they didn’t get a 95 on a test.\n\nAs long as you still love it, Being able to get up off the mat after being knocked down will make all the difference. \n\nGood luck little dude.",
      "author": "LegallyThrownFarAway",
      "created": 1635862435,
      "upvotes": 12,
      "replies": {
        "hj23wr5": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj23wr5/",
          "text": "I agree with you. And to add to this, I think being curious is more important than being smart.",
          "author": "wildernesspizza",
          "created": 1635885602,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hizeww5": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizeww5/",
      "text": "Yes, you have to be above average to get a PhD. However, you've got a Bachelor's, maybe a Master's, and were vetted by multiple faculty members. You've got the intelligence.\n\nClasses are difficult. Graduate students like to pretend that they didn't study to affirm their predetermined ability to themselves and others. Frankly, the difference between 91 and 95 is small, and your classmates are probably lying out of their asses about not studying.\n\nResearch is different from classwork. Despite the mystique, research is an iterative process which gets formulaic after a few years. It's really about endurance and conscientiousness rather than genius. If you're the type of person who diligently studies for exams, you're probably disciplined enough for research. 👍",
      "author": "roachRancher",
      "created": 1635835230,
      "upvotes": 54,
      "replies": {
        "hj0tutl": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0tutl/",
          "text": "> Frankly, the difference between 91 and 95 is small, and your classmates are probably lying out of their asses about not studying.\n\nVery much this. Everyone brags up themselves usually. And for at least my programs, all they really cared about what if you passed with a B. Sure getting good grades is nice, but your research progress will quickly overtake grades in terms of importance.",
          "author": "Soulless_redhead",
          "created": 1635867513,
          "upvotes": 14,
          "replies": {
            "hj1kb02": {
              "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1kb02/",
              "text": "Yeah, actually I think in most cases in grade school, it's the opposite of undergrad. In undergrad, you always want the highest grade possible, and it might be nice if you learned something. In grad school, your grades are more or less irrelevant so long as you pass whatever the minimum is (B in my program as well), but it'd be nice to learn as much of the information as you can. Research is your currency to get out of here, not your grades.",
              "author": "nickyfrags69",
              "created": 1635878063,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hizf1l8": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizf1l8/",
      "text": "No. I honestly think planning and executive functioning skills are best. I struggle so much. I can do the academic work fine, but I struggle with all the things we’re supposed to manage",
      "author": "ADHDstrugglez",
      "created": 1635835338,
      "upvotes": 14,
      "replies": {
        "hj07l64": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj07l64/",
          "text": ":,( Same.  \n\n\nI'm wondering if I am, actually, cut out for this - doing a literature review is so hard because I get distracted by the shiny thing in the paper and go down a rabbit hole, fail to take good, concise notes, my files and notes are disorganized, and I have it all buzzing around in my head like something from an Alfred Hitchcock movie.  \n\n\nThen again, I'm doing applied work and have WAY too many people to keep track of, am still working within a semester type of format, and am forced to take full-time classes while also doing my research and working- with hoomans, that's \\*exhausting\\* for someone with ADHD. To be able to go 'nope, I'm gonna do this XYZ part of my thesis/dissertation this way because it will work better for me' is... hopefully what is in store. My partner is a PhD candidate and I envy the flexibility he has.",
          "author": "Antikythera22",
          "created": 1635857610,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hizhvhg": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizhvhg/",
      "text": "It's highly likely your perceptions of how much other people study are wrong. So many people who say \"omg I didn't study and I got a 95 lolol\" are total liars. I find this to be especially true in grad school. If someone tells you they didn't study and made an A, it's highly likely they're lying. Intellectual masturbation is a problem for some people, and those people are often addicted. \n\nI think dedication and ability to improve over time is more important than being \"quick\". Research is not often high stakes, fast-paced, decision making where you need to know a lot in a short amount of time to make a fast decision. Slow, methodical, and deliberate is more common. \n\nGrades are also generally less relevant. You need to maintain a certain grade average to be in good academic standing, but nobody is going to hire you based on your GPA. You get hired based on your research and publication record.",
      "author": "False-Guess",
      "created": 1635837821,
      "upvotes": 32,
      "replies": {}
    },
    "hiz6541": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hiz6541/",
      "text": "Yes you do need some sort of intelligence. There’s a lot of critical thinking and planning needed for it. That being said, don’t take your ability to memorize information for a test as your level of intelligence. That’s basically meaningless in grad school. It’s more about being able to deeply understand topics rather than spitting out memorized facts. You’ll have to take a good look at your skill set to see if it’s right for you, but honestly just the fact that you are spending 4 hours to study for a test when others aren’t shows that you know how to dedicate time to learning. Just something to think about!",
      "author": "You_Stole_My_Hot_Dog",
      "created": 1635828484,
      "upvotes": 28,
      "replies": {}
    },
    "hizlsf4": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizlsf4/",
      "text": "It depends on where you do your PhD. “Where” can mean what lab, what school, what country, what year and environment you defended your dissertation in…\n\nEvery now and then you will find someone genuinely non-intelligent who has a PhD. Sometimes due to academic dishonesty, sometimes due to someplace with excessively lax standards… it’s not common but it does happen.\n\nBut any PhD worth the paper your degree is printed on should require some degree of intelligence. You don’t have to be Einstein, but you do need to be capable of exercising logic and reason and not be the kind of person who would saw a branch off a tree while sitting on it because you couldn’t see the logical problem with that action.\n\nBut in general when it comes to feeling not smart enough for a PhD, one of the best things you can do is look at your fellow PhD students. If they’re a bunch of idiots then you may be in a program with overly-lax standards. But if you think you’re the only idiot in your program, and that you’re somehow a magical stealth idiot that manages to fool everyone around you into thinking you’re smart, then that is textbook imposter syndrome.",
      "author": "tentkeys",
      "created": 1635841392,
      "upvotes": 11,
      "replies": {
        "hj1mnqm": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1mnqm/",
          "text": "> you think...you’re somehow a magical stealth idiot\n\nThis is the best explanation of impostor syndrome I have ever heard",
          "author": "TheGuywithTehHat",
          "created": 1635878968,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hizj2ls": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizj2ls/",
      "text": "You don't sound unintelligent, it sounds more like a learning disorder. Perhaps slow absorption of material through reading. Having the discipline to power through that bodes well for you. Grit and determination are much, much more important than intelligence.",
      "author": "Curious_Traveller101",
      "created": 1635838892,
      "upvotes": 6,
      "replies": {
        "hj0abia": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0abia/",
          "text": "Yes! I didn't think I was smart for many years until I was finally treated for ADHD.",
          "author": "MercuriousPhantasm",
          "created": 1635858987,
          "upvotes": 3,
          "replies": {
            "hj0h6s0": {
              "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0h6s0/",
              "text": "That’s what I was thinking too. ADHD meant I had shit memory and got called stupid throughout school for poor spelling, forgetting key dates, not turning in assignments, but also made connections others missed and adapted by learning to reason/infer answers well if I couldn’t recall info.",
              "author": "Milch_und_Paprika",
              "created": 1635862162,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hizn60e": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizn60e/",
      "text": "I do think you need to be a bit smarter than the average person to succeed but you don't have to be a super-genius, it's far more important to have dedication and work ethic.\n\nIf you can graduate undergrad with >3.5 you are almost certainly intelligent enough to finish a PhD, it just comes down to how much you're efficient at working and how dedicated you are to finishing things.",
      "author": "eng2016a",
      "created": 1635842698,
      "upvotes": 3,
      "replies": {}
    },
    "hiztsmz": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hiztsmz/",
      "text": "I don’t actually think you need more intelligence than you need for the lower degrees to get a PhD. You really need the stamina (which I have struggled with immensely) and actually, people you think of as ‘intelligent’ in a typical sense might not have that. For example, I got through my first two degrees cramming my short term memory full for exams and writing essays at the last minute, so I’ve struggled with the slower pace and needing to constantly make a small amount of progress rather than ‘finishing’ something. If you’re already used to taking ‘longer’ (again not convinced about that but the point is *you* think you take longer) with studies and you keep on going, I’d say you’re better prepared for a PhD than someone like me.",
      "author": "fjkfjldsls",
      "created": 1635848613,
      "upvotes": 3,
      "replies": {}
    },
    "hizb3ue": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizb3ue/",
      "text": "Often you can move at your own pace. It's a marathon, not a sprint. Some times you have to speed up, but most days for me are slow (and hopefully steady). Often you need to take extra time to really understand concepts and processes, and refine your work. I would not mistake efficiency for a blanket \"intelligence\", which is complex and multi-faceted. Struggling and working hard are natural parts of the experience.",
      "author": "seaside1508",
      "created": 1635832080,
      "upvotes": 6,
      "replies": {}
    },
    "hizqkx7": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizqkx7/",
      "text": "Look, I barely scraped into my masters bc my grades are utter shit, but I got almost a perfect grade on my failed undergrad research project and have the skills to look at a bunch of papers and identify gaps in the literature which need to be filled. Being good at exams means very little in research, because it's not about remembering and regurgitating facts on the spot, it's about finding information and methodically piecing it all together into something new that someone might be interested in.",
      "author": "DeoxyRNA5",
      "created": 1635845879,
      "upvotes": 2,
      "replies": {}
    },
    "hj05ara": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj05ara/",
      "text": "In my lab definitely not. My PI comes across as having about average intelligence. (Chemistry)",
      "author": "WarU40",
      "created": 1635856387,
      "upvotes": 2,
      "replies": {}
    },
    "hj0nldl": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0nldl/",
      "text": "I suspect that most of us are too stupid to stop, so no, I don't think \"intelligence\" is required. You just have to be persistent and realize that working at a slower pace will take up more free time. Also what year are you in? After a while in undergrad, you'll wind up in classes where there's no way anyone will do that well on an exam without studying.",
      "author": "DADPATROL",
      "created": 1635864901,
      "upvotes": 2,
      "replies": {}
    },
    "hj0p8ha": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0p8ha/",
      "text": "I agree with the other commenters that it is more about consistency/hard work than about intelligence. \n\nIt varies depending on the field you're in, but it's more about doing research and understanding big ideas than memorizing everything. I've taken like six tests in my four years of grad school, and all were open-book with half being take-home exams.\n\nI'm also skeptical that people don't do any type of studying in undergrad and make high grades. It's possible, but my experience is that people downplay how much they study because we value intelligence over hard work, which is a mistake. I worked as an academic coach and literally 75% of people who came in would say they never studied in high school and are now doing badly since they don't know how. I was a high achieving student, but I also studied in efficient ways for all my classes  -- flashcards, self-testing, and watching videos.",
      "author": "Banana_Skirt",
      "created": 1635865589,
      "upvotes": 2,
      "replies": {}
    },
    "hj0sak8": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0sak8/",
      "text": "For sure- I feel like I get dumber every day and I’m in grad school. The main thing with graduate research is finding something you are interested in enough to go in neck deep. if you are the type of person who knows you learn slow but are willing to study as long as it takes to understand a concept - you have what it takes. … also, studying for 4 hours to get an A doesn’t sound excessive",
      "author": "leafwings",
      "created": 1635866866,
      "upvotes": 2,
      "replies": {}
    },
    "hiz91vt": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hiz91vt/",
      "text": "I've read that intelligence is not actually a single trait but a mixture of several factors. (Short-term memory, verbal intelligence, etc.) Having to spend more time than others to pass a test may not indicate that your intellectual capacities in general are low.",
      "author": "bahasasastra",
      "created": 1635830542,
      "upvotes": 5,
      "replies": {}
    },
    "hizhyy2": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizhyy2/",
      "text": "Well, it's mostly hard work. However, it does depend on the field you want to get a PhD in. E.g., Mathematics and Theoretical CS are notorious for being very difficult to publish papers in, and a great deal of innovative methods are required to get novel results, so brilliant people have an edge as they are able to (usually) quickly come up with convoluted yet beautiful proofs.\nThat said, with sufficient practice, a hard worker may definitely develop these skills, but it'll usually take more time than the innately brilliant guys.",
      "author": "excise1",
      "created": 1635837907,
      "upvotes": 2,
      "replies": {
        "hizn301": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizn301/",
          "text": "The \"innately brilliant\" guys, 9 out of 10 times, have just been doing it for far longer than anyone else around them. \n\nEvery single math genius I've ever known has held a burning passion for maths and played around with it as a hobby since childhood. It's just that they've had longer to develop the skills and intuition, sometimes up to 20 years longer (if they started playing with numbers at 4 or so).",
          "author": "SnakesOnAllThePlanes",
          "created": 1635842617,
          "upvotes": 1,
          "replies": {
            "hj109u9": {
              "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj109u9/",
              "text": "That is absolutely correct. However, I do feel that it is kind of like the chicken or egg problem. Kids who find basic math difficult usually wouldn't want to explore it further. On the other hand, kids who explore math at a level beyond their age are usually the ones who have already mastered the math their peers are learning and struggling at, which means they found it trivial. Doesn't this hint toward a greater degree of analytical and reasoning skills in them?",
              "author": "excise1",
              "created": 1635870139,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hj06fb4": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj06fb4/",
      "text": "No.\n\nConsistency and Stubbornness.\n\nBeing intelligent doesn't make you determined.",
      "author": "Lord_Blackthorn",
      "created": 1635856998,
      "upvotes": 0,
      "replies": {}
    },
    "hj0k6uy": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0k6uy/",
      "text": "Intelligence is fake. Time and effort are the actual important bits.",
      "author": "willowhelmiam",
      "created": 1635863463,
      "upvotes": -1,
      "replies": {}
    },
    "hizmwjx": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hizmwjx/",
      "text": "100% what others said about them lying about not studying.\n\nLiterally every person except for one (who'd been interested in math from a really early age, and had already seen all of the concepts many times before) in my grad and undergrad-level courses was like this. \n\nI was even like this, because at some point it becomes a game of chicken - you don't want to be the only one in the friend group who admits that they had to actually study - so we lie through our teeth about not studying to save face, and then go home and study like crazy, and say we \"can't go out because we're busy with job/other stuff\" to hide it. It was especially a thing among STEM students because we all are so insecure, anxious, have so much pride, and many of us are from cultures where academic perfection is an absolute must. \n\nIt got pretty toxic tbh, because some ppl started doing this intentionally to psyche other ppl out and get in their heads, and set them up for failure by making them feel like they are dumb. It's like the girls who like to be seen as effortlessly thin while being able to eat anything, where in reality they'll restrict or exercise it all off afterwards. It's just a show ppl put on to feel superior, or to prevent themselves from feeling inferior.\n\nDo NOT fall for it. Do not let those losers (like me) win. I guarantee that they're either studying a shitload, or underestimating their studying, or learned it all at some point in the past. No one absorbs information out of thin air, and in my experience \"intelligence\" has very little to do with anything.\n\nYour effort, consistency, time management skills, and discipline will pay off FAR MORE than anyone's \"natural smarts\", if such a thing even exists. Keep at it, and most of all, do not let them get in your head. \n\nBtw, getting a score of 91 is more than enough proof that you are \"smart enough\".",
      "author": "SnakesOnAllThePlanes",
      "created": 1635842447,
      "upvotes": 1,
      "replies": {}
    },
    "hj068bi": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj068bi/",
      "text": "We were told in one of our first Research Development Programmes- if you’ve been accepted to a PhD you’re smart enough.",
      "author": "SolarLunix_",
      "created": 1635856892,
      "upvotes": 1,
      "replies": {}
    },
    "hj0au61": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0au61/",
      "text": "It sounds like you have the drive to do great in grad school! The thing about grad school is, it is all about repetition. You repeat the same experiments, the same procedures, hundreds of times. You’ve got time to get it right. And being able to study on stuff that other don’t will do nothing but help you. Also, grades don’t really matter in grad school. You are there to learn alone,  not to prove you’ve studied. This dynamic actually makes a lot of people who think they aren’t smart excel.",
      "author": "hiagha",
      "created": 1635859238,
      "upvotes": 1,
      "replies": {}
    },
    "hj0e53s": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0e53s/",
      "text": "Being able to work hard is probably the most important asset and requirement.",
      "author": "RageA333",
      "created": 1635860790,
      "upvotes": 1,
      "replies": {}
    },
    "hj0edqa": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0edqa/",
      "text": "In my field (cell bio), getting a PhD is not a test of your intelligence, but rather a measure of how stubborn you are.  I know a number of PhDs who are definitely not the most brilliant individuals, but because they were willing to stick it out, they have the degree that proves they can work well even under adverse circumstances.",
      "author": "WtheCore",
      "created": 1635860901,
      "upvotes": 1,
      "replies": {}
    },
    "hj0fnip": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0fnip/",
      "text": "Lots of great answers here but I want to add a some more. IMO intelligence is very much a spectrum and is something that fades and grows like a muscle. \n\nIn undergrad, all the people who I considered the most intelligent simply had the energy to work longer. When we studied together I was on the same pace with them but faded away after a few hours of studying. \n\nOver time, I found that the more I pushed myself, the more difficult problems I was able to take on. I'm 100% convinced that intelligence grows if you treat your mind and body with care.\n\nIn my Grad school experience, I've found most people are on the similar levels, but confidence in themselves varies wildly. I really think the most important think in grad school is time management and planning far into the future.",
      "author": "PisteBeast",
      "created": 1635861476,
      "upvotes": 1,
      "replies": {}
    },
    "hj0looo": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0looo/",
      "text": "No, I'm dumb as shit. I just get my work done.",
      "author": "person_bot",
      "created": 1635864096,
      "upvotes": 1,
      "replies": {}
    },
    "hj0qaih": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0qaih/",
      "text": "I finished my PhD last year and I've met a lot of grad students. Not all are particularly smart or witty or quick or prodigies.\n\nEvery single one of them is stubborn as hell.",
      "author": "SailorAntimony",
      "created": 1635866035,
      "upvotes": 1,
      "replies": {}
    },
    "hj0rhxr": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0rhxr/",
      "text": "Remember the fable of the tortoise and the hare? Takes a lot of perseverance and hard work to get a PhD. \n\nSo if you love learning the discipline, and you're committed to working hard, at the very least it's worth a shot to try it.",
      "author": "raistlin65",
      "created": 1635866536,
      "upvotes": 1,
      "replies": {}
    },
    "hj0sh6e": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0sh6e/",
      "text": "Coming from the humanities, I will say that the greatest challenge is making the leap from absorbing scholarship, heaps of it, to contributing something new. You have to learn what others have said on a topic, identify the strengths and weaknesses in their arguments, analyze their methods and evidence, and then stake out your own position in a way that moves the conversation forward. Intelligence helps in this process, but not as much as being persistent and consistent as others here have said, and picking a subject or area of study about which you care deeply. Self-sufficiency and the ability to work independently are also important, since grad school tends to be sink-or-swim, even if you do find good mentors, because they are too busy to take students by the hand. One last key thing I'll mention is knowing your weaknesses and working around them. For example, if you need more time to study, choose a graduate program that allows you that time, instead of one that eats it up with lots of TAing or too little funding, forcing you to work too much on the side.",
      "author": "sheshekabob",
      "created": 1635866942,
      "upvotes": 1,
      "replies": {}
    },
    "hj0v1jv": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0v1jv/",
      "text": "Can you read lots of assigned texts, and pull info from the multiple sources to write a coherent piece addressing the topic of conversation? \n\nProper citations is the hardest part where dumb people get caught up.",
      "author": "Holy_Sungaal",
      "created": 1635868006,
      "upvotes": 1,
      "replies": {}
    },
    "hj0vdm8": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0vdm8/",
      "text": "Nope. I am not particularly intelligent or talented, I am just stubborn as hell. Hard work and persistence can overcome a lot, intelligence alone does little.",
      "author": "CurvyBadger",
      "created": 1635868144,
      "upvotes": 1,
      "replies": {}
    },
    "hj0ywp3": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj0ywp3/",
      "text": "You sound very similar to my own situation. In undergrad I always studied *way* more than my peers to get a decent grade, when some could barely study and get an amazing score. I ended my undergraduate education with a GPR of 3.28 which is not high by any means. I did have the chance to start doing research in my undergraduate career and that did spark my interest in a PhD. I was nervous given my GPA. \n\nHowever, I am a hard worker. I have a very strong drive and passion for what I do. I am finishing my PhD next semester (Spring 2022) and it is all thanks to my persistence. You will keep learning. Leaning new skills, more information, better writing. Everything builds you up to the moment. It all just takes practice and persistence. (My graduate GPA is 3.89 if you are curious)",
      "author": "Kaylie64",
      "created": 1635869588,
      "upvotes": 1,
      "replies": {}
    },
    "hj1344t": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1344t/",
      "text": "some masochistic traits are also required to be going over and over and over after disappointments, rejections, failures and all while seeing all your friends with good jobs, buying houses and starting families",
      "author": "lord_heskey",
      "created": 1635871274,
      "upvotes": 1,
      "replies": {}
    },
    "hj13cja": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj13cja/",
      "text": "Intelligence is the minimum baseline from everyone to get into a PhD, but it is not the most important trait to successfully complete one, given high dropout rates.\n\nFor that, the most important trait is organization.  The act of writing is organization, so is the act of research, data analysis, deadline, financial, social and mental health management.\n\nWithout organization, the \"smartest\" person (if defined narrowly as someone who \"knows a lot\") would fail out.\n\nNow if you want to move the bar beyond completing a PhD and into publishing a monograph at a top tier academic press, then intelligence and excellence rears its head again, but again, off a minimum baseline of organization necessary to finish the PhD first.",
      "author": "bitparity",
      "created": 1635871367,
      "upvotes": 1,
      "replies": {}
    },
    "hj16bt8": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj16bt8/",
      "text": "Having just finished my PhD, I'd say the most important trait is tenacity. Pure pig headed stubbornness that you WILL finish.",
      "author": "blteare",
      "created": 1635872557,
      "upvotes": 1,
      "replies": {}
    },
    "hj17fwe": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj17fwe/",
      "text": "Ability to endure suffering is more important than intelligence for this.",
      "author": "le_rougarou",
      "created": 1635873002,
      "upvotes": 1,
      "replies": {}
    },
    "hj194h8": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj194h8/",
      "text": "I have ADHD and possibly autism, so even on my good days I waste a lot of time doing unnecessary shit and on some days I can't get anything productive done at all. I haven't ever been good at studying or tests because I couldn't focus on that one task for long enough.   \n\n\nI am also doing a PhD in nanomaterials engineering, with a sub-focus on AI and consistently get glowing reviews from my advisor. Don't feel discouraged before you even start, you almost certainly have skills that will make you invaluable to a research group. Are you good at writing? Can you make connections between disparate topics, maybe even relate your personal interests to your work? Can you collaborate well with others and enhance their work as well? If you really want to do a PhD, I say go for it, it's a hell of a journey but I've found it to be very rewarding.",
      "author": "Cyber561",
      "created": 1635873665,
      "upvotes": 1,
      "replies": {}
    },
    "hj1axrd": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1axrd/",
      "text": "Everyone already gave great answers that I agree with (persistence is more important than \"intelligence\"), but I want to add that the reason why imposter syndrome is a thing is that even though many of us acknowledge that persistence is more important than anything else, the culture of academia is still very much inundated with implicit assumptions about intelligence. The idea that doing well or not well in grad school is somehow reflective of our \"innate\" intelligence is slowly (very slowly) phasing out with newer faculty who have more updated beliefs about intelligence, but sadly it is still the case that many of us either receive direct or indirect messaging that performance is tied to some kind of inherent trait. In addition to messages within the academic space itself, there is also the societal perception that advancing through higher education is about inherent intellectual abilities, rather than factors like persistence and  generational socioeconomic circumstances, despite much research highlighting the connection to the later group of factors. In any case, this is all to say that it totally makes sense you would ask this question and wonder about this, given all the messaging that goes around within academia and outside of academia, about academia. However, when people critically examine their personal experience, it aligns with the current empirical evidence that success in school in general is more about conscientiousness and perseverance, and socioeconomic circumstance, more than anything else. Unfortunately, this critical examination often doesn't do enough to push past the implicit messages about intelligence received on a daily basis, therefore creating imposter syndrome, among many other socio/cultural/political contributors.",
      "author": "fuyumelon",
      "created": 1635874391,
      "upvotes": 1,
      "replies": {}
    },
    "hj1dlu6": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1dlu6/",
      "text": "So first off if you can get a 91 on a test you’re probably pretty safe in having the assertion that you’re not dumb.\n\nIf you studied for four hours to get a 61 on a test then you’re probably dumb, didn’t understand the goal, or didnt get proper instruction.\n\nI am the kind of person who got a 2.1 in high school and was told math was never my thing turns out I had terrible professors. Fast forward 20 years now that I’m finishing up requirements to enter a PhD program for computational linguistics people tell me I’m lucky.\n\nIn your PhD program you’re likely to meet a number of people who academics was just easy for them and they can absorb what’s in a book like you can drink water.\n\nSeveral people who were also applying to the program are a part of the study cohort that we meet monthly to review the coursework, practice coding and arguments.  So I was initially quite intimidated as three of the nine of graduated from Ivy League, now several of them it seems like they don’t know how to study unless there’s a book to give them every step of the process.\n\nI’ve been jokingly calling them bookboy because they don’t seem to understand that a small percentage of what we need to learn is in a book but that’s the only way that they were taught. To study the book the professor gave and only that book.\n\nI’ve probably got dozens of Industry white papers, and hundreds of hours of seminar video that I found, in addition to nine books in my que totalling maybe 8,000 pages of existing research and none of this is specified by the professor. “Why are you reading/studying this” is a frequent question and my reply is “why aren’t you reading it”. If I’m going to study computational linguistics then I’m definitely going to be studying was widely considered to be the Bible of speech and language processing by Juravsky and Martin.\n\nSo you might even have an advantage because they don’t have high expectations for you, when it comes time to produce results hopefully that extra study is going to blow their mind as far as what I can do. so I would recommend you dig much deeper into the almost into the bedrock of your subject. Then also find the top 3 to 5 experts in the world and email them like I did to find two of them emailed back.\n\nSo some intelligence is required to get a PhD but you’re going to need a lot more persistence, improvisation, assertiveness and ability to make logically connected solid cogent well researched arguments.",
      "author": "Your_Data_Talking",
      "created": 1635875450,
      "upvotes": 1,
      "replies": {}
    },
    "hj1eh6t": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1eh6t/",
      "text": "Honestly I think you'll do fine! A lot of being in grad school is about being able to work hard and self motivate, which means you're in a better position than people who do well without studying. You already know how to do the work!",
      "author": "chordatabyte",
      "created": 1635875792,
      "upvotes": 1,
      "replies": {}
    },
    "hj1ftn5": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1ftn5/",
      "text": "Hi OP! Well, 4h studying for a 91 in a test sounds excellent. I don't know about the field you're in, but your time dedication might be abnormal in the sense that it was small, not long!\n\nAbsolutely distrust anyone who says they didn't study and got over 95% answers right. With \"not studying\" they may very well mean putting 4h of work into it, or more. Or, they may have gotten a lot of practice on that sort of exam at some point, which is \"studying\" in the end.\n\nFor the PhD... far more important than having some general intelligence is **the ability to execute it**. Reading content critically, synthetizing, producing new knowledge... but also, **planning**. Surely you don't need to be a project manager to start the PhD, but it is a complex, long project, so you could face it more like that rather than a test. And crucially, the related skills are something you may have already, or something that you will slowly develop.\n\nThe most important question to ask yourself: is a PhD a good step to get to your desired career? Good luck!",
      "author": "Equivalent_Proper",
      "created": 1635876324,
      "upvotes": 1,
      "replies": {}
    },
    "hj1ji4l": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1ji4l/",
      "text": "It was pitched in *Outliers* by Malcolm Gladwell (which is, as many know, flawed) that intelligence is only a sort of minimum threshold. Basically, you need to be \"x amount smart\" - that is, smart enough to be able to understand and manipulate the basic concepts in your field, but any boost in intelligence (e.g., \"higher IQ points\") past that is kind of more just gravy than anything else. Regardless of how you feel about the book, this is generally the case. You have to be of a minimum level of intelligence that you can gain the required knowledge, but one doesn't necessarily need to be any smarter than that to succeed.\n\nMany of the things that make someone successful, as people have pointed out already, go far beyond traditional intelligence, just as they would in any other field. Even if you had to work harder than others to get there, if you were ultimately able to get the required results in terms of academic performance, you're likely to be above the required threshold, even if it means you might have to work harder than others. But it's not like Nobel Prizes, for example, go to the smartest person - they go to someone who made the most significant contribution in that field. So while there may be a positive correlation, it's extremely loose, and once again, other things likely matter more.\n\nIn my own experience in grad school, I've observed that the PhD students who impressed me the most are not necessarily the \"smartest one\", but usually the most dedicated. It reaches a point, especially in the STEM fields, that the person who cares the most is able to actually expose themselves to more useful information than someone who might technically be more intelligent. Then, this exposure leads to more meaningful breakthroughs as that information is applied. Further, creativity in problem solving, which is important in research, is not really a measure of intelligence either.",
      "author": "nickyfrags69",
      "created": 1635877756,
      "upvotes": 1,
      "replies": {}
    },
    "hj1judu": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1judu/",
      "text": "I do think you are pretty dumb.\n\nBecause if you were smart enough - you won't be measuring 'intelligence' by comparing tests and exams but would rather be more curious about the concept of intelligence itself. If you think intelligence is reflected through success in exams and tests, well, then that can be achieved through multiple ways - willpower, practice, hardwork, maybe even some weird medications and techniques.\n\nJust find your own way in life. As a researcher/scientist, be curious and honest to your thirst for knowing more. Everyone is dumb, and more they learn - the dumber they feel. Stop giving two fucks about intelligence - its a stupid, abstract concept which aids us in no way in our lives.",
      "author": "vajra_",
      "created": 1635877886,
      "upvotes": 1,
      "replies": {}
    },
    "hj1koev": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1koev/",
      "text": "My two cents, though this is coming from someone who just got their master's, is that it helps, but isn't the most important factor. I like to consider myself fairly intelligent, but there were certainly smarter people in my program who gave up or are still in the program coming on 2 years after I graduated. The biggest factor is dedication. A good advisor can help you iron rough patches, but they can't do the work for you. The smartest person in my program didn't graduate. She is beyond a shadow of a doubt the smartest person I've met, but she works a full time job, and wasn't dedicated to passing. Burnout is real.",
      "author": "Elite94",
      "created": 1635878205,
      "upvotes": 1,
      "replies": {}
    },
    "hj1npp4": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1npp4/",
      "text": "First of all, if you can manage to get a 91 on a college level test, then you are intelligent. Period. Even if it takes you 4 hours of studying to get the information, you eventually get it. Being a slower learner is not a sign of a lack of intelligence.  \n\nSecondly, I would say, the speed at which you pick up information may be less important in graduate school than in the lower levels like high school. I remember in grad school that a lot of the things we worked on were longer projects that took months as opposed to just quick assignments. \n\nThirdly, if you are asking if someone who TRULY lacked intelligence could complete a PhD, then I am saying, no they could not. You do have to have some level of intelligence to complete graduate level coursework. But YOU are certainly not lacking in intelligence.",
      "author": "Elegant-Rectum",
      "created": 1635879370,
      "upvotes": 1,
      "replies": {}
    },
    "hj1t3zy": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1t3zy/",
      "text": "Honestly, I think it *should* be that way but it's not. Mostly because people are always going to use degrees as a measure of intelligence so people are always going to assume that PhD==smart even though it's not really true. \n\nDegrees, including PhDs, are measure of persistence if anything. I also genuinely think the standards for getting a PhD have lowered- This will vary widely by advisor, department, program and school but I think there are so many programs and so many PhD students now that some of them have really lax standards. I'll be honest, I felt like my own program's standards were too lax. There were classmates who got degrees who absolutely shouldn't have imo. \n\nThe same can be said about undergrad degrees to an extent but at least there's some uniformity among most undergrad curricula. Like student A had to pass X amount of credits. Each grad program is wildly different from the other. Even within programs the rigor can widly vary from advisor to advisor. I knew a PI who wouldn't let their students graduate until they produced something Nature worthy. Even if they had a bunch of other publications. Then on the other hand you have a PI who was trying to graduate one of their students who hadn't published anything in 5 years",
      "author": "stathicus",
      "created": 1635881465,
      "upvotes": 1,
      "replies": {}
    },
    "hj1tfsp": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1tfsp/",
      "text": "No, PhDs are more about privilege than anything. Most of the folks in my department come from well-off families and have family members with graduate degrees. Academia is designed to screw over anyone from a low-income background since wages are so low and its all about connections.",
      "author": "phdreaming234",
      "created": 1635881594,
      "upvotes": 1,
      "replies": {
        "hj1y16v": {
          "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1y16v/",
          "text": "Everyone in my MA program comes from a working class background, many of whom are the first in their family to attend graduate school. Many of the professors in the department, including my advisor, also come from working class backgrounds and busted their ass through their PhD. This depends a hell of a lot on your specific program and environment.\n\n(and this isn't to say that low wages and elitism aren't issues in academe)",
          "author": "Shezarrine",
          "created": 1635883364,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj1yv6m": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj1yv6m/",
      "text": "A PhD is 10% intelligence 90% persistence. So yeah, it's \"required.\" But it's by no means the most important component.",
      "author": "Tritagator",
      "created": 1635883682,
      "upvotes": 1,
      "replies": {}
    },
    "hj23ufp": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj23ufp/",
      "text": "Yes, of course. But not a ton. Persistence and work ethic and genuine interest in your work are far more important. 91 is a good enough result and the fact you were willing to put four hours into it a good sign.\n\nI was one of those naturally quick people and never found anything that I had to do academically to be challenging, until grad school, and I didn't handle it well. Some people are naturally quick enough to get through all of life, but a lot hit a wall at some point, like I did.",
      "author": "iammaxhailme",
      "created": 1635885577,
      "upvotes": 1,
      "replies": {}
    },
    "hj28xrj": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj28xrj/",
      "text": "One of the best pieces of advice I've ever received is \"Anyone can get a Ph.D. if they're masochistic enough.\" \n\nYou don't need to be innately smart to get a Ph.D. There's this assumption that you do because you have to be highly educated to get one and you have to know a lot of information about a topic that not many people know. But neither of those two traits require you to be innately talented. You just have to want to do it badly enough and be willing to put yourself through the struggles that almost all graduate students face (low pay, poor job prospects upon graduation, long work schedule, and the ever-present and overwhelming feeling that you are too stupid to function).",
      "author": "H2-van_g-O",
      "created": 1635887518,
      "upvotes": 1,
      "replies": {}
    },
    "hj2bjuh": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj2bjuh/",
      "text": "Well, I think you should take a step back from your own premise because needing to take a bit longer to \"get it\" than others doesn't mean anything about your \"intelligence\" in the sense that it's a meaningful trait in academia.\n\nIt sounds like you're just the type who learns through effort rather than intuition. That's not necessarily a bad thing, and I bet you have strengths not shared by your more intuitive peers, like maybe your retention is better or your understanding of what you put in the time to understand is deeper.\n\nThese are strengths that will serve you well in grad school. Intellectual \"quickness\" I would say less so.",
      "author": "UmiNotsuki",
      "created": 1635888516,
      "upvotes": 1,
      "replies": {}
    },
    "hj2eh5b": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj2eh5b/",
      "text": "No",
      "author": "LetsGoGameCrocks",
      "created": 1635889642,
      "upvotes": 1,
      "replies": {}
    },
    "hj2ic6g": {
      "link": "/r/GradSchool/comments/qkwgrw/is_intelligence_a_required_trait_to_get_a_phd/hj2ic6g/",
      "text": "Nah",
      "author": "smallwaistbisexual",
      "created": 1635891146,
      "upvotes": 1,
      "replies": {}
    }
  }
}