{
  "sid": "q7i8u8",
  "link": "/r/GradSchool/comments/q7i8u8/best_reading_and_notetaking_strategies_for/",
  "title:": "Best reading and note-taking strategies for remembering content",
  "text": "First year PhD student here, need advice on the most effective (and the most efficient) paper reading and note-taking strategies. I'm in a field that is particularly jargon heavy (as are most disciplines to be fair), and I've realized that while I tend to remember the gists of the papers I've read, I get confused on the specific details during discussions with my advisor. \n\nMy current strategy for most papers is to (i) highlight important points during the first reading and (ii) write down a gist of the paper (motivation, background, experiment, conclusion) during the second reading. For papers that are more relevant, I take more extensive notes and work through the math (not a Math PhD student, but there's a lot of computational modeling involved in my field). \n\nI am contemplating about whether to invest in a note-taking tablet. I use a reusable notebook, so I don't have to keep purchasing stacks of papers, but the process is more tedious since I have to write more than I would need to if I were annotating a pdf. I'm curious about whether anyone has experienced any difference in recall ability when taking pencil-paper notes vs. notes on the tablet using a stylus? Also what might be other good strategies for remembering details/examples/math more clearly?",
  "author": "messcogitans",
  "created": 1634152048,
  "updated": 1634167798,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjbpze": {
      "link": "/r/GradSchool/comments/q7i8u8/best_reading_and_notetaking_strategies_for/hgjbpze/",
      "text": "Zettelkasten!\n\n[https://writingcooperative.com/zettelkasten-how-one-german-scholar-was-so-freakishly-productive-997e4e0ca125](https://writingcooperative.com/zettelkasten-how-one-german-scholar-was-so-freakishly-productive-997e4e0ca125) \\- overview\n\n[https://zettelkasten.de/posts/layers-of-evidence/](https://www.reddit.com/r/Zettelkasten/comments/pktt0i/how_to_process_empirical_studies_and_separate_the/) \\- how to use it for articles\n\n[https://obsidian.md/](https://obsidian.md/) \\- freeware",
      "author": "nnomadic",
      "created": 1634161519,
      "upvotes": 1,
      "replies": {}
    }
  }
}