{"sid": "g8seom", "link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/", "title:": "Anxiety over being unproductive during pandemic - how do you cope?", "text": "I was wondering if others are experiencing anxiety over being substantially less productive at home, but still needing to meet academic deadlines for paper and journal submissions, reviews, any leftover coursework. How do you maintain a good standing with your boss/students/collaborators if you are struggling?\n\nI'm a graduating PhD student about to hold her defense in June and trying to submit one last paper mid-May, which would make the final chapter of my dissertation I am currently in the process of writing. However, I was supposed to start a full-time job as per our original agreement with the employer in April, and so that's also currently ongoing as a work-from-home situation. I constantly feel like I'm failing everyone's expectations. I also live alone, so finding it extremely difficult to work all the time without being able to change environments or at least accept some days are bad guilt-free. Any tips would be appreciated.", "author": "researchshowsthat", "created": 1587956678, "retrieved": 1632846418, "over_18": false, "upvotes": 284, "upvote_ratio": 0.98, "comments": {"forp7ad": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/forp7ad/", "text": "[deleted]", "author": null, "created": 1588016074, "upvotes": 3}, "for3xa3": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/for3xa3/", "text": "I fell into a deep depression and as a result of using alcohol to douse the flames of incapacitating anxiety I settled in to a vicious cycle of procrastination and self abuse.   To curb the brain damage I decided to make the best of the situation by learning all about wine online and started training my palate.  It seems to have rekindled my love of learning and is lifting my spirits for writing again.  Now I’m using wine tasting as a reward for working and I actually think I’m on the upswing.", "author": "shindleria", "created": 1588005750, "upvotes": 7}, "foqtf0l": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/foqtf0l/", "text": "I saw a quote today that was really helpful “You’re only unproductive by the standards of the world we lived in two months ago and that world no longer exists”. We are living through a global pandemic, 2,000 people are dying a day. Be gentle with yourself, you are doing your best given the traumatic circumstances.", "author": "wasupwasup05", "created": 1588000498, "upvotes": 9}, "foqmbrq": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/foqmbrq/", "text": "Let me start with my usual meta-tip: tips are really just stories we've told ourselves about how we've managed to succeed. Even worse, they are sometimes lies told by people who aren't really practising what they are preaching, and maybe aren't even succeeding all that much! In general, you should be trying to practise kindness towards yourself, and don't get hung up on any particular idea about what you should be doing during this immensely difficult time.\n\nThat being said, I have a few ideas. Firstly, the \"changing environments\" thing you mentioned. I also struggle with this. The commute is the time where I change my state from \"at home\" to \"at work\". If I'm in the at home state, I might be thinking a bit about taking the bins out, or cleaning the bathroom, or maybe even playing a video game or something like that. In normal times I've learned to yank myself out of the door and that helps my brain go into \"thinking about work mode\". Since you can't do this now, you have to replace it with something else. I think this is also part of why getting dressed is helpful for some people (though not for me). I find meditation is helpful, you could also try going for a walk around the block, either way try to make it a \"mental commute\". Ideally you could try to make sure the work area is differentiated from the living area.\n\nBeyond that I think it's about staying focused and setting the right goals for yourself. I personally don't find detailed timetables helpful, it usually results in a feeling of failure early in the day for me. I prefer to have one A goal which I must get done, and one B goal which I will start if I complete A (and then a hidden list of other goals that I try not to think about or see when they are not needed). Recently I saw a youtube video about this sort of thing that I thought was really interesting. I've linked it below, but the main ideas to try: 1. dopamine detox 2. setting \"remain focused through the day\" as the main goal. YMMV\n\n[https://youtu.be/eLUDauIxudM](https://youtu.be/eLUDauIxudM)", "author": "l_lecrup", "created": 1587996657, "upvotes": 16}, "foqk5p8": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/foqk5p8/", "text": "I'm in a similar position - 1st year PHD student writing a position paper. My supervisor is sick unfortunately so I've gotten no feedback on my draft of it for about a month, meaning I have very little idea whether I'm writing complete rubbish or not. \n\nI've found myself trapped in the same cycle of trying to push myself to be productive most days but oftentimes ending up either procrastinating and feeling guilty or reading and re-reading stuff without actually taking in anything. \n\nSo something I've found helpful for that is setting myself targets of relatively large milestones I want to get done (like finishing a big section of the paper) then 'handing in' on that day and designating the rest of the day as a break.", "author": "Culibonius", "created": 1587995365, "upvotes": 3}, "foqi6b5": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/foqi6b5/", "text": "I'm struggling too but with end of semester work. Can you take your work outside occasionally? I find that helpful right now.", "author": "DamagedMonster", "created": 1587994123, "upvotes": 2}, "foq10i3": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/foq10i3/", "text": "I've stopped myself trying to work a set number or hours at home. It wasn't working. \n\nInstead I have started of setting myself a task to do each day. Even if it is a little task like editing a part of a manuscript I will still feel accomplished for doing something. \n\nWhen I'm feeling stressed with stuff I try to occupy myself with something that isn't my work. I'll play video games, cross stitch or watch YouTube\n Anything to try and take my mind off things. \n\nI hope that helps. And I hope it gets better for you.", "author": "DoodleCard", "created": 1587979045, "upvotes": 25}, "fopwzxc": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/fopwzxc/", "text": "I had lots of practice from all the anxiety about being unproductive I had before!", "author": "Astro_Biscuit", "created": 1587974972, "upvotes": 9}, "foptb8t": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/foptb8t/", "text": "I definitely relate to you. What I’ve done is to plan out my day. I dedicate a day to do the planning and then start it either that day or the following day. I work a lot better at night for some reason, but pick a time that you dedicate for productivity. \n\nI would recommend to take any drink that gets you in the mood for productivity. My drink is coffee. \n\nCreate a space where you know it’s for work only. \n\nPlace your phone out of sight and out of reach. It helps a lot! \n\nIf you use google calendar that helps out with planning\n\nListen to music that gives you motivation and inspiration before you start your work \n\nMaybe to begin your productivity mood do some slight house cleaning and then jump into your academic work\n\nIn response to your anxiety, look up anxiety coping techniques to help you a bit. Don’t drink anything that elevates heart rate. Lastly, you got this! \n\nI wish you all the best! Good luck!", "author": "PeepeeHalpert97", "created": 1587971433, "upvotes": 5}, "fopmsse": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/fopmsse/", "text": "I can sympathize a lot, I am so unproductive right now. I have only been doing the minimum amount of work just because I can't concentrate. For classes, I am in the worst possible environment for me to learn which really sucks. I do make a schedule and try to stick to it, but being in an environment really hits my rigid nature and makes it hard.", "author": "Nekotana", "created": 1587965767, "upvotes": 23}, "fopkhcy": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/fopkhcy/", "text": "You’re gonna wanna take two carbon five hydrogen and one oxygen. Now take that, mix it with some fruity beverage, shake it up real good and remember you are more than what your marginal output is.\n\nEdit: chemistry", "author": "PanOmnist", "created": 1587963906, "upvotes": 40}, "fopi15m": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/fopi15m/", "text": "I'm in the same situation, defending in July but have already started working as well. I think I'm going to make it but the added stress of this situation has made what was already going to be a hard time feel almost impossible. I just keep reminding myself that the best I can do is my best, and that will have to be good enough.", "author": "cinnamonbears", "created": 1587962022, "upvotes": 5}, "fope220": {"link": "/r/GradSchool/comments/g8seom/anxiety_over_being_unproductive_during_pandemic/fope220/", "text": "[deleted]", "author": null, "created": 1587959144, "upvotes": 124}}}