{"sid": "i5ogue", "link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/", "title:": "My attention span is gone. Help.", "text": "Has the pandemic destroyed anyone else's ability to concentrate to a concerning degree? I had attention problems even before but now it's so bad I'm actually afraid part of my brain is broken and my ability to focus won't return post-pandemic.\n\nI'm still WFH and reading papers is like pulling out teeth. I've been reading the same paper which I have to present at a journal club for the last two days (I finished it yesterday and managed to take notes while reading, but didn't process it at a high enough level, I feel, which is why I'm trying to read it more carefully today). I don't have outside distractions, just me at my desk on my work laptop, but my brain is full of a million unrelated thoughts, like having 10 TVs all playing a different channel at once.\n\nI'm getting more and more frustrated because I want to read this paper! I want to be productive, the paper itself is interesting, and I've removed all outside distractions. But my brain still refuses to process. I can't hold the information in my head for long (hence the need for detailed note-taking). It seems to just float away like air.\n\nPomodoro isn't effective. I've tried it at progressively shorter intervals but literally after reading 2 or 3 sentences my brain will go \"Ooh shiny!\" at a thought drifting through my head, I'll chase the rabbit down the hole, and 15 mins later realize I've been staring into space. Then I'll return to the paper, re-read the same sentences because I didn't process them, and the same thing will happen. The thoughts range from an interesting article I read that morning, memories from years ago, a cool concept from a class I took in undergrad, a song on the radio...except they all run into each other and I can't even hold onto one of them for long before I flit onto the next one. I don't respond to positive incentives, either, since I know I could just give myself the reward anyway even if I haven't done the thing.\n\nThe attention issues have gotten worse since I started staying home in March. There are still some things I can focus on; I do bioinformatics, and am much more productive when I'm coding than reading. But since everyone's been home, there isn't any new data to work on anyway, and any old data from the backlog goes to the lab's computational biologist first. And what I really need to be doing is reading because I have a written qual in the form of an F31 due at the end of the year. I can still read general news articles/features (the longform kind The New Yorker or Atlantic put out), though that also takes effort.\n\nI'm really freaked out by this and don't know what to do. I've always had focus problems, but they've never been this severe, though now I wonder if external structures just masked them in the past (I've always joked that I need meticulous external organization because of how disorganized my actual brain is). I've thought about whether this may be undiagnosed ADHD, especially since 3 of 4 of my immediate family members have the inattentive variant. But I was apparently a VERY organized and well-behaved child, especially in contrast to my brothers, whose ADHD was very obvious. So I don't know.\n\nThis is making me wonder whether I really feel passionate about my field and whether I can really succeed in it. I figure, if I just cared enough I'd be able to focus on this, right? And the constant effort yielding minimal results is just worsening my (diagnosed and pre-pandemic) depression and anxiety and making me feel like I don't deserve to be at my school. I've talked to my PI about feeling unproductive, and he was very supportive and reassured me he wasn't expecting anyone to perform like their pre-pandemic self, and that he had no issues with the quality/quantity of my work beforehand. But I didn't tell him how bad it is, and I'm afraid my ability to work is going to continue to deteriorate until it becomes noticeable even to him.", "author": "neurosock", "created": 1596842427, "retrieved": 1632845940, "over_18": false, "upvotes": 351, "upvote_ratio": 0.99, "comments": {"g0tsnal": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0tsnal/", "text": "This is not uncommon at all. Stress and trauma can harm out ability to concentrate and make decisions. Indulge in self-care and hobbies as much as you can. Stay off your cell phone! As a society we've gotten really bad about being glued to them all the time and it ruins our capacity to be bored.\n\nAlso, get tested for ADHD. I was diagnosed as a kid but recently got my diagnosis restrengthened for meds and accommodation. Straterra is the fucking shit. It makes you feel like a fog is being lifted from your life and has helped me with self-worth and motivation. If you need help accessing testing services lmk and I will walk your through the process. If you live in RI I know a FABULOUS practice, like trulynmarvelous. \n\nGood luck!", "author": "acousticbruises", "created": 1596921638, "upvotes": 1}, "g0tcj61": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0tcj61/", "text": "Can you change/ increase your meds? I wasn't on benzos or buspar pre-pandemic but here we are.", "author": "MercuriousPhantasm", "created": 1596913295, "upvotes": 1}, "g0t30yv": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0t30yv/", "text": "Yep. Pretty common. It’s a global trauma. \n\nTry learning a different way, perhaps by listening while you busy your hands with washing dishes or your feet with walking. Siri will read a paper to you, and I imagine Alexa would, too. If you need some notes, keep a copy of the paper or a notepad nearby.", "author": "OnMyThirdLife", "created": 1596908503, "upvotes": 1}, "g0t2p9s": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0t2p9s/", "text": "Being lost in a stream of thoughts is normal, but not being able to get out of the stream is a problem. One of the things that really helps is, paradoxically, paying even closer attention to those random thoughts. When you do, you will find that they disappear and all you are left with is the ability to focus on whatever you WANT to.\n\nThis is going to sound really trite, but it absolutely helps. The way to train your brain to be able to get out of the stream is to start a daily meditation practice. Meditation and mindfulness are training for your brain to improve your attention span. That's it. \n\nThe one thing this pandemic has left us all with is more time alone. Why not spend that time with trying to improve your mental ability? \n\nI would recommend Sam Harris' app, Waking Up, but there are a bunch out there. Waking up is a pay app, but you can try it for free and if you like it, you can send an email to get a free year.", "author": "Fiacre54", "created": 1596908329, "upvotes": 1}, "g0t1kpx": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0t1kpx/", "text": "I learned about the [Zettelkasten method](https://writingcooperative.com/zettelkasten-how-one-german-scholar-was-so-freakishly-productive-997e4e0ca125) a few months ago, and I can hardly begin to describe how much of a difference it has made in my life. (Seriously, just sift through my post history. I can't sing its praises loudly enough!)", "author": "SquareBottle", "created": 1596907732, "upvotes": 1}, "g0swisl": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0swisl/", "text": "Yeah, I’ve noticed that it’s really hard to pay attention when reading papers compared to doing something more “active” like coding.", "author": "import_FixEverything", "created": 1596905027, "upvotes": 1}, "g0sq4hb": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0sq4hb/", "text": "I am 10000% with you. It's been hugely demoralizing to lose all my motivation and focus. :( No tips from me but kindred spirit.", "author": "magpie2295", "created": 1596901520, "upvotes": 1}, "g0spl4q": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0spl4q/", "text": "...are you me? But seriously, I relate to this so hard. I’m a newly minted candidate, and after the stress of exam prep I can barely bring myself to read a paper a day. It’s been a constant downhill slide in productivity, starting with that panicked increase before my exams in May/June and continuing inexorably downward after that. It feels like my brain is trapped in a fog almost every day—the only thing that clears it up (for a bit) is my ADD meds and a tiny bit of coffee (I’m hypersensitive to caffeine so any more than 4oz of coffee and I’m utterly useless). \n\nAlso, definitely get checked for ADD. I didn’t get diagnosed until after the 1st year of my PhD, when, as another commenter mentioned, all my coping mechanisms failed. Now they’re failing again, but that might not be ADD’s fault.\n\nSidenote: if anyone has a strategy that’s helped them retain motivation / get to work let me know. I had to throw out my almost my entire prospectus and start anew thanks to COVID, and I’m already way behind...", "author": "Putter_Mayhem", "created": 1596901219, "upvotes": 3}, "g0sdpqb": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0sdpqb/", "text": "Going online back in March killed mine. I struggled so much with the papers that I had to write to the point where I completed one in tears about four hours before the deadline because I just hadn’t been able to concentrate on it even though it was on my favourite topic. I had great plans for starting my thesis this summer and haven’t even touched a reading (even though just like you I really want to). We have a draft of the first few sections due in September and I’m now in a panic about that but still can’t focus enough to start it. It’s making me genuinely concerned about how I’m going to perform this year and whether I’ll be able to graduate.", "author": "afern98", "created": 1596894134, "upvotes": 2}, "g0s6ac1": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0s6ac1/", "text": "I've had lasting results from taking a complete break from technology for a day or two. If you can take a weekend off, stick your phone in airplane mode, go somewhere quiet and disengage. I compulsively desire that cheap internet dopamine, but after a day or two outside alone it fades, and I feel much more able to focus on science for some weeks after. \n\nAs regards ADHD or perhaps some autism-spectrum disorder: certainly a reasonable idea, and if you have access to healthcare, try to talk to someone about it. What relationship do you have to stimulants (caffeine, nicotine, etc), if any? You might find it productive to pay close attention to how these frustrating, unfocused thought patterns are affected by clear physical variables like the time of day and what's in your system.", "author": "i8i0", "created": 1596888513, "upvotes": 1}, "g0s3b8g": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0s3b8g/", "text": "Seriously I relate so hard with everything you said that I could have written it myself. Except I didn’t read the whole thing because I lost focus. I submitted the worst piece of work I’ve ever written yesterday, poorly researched, cherry picked, didn’t properly read anything for it. I had plenty of time I just couldn’t focus. \n\nI’m so sorry. I’m hoping I can get a bit of focus back eventually. Don’t beat yourself up.", "author": "Iknowwhatisaw", "created": 1596885750, "upvotes": 2}, "g0s17e3": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0s17e3/", "text": "\"I'm still WFH\"\nActually, you're not working from home. \nYou're at home, during a pandemic, trying to work. It affects everyone differently, and we need to show ourselves a little grace and compassion right now.\nWhat worked for me before the pandemic is not what works for me now. Pre-March, I could work for hours using todoist and pomodoro to power through difficult tasks. Since being at home, I have not found the rhythm I had prior. It's frustrating, yes, but I keep trying. I keep reminding myself that we are not in \"normal times\", and this is not reflective of my \"normal\" self.", "author": "joyfulali", "created": 1596883629, "upvotes": 4}, "g0s10hj": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0s10hj/", "text": "I had a lot of difficulty concentrating pre covid and could not process journal articles for a long time. I thought I had undiagnosed adhd also but it turned out to be good old depression. It is truly painful to go through this and I hope you're not despairing. My therapist gave me very helpful tips and to break down things into very small achievable steps. It's ok to not get through a whole paper a day, it's good enough to just get a small thing done! It can be do just dedicate 15 minutes to read a paragraph and that's good enough. Slowly build up this and you'll start being more used to small tasks and not get too overwhelmed. Wishing you all the best! :)", "author": "whaaaaaaatisthis", "created": 1596883434, "upvotes": 2}, "g0s0yiv": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0s0yiv/", "text": "An explanation my therapist gave me about this very topic:\nWhen we face new stressful situations, our brains try to pull up prior related experiences to attach the new ones to and guide our decisions. But because this is all new territory, our brains are constantly struggling in the background, kind of like a permanent, low-level read error. They can't find anything in our memories to link this new situation to, so there's an underlying frustration plus brain fatigue/fog from constantly trying to find something familiar and comforting but coming up short.", "author": "overcompliKate", "created": 1596883378, "upvotes": 5}, "g0ru18f": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0ru18f/", "text": "Try changing where you read, i had the same problem then i shift my study table elsewhere it helps", "author": "iamtheinfinityman", "created": 1596876132, "upvotes": 2}, "g0ro0go": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0ro0go/", "text": "Anyone want to start a discord group to motivate each other through this?\n\nedit: ok y'all i'm convinced, will update you soon!", "author": "InCoffeeWeTrust", "created": 1596870264, "upvotes": 15}, "g0rntv5": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rntv5/", "text": "Dude, I cannot focus at all anymore. I'm completely burnt out. Even if I took school and work out of the equation, the COVID situation occupies a massive amount of my mental energy. There is so much to grapple with - health risks, financial uncertainty, contentious politics, new ways of life, social isolation, and so many other things. By the time I get to my desk to study for an exam or write a paper, I'm spent. The gravity of everything we're dealing with right now makes all these mindless tasks we normally do in normal life seem completely trivial.", "author": "CyanideMuffins", "created": 1596870097, "upvotes": 4}, "g0rneki": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rneki/", "text": "I'm in the same boat, mate! Even had a extra committee meeting to try to address the problem, but to no avail. What I'm trying to do is to avoid \"zero days\". As little as I can do. Doesn't really matter. Might be reading half a paper or writing a few sentences. Just as long as I've accomplished something by the end of the day!\n\nI think it's more common than we think. Basically all my friends, who're in the middle of their PhD in different countries, are in the same situation - some worse done better. \n\nJust keep swimming!!", "author": "xangreRO", "created": 1596869705, "upvotes": 2}, "g0rieej": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rieej/", "text": "I am so so glad you posted this because I relate 1000%. I think like some comments have mentioned, this is some surfacing ADHD issues that I didn't know I had. I don't have much advice because I'm struggling with it too, but something that I've found a little helpful is stimulating myself as much as possible to keep myself interested while I work-- I bought myself fidget rings and toys that I can absentmindedly move around, I listen to white noise layered under lo-fi, I light candles, etc. I hope things get better and I hope you're able to find what works for you.", "author": "minigumball", "created": 1596865419, "upvotes": 3}, "g0rgup5": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rgup5/", "text": "My attention span is garbage these days as well. Partly I'm dealing with the effects of long term burn-out but the impact of Covid doesn't help. I've had an honest conversation with myself and lowered my expectations drastically. Books that took me 2 days now take me 5 and I'm ok with that as long as my position in the evening is better than what it was in the morning. \n\nPre-Burnout one thing that helped me was an idea I called a \"palate clensor\". Whenever my work got stale I took the day off completely and did something else (video games, movies, napping, pleasure reading) that gave me joy. I'd come back in a good mood and I'd be able to lock back in.", "author": "collapsingrebel", "created": 1596864236, "upvotes": 5}, "g0rgq35": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rgq35/", "text": "Dude. Trust me, you are not alone. Please copy that. This is completely normal. We are all fucked up in one way or another. \n\nI would break down what you want to do with this paper into three parts. Say goodbye to pamodoro for now. 1. What is the problem. 2. What do they do about the problem? 3. What does the results of #2 mean? Getting a big picture idea should be enough. I think doing this alone could mean a lot. Try it and get back to us!", "author": "ozzalot", "created": 1596864139, "upvotes": 5}, "g0rgam5": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rgam5/", "text": "Honestly I had a hard time concentrating on your post... \n\nI think we’re all still adjusting to these very unique times. Or at least I am!", "author": "squornshellous_zeta", "created": 1596863809, "upvotes": 4}, "g0rddl7": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rddl7/", "text": "I’ve got a few months to write a thesis which I’ve barely started due to having nothing to write about as my labs were cancelled. I am feeling the same way, I feel useless and completely hopeless because I don’t have the ability to concentrate like I could at the start of this pandemic. \n\nHowever, I know that I am passionate about what I do, it’s just hard to see that right now, and I’m sure it’s the same for you. We all need to give ourselves a break right now, but do not give up!\n\nI recommend exercise, eating better and drinking more water to help keep your mind clear. But most importantly, remember that this is temporary and don’t be so hard on yourself!", "author": "madmel996", "created": 1596861673, "upvotes": 4}, "g0rcaci": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0rcaci/", "text": "Just wanted to say that you are not the only one.\n\nI was on a roll way back in February. I was as motivated and productive as I've been in grad school. My work was going great and I had a bunch of cool stuff lined up. Then the pandemic hit, I was forced to \"work\" from home, couldn't go into lab, and my motivation took a nosedive. To make matters worse, the fellowship application I was working on and had a good shot at got canceled. I know I was \"working\" from March - June but I literally have nothing to show for that time period and cannot remember for the life of me what I was working on. I completely forgot to schedule my committee meeting and am now considered behind by my committee. Even now, as I'm once again working and actually making progress, I'm doing it because I know I need to be doing it and not because I want to or enjoy it. It's like my motivation hit a wall and it's taking everything I've got to keep going. \n\nOthers on here have talked about mental health, which I know is a serious thing for lots of people, but I know I'm not depressed, anxious, or anything else. Every other part of my life is great, full of motivation, and I'm as happy as ever. Grad school just doesn't feel like a priority anymore and it's been really hard to get back in the mindset that it should be. \n\nHonestly, the best thing I did was sit down with my committee and advisor, admit where I was mentally, and get my ass handed to me for being \"lazy.\" But out of that came a lot of encouragement as well as I realized I'm really not that far away from graduation and what I've already done is pretty cool and I just need to get it done.", "author": "Hereformyhobbies", "created": 1596860904, "upvotes": 5}, "g0r7f7i": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0r7f7i/", "text": "I am also in the same boat. I'm reading a book to review, but..not succeeding as quickly as I should. Something I started to do is to have a separate sheet of paper while I'm reading. Anytime an off-topic non-book thing comes thru my head, I write it down to look at when I've finished my goal for the day, be it a chapter, 10 pages, etc. I put my phone in a different room, computer elsewhere, so I won't just grab it to Google something. I've found that by the time I finish, there's very few things I actually look up or check on.", "author": "FeelinGarfunkelly", "created": 1596857652, "upvotes": 7}, "g0r5lsf": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0r5lsf/", "text": "Oh I relate to hard. Even though my attention span is so crappy that I only skimmed your post. And I do have similar thoughts about why am I not focusing when I know I care, or I think I care about my topic, but...you know, where's the inspiration and motivation. \n\nI think a lot of it comes down to not having more basic needs met. Like on Maslow's hierarchy of needs, completing a grad degree is pretty high up there, near self-actualization. And a lot of my more basic needs are not getting met, especially for love and belonging (because of not having close family and distancing from everyone). So it's hard to focus on those higher up needs.", "author": "academico5000", "created": 1596856536, "upvotes": 84}, "g0r4pfz": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0r4pfz/", "text": "I don’t have any advice because I really relate to this. My attention span was so good during the first two months of quarantine. Up until May I was fine because I still was under my TA assignment so I was in semester mode. After that, it went downhill. I’m slowly getting back to it because I’ve got some assignments related to my lab to finish, but it’s a struggle for me to pay attention or focus at all. I don’t want to rely on caffeine because I’m not doing so well with anxiety so instead I’m just doing as much as I can, then take breaks. I force myself to listen to something- lowfi/jazz/classical music helps me so much.", "author": "fueledbykass1", "created": 1596856016, "upvotes": 7}, "g0qxpa3": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0qxpa3/", "text": "I have 2 suggestions. \n\n1. Get a friend/ fellow student to come over and you explain the journal article to them - you’ll have to re-read and double check during your explanation which should help your understanding enormously. \n\n2. Use an app to reduce your screen time. Its hard but worth it. It really helps with focus after a few days.", "author": "Charlotte_Sometime", "created": 1596851954, "upvotes": 6}, "g0qx4zp": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0qx4zp/", "text": "Yeah I lost a lot my motivation, work ethic, ambition, and high achieving attitude last year when I did not get into a good law school. But this year I got to an  I guess tier 2 ms to reboot my career, network, and hopefully enter a better job market. I’m hoping my life will start turning around and I can start achieving my goals and stop taking advantage of my parents.", "author": "sebthepleb96", "created": 1596851637, "upvotes": 3}, "g0quv7c": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0quv7c/", "text": "Unfortunately I cannot offer much advice, but I can definitely relate to this. My goal is to have my dissertation done by the end of the year and each page is just absolute agony right now. I have it down to writing a chapter a month and I am struggling. Hard. And already behind where I want to be. I dont know what my problem is... I have never struggled to write before with school assignments, but I have developed a really toxic and negative relationship with my dissertation. The sheer amount of stuff I have left to do is SO overwhelming that my brain doesn't want to focus on it and make progress, so I shut down and/or get distracted, and then feel guilty but too overwhelmed to pick it up again. Its miserable and I can only hope that ALL of us grad students struggling with productivity during this crazy time can power through it and catch our stride again.", "author": "TheLadyScientist", "created": 1596850338, "upvotes": 24}, "g0qiki3": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0qiki3/", "text": "I'm struggling with this a lot as well. I was motivated for the first two months of shutdown, because I had my qualifying exam in may, but after that external pressure, it's been really difficult. I've struggled during previous summers as well from lack of structure. Sometimes to keep my mind focused I'll read papers out loud, but that's really the extent of the advice I have, mostly I just empathize.", "author": "MsAggieCoffee", "created": 1596843478, "upvotes": 98}, "g0qhflx": {"link": "/r/GradSchool/comments/i5ogue/my_attention_span_is_gone_help/g0qhflx/", "text": "Yeah hey, as someone with ADHD diagnosed when I was 29, please just get checked out. My family was “shocked” when I was diagnosed, because I was well behaved too. And yet here we are. Anxiety can look like ADHD, ADHD can look like anxiety... It’s a mess. They can make each other worse, and I’m sure you’re stressed from school and however the pandemic is affecting your life. I wish I had some magical advice to you to fix it, but I honestly just said to my bf that I need to go talk to my psychiatrist soon because I am getting very annoyed-stressed. My ADHD is all out of wack right now after being on meds for two years where I was actually okay. I’m sorry. I just wanted to let you know that you aren’t alone though.", "author": "sonja_says", "created": 1596842868, "upvotes": 51}}}