{
  "sid": "qinflp",
  "link": "/r/GradSchool/comments/qinflp/what_is_the_normal_amount_of_time_to_spend_on/",
  "title:": "What is the normal amount of time to spend on school and teaching commitments during a Master's of Science program?",
  "text": "I pretty much always have evenings and weekends free, and am keeping up with my work and getting publications. When I read here it seems like a lot of people have less of a work/life balance. Is it normal for grad students to not have a life outside of school?",
  "author": "Sriracha11235",
  "created": 1635544712,
  "updated": 1635780467,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.81,
  "comments": {
    "hikp00w": {
      "link": "/r/GradSchool/comments/qinflp/what_is_the_normal_amount_of_time_to_spend_on/hikp00w/",
      "text": "im an mhsc student and I struggled hard with work/life balance in my first year. I usually feel guilty when im not working, so that doesnt help. I've learned now in the last 9.5 months of my program to take nights and weekends off. I treat my masters like a 9-5. im in 2 courses, a TA and have a research project. could I be putting in more work? sure. will I sacrifice my mental health to do that work? not anymore.",
      "author": "GoldPlatypus4964",
      "created": 1635547851,
      "upvotes": 3,
      "replies": {}
    },
    "hikin09": {
      "link": "/r/GradSchool/comments/qinflp/what_is_the_normal_amount_of_time_to_spend_on/hikin09/",
      "text": "You need to separate phd and ma students. Doing my fully funded ma, i went out almost every night, hung out, played in touring bands and finished my m.a thesis (150 pages) before my deadline.\nI got accepted to a good u.s university for a phd and that all went out the window. I'm working nine to eleven hours a day, every day including weekends, and i can hardly keep up with both teaching 50 students, taking 3 courses, and working towards my phd. \nNothing, and i mean nothing, gets you ready for phd experience, it's like going from little league straight to a top tier team.",
      "author": "Massive_Lion_5244",
      "created": 1635545052,
      "upvotes": 2,
      "replies": {
        "hikiv9c": {
          "link": "/r/GradSchool/comments/qinflp/what_is_the_normal_amount_of_time_to_spend_on/hikiv9c/",
          "text": "How many students did you have and how many courses did you take as a masters student?",
          "author": "Sriracha11235",
          "created": 1635545151,
          "upvotes": 1,
          "replies": {
            "hiknww5": {
              "link": "/r/GradSchool/comments/qinflp/what_is_the_normal_amount_of_time_to_spend_on/hiknww5/",
              "text": "Maybe 15 students at a time (taught digital research for the humanities) and 3 courses per semester",
              "author": "Massive_Lion_5244",
              "created": 1635547365,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hiloqpp": {
      "link": "/r/GradSchool/comments/qinflp/what_is_the_normal_amount_of_time_to_spend_on/hiloqpp/",
      "text": "I just finished my masters and what I can say is: it depends. Some semesters I felt like I was drowning, especially if I was teaching something brand new that I was ill equipped to teach. Other semesters I felt guilty because after a few hours of work I was pretty much good for the week. In a MS program, you will have ebbs and flows as you finish up one stage, wait for edits, reach points in teaching where students are working on finals/projects/etc. \n\nI’ve just started a PhD at another university and I can say it’s similar here. I have little free time, but my teaching requirement is for a brand new class that we’re developing as we go. My research comes in pockets of productivity. My biggest advice is if you’re meeting your expectations and your PI and committee agree, don’t sweat it.",
      "author": "swampcoyote",
      "created": 1635565339,
      "upvotes": 1,
      "replies": {}
    },
    "hinh7b5": {
      "link": "/r/GradSchool/comments/qinflp/what_is_the_normal_amount_of_time_to_spend_on/hinh7b5/",
      "text": "My personal total commitment is about 40 hours a week (4 classes + thesis + RA).  I'm on campus from about 8-5 M-F with a few breaks and otherwise I don't think about school or work.  From what I've seen about how long my classmates tend to take on homework (one professor collects and publishes the statistics), the average total commitment with a 20-hour RA contract would be about 50-60 hours a week.\n\nFrom what I've heard from other students, I think the major factor throwing that off is that not all advisors actually care that that RA contract is for 20 hours.  I get the impression that a lot of students are required to do a *lot* more research work than they're actually paid for.\n\nI know that everyone in my advisor's group has a reasonable work-life balance (PhD and MS both), which I think lends credence to that idea.",
      "author": "djp_hydro",
      "created": 1635607370,
      "upvotes": 1,
      "replies": {}
    }
  }
}