{"sid": "npuv43", "link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/", "title:": "Anyone else feel like they definitely dont do a full 40 hours of work a week, let alone the 70+ everyone seems to complain about?", "text": "Maybe it's just because I'm in a masters and not a PhD (although I feel like I have most of the same requirements as our phd program just condensed into a shorter period of time to get it all done) but while grad school is difficult in many ways it's definitely not killing me with the work load. \n\nI'm fully funded so I dont have any additional TA responsibilities, and I only need to take 2 courses a semester to graduate, none of which have given me a huge workload and when they do it's just lots of reading. This is a fairly reputable stem program too and some of the classes have been pretty difficult but that doesnt inherently correlate to time consuming\n\nMy research at the moment is all computer modeling, which I do on my own time from home. Besides the fact that I simply would not be capable of spending 8 straight hours coding, it's also not usually beneficial to do that. If I'm stuck on a line of code I solve it way faster by giving myself a break for the rest of the day and looking at it again tomorrow. Then once I get something to work I usually have to test run it before I can move on, which can take an entire day\n\nI'm not trying to brag here because honestly it bothers me. With school being wfh right now I feel restless and bored a lot of the time and also it makes me feel sort of guilty and anxious that I barely pull 30 hours a week when I'm being paid as a full time employee. And makes me wonder if I'm not getting enough out of the experience. My tuition is funded but I'm still paying a few thousand a year in school fees to be here. \n\nIs it just that I'm doing a different line of work that maybe requires more focus and brain power but less actual time? Or should I be concerned that I'm not doing enough and gaining enough experience if I'm not feeling overworked?", "author": "bi_smuth", "created": 1622556488, "retrieved": 1632953368, "over_18": false, "upvotes": 523, "upvote_ratio": 0.95, "comments": {"h0ezkoy": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0ezkoy/", "text": "Yes. I'm in STEM but my work is so computer based, no lab work, so it's all basically reading and writing and finding / working with data that already exists. I just cannot do more than 5 hours a day, my brain just does not seem to have that capacity. It's usually 3 hours a day (intense mental health issues). I'm not making good progress. It sucks. I kind of wish I had tasks to do that took time but not a ton of brain power just so I could feel productive in some way.", "author": "yesnomaybeohno", "created": 1622707941, "upvotes": 1}, "h0dduqq": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0dduqq/", "text": "My PhD experience was a lot of creative work, not much repetitive work. I worked about 30-40 hrs per week, any more than that I would lose inspiration - that could be the time to do more repetitive tasks. I graduated in 4 years, record time for my program. \n\nYou can always find more work to do, just try to make sure it's meaningful and not burning you out.", "author": "PeaceAndPrajna", "created": 1622673946, "upvotes": 1}, "h0cz6rf": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0cz6rf/", "text": "Yup, my work is very ebb and flow, I'll have a few months of collecting a lot of data for my first-authorship projects  where I'll work longish days but still probably not more than 50 hours a week, and then a few months where I'm coding and analyzing and occasionally helping with other students' projects for co-authorship and thus probably same boat of clocking 20-30 hours. I'm a postdoc now so no TA responsibilities, when I was TAing I was more likely to be putting in 40-60 hours (TAship and research/writing combined) a week depending on the class and my responsibilities around it. \n\n&#x200B;\n\nI do human subjects research most of the time, so when I am conducting experiments they are mostly within reasonable hours because consumers don't want to come in at 2am to taste and evaluate products. Sometimes weekends, but rarely ever evenings.", "author": "prettyorganic", "created": 1622667278, "upvotes": 1}, "h0bib2i": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0bib2i/", "text": "It comes a goes for sure, but it also mostly feels like I'm doing under 40 hours a week (AeroEng PhD). I think it's a combination of overestimation of time put in and poor time management skills.\n\nEdit: except for maybe chem or bio people. They just get shafted by live samples at weird hours.", "author": "HohmannTransferred", "created": 1622645479, "upvotes": 1}, "h0aarso": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0aarso/", "text": "[deleted]", "author": null, "created": 1622615262, "upvotes": 1}, "h0a7vwo": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0a7vwo/", "text": "I do computational physics. 90% of my research is running code and analyzing the data. I do \\*not\\* require a full 40 hours to do that. \n\nI also \\*can't\\* do that all the time because you need to run it on the supercomputing cluster, and you have to actually request run time in advance for that so that the machine doesn't crash running several different huge programs at once.", "author": "DoctorWatchamacallit", "created": 1622613031, "upvotes": 1}, "h0a33s8": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0a33s8/", "text": "The 70+ numbers are probably 1) sporadic and/or 2) perceived rather than objective/clocked in time. Thing with knowledge creation work is that the project lives in your head pretty much 24/7 if you let it, no? There's always more papers to read to improve, more proposals to write for funding, always a better way to write that paragraph, etc. Some people in this area are good at compartmentalizing, others get flashes of inspiration at 7:30pm so they feel like they're 'working' even as they're having dinner with the SO.", "author": "gergasi", "created": 1622609684, "upvotes": 1}, "h0a285g": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0a285g/", "text": "I do 80+ hours of research per week. It's mainly because I did not really take publications seriously in my Masters. If I did at least 3-4 publications in my Masters, perhaps I wouldn't be doing these long hours now haha.... I need to graduate with quite a few publications so it comes without saying that I need the 80+ hours. I do not have a research team to work on any of my papers, so all my papers will be first author.\n\nAlso, I teach part time. I also attend at least one conference a month online. Teaching, grading, watching improvement videos (about software etc), writing a dissertation, having meeting with supervisors, preparing for these meetings, reading on latest updates in my area, responding to paper reviews and drafting papers is more time-consuming that one would think. \n\nI do not promote neither recommend these work hours to anyone out there. How long you do research will depend on what you want during your graduation. Some are happy with 2-3 publications or even just have a dissertation and that's perfectly fine. Do what makes you happy and feel fulfilled. It really is goal-dependent and field-dependent. I am in social science and doing all this with just 30 hours is absolutely not possible without major delays.", "author": "givemeyourdonut", "created": 1622609121, "upvotes": 2}, "h09n02d": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h09n02d/", "text": "Like others said, efficiency is key! A friend of mine takes 90 minutes to read a 4 page journal article, that’s not efficient, and she says she is tired of working over 50 hours a week. I don’t work over 40 hours and don’t take that long to read an article", "author": "Redd889", "created": 1622600783, "upvotes": 1}, "h09bs1d": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h09bs1d/", "text": "I work full time as staff and I'm doing my PhD (at the same institution where I work) and I rarely feel like I put in a full \"real\" 40 hours a week between the two even. I still have a lot of down time. Part of this is because I can say no because my funding isn't tied to my advisor (which leads to some tension) and I publish and present as part of my job. I'm sure lots of programs are different but the 70+ week seems to be exaggerating a lot of times (not all).\n\nEdit to add: I'm epidemiology", "author": "EpiJade", "created": 1622594960, "upvotes": 1}, "h09bdor": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h09bdor/", "text": "STEM PhD student - my experience has been that it's heavily lab dependent. COVID has changed the math a bit but I definitely don't pull super long weeks unless a conference or something is coming up, and I don't feel pressured to do so. I'd say... 30 hours on average, but COVID has sent my productivity in to major spikes and dips.\n\nOTOH, I know others in my department who almost literally live in their lab/office.", "author": "VortexLine", "created": 1622594752, "upvotes": 1}, "h0998oo": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0998oo/", "text": "I did my phd working around 40 hrs a week.  People who say they work 70 are spending half of it socializing or fucking around on the computer.  If you do your work efficiently you can use less time.", "author": "Midnight2012", "created": 1622593648, "upvotes": 1}, "h096160": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h096160/", "text": "I worked 2 jobs since my masters to equal 20 hours a week not including weekends while in my PhD. 20 from my grant I’m funded by the NCI and 20 at dhec. I’m in epidemiology. Additionally I had to go to class and do homework study etc. I agree even with all that I’m managing it. Idk if it’s just strong mental fortitude, I’m bat shit crazy or what. But as a graduate student I expect to work my tail off as that’s what we do. And I do all this cause I’m trying to avoid more loans on top of the 85k including interest that I have from masters and bachelors and tech school in between to get in. So yea I guess it’s that’s heavy experimental lab sciences. Cause even for my grant we hired data collectors so I don’t have to do that, I just work with the Data bases and data processing as it comes in.", "author": "Jasquirtin", "created": 1622591990, "upvotes": 1}, "h095nzl": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h095nzl/", "text": "I don't think I put in many 40 hour work weeks the last 6 years in my PhD program. Maybe when I was working research assistantships for professors in different departments or even a different university, but most of that work was pretty mindless/menial and just happened to be time-consuming. My first year TA-ship was for a course that required me to do a LOT of grading of a LOT of papers, and I probably ended up spending more time on trying to meet the grading deadline than on coursework. Still, I don't know if I even was working 40 hours then. Getting a cushy fellowship for 3 years that freed me up from TAing or RAing for funding helped me cut back my hours a lot so I could focus on finishing coursework and publishing.\n\nIt's only since beginning my dissertation research (ethnography + long af interviews + fielding a survey) that I've really worked full 8+ hour days, almost daily, but I give myself a weekday off to de-stress, catch up on other work, and prevent myself from totally burning out. I guess that means I do work a bit on my \"day off,\" but at least taking the day off from fieldwork or doing interviews helps give me more time to tend to my own needs so I can continue moving forward with my research since it really does require me to be \"all in\" and is pretty tiring, although I really do enjoy it (usually). \n\nI'm in the social sciences though, so maybe it is just a STEM vs. social sciences/humanities thing.", "author": "vapemistake", "created": 1622591803, "upvotes": 1}, "h093yz7": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h093yz7/", "text": "Im in experimental physics. I just want to throw in that while I do work those kinds of hours sometimes, it is normally in order to afford more time for something else later, or to meet a deadline of some sort.\n\nI don't need to do 70+ hours every week.. I normally do 30-40 hours with a few heavy weeks sprinkled in.", "author": "Lord_Blackthorn", "created": 1622590937, "upvotes": 2}, "h091zrr": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h091zrr/", "text": "I feel the same, and I'm constantly worried I'm not putting in enough time or work. All my work is modeling and writing, but I struggle to focus from home", "author": "Hickiebenz", "created": 1622589920, "upvotes": 1}, "h08y8jb": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08y8jb/", "text": "I easily pulled 60 hours during my MA in Counseling; the clinical hour requurements were just exhausting. In my Humanities PhD program, 40 hours was the norm, but now that I'm in dissertation, I'm the one deciding how much time I want to devote.", "author": "MatthewHWood", "created": 1622588030, "upvotes": 1}, "h08y609": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08y609/", "text": "It depends a lot on your advisor. If they compressed the timelines you would work more hours to meet the new deadlines. Grad students are generally very bad at pushing back on unrealistic deadlines and this causes a lot of crazy workloads. Likewise grad students are also bad at making deadlines tighter if they are given too much time.\n\nThe work life balance part is nice but the downside is you get less done in your degree. I'm not saying 70 hours is optimal but barely pulling 30 may cause you to produce one less or a much lower quality publication.", "author": "entropyStable", "created": 1622587995, "upvotes": 2}, "h08w6om": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08w6om/", "text": "I agree with exactly what you said!\n\nI have a TA job that says to be 20 hours workload but actually I only took max ten hours to finish it and I feel it’s what I spent most of time on. \n\nYeah coursework are hard but I always manage to get As.\n\nI hope I could have more advance on my research about limnology modelling, but I was being a bit lazy and I feel so guilty, especially when comparing to other grad students who does solid lab work", "author": "tongyaop", "created": 1622587020, "upvotes": 1}, "h08teph": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08teph/", "text": "Lots of good answers here but I think you've basically already answered your question- you aren't TAing and are only taking two classes. \n\nI'm also in my masters and am also taking two classes, but I also work full time. This workload is super manageable. It'd be very different in I had to teach or go to a lab in person.", "author": "NY_VC", "created": 1622585655, "upvotes": 4}, "h08tbe1": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08tbe1/", "text": "Calculate your stipend per hour then only work at an acceptable hourly rate for you. Sometimes working 40 hours a week on the offered stipend means making less than minimum wage, that was unacceptable to me so I didn't work those hours. \"you are here for an education\" is bullshit when the classes they made you take were basically check boxes where everyone gets a B for showing up practically, and you haven't taken one in years, and are doing the exact same things as the lab technician also with a B.S. who makes more than you, or the exact same things as the teaching professor with an M.S. (that you can get instantly if you pass quals or the coursework and immediately quit at some programs) making even more than that. \n\nIt's shameful how colleges pay their grad student workers. In some cities rents have doubled in 10 years and stipends have remained flat, so you are effectively making less money than when you started despite being more senior and relied upon, and a whole lot less than if you lucked out and were born 10 years earlier and came to school when rents were lower.", "author": "bigvenusaurguy", "created": 1622585611, "upvotes": 3}, "h08rmor": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08rmor/", "text": "I sure don’t get paid that’s for true", "author": "JoOddityArt5", "created": 1622584798, "upvotes": 1}, "h08ntem": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08ntem/", "text": "Are there any econ PhDs here? What are you all doing?", "author": "ArguablyCanadian", "created": 1622583011, "upvotes": 1}, "h08ncok": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08ncok/", "text": "I barely do 4 hours of work a week :/", "author": "academic96", "created": 1622582788, "upvotes": 2}, "h08m671": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08m671/", "text": "TAships eat time for lunch, that's why profs have 5+ for big classes. Count yourself lucky, though it kind of sucks you're not getting the experience of being in the classroom teaching imo.", "author": "TranscendentalObject", "created": 1622582243, "upvotes": 2}, "h08lzef": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08lzef/", "text": "Dang, it sounds like your program has you set up for work-life balance and success. Can't speak for \\*all\\* others but I'm sure it's a spectrum of hours and a spectrum of truth. I self-monitor my productivity hours and average about 72 hours a week of school/lab work. My best week so far was about 55 when I took two days off for family time. I do 20 hours of lab for my funding, about 20-30 hours in classes and doing class work, 5-10 hours in a clinical experience, and 5-10 hours of volunteer research. Some other people in my program have non-service fellowships so their weeks are automatically 20+ hours a week less, so don't be worried about under-working, it all depends on people and programs. Good luck with yours!", "author": "strayam8ey", "created": 1622582156, "upvotes": 1}, "h08kt2q": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08kt2q/", "text": "I feel you. I'm doing an MSc, engineering work researching soft robotics. I struggle with motivation and only do about 1-2 days of work a week. I constantly feel guilt and imposter syndrome because I feel like i'm never doing enough. But at the same time progress is going well and my supervisor seems happy? It doesnt help that a lot of my hands on work is perpetually on hiatus because of covid.\n\nAnyone else feel like this?", "author": "Th3DarkFunk", "created": 1622581613, "upvotes": 8}, "h08k9li": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08k9li/", "text": "Im in machine learning, the maximum I have ever worked is 35-40 hours on very heavy weeks before conferences. I published 9 papers during my PhD, 4 of them in top tier ml conferences.\n\nDuring my last publication run, I was doing 40 hours of proper work a week for 2 consecutive months qnd that almost killed me (heart problems), I dont know how people claim to do 60 hours+ for extended periods of time during their PhD.", "author": "Salthearth", "created": 1622581364, "upvotes": 1}, "h08iu4b": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08iu4b/", "text": "There’s an observation bias in that those likely to spend 70+ a week (in non-stem especially) are also likely those who are anxious enough to post about how they have to work so many hours.\n\nConsider that people struggling with their project, conceptually or empirically, are going to spend most of their waking lives thinking and working on the project - and therefore they will feel as if they have no life balance and that the PhD or a graduate degree by virtue REQUIRES this amount of time. \n\nIt may not be that the degree REQUIRES this amount of time, rather the person requires this amount of time to be comfortable with their contributions. \n\nThe real time suck and variance of a degree is less in the actual formal requirements and more in the personal / mental dynamics of being left entirely alone to submit a completed and well-written and argued project that will satisfy standards that aren’t known in advance. \n\nIt’s why you see the SAME people who got blanket A+ on papers that were written in one night spend six years writing a dissertation. \n\nThat’s obviously putting aside measurement bias / variance in the fact that “working” to some isn’t actually always writing, so some people measure “working” differently - thinking about the project, teaching, doing abstracts, presentations, conferences, administrative duties, and the like.", "author": "doctorpolitik", "created": 1622580706, "upvotes": 3}, "h08h1zk": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08h1zk/", "text": "I’m in STEM and I do work a lot but honestly, I work about 40-50 hours a week. Idk how people are clocking in at 70 hours a week. As people have mentioned earlier I think that there is a difference from spending time in the lab vs actually doing stuff and being productive in the lab. Yes, some people may be there for 70 hours a week, but how much of that time is actually dedicated to lab work? I think once you learn how to multitask and run multiple experiments together you can cut that time down significantly.\n\nIt is a lot of time and takes up a lot of mental space but I still have most of my weekends and can still relax and socialize just fine.", "author": "prsguitarplayer", "created": 1622579880, "upvotes": 2}, "h08c78w": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h08c78w/", "text": "I think I worked around 10 hours max during my Master's (Humanities) directly on my thesis, and some 20-25 hours for my TAship every week.", "author": "astgho", "created": 1622577650, "upvotes": 1}, "h089kkp": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h089kkp/", "text": "I’m a masters in public policy student with a focus on public management. Granted mine is a professional degree so I have zero research requirement, so my weeks are very very very tame.", "author": "Nandredor", "created": 1622576450, "upvotes": 1}, "h085wxd": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h085wxd/", "text": "I did a psych program and probably worked 60 hour weeks at my heaviest workload (when I wasn't even taking classes). About 15 hours of that work was the TA and the rest was my clinical practice (therapy and diagnostic cases). I would say though that I worked substantially more hours that my friends in some other programs. I would say overall in my program, I probably worked 40-50 hours per week.", "author": "robotscantrecaptcha", "created": 1622574765, "upvotes": 4}, "h085bxs": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h085bxs/", "text": "Having no TA responsibilities is definitely why you feel this. I am in a funded MA but our funding is connected to TAing -- if I were only doing coursework it would feel pretty manageable, it's the extra work of constant teaching, prep, grading, etc. that pushes me over the edge into working 7 days / week.", "author": null, "created": 1622574502, "upvotes": 20}, "h0814sv": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h0814sv/", "text": "[deleted]", "author": null, "created": 1622572661, "upvotes": 35}, "h07z62j": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07z62j/", "text": "Depends on where you're at in course of your PhD or even if you're up against deadlines. I've had some weeks where it's 30ish, some weeks where it's 60ish. Varies wildly. Before COVID it was much more the latter, but when things initially reopened, and the vibe was to only be in the lab as long as you needed to be there for actually work, I got very efficient with my time, and currently my weeks are much more like 40 hours or even less. I know there are times where it will ramp back up, but I also know that there's no reason for me to be here longer than I need to be so long as my PI continues to view my progress as satisfactory.", "author": "nickyfrags69", "created": 1622571810, "upvotes": 2}, "h07yrr2": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07yrr2/", "text": "Speaking for myself, last semester I was pulling 60-70+ hour weeks because I was TAing four classes, taking 3 graduate level math courses, and working on my thesis, all while my health took a nosedive and I didn't take a break. But I found I was more stressed at the amount of work I had to do rather than the work on its own. It felt I was swamped with work and I couldn't focus on one thing at a time. \n\nWhen I was in undergrad, I thought that doing 70+ was a given and it was \"a badge of working hard.\" Most if not all the professors I have had contact with also talk about how it's good that a student puts in this much work. But in reality, forcing oneself to work for that long is a terrible idea (for what I do). \n\n\"Is it just that I'm doing a different line of work that maybe requires more focus and brain power but less actual time?\" Maybe. But if it's working for you and you're getting good results, keep doing it. Don't feel obligated to increase time spent on working and forcing yourself to do more unnecessary work. Feeling overwhelmed and overworked for long periods of time can erode your well-being. \n\nIn other words, \"if it ain't broken, don't fix it\".", "author": "datdestructor", "created": 1622571637, "upvotes": 17}, "h07ybbc": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07ybbc/", "text": "I’m also in a STEM masters, and I get no where near the 70+ hours I hear people talking about. I’m honestly a little concerned by the lack of work I do on a weekly basis. I usually call my friends (who work full time office jobs, from home) just because I like to simulate the environment of a library or something (lockdowns been hard on me), they easily work 9-5 on a weekday where I’m working more 10-4 ish, maybe less depending on the day. However I do work a few extra hours too on my weekends or sometimes in the evening. But I can’t claim I’m working effectively for any of this, since I do get distracted with social media, like I am now for example. \n\nLike you, I can’t write code all day, but I’m also writing and reading too. Throw in some meetings. I did TA and take 2 classes a semester during the school year so honestly I was a little more busy then, but no where near 70 hours. Honestly it fluctuates a lot based on the week. I also have time to work another small job (passion project, if you will) and save at least 6 or 7 hours a week for my hobby. \n\nBut yeah I’m with you I feel terrible about making money for when I’m supposed to be working 9-5 and I usually don’t. Usually I get everything I set out to do in my week done within the week, but sometimes I get stuck on something and it takes me longer than expected. My supervisor has never commented that I’m behind, and I don’t feel like I’m behind, but I constantly feel guilty for not working hard enough. Mainly I feel like my work isn’t always reaching the standard I like. \n\nI know that part of it is the pandemic because I’m very externally motivated and need the social pressure of a group setting to not procrastinate. When I’m home, as soon as something doesn’t go as planned (weird code error, can’t figure out how to explain what I am trying to write) I can always convince myself to do it later (since I work at home and I’m always home). I miss the urgency of “can’t go home until I’ve done this step”. \n\nSo yeah we are in the same boat. But I can’t offer any advice to make you feel better!", "author": "vpsass", "created": 1622571439, "upvotes": 12}, "h07woap": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07woap/", "text": "Yep. Experimental STEM PhD at an R1, averaged about 35 hrs/week the first 4 years, now at about 45 as I race to finish up in 4 years, 11 months. If you're disciplined to get at least 70% productive time, lucky enough to have a good advisor, and work smart, it's fine.\n\nMight not get you that Nature paper, but there's more to life.", "author": "artachshasta", "created": 1622570710, "upvotes": 12}, "h07vi71": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07vi71/", "text": "Ecology PhD student here. Field days are busy and some lab days are busy, but I ultimately have free rein over my schedule and lab. My PI is a dean, so he's always busy, and I'm the only student in the lab. I designed and am implementing my dissertation, so I just work when I want. Sometimes I work full weeks, but if I'm working efficiently, I feel like I only work a few hours a day. I was the only student in my master's lab too, so I really have no idea what the norms and expectations are since I've always done everything solo.", "author": "PancakesandMaggots", "created": 1622570192, "upvotes": 2}, "h07u6y5": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07u6y5/", "text": "Okay I'm in STEM PhD. Particularly ECE, on algorithms side. It's mostly 3-4 hours of work per day.\n\nThe only time I have to put in a extra time is when I have simulations or working on a new project idea. Then you are working on hyperparameters or the idea all day.\n\nBut there are people who genuinely put 40+ hours. But these are very high achievers or people who slacked off/ got unlucky in first few years.", "author": "invoker96_", "created": 1622569622, "upvotes": 15}, "h07tt5t": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07tt5t/", "text": "Same for me, I'm in bioinformatics (pdh) and only rarely hit more than 35 hours. Usually I'm between 25 and 30 hours a week (actually working, I track it with clockify - for any small break I put it off). Often I just have to write a piece of code and let it run. I should probably be doing more reading though on the side.", "author": "whalewhalewhale8", "created": 1622569456, "upvotes": 13}, "h07tgzz": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07tgzz/", "text": "[deleted]", "author": null, "created": 1622569306, "upvotes": -7}, "h07qpsg": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07qpsg/", "text": "There's a post about this topic that's interesting and I can find it if anyone is interested. Basically most people are only productive a couple of hours a day and the most productive 10% work 6 hours a day. This was for office jobs but I imagine it's similar to grad school. 40 hour weeks are BS for most jobs especially if they require a lot of mental energy.", "author": "Banana_Skirt", "created": 1622568121, "upvotes": 16}, "h07p4qh": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07p4qh/", "text": "Two classes per semester seems like a light load, and not having to TA or RA takes 20 hours off your load per week (if not more). So that all adds up.\n\nDuring my masters, I worked about 30 hours per week at my job, and probably about 30 hours per week at grad school.", "author": "HouseNegative9428", "created": 1622567420, "upvotes": 43}, "h07nsja": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07nsja/", "text": "I'm in humanities doing a masters and have the same thing - I think part of it compared to friends in STEM is that not having lab work etc. changes expectations. I also have course mates who will take any opportunity to tell you they're pulling 60+ hour weeks and working SO SO HARD. I did 40 at the start of the year and am honestly now plodding along quite happily at around 25 and am on track to finish my thesis ahead of the final deadline. Big part of it is hours actually worked, not hours sat at a desk. I'm a very big believer in not overloading/burning out and it being more efficient to plan five hours actual work than claim to have done ten. \n\nMy theory is part of it stems from the kind of people who wind up in graduate school. We're pretty exclusively nerds to some degree at this point. I wonder how many of my classmates were *that kid* in the year who used to sit outside the exam hall and base a degree of their personality on the fact that they'd studied the most/least/were the most stressed you could *possibly be*. Alternatively, how many were the similar kid who placed a horrendous amount of self worth on grades/academic success and as a result held themselves to often pointlessly high standards.  Most on my coursemates are dead set on academia, whereas I'm taking a job completely unrelated to the masters next year, so i'm quite detached from it all. I see a hell of a lot of anxious perfectionists who are:\n\na. working inefficiently (either because they're burnt out, or that part of them seems to genuinely gain satisfaction from the idea that they're doing more hours than you)\n\nb.sitting at a desk for 10 hours because part of them feels like they *need* to be the one who worked the hardest. \n\nc. have actual commitments (I'm also funded and not having to TA, so I don't want to make too many generalisations as I only know the financial situation of \\~1/3 of my coursemates)", "author": "Amazing-Ad-4364", "created": 1622566834, "upvotes": 45}, "h07mgi7": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07mgi7/", "text": "STEM PhD/Postdoc.\n\nAs someone else said, it's very likely all the 70+ hr weeks are from STEM folks. I know as a science postdoc I regularly work 40+ hr weeks. That work can mean anything from actually setting up and doing experiments to moments where I'm done for the day and my brain is fried but my boss wants me to stay until after 5.  \n\nThe healthy thing is to say \"however long it takes to get my work done, as long as it gets done, is how much I work.\" The other health mindset is to say \"whatever I get done within this amount of time is what I do for the day.\" Both will help you get through the high stress periods, but yes, it is also normal to not work the full 40hrs or even the torturous 50+hrs.", "author": "Meaningfulgibberish", "created": 1622566263, "upvotes": 101}, "h07lpy9": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07lpy9/", "text": "I'm probably 30-35 on a normal week, and 50-60 very occasionally (a week or two every 6 months) when something is urgent. In mathematical genetics", "author": "Monsteriah", "created": 1622565947, "upvotes": 57}, "h07colx": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07colx/", "text": "I had one semester like that when I was waiting to do my testing for research. But for the last year I work at least 8 hours a day, seven days a week. Usually til like 3 am. I’m in stem so my research/modeling takes forever.", "author": "sylphrena83", "created": 1622562027, "upvotes": 16}, "h073aju": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h073aju/", "text": "A lot of people say they work 70+ hours and actually work 50 or less. Their time actually being productive is probably 50-75% of that time if that. So work how much you want as long as you’re meeting your goals for yourself and not burning out.", "author": "fserv11", "created": 1622557747, "upvotes": 152}, "h07219d": {"link": "/r/GradSchool/comments/npuv43/anyone_else_feel_like_they_definitely_dont_do_a/h07219d/", "text": "I think a lot of people clocking 70+ hour work weeks are going to be in STEM working on some time consuming experimental work. I’m a humanities PhD, fully funded, with TA work, and I put in 30 hours on a heavy week. Part of it comes down to how efficient you are with your time I think, but it will largely be program dependent.", "author": "ASAPLATTE", "created": 1622557160, "upvotes": 352}}}