{
  "sid": "lrazsk",
  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/",
  "title:": "Confessions: The antidote to imposter syndrome?",
  "text": "In a [recent discussion](https://www.reddit.com/r/GradSchool/comments/lqm4a3/do_you_actually_read_all_the_literature_youre/) about not fully reading every paper, a lot of people expressed relief at finding out they're not the only person who does that.\n\nI wonder how many of the other parts of imposter syndrome could melt away if we just talked about them like this.\n\nI'll get us started:\n\n> My sleep schedule varies widely and I sometimes do not get up until after 1 PM. I also sometimes multitask in meetings and seminars (especially if there’s a PowerPoint presentation involved), forget about paperwork until after it is due, and sometimes if I’m talking to someone and I mention a paper I read a while ago I’m vague or I misremember details and get them wrong.\n>\n> I also procrastinate, don’t know how to network, don’t keep my LinkedIn updated, am not part of academic Twitter, am slow about checking and answering my email, and am afraid of admitting that I don’t know something and asking for help because I think everyone else must already know it and I’m ashamed to admit that I don’t.\n\nOK, I've shown you mine... your turn! (Please?)\n\nOh, and one more confession: I am no longer a crappy grad student. I graduated last year and am now a crappy postdoc.",
  "author": "tentkeys",
  "created": 1614167417,
  "over_18": false,
  "upvotes": 692,
  "upvote_ratio": 0.99,
  "comments": {
    "gqjn8bi": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gqjn8bi/",
      "text": "I'm about two months away from graduating and my sole responsibility right now is completing my thesis in wildlife management and conservation. I spend most of my time pole dancing and sometimes I fantasize about never having gone to grad school. A universe where I became a stripper instead, saved up some money, and then just opened my own pole and aerial acrobatics studio. *Sigh*",
      "author": "sandsnek1",
      "created": 1615446445,
      "upvotes": 1,
      "replies": {}
    },
    "gpj537b": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gpj537b/",
      "text": "Hey I actually have a question. Impostor syndrom would be the fact that I get good results but I think I'm a fraud cause I don't actually work that much, right?\n\nCause I kinda get the opposite effect. I get the best grades while procrastinating and working much less than I should and if anything this inflates my ego.",
      "author": "Viecce",
      "created": 1614778331,
      "upvotes": 2,
      "replies": {}
    },
    "gop1b8r": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gop1b8r/",
      "text": "Here I go!\n\nI multi task during zoom lessons to get more work done. I raise my hand to answer questions just to look like I participate. \n\n\nI don't care about my research- I am just trying to get my degree and get out- I prefer working outside of academia by....ALOT. \n\n\nI majorly messed up my research assignment. I feel so naive that I thought I could finish my project on my schools deadline.  I am taking my project to a non-profit to finish it. \n\n\nSee above*. I now have two research projects I don't care about. \n\n\nI am scared of my professor. I cried in a meeting with them. \n\n\nI failed all of my testing comps. By the smallest margin. I know how to do it- my anxiety around this issue is enormous. I am administering the tests to myself because I need to pass, or I am out of the program. \n\n\nI edited this post too many times to not seem stupid in this sub.",
      "author": "Euneiphreniae",
      "created": 1614253160,
      "upvotes": 5,
      "replies": {}
    },
    "gooeinp": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gooeinp/",
      "text": "• I don’t have statistics experience yet, so I never read the results section of papers. I just jump straight to the discussion, 100% of the time. \n\n• I never bother to look at graphs or figures. \n\n• On Zoom University (I know grad school as no different currently bc I’m in my first year) I often go to extracurricular colloquia, etc, but only to show my name. I turn my mic and camera off and often don’t pay attention to the speaker. \n\n• I’m in a weekly reading group with members of the department and my committee and fellow lab mates, and I almost never read the papers for the weekly discussion (but I guess it’s bc I am busy with other stuff for classes, etc). I don’t know if the others read every week or not. \n\nI think when we’re returned to in-person classes, I will be more attentive in extracurricular meetings bc I won’t have the ability to turn off a camera and fuck around on my phone. If I attend, I necessarily have to pay attention. \n\nIn undergrad I would stay up to the wee hours studying and I would read every article, every chapter, etc. Now, I choose sleep. I cook myself a real meal and I take the time to enjoy it. Sometimes I’ll stay up until 2 AM, sure, but I’m certainly not working until 2 AM even if I could be. I’m on Reddit or something.\n\nOh, also, I am on academic twitter and it’s a literal waste of time. So to the people here confessing that they aren’t on academic twitter — don’t feel like an imposter about this. I could have gone my whole life without ever reactivating my twitter, but my advisor suggest I create an academic account. \n\nI literally only go on Twitter to waste time when I’ve circled through all other, better apps and networks. And everyone on academic twitter is performative and fake as hell. It actually irritates me.",
      "author": "momhasbipolar",
      "created": 1614233208,
      "upvotes": 3,
      "replies": {}
    },
    "good733": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/good733/",
      "text": "I don’t know the names of any of the Nobel laureates",
      "author": "rukwitme",
      "created": 1614232273,
      "upvotes": 2,
      "replies": {}
    },
    "goo5yas": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goo5yas/",
      "text": "I’m working on my prospectus and spend way too many hours playing a video game. My evenings are for me, if it didn’t happen during the day, it sure isn’t happening after dinner. I also sleep in most days.",
      "author": "dawnfae",
      "created": 1614227688,
      "upvotes": 3,
      "replies": {}
    },
    "goo39z0": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goo39z0/",
      "text": "I spend most of my time researching tea on reality TV stars and binging shows than I do doing my actual research (which I pretty much leave until the day before my weekly meeting and I send in my slides at like 1am the day of). \n\nI'm so glad this sub and you guys exist. Everyone in my program either fakes that they're perfect, or they are. They take 5 classes a quarter and before COVID, would bike to school after hitting the gym at 6am. God forbid I talk about being stressed or confused because those terms are foreign to these people.",
      "author": "Anti-Itch",
      "created": 1614226198,
      "upvotes": 3,
      "replies": {}
    },
    "gontr2r": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gontr2r/",
      "text": "* Just got accepted into a Ph.D. program and am still fucking depressed.\n* I'm in constant repetition mode because I have no idea who I talked to about what, so I start my sentences with \"Stop me if I told you this already...\"\n* I haven't posted my Ph.D news on social media but I'm nervous AF that I won't complete the program and hear about it until the end of fucking time.\n* I am swearing more often in my lectures because no one in the lectures really cares (I can see it in their eyes).\n* I'm using my lectures to try out my stand-up comedy routine in case this whole Ph.D. thing fails",
      "author": "Kikisdoingherbest",
      "created": 1614221386,
      "upvotes": 3,
      "replies": {
        "gop1fxs": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gop1fxs/",
          "text": "I'm sure your students actually appreciate you being real. My professor needs to effing chill. They are so uptight. We are all internally swearing the entire lecture.",
          "author": "Euneiphreniae",
          "created": 1614253272,
          "upvotes": 2,
          "replies": {
            "gopfynt": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gopfynt/",
              "text": "They do.  That's why I've given up censoring myself.  We just had a discussion on white washing history and one student was like,\" this is bullshit the only place I get a chance to learn about this in college,  why aren't high school teachers teaching this stuff? What happens to people that next learn this shit?\"",
              "author": "Kikisdoingherbest",
              "created": 1614262388,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gonp6r8": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonp6r8/",
      "text": "I have ADHD and tend to have very black-and-white thinking, so my mindset for projects is always \"perfection or nothing\"      -- if I don't get it right then I'm a failure. I tend to struggle with writing since I tend to hyperfixate on things like word choice, so even emails are difficult for me. My ideas never translate perfectly on paper, and for some reason turning in nothing seems better than having an incomplete work that doesn't do my ideas justice. \n\nEarlier this week I turned in a draft I thought was terribly formatted and unacceptably rough. My professor said \"this is totally fine, you've actually put down some really solid work\" and that was super affirming. What I turned in wasn't complete but it was enough, and it hit me that I can't be an imposter if I'm putting in effort and doing the work.",
      "author": "Moonbearbeam",
      "created": 1614219280,
      "upvotes": 3,
      "replies": {}
    },
    "gonek9n": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonek9n/",
      "text": "Confession number 2: Advanced degrees in Reading education and my choice of literature is Jane Austen Wannabe craptastic audiobooks that have 2 dimensional characters and go great with a cheap Chardonnay.",
      "author": "basicteachermom",
      "created": 1614214332,
      "upvotes": 5,
      "replies": {}
    },
    "gone667": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gone667/",
      "text": "I do all of my reading, research, and teaching with a toddler and preschooler present. I'm sure I misunderstand most of what is going on because I am constantly multitasking.  I am so distracted sometimes that I make embarrassingly stupid. I teach English English make APA errors in assignments kind of stupid. I'm also pretty sure my kids should earn honorary doctorates since I read my textbooks aloud (so I at least retain something) during bedtime, bathtime, and play time.",
      "author": "basicteachermom",
      "created": 1614214144,
      "upvotes": 1,
      "replies": {}
    },
    "gonamcl": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonamcl/",
      "text": "You are LITERALLY me. That is all I have to add lol.",
      "author": "Snoopy925",
      "created": 1614212425,
      "upvotes": 3,
      "replies": {}
    },
    "gon97b4": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gon97b4/",
      "text": "Accepted student here — for my top choice grad school I waited until the day it was due to finish my application. I also didn’t proof read anything before submitting it, which is a shame because I had accidentally deleted a few lines from my SOP leaving some kind of gibberish as my conclusion and I had some really sloppy errors in a supplemental essay too. \n\nI wanted to post on the grad admissions sub, but I didn’t because I’ve seen people there tell people they shouldn’t go to grad school if they don’t have everything 100% together. \n\nI figured my chances were over for that program, but I ended up getting in with a selective fellowship. So ... yeah, probably this is a lot more normal than it felt at the time because the program didn’t seem to hold it against me at all.\n\nEdit: I’ve thought about the imposter syndrome thing too. I agree one part of the antidote is confession, but the other is being mindful of when and how you share the good stuff. Be especially mindful of not over sharing due to insecurity. It is a really natural instinct to feel people might judge you so you want to head them off with the impressive stuff, especially in the context of sharing the bad stuff, but the overall effect can be pretty harmful. So I have a personal rule to not mention things like program rank, gpa, past achievements, etc without a good reason.",
      "author": "Thunderplant",
      "created": 1614211715,
      "upvotes": 5,
      "replies": {
        "gonx8z3": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonx8z3/",
          "text": "If it makes you feel better, my writing sample was a paper I wrote 8 years ago & I found out three weeks AFTER I sent it with my app that I had duplicated 3 pages in the middle of the paper. (I now do not write individual paper sections in a separate document & then add them to a master doc. I have learned. Maybe.)",
          "author": "ThousandSands",
          "created": 1614223033,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gomvq3q": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomvq3q/",
      "text": "My PhD mentor used to say \"if all you have accomplished to do in a day is just writing a single paragraph, its still a significant progress towards your phd degree\" that dude graduated with 7 first author papers and 8 other papers (2 in Nature). He always had a stream of Dota on his second monitor and had a pack of beer in his cabinet.",
      "author": "dubbuku_monkey",
      "created": 1614205426,
      "upvotes": 5,
      "replies": {}
    },
    "gomtrj0": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomtrj0/",
      "text": "Confession: I detest toxic overwork culture. I (mostly) work 40 hours per week. I largely avoid working on weekends unless it’s a tiny setup thing, or a major deadline is approaching. I routinely leave by 5pm, and only stay later than that when I really need to. When I’m at work I am 100% focused. It’s my fault, but I often work right through lunch and take no breaks. I just want to go home. \n\nThen, I spend most nights and weekends cooking, reading for leisure, and playing lots of video games. \n\nWhen I first started my PhD, I got a lot of crap for adhering to this schedule, but now a few toxic types have moved on, and everyone follows suit. We have (collectively) been super productive this year, and I’m so happy others saw the light. \n\nAlso, after having an absolutely insane research output since August, I am taking a mini staycation. Minimal emails, no analysis or writing, and no meetings allowed. Just chill.\n\nThat all being said, I still procrastinate quite a bit, don’t have LinkedIn or other normal social media, and am chronically behind on updating my committee (which neither my PI nor I really care about all that much.) .... I should probably work on the whole networking thing... like a lot.😅",
      "author": "BiologyPhDHopeful",
      "created": 1614204575,
      "upvotes": 7,
      "replies": {}
    },
    "goms8gx": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goms8gx/",
      "text": "This thread is awesome. I am also an imposter for every reason listed.\n\nLove this!",
      "author": "SubZeroEffort",
      "created": 1614203918,
      "upvotes": 2,
      "replies": {}
    },
    "goms2if": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goms2if/",
      "text": "Can we make this like a weekly thread or something? Soooo relieving",
      "author": "Agubas",
      "created": 1614203845,
      "upvotes": 20,
      "replies": {
        "gomv7z2": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomv7z2/",
          "text": "I second this! But follow it up with bits of things you do feel good about (even if it’s the smallest victory)",
          "author": "BiologyPhDHopeful",
          "created": 1614205208,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gomry85": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomry85/",
      "text": "I am more nervous about saying something dumb in lab meetings now than I was during my first undergrad practicum because at least then no one expected me to know what I'm talking about.",
      "author": "funeralssuck",
      "created": 1614203793,
      "upvotes": 7,
      "replies": {}
    },
    "gomk00v": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomk00v/",
      "text": "I always feel like people are watching how busy I am/ if I'm \"online\" and it stresses me out. However, it is actually impossible for me to work 40 hours a week. I just don't have the brain-width. Somehow, I make it look like I'm busy, which comforts me, but I still feel bad about it. This leads to me answering emails and picking up odd work projects on the weekends.",
      "author": "Mia-Thermopolis_",
      "created": 1614199160,
      "upvotes": 2,
      "replies": {}
    },
    "gome7pj": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gome7pj/",
      "text": "I just do whatever is right for me. I have my own path in life and so do others. I understand that and most people do too. It’s really simple, but it’s hard to wrap your head around and fully accept it. \n\nImposter syndrome is innately inside your head, so my view is that changing the externalities do not inherently fix it. More sleep and healthier lifestyle of course always improve things. However, ultimately it has to come from a change into mentality. You have to be sure that you’re actually beating it, instead of running away from it. How someone might do this is unique to themselves.",
      "author": "WSBNarrator",
      "created": 1614196733,
      "upvotes": 2,
      "replies": {}
    },
    "gomb9xi": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomb9xi/",
      "text": "I'm in my 5th year and still not technically a PhD candidate because I keep putting off one 20 page paper on my topic that the department requires. The fact that I haven't been disciplined for this yet is only because my advisor is department chair.\n\nI have zero publications and don't expect to get more than one or two (if that) out of my dissertation.\n\nI haven't presented at a conference since 2014.\n\nI'm horribly inarticulate when I speak. My writing sounds like it was written by someone else.\n\nI'm deeply terrified that I'm incapable of doing any thing beyond being a cashier at some big box store.",
      "author": "Paloma_91",
      "created": 1614195497,
      "upvotes": 5,
      "replies": {}
    },
    "gomagn7": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomagn7/",
      "text": "Oh, I needed this. Thank you for starting this discussion.\n\nI'm an 'older' MSc student, 31f, and have an unrelated undergrad degree that I received a decade ago, and (almost) everyone is young and has experience in my cohort. I self-consciously flaunt that I'm 'older' sometimes because I'm afraid of seeming like I have nothing to offer since I have less experience or knowledge than everyone else. \n\nI will ignore emails if they aren't important. I'm sorry. \n\nHonestly, I'm eternally grateful for my PI who understands work/life balance and promotes taking the weekend off without electronics. However, I usually work about 8 hours, 6 days a week because I *always* feel behind in my research. I absolutely love what I do and could not work as hard if I didn't. \n\nI put so much pressure on myself because I want to be at least one of the best in my niche, but I want to do it without sacrificing who I am or what I value in life, and that is a *tall, tall order*. \n\nI have such intense standards for myself and it causes me so much stress, but I feel like I could never succeed or be really good without putting myself under that pressure, especially since my mental health issues make me feel like I'm trying 100x as hard to do things that are easy (or at least not so difficult) for other people. I feel like it's what I use to compensate and assuage myself. If I just try harder... if I can just be the best... the top... then, I can succeed! Just like everyone else! \n\n...and then that perfectionism caused me to NOT TURN IN work, and my grade dropped. I would rather hand in nothing than poorly done work. I actually told my professor that. She said sometimes you have to turn in what ya got. I know that's not good, and that you have to complete things to improve, and that they know it's not always going to be my best work, but man... it's so hard to let go... \n\nI have ADHD and anxiety, and so I always feel like I talk way too much. I feel like the freaking Teachers Pet in all my classes, and I feel like others hate me for it... I even hate me for it, sometimes...\n\nI just joined 'academic twitter' YESTERDAY because one of my professors said that is where it's at. My LinkedIn page has next to nothing. \n\nI spend HOURS on some papers with my giant whiteboards and markers just so I can understand concepts and contribute. \n\nI try to hard and I feel like it's never enough and that I stand out as this old, 'other'. \n\nI've struggled with identity my whole life, and I want to be known as a good research scientist and a great mentor and that means everything to me. So when I feel like I don't belong, when I feel like an imposter, I feel like I'm lost.\n\nDamn, I really need to detach my personal worth from my work..............",
      "author": "devsmess",
      "created": 1614195186,
      "upvotes": 6,
      "replies": {
        "gonlb0o": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonlb0o/",
          "text": "HEARD THAT! All of it!",
          "author": "halfwaywherr",
          "created": 1614217471,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gom9i4j": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom9i4j/",
      "text": "It's a toss-up if I get up before noon or not (especially now with covid). I keep 4 different to do lists to try and keep track of things and I inevitably forget about all of them. I constantly forget that my LinkedIn even exists, I refuse to be a part of Twitter because on social media I can be a confrontational arse and I know that I'd end up getting into arguments that I really don't want to if I get on twitter. My emails come to my phone immediately but that doesn't prevent me from completely forgetting about time sensitive emails until days later.\n\nMost of my 'working' is me getting distracted and playing games or doing random google searches while my class notes I'm supposed to be studying are minimized in the background.\n\nMy classes are at 9am and I usually get out of bed at 8:30 at the earliest. I know and have been trying to change that, but it hasn't happened yet.",
      "author": "ConfusedCuddlefish",
      "created": 1614194813,
      "upvotes": 8,
      "replies": {}
    },
    "gom8ilk": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom8ilk/",
      "text": "I have adhd and that alone makes me have imposter syndrome lol",
      "author": "piscescherry",
      "created": 1614194431,
      "upvotes": 2,
      "replies": {}
    },
    "gom6rhg": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom6rhg/",
      "text": "I work probably around 25 hours a week. Most of the time is spent on my phone or speeding through tasks. \n\nI left my training videos on mute as they played while I cleaned or did other work. \n\nWhen it comes to research or finding papers, I read the intro, results, and discussion (may limitations if i'm feeling it).\n\nWhen I don't know something, I ruminate on how I should ask, then feel relieved when my question was answered.\n\nSometimes I online shop during \\[zoom\\] lectures because some information is redundant or I just can't focus.\n\nI am quick to respond to emails, but I don't read through them thoroughly enough, so then I am scrambling to correct myself.\n\nI cannot comprehend things well the first couple of times I read something. I have to read something more than twice to grasp what's being said.\n\nI don't have a LinkedIn.",
      "author": "rainbowgirl6",
      "created": 1614193751,
      "upvotes": 3,
      "replies": {}
    },
    "gom5rd9": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom5rd9/",
      "text": "I do what I do because I love the natural world and want to help the birds I study. I do not care about grants or funding or any of that. I don't care about being well known or running my own lab. \n\nIf I am able to get a teaching position that pays me enough to help the animals outside of my research, that's what I'm going to do. \n\nI refuse to spend 50+ hours of my week working. I barely want to work 35. I do what I need to do, do it well, and then I'm done. \n\nAnd as \"important\" as everyone keeps saying it is to my career, I do not want to join Twitter. I do not want another social media platform to feel anxiety about.",
      "author": "hstarbird11",
      "created": 1614193366,
      "upvotes": 8,
      "replies": {}
    },
    "gom4rkc": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom4rkc/",
      "text": "I hate going on twitter and there's been multiple times i tried to get into it bc \"it's a good career move\" but man I hate twitter, the people are toxic and the sub culture is even worse, I just want to be able to scroll a social media without feeling like I'm a bad person if I'm not mad at something every waking moment of my life \n\nIn regards to work, i sleep at weird times all the time and procrastinate often or shoot out all my work right before it's due too lol though my experience is likely different since there's no lab work involved. Sometimes I just lay in bed and listen to the zoom call on my phone and go back to sleep as soon as the lecture or seminar is over",
      "author": "lookmanidk",
      "created": 1614192989,
      "upvotes": 4,
      "replies": {}
    },
    "gom174o": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom174o/",
      "text": "I took the GRE 3 times and I still didn't get the score I wanted.",
      "author": "_annacat",
      "created": 1614191667,
      "upvotes": 6,
      "replies": {}
    },
    "golxsc6": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golxsc6/",
      "text": "As a kid I always thought that grad school would be my wet dream where I would spend hours reading books and have arguments with philosophers in my head until the wee hours of the morning. I romanticized it for so long. Now that I’m here I just feel tired and unwelcomed in my program.",
      "author": "HighlyPolitical16",
      "created": 1614190408,
      "upvotes": 17,
      "replies": {
        "goo1u2l": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goo1u2l/",
          "text": "Same , I thought I would stand on a desk aka Dead Poets Society and be inspired, but really it's just long lines at financial aid and the washeteria.",
          "author": "SubZeroEffort",
          "created": 1614225407,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "golwvzl": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golwvzl/",
      "text": "TBH my motto is “Bs get degrees”. I’ve learned to be honest with myself, and take ownership of my limitations. My main combat tactic against impostor syndrome is to remind myself “I may not know this, but I’m 100% capable of learning it when I really need to”.",
      "author": "PetrichorBySulphur",
      "created": 1614190076,
      "upvotes": 5,
      "replies": {}
    },
    "golvn36": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golvn36/",
      "text": "I have never done the readings for one of my classes. That prof is my reference for internships and job applications.\n\nI take time to have a social life. I set homework hours. I refuse to meet classmates on weekends unless it's right before a midterm or project due date. \n\nIf I'm not working, I wake up at 8:30 (class, non-work days) or about 10:00 (non-class, non-work days). It's wonderful. I also take naps on a regular basis. Also, I spend absurd amounts of time making delicious meals instead of the easy version of the exact same thing.\n\nI am scared of asking for recommendation letters. I constantly think that my profs hate me. They then gladly accept doing the letter. It is dumb of me.\n\nMy LinkedIn is all from my current/soon-to-be prior profession. I barely connect with my classmates or people that I want to emulate. I hate connecting with people before I have a personal connection with them.\n\nI do 90% of my homework the day it's due. I read everyone else's reading responses before I write mine to know what pages I really need to read.\n\nI should probably pay more attention in the ONE class I have to be on zoom for... Literally right now. But. I'm not.",
      "author": "ThousandSands",
      "created": 1614189621,
      "upvotes": 14,
      "replies": {
        "gqdsr4s": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gqdsr4s/",
          "text": "Man...your last point was totally me last sem in one class. Ended up being my 2nd best class too lol.",
          "author": "traincitypeers",
          "created": 1615329673,
          "upvotes": 1,
          "replies": {
            "gqf06p0": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gqf06p0/",
              "text": "Took a class last semester with the same prof. Did the exact same thing. Still was my 2nd highest grade!  (This is the same prof that's my reference letter prof in point 1)",
              "author": "ThousandSands",
              "created": 1615353830,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "golvi2e": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golvi2e/",
      "text": "Reading this post makes me feel sooo much better about my work habits and my PhD journey in general. I thought I was the only one that fit into these categories.",
      "author": "ghosts_I-IV",
      "created": 1614189572,
      "upvotes": 9,
      "replies": {
        "gonx7n1": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonx7n1/",
          "text": "Yes! I felt so guilty wondering if maybe something was wrong with me and letting my fear make me freeze.",
          "author": "InCoffeeWeTrust",
          "created": 1614223015,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "golu9u0": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golu9u0/",
      "text": "Confessions of an ADHD graduate student...\n\n>My sleep schedule is a bloody mess. I usually go to bed anywhere between 2-3 but on really rough nights it could be closer to 4. Depending on how my sleep went last night I may or may not get anything done the next day. \n\n>I do all my readings (I got downvoted to hell for suggesting this was a good idea in the other thread) but that happens despite any other issues. It's the thing I prioritize because it always means I'm ready to answer questions... even if I'm absolutely exhausted. \n\n>I probably work, at most, 4 to 6 hours a day. I avoid booking a meeting before 1100 because I will be irritable and not focused until the drugs kick in. I spend the mornings curled up around my cat waiting for the drugs to kick in so I can get something done. \n\n>I simply will not read emails on the weekends. I refuse. My brain can barely tolerate the 30ish hours of work that I do during the week. Anything more is simply a bridge too goddamned far. \n\n>The reason that I always have something to say on most topics is because I've probably hyperfixated on that at some point in time. My husband laughs at my constant curiosity but I literally can't help it. The internet has made it so that any unanswered question can usually be figured out relatively quickly... and I must know... NOW! Doesn't matter that the conversation moved on and it took me 15 minutes to find that tidbit of info... I MUST KNOW.\n\n>The ADHD makes my brain work weirdly fast. I jump between topics and ideas really rapidly. By the time my coworkers are just getting to step 2 I'm already on step 5. This is not a boon, I cannot explain how I got to step 5 but I intuitively know it makes sense to be there. Try explaining that in a paper... ugh. \n\nIronically, my boss is much the same way and I have a sneaking suspicion that he is an ADHD kid too. He just has that vibe and he has WAY too many tabs open for a normal. He also has areas of research that he exclusively pawns off to his grad students because he can't deal with them. He literally can't, if you ask him to look them over it will never get done. \n\nOh, and on a personal level, I can be unintentionally brisk if I am fixated on a problem. This means I tend to give the solution rather than care about the feelings of the person presenting the problem. This only seems to be a problem with people I think should have it figured out, my colleagues. I don't seem to have the same response to my students, for some reason. It takes some getting used to but my colleagues now use me as an unofficial \"Reviewer 2\" because I will be aggressive in my analysis of their work without taking into account their feelings.\n\nI'm not sure how I feel about that last one. I've worked on it with my therapist but is still creeps in no matter how much I work on it. On the bright side, once people get used to me as \"academically aggressive\" they actually kind of like it. It's kind of nice to be appreciated by your teammates for something you personally worry is a flaw.",
      "author": "ImperiousMage",
      "created": 1614189128,
      "upvotes": 4,
      "replies": {}
    },
    "goltbtm": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goltbtm/",
      "text": "Im just starting grad school (1st year) and reading this makes me feel better. This is something that I have been struggling with during my rotations is the feeling of imposter syndrome...\n\nEspecially due to my commute, works hours can be pretty on the low end for some labs \"requirement\" but alas hope they are understandable (and they are thus far!)",
      "author": "MaximiniMan",
      "created": 1614188785,
      "upvotes": 4,
      "replies": {}
    },
    "golm5x7": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golm5x7/",
      "text": "I am passionate about only 20% or so of my PhD topic. When I’m working on something in that 20%, I work *all the time* but when I switch gears to a different focus I might get 2 hours of work in each day—if I’m lucky. \n\nMy favorite part of my PhD journey is teaching. I don’t want an RA appointment, even though it would come with a modest raise.\n\nI *never* work through meals. I (almost) never work after dinner.\n\nThere are 168 hours in the week and if my friends want to hang out for a few of them, I don’t prioritize work over socializing (unless there’s a looming deadline).\n\nIf I don’t have a scheduled commitment, I won’t set an alarm. I wake up about 11:00 on those days.\n\nI’ve looked at only about 20% of the papers my advisors have recommended to me. I’ve cited papers based on their title.\n\nI have avoided following up with potential job opportunities because I was scared.\n\nIt’s my 6th year and I don’t feel like I’m close to being done, but fortunately my advisors think I am and have repeatedly rebuffed my attempts to “master out”.",
      "author": "its-been-a-decade",
      "created": 1614185844,
      "upvotes": 8,
      "replies": {}
    },
    "golju6y": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golju6y/",
      "text": "- my sleeping schedule is absolute shit.\n\n- once I come home from the lab, I take a nap or waste the rest of the day watching TV\n\n- I only skim papers then I save them and tell myself that I'll look at it again later\n\n- I don't have Twitter or LinkedIn\n\n- when my PI asks me a question, I just  make up stuff on the spot and hope it is right",
      "author": "luvtrencher",
      "created": 1614184846,
      "upvotes": 12,
      "replies": {
        "gonwznw": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonwznw/",
          "text": "Or that feeling of relief when you get your supervisor to go on a tangent because you didn't prepare enough for the meeting that week heh",
          "author": "InCoffeeWeTrust",
          "created": 1614222912,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "goljld3": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goljld3/",
      "text": "I tend to push all my work into the days before a deadline, I.e. if I have an individual meeting with my PI on Friday most of my productive work will be on Weds/Thurs. \n\nI spend too much time on Reddit during working hours (Actually should be work right now tbh).\n\nI get easily irritated by my group members over small things. \n\nI have constant doubts about my level of progress.\n\nThink that's about all at the moment.....",
      "author": "Soulless_redhead",
      "created": 1614184743,
      "upvotes": 7,
      "replies": {}
    },
    "goljg0l": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goljg0l/",
      "text": "I do not understand half of what's being said at any given point in my statistics training. I'm a politics student who is suddenly being expected to code and I am *bad at it.* I sat in class having done literally none of the reading this week (I'm being given a reading list of 10 books and 8 articles per class mandatory a week, so fuck that). I do not understand half the stupidly overly complex phrasing I'm being made to read and write. \n\nHaving said that, I seem to be one of three of my course-mates who actually takes the weekend off and doesn't send homework emails at 4am, so a win for me and my work/life balance?",
      "author": "Amazing-Ad-4364",
      "created": 1614184681,
      "upvotes": 9,
      "replies": {
        "gonmzit": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonmzit/",
          "text": "That's a freaking insane amount of reading.",
          "author": "Euneiphreniae",
          "created": 1614218248,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "golj5k3": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golj5k3/",
      "text": "I do all the things you mention but I don’t feel guilty about it. I felt like an imposter for a year when I started my master’s, but now I don’t experience it anymore or very rarely. \n\nI wonder what the difference is. Field of study? Culture of the program? Former gifted kid syndrome for some people?? Like why am I free from it now? No idea.",
      "author": "snakesareracist",
      "created": 1614184559,
      "upvotes": 8,
      "replies": {}
    },
    "golj2vh": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golj2vh/",
      "text": "Not currently in grad school, but I took a nap every day of my masters.  Not a short nap.",
      "author": "ChetBakersDentures",
      "created": 1614184528,
      "upvotes": 37,
      "replies": {
        "golnvpc": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golnvpc/",
          "text": "Same.",
          "author": "givemeyourdonut",
          "created": 1614186593,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "golj292": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golj292/",
      "text": "Hey guys... just woke up. What did I miss?\n\n\n\n\n\nMost excellent recent days on this sub. Thank you all.",
      "author": "baumealarose",
      "created": 1614184520,
      "upvotes": 12,
      "replies": {}
    },
    "goli1hf": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goli1hf/",
      "text": "You already wrote mine! A little too damn well ;)",
      "author": "TripinPanda",
      "created": 1614184089,
      "upvotes": 1,
      "replies": {}
    },
    "golh9cw": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golh9cw/",
      "text": "I'm done grad school now, but can say that my mental health improved in leaps and bounds once I started feeling comfortable enough to confess \"secrets\" like this to my friends in my program. \n\nMy confession (my grad school friends all know this already) is that I figured out which models to use for large parts of my dissertation by googling a bunch about the models that similar studies had used, not through any strong theoretical understanding of statistical modeling. I was always slightly terrified that there were fatal flaws in my modeling approach that I wasn't knowledgable enough to identify.",
      "author": "YourWaterloo",
      "created": 1614183759,
      "upvotes": 27,
      "replies": {}
    },
    "golg9uz": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golg9uz/",
      "text": "I keep to a 5 day work week as far as possible. I leave work when I'm done with what I planned on doing for the day. I look at my colleagues and wonder why are they insane enough to spend more time than they have to at work.  \n\nI rarely remember details like who wrote what. I spend AGES acquiring knowledge because the way I learn is to see something enough and it sinks in. I've not found a way to make this quicker and i honestly can't be fked. I spend every weekend and some weekday nights going out with friends or spending time with family, and I don't regret it. \n\nMy PI asked us today, if we are spending more time on netflix than on reading science. But you know what? I rather do that. I like my field, but not enough to soak myself in science all day without a reprieve.",
      "author": "lmnmss",
      "created": 1614183344,
      "upvotes": 10,
      "replies": {}
    },
    "golecd2": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golecd2/",
      "text": "Sometimes I get so stunned with imposter syndrome I forget to even turn in a paper or engage in a discussion. My anxiety has been through the roof since my last master’s program where I was fired as a GA by my grad advisor for not letting her put her name on my work. I’ve felt like a fraud since. I’m trying to get back in the swing of things with my new program but I feel like they will find out I’m actually lazy and an idiot.",
      "author": "g-wenn",
      "created": 1614182515,
      "upvotes": 4,
      "replies": {}
    },
    "goldbkl": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goldbkl/",
      "text": "You literally described my master’s life word for word. BUT I joined the industry after and I feel I have a much better sense of time, schedule, and responsibility so when I go back for a PhD, hopefully it’ll be much better.",
      "author": "AfterTruth",
      "created": 1614182070,
      "upvotes": 6,
      "replies": {}
    },
    "golctzc": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golctzc/",
      "text": "I just keep in mind that I'm here to learn and that asking humble questions, not-knowing, and being curious about the world is literally the mission of science and research.",
      "author": "mamamiyaaa",
      "created": 1614181859,
      "upvotes": 9,
      "replies": {}
    },
    "golasys": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golasys/",
      "text": "I finished all of my coursework and now I only have to finish the dissertation. I made the switch back to public education because I desperately needed a job since my funding ended. With teaching being so hectic right now, plus the comforts of having a salary and health insurance, I haven't touched my project since last May. What's worse is that I don't even care. Full blown apathy, it feels so meaningless.",
      "author": "turd_fergusons",
      "created": 1614180957,
      "upvotes": 5,
      "replies": {}
    },
    "gol9e3o": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol9e3o/",
      "text": ">My sleep schedule varies widely and I sometimes do not get up until after 1 PM\n\nHaha weak! Sometimes I don't get to sleep even after 3 am! I'm just kidding lol, my sleep schedule isn't something to be proud of. \n\nI also waste more than 1 day a week. Especially with lockdown, I'm having a lot of trouble working. My qualifying exam was originally scheduled for October 2020 and then January 2021 and now it's been postponed indefinitely. I'm seriously considering mastering out even though jobs that require PhDs are the most interesting to me because I'm really frustrated with how my university treats grad students, I've lost the drive to do my research, and I'm just tired all the god damn time. \n\nI don't feel like I fit in in my program because everybody else acts all serious all the time. Like they can't just be 20 somethings and have to be ~professional~ every waking moment and it's hard to make friends. I also don't feel like I fit in the city where I'm in school because it's *ultra* outdoorsy. I've given up dating here because I'm tired of being asked to hike up whole ass mountains on the first date. People act like it's weird to sit in my apartment and relax on the weekend instead of going and doing some outdoorsy activity. A lot of people act like where you live for a PhD doesn't matter, but I'd be lying if I said that wasn't a huge part of it. I went to NYC last year (pre lockdown) and cried on the plane ride back because I'm so tired of this tiny city.\n\nI really miss the passion I used to have for research, but what can I do? I've contacted a ton of therapists, but half didn't even respond and the other half had no openings. Yesterday I spent the whole day looking at jobs I could get in DC because my older brother and younger sister live there and it seems nice. But all the interesting ones were postdocs or research associate jobs so yeah :/\n\nThis just turned into a depression confessional lmao",
      "author": "KiwiTheKitty",
      "created": 1614180315,
      "upvotes": 23,
      "replies": {}
    },
    "gol8ts6": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol8ts6/",
      "text": "I procrastinate a lot. I could not even meet my submission date because I couldn't foresee administrative delays even after almost 2 years in this field. Whenever there's a conference, I go only for free food. I suck at networking. I only recently started making a LinkedIn profile and my resume. I watch Netflix a lot while writing so that I don't think about the loooong hours I'm working on my research.\n\nI work 6 hours a week and on days that I'm working, I usually get so tired that I don't even have the energy to do my research. I take 3 hour naps after I'm working. It's that mentally exhausting.... I used to cry a lot during my Masters because I had a really bad relationship with one of my supervisors.\n\nI absolutely SUCK at email etiquette. It's something I'm actively working on of course, but I hate it and I want to stop emailing anyone because any small 'etiquette' mistake you make will make you seem like a raging gorilla when that's not what you meant.\n\nI'm not in research to be the god of novelty. I think I can write a decent thesis. I can present a decent viva. I can be a decent human being in academia. The end.",
      "author": "givemeyourdonut",
      "created": 1614180057,
      "upvotes": 24,
      "replies": {
        "gonwgk0": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonwgk0/",
          "text": "Do you worry that youll copy the vibe of what youre watching into your writing? If i'm watching the Crown i'll literally start writing in a British accent, but if i'm listening to fabulous dance music my writing becomes really sassy lol",
          "author": "InCoffeeWeTrust",
          "created": 1614222663,
          "upvotes": 5,
          "replies": {
            "goo3gqz": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goo3gqz/",
              "text": "Not OP but if I'm working I almost always only rewatch and the show is just for background noise.",
              "author": "Anti-Itch",
              "created": 1614226301,
              "upvotes": 3,
              "replies": {
                "goo9dmt": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goo9dmt/",
                  "text": "I actively watch new shows! I'm watching Snowpiercer now and for the life of me, it's the best show to write while writing a thesis. The slow burn is perrrfecccttt",
                  "author": "givemeyourdonut",
                  "created": 1614229733,
                  "upvotes": 2,
                  "replies": {
                    "gooccgy": {
                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gooccgy/",
                      "text": "That's... so genius.",
                      "author": "Anti-Itch",
                      "created": 1614231687,
                      "upvotes": 2,
                      "replies": {
                        "gooh3ma": {
                          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gooh3ma/",
                          "text": "My fave rewatch is Harry Potter......... It's the best background noise for anything.",
                          "author": "givemeyourdonut",
                          "created": 1614235119,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "goo9bfa": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goo9bfa/",
              "text": "Hahahhahaha not at all. I watch a variety of shows from UK, US, Japan and Korean shows so I'm not sure how these will fit in my thesis... But, I am highly 'detached' person. I can multitask well without any of the tasks affecting each other.",
              "author": "givemeyourdonut",
              "created": 1614229695,
              "upvotes": 2,
              "replies": {
                "goods3h": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goods3h/",
                  "text": "Haha nice, that's a talent",
                  "author": "InCoffeeWeTrust",
                  "created": 1614232685,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gol7x2s": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol7x2s/",
      "text": "I had to take my prelim twice. \n\nI'm a horrible public speaker. \n\nI would 100% fail my undergraduate gen biochem course if I had to take it again. \n\nI have absolutely no idea if I'm calibrating the pH meter correctly.\n\nEdit to add: I once met a PI who was a postdoc when I was an undergrad at the same university (I took a course he TAed for). He told me to fake it 'til I make it but doesn't know when that happens because he's still faking it.\n\nEdit to add: I had to edit this like, 3 times because my brain is fried and it's barely Wednesday.",
      "author": "mmaireenehc",
      "created": 1614179636,
      "upvotes": 78,
      "replies": {
        "golrzub": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golrzub/",
          "text": "I also had to take my prelim twice. To be honest, I have not been able to rebuild self-confidence since then. I dread defending my dissertation. I know they'll probably pass me anyway, since it looks good on all of the committee to have graduated students (I'm just another CV line!).",
          "author": "timidtriffid",
          "created": 1614188299,
          "upvotes": 14,
          "replies": {
            "gon06ja": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gon06ja/",
              "text": "Same. I never fully recovered from that failure.  It sits in the back of my mind that I don't have imposter syndrome; I'm a literal imposter because I shouldn't be here.",
              "author": "mmaireenehc",
              "created": 1614207395,
              "upvotes": 5,
              "replies": {
                "gon8w97": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gon8w97/",
                  "text": "I FEEL YOU.",
                  "author": "timidtriffid",
                  "created": 1614211562,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gonme47": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonme47/",
              "text": "I started my PhD, pretty much because I wanted to push myself to achieve something no-one in my entire extended family has done, that I know of. I come from a strong blue collar background - several generations - and was blue collar myself until my mid twenties.\n\nI wish I knew when I started that the hardest part of grad school was getting in. Once you're here it's really all about time and resilience. I'm almost at the end which is nice, and it's a big stress relief thinking that if I just keep pushing each day, I will almost certainly pass (<2% of submitted theses fail - and they are *always* exceptional cases).\n\nBut in hindsight, I wonder if I wouldn't have preferred to just do a masters/grad diploma of software engineering and just gone and become a programmer (I'm in computational genetics, with a background in genetics/ecology). I fell in love with coding and stats during my honours year.",
              "author": "ChristianValour",
              "created": 1614217971,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gol71p2": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol71p2/",
      "text": "Wow I needed this thread. \n\nDon't have twitter or linkedin or any social media. I watch a lot of TV and spend most afternoons going on a run then napping. I write like an hour max in the morning then just dick around hoping all the dicking around amounts to something. I won't admit that I'm angry about how much isolation ABD students are forced to work in. I'm complicit in normalizing the lonely ass grad student.",
      "author": "AffectRunner",
      "created": 1614179222,
      "upvotes": 23,
      "replies": {}
    },
    "gol70nm": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol70nm/",
      "text": "I spent the last 3 months passively data collecting and I wrote maybe 5 pages on my thesis. I spent most of the past 3 months ignoring schoolwork altogether. \n\nI also absolutely suck at public speaking so many presentations to my cohort have been miserable and everyone elses' presentations have been very professional. I haven't even applied to any conferences this year after getting rejected last year. I was the only one that didn't present at the conference that was held at my university last year.",
      "author": "cpoks",
      "created": 1614179207,
      "upvotes": 13,
      "replies": {}
    },
    "gol6onu": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol6onu/",
      "text": "I work full time and am tryinto get a doctorate. I'm usually too tired to work after work so end up saving all of my reading, writing, and assignments for the weekend. When I take a day off from work it is to catch up on school work. I just want to sleep all of the time. So yes, I also skim papers. I save them in google drive and usethesearvh function to pull relavent material.",
      "author": "IncredibleBulk2",
      "created": 1614179046,
      "upvotes": 15,
      "replies": {
        "gonwlnv": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonwlnv/",
          "text": "Same, i only read the most relevant ones and then just note what people say about the others",
          "author": "InCoffeeWeTrust",
          "created": 1614222730,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gol68ib": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol68ib/",
      "text": "I just wanna thank everyone for sharing. I was hesitant to accept my PhD offer because I felt like I couldn't possibly do what they're asking me. This makes me feel a little bit better about trying to find my rhythm in graduate school.",
      "author": "I_am_the_God_Orca",
      "created": 1614178830,
      "upvotes": 29,
      "replies": {}
    },
    "gol5j18": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol5j18/",
      "text": "[deleted]",
      "author": null,
      "created": 1614178496,
      "upvotes": 33,
      "replies": {
        "gomke5m": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomke5m/",
          "text": "Hi me, it's nice to see you here.",
          "author": "UnspectacularAim",
          "created": 1614199307,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gol3k8v": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol3k8v/",
      "text": ">My sleep schedule varies widely and I sometimes do not get up until after 1 PM. I also sometimes multitask in meetings and seminars (especially if there’s a PowerPoint presentation involved), forget about paperwork until after it is due, and sometimes if I’m talking to someone and I mention a paper I read a while ago I’m vague or I misremember details and get them wrong.\n\n>I also procrastinate, don’t know how to network, don’t keep my LinkedIn updated, am not part of academic Twitter, am slow about checking and answering my email, and am afraid of admitting that I don’t know something and asking for help because I think everyone else must already know it and I’m ashamed to admit that I don’t.\n\nOh hey, I didn't know you were me. Hi there myself!",
      "author": "deathf4n",
      "created": 1614177531,
      "upvotes": 10,
      "replies": {}
    },
    "gol2yqx": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol2yqx/",
      "text": "After reading these comments, I realized there is something called \"academic Twitter.\" \n\n(Can someone please enlighten me what that is? Like a handle where all your friends are academic and you kinda just metaphorically high-five each other?)",
      "author": "Prof_Eden",
      "created": 1614177228,
      "upvotes": 37,
      "replies": {
        "gol6hz4": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol6hz4/",
          "text": "[deleted]",
          "author": null,
          "created": 1614178955,
          "upvotes": 26,
          "replies": {
            "golcffc": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golcffc/",
              "text": "I don’t really understand twitter just yet. Do I follow a hashtag for that or a bunch of academics? What exactly is academic twitter?",
              "author": "theArtOfProgramming",
              "created": 1614181682,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gol81hs": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol81hs/",
          "text": "Besides talking about papers, conferences, and interesting research, people also talk about problems in the field and there's a big plus to networking through Twitter because you find out about jobs first. \n\nOf the probably 8 people I know who have gotten a postdoc in the last 5 years, literally 6 had Twitter involved in getting the job in some way. So it's really important for evolutionary bio haha and I'm trying to force myself to make an account.",
          "author": "KiwiTheKitty",
          "created": 1614179694,
          "upvotes": 14,
          "replies": {}
        },
        "gonml58": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonml58/",
          "text": "It's nothing, it's just twitter, but with more elitism.",
          "author": "ChristianValour",
          "created": 1614218063,
          "upvotes": 4,
          "replies": {}
        },
        "gonfg2f": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonfg2f/",
          "text": "Same....",
          "author": "basicteachermom",
          "created": 1614214755,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gol0uzz": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol0uzz/",
      "text": "I just do the bare minimum I want to get my degree and then leave. I honestly don’t care about my research and am only sticking around for the scholarship. My passion for my subject went long ago. I’m in the uk, so I don’t have to do courses like in the US and I have no teaching or whatever, I already have a masters degree, so it is easier for me I guess.",
      "author": "JamesfEngland",
      "created": 1614176150,
      "upvotes": 56,
      "replies": {
        "golfo4r": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golfo4r/",
          "text": "I thought it was just me! I enjoy my field, but after some serious tomfoolery and departmental politics I think I'll be done with academia for a while. At this point I'm just finishing this degree because if I quit now I have to pay them back. If I could, I'd work again for a while before returning (if I return).",
          "author": "CG_blue",
          "created": 1614183089,
          "upvotes": 9,
          "replies": {}
        },
        "goma12k": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goma12k/",
          "text": "Glad to see that I'm not the only one who would have left if not for my funding. I make more as a grad student than I've made in my entire life up until this point. I generally enjoy my field, but not at the level that many others seem to.",
          "author": "Paloma_91",
          "created": 1614195018,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gol03hc": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol03hc/",
      "text": "Why is an academic twitter a good idea?",
      "author": "RageA333",
      "created": 1614175745,
      "upvotes": 39,
      "replies": {
        "gol2b74": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol2b74/",
          "text": "Networking partly, but also rallying awareness for other academics' work that might otherwise get small attention (esp. women & BIPOC who are still underrepresented in most fields). \n\nI don't have a Twitter, either, but i do think those are laudable reasons to have one.",
          "author": "toberrmorry",
          "created": 1614176895,
          "upvotes": 30,
          "replies": {
            "golc23f": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golc23f/",
              "text": "I believe that there’s a correlation to more citations if you share you work on twitter too.",
              "author": "theArtOfProgramming",
              "created": 1614181517,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "gomrllb": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomrllb/",
          "text": "I joined academic Twitter and fully regret it. It can be good to find new papers or jobs, but it feels very cliquey",
          "author": "quenual",
          "created": 1614203642,
          "upvotes": 7,
          "replies": {
            "gooahaz": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gooahaz/",
              "text": "Did you make a side account for it? I post art on my Twitter and feel like it'd be inappropriate/unprofessional to follow professors and peers from it.",
              "author": "gnomelover3000",
              "created": 1614230436,
              "upvotes": 2,
              "replies": {}
            },
            "gosdtqe": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gosdtqe/",
              "text": "It feels really cliquey and people can really blur the lines of what is acceptable to say on a public platform about work. Professional decorum seems to slip a bit on student academic Twitter, especially.",
              "author": "kelsykins",
              "created": 1614308737,
              "upvotes": 2,
              "replies": {
                "gpc1qx3": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gpc1qx3/",
                  "text": "Yes absolutely this. I feel like people should be a bit more cautious with what they tweet. Some Twitter famous students are just that; they’re not well published or cited, but they have spicy takes and get lots of followers....which doesn’t mean you’re automatically marketable for a job and does not make you a good scientist. I recently saw someone tweet that they were looking for a job after graduation and their profile picture was them in a tiny bikini with some heavy underboob. I’m all for wearing and saying what you want, but I think people should be more careful if they’re trying to get hired from that platform",
                  "author": "quenual",
                  "created": 1614628308,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gonf9be": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonf9be/",
          "text": "*Immediately texts the one person I know personally a PhD to ask about Academic Twitter *",
          "author": "basicteachermom",
          "created": 1614214666,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gol021b": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol021b/",
      "text": "I tried tracking my time because I've been feeling unproductive. And turns out I only get about 20 hours of work per week 😐 I've tried again and again to increase my productivity, and the most I could get is 30 hours (including weekends). Meanwhile my advisor thinks I'm always so busy. Tbh, I feel busy and exhausted ALL THE TIME! This is why I cannot fathom how others work 40 or more!\n\nAlso, my thesis is riddled with mistakes that haunt me at night. I am submitting it as is just to get the hell out of here.",
      "author": "Sea_of_colors",
      "created": 1614175723,
      "upvotes": 138,
      "replies": {
        "gol43ae": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol43ae/",
          "text": "Productivity and hours worked are not the same thing. My most productive weeks have always been the ones where I take a day off to do something with friends. Whenever I slip into the habit of working until I'm exhausted all the time, I end up being so unproductive that it takes me a week to do what I could do in a day if I was well rested and relaxed.\n\nAlso, taking care of your mental health is a must.",
          "author": "bashtown",
          "created": 1614177791,
          "upvotes": 66,
          "replies": {
            "golwloh": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golwloh/",
              "text": "[deleted]",
              "author": null,
              "created": 1614189973,
              "upvotes": 24,
              "replies": {
                "gom3jhu": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom3jhu/",
                  "text": "I can relate to that. Before the pandemic I commuted about 45 minutes to campus every day. On the drive I would listen to podcasts on various topics but with no specific connection to my work, but I'd often get these eureka moments while listening.",
                  "author": "bashtown",
                  "created": 1614192530,
                  "upvotes": 12,
                  "replies": {
                    "gom4aaz": {
                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom4aaz/",
                      "text": "Yeah, that was usually my gym time... but all the gyms are closed and I HATE working out at home...",
                      "author": "ImperiousMage",
                      "created": 1614192804,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gol4mzc": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol4mzc/",
              "text": "Yes that is why I decided to let it go and just accept that this is the level I am comfortable with. I definitely prioritize my mental health, but the imposter syndrome creeps in when I see others in my group produce much more (2+ projects) and still look more relaxed and excited that I am lol.",
              "author": "Sea_of_colors",
              "created": 1614178058,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "gol72ck": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol72ck/",
          "text": "This is the thing with time tracking, you *absolutely cannot* compare your results with people who aren't also time tracking. They are most likely inflating how much they work, either to look good or because they don't really know how much they actively work. Meanwhile, you, as the time tracker, know *exactly* how many hours you actively work.\n\nI struggled with a TON of anxiety over this stuff last year. I also tracked my time and came up with a similar result to yours: about 4 hours a day. It honestly really fucked me up and I was convinced I was a lazy bastard who did not belong in a PhD programme. Then my psychologist pointed out that actively working 8 hours a day in these sorts of jobs is completely unrealistic and pretty much no one is actually doing it. When people say they are working 40-50 hours a week they are including all their coffee breaks, bathroom breaks, daydreaming, random chats with colleagues, scrolling through news sites and social media, etc. Remove all that and most people only average about 4-6 hours of active work a day.\n\nTL;DR Don't beat yourself up too much about the number of hours you work. As long as you're not behind, you're fine! :)",
          "author": "Jealous_Illustrator",
          "created": 1614179231,
          "upvotes": 52,
          "replies": {
            "gol7yl6": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol7yl6/",
              "text": "Yes that's what I concluded after months of feeling like a piece of shit student! I do feel like I am behind, however I realized that this is me doing my best and it's just going to have to do. It's good enough for me to get this phd AND get job offers so whatever (I don't even have published papers...)",
              "author": "Sea_of_colors",
              "created": 1614179657,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "gol7dhd": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol7dhd/",
          "text": "I did the same thing! I was only getting 10hrs/wk when I started recording it... I am contractually obligated for 20hrs/wk, so that's my goal. I figure that the occasional 40hr week I have makes up for all of the 10hr ones...\n\nMy advisor popped into the lab the other day & I was the only one there at 5pm. I had only just come in at 2, but I think he got the impression that I slave away all day long every day. He asked me how late I usually stay and I gave him some kinda answer like \"oh, idk, depends on the day....\" \n\nIt's so much worse since covid, too. I used to hang out at my desk a few hours after I finished my benchwork, attempting to get some reading done. But now I try to limit my time on campus, saying \"I'll do the same work at home.\" Nope.",
          "author": "StellaPeekaboo",
          "created": 1614179379,
          "upvotes": 25,
          "replies": {
            "gol7pby": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol7pby/",
              "text": "Omg same! I get distracted early mornings and usually my best work is done between 3 pm and 7 pm, and that's also usually when my advisor is finally free to acknowledge my existence. So definitely looks like I slave away. Although I always have that feeling that he sees me as the least productive of all his students... sigh.",
              "author": "Sea_of_colors",
              "created": 1614179534,
              "upvotes": 16,
              "replies": {
                "gol9bor": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol9bor/",
                  "text": "I'm the only PhD in our lab right now & am the most senior despite only being a 2nd year student, due to bad planning by my advisor. I haven't been able to collect any meaningful data in MONTHS, but I still run the lab and am the go-to person! I feel so productive ordering lab equipment and sending emails, even if I don't have anything to show for my own research :'(",
                  "author": "StellaPeekaboo",
                  "created": 1614180285,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            }
          }
        },
        "gon81u5": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gon81u5/",
          "text": "Most people dramatically overestimate how much they work, often by like 10-15 hours a week (I forget the exact numbers but you can probably find them if you’re curious).\n\nSo if you track work and know how many you actually work it can be really misleading. I thought I was barely working for so long because of this!! Turns out I was probably working a fairly normal amount.\n\nThat being said, hours/week and how much you feel like you’re working are NOT the same. I used to kind of work all the time, but in small pieces. Kind of a typical student schedule where I was working in between classes, at night for a few hours if needed, on weekends, etc. I felt totally exhausted and busy all the time even though my total hours were low. Recently I switched to a scheduled work system where I work during very defined hours and not otherwise. OMG it is amazing. I’m working more hours and I feel like I’m working less. And my free time is so much more enjoyable because it’s truly free now. I just wish someone had told me this sooner because this solved a lot of my problems. I thought working when I wanted to was freedom but I guess it was actually anything but.",
          "author": "Thunderplant",
          "created": 1614211141,
          "upvotes": 9,
          "replies": {
            "gonbkuh": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonbkuh/",
              "text": "I definitely need to do that. I defend in 3 weeks and start a postdoc 2 weeks after that, and I'm really hoping to just stick to specific work hours then.",
              "author": "Sea_of_colors",
              "created": 1614212907,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gonnsrv": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonnsrv/",
          "text": "Yoooo, I've been tracking actual hours for a few years and have so far done an honours year (thesis and coursework) and a master's year (thesis) -- my average week is also between 20-30 hours, and that number got inflated during my master's because I did some RA gigs as well (lots of mundane work there). I too am unsure if I am lazy bastard, but I mean, I got the shit done without blowing any deadlines and getting good enough grades to get into the PhD, soooo.... *shrug*\n\n\nI'm pretty sure 80% of my grad school related anguish came from worrying about the bloody hours, so I am trying really hard to erase the idea that adults work 8 hours a day from my mind.",
          "author": "laakmus",
          "created": 1614218628,
          "upvotes": 5,
          "replies": {
            "gonoyfw": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonoyfw/",
              "text": "It's hard to forget especially that my spouse works 40 hours (he's not in grad school or academia), so I tend to feel like I should too. Not to mention that my advisory works freaking nonstop... It's such a toxic mentality and I'm hoping the new lab I'm joining is alot more chill in that aspect!",
              "author": "Sea_of_colors",
              "created": 1614219173,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "goloqpg": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goloqpg/",
          "text": "So is mine. See you on the other side! 😆",
          "author": "ipodalien",
          "created": 1614186965,
          "upvotes": 3,
          "replies": {}
        },
        "gomywvr": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomywvr/",
          "text": "I graduated last year and am now working a 40 hr/week desk job. It's terrible having to track all my time and have 40 hours of work we can bill clients.",
          "author": "femalenerdish",
          "created": 1614206827,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gokyoqm": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokyoqm/",
      "text": "I am really not bothered about being integrated in the academic community and think this holds me back.\n\nI don't attend any extra-curricular discussion groups (when I do I feel like I shouldn't be there). I just spent 2 hours on Twitter in a hole looking at all other students in my cohort and their various academic enthusiasm outputs on their twitter - feel like I'm both being left out / don't want to join in which is a bad cycle. I don't want to be like them cause I'm not interested in an academic career buuuut feel like I should? \n\nKeep trying to remind myself that my work is good, my supervisors like me and I know once the pandemic quietens I will be able to make PhD friends in person !",
      "author": "elleefran",
      "created": 1614174975,
      "upvotes": 43,
      "replies": {
        "gol882m": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol882m/",
          "text": "I really appreciate having my fellowship for that. We meet once a month (online now) & one of us talks about our research & maybe someone brings up something interesting they've read. Officially, the fellowship is for funding and looks good on a resume, but its also a good opportunity to meet other grad student work place acquaintances. I feel like I've reached my quota for extra curriculars with it alone, so I don't bother with any of that other stuff.",
          "author": "StellaPeekaboo",
          "created": 1614179779,
          "upvotes": 7,
          "replies": {
            "gol8tnp": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol8tnp/",
              "text": "fair! there are groups in my funding group too but each time I've gone it's not been great. Maybe I should start my own that is similar to the one you go to so that there's an environment I and hopefully others can discuss our work and things we are interested in",
              "author": "elleefran",
              "created": 1614180056,
              "upvotes": 6,
              "replies": {
                "gol9yzg": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol9yzg/",
                  "text": "Good luck! It can be rough getting discussion groups started. One time after I gave a presentation, no one had any questions, so the faculty advisor started calling on each and every person in the group to force them to make a comment of some sort...just made my talk feel even more uninteresting",
                  "author": "StellaPeekaboo",
                  "created": 1614180580,
                  "upvotes": 4,
                  "replies": {
                    "golcrmp": {
                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golcrmp/",
                      "text": "o gosh that's painful! all about the environment created isn't it",
                      "author": "elleefran",
                      "created": 1614181831,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gokyje1": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokyje1/",
      "text": "I'm terrible at keeping a lab notebook, often lose files that people send me, forget about deadlines, get disinterested with experiments that require an insane amount of tedious BS.  \n\n\nI was this was this way in grad school, during my postdoc, and still am to this day working in biotech. I'll never be famous, but I am certainly quite successful.",
      "author": "airwalker12",
      "created": 1614174889,
      "upvotes": 21,
      "replies": {
        "golo00e": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golo00e/",
          "text": "This makes me feel a bit better haha (I’m still trying to get my masters degree in Biomed Engineering but this sub was on my recommended) \n\nI guess best thing we can do is fake it till you make it haha",
          "author": "spicyystuff",
          "created": 1614186646,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gokxyol": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokxyol/",
      "text": "Weird. I don't remember making this post but it seems like I wrote all of that.",
      "author": "baenpb",
      "created": 1614174569,
      "upvotes": 74,
      "replies": {}
    },
    "gokxt6h": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokxt6h/",
      "text": "People keep talking about presenting at conferences. I'm in my second year (History phd) and never attended, let alone presented, at an academic conference. I tell myself that it's okay, and that I'll do something about it soon -- I don't know when 'soon' is, though.\n\nI prioritize sleep. If it's a choice between getting 8 hours of sleep or finishing the reading / response for tomorrow, I choose sleep, even if the difference is only an hour.\n\nDon't have a Twitter or follow academic blogs. I don't have a LinkedIn. I'm most active on Reddit. *Reddit*. But I'm lightning on email, so that's something.\n\nPeople intuit that I'm self-motivating (because I *am* self-motivating, damnit) but reassurances that I'm on the right path are necessary or I get deflated. A couple of my peers know this or are like this, so we keep a little compliment-circle to cheer each other on.\n\nEdit: if you want an example of being too active on Reddit, I'm supposed to be doing French right now..",
      "author": "MaddestJas",
      "created": 1614174484,
      "upvotes": 128,
      "replies": {}
    },
    "gokxgft": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokxgft/",
      "text": "I copy everything was already said and procrastinate while waiting for my advisor answers (he takes a while to answer my emails).",
      "author": "hbsethginmaster",
      "created": 1614174282,
      "upvotes": 23,
      "replies": {}
    },
    "gokwrhl": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokwrhl/",
      "text": "I only update my lab notebook once a week which is often the day that I waste. I skim 90% of the papers out of the 10% tabs that I do not close.",
      "author": "miaolol",
      "created": 1614173886,
      "upvotes": 48,
      "replies": {
        "gokxvdd": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokxvdd/",
          "text": ">I am guilty of this. I do not upkeep my lab book, in fact I have random notes on lab paper napkins that I have just put into the notebook so I don't forget 1. facts, and 2. to have something in there. I don't know I'm almost up to the last semester of my PhD and I have filled out a collective of 20 pages. mainly in pencil too....",
          "author": "oalton72",
          "created": 1614174517,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "gokwalw": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokwalw/",
      "text": "If I have free time to myself, I'm more likely to watch Teen Mom 2 or Married at First Sight than read Professor Supersmart McFamous' newest book.",
      "author": "False-Guess",
      "created": 1614173611,
      "upvotes": 206,
      "replies": {
        "gokzlir": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokzlir/",
          "text": "This insecurity was squashed for me early on. My lab mates used to watch soccer while we worked in the office. The guy I was most intimidated (?) by used to watch random sports while he was working. I’d look over and on his 3rd monitor, he’d have Italian women’s basketball or something like that playing lol. \n\nI like to decompress with really dumb shows and I can’t feel bad when everyone else does it while working :p",
          "author": "happytransformer",
          "created": 1614175473,
          "upvotes": 71,
          "replies": {
            "golirfu": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golirfu/",
              "text": "Your lab mate definitely was into sports gambling. I can relate to the Italian women’s basketball on a third browser lol.",
              "author": "ZeldLan",
              "created": 1614184393,
              "upvotes": 48,
              "replies": {}
            }
          }
        },
        "gokzq3e": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokzq3e/",
          "text": "As someone who works for that professor I can tell you you’re not missing out.",
          "author": "villagevigaro",
          "created": 1614175542,
          "upvotes": 20,
          "replies": {}
        },
        "golnlvh": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golnlvh/",
          "text": "I watched Bling Empire on Netflix hahahahahhaha and I am happy with my use of time.",
          "author": "givemeyourdonut",
          "created": 1614186472,
          "upvotes": 10,
          "replies": {}
        },
        "golux5m": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golux5m/",
          "text": "Oh hell, right? I play video games or I watch TV. At the end of a, probably mediocre productivity day, the last thing I want to think about is MORE in the topic. I'm a believer that my personal time helps make it possible for me to have interesting ideas in my business time.",
          "author": "ImperiousMage",
          "created": 1614189366,
          "upvotes": 9,
          "replies": {
            "gonjh57": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonjh57/",
              "text": "Good way of looking at it. I try to make sure I take breaks- but it is still hard to mentally disconnect.",
              "author": "Euneiphreniae",
              "created": 1614216638,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gol4aic": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol4aic/",
          "text": "I like to watch clips of Dr. Phil on YouTube while I wait for reactions & stuff in the lab :D",
          "author": "StellaPeekaboo",
          "created": 1614177888,
          "upvotes": 4,
          "replies": {
            "gomesp1": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomesp1/",
              "text": "lol I watch Dr. Phil too! He was part of my daytime TV rotation back in the day along with Judge Mathis and Judge Joe Brown. I still love some Dr. Phil and Judge Mathis.",
              "author": "False-Guess",
              "created": 1614196988,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gokuwsq": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokuwsq/",
      "text": "Constant reinforcement and anti-siloing. Tell your grad student friends that they're smart, talented people who deserve to be there and they'll tell you the same. The worst thing that can happen is you working all alone, thinking you are all alone, and never hearing how that work really is valid.\n\nBecause y'all are smart talented people and deserve to be here.",
      "author": "cikmatt",
      "created": 1614172782,
      "upvotes": 146,
      "replies": {
        "golv8gb": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golv8gb/",
          "text": "OMG yes. The most important thing to make this workable is to have friends in the same boat. If I can add anything it would be that you should try to find people outside your lab/work area as well. Bitching about your area only makes you feel worse, it can be really refreshing to see others are very much in the same boat across fields.",
          "author": "ImperiousMage",
          "created": 1614189476,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "goksu3g": {
      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goksu3g/",
      "text": "I work 40 hours a week and don't work weekends. But if my deadline is a Monday, then I do 95% of the work Sunday night.\n\nOf those 40 hours many are spent daydreaming or on my phone. \n\nI have at least 1 wasted day a week. \n\nI skim 95% of papers. \n\nI don't really care about being revolutionary in my field, I just went to grad school because I wanted to learn some more stuff I thought was neat. Now I'm stuck competing with a bunch of psychos that care more about work than hanging out with their friends or family.",
      "author": "PeaceForce",
      "created": 1614171482,
      "upvotes": 674,
      "replies": {
        "gokynbt": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokynbt/",
          "text": "I literally just wanna teach, I don't want to be a nationally recognized academic and spokesperson on x topic. That literally doesn't feel like an option in my program sometimes.",
          "author": "skelechel",
          "created": 1614174952,
          "upvotes": 70,
          "replies": {
            "gom0t7o": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom0t7o/",
              "text": "What's your specialty? Have you been looking into PUIs (primarily undergraduate institutions)? They can actually have a lot of difficulty recruiting good professors in a lot of fields, and are more focused on learning than research.",
              "author": "FuzzytheSlothBear",
              "created": 1614191520,
              "upvotes": 6,
              "replies": {
                "gom7xzi": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom7xzi/",
                  "text": "I haven't started my PhD yet, I start in the fall, but I want to study biosocial criminology and that's kind of a niche, controversial field and very few schools actually even acknowledge it. I could teach criminology/criminal justice anywhere tho probably, and I'm surrounded by universities luckily so I'll definitely look into that!",
                  "author": "skelechel",
                  "created": 1614194210,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "gom25et": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom25et/",
              "text": "Have you looked into discipline based education research (DBER) at all? I'm now a post doc (soon to be fixed term professor) in education research and it lets me teach while also doing research to push forward on better teaching, and I find it super rewarding!",
              "author": "roboe92",
              "created": 1614192013,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gokwtmd": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gokwtmd/",
          "text": "This is the one, I literally dont understand how people can prioritize anything over some free time with an SO or their family.",
          "author": "Pringle65",
          "created": 1614173919,
          "upvotes": 191,
          "replies": {
            "gol6vn7": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol6vn7/",
              "text": "Seriously. And it's not like they don't have one!\n\n\nTons of people in my program are married or dating, but it seems like it's only the ones with kids that have a healthy view about what the work week is (spoiler: it doesn't include working both days every single weekend). \n\n\nAlthough I have noticed it seems like age is a factor at least where I am. Most people start my program at age 21 (extremely competitive field). Those of us who were a little older seem to take more time to be with friends and family (at least where I am)",
              "author": "penguinhearts",
              "created": 1614179139,
              "upvotes": 81,
              "replies": {
                "gol7rvq": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol7rvq/",
                  "text": "Right, i’m a little younger and yeah I could work extra hard on a friday or I can leave a little early and watch some tv with my girlfriend. Trust me I love my field but i’m not gonna break my back every week.\n\nI wish my advisor (who has a family of his own) could see it that way too",
                  "author": "Pringle65",
                  "created": 1614179568,
                  "upvotes": 37,
                  "replies": {
                    "golhhsr": {
                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golhhsr/",
                      "text": "As a person who is ready to enter grad school, has a fiance, and will likely have a kid soon... the reason I'm working every weekend and prioritizing grad school is because I'm a poor person. I had to join the military to pay for my undergrad. My family has always been poor. They all live in trailers. Abuse is plenty rampant among poor people (at least in Alabama) because everyone's at their wits end. I don't just need to get a graduate degree. I need to stand so far out that even if I fail, I'll still land a job making 70-80k. Money won't solve all of my problems but it can give me the comfort, space, and opportunity to work on them.",
                      "author": "wesg2",
                      "created": 1614183859,
                      "upvotes": 54,
                      "replies": {
                        "gom0f1m": {
                          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom0f1m/",
                          "text": "I feel you. I think sometimes as a first generation student there can be added pressures. Like I literally tell myself. \"I CANNOT FAIL!\" I really think at times I  have no other option but to succeed.Especially when you are trying to write a new story for your family and access a more comfortable lifestyle. \n\nBeing the one who breaks cycles is tough. But I think it's important to say....Keep working hard! You can do this! :)",
                          "author": "AllAboutThatEd",
                          "created": 1614191377,
                          "upvotes": 12,
                          "replies": {}
                        },
                        "gon65lu": {
                          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gon65lu/",
                          "text": "There is a lot of evidence that increasing hours either doesn’t increase productivity at all or has seriously diminishing returns past a certain point. (This has been studied in a variety of contexts, should be easy to find on Google). If you’re really working long days 7 days a week you are not necessarily setting yourself up for success like you imagine, and are increasing your risk of burnout and mental health issues which can actually really derail your work.\n\nI’d recommend reading “Deep Work” by Cal Newport. It really helped me understand how to do good work, and part of that was actually not working 7 days a week anymore. (Even if you are attached to working a lot of hours it’s worth a read anyway, there is a lot of good info in there).",
                          "author": "Thunderplant",
                          "created": 1614210213,
                          "upvotes": 11,
                          "replies": {}
                        },
                        "golhq28": {
                          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golhq28/",
                          "text": "I feel like you can be an effective and successful grad student without overworking yourself and losing your mind.",
                          "author": "Pringle65",
                          "created": 1614183956,
                          "upvotes": 29,
                          "replies": {
                            "gollv17": {
                              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gollv17/",
                              "text": "Not when I'm competing with rich kids at MIT, Carnegie Mellon... etc. It's competitive and the odds are stacked in their favor. To each their own though, y'know. Everyone goes through life differently. Some people don't feel the pressure that I feel. Essentially my entire purpose in life is to rise so far above my station that my children will have the opportunities that rich kids have. The idea being that I'll teach them where my family came from, and the things that I did to get where I am. They can do with that information what they will, but hopefully THEY'LL actually be able to make a difference in the world or at least have a happy life. Money begets money. If I can get up there then maybe they can stay up there or go further. And life is crazy so maybe I'll do all of this and get hit by a truck the day I land a job at Google. But hey, gotta try. And all of that plan begins with the military, continues with undergrad and grad school, and ends with a killer savings plan and potentially entrepreneurship.\n\nI appreciate how other people go to grad school with other intentions and purposes. It seems that the question is \"how can people prioritize things other than \"free time with an SO or family\"\". As the guy that's prioritizing differently, I'm just tying to outline my reasons.",
                              "author": "wesg2",
                              "created": 1614185716,
                              "upvotes": 33,
                              "replies": {
                                "gomhyxa": {
                                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomhyxa/",
                                  "text": ">Essentially my entire purpose in life is to rise so far above my station that my children will have the opportunities that rich kids have.\n\nMuch respect to you! Just want to say that spending quality time with your kids with an average middle-class income is likely to do them a lot more good than being \"rich kids\" who never get to see their dad. They won't be aware of the trauma that you had to go through as a kid and won't understand your reasons for not wanting \"free time with SO and family\".",
                                  "author": "peregrination_",
                                  "created": 1614198340,
                                  "upvotes": 24,
                                  "replies": {
                                    "gomyxrz": {
                                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomyxrz/",
                                      "text": "Yeah that's something that I fight with. I figure they probably wont really remember the first two or three years of their lives. Hopefully once I'm actually IN a high salary position I can pump the brakes. No doubt, family time is vital. If I had it my way, I would wait to have kids. Unfortunately there's a biological clock ticking (more so for my fiance than me).",
                                      "author": "wesg2",
                                      "created": 1614206838,
                                      "upvotes": 5,
                                      "replies": {
                                        "gonjcgn": {
                                          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonjcgn/",
                                          "text": "Yeah man, it's a difficult balance to strike. I admire your tenacity and your desire to give your kids a better experience than you had. Kids don't have \"[episodic](https://memory.ucsf.edu/symptoms/memory)\" memories of their first 3-ish years of life, but it's a crucial time for development of social skills and [attachment styles](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3774302/) (haha can you tell that my research area is neuroscience?). It's also going to be pretty tough on your fiance to take on the entirety of childcare, as this comment seems to imply. \n\nAt the risk of being extremely obnoxious with unsolicited advice, maybe it would help to consider what you are doing for your kids' benefit (e.g., giving them stable housing, good education, and emotional intimacy), vs. what you are doing for your own benefit (e.g., using career success to try to compensate for the bad experiences in your past).\n\nI've always wondered about the \"biological clock\" concern. The risks of decreased fertility or infant developmental problems don't begin to show up until the late 30's. Most of my female colleagues in my PhD program don't have a problem waiting until they have stable career to have kids.\n\n> If I had it my way, I would wait to have kids. \n\nI'm sorry about that. The decision of when to have kids should ideally be a 100% mutual agreement between the parents.",
                                          "author": "peregrination_",
                                          "created": 1614216580,
                                          "upvotes": 6,
                                          "replies": {
                                            "gonvwh1": {
                                              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonvwh1/",
                                              "text": "I'm definitely gonna have to read a LOT of material on childcare. I don't want to leave childcare to my fiance. She'd beat my *** lol. Time man. Never enough of it. I see many nights with 3 hours of sleep. \n\nAs far as the biological clock goes, she's older than me and has been ready for kids for awhile. Realistically, when I see that first kid in my arms I'll probably never want to let them go and I'll drop the ball wherever I'm at career-wise. End up in upper IT or software development, 9-5. Like I said, shooting so high that even if I fail I hope I end up with 70-80k salary. I feel comfortable raising a kid with that. For context, I live in Arlington, VA. Higher cost of living and higher salaries to meet that.",
                                              "author": "wesg2",
                                              "created": 1614222400,
                                              "upvotes": 3,
                                              "replies": {}
                                            }
                                          }
                                        },
                                        "gonjh5g": {
                                          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonjh5g/",
                                          "text": "I also think you are assuming this hard work WILL result in a high paying job. At the end of the day, whether you break your back, prioritizing being the “best” or whether you prioritize family and your mental health, you will have a grad degree. Your experience in the military honestly puts you ahead of a lot of the rest of us. What helps the most is moving past the destructive idea that you are “competing” against rich kids who have advantages over you. You need to figure out what you have and how to work that to the best of your ability and make it through with your mental health intact so you arent jaded and broken for your future children. I dont think your kids will care if their dad is making 80k or 100k if their dad is jaded and burned out from spending all of his waking hours trying to be the best just to realize there will always be someone doing something “better” if you really think about it. Be the best version of yourself and be proud of your work, but dont sweat that stuff, focus on what REALLY matters.",
                                          "author": "GayMedic69",
                                          "created": 1614216638,
                                          "upvotes": 6,
                                          "replies": {
                                            "gonpw44": {
                                              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonpw44/",
                                              "text": "You right. I don't plan on burning myself out forever, just the next couple years. I don't want my kids to be too affected. It seems to be a fine line. I do a lot of therapy though. Spend a lot of time figuring out what ways I can build positive relationships. I like to imagine I'll continue that with my kids. I also kinda lucked out and fell in love with a montessori preschool teacher. Heart of an angel.\n\n I'm not worried about being jaded. Been there done that, got the depression, meds and disability to go with it. Ain't nothing but a thing.",
                                              "author": "wesg2",
                                              "created": 1614219610,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "gomsti0": {
                                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomsti0/",
                                      "text": "As that kid, I want to highlight this.",
                                      "author": "MissBlack7",
                                      "created": 1614204168,
                                      "upvotes": 3,
                                      "replies": {
                                        "gonn7mk": {
                                          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonn7mk/",
                                          "text": "Same, unfortunately :(\n\nI'm not even a \"rich kid\", just your average privileged middle-class girl. My parents both had bad childhoods. They seemed to view their children as their chance to get a \"do-over\" childhood, which unfortunately meant projecting all of their mental baggage onto us instead of figuring out what we actually needed. \n\nMy sibling and I are both in therapy now, feeling the result of that emotional neglect lol.",
                                          "author": "peregrination_",
                                          "created": 1614218353,
                                          "upvotes": 6,
                                          "replies": {
                                            "gonz740": {
                                              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonz740/",
                                              "text": "I hear you. My mom was mostly around but my dad just seemed to me to not care. I didn't realise he use to know what was up with me thru my mom and did care... He was just really busy with work and some other major life stressors which were not his fault. He even battled depression for a couple of years. After which, he completely turned around and fixed his life. But by then, I was out of the house. So it took a lot of work on both sides to build back our relationship. Thankfully, he kept trying and after some time I forgave him and also started trying. It was only recently that I understand his life story when he shared it with me. Men don't usually share emotions which also had contributed. I feel really lucky he tried to repair our relationship and didn't give up. Being the only child also helped a bit. \n\nGuys, share your emotions and experiences with your children. Let them see you as human. \n\nSorry if this got to deep.",
                                              "author": "MissBlack7",
                                              "created": 1614224016,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "goqjywg": {
                                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goqjywg/",
                                      "text": "I agree with this a lot as a kid that grew up not really seeing her dad. However I totally understand that everyone has their own reasons for working and there isn't enough time in the day for everything. For context, my dad was an immigrant and also felt a ton of pressure to rise above his station as the only kid in his family to go abroad. \n\nI guess the best advice I can give (to anyone reading) is to just have that quality time with your kid, no matter how short it is. My dad was shy around me since I was a girl, not a boy, and he would just ask my mom how I was doing instead of directly asking me. We never spoke a lot when I was growing up cause my dad and I are both shy introverts. We're doing better now and I understand that he cared a lot about his job so didn't spend as much time with us as he wanted.",
                                      "author": "memowz",
                                      "created": 1614279005,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                },
                                "gom8he8": {
                                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gom8he8/",
                                  "text": "Would you drop out for cushy enough job offer if it came your way?  Not judging, just curious.",
                                  "author": "Vermilion-red",
                                  "created": 1614194418,
                                  "upvotes": 3,
                                  "replies": {
                                    "gomk6bi": {
                                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomk6bi/",
                                      "text": "Not OP but: Yes. 100% yes.",
                                      "author": "trillwhale",
                                      "created": 1614199226,
                                      "upvotes": 2,
                                      "replies": {}
                                    },
                                    "gomylzv": {
                                      "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomylzv/",
                                      "text": "Depends on \"Cushy\". I'm looking at data scientist positions. $100k salary. It's a long shot but i might make it.",
                                      "author": "wesg2",
                                      "created": 1614206692,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gomivjr": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomivjr/",
              "text": "Ah, I can answer this one. It’s partly (a) the thrill of competition (b) couldn’t get an SO if my life depended on it (c) working and getting results helps alleviate the impostor syndrome.",
              "author": "FlyingQuokka",
              "created": 1614198710,
              "upvotes": 8,
              "replies": {}
            },
            "gonmgee": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonmgee/",
              "text": "I(42m) have a Wife(42f), 3 children (17m,15m,12f), and because I wasn't like the vast majority of my peers (under 25, single, no kids), I would be looked at funny for not wanting to \"hang\" after class, or spend a vast majority of my studio time on campus. \n\nI was even supposed to be the keynote speaker at our impromptu Zoom graduation (Yay, COVID class 2020🙄), and missed it due to an emergency room visit for one of the kids.",
              "author": "crewchief227",
              "created": 1614218001,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gol8lqf": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol8lqf/",
          "text": "Same! I don't interrupt my sleep schedule for work. I go to bed around 10pm, even if I didn't get all the work done that I should have. \n\nIn my program, a healthy sleep schedule is like a badge of shame. It means you're not a *true martyr for the cause*. The only acceptable ways of spending time on yourself, according to my peers, are happy hours, going to the gym, *maybe* a hike on the weekend. According to my peers, it's shameful to watch netflix instead of going to the lab on the weekend. When you (inevitably) burn out, *then* it is acceptable to make a grand show of taking a week off to go visit family or whatever. \n\nI do not think that an arbitrary amount of \"progress\" on my arbitrary degree timeline is important enough to lose sleep or free time over. I simply do not care how long it takes me to graduate. I enjoy my program overall and don't see anything wrong with working slow, if it means I can have a normal life *and* a PhD. \n\nI think some of the people around me, who devote almost every waking hour into their grad program (not exaggerating, these people exist), must not have a strong sense of identity outside of their studies. I feel sorry for them.",
          "author": "peregrination_",
          "created": 1614179955,
          "upvotes": 47,
          "replies": {
            "goobw1d": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goobw1d/",
              "text": "I'm definitely in the boat of devoting every waking hour into my program, but it's mostly just to stay afloat. I definitely would not get good grades if I wasn't pushing myself this hard, and I really wish I was capable of doing well and having a more reasonable amount of time for myself. My program is competitive, and most of my classmates are coming from Ivies, science/technical backgrounds, and have loads of field experience... I have none of that. I didn't realize how math/programming-heavy my program would be going into it, so I have to go to every office hours and look like an idiot just to get a grasp on the material. But I also prioritize sleep over grades, and I try to do a little self care by devoting some time to hobbies during short breaks and light reading during meals. \n\nThis semester especially, I feel like getting everything in is better than pushing myself to get an A no matter the cost. I had lengthy hospitalizations in high school and undergrad because I'm so sensitive to sleep, and it feels like a slap in the face when people brag about pulling all nighters to get their work done or joke about it when for me, that would result in medical leave or worse.",
              "author": "gnomelover3000",
              "created": 1614231379,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gol93xd": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol93xd/",
          "text": "I'm at a top school in my field and this is how I feel every day. I came here so that funding and access to facilities was never a problem and so that I could get as much knowledge out of it just for the sake of learning. Now I'm stuck in a 21k race with a herd of elephants following me when all I wanted was to hike and enjoy the view.",
          "author": "deathoflink",
          "created": 1614180187,
          "upvotes": 23,
          "replies": {}
        },
        "goljexz": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goljexz/",
          "text": "Your comment is inspiring and comforting. I enjoy my field and learning cool new things, but I really don't care about working my way up the academic ladder. It's full of politics, competition to publish (because how can you have value as a human being if you've not published eleventy hundred papers) and fighting for funding. \n\nThe idea that's communicated if I don't want academia to rule every waking moment of my life is that I don't have what it takes to be in the research. I can pipette, quietly cry in the bathroom and repeat experiments until I feel like I'm losing my sanity, so how am I not cut out for research?\n\nI've seen one genuinely happy Prof who has healthy boundaries and a passion for their work as well as a life outside of the lab. The rest seem to exist solely in their academic bubbles and are excessively busy, overworked and 'carrying on' because you know that's \"just the way research is\". I don't want that.\n\nThanks for your honesty :)",
          "author": "CG_blue",
          "created": 1614184668,
          "upvotes": 15,
          "replies": {}
        },
        "gol353e": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol353e/",
          "text": "I definitely have moments where I work with someone that I think is absolutely insane and realize to my horror she/he will be my future colleague.",
          "author": "FPatt737",
          "created": 1614177317,
          "upvotes": 14,
          "replies": {}
        },
        "gol71lu": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gol71lu/",
          "text": "I wanna print this out and hang it over my computer for PhD-spiration",
          "author": "SteamingHotChocolate",
          "created": 1614179220,
          "upvotes": 14,
          "replies": {}
        },
        "golbozq": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golbozq/",
          "text": "Wow that’s me",
          "author": "theArtOfProgramming",
          "created": 1614181354,
          "upvotes": 7,
          "replies": {}
        },
        "gomjt4n": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gomjt4n/",
          "text": "How do you skim and still retain information??? This is a serious question and one that would bring my head above water with 20-25 articles to read every week!",
          "author": "trillwhale",
          "created": 1614199087,
          "upvotes": 5,
          "replies": {
            "gonqczn": {
              "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gonqczn/",
              "text": "I definitely don't remember the papers as well if I just skim, but I take notes on the parts that are relevant to me. Usually a couple lines to a short paragraph, depending on the relevance. Hope this helps, 20-25 articles a week seems like a lot!",
              "author": "PeaceForce",
              "created": 1614219831,
              "upvotes": 5,
              "replies": {
                "gont3cc": {
                  "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/gont3cc/",
                  "text": "It is the worst. Namely, it seems needlessly excessive for the sake of being excessive. \n\nWe’ll slog through regardless - I get the sense that professors don’t care much for feedback in that manner!",
                  "author": "trillwhale",
                  "created": 1614221082,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "golqo0a": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/golqo0a/",
          "text": "I appreciate that last line an awful lot.",
          "author": "excelnotfionado",
          "created": 1614187789,
          "upvotes": 3,
          "replies": {}
        },
        "goo3cb6": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goo3cb6/",
          "text": "Haha I really related with that last part 😂 I literally don’t care about being mediocre although I still want to do my best to help people. It’s just a lot to worry about how well youre doing at your job all the time so I just stopped caring as much to compensate.",
          "author": "jana6417",
          "created": 1614226234,
          "upvotes": 3,
          "replies": {}
        },
        "goqzy1b": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/goqzy1b/",
          "text": "I'm lucky if I work 40 hours a week, it's especially been bad during  covid haha",
          "author": "rohit275",
          "created": 1614285293,
          "upvotes": 1,
          "replies": {}
        },
        "grdpxre": {
          "link": "/r/GradSchool/comments/lrazsk/confessions_the_antidote_to_imposter_syndrome/grdpxre/",
          "text": "This is exactly how I feel and operate, couldn't have said it better myself.",
          "author": "so_dopamine",
          "created": 1616085719,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066379
}