{"sid": "pi7auo", "link": "/r/GradSchool/comments/pi7auo/what_is_graduate_school_like_in_poli_sci/", "title:": "What is graduate school like in poli sci?", "text": "Graduated in 2017 with a BA. Not much luck in finding work since, been working retail after graduating. I originally planned on going to graduate school, however administrative nightmares had made my first college experience a nightmare. Never had an advisor to guide me through college on a course plan to prepare me for graduate school. I was stuck selecting my own courses with no help or idea on what I was doing. \n\nMy lack of luck in employment and my previous experience on top of the four years that have passed since graduating has me feeling at such a disadvantage that I’m not sure if graduate school would be a possibility or even worth the investment for me. \n\nWhat have some folks experiences been like? I’m sure someone here has had similar problems and has some advice on how they got through it. I’m also curious to what in general being a grad student is like compared to undergrad school? \n\nShould I stop by my University in my city and speak to someone in the poli sci department or in admissions?", "author": "CheBae101", "created": 1630820261, "retrieved": 1632953136, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"hbrwsp6": {"link": "/r/GradSchool/comments/pi7auo/what_is_graduate_school_like_in_poli_sci/hbrwsp6/", "text": "I really heavily considered getting my masters in political science but due to the job prospects went a different direction. I was Art History + IR in undergrad and wound up in landscape architecture, which I’ll probably use to work in public planning and eventually go into local politics. I got a certificate in environmental politics and policy which let me take a bunch of political science classes, and while the knowledge is very helpful I would struggle to turn it into a career without just applying the info to another field. \n\nMy advice is similar to previous commenters, figure out what you would actually want to do in the sphere of political science and find a program specific to that. MPA and MURP (urban and regional planning) are both great programs that tend to cater to working professionals and people who have been out of school for a while, at least at my school.", "author": "Several-Computer-978", "created": 1630904577, "upvotes": 2}, "hbpk282": {"link": "/r/GradSchool/comments/pi7auo/what_is_graduate_school_like_in_poli_sci/hbpk282/", "text": "I had pretty similar in undergrad, like I was just cruising through and nobody was helping me prepare for anything beyond just graduating until my last year of school when I finally found a professor that was somewhat helpful. It sucks.\n\nLike the other commenter said, I wouldn’t bother with a poli-sci masters degree if you’re not planning on doing a PhD (and unless you really know what you’re getting yourself into, I’d caution against that). \n\nIf you’re really interested in working in the world of government, a masters in public administration (MPA) or public policy (MPP) might be better directions. They’re more professional degrees with more clear cut career paths. Somewhere on the professionalism/career prospects spectrum between poli-sci and MPP/MPA lies international relations as well. With an MA in IR, there’s lots of interesting jobs in DC both in and out of government that you become a lot more competitive for. Again for all of those options, like the other person said, you’ll want to choose your school very carefully.\n\nFor undergrad I just went to the state school that most of my friends were going to. It had cheap tuition and damn near open enrollment. Then I had an experience like yours. I got into a very good school for my masters and the difference is night and day! They have so many￼ more resources for students to prepare them for whatever the next step is. They have great career services and mentors at every step of the way. Even if the education is the same I’d get at my old state school, the mentorship and career services alone are worth it.\n\nAnother good option for social science undergrads is law school. It’s of course not for everyone, but you’re probably reasonably well prepared for it and it’s got decent career outlook.", "author": "ThrowawayHistory20", "created": 1630863333, "upvotes": 1}, "hbnws5s": {"link": "/r/GradSchool/comments/pi7auo/what_is_graduate_school_like_in_poli_sci/hbnws5s/", "text": "Graduated with the same degree in the same year. For a few years I was looking half heartedly into graduate PS programs at my local school, but my prof dad gave me the same advice the first poster here did, \"what is it you actually want to do with a graduate degree in political science\". Once I realized  I didn't have a good answer, I accepted that what was really going on was I was reaching the end of my 20s and missing being an undergrad, and looking for an excuse to get that time of my life back. I work for the DoD so I side stepped the employment issue, but no denying PS doesn't get many opportunities out the gate. Eventually I found and applied to a graduate program last year that was far more applicable to my line of work, and one that I actually want to do, rather than one I'm doing for the sake of it.", "author": "calmlaundry", "created": 1630827708, "upvotes": 2}, "hbnrxby": {"link": "/r/GradSchool/comments/pi7auo/what_is_graduate_school_like_in_poli_sci/hbnrxby/", "text": "[deleted]", "author": null, "created": 1630823712, "upvotes": 3}}}