{
  "sid": "qt8obi",
  "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/",
  "title:": "Gap year before grad school?",
  "text": "I’m set to graduate with my BS in May of 2022 and want to attend grad school for sure. I’ve been going back and forth between if I should apply for the Fall 2022 admission rounds or take a gap year and apply for Fall 2023. \nMy parents are supportive of me either way, I think I want to hear from current grad students who either went straight into their programs or who took a gap year. \nI see the benefits of taking a gap year & also not, just want to hear any opinions or thoughts from current grad students especially since the coursework is much more than undergrad. \nThank you!!!",
  "author": "GabbyP_2828",
  "created": 1636832931,
  "updated": 1637182743,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "hkjg7jp": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkjg7jp/",
      "text": "I’m very glad that I let myself have a break from school before going on to grad school. That said, I’m in a 6-year PhD program. You might consider how burnt out you feel and how long your program would be.",
      "author": "passerem",
      "created": 1636859503,
      "upvotes": 3,
      "replies": {}
    },
    "hkhsvyr": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkhsvyr/",
      "text": "I took a gap year but my field of study really values experience. So specifying your field of study would probs generate more relevant responses for you.",
      "author": "MotvStr",
      "created": 1636833545,
      "upvotes": 2,
      "replies": {}
    },
    "hkhuc5l": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkhuc5l/",
      "text": "Good advice to add my major, it would be Public Health, not sure which area to specialize in quite yet.",
      "author": "GabbyP_2828",
      "created": 1636834146,
      "upvotes": 2,
      "replies": {
        "hki7qxu": {
          "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hki7qxu/",
          "text": "I'm currently in a Biostatistics MS program in a school of Public Health, and it seems that what's valued most is a student's sense of direction (i.e. where will you be going with your degree and why + how will the university enable you to accomplish these things) as well as experience in the field you'd like to go (whether it's a class or research completed in undergraduate, or an internship or volunteer work).\n\nWhat does your current major entail? Depending on your that now, it may be more beneficial to head straight into your next program. It depends on what you're currently studying and where you'd like to end up in the Public Health field.\n\nFeel free to DM me if you want to talk more one-on-one about it. I know how stressful going into your next program can be.",
          "author": "PyreLegion",
          "created": 1636839896,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkj11ym": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkj11ym/",
      "text": "I graduated with my BS in May 2021 and went straight to grad school, the reasons why were:\n\n1. I felt that if I would have taken a gap year then I wouldn’t want to go back to school, because I would be used to not being in school…if that makes sense \n\n2. I already had a good routine of balancing school and life so I felt like it made sense to continue with that routine and go right away \n\nI’m not against gap years at all, but for me I knew it wouldn’t have worked. More than likely I just would’ve gone straight into getting a full time job in my field and not go back to school. But I’ve wanted to go to grad school and to make sure I fulfilled that, I went right away.",
      "author": "JustChillinn99",
      "created": 1636852586,
      "upvotes": 2,
      "replies": {}
    },
    "hkj3rfb": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkj3rfb/",
      "text": "I’m currently applying for PhD programs after taking a gap year. The main reasons I took a gap year was: 1) experience, I needed way more research experience in my interests to really determine if I want to go further with it. 2) COVID; I was thinking of applying last fall but the thought of starting online and staying home literally sounded like torture. I’m super dependent on my environment for productivity and mental stability. I don’t have either at home. \n\nIf you think you’re in a good place with a solid chance of getting in; go for it. If you do take a gap year, do something to pad the CV and build connections. My gap year was used working for several labs and getting a full-time industry research job in my field. I know fully what I want to study and research in a program, I wouldn’t be able to say the same last year. Good luck friend!",
      "author": "SlothTheScientist",
      "created": 1636853804,
      "upvotes": 2,
      "replies": {}
    },
    "hkl3r0y": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkl3r0y/",
      "text": "I took three years between finishing my Bachelor's degree and starting graduate school. I can recommend a gap year for so many reasons:\n\n1) Take time to confirm your goals. I thought I wanted to go to law school. On the advice of several lawyers I worked for in college, I opted to put law school off and work instead. My career goals and my general understanding of myself and what I wanted out of a career, lifestyle, the place I lived, etc. changed drastically in that time period. \n\n2) Money. I cannot tell you how much more comfortable I am financially having saved money for three years. Also, my parents were not going to be able to help me and I wasn't willing to take out student loans. \n\n3) Maturity. Working full time is just different from student life. The stakes are high and real. Even though I was a good student, my time management skills are much improved and I can tell a difference between my study habits and those of people in my program straight out of their Bachelor's.\n\n4) Grad school will always be there. There just isn't any rush, and I am an advocate of taking the time to really know what you want and figure out who you are before making such a big financial investment. I assume you're 20-21 at the moment, and anything older than that sounds super old. But trust me, people aged 24-29 still party and they do it well. \n\nAll that said, you should follow your heart and do what feels right for you! Anecdotally, I am so so so glad I didn't go to law school immediately. Now I am in Europe, studying something I am very passionate about, and doing quite well in the program. Feel free to DM me if you have any more questions!",
      "author": "lostmypaige",
      "created": 1636896893,
      "upvotes": 2,
      "replies": {}
    },
    "hkvc6zi": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkvc6zi/",
      "text": "I loved my gap year! I would recommend, it gives you time to miss school and reboots the motivation and excitement you’ll need for grad school.",
      "author": "saltnvinegarchips444",
      "created": 1637080448,
      "upvotes": 2,
      "replies": {}
    },
    "hki1f84": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hki1f84/",
      "text": "If you can afford it, go-ahead",
      "author": "mr_kazemiro",
      "created": 1636837158,
      "upvotes": 1,
      "replies": {}
    },
    "hkk2e0v": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkk2e0v/",
      "text": "I took off two years between undergrad and starting a Phd program, mostly because I didn't know what I wanted and ended up in an okayish job in my field. If you know you want to go to grad school now there is little benefit to putting it off IMO.",
      "author": "cman674",
      "created": 1636870888,
      "upvotes": 1,
      "replies": {}
    },
    "hkqsv97": {
      "link": "/r/GradSchool/comments/qt8obi/gap_year_before_grad_school/hkqsv97/",
      "text": "I took 3 years between a BS and a PhD and I think that was the best decision of my life thus far. During that time, I worked a bunch of interesting jobs that have nothing to do with my field of study, that involved living in different states and countries. I had the luxury of doing that during the early 2010s when the world was slightly less on fire but, if you can swing it, I highly recommend it.",
      "author": "Palex9",
      "created": 1636998204,
      "upvotes": 1,
      "replies": {}
    }
  }
}