{"sid": "pjfex5", "link": "/r/GradSchool/comments/pjfex5/3_weeks_in_and_i_feel_like_quitting/", "title:": "3 weeks in and I feel like quitting😞", "text": "Hi all. I’m 3 weeks in at my grad school and I feel like quitting but that’s not an option for me.\nI’m doing masters in statistics and I feel so behind in class. I did mathematics in my undergraduate where we didn’t have to do a lot of statistics courses; meaning we only did the basics.\nAnyway, it’s not an imposter syndrome because I actually have no idea what’s going on in my classes.\nI’m also a TA. I feel so unmotivated to do my schoolwork; I just sit in my room all day regretting my decision of going to grad school. \nSo, I guess I’m asking for some motivation or advice here…😩\n\nThank you for reading!", "author": "introvert2019", "created": 1630987088, "retrieved": 1632844753, "over_18": false, "upvotes": 4, "upvote_ratio": 0.75, "comments": {"hbx5kar": {"link": "/r/GradSchool/comments/pjfex5/3_weeks_in_and_i_feel_like_quitting/hbx5kar/", "text": "I'm only 6 days into my program and considering quitting. This sucks.", "author": "CherryBerry2021", "created": 1631015362, "upvotes": 4}, "hbwn4ar": {"link": "/r/GradSchool/comments/pjfex5/3_weeks_in_and_i_feel_like_quitting/hbwn4ar/", "text": "Heyo, I’m starting a stats master’s program in a couple weeks. Have you tried reaching out to your professors for help understanding what’s going on? If not, now would be an excellent time to do that so you don’t fall too far behind. It also shows that you genuinely want to understand and do well, and it gives you a great networking opportunity! Wishing you all the best fam", "author": "IntelligenceisKey729", "created": 1631000122, "upvotes": 3}, "hbw744p": {"link": "/r/GradSchool/comments/pjfex5/3_weeks_in_and_i_feel_like_quitting/hbw744p/", "text": "Hey! Just want to say you’re not alone. I’m in a DS masters right now, and although I did some programming in undergrad, I never did it to this depth/extent. I also have felt like I should quit- and would agree that it’s not imposter syndrome because it’s not that I know how to do this and I think I can’t, but I genuinely, actually don’t know what I’m doing. Whats been helping me is connecting with other students who need help, tapping into resources like office hours, and tapping into outside resources that have worked for me before, in my case, I just bought a code academy subscription. I know that we will be okay because admissions deemed that we would survive. They’re not gonna fail us. We might not be the most experienced in our respective cohorts but we WILL SURVIVE! Cheers and don’t be so hard on yourself. It’s gonna be alright", "author": "Mysterious_Donut_750", "created": 1630988661, "upvotes": 5}}}