{"sid": "ps7b5u", "link": "/r/GradSchool/comments/ps7b5u/has_anyone_here_bought_a_house_when_going_to_grad/", "title:": "Has anyone here bought a house when going to grad school?", "text": "I am going to be an incoming PhD student next fall, I was admitted last year and differed. I have been working full time and have some money saved up, I am thinking about buying a house since I’ll be in the area for 5+ years.\n\nHas anyone here done this? Advice?", "author": "SnooTomatoes3816", "created": 1632183477, "retrieved": 1632952169, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"he2y1tb": {"link": "/r/GradSchool/comments/ps7b5u/has_anyone_here_bought_a_house_when_going_to_grad/he2y1tb/", "text": "I bought my house my second year of my PhD program. I'm a vet so I was able to use my VA benefits. The hardest part was to get the bank to accept my stipend as income. They really didn't like the word 'stipend'. I eventually found Guaranteed Rate and they accepted a letter from HR saying a stipend is pretty much income and I'm in the program for 5 years and my income will never decrease during those years.", "author": "Wootie-89", "created": 1632485103, "upvotes": 1}, "hdpzr8k": {"link": "/r/GradSchool/comments/ps7b5u/has_anyone_here_bought_a_house_when_going_to_grad/hdpzr8k/", "text": "Man I couldn’t even afford to eat 3 meals yesterday lol", "author": "Lousy_Kid", "created": 1632234588, "upvotes": 2}, "hdpwl8v": {"link": "/r/GradSchool/comments/ps7b5u/has_anyone_here_bought_a_house_when_going_to_grad/hdpwl8v/", "text": "My friend did the same thing. Bought a condo. And now that he's graduated, he's renting it out.", "author": "raistlin65", "created": 1632233211, "upvotes": 1}, "hdpls17": {"link": "/r/GradSchool/comments/ps7b5u/has_anyone_here_bought_a_house_when_going_to_grad/hdpls17/", "text": "I tried to buy a house a few years ago, but the state of Florida makes it almost impossible for a graduate student to buy a house, since you need two years of previous income history (I went straight into grad school from undergrad), and you also need to have an additional 3 years of guaranteed income remaining on your fellowship to be able to qualify. \n\nI'm not sure why they have the three year rule since no other profession has that stipulation, but it makes it incredibly difficult to buy because of that, since you basically have 1 day where you would technically qualify assuming you have a 5-year fellowship. I'd say look into the rules in your state to make sure you don't have that \"3 years of guarunteed income remaining\" rule, and also try to get prequalified for a mortgage before you start looking too seriously.", "author": "drizdar", "created": 1632227920, "upvotes": 2}, "hdo7op1": {"link": "/r/GradSchool/comments/ps7b5u/has_anyone_here_bought_a_house_when_going_to_grad/hdo7op1/", "text": "I bought before grad school, but the actual purchase was while I was still full-time employed and was a permanent remote worker (which helped with getting a mortgage). I was also moving to a city I knew I’d want to stick around in for at least a few years even if I hated school and dropped out, and it was also a city where the cost of rent makes buying economically rational even if you’re only staying for 2-3 years. \n\nHappy with the decision so far.", "author": "SockaSockaSock", "created": 1632191782, "upvotes": 1}}}