{
  "sid": "qo8h6n",
  "link": "/r/GradSchool/comments/qo8h6n/is_graduating_late_reflected_badly_on_a_grad/",
  "title:": "Is graduating late reflected badly on a grad school application?",
  "text": "So, I was supposed to graduate from a 2-year MA program summer of 2020. It's now a year and a half late and I still have yet to finish writing up my thesis. This is of course partly due to COVID but more so because of my extreme procrastination, especially after moving back home and becoming kind of disconnected from the school/advisor over the lockdown period.\n\nTo graduate within this semester, I will have to complete everything by the end of this month. It is more likely that I will finish a little later in December, which means that my official graduation will be semester 2 in May. Over all, the transcript will show that I took 4 years, excluding summer of the last year, to finish my degree. \n\nIs this bad for future grad school application? Will it hurt my chance of getting into good programs? Please note that since last year I have also been working as a research associate with a professor from another institute. I plan to take another year or two off to wait COVID out and gain more research experiences/refine my research interest. I will also be publishing papers during this time. Would this be sufficient to make up for the late graduation? \n\nAdditionally, since my current masters is with a local university (SEA), I am also contemplating doing another masters abroad. Differing perspectives between how masters and PhD programs assess applications would very much be appreciated. Thank you.",
  "author": "usashibu",
  "created": 1636230286,
  "updated": 1636656824,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.71,
  "comments": {
    "hjvt0ph": {
      "link": "/r/GradSchool/comments/qo8h6n/is_graduating_late_reflected_badly_on_a_grad/hjvt0ph/",
      "text": "Could you reasonably/truthfully say that you were a part-time student, based on your credit load?",
      "author": "PM_YOUR_MANATEES",
      "created": 1636423238,
      "upvotes": 1,
      "replies": {}
    },
    "hjnzpbu": {
      "link": "/r/GradSchool/comments/qo8h6n/is_graduating_late_reflected_badly_on_a_grad/hjnzpbu/",
      "text": "Yes it does look bad given its normal to finish them in 1-2 years. Why would you want to do another master's given you just spent 4 years on one?\n\nAnd now you plan on taking another 1-2 years off for what? To do nothing when you've barely been doing anything for 4 years already?",
      "author": "randomhuman7482",
      "created": 1636288262,
      "upvotes": 0,
      "replies": {
        "hjo7h2j": {
          "link": "/r/GradSchool/comments/qo8h6n/is_graduating_late_reflected_badly_on_a_grad/hjo7h2j/",
          "text": "I actually spent around three years and a quarter (for a 2-year program) but I think the transcript will show it as 4 years due to graduation date.\n\nAs for the gap years, it's not to take time off to do nothing. I will be working during said time. In fact, I have already been working since last year. This is the actual reason why I have put thesis writing aside. There were other more urgent obligations and I gradually lose focus over the year. Anw, to answer your question, I was thinking of trying out industry-based research job since most of my experiences so far have been within academia and I wanted to try it out before making future decisions about grad school.",
          "author": "usashibu",
          "created": 1636292596,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}