{
  "sid": "q4yatj",
  "link": "/r/GradSchool/comments/q4yatj/anxiety_about_failing_a_class_and_getting_kicked/",
  "title:": "Anxiety about failing a class and getting kicked out of the country",
  "text": "This is basically just me ranting but I just started a Physics PhD in August in the US, and I’m an international student. I am really enjoying my research in astrophysics but the classes are really kicking my butt. \n\nMy school has this policy where if you fail a class, they remove the tuition waiver, so either you drop out or have to pay for it yourself. \n\nI am usually pretty anxious about exams and doing well in classes, but knowing that failing a single class would get me to drop out and be sent back to my country is just too much. I am so worried all the time and the stress is preventing me from studying adequately for my exams. \n\nIdk what to do to make it better :(",
  "author": "phosphorescentdragon",
  "created": 1633828764,
  "updated": 1634099781,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.81,
  "comments": {
    "hg3a995": {
      "link": "/r/GradSchool/comments/q4yatj/anxiety_about_failing_a_class_and_getting_kicked/hg3a995/",
      "text": "Talk with the Physics grad coordinator and your professors about your concern. They want you to be challenged in your courses, but also to succeed. \n\nThe first year in a new program is always hard. Then you adjust. During this stressful period, it's best to focus on learning the material and learning the practices that help you master this more advanced material more effectively. \n\nSome schools have undergraduates who are not motivated to work. Most professors like to get rid of them. Having them fail works out for everyone.  That is not your situation!  Grad students are motivated and everyone's goal is that they succeed in the program. Nobody wants to put you in a situation of losing their funding.",
      "author": "IkeRoberts",
      "created": 1633863768,
      "upvotes": 1,
      "replies": {}
    }
  }
}