{
  "sid": "hvwupf",
  "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/",
  "title:": "I received a fully-funded PhD offer!",
  "text": "Best news I've gotten this year. I cried as I was reading the email. I've applied for this program since last year and I haven't heard back from them for many months. I was almost certain that I won't be getting it due to the whole pandemic mess but I'm so glad I received this good news today. I've been dreaming for this opportunity for many years and it feels so unreal to have the letter of offer right in front of me. This is will also be my first study abroad experience and I'm really looking forward to it! \n\nWon't be commencing so soon due to the pandemic, any advice on how I can prepare myself for this?\n\nEdit: Thank you all for the kind and supportive comments! It means so much to me especially to those who took the time and offered me some really great advice :') This community is great.",
  "author": "science_freckles",
  "created": 1595435184,
  "over_18": false,
  "upvotes": 708,
  "upvote_ratio": 0.98,
  "comments": {
    "fz2o67t": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fz2o67t/",
      "text": "Badass boss over here",
      "author": "RedFlutterMao",
      "created": 1595581886,
      "upvotes": 2,
      "replies": {}
    },
    "fyzeute": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyzeute/",
      "text": "First off, congratulations!!! :D it’s a huge achievement to even get accepted somewhere, so be proud! :)\n\nAs for preparing, I’d honestly say just relax; you’re going to take a deep plunge soon, and you don’t want to overwork yourself before then. It’d be like doing a hard workout before swimming; you might just set yourself up to drown. \n\nSo loosely review stuff maybe, but most of all enjoy the last bit of time before you start the journey :)",
      "author": "realFoobanana",
      "created": 1595514972,
      "upvotes": 2,
      "replies": {}
    },
    "fyyw1u5": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyw1u5/",
      "text": "Hey! I’m an Aussie too, just wondering what your GPA was to get straight into a PhD? All good if you don’t want to disclose 😅",
      "author": "jacksong97",
      "created": 1595502155,
      "upvotes": 2,
      "replies": {
        "fyyxega": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyxega/",
          "text": "Heyy, I did my degree in Malaysia with a cGPA of 3.64/4.00 (2nd upper class), i'm not entirely sure what's the score equivalent to an Aussie degree after conversion. I guess you have to look into the university's website to check the requirements. The entry requirement for my uni is [here](https://www.newcastle.edu.au/research-and-innovation/graduate-research/future-students/higher-degrees-by-research/eligibility). Hope this helps!",
          "author": "science_freckles",
          "created": 1595503374,
          "upvotes": 1,
          "replies": {
            "fyyxns3": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyxns3/",
              "text": "Cool thanks! Good work and good luck to you!!",
              "author": "jacksong97",
              "created": 1595503603,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fyyqzll": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyqzll/",
      "text": "First of all congrats. Would you like to tell what subject are you doing your PhD in??",
      "author": "sid316786",
      "created": 1595497245,
      "upvotes": 2,
      "replies": {
        "fyyx14s": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyx14s/",
          "text": "Immunology and Microbiology!",
          "author": "science_freckles",
          "created": 1595503048,
          "upvotes": 1,
          "replies": {
            "fyyx6j8": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyx6j8/",
              "text": "Congrats again! I hope you dow well in your PhD and with full motivation. I wish you best in your future endeavors.",
              "author": "sid316786",
              "created": 1595503182,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fyy1f4s": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyy1f4s/",
      "text": "Congratulations! Now the hard part begins...",
      "author": "Whereishumhum-",
      "created": 1595475038,
      "upvotes": 2,
      "replies": {}
    },
    "fyxx9v5": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyxx9v5/",
      "text": "CONGRATS !!!!! huge and amazing achievement!!!! you should be extremely proud :)",
      "author": "jesspwnsnoobs",
      "created": 1595472470,
      "upvotes": 2,
      "replies": {}
    },
    "fyxvg54": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyxvg54/",
      "text": "Eyyyyyyyyyyyyyy ! 👏👏👏👏",
      "author": "crappy_sandwich",
      "created": 1595471390,
      "upvotes": 2,
      "replies": {}
    },
    "fyxjhsq": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyxjhsq/",
      "text": "CONGRATULATIONS! That is amazing news!!!",
      "author": "jbanks019",
      "created": 1595464501,
      "upvotes": 2,
      "replies": {}
    },
    "fyxb4gh": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyxb4gh/",
      "text": "Congratulations! That's awesome!\n\nYou asked for how you can prepare, so I'll share something with you that I wish somebody had told me about: Zettelkasten. Here's a [comment](https://www.reddit.com/r/GradSchool/comments/hssbde/im_such_a_failure/fydvnr4/) I wrote for somebody else, just to spare myself from reinventing the wheel here (which is in keeping with the Zettelkasten spirit, come to think of it):\n\n> I've been struggling to complete my thesis for a long time. About a month ago, I learned about the [Zettelkasten](https://writingcooperative.com/zettelkasten-how-one-german-scholar-was-so-freakishly-productive-997e4e0ca125) method and wish somebody would've told me about it sooner. So, now I'm telling you about it. It's weird and took me a long time to wrap my head around it, but it directly addresses a lot of the problems I was having.\n\n> If you check it out and have the kind of \"holy shit this sounds like exactly what I need\" reaction I did, then PM me and I'll try to give you a boost up to my level of understanding of how to actually _do_ it. (I've invested the last month meticulously studying the methodology because it was so alien to any other workflow I'd ever seen. I still have more to learn, but at least I can offer some simplified \"just do this, then this, then this\" instructions so you can get started before you properly figure it out, share my notes from [a book about the Zettelkasten method](https://smile.amazon.com/How-Take-Smart-Notes-Nonfiction-ebook/dp/B06WVYW33Y), tell you about some of [the](https://www.zotero.org/) [software](https://obsidian.md/) [I've](https://gingko.io/) [used](https://www.literatureandlatte.com/scrivener/overview), etc.)\n\nIf you learn the Zettelkasten method and start making your own before you go, then I imagine you'll be a *very* happy camper indeed. \n\nGood luck to you!",
      "author": "SquareBottle",
      "created": 1595459845,
      "upvotes": 3,
      "replies": {
        "fyzevsu": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyzevsu/",
          "text": "Ok that’s just amazing! I never heard of that method. Thank you so much for sharing this. I’m going to start this right away",
          "author": "SavesNine9",
          "created": 1595514988,
          "upvotes": 1,
          "replies": {
            "fyzva8j": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyzva8j/",
              "text": "You're welcome! I got pretty excited within 5 minutes of learning about it. It's like aliens tailor-made a reading/note-taking/thinking/writing system for my strengths and weaknesses. It's just so different from every other approach I've seen! So yeah, now I'm recommending it left and right, haha. I hope it serves you as well as it's been serving me so far!",
              "author": "SquareBottle",
              "created": 1595523128,
              "upvotes": 2,
              "replies": {
                "fz54cq1": {
                  "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fz54cq1/",
                  "text": "I’ve been reading about it every chance I’ve had since I saw your comment. I can’t wait to dig in!",
                  "author": "SavesNine9",
                  "created": 1595631698,
                  "upvotes": 1,
                  "replies": {
                    "fz68njy": {
                      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fz68njy/",
                      "text": "I'm so happy you're finding it worthwhile and exciting!\n\nWhen/if you get the book I recommended, here's the suggestion I wish I'd been given: read it in three passes.\n\n1. Set a timer for 1 hour and skim the entire book. Or give yourself exactly 1 day. Whatever you decide, make it short. Don't worry *at all* about fully grasping things during this pass. You don't even have to skim it from front to back, if you feel any inclination to deviate from that. Jump around as much as you like. If you have extra time, then re-skim it again as fast as you can until the time limit is up. (The real point of the time limit is just to keep you in skimming mode instead of reading mode. So if you feel like you absolutely need to go over the time limit, then fine. But stay out of reading mode. Stay in skimming mode.)\n\n2. Now you get to read it properly from front to back. Highlight and/or make fleeting notes on things you learn that you find interesting. Don't analyze or evaluate what \"deserves\" to be highlighted/noted. Just go with your gut and don't worry about it. If you can bias your gut toward being selective, then great, but if you catch yourself worrying about it then just mark whatever passage you're deliberating and move on. Aim to keep 100% of your brainpower focused on taking in and comprehending the content.\n\n3. Go back through those quick and dirty highlights/notes you took. Decide which ones deserve to be developed into permanent notes in your Zettelkasten, then do so. Don't overlook how I worded that: don't do the developing until you are done with the judging. And remember: if you don't *actually* develop the fleeting notes/highlights (sidenote: highlights are actually a type of fleeting note, he mentions at one point toward the beginning), then they are pretty much a waste of time. In a nutshell, they're worthless if you don't and invaluable if you do.\n\nOkay, now for the explanation.\n\nThe first reason for doing it this way is to gain glean what the book is about and maybe pick up the gist of what some sections are saying. This way, when you *properly* read it, you'll already be able to start making connections and will therefore by learning it better.\n\nThe second reason for doing it this way is to make it so that you don't have to switch between reading mode, judging mode, and writing mode. These are completely different activities that require completely different mindsets. So, when you try to do these activities at the same time, all you're actually doing is constantly interrupting your own flow.\n\nThe third reason for doing it this way is speed. It might seem like this would be slower than just reading and taking notes the way you probably/possibly were going to do. That approach might _feel_ faster in the moment, but setting up a conceptual skeleton and eliminating the mode-switching will ultimately prove to be _actually_ much more efficient.\n\nYou can still develop a fantastic understand and develop Zettelkasten-style notes without doing it the way I described. However, I think the method I described will let you learn better, will save you tons of time and improve the quality of your Zettelkasten by letting you be more selective about which notes you actually need (because you'll have the bird's eye view in the back of your head, so you won't need to waste time writing every note that you could _possibly_ need to understand later concepts), and – in the long run – leave you with a higher quality Zettelkasten precisely because you'll have been so much more selective (so your Zettelkasten will have a higher percentage of critical insights).\n\nAlso, please bear in mind that I write this post having read 70% of the book because I've been meticulously taking high-quality notes all along the way. All the pitfalls I described in my description and explanation of the three passes are pitfalls that I believe cost me a lot of time without compromising the quality of my notes or understanding. Like I said at the beginning, the unsolicited advice I'm thrusting at you now is what I wish somebody had told me. It occurs to me now that I also could've been practicing the three-pass method I described this whole time. Ugh.\n\nSo, of course there's a chance that there will be something in the remaining 30% that will completely upend all this. I'm also planning to read How to Read a Book after this, which is almost certain to amend the approach I'm recommending now. All of this is to say that you shouldn't take what I'm saying as gospel. Take it as the best advice I can currently offer, based entirely on what I've learned so far from tackling How to Take Smart Notes without the benefit of having read How to Take Smart Notes before doing so. I did my best after absorbing what I could from scouring the web like you're doing now, but the book is unsurprisingly much more instructive, informative, detailed, clear, and so on.\n\nSorry if this comment comes off as commanding, arrogant, or presumptuous. I hope it doesn't, but I can see how it might by the very nature of being unsolicited advice. But yeah, like I've said twice now, I wish that somebody had told me this, and *that's* why I'm telling you.\n\nIn any case, it's awesome that you also see something fascinating and game-changing in the Zettelkasten method! I hope you *continue* to be as excited about it as I am!",
                      "author": "SquareBottle",
                      "created": 1595657335,
                      "upvotes": 1,
                      "replies": {
                        "fz9ayt7": {
                          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fz9ayt7/",
                          "text": "This is great, thanks so much! I think I naturally use a two pass method when I read papers already - it’s the third pass and the Zettelkasten that’s going to send it over the top!",
                          "author": "SavesNine9",
                          "created": 1595725998,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fyx1o5h": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyx1o5h/",
      "text": "Congrats!!",
      "author": "nonintellect",
      "created": 1595454582,
      "upvotes": 2,
      "replies": {}
    },
    "fyx0zkf": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyx0zkf/",
      "text": "First off...CONGRATS!!!! \n\nSecond off, I haven't read through all the replies on here, so forgive me if these things have already been said, but my recommendations are:\n\n1. Relax. With the whole pandemic situation everything is stressful enough as it is! I know it's tempting to get started working ASAP but enjoy some time off.\n2. Review statistics. It's important for all fields, but especially for immunology. Even having a general idea of stats (i.e. regression, ANOVAs, etc.) can come in handy at the beginning of your program.\n3. If you have time, learn how to use R and/or Python proficiently (if you have not done so already). Knowing how to use them (and use them well) makes analyzing data so much easier. Following up on this, become more familiar with Excel if you have time. I was surprised how many things I didn't know Excel could do before I was forced to learn the ins and outs of it for the lab I work in.",
      "author": "NintendoNoNo",
      "created": 1595454221,
      "upvotes": 5,
      "replies": {
        "fyywzni": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyywzni/",
          "text": "Thank you!! That was really helpful :')",
          "author": "science_freckles",
          "created": 1595503011,
          "upvotes": 1,
          "replies": {
            "fyyxdgt": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyxdgt/",
              "text": "You're welcome! Feel free to message me if you have any other questions :)",
              "author": "NintendoNoNo",
              "created": 1595503349,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fywwfrs": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywwfrs/",
      "text": "Congratulations! What an amazing piece of good news right now :)",
      "author": "redrosehips",
      "created": 1595451952,
      "upvotes": 2,
      "replies": {}
    },
    "fywlhs6": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywlhs6/",
      "text": "Congratulations! That’s the dream!",
      "author": "wistfulpainter",
      "created": 1595446917,
      "upvotes": 2,
      "replies": {}
    },
    "fywk25w": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywk25w/",
      "text": "Congratulations!!!",
      "author": "microvan",
      "created": 1595446258,
      "upvotes": 2,
      "replies": {}
    },
    "fywe9zw": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywe9zw/",
      "text": "Congratulations friend!!!!!!",
      "author": "Nice_Emu",
      "created": 1595443567,
      "upvotes": 2,
      "replies": {}
    },
    "fywcd3y": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywcd3y/",
      "text": "Congratulations!!!!",
      "author": null,
      "created": 1595442664,
      "upvotes": 2,
      "replies": {}
    },
    "fywb8r0": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywb8r0/",
      "text": "I received my offer this year too, starting in September! Huge congrats I know how hard you must have worked to get where you are. To prepare, I'm using the Trello app to organise everything I need to do before the big move so things like accommodation, signing up to a local doctor, packing my stuff and getting a national insurance number (for use in the UK). \n\nMain things I would focus on for now is finding a place to live and getting to know the people in your lab .. we have a journal club that's gone virtual since the pandemic so it would be good to check in with your supervisor and see if there are any opportunities to familiarise yourself with the people you're going to be working with for the next couple of years. \n\nHope it all goes smoothly, best of luck!",
      "author": "cornonthekob13",
      "created": 1595442138,
      "upvotes": 4,
      "replies": {
        "fyywyfk": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyywyfk/",
          "text": "Congrats to you too! That's some good advice i appreciate it. Hope it goes for you too :)",
          "author": "science_freckles",
          "created": 1595502981,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fyw9oqo": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw9oqo/",
      "text": "Congratulations!",
      "author": "MrUnknown1996",
      "created": 1595441408,
      "upvotes": 2,
      "replies": {}
    },
    "fyw3143": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw3143/",
      "text": "Congratulations! Definitely spend some time reading papers coming out of the lab and familiarise yourself with the project (assuming you know your topic). Also, you'll be moving countries, so take a look at places you may want to live, get an idea of affordability, as well as visas etc. Most of all, and I can't stress this enough... Enjoy your free time while you have it!!",
      "author": "Trebuchet86",
      "created": 1595438336,
      "upvotes": 3,
      "replies": {}
    },
    "fyw0sd5": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw0sd5/",
      "text": "Congratulations!\n\nIf you know you are already joining a particular group, I would highly recommend reaching out to members and asking to set up a Zoom call with them just to ask them any questions you have about getting started and to foster some sort of relationship with them. We have new grad students joining our lab right now and I can’t imagine how tough it is for them, but the ones who are having a better time with the transition are really making an effort to communicate with other lab members and soak in as much information as they can.",
      "author": "heebersbajeebers",
      "created": 1595437256,
      "upvotes": 18,
      "replies": {
        "fyw3n4t": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw3n4t/",
          "text": "I second reaching out to current lab members/grad students in your program, in addition to contacting your PI/advisor about safety training that you'll need to complete. With COVID, universities are implementing new protocols to minimize risk and for contact tracing, so it would be good to be up to speed on this by the time you start.\n\nCongrats! And do take a break for yourself before starting a PhD as well! It's a marathon, after all.",
          "author": "CuriosityDreams",
          "created": 1595438626,
          "upvotes": 5,
          "replies": {}
        },
        "fyw2ggf": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw2ggf/",
          "text": "ahhh thank you! That sounds like a great idea, I'm generally a shy person but I really hope I can get along well with the lab members. I probably need as much help as i can get from them considering that I'll be away from my friends and family.",
          "author": "science_freckles",
          "created": 1595438060,
          "upvotes": 4,
          "replies": {
            "fyw4hne": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw4hne/",
              "text": "Being shy and away from family makes it even more important to communicate! And if you’re joining a good group, your lab members will be more than happy to take time out of their days to chat with you about the group dynamic and give you general tips you’ll need to succeed.",
              "author": "heebersbajeebers",
              "created": 1595439022,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fyvz6nq": {
      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyvz6nq/",
      "text": "Congrats!!\n\nPrepare for what exactly? Since we don’t know what field or even what country, it’s hard to say anything...",
      "author": "cilbirwithostrichegg",
      "created": 1595436486,
      "upvotes": 66,
      "replies": {
        "fyw0awh": {
          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw0awh/",
          "text": "Thank you! You got a point i completely forgot i left out so many parts, i was just so excited. I'll be studying in Australia on the field of Immunology! \nI just graduated from my undergrad last year. I'm very excited but also nervous about jumping to a PhD straight. I'd love some general advice on what I can do prior my commencement date (probably in 6 months or so). Should I just chill for a bit...? Or should I read up about my field of study as much as possible...?",
          "author": "science_freckles",
          "created": 1595437025,
          "upvotes": 68,
          "replies": {
            "fyw8fk4": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw8fk4/",
              "text": "Grad school can be a little bit of an adjustment during the first semester and double so for current events.\n\nI spent most of my summer relaxing in the city I had worked in, then stayed in my undergrad town where I had friends, then at my parents to give them some time with me, then moved out to my grad city early to get acquainted with my surroundings.\n\nOne thing I did which was fairly unusual, because I had been away from school a couple of years and was eager to learn, was read both of the textbooks for my two classes. Most week days, for a couple of hours, I’d just go to a coffee shop and relax and read without pressure.\n\nOne of those classes was taught by my advisors so I wanted to make a good impression the first semester. I aced one of her tests with the highest score in the class and got A’s in both classes while balancing a lab TAship and a new girlfriend. Starting out with a 4.0 in grad school makes applying for funding so much easier.\n\nThen my advisor left and the rest of my PhD was an obstacle course but you know, that first semester was great.",
              "author": null,
              "created": 1595440817,
              "upvotes": 42,
              "replies": {
                "fywveb8": {
                  "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywveb8/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1595451464,
                  "upvotes": 24,
                  "replies": {
                    "fywvig9": {
                      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywvig9/",
                      "text": "What. Are you serious. America really is trash.",
                      "author": null,
                      "created": 1595451515,
                      "upvotes": 8,
                      "replies": {
                        "fywxq12": {
                          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywxq12/",
                          "text": "I had to teach two classes every year but my first... definitely slowed me down a bit.",
                          "author": "Popular_Prescription",
                          "created": 1595452568,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "fyyyc35": {
                          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyyyc35/",
                          "text": "I learned this at an international conference. We had a take home exam that we had to do there (from my advisor, who was also at the very same conference) and international people we met were like wait you have classes, AND they’d give you a test here?!",
                          "author": "NotTheAndesMountains",
                          "created": 1595504183,
                          "upvotes": 2,
                          "replies": {
                            "fyzt4x1": {
                              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyzt4x1/",
                              "text": "Man.  It really is a sabotage.",
                              "author": null,
                              "created": 1595522120,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "fz2azq0": {
                          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fz2azq0/",
                          "text": "Oof no. Classes in American PhDs are to to bring everyone up to the same speed - you’d be surprised the number of people who come in from undergrad with a 4.0 but still don’t know basic genetics. Additionally, most NIH funded (eg immunology would be included for US) labs pay their grad students outright and actively discourage teaching since it takes away from time in the lab (although this varies based on school). \n\nAmerica is extremely desirable for PhDs for international students because we have 1) a shit ton of funding and 2) good training programs. The US has 7 of the top 10 biomedical PhD programs. There’s a reason people come here.",
                          "author": "TinTinuviel",
                          "created": 1595569718,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fyw9aov": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyw9aov/",
              "text": "You should both chill and do light studying.  If there's a core class you don't feel as comfortable with as you feel you should, or some topic that is important to what you want to do in the future, read up on those things.  Maybe review other material too, but kind of in a big picture view.  But this should be pretty casual and relaxed, I'd say, no stress.  I did about an hour or two a day on average during my summer between schools, and felt like I came into grad school well-rested but not rusty.\n\nAlso, congratulations!",
              "author": "epicwinguy101",
              "created": 1595441226,
              "upvotes": 9,
              "replies": {}
            },
            "fywnse2": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywnse2/",
              "text": "First off, congratulations! Everyone wants to hit the ground running, but also remember that graduate school is a marathon not a sprint. There's no need to burn yourself out before even arriving on campus, and I'd recommend taking this opportunity to relax, spend time with family, travel, etc.   \n\n\nIf you do want to do something, I would recommend is starting the conversation about first year/rotation projects. That might give you more of a focus than just trying to cover a broad field of study. Another idea is to look at recent papers from your perspective mentors and any reviews that mention them (the *Current Opinions in* review series are pretty approachable and give a good idea of the field, if there's an issue that's relevant for your interests).   \n\n\nTransitioning from undergrad to a PhD program depends a lot on the person, but lots manage it successfully. A lot of the difference relies upon how much research you were involved with as an undergrad and how much coursework is required by your program, so without knowing that it's hard to say what exactly your experience will be like.    \n\n\nFinally, fwiw, I'd be happy to talk shop/ideas as well if it would be relevant for you. I'm currently working on projects regarding the functional and evolutionary genomics of immune variation.",
              "author": "-jautis-",
              "created": 1595447970,
              "upvotes": 6,
              "replies": {}
            },
            "fz62zsv": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fz62zsv/",
              "text": "If you are still fresh from undergrad, you should really dedicate several months to resting if possible or you are gonna get burned out within your first year.",
              "author": "drunken_doctor",
              "created": 1595652783,
              "upvotes": 2,
              "replies": {}
            },
            "g04v7m9": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/g04v7m9/",
              "text": "OMG Well done! My father did his PhD in immunology 30 years ago, and he still yaps on about it! It's also an amazing field, very very employable set of skills, and a hard field to get into!",
              "author": "hlqn",
              "created": 1596397282,
              "upvotes": 2,
              "replies": {
                "g05qp08": {
                  "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/g05qp08/",
                  "text": "Thank you! Such a relief to hear about this :)",
                  "author": "science_freckles",
                  "created": 1596414610,
                  "upvotes": 1,
                  "replies": {
                    "g06okih": {
                      "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/g06okih/",
                      "text": "Also he always told me it worth doing a post-doc or two, so you can get an extra set of skills as a PhD can be very niche. Find the most novel technique! For him it was Flow and he did that for his MPhil, and it's helped our family in the long run!",
                      "author": "hlqn",
                      "created": 1596438160,
                      "upvotes": 2,
                      "replies": {
                        "g06pttr": {
                          "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/g06pttr/",
                          "text": "I'll keep that in mind, really appreciate this!",
                          "author": "science_freckles",
                          "created": 1596439376,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fywxi0o": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fywxi0o/",
              "text": "I don’t feel like there is a lot you can do to prepare personally. Your undergrad should have been the preparation. Took me 6 years to finish my PhD so my biggest advice is to do your damnedest to stay on schedule and compromise when necessary. You will be very busy so there may be times a class project isn’t and shouldn’t be your primary focus. In my case I taught two classes for my assistantship (every year but my first) so there were times I had to be satisfied with a less than perfect product.",
              "author": "Popular_Prescription",
              "created": 1595452460,
              "upvotes": 1,
              "replies": {}
            },
            "fyxu7ip": {
              "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyxu7ip/",
              "text": "Deakin by chance?",
              "author": null,
              "created": 1595470654,
              "upvotes": 1,
              "replies": {
                "fyy7ag1": {
                  "link": "/r/GradSchool/comments/hvwupf/i_received_a_fullyfunded_phd_offer/fyy7ag1/",
                  "text": "Newcastle, actually :)",
                  "author": "science_freckles",
                  "created": 1595479039,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634065273
}