{
  "sid": "qwsigt",
  "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/",
  "title:": "How do you get through writer’s block?",
  "text": "I am currently working on my master’s thesis as a part-time student and working full-time. Classes ended in April, and I have until August 2022 to submit my thesis. I took a few months off, and I am having a hard time putting pen to paper. How do you get through writer’s block?",
  "author": "Interesting_Ebb_5218",
  "created": 1637250253,
  "updated": 1637354685,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hl50mpa": {
      "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl50mpa/",
      "text": "Write fast crap. Put as much garbage as you can onto the page. Even if its not entirely coherent. Then once you have your steaming pile of hot garbage. Grab it paragraph at a time and rewrite that paragraph to sound a bit more coherent, a bit more logical. Then as you move along the process move from hot to cold garbage, to compost, to a shitty garden, to a bouquet of flowers. \n\nAt least that's my writing process.",
      "author": "dmatkin",
      "created": 1637253967,
      "upvotes": 7,
      "replies": {
        "hl51ct1": {
          "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl51ct1/",
          "text": "I love the garbage to flowers analogy. \n\nBut seriously this is the best tactic. Just throw words on a page, make a bullet list it doesn't even have to be full sentences, it's so much easier to work with garbage than nothing at all.",
          "author": "Whal3r",
          "created": 1637254248,
          "upvotes": 5,
          "replies": {
            "hl9lfb7": {
              "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl9lfb7/",
              "text": "You’re right - just sit down, and write something. Anything.",
              "author": "Interesting_Ebb_5218",
              "created": 1637336786,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hl713l2": {
          "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl713l2/",
          "text": "This is the way. Write shit you feel is bad down anyways. Just write it. Turns out after editing and revisions, a lot of that shit isnt shit and it stays.",
          "author": "ThePoliteCanadian",
          "created": 1637283665,
          "upvotes": 2,
          "replies": {
            "hl9lif6": {
              "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl9lif6/",
              "text": "That’s what I’m afraid of - it being so bad and not even know what I’m trying to say.",
              "author": "Interesting_Ebb_5218",
              "created": 1637336821,
              "upvotes": 1,
              "replies": {
                "hl9lptq": {
                  "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl9lptq/",
                  "text": "Just write it down.",
                  "author": "ThePoliteCanadian",
                  "created": 1637336904,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hl9lbfp": {
          "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl9lbfp/",
          "text": "Garbage -> flowers, I like it. 😊",
          "author": "Interesting_Ebb_5218",
          "created": 1637336745,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl4yp0e": {
      "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl4yp0e/",
      "text": "For reference, I have my MS thesis due in ~2 weeks and I've been struggling with writer's block as well. I have managed to get a decent amount of work done in the last week or so though. Here's some tips:\n\n1. Acknowledge that your thesis won't be perfect and that's okay. A completed thesis is a good thesis. These aren't published, and nobody will read them once submitted. \n\n2. Tell yourself you only need to write for 10 minutes. Chances are you'll get to that 10 minute mark and realize you can keep going. But if not, take a break! Nothing makes writer's block worse than staring at a blank page.\n\n3. Reward yourself after a successful writing session! I like to eat some candy if I finish a page or two... \n\n4. Identify a location that is conducive for writing. I cannot write at home, in lab, or even at the library. I can write in this tiny little office on campus though, so I only write there now. \n\nGood luck!",
      "author": "JoieDeBeaver",
      "created": 1637253208,
      "upvotes": 3,
      "replies": {
        "hl9lmkl": {
          "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl9lmkl/",
          "text": "Good luck to you! That’s so exciting that it’s almost done. What will you ever do with all that free time when it’s over. 😊\n\nI agree that location is important… I tend to move around from one room to another until I can find my groove. Last semester, I was writing a research paper and ended up sitting on the floor on my fuzzy carpet because I just got into a writing frenzy, and couldn’t stop. Maybe I’ll go back and sit on that carpet in the hopes it’ll help kick my writer’s block.\n\nAnd that is also a good point - once it’s submitted that’s it. The committee and external examiners will review it, but then that’s it. It won’t get published or anything, and won’t be in the universe for scholars to rip apart.",
          "author": "Interesting_Ebb_5218",
          "created": 1637336867,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl51jya": {
      "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl51jya/",
      "text": "Make sure you're scheduling regular time to write, and stick to it. So procrastination does not become part of the problem. And don't interrupt your writing with playing on social media :)\n\nAre you sure you're at the stage of writing the draft? Sometimes people get stuck because they need to do more research, or they need to think things through more and take notes.\n\nDon't get trapped into thinking you have to follow an outline. Write whatever is easiest. Jump all over the place. Messy first drafts are fine. Once you have one, you can outline it and then reorganize it. And better develop your arguments.\n\nDon't try to edit while you go. For many people, editing can be a different type of thinking than initial draft generation. So it can interrupt the flow of being in the groove of generating text.\n\nIt helps me to have gestation time when I'm involved in a major writing project. So when I drive my car or go for a walk, I don't listen to music or podcasts. I think about my writing project. Then when I go to sit down, I already have ideas of what I want to do next.",
      "author": "raistlin65",
      "created": 1637254326,
      "upvotes": 1,
      "replies": {}
    },
    "hl62nna": {
      "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl62nna/",
      "text": "I had a PI who once said \"make a shitty first draft\". That helped loads. Just write anything. \n\nDisjointed prose.\n\nBullet points.\n\nWhatever.\n\nGet thoughts, words, paragraphs, bullet points, a smorgasbord of anything down. Then come back to it later and edit it into something better.\n\nDo not be a perfectionist procrastinator. The best project is a finished project.",
      "author": "MFA_Nay",
      "created": 1637268898,
      "upvotes": 1,
      "replies": {}
    },
    "hl7upbn": {
      "link": "/r/GradSchool/comments/qwsigt/how_do_you_get_through_writers_block/hl7upbn/",
      "text": "No idea if this is something applicable to your thesis, or will work for your writing process, but something I like to do when writing if I'm getting stuck for long periods of time is break everything up into little chunks, and focus intently on each chunk. Instead of focusing on the bigger picture, focus on getting each piece just good enough and then take short brain break.",
      "author": "jmattspartacus",
      "created": 1637297678,
      "upvotes": 1,
      "replies": {}
    }
  }
}