{
  "sid": "pqahn6",
  "link": "/r/GradSchool/comments/pqahn6/deciding_if_i_want_to_add_a_collaborator_as/",
  "title:": "Deciding if I want to add a collaborator as co-supervisor?",
  "text": "Hi folks!\n\nI'm about a month into a PhD in a neuro lab that's historically rat-based, but my project is on mice. One of our major collaborators' lab is the 'owner' of my colonies since my own lab's protocols and animal facility space are only for rats (though I'd manage and breed 'my' mouse colonies myself). \n\nOur current set up for my project is a 'gentleman's agreement' that I have access to a reasonable and sizeable amount of mice, and my advisor + the collaborator deal with financing on their own time so not my problem to deal with. But now, their latest discussion came to the conclusion that I can add the collaborator as my official co-supervisor if I so choose, considering I'm already getting trained for certain animal things by their students/staff and frequent their lab meetings as well as my own lab's. \n\nHowever, if I do that I do open myself up to the collaborator's apparently more... hands-on advising approach, while my current advisor gives me plenty of room to do as I please. I still need to talk to some of the collab's current students to probe more into how he is as an advisor (but all my own meetings with him so far in a 'mentor' capacity have gone well). I'm just trying to figure out if the 'lesser of two evils' is to trust the gentleman's agreement or to have a co-supervisor throughout my doctorate. \n\nWould love to hear from people that have either had co-supervisors where one provides the funding/stipend and the other provides more 'material', or from others who have had projects that were **very heavily** dependent on their labs' collaborators for key components of their research - and you just hope and pray their good will never runs out lmao.",
  "author": "rosen-",
  "created": 1631918438,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {},
  "updated": 1634067296
}