{"sid": "mv5hzx", "link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/", "title:": "Is anyone having a hard time concentrating on their research/work when so many social issues are going on?", "text": "Along with being in a pandemic, this is huge time in social and economic change. In America the Chauvin sentencing occurred and this may lead to a huge amount of change with how policing works.   \n\n\nA lot of things are happening, and I know the common advice is detach from it all, but that doesn't feel right either. A lot of people's lives are being affected, and it doesn't just sit right with me tuning myself completely out. \n\nHow do you keep up with both doing your work while also just paying attention to everything going on too?", "author": "Astsai", "created": 1618968935, "retrieved": 1632953248, "over_18": false, "upvotes": 695, "upvote_ratio": 0.95, "comments": {"gvjpboa": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvjpboa/", "text": "What I do:\n\n- Remove news from social media, unfollow/mute people constantly posting news stuff. You don't need to follow _all the time_.\n\n- Stop browsing news websites, if you have them in your RSS feeds, remove them.\n\n- In general avoid people/publishers that publish _a lot_, news or not. It's never healthy.\n\n- Turn off the TV. Sell it on craigslist or something.\n\n- Use outlets that publish infrequently, like once a week. Inform yourself and be done with it. Anything urgent will inevitably find its way to you anyways.\n\n- Digital wellbeing apps may help.\n\n- In the end you can't just ignore stuff that directly affect your lives. Don't shame or blame yourself for that. And don't shame nor blame yourself for what you can't help change.", "author": "gkayaalp", "created": 1619168459, "upvotes": 1}, "gvdch3j": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvdch3j/", "text": "I read the news a lot and talk about the news but it's hard to engage in activism when we can't leave our homes", "author": null, "created": 1619039386, "upvotes": 1}, "gvd1rat": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvd1rat/", "text": "When I was finishing my Master's, I struggled with this too. The best thing I found is creating a specific time of day to look over the day's news headlines and engage in social activism, away from my studies. \n\nIt also helped that I was able to write some reflection papers on what was going on in the world since I was in the social sciences.", "author": "OneEye9", "created": 1619034808, "upvotes": 2}, "gvd1b7s": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvd1b7s/", "text": "Detaching doesn't have to be an all the time thing. You can just detach for an hour, or an afternoon, or a day. Turn your phone off, don't go on reddit, concentrate on your work. Catch up in the evening after you're done.", "author": "IAmVeryStupid", "created": 1619034617, "upvotes": 2}, "gvcyr56": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvcyr56/", "text": "You’re definitely not alone. I unfollowed and muted all sources of news and activism posts, which has helped a lot. Sometimes I’ll take a peak at what’s going on but I try to steer clear because the stress induced a manic episode for me back in January lol.", "author": "_johnfketamine", "created": 1619033515, "upvotes": 3}, "gvckgpm": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvckgpm/", "text": "You are right, completely detaching is not a solution. Keep a filter in your mind, only let those things pass which are personal or concerned with close family and friends. If you read something unusual - say a news article or something - don't go beyond line 1. By line 1 you pretty much get an idea if it needs to go through or it needs to cut out. Talk to loved ones - family, friends. Play online games with them, spend your time in these activities. As far as economic/political activities are concerned - if you cannot control it - don't think over it. Appreciate yourself. Be proud of yourself for simply waking up each day.", "author": "modykruti", "created": 1619027431, "upvotes": 2}, "gvc9kto": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvc9kto/", "text": "Honestly no not really. That stuff just doesn’t affect me and I got a buttload of things I have to do.", "author": null, "created": 1619022885, "upvotes": 1}, "gvc9dr8": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvc9dr8/", "text": "Yes, and one thing that really helps is being able to connect my class readings and assignments to what’s going on around the world. I know we don’t all have the luxury to do this, but if so I recommend it. \n\nIt also helps that I have professors who are comfortable taking some time during class to do wellness check-ins with everyone. That makes me feel heard and it’s nice to know that I’m not alone in what I’m feeling. If your professors aren’t already doing this, I suggest reaching out to them individually and seeing if they’d be open to start doing this. \n\nI realized very quickly in grad school that grad school seems to be this bubble where all we think about is academia and research, without ever pausing to realize that this is a small part of what’s going on in the world. We can’t allow ourselves to become numb to world tragedies.", "author": "SassMasterCass99", "created": 1619022804, "upvotes": 2}, "gvc8l2p": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvc8l2p/", "text": "You are far from the only one, just going by this thread. But I'll just chime in to add my voice to the chorus. This whole damn year has been brutal: pandemic, capital riots, social justice protests, that goddamned election... \n\nAll while trying to deal with the basic struggle of a PhD even in normal times. It just REALLY is hard to get up everyday and say to myself, without the sarcasm that is desperately trying to break down the door and invade my voice, \"it's VERY important to the world that YOU develop a theoretical framework for explaining \\[my dumbass project that I'm very burned out on anyway\\].\"\n\nIt's a struggle without all the chaos happening around us. I am constantly struggling to get good work done. You're not alone, but there's also no easy answer or exportable solution I've found. The best thing I've managed to do is find ways to trick myself into doing good work (if I get REALLY good work done this morning I'll give myself some of the afternoon off; let's book a quiet retreat-style getaway next month but I have to finish this chapter by then; etc.)", "author": "Jack-ums", "created": 1619022470, "upvotes": 1}, "gvc5vik": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvc5vik/", "text": "If you didn't work on days when important world events, tragedies, or social issues were happening you would never work. Some people in this thread are claiming to watch the news the entire day some days which is rediculous. That sounds a lot like avoidance but you're telling yourself that watching the news means you care and are a good person to justify it. I would consider evaluating the thoughts you're having in those situations and considering if watching 8 hours of news is as important as you might tell yourself it is.", "author": "likeablanket", "created": 1619021325, "upvotes": 1}, "gvc58iq": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvc58iq/", "text": "I’m failing out of my program. They are not going to let continue after this semester. I just haven’t been able to do anything", "author": "deepc55", "created": 1619021057, "upvotes": 1}, "gvc0mi1": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvc0mi1/", "text": "I'm having a hard time concentrating too, but not because of social issues. With constant depression, I barely care about myself, why would I care about social issues? They've always been present, and always will. So, what's the point in investing mental space on them? I'm affected by many of them, but that doesn't mean I'm ruminating about them. We live in a horrible world. Some things get better because people fight for them, while others get worse. For every step forward, humanity takes two steps back, so there's never actual progress.", "author": "lebohardwitztyle", "created": 1619019118, "upvotes": 1}, "gvc0fvg": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvc0fvg/", "text": "Absolutely. \nAlso, I find detaching from it all advice to be incorrect. \nOne has to somehow manage it all. Sorry I know this doesn't help. \nI do know many professors who are quite vocal on social issues and are still doing fantastic research. I am sure you know many such too. Try to learn how they do it.", "author": "bertwit", "created": 1619019037, "upvotes": 1}, "gvbw1h4": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbw1h4/", "text": "Pandemic aside, it's not as if \"social issues\" are suddenly more prevalent now. We've had a migration crisis for the better part of a decade in North America and Europe; mass killings happen with shocking regularity; poverty, death and destruction have always been out there. What is different is the level of accessibility and coverage. Whereas things were previously filtered through a few major media organizations with large budgets and staff, now anybody with a decent Internet connection and a cellphone can generate their own content (for better or for worse). So it is ubiquitous.\n\nFor me, I strictly limit my media consumption to set times of the evening. Otherwise, I stay off of Facebook (for reasons other than \"news\" besides) and my Reddit feed doesn't have any news-y subs on it. The other piece is \"what can I do about this?\" I can't do anything personally about migrants at the border, I can't affect the outcome of the Chauvin trial. But what I can do is continue my work. Maybe it's easier for me because a lot of contemporary social issues are tied in with this, but setting limits is definitely important.", "author": null, "created": 1619017116, "upvotes": 3}, "gvbrdie": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbrdie/", "text": "This is something that people in my program struggle with all the time. We're in what could be called a social justice program, so it's encouraged (socially, not academically) to always be on top of these but still get our work done? I dont know how anyone with an empathy can get work done as effectively as they could 2 years ago. \n\nYou're definitely not alone. I'm doing my dissertation on historically oppression and just rereading my reflectivity section made me cry yesterday. I take time off when it gets to be too much and generally try to be patient with myself", "author": "frankie_prince164", "created": 1619015022, "upvotes": 2}, "gvbr7rf": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbr7rf/", "text": "As someone whose research/work relates to social issues (climate justice), I feel this to the Nth degree. I spend my work day/school day reading about how complicated and shitty the world is, then go on reddit at night and read about different shitty things. It's exhausting.", "author": "Substantial_Potato", "created": 1619014947, "upvotes": 1}, "gvbncii": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbncii/", "text": "I think it's easy for people to say you just have to detach when the social issues or political uprisings arent directly affecting them as much. When the riots/protests were happening over the summer, I lived right outside one of the biggest cities in the country. \n\nI was at some of the protests and when I wasnt there my friends were. When people were being teargassed on the tv and shot with rubber bullets those were my friends. When people were taking advantage of the chaos to blow up atms to take the money my cousin was living alone in her apartment listening to the explosions every night. When buildings were being torn down and lit on flames it was places a few miles from me that I've been going to all my life. \n\nSome people in academia have lived in safe little rich suburbs all their life and forget that when this kind of shit is happening on the news there are plenty of people who cant help but be directly involved in it. I couldn't change that it was happening in my backyard. I think it's naive for people to tell you to \"just detach\"", "author": "bi_smuth", "created": 1619013095, "upvotes": 7}, "gvbmgld": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbmgld/", "text": "Please focus on your work because these social issues will come and go just like that. So, don't let these things distract you from your work no matter how important they seem. \n\nIn 2001, it felt like world was slipping into another world war. Many people of my generation just wanted to drop out of college because we just thought what's the point of studying when the world around us is just going to burn. What happened? Nothing. Life went on and people started to forget everything. Imagine if we dropped out, we would be sitting here without jobs cursing ourselves for mistakes in the past.\n\nJust like that, these tough times will also pass and people will forget Chauvin / Floyd / covid soon and something else will come up and the cycle will continue.", "author": "KS_tox", "created": 1619012658, "upvotes": 7}, "gvbka3g": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbka3g/", "text": "http://phdcomics.com/comics.php?f=2028&gt;Feelings&lt;/a&gt;&amp;quot; it was true in 2018 too XD", "author": "SeizureHamster", "created": 1619011543, "upvotes": 2}, "gvbiqgh": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbiqgh/", "text": "Don’t detach, but don’t be distracted either. \n\nLet your concern, worry, and care guide you into taking action. Doom scrolling through the news doesn’t really help anyone. Once you’ve seen enough news (or Twitter feeds or whatever) to know what the issues are, use that to *do something*. This is a win-win: *you* will feel better, less guilty, you will have some sense of control or impact on these big overwhelming issues. And your community will benefit as well, because you will be taking on a (small) part of the important work that needs to be done.\n\nAt the same time, I assume you don’t want to quit school to be a full time activist. So be really honest with yourself- what’s most important to you? What feels right and in line with your values for balancing school and important social issues? Then you can be very clear about how much time and energy you want to devote to each. \n\nThis is what I do and I just think it’s really the best way. You clearly care, which is good. Pretty much any human who truly understands what’s going on must care. But maybe you don’t see that there’s things *you* can do that can actually have an impact. Your actions can make a change. Like no, you individually are not going to end racist policing. But you could be a small (but essential) part of making change across the country... any protest of millions of people is made up of a bunch of “just one person”s. You could also be a really big part in making small or hyper-local change. \n\nSo yes, I care. But for me, it’s not a distraction. For the most part these thoughts don’t hurt me or truly “distract” me, even though I truly do care. I think it’s because I’ve been able to move my worries into real action. I’ve used these thoughts/feelings to re-evaluate my priorities. And I know that I’m (for the most part) acting in line with my values and priorities. That’s because I do spend time working with others to make change. For me it makes it easy to focus on my work when I need to do that, because I know I will also spend time focusing on social issues, particularly in productive ways, and I feel like I’m doing enough. \n\nTLDR: **Don’t detach!** Lean into your feelings and concerns. Really listen to them and allow them to inform your actions. Funnel your social issues focus into something that is productive for you and your community. \n\nAnyways that ended up long but that’s my advice! Overall this is a very good question snd it definitely makes me feel less alone in some ways to know others also care and struggle with these things.", "author": "starshappyhunting", "created": 1619010724, "upvotes": 5}, "gvbf2s0": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvbf2s0/", "text": "Yeah me too. I'm actually transgender too, so seeing all these anti trans bills hits *really* close to home. It's even worse because the state *I am in* is one of the states that are proposing said bills. I actually had to take time out of my research schedule to *testify in the state legislature against the bills* , and even then the anxiety over whether the legislature will do something very harmful regardless that directly impacts me runs pretty deep.", "author": "DoctorWatchamacallit", "created": 1619008662, "upvotes": 9}, "gvb82or": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvb82or/", "text": "Last year during the heat of the protests I had my qualifying exam proposal due. I scrapped it together last minute the day before it was due and unsurprisingly did not do well (my department was sympathetic and offered everyone to postpone qualifying exams but I decided to try and get it over with). You’re definitely not alone", "author": "kangaroomr", "created": 1619003985, "upvotes": 3}, "gvavq2z": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvavq2z/", "text": "You don't have to avoid the issues forever. Just long enough for you to focus on what needs to be done. Then, you can jump right back in. We all have our role to play, and some of us can't be tuned in 24/7. I have general anxiety and panic disorder. If don't take breaks from it all, I won't be able to function as a person. \n\nDon't feel guilty for taking a step back.", "author": "JashDreamer", "created": 1618992715, "upvotes": 3}, "gvavgkq": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvavgkq/", "text": "I think you should decide in advance what you are prepared to do about the social ills of the world. Vote, donate, march, riot? You don't need to sit there feeling bad, nor do you need to know every detail of what is going on in the world. You can't possibly, and trying to do so will make it much harder for you to do the things that will really effect change. It's important to know some broader context, and to know when to vote etc but these things can be achieved without constantly doom scrolling or tuning in to rolling \"news\" coverage. Reading books and long form articles is a better way to get context. Subscribing to some sort of newsletter is a better way to know when action is required.", "author": "l_lecrup", "created": 1618992457, "upvotes": 3}, "gvaqg3b": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvaqg3b/", "text": "i often wonder what it was like for my parents' generation to keep working during the world wars. working life is so weird because, on one hand a job is just a job and you should have time to observe, react to, and process real-world events that have real implications for your life and others'. and yet it's difficult to live in the \"real world\" without said job and having a steady income is one of the biggest \"implications\" in your life.", "author": "_welcome", "created": 1618987798, "upvotes": 2}, "gvap7hq": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvap7hq/", "text": "I have the same problem sometimes, but I think it is in fact a problem with me and not just the \"times we live in\".\n\nIt takes like 10 minutes of reading each day to stay up to date with the current news of the day. Any more than that is basically just politics as sports. I'm not advocating to cut yourself off. Stay informed. If you want to participate in causes, do so. If you want to go protest, go protest. But if the problem is spending hours scrolling through or making social media posts talking about the current events, not only is that not really helping anything, it's probably making you less informed than if you just read a few well picked news sources for 10 minutes and called it a day. \n\nThat said, I'm very guilty of the same thing, and it's a constant struggle to avoid doing it.", "author": "SomeRandomScientist", "created": 1618986735, "upvotes": 3}, "gvanc9d": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvanc9d/", "text": "Not just me, but literally everybody in all my classes is struggling.", "author": "DJGlennW", "created": 1618985162, "upvotes": 4}, "gvan917": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvan917/", "text": "No. I stopped watching the news and stressing about things that are out of my control.", "author": "too105", "created": 1618985088, "upvotes": 9}, "gvamard": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvamard/", "text": "I’d say that if you’re in a field where folks are encouraged to actively support social causes, or specific causes, or conduct participant observation, and you can get committee/department approval to go do stuff without risking your funding, by all means, have fun changing the world! \n\nBut if you don’t see the work you’re doing as a greater contribution to humanity than being another warm body in another broad-base policy movement, then it might be time to reconsider your career goals and paths.", "author": "doublestuf27", "created": 1618984313, "upvotes": 10}, "gvaia3b": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvaia3b/", "text": "I'm on the same boat. I'm neither American nor living there, so issues are different, but it's been really really hard and tiring to focus on work. I'm still going to the lab and still have normal work hours/routine which is both a blessing and a curse. It's tiring and frustrating sometimes. Let's just say I understand why some people choose not to go outside and engage in a society", "author": "roseleaf8926", "created": 1618981221, "upvotes": 3}, "gvai1oc": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvai1oc/", "text": "I’ve had similar issues previously, and I think i found a way to deal with it. It works for me, at least. \n\nThere is always some kind of social issue, and most of them are out of my control or even be able to contribute in a meaningful way. I try to focus on what I can do now (most likely continue studying) and use my knowledge in a way that could help the society. I’m sure I can’t be help of every single social issues, but I’m sure there are some that I could (hopefully) be influential once I’m done with my study. So I try to focus on those over something I don’t have control over.", "author": "OvulatingScrotum", "created": 1618981045, "upvotes": 3}, "gvahfbz": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvahfbz/", "text": "YES! I went through my dads cancer battle from fall 2019 to his passing in summer 2020 and then now the pandemic... and on and off protests in my city (one of the events that sparked protests happened here). It feels like the last normal semester I had was summer 2019. Thankfully I was doing very well then so my professors know I really am struggling atm and can do it when I’m not. Also adhd and grad school at home don’t mix...", "author": "PenguinFeather4", "created": 1618980599, "upvotes": 6}, "gvah6ub": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvah6ub/", "text": "My productivity crashed hard ever since I been locked 'WFH'...went from writing one or two papers a month to 100 words in 5 weeks.\n\nIt's honestly depressing but I am taking each day to recover.\n\n\\- 3rd year PhD student", "author": "OptionLive", "created": 1618980431, "upvotes": 35}, "gvaf13r": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvaf13r/", "text": "It ebbs and flows, but I am right there with you. Some weeks are worse than others, but its been tough to turn away for the last couple of weeks. It’s been a near constant stream of mass shootings, police brutality, and hate crimes. \n\nI’ve tried to consume my media more thoughtfully and purposely to quit the doom scrolling and survivors guilt (I’m not even sure if that’s the right word, but I feel guilty). I’ve tried to limit my social media consumption as much as possible. \n\nAs for news consumption, I highly recommend following the advice I got from Pantsuit Politics: pick two or three *reputable* websites/podcasts/sources to consume news from and that’s it. (I also highly recommend Pantsuit Politics period, they do an awesome job at approaching subjects from a more calm and understanding mindset which has helped me process everything better). During election season, I found myself going down a rabbit hole of switching between NY times, cnn, msnbc, WaPo, axios, fivethirtyeight, and a few news podcasts for updates. It wasn’t necessary, a lot of the info was repeated with slightly different opinion leanings, and it upset me a lot. I also recommend listening to “Things Are Bad” from Endless Thread, they interview a man from Sri Lanka who spent most of his young adulthood living through civil conflict there. His perspective helped me understand the weird balance of things going on as normal in my personal life and work while the country is seemingly melting down outside.", "author": "happytransformer", "created": 1618978950, "upvotes": 9}, "gvaedlu": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvaedlu/", "text": "Yes. I 100% feel this to my core. \nIt’s been pretty bad since the pandemic started. \nThe week of the U.S elections I literally just sat on my couch and watch ABC news every single day and didn’t do a single productive thing. \nThat had happened a few times for a variety of different reasons. It’s an impossible situation because I need to stop focusing on social issues so I can finish my research but, at the same time, I really want to be more involved in social justice activism but I don’t have time because I need to focus on my research. \nIt’s an impossible situation sometimes.", "author": "14kanthropologist", "created": 1618978526, "upvotes": 9}, "gvae90d": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvae90d/", "text": "Us minorities call it Tuesday.  This is everyday for us and I'm in my 40's.", "author": "PsychAce", "created": 1618978442, "upvotes": 1}, "gvae46u": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvae46u/", "text": "Yes. I'm finding it a little less difficult now that Trump is out of office, but I do still often find the news extremely distracting and/or stressful to the point where it's harder for me to get things done. \n\nMy only advice (besides attempting to acknowledge the difficult truth that you're probably gaining literally nothing from 90% of your news consumption) is to try to have a slate of less intellectually-demanding and/or less distractable tasks ready for distracting days. For example, if I'm working on fabrication in the lab, it would probably take a declaration of war or a presidential resignation to change the rate at which I get that stuff done. Whereas if I'm working on theory stuff, I have to stay as far as possible from my phone, lest I be distracted by an anonymously-sourced Politico story claiming that Joe Manchin eats PB&J sandwiches with the peanut butter side down. A day like today is a pretty good one to try to stick to those undistractable tasks.\n\nI'm very bad at this, but I think it's a pretty good concept.", "author": "Melodious_Thunk", "created": 1618978352, "upvotes": 11}, "gvacuda": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvacuda/", "text": "How bout log off Reddit", "author": "grandpassacaglia", "created": 1618977542, "upvotes": -4}, "gvabwri": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvabwri/", "text": "Depends on what you think your personal responsibility is in terms of detaching.\n\nIf I was going to go protest, i'd find it hard to detach because you're trading something that you think would make a difference.\n\nIf I was just going to stay in my room and watch tv news and read reddit, me detaching and going to do my research has no impact on the greater issue and I have no issue ignoring it at all.\n\nThe blessing of the information era has also led to the curse of thinking that we need to be constantly alert. The fact of the matter is for the entirety of human history people have only had to focus on their immediate surroundings 95% of the time, so the burden of global knowledge is really hard to come to terms with culturally, especially due to the speed at which it spreads.", "author": "JCDchameleon", "created": 1618976962, "upvotes": 49}, "gvabm5o": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvabm5o/", "text": "For like the entire week that the Capitol Riots happened, I couldn’t focus", "author": "rukwitme", "created": 1618976780, "upvotes": 59}, "gvabh2u": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gvabh2u/", "text": "As a policing scholar, I'm here to tell you that the Chauvin trial won't change much at all. That said, you're right that it's insanely distracting, especially for people who have related traumas.", "author": "isaac-get-the-golem", "created": 1618976695, "upvotes": 16}, "gva963n": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gva963n/", "text": "I have this struggle sometimes too. Last summer, during the biggest protests, I spent a bunch of days literally watching the news all day instead of working on my research. I found it impossible to focus on my work with everything happening. \n\nFor me it comes and goes. Some days I just have to be fine with not getting as much done as I would like. It isn't a problem as long as I have other days which are productive.\n\nI'm afraid I don't have advice really, just letting you know you aren't the only one.", "author": "Drell-Yan", "created": 1618975313, "upvotes": 190}, "gva6f6a": {"link": "/r/GradSchool/comments/mv5hzx/is_anyone_having_a_hard_time_concentrating_on/gva6f6a/", "text": "I’m more here to sympathize than offer advice, because I’ve been feeling this big time since the pandemic started (and continued to work with a chronic disease on top of COVID stress). My advisor hasn’t necessarily been the most understanding either, so I hope you’ve got a little more slack in terms of pressure for research productivity. It feels like I don’t have the bandwidth for social issues, but I can’t ignore them either.\n\nOne thing that I’ve found somewhat fruitful was to engage with local activism to push for changes at my not-so-subtly-racist university. And I occasionally take a day to just let myself be consumed with the world’s BS (today was one of those days) in the hope that I can reset and refocus tomorrow.", "author": "cat_astrophical_ly", "created": 1618973729, "upvotes": 85}}}