{"sid": "ncskh3", "link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/", "title:": "LinkedIn aggravates the Impostor Syndrome", "text": "I don't know if this is normal but I cannot stand LinkedIn. Looking at all my peers constantly posting about their projects, internships and research, my Impostor syndrome kicks in. It's not like I'm not constantly slogging, working on stuff that can be highlighted in my CV.   \n\n\nIs this normal? And how do you guys deal with it?", "author": "Substantial-East1107", "created": 1621060937, "retrieved": 1632954426, "over_18": false, "upvotes": 289, "upvote_ratio": 1.0, "comments": {"gyeg6gi": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gyeg6gi/", "text": "Get rid of LinkedIn.  I've never had one and I've never had any issues getting interviews or jobs.  It's just an online dick measuring contest.", "author": null, "created": 1621220664, "upvotes": 1}, "gydagz1": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gydagz1/", "text": "I deal with it by not having an account on that cesspool of a website. A social network for industry professionals, where they're supposed to market themselves to employers, like can someone even come up with something that sounds more toxic and uncool?\n\nFrom what I heard and saw in a few people's accounts it's mostly older men hitting on younger newbie-to-biz-life women anyways. Ick.\n\nIf I were you I'd just delete the account.", "author": "gkayaalp", "created": 1621199900, "upvotes": 1}, "gya9udo": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gya9udo/", "text": "I find this true for Twitter actually.. so I mostly stay away from it.", "author": "green-tea-11", "created": 1621134215, "upvotes": 1}, "gy9l6co": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy9l6co/", "text": "I like LinkedIn because it's an easy way to keep track of people i like from my work past. If they achieve something or start something new, i want to be there to say congratulations.", "author": "SavesNine9", "created": 1621120184, "upvotes": 3}, "gy9co1g": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy9co1g/", "text": "LinkedIn makes me very petty, or maybe I always was. Unable to celebrate my colleague's success, because I feel I deserve it too and then I see I'm stuck. I recognize this thought line right away and fight it off, but it sucks that my natural instinct is to be petty.", "author": "-gun-jedi-", "created": 1621115614, "upvotes": 3}, "gy8yxt8": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy8yxt8/", "text": "That's not imposter syndrome. That's comparison. And it's not healthy. Working on one's self esteem is important here.", "author": "RuthlessKittyKat", "created": 1621108531, "upvotes": 6}, "gy8trzr": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy8trzr/", "text": "I mean....the whole point of LinkedIn IS to put your best self forward. But you shouldnt compare highlight reels with behind the scenes, as that saying goes", "author": "sickleandsuckle", "created": 1621105945, "upvotes": 2}, "gy8qkqx": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy8qkqx/", "text": "I think of it as a portfolio/career timeline. I don’t browse other people’s pages or their accomplishments. I’m not even really on there unless it’s something I’m actually proud of. I don’t post or announce, only update my profile", "author": "33ducks", "created": 1621104361, "upvotes": 2}, "gy8eibu": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy8eibu/", "text": "I don't really look at or post on LinkedIn. I kind of just use it as a place to add people I've met elsewhere and also to keep a sort of CV on my profile. I wouldn't worry about it too much, I don't even feel like a lot of people pay attention LinkedIn beyond that.", "author": null, "created": 1621098570, "upvotes": 6}, "gy8dc6n": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy8dc6n/", "text": "I agree with many of the sentiments other commenters posted about how linkedin is just people BSing. But also, please try to remember if you are in grad school, you are already in a small percentage of the population that is doing really well for themselves. The people who are boasting about things that are in reality normal and common things that we all have a shot at, are boasting because they need external validation that they are successful. \n\nPlus people who are really doing the important work don’t even have the time to update they’re LinkedIn.  My PI is a chair at an Ivy League. She doesn’t even have a LinkedIn. Same goes for a lot of big shots in different fields.", "author": "coffeebeforebed_", "created": 1621098010, "upvotes": 7}, "gy8ckoh": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy8ckoh/", "text": "The literal point of LinkedIn is to share accomplishments, get connected with others in fields you’re interested in/see what they’ve done to get there, and apply for jobs/provide a space for recruiters to reach out. I’ve personally found it really helpful, and I love hearing what people are up to professionally. If you don’t like that, no one is forcing you to use LinkedIn. I don’t like some other social media platforms, so as a result, I don’t use them.", "author": "Useful_Cheesecake673", "created": 1621097648, "upvotes": -1}, "gy87bud": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy87bud/", "text": "I think it’s like any other social media platform, where we see the highlights/exaggeration of people’s work and not necessarily the reality of the situation. Much easier said than done, I try really hard to remember this when I see those types of posts. I also removed myself from all other forms of social media and I’ve felt SO much happier because of it. Maybe take a break and see how you feel after focusing 100% on your own goals. Interestingly, I found more “anonymous” forums like this to be far more positive and uplifting because people are less inclined to brag all the time (there are always exceptions, of course).", "author": "sr41489", "created": 1621095136, "upvotes": 3}, "gy85yxr": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy85yxr/", "text": "I dislike LinkedIn for many of the same reasons already mentioned. It definitely exacerbates imposter syndrome and it’s full of very surface minded goals of having “500+ connections to improve your publicity”. So instead, I focus on building my own personal website and work on updating all of my accomplishments and goals there. It removes the “social media” aspect of publicizing your accomplishments and greatly benefitted me mentally by having my own domain and going to there frequently to avoid imposter syndrome on LinkedIn.\n\nWith having a personal website, you can also form a smaller community of professionals that actually will support your growth. I personally linked my personal website on my summary on LinkedIn because the ones who don’t care about my work will not visit my website. The ones who do will make the regular effort to check on my progress and development as a professional.", "author": "WirrryWoo", "created": 1621094477, "upvotes": 7}, "gy84awf": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy84awf/", "text": "I haven't been on LinkedIn for long but I've solely used it for marketing and coffee chatting people who are in my desired line of work (PhD's in Pharma mainly). Most of my connections are strangers I reached out to and I've found LinkedIn incredibly helpful in this way. Gotten so much amazing advice from amazing people.\n\nOne thing I've noticed is that impressive individuals don't need to post on LinkedIn to prove their worth - their work speaks for itself. The most intelligent and capable people I know have a succinct LinkedIn page and only really post about recent developments in the field they're passionate about - rarely of their own accomplishments unless it's truly exceptional.\n\nPoint is, a talented person doesn't need to post about their accomplishments because they don't value external validation to make themselves feel special, they already know they are. LinkedIn is just a pissing contest and it's hard to find genuinely accomplished people on it.", "author": null, "created": 1621093672, "upvotes": 7}, "gy835ws": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy835ws/", "text": "God, I am definitely finding it hard seeing all these people I knew from undergrad now lawyers or doctors or whatever and I’m still in school 🙃", "author": "soytitties", "created": 1621093116, "upvotes": 10}, "gy80f0f": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy80f0f/", "text": "My sister was feeling the same way, the feeling even aggrevates when you lose the opportunity you had.\nHere is the blog she wrote about her journey of dealing with it\n\nhttps://ksoneji.medium.com/youre-not-alone-689fd1592c07", "author": "maulik12", "created": 1621091787, "upvotes": 5}, "gy7wki3": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy7wki3/", "text": "LinkedIn is full of bs people bs’ing. Because when you don’t have real skills, all you have is the ability to try and sell yourself. Don’t read too much into it.", "author": "thatbrownkid19", "created": 1621089917, "upvotes": 33}, "gy7ukb4": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy7ukb4/", "text": "Don't worry about comparing your work to others, even if they are within the same field as you. Impostor syndrome does happen to me all the time but I choose to stay positive by focusing on my life achievements. It could be that someone has been engaged in 10 amazing projects for a year, and good for them. It's like Facebook and someone that sees your profile feels the same way. Life is also not always about our professional lives too. Sometimes we want a summer off over having a job, volunteer site, or internship. \n\nI for one have never had an internship before and 99% of other grad students I know had various in their undergraduate years. I still work in a preferred school district a few blocks from where I live  (sub teacher finishing masters for teaching license) and I get called to work by the schools every day. So those opportunities that I never experienced or could put on my LinkedIn page didn't negatively affect my work.", "author": "cookie058", "created": 1621088904, "upvotes": 2}, "gy7sr10": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy7sr10/", "text": "Exactly. Facebook also has become brag central.  Everyone brags about their families, their children, and their crappy photos.  Linked In, Facebook and Instagram - avoid them like the plague.  I find Twitter and Reddit so much more useful.", "author": "ExactEmu7443", "created": 1621087939, "upvotes": 14}, "gy7ehoy": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy7ehoy/", "text": "Yeah LinkedIn is toxic. Everyone saying they’re “humbled” to announce something stellar", "author": "Parking_Pineapple440", "created": 1621079064, "upvotes": 83}, "gy6xfif": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy6xfif/", "text": "I guess I am constantly working on something that can be highlighted in my CV, lol.\n\nFinding the right wording for what you're doing is a big part of it though, maybe you're just too honest for this game.\n\nThough, I don't really spend time browsing LinkedIn\n\nMy timeline is full of lower management people that try to convince their network they are an actual leader or something. Once you get to know the daily life of one of those shiny advice-droppers it all falls apart (which is a good thing for your own peace of mind)\n\nThere's people calling themselves xy-researcher after reading  a paper on xy and writing a blog post about it. That takes an afternoon. Vastly overstating your role in some cool project is a classic too.", "author": "Single_Blueberry", "created": 1621063221, "upvotes": 70}, "gy6vquq": {"link": "/r/GradSchool/comments/ncskh3/linkedin_aggravates_the_impostor_syndrome/gy6vquq/", "text": "I find this to be a common feeling for me too. I don’t go on LinkedIn that often because of that, sometimes it discourages me or makes me feel like I’m not ahead of anything. But the reality is that everyone has their own timeline and each event (good or bad) happens for a reason. I try to steer away from LinkedIn because I don’t see a lot of posts that show people who also fail. While sharing successes are great, I do wish I could see more authentic posts. I deal with this by reminding myself that I’m not like those LinkedIn people because 1) we’re different and 2) our goals and experiences are different hence why each event happens at a specific time. I also don’t have the app so it helps me to not check it :)", "author": "sweethome_jj", "created": 1621061684, "upvotes": 44}}}