{"sid": "n8kloa", "link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/", "title:": "DONE with classes FOREVER! A brief note on hope.", "text": "Hi everyone,\n\nI just turned in my final assignment as a doctoral candidate in psychology. I will be completing my APA internship this year and hopefully defending my dissertation before June. I hope this does not seem like a humblebrag, as that is **NOT** my intention with this post. \n\nNow for the hope for those who feel like they can't make it.\n\nFirst off, ***you can.*** I wanted to share that I am someone that struggled academically. I started off at community college, did very well but always had to work \"much harder\" than the other students. For example, if someone told me they were studying for 5 days before an exam, I knew I needed to study for at least a week or two. For my bachelor's degree, I did fairly well but still made the occasional B-/C+ in courses related to statistics and research methods, which killed any hope I had of being a researcher. I was able to get into a master's program, but it was grueling. I did not believe I would pass some of my classes but I still never gave up. I found new study techniques and emotional support to offset the exhaustion and fear of failure. My dream has always been to be a doctor of some sort, but I felt like I was not intelligent enough to make it. My master's GPA was 3.63, compared to my classmates who had 4.0's and were thriving. I still wanted to pursue a doctorate but I was terrified of rejection and confirming my greatest fear: I am stupid or an imposter. Nevertheless, I was encouraged by a faculty member to apply to a few programs, and to my shock, got interviews at great programs.\n\nFast forward to today, I passed my doctoral comp exams with honors, have published a paper and poster presentation, and landed my dream internship (I'm studying to become a clinical psychologist). I know it is difficult and this may seem like fluff to some, but for those who have felt like me, please just keep going. It is possible to make it when you don't think you can.", "author": "Btrad92", "created": 1620585949, "retrieved": 1632953831, "over_18": false, "upvotes": 409, "upvote_ratio": 0.99, "comments": {"gxl8pbs": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxl8pbs/", "text": "Thanks for posting this. Also in a clinical psych doctoral program and am currently on the tail end of an all-nighter writing a paper for a class. It sucks at the moment :/.", "author": "BakaDida", "created": 1620638745, "upvotes": 2}, "gxkd33f": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxkd33f/", "text": "Congratulations on this process and time of your life!\n\nThe motivation I needed to hear! Thank you for this inspiring note! \n\n<3 \n\nPs. Just curious would you advice to work on your thesis research at the same times while being on an internship?", "author": "BlissMeli", "created": 1620614058, "upvotes": 3}, "gxk4mef": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxk4mef/", "text": "Are you me? I literally was like I also struggled in classes I also needed to study and work harder. I just finished my classes and a doctoral candidate for epidemiology! It feels great! It’s been a tough road but if I could do it anyway can! In undergrad I needed a ton of help with my biology degree and had like a 2.97. I have a NCI funded grant that I’m doing as my dissertation. Never thought to make a post so sorry just relating to you and following your coat tails!", "author": "Jasquirtin", "created": 1620609139, "upvotes": 3}, "gxjxwxo": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjxwxo/", "text": "Finishing up bachelor's this week and so over it. Ready to start masters in the fall. Now if only these two papers would write themselves...ugh. I can tell they're not going to be good work. I don't care. The professors don't care. They're not being presented. I just legit need to treat this like a final assignment it is and move on. I already got into graf school. Who cares if I don't get all As this semester", "author": "Empire_Collapsing", "created": 1620605326, "upvotes": 3}, "gxjtka1": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjtka1/", "text": "Congratulations!!!! <3 I'm in my third year of undergrad in Psych rn hoping to hear back on whether I have been accepted to pursue an honours thesis soon and this really inspired me :)", "author": null, "created": 1620602878, "upvotes": 2}, "gxjsmm0": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjsmm0/", "text": "I'm studying for my comps in School Psychology and I needed to hear this today. Thank you!", "author": "kitten_twinkletoes", "created": 1620602356, "upvotes": 6}, "gxjqdts": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjqdts/", "text": "[deleted]", "author": null, "created": 1620601112, "upvotes": 2}, "gxjolpk": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjolpk/", "text": "I will start my undergrad in psychology this year and am very inspired by this post. Thank you and congratulations!", "author": "WearyFighterBird", "created": 1620600151, "upvotes": 3}, "gxjiw6h": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjiw6h/", "text": "I just got done with my bachelors and I'm going into my masters in the fall(hopefully). This gave me alot of hope. Thank you", "author": "Edgery95", "created": 1620597155, "upvotes": 4}, "gxjgp6d": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjgp6d/", "text": "CONGRATULATIONS you deserve to be so proud and to celebrate this moment. \n\nAlso:\nOmg are you me. I started in community college before transferring. I’ve done well but it’s such a struggle. I work so so so much harder than my classmates just to keep up. THANK YOU for posting this because it gives me hope. I want to get my PhD in psychology more than anything and I am determined but so scared that I can’t keep up.", "author": "helianthusagrestis", "created": 1620596054, "upvotes": 12}, "gxjgiyu": {"link": "/r/GradSchool/comments/n8kloa/done_with_classes_forever_a_brief_note_on_hope/gxjgiyu/", "text": "Oh wow, we’re in the same boat! Just turned in my last final and headed off to internship 😊 CONGRATS", "author": "RomeRawr", "created": 1620595967, "upvotes": 26}}}