{
  "sid": "ql7l4p",
  "link": "/r/GradSchool/comments/ql7l4p/philippinescentric_i_will_explain_why/",
  "title:": "Philippines-centric I will explain why",
  "text": "So uhh I kinda want to stop my grad school because it's mentally debilitating on me. the thing is, the reason why I wrote this is because people in my country would say: \"you wasted your education it is sooooo important!\" We put a big emphasis on education. \n\nso for Filipinos who left the grad school life, how did you deal with the consequences? Did they fire the reponse of \"your educiation is wasted!\"",
  "author": "Doranusu",
  "created": 1635869311,
  "updated": 1635891379,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hj1d9yp": {
      "link": "/r/GradSchool/comments/ql7l4p/philippinescentric_i_will_explain_why/hj1d9yp/",
      "text": "I didn't do grad school in the Philippines. Partly because my degree of choice wasn't even offered in the PH. Mostly because of all the horror stories that my friends have had concerning grad school here.\n\n\nGrad school in the Philippines is primarily designed for people planning to work in the academe, unless it's an MBA. Other than that, though, it feels very much like a second undergrad. You're faced with terror profs, politics and all sorts of bullshit that are designed to make graduating as difficult as possible. So many friends I know, including ones who graduated with honors in undergrad and loved their alma mater, have dropped out for those reasons I mentioned. They were overworked, treated like shit and still had to bust their asses despite working full-time. There was very little sympathy given to them, and a lot of profs relished the thought of failing entire classes. Imagine having to work in the morning and put in effort to go to additional classes at night, and then your shitty prof still has the gall to fail you despite being an awful teacher? I would quit, too.\n\n\nI did not encounter these abroad. The impression I got was that my university genuinely wanted to teach me new skills so I could become competitive in my chosen field. My professors genuinely wanted to help me and were very easy to communicate with. If someone was in danger of failing, they would be given additional help so they could catch up. If someone was having personal or family or work problems, there would be special accommodations made.\n\n\nMy point is, it's okay to leave. Many have done it. I actually do think many Filipinos go to grad school for the wrong reasons, too. Most do it because they \"might as well\" or think it's just something you have to do to advance your career. This is untrue for many careers as experience is still widely preferred in most industries.",
      "author": "66th_jedi",
      "created": 1635875322,
      "upvotes": 1,
      "replies": {}
    }
  }
}