{"sid": "pkcs89", "link": "/r/GradSchool/comments/pkcs89/being_ghosted_by_a_professor_whom_i_worked_for/", "title:": "Being ghosted by a professor whom I worked for for 2 years.", "text": "Hey everyone,\n\nSorry for the rant but I’m very frustrated and confused about what to do with this situation. Basically, during my undergrad I worked as a research assistant for a professor for 2 years. I did pretty much everything for them, participant recruiting, data collection, and data analysis. I worked as many hours as I could for the lab because I really enjoyed the research and developed a really good bond with the PI. Even sometimes I worked off the clock doing all nighters because I was dumb and passionate. The professor who I worked for said when the time comes they’d do anything to get me into grad school.\n\nThis summer I wanted to apply to my program, the deadline is in November but once they run out of positions they won’t accept anymore students. I asked my professor to write me a LOR for the program last spring which she happily obliged and said to give her a few weeks. I did. I gave her two and a half months. I emailed her a few weeks ago politely asking her about the status of the letter since I told her I wanted to apply around this time. I received no reply and figured since it was summer she could be out of office. The school year just started so I sent her another email and again no reply. Frustrated, I texted a grad student who worked in the lab who I am pretty good friends with asking to see what’s going on. He said that he talked to her and she regrets saying she would write me an LOR that she’s just “too busy” with the ONE CLASS she’s teaching this semester. I worked for her for 2 years and gave her months to write me an LOR and now she just doesn’t want to write me one anymore.\n\nI can get another LOR but it’ll probably be very weak since it’ll be from either my volunteer coordinator or some I shadowed. I was wondering what you all’s advice would be on this situation?", "author": "Khaner", "created": 1631114980, "retrieved": 1632844708, "over_18": false, "upvotes": 9, "upvote_ratio": 1.0, "comments": {"hc32p7v": {"link": "/r/GradSchool/comments/pkcs89/being_ghosted_by_a_professor_whom_i_worked_for/hc32p7v/", "text": "/u/chatsurlalune has the best solution, IMO.  I have been a bench mentor for undergrads and techs, when the time comes I write the letter and my PI will look over it, add to it, then sign off.\n\n&#x200B;\n\nHonestly, she is really wrong for doing this.  You certainly gave her plenty of time, but she doesnt want to do it for reasons that are unknown/dont make much sense.  If you have a direct report that was not her (manager, grad student, research associate etc) ask them for the letter if you must.", "author": "ReformedTomboy", "created": 1631123541, "upvotes": 6}, "hc2xj47": {"link": "/r/GradSchool/comments/pkcs89/being_ghosted_by_a_professor_whom_i_worked_for/hc2xj47/", "text": "Write up the letter yourself and have her sign off on it. Of course, she can then go through and add little details and the like. I know of a professor who has severe ADHD and some other health problems. It's basically impossible to contact her once classes start or something else that's stressful and requires a lot of juggling of roles. It was frustrating because I wanted her LOR. I ended up not needing it, but damn was it stressful trying to reach out to her :(\n\nI would also recommend meeting up with her in person. If the issue is that she's too busy, then that can be cleared up pretty easily.", "author": "DigitalPsych", "created": 1631121435, "upvotes": 2}, "hc2t0f4": {"link": "/r/GradSchool/comments/pkcs89/being_ghosted_by_a_professor_whom_i_worked_for/hc2t0f4/", "text": "I’ve never been in this situation so take my suggestion with a grain of salt. It sucks that you’re in this position and imo she should really follow through on her promise. However I’ve seen people talking about profs asking their grad students to write letters and then signing off on them. Maybe an option is for one of these grad students who worked with you to do this? That way you get an lor signed by that PI and the PI doesn’t have to spend time writing it", "author": "chatsurlalune", "created": 1631119572, "upvotes": 7}}}