{
  "sid": "hex6e6",
  "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/",
  "title:": "My university’s “roadmap to reopening” is completely directed at undergrads.",
  "text": "Today we got sent a mandatory survey about our plans for the fall. The options A) planning to return to campus for hybrid classes, B) planning on not coming to campus and taking all online classes, C) not returning to the university for the fall. \n\nHow I am supposed to answer that as an ABD student who is not in classes, not TAing classes, planning on working from home but maybe also in the lab when I need supplies, or library when I need books, and might even be out of state at my research site If they ever let us travel. \n\nFor my fellow grad students still in classes, they haven’t been told if they are online or in person yet and don’t really have a choice in what classes they can take. Plus most have to TA, and recitations are currently required to be in person, even if all their grad seminars will be online (our department is working hard to move all recitations online thankfully, despite resistance from the university).\n\nOn top of all of that, they are planning on letting 30,000 students come back to campus from all over in a bit over a month, but won’t let graduate students leave the state for research they have funding to do, some time sensitive. And when we (and our advisors) ask if there is a plan or time line are either ignored or told it will be figured out at some point, but that currently figuring out fall on campus is the priority.  \n\nI get that undergrads make up 2/3 of the student body, but graduate student are the other third and our needs can’t all just be lumped in with the undergrads. \n\nIs anyone else’s university handling this better for grad students?",
  "author": "archaeob",
  "created": 1592986522,
  "over_18": false,
  "upvotes": 315,
  "upvote_ratio": 0.97,
  "comments": {
    "fvx73ob": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvx73ob/",
      "text": "General uni policy is aimed at undergrads on my campus. They seem to be mostly leaving grad policies up to the departments. \n\nThere are some general guidelines we all have to follow, but most of the campus wide emails aren’t terribly relevant for me.",
      "author": "microvan",
      "created": 1593056024,
      "upvotes": 1,
      "replies": {}
    },
    "fvx2b6p": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvx2b6p/",
      "text": "Omg, my university did something similar when COVID was hitting the world. They stated students can choose to go home or stay, the university will close indefinitely. A week or 2 later after grad students are confused because they don't mention us in a university- wide email,  they say the email is for undergrads, speak with your supervisor to figure out your options.",
      "author": "levie17",
      "created": 1593053059,
      "upvotes": 1,
      "replies": {}
    },
    "fvwxuva": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwxuva/",
      "text": "My university is handling it pretty well for most PhD students, but certain policies have made it really hard for others. I personally haven't been negatively affected at all, but my partner has been indirectly affected. While he's still allowed to use his lab, there are other labs that he needs to use with specialised equipment that only the lab techs can run, and those folks aren't currently allowed back to work. So effectively my partner hasn't been able to get half of his testing done for around 4 months now with no real end date in sight. And for anyone doing field work, it's basically all been scrapped until further notice.\n\nI don't really think that the uni is that heavily to blame, because at the end of the day they have to follow social distancing rules and regs. But it would definitely be nice to see a little more support for the students who have been affected through scholarship extensions, leniency in milestones, that sort of thing.",
      "author": "fiorescuro",
      "created": 1593050417,
      "upvotes": 1,
      "replies": {}
    },
    "fvwf84b": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwf84b/",
      "text": "My university has said they're prioritizing undergraduates coming back to campus, and that all graduate classes will be online for the fall. Their logic is that, at least for my specific program, many of us will be on internship so we'll be out and about, interacting with folks at our site, and will then be more likely to bring the virus back to campus. I guess?\n\nWhat annoys me is that my program is small and the classes I'm registered for in the fall have max 10-12 students. That would seem easy to hold in person while still social distancing. But no, the university is taking over our spaces because they need more room to social distance the underclassmen. \n\nSeveral folks in my program are already raising a stink, saying they won't pay full tuition for this, etc. Good luck to them - I don't think their complaints will change anything. Best option is to take the semester off and return in the spring if things are back on-campus, I guess. Personally I don't have the luxury of doing that. I am in debt and need to graduate ASAP so I can get a full-time job in my field ASAP, so I'll be suffering through online classes this fall.",
      "author": "tequilamockingbird16",
      "created": 1593038217,
      "upvotes": 2,
      "replies": {}
    },
    "fvwcxla": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwcxla/",
      "text": "The mass emails from my university are totally different than the ones from my department. The university is pro-F2F instruction in fall (with plans to move lecture-style classes online and F2F classes smaller overall). My department, however, is basically saying “Fuck all that noise. Stay at home.” Our TAs are instructors of record, and we’ll have to request F2F instruction if we want that. As for seminars, the expectation is that we go online unless a professor requests F2F for particular courses. I’m bummed about how much of my MA will be spent online but happy with the support the department is giving us.",
      "author": "calypso_ks",
      "created": 1593037024,
      "upvotes": 3,
      "replies": {}
    },
    "fvwa16s": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwa16s/",
      "text": "I'm currently the only grad student abroad in my program, so I got a bit of special attention. I was given the choice if I wanted to stay here or go back -- luckily I was already setup for a long term stay, so I stayed. While I can't actually access the lab at the moment, and I have no idea yet when I will, the grad students back at my home lab are in a similar position. \n\nDepending on how things are in the fall, I may end up forced to go back to the states with no more lab time, but I am /very/ glad I wasn't forced to scrap the trip back in March.\n\nMost of the focus has been on helping grad students make the switch to online TA-ing (I think about half of our students TA any given term). I know the faculty/staff are getting a lot more info about lab re-opening than we are, and my group seems to be passing along the status as soon as they know things, but I can imagine that adds confusion in other situations.",
      "author": "cc_cyanotephra",
      "created": 1593035559,
      "upvotes": 1,
      "replies": {}
    },
    "fvw8pua": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvw8pua/",
      "text": "Are you at UNC Chapel Hill by chance? I just got the same survey today.",
      "author": "queer_potato_",
      "created": 1593034909,
      "upvotes": 2,
      "replies": {
        "fvw90ne": {
          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvw90ne/",
          "text": "Yup (pretty obvious if you look at my post history so I guess there is no harm in saying that). \n\nI still have no idea how to answer and neither does anyone else in my department I've asked. I think I'm just going to ignore it and if they get mad, oh well.",
          "author": "archaeob",
          "created": 1593035060,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fvvsn1l": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvvsn1l/",
      "text": "Yes! The same thing is happening in TU Delft right now. We're essentially being treated as an afterthought right now. Really heartbreaking stuff.",
      "author": "AlekhinesDefence",
      "created": 1593027103,
      "upvotes": 1,
      "replies": {}
    },
    "fvviq1u": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvviq1u/",
      "text": "One more reason I’m glad I’m doing grad school at a school with no undergrads",
      "author": "ImJustAverage",
      "created": 1593022341,
      "upvotes": 0,
      "replies": {}
    },
    "fvvh054": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvvh054/",
      "text": "Based on the timing of the survey and the questions, I think I may be at the same university as you. I'm able to do all of my work remotely (and lucky enough to be in a field where this doesn't directly impact my ability to do my work) and don't have any teaching obligations in the fall, and there was no way to express that on the survey.\n\nA bunch of administrators, many of whom have been through grad school themselves, really should have thought about this.",
      "author": "Awkwerdna",
      "created": 1593021511,
      "upvotes": 3,
      "replies": {}
    },
    "fvvanbt": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvvanbt/",
      "text": "Personally I think this is something that may be better sorted out on a lab to lab basis.  I'm perfectly happy with all my PhD students working remotely wherever they're safe. But we're in computer science, so as long as they have a laptop and internet connection to SSH into our servers they can work wherever they want. What does your advisor say?\n\nOther fields which require lab work are going to have completely different needs.",
      "author": "Vystril",
      "created": 1593018505,
      "upvotes": 2,
      "replies": {
        "fvvbm58": {
          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvvbm58/",
          "text": "Advisor says keep sending emails and CC’ing her on them. She wants me in the field ASAP, but can’t do much about the university banning all out of state travel. She doesn’t want me on campus in the lab, as I can do lab work from home (if I had any to work on since I finished everything up two weeks ago), just in the field actually digging. \n\nUnfortunately she is in the middle of trying to move her and her whole family back to the US from a country in Europe where she was all last year and so super busy, leaving me to do most of the emailing, cc’ing her to indicate her support.",
          "author": "archaeob",
          "created": 1593018970,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fvval8o": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvval8o/",
      "text": "Recent PhD Grad here from Hong Kong. \n\nOur city was on the frontline of covid since January. 90% of our grad students went back home in mainland China just as things were getting heated up and it was just all uncertainty. Officially they sent out emails for undergrads and staff but as you mentioned graduate students didn’t get any emails until well in April. Being a local I was basically the only person in the building so I had to tend to all the plants. I managed to “borrow” a box of face masks and some alcohol from our stash so that was a plus. I had to delay my thesis defence a month and even now some people still haven’t made it back to our university. \n\nOverall I agree with the general sentiment. Grad students always get the short end of the stick. We are treated as students and as staff whenever it is convenient and as neither when it’s not. Oh but wait! They’re letting students apply for dorms past their normative period! That’s literally the only positive things that the school has done for us.",
      "author": "iamthekmai",
      "created": 1593018478,
      "upvotes": 3,
      "replies": {}
    },
    "fvv5dfu": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv5dfu/",
      "text": "We had a meeting today to discuss how things will go, and they had answers for a lot of TA questions but when I asked if there would be an option to finish classes virtually if a family member fell ill or elementary schools and daycares closed again, the response was \"not yet\" which kinda felt like they hadn't even considered it as an issue students would run into.",
      "author": "Littlefingersthroat",
      "created": 1593015934,
      "upvotes": 5,
      "replies": {}
    },
    "fvv513d": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv513d/",
      "text": "All of our mass emails targeted undergrads. Each department here is responsible for reopening labs and deciding what the TAs are doing. We usually have a summer teaching assignment. Typically it's just teaching a lab or 2 for summer sections. This year we've been told that we're going to videotape all labs in case we go completely online. Otherwise the sections have been divided up and now I have to teach kids ochem at 7 AM on Saturdays. They really haven't told us anything else about the fall yet.",
      "author": "Its_Just_Jen",
      "created": 1593015768,
      "upvotes": 4,
      "replies": {}
    },
    "fvv3x5n": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv3x5n/",
      "text": "I would say I feel as though my university is handling this better.  I was allowed back in my lab about 2 weeks ago.  Graduate students doing research that requires wet lab work are allowed to return to their labs but we have daily wellness checks and have to log the exact hours we are in our building as well as wearing masks and distancing.  The University made it a priority to get grad students back in their labs.  \n\nUndergrads will be returning to campus at the end of August with a mixture of online only and hybrid classes as is reasonable for the class.  Any in person classes will conclude prior to thanksgiving with the semester finishing remotely and students not returning to campus until January.  Grad students have always been considered separately through all of this though.",
      "author": "PaperPhD",
      "created": 1593015228,
      "upvotes": 16,
      "replies": {
        "fvv4x8y": {
          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv4x8y/",
          "text": "Same here. Research labs were the first priority at my university. The larger roadmap only puts us in Phase 1, but after Phase 1 its mostly autonomous as to what graduate students want to do with the exception of TAs. If grad students don’t want to do in person research, then they don’t have to. If they don’t want to attend classes in person, they can live stream. Altogether my university is trying to make it as flexible for everyone except instructors.",
          "author": "fserv11",
          "created": 1593015716,
          "upvotes": 3,
          "replies": {}
        },
        "fvv67za": {
          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv67za/",
          "text": "We were allowed back in labs June 1, with masks and social distancing, which has been great for a lot of grad students. It’s those of us whose research involves travel which they won’t give us any guidelines on. That is most people in my department as we do field based research. \n\nThat is nice you’ve been considered separately. We’ve just been getting both staff and undergrad emails and having to parse out what applies to us.",
          "author": "archaeob",
          "created": 1593016349,
          "upvotes": 2,
          "replies": {
            "fvv6o8k": {
              "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv6o8k/",
              "text": "Has your department chair been given any information.  Honestly,  all the important information for graduate students have come directly from my department chair with very little to no communication directly from the university.",
              "author": "PaperPhD",
              "created": 1593016574,
              "upvotes": 1,
              "replies": {
                "fvv70w7": {
                  "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv70w7/",
                  "text": "Chair, very little. She has mainly been working on getting the university to allow all of our department’s classes and recitations to be virtual. Our current DGS is useless sadly. \n\nThe head of the archaeology labs, who is on my committee and supervises my RA position has been amazing. She has been emailing people for me and the other students who need out of the state (some out of the country) every week. Checking in to see of we’ve heard anything and actually calling us on the phone to let us know any updates ASAP.  She has had no more luck than us in getting info on this particular issue.",
                  "author": "archaeob",
                  "created": 1593016748,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fvv33ci": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv33ci/",
      "text": "One of the more infuriating things for me was the grading choice rule at my school. \n\nUndergrads could opt in or out of their grades as long as they were passing. \n\nGrads couldn't even with elective courses.",
      "author": "zaqhhh",
      "created": 1593014816,
      "upvotes": 2,
      "replies": {
        "fvv50g8": {
          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv50g8/",
          "text": "How much do grades matter for your program? Things have to go really wrong for you to get a C. A gentleman's B is basically the floor.",
          "author": "59snomeld",
          "created": 1593015759,
          "upvotes": 6,
          "replies": {
            "fvv7gxy": {
              "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv7gxy/",
              "text": "Well I mean for the Semester in question, I made all As. I'm in a MPH program btw. \n\nWorst I've ever gotten is a B in my program, but I'm one of those people who really cares about my GPA. Would take a pass versus a B or B+\n\nStill think its unfair though.",
              "author": "zaqhhh",
              "created": 1593016966,
              "upvotes": 1,
              "replies": {
                "fvwr225": {
                  "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwr225/",
                  "text": "If you take a pass, everyone reviewing your transcript is going to assume you got a C or a D. It's only helpful if you're worried about GPA cut offs.",
                  "author": "mediocre-spice",
                  "created": 1593046307,
                  "upvotes": 0,
                  "replies": {
                    "fvwr6u4": {
                      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwr6u4/",
                      "text": "Who would care though? Once I get my masters, it's done. So I'd rather have the GPA I want.",
                      "author": "zaqhhh",
                      "created": 1593046397,
                      "upvotes": 1,
                      "replies": {
                        "fvwunf2": {
                          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwunf2/",
                          "text": "Who would care if you get a B...?",
                          "author": "mediocre-spice",
                          "created": 1593048518,
                          "upvotes": 1,
                          "replies": {
                            "fvwvqbh": {
                              "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwvqbh/",
                              "text": "Me lol though I guess im starting not to",
                              "author": "zaqhhh",
                              "created": 1593049157,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fvuvucv": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvuvucv/",
      "text": "At the end of the day, they're paying tuition and you're not, which informs the uni's priorities",
      "author": "Dathadorne",
      "created": 1593011193,
      "upvotes": 5,
      "replies": {}
    },
    "fvuvs4y": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvuvs4y/",
      "text": "My research involves being on a lab and I'm not taking any more classes, so all the reopening instructions we've been getting are from the research operation offices. Grad students who are ABD and not teaching are essentially following the same guidelines as research staff and postdocs here.",
      "author": "PumpkinCrumpet",
      "created": 1593011161,
      "upvotes": 1,
      "replies": {}
    },
    "fvul782": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvul782/",
      "text": "I'm seeing a lot of variation. CGS has been keeping [a list of grad school responses](https://cgsnet.org/covid-19-response-institutional-resources-and-examples) to COVID that might be worth looking at. \n\nI think the undergraduate and international student issues are so massive at this stage that domestic grad students are getting lost in the shuffle. There also remains significant uncertainty in many states about if F2F will be possible given the recent surge in cases in places like Florida.",
      "author": "HighestIQInFresno",
      "created": 1593005352,
      "upvotes": 13,
      "replies": {
        "fvvozck": {
          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvvozck/",
          "text": "Is this list that CGS is keeping internal or available publicly?  I'm VERY curious about how some of these schools are handling it.  Definitely feeling VERY lost in the shuffle, but I'm an incoming student so I wasn't sure if not getting any sort of communication from the uni as a whole, grad college, and department right now is prevalent or a \"just me\" type thing.",
          "author": "LadyWolfshadow",
          "created": 1593025334,
          "upvotes": 3,
          "replies": {
            "fvvq9ey": {
              "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvvq9ey/",
              "text": "This is the public list. Most grad students and instructors that I know have received some sort of communication, but often that communication is just to tell them to look out for further emails coming later in the summer.",
              "author": "HighestIQInFresno",
              "created": 1593025957,
              "upvotes": 3,
              "replies": {
                "fvvvd8w": {
                  "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvvvd8w/",
                  "text": "Gotcha.  The link didn't show up as clickable when I was on mobile.  Ironically my school is on that list and there's more information about reopening on social media (which is definitely an interesting choice since if the start date had been pushed up, it would have impacted the incoming grad students pretty badly)",
                  "author": "LadyWolfshadow",
                  "created": 1593028398,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fvuk0xf": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvuk0xf/",
      "text": "My school sends an email every week with slightly different wording. Fortunately the graduate union is pushing the university to provide concrete plans for graduate students.",
      "author": "King_Freedom",
      "created": 1593004644,
      "upvotes": 7,
      "replies": {}
    },
    "fvu4rnz": {
      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvu4rnz/",
      "text": "[deleted]",
      "author": null,
      "created": 1592991975,
      "upvotes": 55,
      "replies": {
        "fvu5hup": {
          "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvu5hup/",
          "text": "Yeah, definitely planning on more emails. My biggest frustration is my research site is three hours away, just over the boarder into another state. You can travel further and to much harder hit areas within my state no problem. But there is no mechanism for me to be allowed to pop over the boarder and I’m being treated the same as overseas and domestic research that requires airplane travel. \n\nI’ve basically run out of other productive work to do as of two weeks ago and can’t really start writing without the data I was going to gather this summer, which is where a lot of my major frustration is coming from. \n\nNot as bad as friends panicking about getting to Europe before an EU ban on travel from the states happens. \n\nThe university has great really details plans for resuming research on campus and in the field within the state. It’s more the info for fall reopening for grad students as well as research travel that they have really failed us on.",
          "author": "archaeob",
          "created": 1592992726,
          "upvotes": 14,
          "replies": {
            "fvu7fse": {
              "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvu7fse/",
              "text": "Yeah I suppose the problem with interstate and international travel plans (which is what you’re having problems with) is that it’s not your university’s decision. Individual states can close their borders and deny entry/exit. They could close it without notice while you’re on the other side. So it’s all pretty complicated, and they’re not going to want to approve interstate travel (whether you’re close to the border or not is irrelevant) and the release of funds when it’s still so risky. If something happened to you or your plans then it’d be their problem, so it’s fair that they won’t give advice yet.\n\nIt sucks, but there isn’t much we can expect our universities to do or say because it’s 100% going to change before we can even put that advice into practice.\n\nEdit: And I have seen what happened to students who were already overseas (even undergraduates, on course-required exchange). It was not pretty. They were abandoned, with no real way to get home, nowhere to live, and the university was too busy to help a lot of them in any concrete fashion. But also, there's not much they *could* do. *Your* site might only be 100m away, but whatever rules apply to you will also apply to the person travelling to the other side of the country. And if you're on the other side of any border, it won't matter how close it is if that suddenly becomes a hard border. The border 3 hours away from me is a hard border and if I crossed it, I would not be able to return. No exception for residents.",
              "author": null,
              "created": 1592994667,
              "upvotes": 4,
              "replies": {
                "fvv9443": {
                  "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvv9443/",
                  "text": "i mean, extension of deadlines to graduate and funding might be nice, for instance. If I can't get to Europe to look at the manuscripts i need this fall, either i'm going to have to excise a significant portion of one of my chapters or take extra time to finish. the grad students at my university circulated a petition to that effect but nothing came of it, as far as i'm aware.",
                  "author": "joliepachirisu",
                  "created": 1593017759,
                  "upvotes": 4,
                  "replies": {
                    "fvwyx11": {
                      "link": "/r/GradSchool/comments/hex6e6/my_universitys_roadmap_to_reopening_is_completely/fvwyx11/",
                      "text": "Sure, but even that is still up in the air. I know we have blanket extensions for all in their final year, but for everyone else it’s still a little uncertain how requests will be handled. Which is perfectly reasonable because those requests are at least a year away by definition.\n\nOver the last 5 months I’ve lost an estimated 4 months of research time, estimated by my PI. It really sucks, especially when I’m on a strict 3 year time limit, and that loss is going to hit me hard. But I’m not in my final year and I have time to figure out how to work around this. It’s not absolutely urgent for my university to respond **right this second**. I can survive until December even. They can’t give answers until they have answers, and that’s a horribly complicated job.",
                      "author": null,
                      "created": 1593051039,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634066316
}