{
  "sid": "qxaome",
  "link": "/r/GradSchool/comments/qxaome/what_is_the_best_way_for_grad_students_to_make/",
  "title:": "What is the best way for grad students to make their concerns heard?",
  "text": "The graduate students of my program have become fed up with numerous insufficiencies in our program. We had a meeting tonight to bring our concerns together ahead of a graduate committee meeting next month. \n\nThe concerns are our funding and hostility to those who must take outside work due to the lack of availability of TA and GA positions (only 3-4 in a year), even off-semester community college gigs are strongly discouraged. Our program at founding was highly competitive with stipends compared to the local cost of living but is now impossible. We would even qualify for food stamps except for the funding structure, for the ten months of the academic year we exceed the minimum but when that is spread over the full year, we would qualify. Numerous students have been rejected because of that gray area. \n\nThere is also a horrific lack of communication, something that is new to the current grad student administrator so those of us who are late stage remember when we weren’t stuck in the dark about basic information like if we were not meeting expectations in one way or another. Others didn’t even know what classes they had to take and register for. Several people in the program were suddenly placed on probation without any prior communication as to where we were not meeting expectations, and often it was due to major outside factors like family deaths without any support with possible adjustments. \n\nWe have also not been presented anything to compensate the ABD crowd for covid disruptions. It’s history, and the archives we rely on were entirely shuttered for months or a year, I personally had to entirely restructure my thesis to account for that even this past summer. I’m now a fifth year and am functionally where a fourth year would be, and most of the other ABD students are in the same boat. \n\nWe don’t think anything we ask is excessive. Cost of living adjustments so we can live considering they except us to be full time scholars, more opportunities for work within our department especially considering the teaching requirement for our program, communication so we are fully aware of how we are progressing, and something to back up those of us in our dissertation phase who got screwed by covid. Several other departments in our university do COL adjustments and have granted an extra year to impacted dissertation students. \n\nOur immediate plan is to submit letters from each cohort detailing our complaints to our graduate board ahead of next month’s meeting, and to have representatives address the meeting. We all love our field and want this program to work, we want to be scholars. I’ve been very lucky to have a fantastic advisor but that doesn’t fix the broader problems in the program. But we just are not getting the input we need to do so. Is there anything we should change or do in order to make sure we are not just heard but that our concerns are addressed?",
  "author": "aggie1391",
  "created": 1637305589,
  "updated": 1637354502,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hl8m4aq": {
      "link": "/r/GradSchool/comments/qxaome/what_is_the_best_way_for_grad_students_to_make/hl8m4aq/",
      "text": "It is important to have constant communication about mutual expectations between grad students and advisors/program directors. \n\nYou might consider your aims to be a normal conversation that is had. Set up monthly meetings and go through the issues one at a time as you lear to work with one another. \n\nIf you have a new program director, there is a good chance that they are still learning the ropes. More communication really helps at that stage. \n\nSome of the issues are institutional and need to be dealt with at the graduate-school level. That is where stipend levels are set. Stipends vary widely from grossly insufficent to pretty comfortable. It is reasonable for admitted students to expect their stipend to be enough to live on, so when it turns out to be less the rightfully feel cheated. If your university is serious about having a graduate program, it needs to set stipend levels at a livable amount, even if that means substantially reducing the number of students.",
      "author": "IkeRoberts",
      "created": 1637317435,
      "upvotes": 1,
      "replies": {}
    },
    "hlaot01": {
      "link": "/r/GradSchool/comments/qxaome/what_is_the_best_way_for_grad_students_to_make/hlaot01/",
      "text": "It sounds like you need to unionize to fix the stipend and job availability stuff. There's really no other way to put pressure on the administration since they generally consider grad student labor to be an expendable line item that can be indefinitely squeezed, even though any university would collapse without it.\n\nI'm in the same boat as you with regard to the covid-disruption stuff, too; my school lets us adjust our \"year,\" meaning they'll consider you a year 4 even if you're a 5, after you apply, but it doesn't come with more funding. Basically it's just a way to keep your adviser/dept admin off your back for a while.",
      "author": "Argikeraunos",
      "created": 1637351847,
      "upvotes": 1,
      "replies": {}
    }
  }
}