{"sid": "itqs60", "link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/", "title:": "Hate myself for not being productive", "text": "I’ll just keep it short. I feel like I haven’t done anything in the past two weeks, which scares me. I have been suffering from depression for quite some time now (ever since I was a child, my therapist thinks). The therapy didn’t seem to help a whole lot cause I am used to distracting myself by staying busy (an unhealthy coping mechanism, Ik). I have noticed that I got practically nothing done in the past couple of weeks, just barely getting by. Been watching a lot of Netflix (starring at it more like) and sleeping a LOT. I have a shitload of things to do, but I just feel like not existing. It’s not related to work by any means, I have been okay with classes and lab stuff (so this ain’t a downward spiral because I feel like a failure). I just have no motivation AT ALL. I love what I do, so I don’t understand what’s going on here. Thought of pouring my heart out on this sub cause I stopped talking to my therapist and don’t have a SO/close enough friend that I can talk to at this hour. Would really appreciate any help on how to deal with this.\n\nUPDATE: thank you all so much for the kind words and the award. I truly don’t have words to explain how much I appreciate all the suggestions everyone gave. I really really really hope there is some light at the end of this dark and lonely tunnel", "author": "mewhona", "created": 1600240025, "retrieved": 1632846426, "over_18": false, "upvotes": 285, "upvote_ratio": 0.99, "comments": {"g5m1ggf": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5m1ggf/", "text": "Thank you everyone for the great suggestions. Sorry that it took me while to get back to you all, but yesterday was particularly bad. I am gonna try and resume therapy, and probably see a doctor as well to discuss medication options. You guys are awesome 💕💕thank you again for the kind comments. I hope I’ll make it through it all in one piece. *fingers crossed*", "author": "mewhona", "created": 1600366033, "upvotes": 1}, "g5ivvjk": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5ivvjk/", "text": "Something that helps me when I get paralyzed by the mountain of stuff to do and beat myself up for getting so behind is I tell myself \"I forgive myself for getting behind. I can't change the past. Today is a new day and I can start fresh. I don't have to catch up as fast as possible, I just have to start something. Even if I don't catch up, everything is going to be okay.\"", "author": "booksmart00", "created": 1600297136, "upvotes": 2}, "g5hxv9z": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5hxv9z/", "text": "It looks like you've gotten a lot of good advice already, but to add to it. I could have written this same post four months ago. I was in a dark place near the end of my degree process and felt like the finish line was so close, but I couldn't bring myself to do anything, my motivation was non-existent, and it felt very hopeless. \n\nMy lab was supportive, but we do computer modeling, so we were all working very separately with the pandemic, and it wasn't enough for me at the time, very isolating. I wanted to comment because at this low point in my life I actually fired my therapist for a bit because I felt like they weren't helping me, and I was so frustrated. \n\nI ended up taking almost a full month off, re-established some work boundaries, and focused on small victories. Editing one paragraph, fixing one graph, sometimes just opening a new document and giving it a name and saving it etc. Eventually, this, paired with deadlines, forced me into a productive/not cycle that allowed me to make forward progress. \n\nI ended up making another appointment with my therapist and told them that I was mad at them, and we re-addressed how we talked about things and approached problems, which helped a lot. I know right now everything feels impossibly hard, but it does get better. You can do it. Remeber to be kind to yourself.", "author": "madpunchypants", "created": 1600281979, "upvotes": 2}, "g5hjva7": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5hjva7/", "text": "OP your post resonates so much that I could have written it myself, except I’ve been staring at the TV for a while longer than 2 weeks. The thing that helps me is getting workouts in. I paid for a membership to an exercise group and just the financial commitment makes me keep going for zoom sessions. And the best part is you can have your camera off so no fear of being judged. \n\nI know it’s not a long term solution but on a day to day basis it gives me enough happy hormones to sustain myself. I’m high functioning too. I’m on top of my TA duties and an internship but only because those have externally mandated deadlines. For my research mostly I’m staring at a screen blankly. Like I want to bring this work to a conclusion and I know I’m capable but I can’t motivate myself to start where I left off. \n\nAnd years of therapy has finally convinced me that my worth as a human being is not tied to my academic productivity. It’s okay to not be at the top of your game at all times. It’s okay to take time to heal. Don’t be too hard on yourself. This is not a failure, but a pit stop. You need this time to work on yourself and don’t feel guilty about it.", "author": "sciencechick92", "created": 1600275222, "upvotes": 7}, "g5hikou": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5hikou/", "text": "If you are in grad school your university student medical or disability services has therapists for you to talk to. You get a number of sessions for free, and then they will refer you to a local therapist who works with your insurance. They can also hook you up with a psychiatrist to get meds worked out.\n\nTake this seriously. Get help. You're smart for recognizing symptoms so quickly over the last couple of weeks. Reach out to your student health center for therapy/meds.", "author": "gggggggggggfff", "created": 1600274606, "upvotes": 3}, "g5hhay1": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5hhay1/", "text": "I get where you are coming from. I deal with similar feelings sometimes. Here are a few things I do to help me be more positive about myself and the work I am able to do.\n\n1) positive affirmations, I try to tell myself a statement that I can believe about myself and actions. They are simple statement such as 'I am doing a good job'. Sometimes the statement is not as lofty :p. Then it changes to 'I am a good person'. These statements can slowly help build your confidence in yourself.\n\n2) take baby steps on my work load. I make a plan to do one or two goals a day and then break it into smaller steps. Like I have to read a chapter in my book so I count the sections and try to get a halfway(ish) point before a break. Then I allot a certain amount of time to rest and then get back to it. Early on I set a timer. Now I don't and I end up doing more than the goals I set for the day... most days. On days I don't I spend more time on step three...(see the next one)\n\n3) I take note of what I did do that day and give myself honest praise. Early on, that meant talking to myself as if I was someone else, so I would not be harsh or sarcastic with myself. I tell myself I did a good job and that any step is a good step and that I can try to do better tomorrow but I did a good job today.\n\n4) I try to remember when you beat yourself up, all you get is bruised. It does you no good to whip your self for not doing better, it just hurts more in the long run. If I start to spiral I try to put up a stop sign in my mind to help me remember that's it's okay and I deserve to be loved by myself. I don't deserve to be hurt, and that I can do this.\n\n5) I do some deep breathing and try to remember,  'You got this'.\n\nI hope maybe some of these mental tricks might work for you. Overall, you are doing a great job right now by taking the time to notice how you feel and seeking help. I agree with all the others advice on maybe getting a therapist and/or meds but overall, you are on the right track. It won't always be this hard. \n\nYou got this. :) I believe in you and you deserve to believe in yourself. :)", "author": "lmmpdhwannabe", "created": 1600273997, "upvotes": 13}, "g5h9f9k": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5h9f9k/", "text": "I just started my first semester of grad school and been on anti depressants for quite some time now. I'm motivated in that I want to do my best and I want to give it my all but Its so hard to act on that. I waste so much time watching Netflix and then I realize it and I get so mad at myself. Luckily, I don't need to work right now and I don't have a wife/kids so I can sort of get by but I'm lacking the kick that will clear my mind and allow me to soak up all the information. So many useless thoughts that take up space and energy.\n\nFeel free to DM if you want, best of luck either way though.", "author": null, "created": 1600270144, "upvotes": 3}, "g5h9e88": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5h9e88/", "text": "If it makes you feel better, you’re very far from alone. Things are hard for MOST people right now.\n\nFor example, in June the [US CDC](https://www.cdc.gov/mmwr/volumes/69/wr/mm6932a1.htm) found 74.9% of adults 18-24 and 51.9% of adults 25-44 had one or more adverse mental health issue at the time. Mental health struggles are relatively common in normal times, but they are dramatically higher than that right now to the point of actually being more common than not. And it stands to reason people who have struggled before may be having a particularly hard time right now.\n\nThe fact that these numbers are so abnormally bad right now actually gives me reason to hope. The circumstances that are causing this aren’t going to last forever. And I think life will get a lot better for most people as they change. In the mean time, be forgiving and kind towards yourself. It’s a rough time, it’s normal to be struggling because of it.", "author": "Thunderplant", "created": 1600270130, "upvotes": 8}, "g5h0wt7": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5h0wt7/", "text": "It’s scary how much this feels like been written by myself... this has been me for the exact past month and I’m finally feeling like I’m getting slowly better.\n\nWhat worked for me was the following:\n- I started by not doing any of my experiments and coming in only to help others. These brought a lot of gratitude towards me and made me feel like I had an impact on someone else’s life as a scientist.\n- I told my PI that I was going through a rough time in my personal life and that I just wanted him to know that. Lowering his expectations helped me lower my own.\n- I set a limit on the amount of work I would do per day. I used to do way too much until being absolutely drained at the end of each day. I want to be as productive as I was but going from 0 to everything was not working. So I now do one or two experiments of my own per day and try to convince myself that that’s enough. \n- At the end of each day I say out loud the following: “I’m proud of myself because today I did _____”. I’m not actually proud, but I know that psychologically we are wired under the principle of commitment and consistency, so I’m hoping that saying this every day makes me do more things to be proud of. \n\nI hope you find yourself again. Depression is horrible and the structure of grad school makes it worse. Feel free to DM me if you would like a virtual buddy to make you accountable or something.", "author": "deathoflink", "created": 1600265758, "upvotes": 18}, "g5gsnev": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5gsnev/", "text": "I was reading about thought traps that people get into, and one of them is \"awfulizing\" or basically thinking that not being productive etc is the end of the world. It's not. Grad school is a marathon, not a sprint. Be kind to yourself, take real breaks without feeling guilty, in the long run it's not going to hurt your degree.\n\nI agree with the other commenters, it's time to take care of yourself, find another therapist and/or see a doctor for your depression. Because it sounds like you're depressed. I've been there, I didn't see anyone, I spent a whole semester holed up in my room doing the bare minimum in lab and classes. Let me tell you, it's not worth it. Not because of losing productivity, but because of not living your life and being able to enjoy the things you enjoy.", "author": "WickedSpite", "created": 1600260807, "upvotes": 7}, "g5gr6ga": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5gr6ga/", "text": "Listen to some Jordan Peterson and Jocko Willink. Own your issues & then go get after it.", "author": null, "created": 1600259814, "upvotes": -7}, "g5gpnb3": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5gpnb3/", "text": "I feel you, OP. I'm also a grad student struggling with depression, and been stuck at home because of a COVID-19 scare forcing all employees to work from home for the past week and a half. I've been struggling with staying focused on my work, despite having weekly online meetings with my supervisor. I don't think this global pandemic situation is helping us feel any better either. Just want to let you know that it's completely okay to feel the way you are feeling right now, and hope you give yourself some slack even if your productivity is in the lows. Also, like others have said, hope you keep talking to a therapist so that you can have someone to pour your heart out to when you need it. Also discuss the possibility of taking medication, I've been on medication for a year and a half and it's done wonders to my mental health. Cheering for you, OP!", "author": "amaricano", "created": 1600258706, "upvotes": 16}, "g5go9n0": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5go9n0/", "text": "Two weeks! That’s nothing! You’re in a totally fine spot, OP. But I would restart talking to your therapist.", "author": "MrLegilimens", "created": 1600257637, "upvotes": 5}, "g5gmj8f": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5gmj8f/", "text": "Honestly, sitting around watching Netflix from the same sad spot on the couch is what happens to me when my depression starts acting up. \n\nSo, a couple questions.\n\n1. If you had the flu, would you hate yourself for throwing up?\n\n2. If you had allergies, it would you hate yourself for sneezing?\n\n3. If you broke your leg, would you hate yourself for needing crutches?\n\nDepression is a medical condition. One of the most noticable (to me at least) symptoms is fatigue. \n\nAnother question, if you were vomiting from the flu for 3 weeks, would you see a doctor? \n\n Because it might be time. Research high functioning depression. That is the kind that I have. I get my work done, and everything I am required to do. Then nothing else. That isn't living; it is existing, and it is hella dangerous. \n\nThey put me on medication and my life changed dramatically for the better. I used to think that I was strong enough not to need it. That was a hella crazy thought. It isn't about strong, it is about enjoying the time I have on this planet as opposed to enduring. \n\nIf you don't like your current therapist pick another one. And when you are ready, have a conversation with your doctors about medication. See what they have to say about it. Life is short. You deserve to live the best life possible, whatever that means for you. \n\nSending you love and light. 💛💛💛", "author": "CeeCee123456789", "created": 1600256182, "upvotes": 166}, "g5gjzla": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5gjzla/", "text": "Consider going to the Disability Services office to ask about academic accommodation. Depression is a serious condition, and getting it treated should be your priority. There is no need to risk derailing your academic progress because of it. I hope you start feeling better; it sounds like it sucks.", "author": "inkylinguist", "created": 1600253757, "upvotes": 8}, "g5gjgdz": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5gjgdz/", "text": "My therapist tells me to acknowledge the feelings I have. Accept them, and thank them for coming. Then ask them to sit down or step to the side. Then I am supposed to remind myself why I am worth it or comfort my self with a self soothing tactic (I imagine my younger self and tell them words they need to hear). \nI am sorry about your depression. I hope you start talking to your therapist again, or if that therapist isn't working you find another one. Remember, there are people who care about you and if you open up you might find more people care about you than you ever realized.", "author": "fisherge", "created": 1600253199, "upvotes": 24}, "g5gaqtc": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5gaqtc/", "text": "I don’t hate you.", "author": "j89k", "created": 1600243280, "upvotes": 27}, "g5g9ri0": {"link": "/r/GradSchool/comments/itqs60/hate_myself_for_not_being_productive/g5g9ri0/", "text": "It’s ok, your human. Sometimes it’s important to take a breather. \n\nFeelings suck ass. Sometimes I feel anxious and depressed for no good reason, like just relaxing watching tv but for some reason my mind keeps telling me I’m worthless. I don’t have the cure but know you are not alone.\n\nDon’t feel bad about the past. Forgive yourself. What’s important is what you do in the present/future. \n\nTry writing a one maybe two sentence statement about why you are in grad school. Keep it somewhere you can see. Read it and remind yourself why it’s important to get back on that horse even when you don’t feel like it.\n\nAlso, I too struggle with nervous energy. That feeling that I need to be productive all the time even in my hobbies. But working more does not mean being more productive. I am still working on it myself but try making SMART goals https://www.mindtools.com/pages/article/smart-goals.htm", "author": "mad_neuroscientist", "created": 1600242204, "upvotes": 10}}}