{
  "sid": "pvf0xg",
  "link": "/r/GradSchool/comments/pvf0xg/applying_for_history_phd_how_many_potential/",
  "title:": "Applying for History PhD, How many potential advisors should I email at each university?",
  "text": "Apologies if this is asked a lot, I am currently beginning the application process for a PhD in history. I have already received my MA so I am comfortable with most of the application but I am wondering how many potential advisors I should be emailing at each university?  \n\n\nFor instance, at school X there is someone who researches the same time period and era as I do, focusing on similar themes etc., but there are also two people who do things tangentially related to my research/ the direction I want to go in the future. Should I be emailing all of them or just the person I think is most closely aligned with my current experience/research interests? \n\nAlso, do you think it's a good idea to attach your CV to the email, or is it enough to assume they're busy and just give them the basic details about you in the body of the email?  \n\n\nThank you!",
  "author": "fancypirouette",
  "created": 1632602166,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "heac862": {
      "link": "/r/GradSchool/comments/pvf0xg/applying_for_history_phd_how_many_potential/heac862/",
      "text": "I personally would email any and all that I think would be a good match because you won’t know until you speak with them if any of them have funding, are willing to take on a student, or feel that what you want to do is similar enough to what they do to feel comfortable taking you on. In my situation I ended up having coadvisors (one does immune-related genomics and the other does lipidomics)who were used to working together as one is on sabbatical for my first year (we have internet meetings and I have a post-doc from the genomics lab working as my local supervisor).",
      "author": "UleeBunny",
      "created": 1632616634,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634066996
}