{"sid": "px6szg", "link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/", "title:": "As a PhD student, can I address my soon-to-be advisor by first name in email?", "text": "I need to send a casual email to my two future advisors letting them know that I am not reachable on my cell phone for the time being. One of the future advisors is a postdoc who I always call by his first name. The other is a full professor who I don't know as well, but he has always signed his emails to me with a nickname version of his first name (it's not a preset signature).\n\nI feel like its weird to write an email  to both of them saying \"Hi Prof. (last name) and (postdoc's first name)\", but I am nervous about calling the professor by a shortened version of his first name (I have never seen him use his full first name so I don't want to do that either)  without being explicitly invited to do so. Opinions?\n\nETA: I am in Austria, where formal titles are a big deal, but my previous advisor seemed almost annoyed with me when he had to explicitly ask me to call him by his first name.\n\nETA2: Haha I went with the safe option and just sent him a separate email where I addressed him as Prof. X, and he signed his response with only the first two letters of his first name. What does it mean?? ", "author": "mrross00", "created": 1632836978, "retrieved": 1632843723, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"helmi3u": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/helmi3u/", "text": "I'd say just ask which they prefer. I've done it before and asked if they prefer Dr or first name(usually a majority were fine with first name). Even if they are your advisor, you're also their colleague because you're actively doing research too, so calling them their first name doesn't break any formality.", "author": "Astsai", "created": 1632840086, "upvotes": 1}, "helma89": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/helma89/", "text": "If you are really wanting to be informal but not ready to simply directly ask them the question, just skirt the issue. When I am trying to do the same, I will start the casual email off with a \"good morning/good afternoon\". It avoids official titles but keeps me from taking unnecessary risks with the contacts ego. \n\nIt is very hard to gauge by how the professor themselves sign because the power structure is so different.", "author": "TSSki", "created": 1632839992, "upvotes": 1}, "helk1oh": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/helk1oh/", "text": "Don't, as a general rule. Check what title they have and use that. If they want you to address them by their first name, they'd make that clear.", "author": "Normal_Kaleidoscope", "created": 1632839030, "upvotes": 1}, "heliq0f": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/heliq0f/", "text": "Crazy idea - instead of guessing you could actually ask them both how they would each prefer to be addressed.", "author": "CoomassieBlue", "created": 1632838453, "upvotes": 2}, "helhs8u": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/helhs8u/", "text": "Until you are certain of how your advisor prefers to be addressed you should err on the side of caution. You're right, it would look weird to call one by their first name and the other by their formal title. I would say, \"Hello Drs. X and Y\" when contacting them both via email.", "author": "dm172081", "created": 1632838030, "upvotes": 2}, "helh93v": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/helh93v/", "text": "If you have addressed him by formal title in the past, and he has responded with a nickname first name, he wants you to call him by his first name.-  I would use it.", "author": "LagrangianDynamics", "created": 1632837790, "upvotes": 8}, "helh8mc": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/helh8mc/", "text": "Unless you are directly told otherwise by that specific person always refer to professors as Dr. Lastname", "author": "kerrydashann", "created": 1632837783, "upvotes": 10}, "helh5pf": {"link": "/r/GradSchool/comments/px6szg/as_a_phd_student_can_i_address_my_soontobe/helh5pf/", "text": "I wouldn't until you get to know them but that's me. I'm Canadian and typically err on the side of professional title or last name until they give me the old \" you're making me feel old, call me _____\" if they never give me that line, professional title it is", "author": "Conhbd", "created": 1632837747, "upvotes": 3}}}