{"sid": "oodqe3", "link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/", "title:": "Use a reference manager, friends", "text": "Every now and then I see people here that are in dire need of reference managers without knowing they exist. It's been the same in my MA classes too, I'd been using them since undergrad days, but for some of my cohort, I introduced them. So I guess, at least in some disciplines, these software are a bit nice at least in grad school.\n\nA reference manager does a few things:\n\n- Organises your papers and books, and their relevant files (PDF, epub, .zip, code, etc.)\n- Organises relevant metadata\n- Helps you cite these in your papers and theses\n- Generates the bibliography automatically\n- Imports references from web, with associated PDF if possible\n- Allows you to edit, search (metadata & PDFs), sort, organise etc. these references\n- Import PDFs from your file system and for most of them, find their related metadata automatically\n- Work with Microsoft Ofice or LibreOffice to easily add citations (IDK if it works with Pages on Apple)\n- Can export to bibtex / biblatex (see [Better BibTeX](https://retorque.re/zotero-better-bibtex/) extension too) to use it with LaTeX\n- ...\n\nMy goto recommendation is https://www.zotero.org/ because Zotero is totally free and open source, and is not tied to any disgusting companies like Elsevier or some shady data analytics company. I also haven't tried others myself, so that's another reason not to recommend for me.\n\nGo to the website, download the app and download the extension for your browser and for your office suite of choice, Microsoft or LibreOffice. Or, if you want another one, go to https://en.wikipedia.org/wiki/Comparison_of_reference_management_software and find the best fit for you. You'll thank yourself later.\n\nAnother piece of software I wish to plug that is made by the same folk as Zotero AFAICT is Tropy, which is a manager for research photos: <https://tropy.org/>. I don't have much use for this myself, more useful to historians, archeologists, etc. probably. I wanted to mention it nevertheless tho as it's somewhat obscure.\n\nEdit: If you have any questions regarding Zotero, I have been using it for a few years, so feel free to ask, I might be helpful. I didn't text other stuff, so I wouldn't know, but chances are someone reading the thread would.", "author": "gkayaalp", "created": 1626823437, "retrieved": 1632845791, "over_18": false, "upvotes": 427, "upvote_ratio": 0.99, "comments": {"h6120x0": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h6120x0/", "text": "When you say it organises metadata I’m not really sure what you mean. I assume you mean you save a journal article or something. Can you give an example of the type of paper you’re talking about and how you would use that function?", "author": "ellodarknessoldfrend", "created": 1626889959, "upvotes": 2}, "h60w1o5": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h60w1o5/", "text": "Zotero is amazing. Especially with the addons it has.", "author": "Lord_Blackthorn", "created": 1626887496, "upvotes": 2}, "h60m4bm": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h60m4bm/", "text": "I use Zotero for everything I write and love it. One word of caution though, do not rely uncritically on the citation information it imports automatically. You will need to clean that info up as it goes in to make sure you get accurate references later.", "author": "Norin_was_taken", "created": 1626883373, "upvotes": 2}, "h60kj1x": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h60kj1x/", "text": "This. \nThe gold standard is zotero + zotfile plugin that allows you to drag a pdf into zotero, it will automatically create a record for you based on the data in the PDF. Works for almost all papers published after 1995 or so. \nIt also copies the PDF into your zotero data and renames it. \nYou can then open the PDF by double clicking on the record in zotero.", "author": "scanguy25", "created": 1626882701, "upvotes": 2}, "h606ruc": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h606ruc/", "text": "I utilize bibtex for writing papers, mainly on overleaf. Is there something I'm missing? Does endnote or mendeley improve the experience somehow?\n\nFor now, bibtex takes care of all referencing and format so I don't see why something else would make the whole process easier / more efficient.", "author": "Efficient_Ad_184", "created": 1626876759, "upvotes": 1}, "h602t6d": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h602t6d/", "text": "Awesome! Thank you! I will be preparing my research proposal next week and was thinking about how to organize the literature review!", "author": "WanderingNebulas", "created": 1626874900, "upvotes": 2}, "h5zd9cl": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5zd9cl/", "text": "I've been using them for a few years, but I never understood something : Do they make a copy of the pdf you import into it ? If so, can I safely delete the first pdf ? In short, do they also replace the need for organized windows folders ?", "author": "Jtktomb", "created": 1626856971, "upvotes": 2}, "h5ywvkg": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5ywvkg/", "text": "Just gonna shamelessly plug another reference manager here: [JabRef](https://www.jabref.org/)\n\nFor all ya Latex and Bibtex/Biblatex users out there, Bibtex is the native format for Jabref, so you can just open a bibtex file and manage it from Jabref. This is especially great for git and collaboration as you can add references as you go and even your coworkers can open and edit it as usual.  \n\nWhat I also think is cool is, that you can have a your tex files automatically scanned for citations of references. So you can just look up in your Jabref at what parts of your document exactly you cited a certain article and the like.  \nAlso, you can work with your whole database while writing and just export the ones you actually cited as a separate file at the end.  \n\nA feature I discovered recently is that it can read PDF annotations. I marked some text in a PDF I linked with an entry and the marked text showed up in Jabref! So you don't even have to open the PDF to reread the parts you thought are important. (Little caveat here, if the PDF text isn't properly set up, e.g. scanned documents with automatic text recognition or math formulas, it will not work. But that's a problem with the PDF, not Jabref).", "author": "LivelyLizzard", "created": 1626845939, "upvotes": 3}, "h5ywsuv": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5ywsuv/", "text": "You da real mvp OP", "author": "7empest-tost", "created": 1626845888, "upvotes": 2}, "h5ys1l8": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5ys1l8/", "text": "Seriously not a single mention for [Papers](https://www.papersapp.com/)? Made my PhD and published works much more manageable.", "author": "Dathadorne", "created": 1626842734, "upvotes": 1}, "h5yg234": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5yg234/", "text": "I'm one year into my masters and just started using Zotero, it has made my life SO much easier. I wish someone had told me about it earlier so I didn't have to suffer for that one year without it... I found I had multiple PDFs of the same article with different highlights on them that I had read for lit reviews and zotero just makes my laptop so much more organized. Not to mention, it makes creating my reference sheet 1000x easier instead of easybib-ing for HOURS like I had been doing before.", "author": "m-r-s-e", "created": 1626836356, "upvotes": 2}, "h5yfljt": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5yfljt/", "text": "Scite is also a cool extension you can add to zotero. It allows you to easily browse other papers citing the paper in your library, and can even tell you if those references are positive, negative, or neutral. I haven't had much use with it yet, but it's it seems like it has applications I may not have fully utilized yet.", "author": "Bugsnatch", "created": 1626836126, "upvotes": 2}, "h5yf0up": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5yf0up/", "text": "Zotero is THE best. Some more things it's good for:\n\n1) Has good plugins for reference styles. I'm in New Zealand and they even have the New Zealand Law Style Guide, which other reference managers didn't have when I needed it.\n\n2) So easy for collaborating, you just create groups for each project and share them using Zotero online. Endnote is a nightmare for that!!!!! Can not stress that enough. \n\n3) All your references are always synced if you set up the free online account, so nothing gets lost if something happens to your device, nothing gets corrupted etc. You can download zotero, log in and and open up your database on any computer in the space of like 2 mins.\n\nI don't use it for pdfs, but after years of using it for my own research and paid work as a research assistant I do now pay $20 per annum for extra storage for all those references.\n\nThanks for the tip on Trophy, never heard of it but will come in useful, starting an arts-informed project at the moment.", "author": "Eventu568", "created": 1626835829, "upvotes": 5}, "h5y9ynu": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5y9ynu/", "text": "Yay!!! Another zotero user!!! Absolutely love it and have used it since undergrad. My PI tried to convert me to a citavi dude but I just don’t like that format for organizing projects. \n\nFantastic post, OP.", "author": "chemeazy97", "created": 1626833333, "upvotes": 5}, "h5y7se3": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5y7se3/", "text": "I chose to use Mendeley for a couple reasons…I think Zotero had space limitations and no ability to annotate or even highlight PDFs in the past. Can anyone offer insights regarding memory space and/or annotations in Zotero? I’ve seen conflicting outdated information.\n\nSince Elsevier bought Mendeley, I have been really interested in changing. Anyone know if I could import my library and notes from Mendeley to Zotero or would I have to start over from scratch?", "author": "laughing-medusa", "created": 1626832303, "upvotes": 8}, "h5y7ndp": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5y7ndp/", "text": "Seriously. I take part in a fair few writing workshops and groups at my uni and the two things I always recommend:\n\n1: a good citation manager - and take the time to organize it\n\nEdit: I use endnote because I get it free thru my university but for a free one, zotero is great\n\n2: use scrivener. It’s not cheap but it’s a 1-off payment, and keeps everything in one app but backed up in two places. But, like with the cm, it takes time. \n\nI had scriv for years and felt like I was driving a Ferrari in a 5mph zone so I took a week or two to look at blog posts by other academics who’d used it for dissertations, and videos on how best to set it up for a humanities diss. \n\nSince talking that time, I use it far more to its full potential and it’s GREAT. I can log in and know my work is saved, backed up, and in the proper order. Plus it works with citation managers and exports to word.", "author": "coyotesandcrickets", "created": 1626832237, "upvotes": 11}, "h5y5pse": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5y5pse/", "text": "I forget why exactly I switched from Zotero, but I've been totally happy with Mendeley for quite a while. The importer extension for Chrome is super easy to use.", "author": "kyew", "created": 1626831334, "upvotes": 6}, "h5y4ssk": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5y4ssk/", "text": "I tried EndNote X9 and didn't like it. Would rather use firefox extensions that give me the APA citation quickly... like Google Scholar or EndNote Click.", "author": "Ejszaka", "created": 1626830904, "upvotes": 1}, "h5y4myr": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5y4myr/", "text": "Extra life pro tip: back up your reference manager files (and all files really) frequently!\n\nApparently Endnote, Mendeley, and possibly other softwares do not play nicely with cloud storage and auto backups. I had a scare recently where my entire library got corrupted, as did some of my backups. Nearly lost eight years of archived knowledge. Now I manually create backups and email myself the zip file every so often.", "author": "heythereanydaythere", "created": 1626830827, "upvotes": 45}, "h5y2pz2": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5y2pz2/", "text": "I have a question about Zotero that makes using it very confusing for me. It seems like it duplicates all of my PDFs in its own directory. I'd rather have all my PDFs in one place rather than different versions floating around, and I want to be able to annotate my PDFs on my computer and on a tablet. However Zotero seems to save all of the PDF files in a coded way that makes them impossible to find unless I open them with Zotero, which doesn't work on my tablet. What can I do about this? I really don't want to have separate PDFs, one that's annotated and one that's in Zotero, since it uses twice the storage space and is harder to manage. But I really want to be able to highlight and take notes directly on documents and have these notes be accessible through Zotero as well. Am I missing something? Any workarounds?", "author": "biwei", "created": 1626829902, "upvotes": 11}, "h5xz4c5": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5xz4c5/", "text": "Zotero literally saved my mental health last semester lol", "author": "palebarista666", "created": 1626828120, "upvotes": 19}, "h5xyyrl": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5xyyrl/", "text": "I can't believe I didn't know this was a thing! Thanks!!", "author": "Famousinmyshower", "created": 1626828042, "upvotes": 3}, "h5xxita": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5xxita/", "text": "Yep I was a doofus and did my Masters thesis without one despite our university providing endnote for free.  I had a masters student in my lab that I mentored later in my grad school experience who wouldn't update and I was like for the love of god please use it or you'll hate yourself like I did and she wouldn't do it.  I even offer a brief walkthrough for our incoming grad students on how to use and and some just won't adapt.", "author": "Captainbackbeard", "created": 1626827328, "upvotes": 24}, "h5xxgy8": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5xxgy8/", "text": "Where has this been all my (academic) life? \nThank you!!!", "author": "g-wenn", "created": 1626827303, "upvotes": 14}, "h5xu2xi": {"link": "/r/GradSchool/comments/oodqe3/use_a_reference_manager_friends/h5xu2xi/", "text": "I also recommend Zotero!! And everyone should use the note feature too so you don't have to revisit the paper multiple times every x months to know what's important about it (some papers won't scan and you won't have the abstract automatically uploaded in Zotero, so the note feature is useful for that!)", "author": "methomz", "created": 1626825642, "upvotes": 102}}}