{"sid": "pjafof", "link": "/r/GradSchool/comments/pjafof/does_a_masters_in_public_policy_pave_the_way_for/", "title:": "Does a master's in public policy pave the way for a PhD if I decide I want to do the latter during the masters?", "text": "Hey all, thanks ahead of time for any information here. I'm considering a career in public policy and wanted to know if, should I choose to pursue an MPP to start, I'd be able to position myself as a potential doctoral candidate down the road by taking the appropriate courses my first year. I'm considering the doctoral route but would prefer to start with the Master's in case I find a career path in that first year that appeals to me and that is attainable without a doctorate. At the same time, I would love to be in a position where, should I want to pursue the PhD, I can do so while having my first-year Master's coursework count toward the requirements. Has anyone had any experience with this? Perhaps it varies by school as well - if so, that's also helpful information.\n\nThank you!", "author": "TheDrunkenWhatever", "created": 1630968494, "retrieved": 1632844760, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hbvgd9u": {"link": "/r/GradSchool/comments/pjafof/does_a_masters_in_public_policy_pave_the_way_for/hbvgd9u/", "text": "This is going to be very subjective because it’s largely going to depend on what the PhD program is specifically.\n\nPublic policy programs and political science programs are sometimes very meh.\n\nYou can find the huge divide between people who say a MPA is better than a MPP… management versus analysis.\n\nIt will also depend if the program is 1 vs. 2 years. And if there was any thesis or capstone type project.\n\nIt even gets more convoluted when you start factoring in the political science MA and MS programs that also filter into almost every PHD programs\n\n…and even more when you factor in JDs and attorneys who also apply to the same type of PhD programs.\n\nMoral of the story… yes it would make you a better candidate than not having it if you do good in the program… taking a 2.4 gpa in a masters probably would do you more harm then good though. \n\nHowever, you need to make sure the masters in public policy is the closest type of degree you want because it is not very broad and real world applicability is likely less than a MPA for obtaining an actual job.", "author": "I_am_ChristianDick", "created": 1630974774, "upvotes": 2}}}