{
  "sid": "q638h9",
  "link": "/r/GradSchool/comments/q638h9/dissertation_acknowledgements/",
  "title:": "Dissertation acknowledgements?",
  "text": "I'm currently quite some time away from my defense date (not going to be for another 7 months or so) but I was just looking at some other dissertations from my school and it got me thinking about the acknowledgements section. I get the idea that professional acknowledgements like advisor, committee members, lab mates, etc. come first, and then personal acknowledgements like friends and family after that. \n\nBut back at the end of my first year I had a bad accident that left me in the ICU for about a month. I was considering putting my gratitude for the doctors and nurses that saved my life at the very start of the acknowledgements section, since without them the dissertation would quite literally not exist. I know the acknowledgements section is kind of a \"your mileage mat vary\" type thing and there's no set rules so objectively it doesn't matter, but would it be seen as a snub or faux pas of any kind to put what is objectively a personal acknowledgement before anything else?",
  "author": "elfentruthed",
  "created": 1633979421,
  "updated": 1634099724,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hg9nw6r": {
      "link": "/r/GradSchool/comments/q638h9/dissertation_acknowledgements/hg9nw6r/",
      "text": "I don't think it's a faux pas!  I think that it's okay to put your doctors/nurses first and then transition into the more professional ones. One of my best friends was defending at the same time as me. He lost his father during our time in graduate school and he put his father first before anyone else in his acknowledgements.",
      "author": "ItsJOVANI",
      "created": 1633982325,
      "upvotes": 6,
      "replies": {}
    },
    "hg9jv0h": {
      "link": "/r/GradSchool/comments/q638h9/dissertation_acknowledgements/hg9jv0h/",
      "text": "Been working on mine lately too. In some ways the last spot is the most powerful, even though it comes after colleagues etc. Also the order is really not that important, since you could argue that without the people you are acknowledging you don't think there would be a finished product...",
      "author": "mmvsusaf",
      "created": 1633980564,
      "upvotes": 3,
      "replies": {}
    },
    "hgbbm3h": {
      "link": "/r/GradSchool/comments/q638h9/dissertation_acknowledgements/hgbbm3h/",
      "text": "It's your dissertation. Do what you see fit",
      "author": "Ru-tris-bpy",
      "created": 1634010250,
      "upvotes": 2,
      "replies": {}
    },
    "hg9p3lm": {
      "link": "/r/GradSchool/comments/q638h9/dissertation_acknowledgements/hg9p3lm/",
      "text": "i had my committee first and my family last, but part of what i did was figure out who i wanted to thank, what i wanted to say, then swapped things around so that they would have the most impact as someone read through the whole thing.  also, don't forget that when you write what you want to say to everyone you can add extra there.  so while they were mixed into the middle of my acknowledgements two professors and one of the people at my funding agency got additional comments specifying why i was acknowledging them",
      "author": "EP_EvilPenguin",
      "created": 1633982848,
      "upvotes": 1,
      "replies": {}
    }
  }
}