{
  "sid": "qu1h3x",
  "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/",
  "title:": "Should I tell my PhD advisor I want to MS out now, or wait until I get my degree?",
  "text": "To put it briefly, my mental health is in disarray, I'm extremely unhappy in grad school, and I think it'd be best for my health and safety to leave with just a MS this spring. I'm funded independently from my advisor, but through my school, so I'm unsure if I could continue to receive funding (stipend and waiving of tuition) if I communicate my intentions.\n\nI'd like to tell my advisor now and leave the lab to take some pressure off of me while I focus on classes. Additionally, I don't want to pretend that I intend to take my quals, wasting my advisor's time in them helping me prep. But I fear being truthful could bite me in the ass financially (loss of stipend/tuition waving).\n\n...to those wondering, I didn't enter my PhD program with the intention to MS out. Some unforeseen circumstances have taken their toll on me, and I'm confident this isn't the path for me anymore.",
  "author": "Ooof97",
  "created": 1636929636,
  "updated": 1637182713,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hkniu3a": {
      "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hkniu3a/",
      "text": "In the PhD program I'm in, you cannot get a masters when you leave unless you've passed your qualifying exam, so I'd definitely check the student handbook carefully to find out the guidelines. You also cannot get a terminal master's degree from a PhD program until your advisor and thesis committee sign off on it.\n\nAre you funded by the school? For how long? There is usually a set time frame that you're paid by the university before your tuitions and fees are transferred onto your advisor. Your compensation is safe within that time period. In my program, the advisor has to back pay the school for your first two years so I would tell your advisor about your intention as soon as possible and ask about the best way to ensure that you leave with a master.",
      "author": "PumpkinCrumpet",
      "created": 1636932845,
      "upvotes": 6,
      "replies": {
        "hknjc54": {
          "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hknjc54/",
          "text": "In my program we get a MS along the way to the PhD and it's unrelated to qual exams. Theoretically I could've dropped the program after receiving it, they can't exactly un-issue an earned degree/mailed diploma afaik",
          "author": "Jwalla83",
          "created": 1636933057,
          "upvotes": 2,
          "replies": {
            "hknkpft": {
              "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hknkpft/",
              "text": "OP needs to check the guidelines/handbook from their program and find out how the process works for their situation. If there is an ombudsman person at the university, that could be a good person to reach out to as well. \n\nSince they've never been funded by their advisor, it is of no loss to the person if they leave. If anything, their advisor (assuming a reasonable person) might be able to help them navigate the process, negotiate reduced responsibilities, and connect them with mental health resources.",
              "author": "PumpkinCrumpet",
              "created": 1636933653,
              "upvotes": 4,
              "replies": {
                "hknm6yc": {
                  "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hknm6yc/",
                  "text": "Thanks for the response. The handbook seems to be intentionally vague about how mastering out works (understandably, to discourage students from doing so). I'll try to bring it up with my advisor when I've found the right words.",
                  "author": "Ooof97",
                  "created": 1636934305,
                  "upvotes": 2,
                  "replies": {
                    "hknohwh": {
                      "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hknohwh/",
                      "text": "Good luck!! Someone should be helping you with this, but you're smart to be cautious and look out for yourself.",
                      "author": "PumpkinCrumpet",
                      "created": 1636935334,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hknlvab": {
          "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hknlvab/",
          "text": "Thanks for the response. I don't need to pass quals to receive my MS. It only serves to progress us toward candidacy. \n\nI'm funded for three years, and I'm approaching the end of my second year in the spring, when I should be eligible for my MS. My advisor has no financial responsibility for me until my funding period has ended in 2023.",
          "author": "Ooof97",
          "created": 1636934161,
          "upvotes": 2,
          "replies": {
            "hknndfm": {
              "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hknndfm/",
              "text": "Gotcha! I'm normally a very cautious and skeptical person but I don't think you leaving hurt your advisor's interests (they just have to go find another student) so you should be safe telling the person. Leaving for mental health reasons is completely legitimate, a reasonable advisor should help you reduce your responsibilities and navigate the process.",
              "author": "PumpkinCrumpet",
              "created": 1636934826,
              "upvotes": 1,
              "replies": {}
            },
            "hkppq32": {
              "link": "/r/GradSchool/comments/qu1h3x/should_i_tell_my_phd_advisor_i_want_to_ms_out_now/hkppq32/",
              "text": "If you really like this advisor, it could be a good idea to inform them before PhD applications are due for your program for this cycle. It's possible that they could decide to not pursue taking any students because they already have you and x, y, z people to advise. That being said, you're in no way obligated to do this. Share when you're ready and/or when you have to start getting the ball rolling on mastering out of your department.",
              "author": "greensleeves97",
              "created": 1636980624,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}