{
  "sid": "guox53",
  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/",
  "title:": "To my fellow graduate students in the U.S, a bill has been proposed to restrict Chinese graduate students in STEM fields.",
  "text": "A bill was proposed this morning by a few senators to restrict graduate student visas from China who are doing research in STEM fields at all institutions in the United States: https://www.cotton.senate.gov/?p=press_release&id=1371  \n\n\nNo matter what your stance is on this issue, one thing is clear: Some of the most influential and talented researchers at our institutions are from China. Barring them is simply xenophobic.  \n\n\nThere is a petition going around right now to go against this bill -- if you are willing to sign it, please do. It takes 30 seconds.  \n\nhttps://docs.google.com/forms/d/e/1FAIpQLScIu1jbAfB5qFGkV3I7rpEAo0kwsUb8CpzZ_6Nu-CoKeul4PQ/viewform",
  "author": "masjoven",
  "created": 1591032801,
  "over_18": false,
  "upvotes": 575,
  "upvote_ratio": 0.89,
  "comments": {
    "fsptgsg": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsptgsg/",
      "text": "I'm not even American, and yet I think this may be a great development for STEM PhD students of the future. This should just be a first step.\n\nTO BE CLEAR: Yes, these students are every bit as talented as American students. Yes, they contribute a shit ton of research work. And to the economy overall.\n\nBut universities and supervisors don't take on [more and more](http://nfap.com/wp-content/uploads/2017/10/The-Importance-of-International-Students.NFAP-Policy-Brief.October-20171.pdf) students from non-Western countries out of the goodness of their hearts. They love doing so, because many can be 'nudged' to work very long hours for very little money. Not only during their PhD, but also as post-docs afterwards - yay! Additionally, quitting is not an economically viable option for most, and supervisors know this.\n\nWhere companies outsource to low wage countries, universities just bring in the more cost-effective labour they need. After all, a PhD in STEM is at max 30% educational and 70% work like any other. Working conditions for PhDs have always been subpar, but that's exactly why we shouldn't allow universities to continuously put downward pressure on them. A steady inflow of cheap(-ish) labour makes it far too easy for them. When corporations do this, they get exposed and everyone talks about (just think of Amazon and their warehouses). Why should universities get away with it?",
      "author": "wave-o",
      "created": 1591161445,
      "upvotes": 3,
      "replies": {}
    },
    "fsmuts7": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsmuts7/",
      "text": "We have very talented black and brown students as well. But we refuse to educate them. I'm not worried about not having access to chinese talent. Maybe now we'll actually focus on training our own children.",
      "author": "Harewol",
      "created": 1591105584,
      "upvotes": -8,
      "replies": {
        "fsmxcrg": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsmxcrg/",
          "text": "That’s a weird conclusion to come to, do u think eliminating one group of students based on xenophobic views will force Americans to act with less discrimination ?? Ur suggesting that “black and brown students” are not currently educated is bc we have too many Chinese students??",
          "author": "cranberryflavor",
          "created": 1591107003,
          "upvotes": 7,
          "replies": {
            "fsokhj2": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsokhj2/",
              "text": "It would be a weird conclusion to you. You've already eliminated one group of students. They're just all compatriots with black, brown and native skin. White supremacy has many forms and thinking that only the Chinese are talented is one of them. Without question STEM academia is complicit in the subjugation of our fellow Americans through the overwhelming flood of Chinese in tech here. Yall would rather foreigners come here and teach them than to teach our own black and brown children. \n\nI also find it DISGUSTING that there are no posts on this thread about functionally very similar discrimination against black and brown people in education or any discussion at all of systemic racism in education in this country. Not a SINGLE FUCKING POST. Especially given that we're in the middle of a civil rights era ... not one post. Y'all are trash ass white supremacists using Chinese to cover that fact.",
              "author": "Harewol",
              "created": 1591135374,
              "upvotes": -3,
              "replies": {
                "fsovjk2": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsovjk2/",
                  "text": "I'm not familiar with other countries but systemic racism against all minorities is a huge problem in the US. With that said, the problem starts much earlier than grad school. The inequality begins before a brown/black child is even born. The number of brown/black students that ultimately apply to graduate program is very low. \n\nAdditionally, in my STEM field, grad students and postdocs are cheap labor who work ridiculous numbers of hours a week with extremely poor pay. The job prospects are very poor as well. There's very little protection against abusive PIs. There are very few domestic American students that stay in the system; most leave as soon as they can, white or black or Hispanic or Asian. The research infrastructure is then propped up by international students who are willing to endure the system in exchange for visa and possible legal immigration to a better life than what their home country can provide. Academia can be a rather exploitative system. I would not recommend this for talented minority students who want \"an education\" unless they specifically need the PhD for their careers.",
                  "author": "PumpkinCrumpet",
                  "created": 1591141201,
                  "upvotes": 1,
                  "replies": {
                    "fspxrlc": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fspxrlc/",
                      "text": "\n\nYou have NO idea what you are talking about\n\n>With that said, the problem starts much earlier than grad school. The inequality begins before a brown/black child is even born. The number of brown/black students that ultimately apply to graduate program is very low. \n\nYou have no idea what the hell you're talking about. Were you a scientist at 12? Or are you saying black and brown kids don't like science? Who the hell do you think you are?\n\n>The research infrastructure is then propped up by international students who are willing to endure the system in exchange for visa and possible legal immigration to a better life than what their home country can provide. Academia can be a rather exploitative system.\n\nAnother completely ignorant statement. Most minority students are making more money in grad school than their parents. The ignorance is astounding. Try again. \n\n>Academia can be a rather exploitative system. I would not recommend this for talented minority students who want \"an education\" unless they specifically need the PhD for their careers.\n\nYou're gatekeeping. Like a true white supremacist . Fuck you.",
                      "author": "Harewol",
                      "created": 1591164734,
                      "upvotes": -2,
                      "replies": {
                        "fsqlord": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsqlord/",
                          "text": "Hmm you make many assumptions there. I don't make statements on things I don't know about, including firsthand. Best of luck to you. Take care.",
                          "author": "PumpkinCrumpet",
                          "created": 1591185769,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "fst5ow5": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fst5ow5/",
                          "text": ">You have no idea what the hell you're talking about. Were you a scientist at 12? Or are you saying black and brown kids don't like science? Who the hell do you think you are?\n\nThis is most certainly not what they're trying to say. The education system (K-12) fails black and brown students in many ways, including cultivating an interest in science. Children aren't scientists at 12, but cultivating their intellectual curiosity and interest in science around this age can be incredibly important for their futures. As a daughter of non-scientist parents without college degrees, the science education I received in K-12 was critical in developing my interest in science. \n\nThe school I attend for my PhD program actively recruits black and brown students, and makes use of certain programs to do so as early as their junior year in high school. We bring students in from city public schools for a summer and get them exposed to working in actual biomedical labs. We also have summer REU programs from which our grad program actively recruits black and brown students. Once they enroll in our PhD program, there is a specific program built to help ensure success of underrepresented minority students. We are by no means perfect, but we are trying at our institution. My only point is that it takes a lot of work early on in a student's life to cultivate an interest in pursuing a STEM PhD. And I haven't even outlined our outreach efforts to local city public elementary schools and junior high. \n\n>Another completely ignorant statement. Most minority students are making more money in grad school than their parents. The ignorance is astounding. Try again. \n\nAgain, I think you're misunderstanding what the commenter was trying to say. It is well-known that international students, regardless of race, are more vulnerable than their US citizen peers in STEM graduate school. Yes, they may make more money than their parents. This doesn't excuse the fact that professors (whether consciously or unconsciously) often push them to work insane hours. International students have no recourse when this happens. If they complain, the professor can simply kick them out of the lab, risking deportation. If a domestic student complains and is kicked out of lab, they still have the privilege of maintaining the life they've built in the US.\n\nDialogue is important. Often times there can be miscommunications. If we jump to conclusions and call someone a white supremacist, I'm pretty sure that usually shuts down the dialogue, and nothing is accomplished. \n\nI have done my best in what little spare time graduate school has afforded me to do my part in science outreach for minority students in the city of St. Louis. I felt a personal responsibility as someone being funded by the federal government to do so. This is why I felt compelled to respond here.",
                          "author": "PupperMerlin",
                          "created": 1591231825,
                          "upvotes": 1,
                          "replies": {
                            "fsto2ug": {
                              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsto2ug/",
                              "text": "Wow all of that and you made no salient points.  \n1. Minority students are ROUTINELY thrown out of PhD programs because they're used as a DE&I props in the same way you describe. The institutions that do care are so few and far between and this week made that abundantly clear.\n2. Again your very silly assumption that these CHILDREN do not have an interest in science is RACIST. They are being PUSHED out of STEM at the UNDERGRADUATE  level. Read that again. The UNDERGRADUATE level. Most students know in high school that they want to take a science and math classes. In undergraduate courses they're faced down by your racist and sexist kin and peers.\n\nPeople like you are the problem because you spout platitudes about \"where\"  the focus should be but you don't know anything about the problem. These kids don't need EXTRA help they need the SAME education others get. Also I don't care what you have to say about your department because I know that if I talk to those students and hires they'll have very interesting things to say. \n\nAnd you know damn well the person above nor yourself don't give a fuck about those little black latinx and native kids not studying science. If you did you wouldn't DARE fix your nasty fingers to defend the indefensible. Fuck you too.",
                              "author": "Harewol",
                              "created": 1591242439,
                              "upvotes": 0,
                              "replies": {
                                "fstv64y": {
                                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fstv64y/",
                                  "text": "Welp, I can't change the city's public school system to make education the same for everyone, nor can I fix an inherently segregated school system here, so all I can do is try to supplement things the best I can. \n\nAnd I didn't say the kids didn't have an interest because of something inherent about them. I said that simply because the city public school system is FAILING THEM in not providing adequate science education. I was fortunate in that I had a great science education in high school, which did influence my choices in undergrad and beyond.\n\nI did my best to try to clarify where this person is coming from, particularly regarding international students. I also don't need your approval or not to know if I care about these students. I can't fix everything. I also cannot control what my peers do every second of everyday. Doesn't mean I don't care. If I didn't care, I would have kept to myself and not volunteered at all. Could have finished up much sooner. \n\nRather than going on the offensive, feel free to share what graduate students can do to help. This sub-reddit is about graduate school. But if you want to keep accusing me of saying racist things because you lack reading comprehension, go right ahead. Not sure how that solves the issue you originally brought up, but okay.",
                                  "author": "PupperMerlin",
                                  "created": 1591247172,
                                  "upvotes": 1,
                                  "replies": {
                                    "fsy6m50": {
                                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsy6m50/",
                                      "text": "I clearly don't have reading comprehension problems because I'm READING  your insincere ass just fine.",
                                      "author": "Harewol",
                                      "created": 1591340730,
                                      "upvotes": 1,
                                      "replies": {
                                        "fszxe9m": {
                                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fszxe9m/",
                                          "text": "Welp, I hope you got what you wanted from your original comment and subsequent discussion even though I genuinely don't understand it. Good luck to you in graduate school.",
                                          "author": "PupperMerlin",
                                          "created": 1591381145,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fsmqmzb": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsmqmzb/",
      "text": "[deleted]",
      "author": null,
      "created": 1591103048,
      "upvotes": -5,
      "replies": {
        "fsnkuq5": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsnkuq5/",
          "text": "Chinese grad students pay a lot of money to study here. Without them, many programs would be cut at smaller universities.",
          "author": "nwatn",
          "created": 1591118566,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fsm00dj": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsm00dj/",
      "text": "You know this has Stephen Miller written all over it, right?",
      "author": null,
      "created": 1591079790,
      "upvotes": 4,
      "replies": {}
    },
    "fslqx8v": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslqx8v/",
      "text": "Imagine pulling this shit in a time of unprecedented global academic and research collaboration due to coronavirus.",
      "author": "nuanced_memer",
      "created": 1591073032,
      "upvotes": 22,
      "replies": {}
    },
    "fslpz88": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslpz88/",
      "text": "Thank you for sharing this. Signed.",
      "author": "chobani-",
      "created": 1591072391,
      "upvotes": 1,
      "replies": {}
    },
    "fslnih6": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslnih6/",
      "text": "Isn’t this Cotton guy the same who is urging Trump to order air strikes on the protests? It scares me that someone this openly racist is an elected senator. Vote in November ppl!",
      "author": "chuuluu",
      "created": 1591070764,
      "upvotes": 13,
      "replies": {
        "fsn09u5": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsn09u5/",
          "text": "He’s a Republican senator from Arkansas. Very, very right wing. Will probably run for President in 2024.",
          "author": "berraberragood",
          "created": 1591108545,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fslia29": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslia29/",
      "text": "Our state school in butt fuck Oregon only stays afloat because of the Chinese students that come here and pay full tuition.",
      "author": "quarkthestrange",
      "created": 1591067549,
      "upvotes": 9,
      "replies": {}
    },
    "fslaitq": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslaitq/",
      "text": "What does \"research in STEM fileds\" mean in this context?",
      "author": "pappypapaya",
      "created": 1591063009,
      "upvotes": 4,
      "replies": {
        "fslloph": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslloph/",
          "text": "Definitely traditional STEM, I’m not sure where the line is drawn on social sciences and I don’t think anyone does.",
          "author": "happytransformer",
          "created": 1591069614,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fsl0ee6": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl0ee6/",
      "text": "The US is going down the toilet and this is what our legislators are spending their time on?????",
      "author": "AFKpink",
      "created": 1591057360,
      "upvotes": 50,
      "replies": {
        "fsmdkfz": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsmdkfz/",
          "text": "Regardless of whether or not one agrees with the bill, one can do multiple things simultaneously.",
          "author": "Sovietsix",
          "created": 1591092292,
          "upvotes": -5,
          "replies": {}
        }
      }
    },
    "fskz0oj": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskz0oj/",
      "text": "I'm in social science and so am not directly affected but the Chinese students in my program are brilliant and it would be so unfair if they were kicked out. Just imagine you are working hard doing research and teaching for a university in return for low pay, and you may be in the middle of your research, or you've just finished your research, and all of a sudden you are kicked out. There are finer grain ways to weed out stealing of information than a blanket ban.",
      "author": "garulous",
      "created": 1591056594,
      "upvotes": 19,
      "replies": {}
    },
    "fskxze6": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskxze6/",
      "text": "I’m willing to bet the economic and academic benefit produced by legitimate visa holders outweighs the losses sustained through academic espionage",
      "author": null,
      "created": 1591056024,
      "upvotes": 9,
      "replies": {}
    },
    "fskr808": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskr808/",
      "text": "So how would this affect existing Chinese grad students? Would those nearing the end of their degrees still be allowed to finish remotely after their visas expire, esp. if they've long finished with coursework and are wrapping up a few research projects?",
      "author": "--MCMC--",
      "created": 1591052372,
      "upvotes": 5,
      "replies": {}
    },
    "fskp94x": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskp94x/",
      "text": "my god this is fucked up. much love in this time of hardship. be safe.",
      "author": "wackrapconcarne",
      "created": 1591051332,
      "upvotes": 7,
      "replies": {}
    },
    "fsknk70": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsknk70/",
      "text": "[deleted]",
      "author": null,
      "created": 1591050440,
      "upvotes": -6,
      "replies": {}
    },
    "fskmjz0": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskmjz0/",
      "text": "Not sure if I count as am not american, but signed it just in case. These kind of things mustn't be allowed anywhere.",
      "author": "Fran_97",
      "created": 1591049921,
      "upvotes": 10,
      "replies": {}
    },
    "fskgr4c": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskgr4c/",
      "text": "Let's be clear; this specific bill is a blanket ban on Chinese citizens (PRC citizens outside of Hong Kong & Taiwan) obtaining visas to pursue graduate degrees in STEM in the US. Denial of visas would be the new norm, with very minimal exceptions as outlined in the link from the main post. It is not 'feel-good' legislation and it is not a precursor to anything; there is nothing beyond this. \n\nThis cannot be allowed to happen. I'm dismayed at what I've seen in the most recent reddit threads about this. Do you ever talk to your Chinese colleagues? You know that China does not allow dual citizenship, right? I know many people who plan to give up their Chinese citizenship as soon as they have the option to. Poorer people don't have the option of coming to the US for undergrad, but see grad school as a path to US citizenship and \"the American dream\". \n\nI am an American PhD student in Canada. Canada already has all of the strong Iranian students. Don't make US schools weaker by giving up most of the Chinese students too. Already visas can be denied for almost no reason - we don't need more restrictions, even in the form of Trump's more reasonable order.",
      "author": "plasticpots",
      "created": 1591046975,
      "upvotes": 225,
      "replies": {
        "fskrzz3": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskrzz3/",
          "text": "Most of the Chinese people that I have talked to that don't like the CCP have said they support the original trump bill because it is a real problem.  I have chinese friends who they have said they have been asked by the CCP if they can gather any information while in the US.  Many patriotic Chinese feel obligated to comply.  It is a sad phenomenon where a government is forcing potential students to espionage.\n\n\nAmerica has the most foreign students in the world.  This is only affecting 1% of all chinese grad students in the US. Most of the time its because the students dad or something is a ccp general.  Its not the end of the world.\n\n\nThis bill however, is complete horseshit and is playing right into their hands.",
          "author": "Midnight2012",
          "created": 1591052787,
          "upvotes": 87,
          "replies": {
            "fsl30wm": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl30wm/",
              "text": "[deleted]",
              "author": null,
              "created": 1591058810,
              "upvotes": 56,
              "replies": {
                "fsl3b5f": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl3b5f/",
                  "text": "It's old news in the US too, which is a major reason why I don't trust Trump's order on it's face. (and the other bill is hands-down xenophobic).",
                  "author": "plasticpots",
                  "created": 1591058967,
                  "upvotes": 20,
                  "replies": {
                    "fsmq253": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsmq253/",
                      "text": "The fact that it's old news means it can't be a motivating reason now? To me, it looks like COVID and the initial and ongoing efforts to deny/obfuscate the origin and nature of this virus (which led to lax responses in the West early in Nov/Dec when more could have been done) – coupled with the rampant Chinese corporate fraud as exemplified a few weeks ago by Luckin Coffee – has finally broken the camel's back. Everyone agrees, it's time to do something about this shitshow. Move supplylines out of China, prioritize minimization theft of valuable IP, and stop allocating our hardearned capital in Chinese companies (which *all* commit fraud to varying extents, according to analytic firms like Muddy Waters). Also, this will hopefully tighten the supply of grad students available to US universities somewhat and put everyone *already* in the US in better bargaining positions. There's talent here. University departments are just going to have to pay more for it",
                      "author": "rechttrekker",
                      "created": 1591102669,
                      "upvotes": 3,
                      "replies": {
                        "fsn6342": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsn6342/",
                          "text": "These are good points and get to the heart of the issue. Is it ever acceptable to uniformly restrict student visas as a response to the actions of their government or to some proportion of bad actors? \n\nAt some point of course the answer is yes, but I think that 1) things should be determined at the individual level as much as possible, 2) class and research material (the latter of which is published anyways - there are already different restrictions for working on classified projects) do not pose much of a threat, and 3) it is inappropriate to punish students strictly for the behavior of their government (i.e. in response to COVID or the [new laws in Hong Kong](https://www.theguardian.pe.ca/news/world/uk-warns-china-do-not-destroy-the-jewel-of-hong-kong-456662/)).\n\nEdit: So I do think there is a way in which Trump's order could be implemented that I would agree with, but I think it's more likely a political move being done in bad faith.",
                          "author": "plasticpots",
                          "created": 1591111470,
                          "upvotes": 4,
                          "replies": {
                            "fsnbilk": {
                              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsnbilk/",
                              "text": "Acceptable in what sense? Legally? It's appropriate whenever and however legislators deem appropriate. 1) Every move by politicians is both political and practical at all times. 2) Bad faith? What does this even mean? Does Trump's executive order reduce likelihood of IP theft and send a message to China about COVID/shafting of Hong Kong or not?",
                              "author": "rechttrekker",
                              "created": 1591114109,
                              "upvotes": 1,
                              "replies": {
                                "fsnp3ju": {
                                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsnp3ju/",
                                  "text": "Do I personally consider it acceptable/apppropriate. 1) Bad faith = with an intention other than the intention stated within the order (reducing IP theft). 2) I don't agree with using student visas as a way of \"sending a message\", see 3) from last post. \n\nI do agree with [\"Screening against students, researchers, technicians, and academics sent abroad to acquire information for military research and development\"](https://www.state.gov/the-prcs-military-civil-fusion-strategy-is-a-global-security-threat/) but am concerned about exactly what it means to ban every Chinese grad student who [\"has been employed by, studied at, or conducted research at or on behalf of, an entity in the PRC that ... supports the PRC’s “military-civil fusion strategy\"](https://www.whitehouse.gov/presidential-actions/proclamation-suspension-entry-nonimmigrants-certain-students-researchers-peoples-republic-china/). Will Nanjing University, consistently ranked in the top 20 globally, be considered to \"support\" the strategy just because it is publicly funded? What about grad students who don't have access to any IP in the first place - will they be banned?",
                                  "author": "plasticpots",
                                  "created": 1591120569,
                                  "upvotes": 2,
                                  "replies": {
                                    "fsnqsns": {
                                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsnqsns/",
                                      "text": "I don't know how you're telepathically scanning Trump's mind or the minds of the cabinet officials who helped sculpt the order, but I certainly see a strong connection between the restrictions imposed and the goal of reducing/deterring IP theft. As for using student visas as a way of sending a message ... I mean, you can disagree all you want. It's not illegal nor uncommon nor immoral, I don't think. This is statecraft.  \n  \nI do agree though, the executive order is overinclusive (restricts student visas to those who wouldn't have stolen IP) and underinclusive (doesn't restrict student visas from being given to people from countries other than China which also commit IP theft, like Russia). But that's just the nature of government action. We owe case-by-case due process to US citizens, permanent residents, and legal residents. There is no due process requirement or guarantee constitutionally nor statutorily when it comes to who to let into the country and to whom to extend American legal protection in the first place.",
                                      "author": "rechttrekker",
                                      "created": 1591121376,
                                      "upvotes": 1,
                                      "replies": {
                                        "fsnto8p": {
                                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsnto8p/",
                                          "text": "Fair enough. I think you're overly concerned with what the rules and common practices *are* versus what they ideally *should be*, and I'm sure you think I'm idealistic, impractical, and non-utilitarian. It sounds like in practical terms we agree. \n\nLet me say one more thing though - I think we need to remember how the citizens and permanent & legal residents of the US got that way. We're a country of immigrants.",
                                          "author": "plasticpots",
                                          "created": 1591122716,
                                          "upvotes": 1,
                                          "replies": {
                                            "fso0waf": {
                                              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fso0waf/",
                                              "text": "If we had to extend due process to every single human being, this country couldn't exist. The administrative costs would be prohibitively expensive. Having a sovereign state with defined borders and a defined class of prioritized members (citizens) necessarily implies excluding and deprioritizing everyone else. It's a nice dream though, a borderless world and everyone singing kumbaya...",
                                              "author": "rechttrekker",
                                              "created": 1591126109,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fstvh42": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fstvh42/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1591247391,
                  "upvotes": 0,
                  "replies": {
                    "fstvoh8": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fstvoh8/",
                      "text": "Lol more like you guys forced it on us but sure",
                      "author": "articlesarestupid",
                      "created": 1591247539,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fsl02g3": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl02g3/",
              "text": "Trump's order [[link]](https://www.whitehouse.gov/presidential-actions/proclamation-suspension-entry-nonimmigrants-certain-students-researchers-peoples-republic-china/) is far more reasonable than the bill linked to here [[link]](https://www.cotton.senate.gov/?p=press_release&id=1371), and it sounds like that one is what you're talking about. Is that right?\n\nEdit: I am still quite concerned about that order, due to its vagueness, and because my understanding is that the US already had the right to deny entry to specific individuals who are deemed to pose a threat, but I think reasonable people can disagree. The bill in this post is different.\n\nEdit 2: Thanks for editing the comment to distinguish Trump's order from this new bill.",
              "author": "plasticpots",
              "created": 1591057177,
              "upvotes": 13,
              "replies": {}
            },
            "fsl0ekt": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl0ekt/",
              "text": "How does the bill only affect 1% of Chinese grad students in the US? I thought the bill bans visas for all Chinese grad students in STEM?",
              "author": "Trackest",
              "created": 1591057363,
              "upvotes": 7,
              "replies": {
                "fslmejg": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fslmejg/",
                  "text": "Trump made an executive order suspending the visas of a couple thousand Chinese students effective today. These are people that receive funding from the Chinese military and/or are known to be involved with them. It’s to seemingly take care of our IP theft problem, so it seems fair. \n\nThe bill on the other hand is atrocious and so xenophobic.",
                  "author": "happytransformer",
                  "created": 1591070059,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fskeagu": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskeagu/",
      "text": "Thank you for doing this.",
      "author": "rmlosblancos",
      "created": 1591045761,
      "upvotes": 4,
      "replies": {}
    },
    "fsk681a": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk681a/",
      "text": "We've gone down this road before with banning immigrants and travelers from Muslim countries because of prejudice and xenophobia. It starts with having a semi-legitimate reason, but then the scope of it gets expanded, and soon enough, any person of that ethnicity/religion/race is being targeted and scapegoated in their everyday lives.",
      "author": "PumpkinCrumpet",
      "created": 1591041819,
      "upvotes": 69,
      "replies": {
        "fsm0ooz": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsm0ooz/",
          "text": "I mean hell, this is the SECOND time the US has targeted People who came from China \n\nEdit: technically the THIRD time",
          "author": "Munnodol",
          "created": 1591080336,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fsjse9x": {
      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjse9x/",
      "text": "[deleted]",
      "author": null,
      "created": 1591035169,
      "upvotes": 52,
      "replies": {
        "fsk6vuo": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk6vuo/",
          "text": ">It doesn’t apply to people from Hong Kong or Taiwan. The notion isn’t crazy or xenophobic. Students who have motivation to steal intellectual property and ties to the CCP and the Chinese military shouldn’t be involved with cutting edge American research. \n\nKnow of countless Chinese international grad students not from Hong Kong or Taiwan and no of them is stealing intellectual property, but are being targeted everyday by racist and xenophobic rhetoric like what you're saying here. Immigrants from all over the world come to the US to study. You cannot assign people to beliefs, allegiance, or political motives simply by their race or country of origin.",
          "author": "PumpkinCrumpet",
          "created": 1591042144,
          "upvotes": 99,
          "replies": {
            "fskwund": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskwund/",
              "text": "> no of them is stealing intellectual property\n\nHow do you know that? It's not like they'd tell you. The Chinese government is offering very lucrative incentives for information, and they're only human.",
              "author": "Stark53",
              "created": 1591055406,
              "upvotes": -6,
              "replies": {
                "fsl23e1": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl23e1/",
                  "text": "LOL, what do you expect grad students to do? Ferret out their advisors' best ideas, quit their PhDs, and then go sell those ideas to Chinese government? Couldn't the Chinese government find the same ideas published already on NIH website? Or do you mean those international grad students secretly send late night messages to Chinese government on their own projects so someone can scoop them??",
                  "author": "PumpkinCrumpet",
                  "created": 1591058296,
                  "upvotes": 27,
                  "replies": {
                    "fsn4dy9": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsn4dy9/",
                      "text": "Stuff like [this](https://www.justice.gov/opa/pr/harvard-university-professor-and-two-chinese-nationals-charged-three-separate-china-related)",
                      "author": "Stark53",
                      "created": 1591110618,
                      "upvotes": -1,
                      "replies": {
                        "fsnb0ly": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsnb0ly/",
                          "text": "I see those same couple of individuals cited over and over, while half of the US research workforce consists of researchers of Chinese descent and a large number of international scientists from all over the world work and study in this country. Banning all Chinese international students is not only ineffective and costly but also sets a worrisome precedence for targeting large groups of people for the actions of a few. \n\nThe ability to decide whether to hire international grad students for research involving intellectual property and proprietary information should be left to individual PIs and companies. International students and postdocs, especially from Asia, have traditionally provided highly skilled labor that enabled the US research enterprise to flourish. Allowing broad government hurtles such as this bill to proceed is extraordinarily detrimental not only to scientific pipelines in the US, but also to the reputation of the country as a welcoming destination for international collaborations. The tendency of certain politicians to hamper the growth in STEM in exchange for scoring a few political points is shortsighted.",
                          "author": "PumpkinCrumpet",
                          "created": 1591113865,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fskb6ek": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskb6ek/",
          "text": "It's pretty crazy to me, a Chinese PhD student in Canada who still holds a Chinese passport and citizenship, but is a permanent resident. Since immigrating I've only been back to china twice in my life. I've lived in major cities in Canada all my life. I've never so much as cheated on a university exam, much less thought about stealing intellectual property for the CCP. Where do you draw the line? With these vague ass terms, guess people like me can kiss a postdoc in the states goodbye after graduating.",
          "author": "Fahrenheit452",
          "created": 1591044240,
          "upvotes": 51,
          "replies": {
            "fskcka8": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskcka8/",
              "text": "e: This question seems to have pissed a lot of people off, so I'm removing it",
              "author": "SamF111",
              "created": 1591044914,
              "upvotes": -22,
              "replies": {
                "fsktzas": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsktzas/",
                  "text": "This is an irrelevant question lol",
                  "author": "indecisiveparticle",
                  "created": 1591053843,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        },
        "fsjyf07": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjyf07/",
          "text": "Most Chinese grad students aren't engaged in espionage though. If that were the case, China would have caught up with the US years ago given the number of Chinese grad students in America. A lot of STEM programs have huge numbers of Chinese students involved in cutting-edge research. Getting rid of them will negatively impact the US's own STEM research because you can't replace all of them with people from Hong Kong or Taiwan or India. A lot of these students also choose or want to remain in the US after graduation and contribute to our growth.\n\nIP theft is a big issue that needs to be addressed, but blanket bans such as this accomplishes nothing other than to punish the innocent majority over the actions of a few. This is like saying there are some looters and rioters involved with the George Floyd protests so all of the protesters, even the peaceful majority, must all be looters and rioters.",
          "author": "lordtiandao",
          "created": 1591038037,
          "upvotes": 78,
          "replies": {
            "fsjz8tp": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjz8tp/",
              "text": "[deleted]",
              "author": null,
              "created": 1591038441,
              "upvotes": -26,
              "replies": {
                "fsk0hq6": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk0hq6/",
                  "text": "> I’ve never heard of any program that doesn’t have any applicants and must rely on chinese students.\n\nThat's not what I said. I said it'll negatively impact the programs because they can't all the sudden replace all of their Chinese students. This is why despite Trump's rhetoric about Mexicans stealing jobs, he still gives out visas to seasonal farm workers from Mexico. When a group of people has become a significant part of any field, getting rid of them will have repercussions. \n\n> The correct analogy would be if foreign people were coming to America and 20% of corporations noticed them stealing significant property. Then the government banning immigration from that country to America unless it’s a case by case situation.\n\nIt doesn't matter what analogy you use, the idea is still the same. A large group of average people are getting punished for the actions of a minority. If 80% of the protesters are peaceful but 20% are engaging in violence, should the state ban all protests? In addition, you should also look into the cases of some of the people arrested for ties with the PRC - there are many American citizens involved as well. \n\n> I disagree with the ambiguous criteria, but this is a major issue. United States colleges and researchers do not need corrupt Chinese influences.\n\nIt is a major problem. That much I agree. But there are better ways of dealing with it than a blanket ban. Not all protesters are rioters, not all Chinese grad students are spies.",
                  "author": "lordtiandao",
                  "created": 1591039048,
                  "upvotes": 30,
                  "replies": {
                    "fsk29ue": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk29ue/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1591039914,
                      "upvotes": -23,
                      "replies": {
                        "fsk4kfg": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk4kfg/",
                          "text": "> It wouldn’t impact the programs as negatively as losing their funding because they can no longer support R&D that gets stolen.\n\nDo you even know how research works? If I have a 5 person research group and there are 2 Chinese students who specializes in areas where the other 3 do not, then if those 2 Chinese are expelled then my research would stop until replacements are found. Again, this is why we still have seasonal farmer workers from Mexico despite Trump's rhetoric of them stealing American jobs.\n\n> I’d like to see your statistic on your actions of the minority.\n\nI don't have statistics. I'm sure such statistics probably exists in the intelligence community, but it's not publicized (or at least I can't find any). But even common sense would tell us that not all of the 350,000 Chinese graduate students in the US are spies. Otherwise, there would be a lot more cases of spying.\n\n> I don’t know why you think the point “20% are engaging in violence, should the state ban all protests” is valid.\n\nBecause that's basically the analogy you're making. If a small number of businesses are reporting theft conducted by a small number of people, then all the Chinese immigrants must be banned. So if a small number of businesses are looted by a small number of violent people, then all protests must be banned.\n\n> If 20% of the nation was engaging in violence, it would be anarchy and a civil war. 20% of America is 70 million people, or more than the total of the armies of the USSR, Germany, US, and China in WW2. That’s a huge number.\n\nYou should read better. I said 20% of the protesters, not 20% of the population.",
                          "author": "lordtiandao",
                          "created": 1591041019,
                          "upvotes": 22,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fsk7q2t": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk7q2t/",
                  "text": ">No, it’s saying foreign interests shouldn’t be allowed to steal from the educational system. I’ve never heard of any program that doesn’t have any applicants and must rely on chinese students. \n\nNo, it's the beginning of discriminating against groups of people by their ethnicity, out of irrational fear. US companies and university hire immigrants who are willing to provide cheap labor and work more hours than native students, in STEM research and in other industries.",
                  "author": "PumpkinCrumpet",
                  "created": 1591042552,
                  "upvotes": 22,
                  "replies": {}
                },
                "fsk73g1": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk73g1/",
                  "text": ">The correct analogy would be if foreign people were coming to America and 20% of corporations noticed them stealing significant property. \n\nPlease provide evidence that 20% of Chinese international students are stealing intellectual property, which is what you're implying here with these kinds of statements.",
                  "author": "PumpkinCrumpet",
                  "created": 1591042245,
                  "upvotes": 13,
                  "replies": {
                    "fsk7a47": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk7a47/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1591042336,
                      "upvotes": -11,
                      "replies": {
                        "fsk82gq": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk82gq/",
                          "text": "Yes, and companies can claim whatever they want. Post the evidence that companies are claiming this and post the evidence that Chinese international students are stealing intellectual property at 20% of corporations.",
                          "author": "PumpkinCrumpet",
                          "created": 1591042721,
                          "upvotes": 11,
                          "replies": {
                            "fsk9e3n": {
                              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk9e3n/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1591043366,
                              "upvotes": -4,
                              "replies": {
                                "fskak28": {
                                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskak28/",
                                  "text": "You are required to provide hard evidence if you were to make blanket statements about the integrity of a large group of people such as you have. It is not acceptable to target any group by their race, nationality, and religion, in academia or elsewhere. That kind of action is particularly antithetical to the spirit of international collaboration and open exchanges that is central to STEM. We expect Chinese international students, and hopefully one day their government, to abide by this and we should expect equal high standards of community and respect from researchers in the US.",
                                  "author": "PumpkinCrumpet",
                                  "created": 1591043936,
                                  "upvotes": 15,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fskpvr9": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskpvr9/",
              "text": "You are making a lot of assumptions in your post without attaching any facts or data to back them up. You say, 'a lot' of these students want to remain in the US. How many is a lot? Is it enough to justify the cost of educating a large portion of them for 7+ years if they turn around and take that knowledge home? How much brain drain from the US to PRC is worth that tradeoff? My experience with Chinese students is that (1) they are not interested in integrating, (2) they are not interested in US citizenship because it would strip their PRC citizenship, and (3) many of them actually want to go home. This is an anecdote based on my interaction over many years with these students and shouldn't be taken as data but it's what I've experienced. \n\n\nWhy do you think that getting rid of a few grad students would negatively impact research in the US? There is no shortage of motivated people willing to come to the US to study and if doing a PhD has taught me anything, it's that \"intelligence\" isn't the personal quality that will determine whether or not you are successful.\n\n\nI think a lot of people studying at US institutions are very comfortable with the lifestyle and resources that come along with the US being the number one superpower but are suddenly extremely uncomfortable with how their freedoms are provided to them when the reality of protecting our position in the world comes up.",
              "author": "shitstep",
              "created": 1591051668,
              "upvotes": -15,
              "replies": {
                "fskwf62": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskwf62/",
                  "text": "From [FP](https://foreignpolicy.com./2020/05/13/united-states-cant-afford-turn-away-chinese-talent/), which cited the [Center for Security and Emerging Technology](https://cset.georgetown.edu/wp-content/uploads/Keeping-Top-AI-Talent-in-the-United-States.pdf):\n\n> So far, the United States is winning that competition by a landslide. Contrary to the perception that Chinese graduates of U.S. institutions usually leave, the proportion of Chinese Ph.D. students who remain in the United States after graduation remains high. Data collected by the Center for Security and Emerging Technology estimate that **91 percent of Chinese Ph.D. students in artificial intelligence stay in the United States for at least five years after graduating—despite the challenges that securing visas already involves.** The United States can reap benefits to its innovation ecosystem from welcoming these students.\n\nIn fact, many Chinese students are now choosing not to stay not because they don't want to, but because of more restrictive visa and immigration policies in the US, fewer job opportunities, and better pay in China. Why stay in a place where you're starting to feel unwelcomed? According to one [survey](https://www.universityworldnews.com/post.php?story=20180531154955271):\n\n> The number of Chinese students seeking to settle overseas after graduating from universities abroad is dropping, amid stricter immigration policies in many countries and continued strong growth fuelling job opportunities in China, says a survey released as the United States reportedly considers limiting the length of visas for certain categories of Chinese students.\n\n> The 2018 Chinese Students Overseas Study White Paper, published on 22 May by New Oriental Vision Overseas, a major private education service provider, found that 46% of students had no intention of immigrating after graduation – up from 39% in 2017 and 35% in 2016.\n\n> Returning students are increasingly being wooed with a range of government incentives. Many in science and technology fields are offered generous domestic research funding and opportunities.\n\nJob opportunity and money is a major motivating factor. HKUST's (where I did my master's) former President moved to Saudi Arabia because the Saudis offered him a massive package, despite the fact that he was already well-paid in Hong Kong.\n\n> Is it enough to justify the cost of educating a large portion of them for 7+ years if they turn around and take that knowledge home? How much brain drain from the US to PRC is worth that tradeoff?\n\nIf the US can offer students the same pay and perks the Chinese government is offering them, don't you think they would stay? If the data I posted above tells us anything, it's that Chinese students want to stay but feel they'd have more of a future in China. I'm an American. I want to stay in the US after graduating and find a job here, but if I can get more pay in another country, then I'll take my knowledge and expertise with me elsewhere. And it's not like these students don't contribute to anything while they're here. No student has an obligation to remain here after graduation because they either paid tuition or they made contributions while here on a stipend/scholarship.\n\n> My experience with Chinese students is that (1) they are not interested in integrating, (2) they are not interested in US citizenship because it would strip their PRC citizenship, and (3) many of them actually want to go home. This is an anecdote based on my interaction over many years with these students and shouldn't be taken as data but it's what I've experienced.\n\nThis might be true for undergraduates, but for grad students I feel like it's less of a problem. For instance not all of their research group members/cohorts are from China and these are the people they'd have to interact on a regular basis. Besides, it's not just the Chinese that are guilty of this. Korean students, for instance, also tend to bunch up together.\n\n> Why do you think that getting rid of a few grad students would negatively impact research in the US? There is no shortage of motivated people willing to come to the US to study and if doing a PhD has taught me anything, it's that \"intelligence\" isn't the personal quality that will determine whether or not you are successful.\n\nHave you read the bill? This is not just \"getting rid of a few grad students.\" This is banning Chinese grad students from coming to the US to study STEM altogether. Projects will be delayed or cancelled. The next US Nobel Prize winner might not exist. A groundbreaking discovery that might have been attributed to the US might now belong to another country. The implications of this is much more than you're willing to admit. If we suddenly ban Mexican farmer laborers, where are we suddenly going to find replacements?\n\n> I think a lot of people studying at US institutions are very comfortable with the lifestyle and resources that come along with the US being the number one superpower but are suddenly extremely uncomfortable with how their freedoms are provided to them when the reality of protecting our position in the world comes up.\n\nNo, we're extremely uncomfortable with singling out a group just because that group has some bad eggs mixed in. You realize the CCP and Trump is literally using this exact same argument to justify their suppression of protests? No one is saying IP theft is not a issue and that there isn't Chinese students involved, but not all of them are engaged in IP theft. It's extremely easy for you to sit there and say \"there is nothing wrong with this\" because you're not who they're after.",
                  "author": "lordtiandao",
                  "created": 1591055171,
                  "upvotes": 17,
                  "replies": {
                    "fskxzha": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskxzha/",
                      "text": "While I appreciate the numbers you provided (not sarcastic) that really is one subdiscipline of one field. Your broader point seems to come back to the same thing: if another country can pay better, students will go where the money is and I'm not interested in having these people in the country to begin with. I want the people immigrating here to want to become Americans first and foremost and not have the decision of where their loyalty lies be some percentage of their salary. There is very little to convince me that we won't be able to replace these people with ones who are actively seeking out the chance to become Americans and/or are domestic students already. \n\n\nAdditionally, I never mentioned IP theft at all. I see this as a strategic move to protect our long-term scientific interests rather than something as short-sighted as protecting intellectual property. I am interested in starving the CCP of as many talented engineers as possible and denying them a US education and right now this seems to be on the right path. If there were instead a way to have them signing an agreement that would dissolve their loyalty to and citizenship with the PRC in exchange for coming here to study and being given residency and citizenship, I'd be all for it but that isn't the choice we are being given.",
                      "author": "shitstep",
                      "created": 1591056025,
                      "upvotes": -11,
                      "replies": {
                        "fsl072v": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsl072v/",
                          "text": "If you want people to stay, you have to give them a reason to stay. Poor job prospects, strict visa and immigration policies, Trump's constant \"America first\" rhetoric, and growing anti-China sentiments that is spilling into racism is not doing any favors in keeping them here. You can't blame them for leaving when they don't feel welcomed here and China is offering them more. By your logic, India should stop sending their engineers and programmers to the US because that represents brain drain and is bad for India's growth. Your \"us versus them\" logic is really misguided. Forcing people to be American and rejecting them if they don't want to be American? Is that what America is about? If students are paying tuition and/or contributing to projects while studying in the US, then they've made their contributions. Grad students pay taxes. They spend money on rent and food and entertainment, etc. contributing to our economy while they're here. What else do they owe to this country? Whether or not they want to stay or move is their choice. America is a country that provides them with that choice and that is why this country is great.\n\nI find your sentiments very scary and unnerving. People can only come here to study if they agree to give up their previous citizenship and agree to be American? How is that any different from what the CCP is doing (giving people money if they agree to work for China and be loyal to China)? Do you want America to go down the same way as China? Or are you just targeting Chinese people? Racist much?",
                          "author": "lordtiandao",
                          "created": 1591057248,
                          "upvotes": 10,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fsk6352": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk6352/",
              "text": "Won't this open up more spots for US students to get into grad school? I don't see how that's a bad thing.",
              "author": "Rockerblocker",
              "created": 1591041753,
              "upvotes": -19,
              "replies": {
                "fsm4dae": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsm4dae/",
                  "text": "Universities have a quota on how many international students can be admitted which does not take away from US student's admittance.",
                  "author": "paperiron",
                  "created": 1591083462,
                  "upvotes": 5,
                  "replies": {
                    "fsns3ju": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsns3ju/",
                      "text": "It does though, because they could (presumably) keep the total admits the same",
                      "author": "beavismagnum",
                      "created": 1591121984,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fskkf1l": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskkf1l/",
                  "text": "The market is oversaturated with PhDs. We don't need more spots open for Americans, we need more jobs and opportunities.",
                  "author": "Astroman129",
                  "created": 1591048809,
                  "upvotes": 6,
                  "replies": {
                    "fsktbg4": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsktbg4/",
                      "text": "Yet there’s still tons of students that don’t get accepted into graduate programs. And Masters degrees are very useful today.",
                      "author": "Rockerblocker",
                      "created": 1591053489,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "fsns6d2": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsns6d2/",
                      "text": "Or fewer PhDs",
                      "author": "beavismagnum",
                      "created": 1591122020,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fsjuvf3": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjuvf3/",
          "text": "I agree with your opinion on Chinese students who have motivation to steal intellectual property involved with espionage -- they should definitely be banned from any involvement with our research. However, I don't think a blanket ban on all Chinese students is the solution. The bill does mention that it will grant \"the President with a national security waiver on a case-by-case basis\", but what the fuck does that even mean? That's so vague. On what basis?",
          "author": "masjoven",
          "created": 1591036347,
          "upvotes": 40,
          "replies": {
            "fsjyvc8": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjyvc8/",
              "text": "I think that's exactly the point. The law would provide broad authority so that federal law enforcement and immigration officials aren't hogtied by detailed legalese when they're suspicious that a student or applicant is under the influence of the Chinese government. This is something that American law enforcement frequently struggles with when it comes to tackling any kind of espionage activity. So the solution being explored here is to give extremely broad authority which will *theoretically* only be used in support of a very narrow goal. I understand the policy motivation. I also understand the concern. It's a tricky issue. The Trump administration hasn't proven itself to be a fan of nuance so this type of approach isn't surprising at all to me.",
              "author": null,
              "created": 1591038258,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "fsjutmh": {
          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjutmh/",
          "text": "Source?",
          "author": "UnspectacularAim",
          "created": 1591036324,
          "upvotes": 3,
          "replies": {
            "fsjwlbf": {
              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsjwlbf/",
              "text": "[deleted]",
              "author": null,
              "created": 1591037170,
              "upvotes": 22,
              "replies": {
                "fsk9oft": {
                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsk9oft/",
                  "text": "Chinese government not respecting intellectual property is an issue, but where's the evidence that Chinese international students studying STEM in the US support the practice of their government or are engaging in intellectual property thefts?",
                  "author": "PumpkinCrumpet",
                  "created": 1591043508,
                  "upvotes": 5,
                  "replies": {
                    "fskasod": {
                      "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskasod/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1591044053,
                      "upvotes": 2,
                      "replies": {
                        "fskiho4": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskiho4/",
                          "text": ">Google your own shit next time.\n\nYou're in grad school homie. If you make an argument, you supply the source. It's not our job to google your sources for you.",
                          "author": "UnspectacularAim",
                          "created": 1591047842,
                          "upvotes": 23,
                          "replies": {}
                        },
                        "fskcbpv": {
                          "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskcbpv/",
                          "text": ">But you probably can’t because you’re either a bot or you’d be thrown into a concentration camp for defying the Chinese government. Fuck the ccp\n\nYou resort to personal attacks so quickly. Someone's a bot because s/he doesn't agree with you? \n\nI don't see anything in that article pointing to Chinese international grad students stealing intellectual property. I do see examples of prominent US researchers taking money with Chinese government ties. Whether that is proper deterrent of IP theft, or the over persecution of naive scientists who are opportunistic, is to be determined. Looks like most of those researchers all won their court cases.",
                          "author": "PumpkinCrumpet",
                          "created": 1591044799,
                          "upvotes": 12,
                          "replies": {
                            "fskixub": {
                              "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fskixub/",
                              "text": "[https://www.nytimes.com/2019/12/31/us/chinese-scientist-cancer-research-investigation.html](https://www.nytimes.com/2019/12/31/us/chinese-scientist-cancer-research-investigation.html)",
                              "author": "TuckerD",
                              "created": 1591048068,
                              "upvotes": -3,
                              "replies": {
                                "fsknetu": {
                                  "link": "/r/GradSchool/comments/guox53/to_my_fellow_graduate_students_in_the_us_a_bill/fsknetu/",
                                  "text": "Thank you for providing a source. Though the scientist in that article was not a grad student. \n\nWhat's stunning to me is that article says that half of all US lab workforce are researchers of Chinese descent. Given this, it's clear that the very vast majority are NOT stealing intellectual property, but are rather just everyday people either escaping their home country or working hard for better opportunities. While it is important to protect IP, scapegoating international grad students for the politics of their country is not the answer.",
                                  "author": "PumpkinCrumpet",
                                  "created": 1591050365,
                                  "upvotes": 13,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634065192
}