{"sid": "pnpy08", "link": "/r/GradSchool/comments/pnpy08/letter_of_rec_from_my_surgeon/", "title:": "Letter of Rec from my surgeon?", "text": "So long story short, I’ve had like a lot of surgeries from when I was really young to more recently during my undergrad. One of the doctors that I’m pretty close to offered to write me a letter of rec (and proof of medical history) for my grad school apps. For me, I think it would speak volumes of my character and the doctor is extremely prestigious (head of dept at Uni and director of hospital). I really appreciate the offer, but I want to be sure it’s allowed? Since it’s definitely different than getting one from a professor or a manager. I’d really like some input before I go ahead and ask the doctor to follow through with the letter of rec. Thank you!", "author": "SlothTheScientist", "created": 1631572020, "retrieved": 1632952636, "over_18": false, "upvotes": 4, "upvote_ratio": 0.75, "comments": {"hcriw4x": {"link": "/r/GradSchool/comments/pnpy08/letter_of_rec_from_my_surgeon/hcriw4x/", "text": "This letter would be helpful only if it makes a well-supported case that you would be a good research student based on your experience.\n\nIt does not sound as if that is what is on offer, but if he writes in the capacity of department head who has seen grad students or researchers succeed and fail it may be valuable.", "author": "IkeRoberts", "created": 1631581926, "upvotes": 4}, "hcr348v": {"link": "/r/GradSchool/comments/pnpy08/letter_of_rec_from_my_surgeon/hcr348v/", "text": "This is such a weird offer lol, letter of rec (school and job) is focused on your abilities, character, and potential. Having someone's private medical history being read by the hiring committee would be the strangest thing I can imagine. If you don't know anything about lor you can just google it, and get a sense of what the content is, who should write it, etc", "author": "supercitrusfruit", "created": 1631574606, "upvotes": 11}, "hcr0sml": {"link": "/r/GradSchool/comments/pnpy08/letter_of_rec_from_my_surgeon/hcr0sml/", "text": "What type of school are you applying to?\n\nThis almost seems like a character reference...which would be a weird thing to put in a grad school app. When we look at grad school applications we are looking for \"This is an excellent student.\" or \"Based on the research they have done with me, this student has a bright career in science.\"\n\nYour surgeons letter would just be a verification of surgeries and that you are a chill person, which is stuff that belongs in a personal statement.\n\n\nI believe this would take away from your application.", "author": "harper_kentucky", "created": 1631573517, "upvotes": 21}}}