{
  "sid": "qzctie",
  "link": "/r/GradSchool/comments/qzctie/advice_on_going_to_grad_school_or_not/",
  "title:": "Advice on going to Grad School or not?",
  "text": "I've always wanted to go to grad school, or so I thought. I just got my B.S of chemistry in March and had all 12 of my grad apps denied last year (poor applications. I didn't really try).\n\nI got a job working in a lab which I like. It's fun to do and I get paid well. Now grad school application time rolls around and I've done nothing. Deadlines for some of the schools I would like to attend are two weeks away. I only have one recommendation guaranteed right now. I keep having panic like moments where I tell myself I need to get my shit together and apply but I just can't get motivation to do it. Now I'm debating whether my reasons for Grad School are even enough to do it. \n\nThere's a lot packed into this that I won't explain here. But is it uncommon for people to do grad school in their late 20s or early 30s? (I'm 22 just asking in case I delay it). I'm kind of just at a lost point where I hate myself for not having a plan forward if I don't do grad school. It's been embedded in my plan for so long I'm ashamed if I don't go now.",
  "author": "AceAttornie",
  "created": 1637554784,
  "updated": 1637689792,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hllrcu1": {
      "link": "/r/GradSchool/comments/qzctie/advice_on_going_to_grad_school_or_not/hllrcu1/",
      "text": "You sound like you’re not sure at this point in your life if you want to pursue grad school, which is fine because as you said, you are young still. If you don’t have a passion for research and if you don’t have a real purpose for going to grad school, adcom will be able to sniff that out in your application, and it’s probably why you were rejected last year. Don’t force yourself to do something you’re not sure about—it’ll be a waste of time for you and for the school to invest in you as a student. You mentioned that you’re working in a lab and that’s great! If through the course of working there, you find that you are engaged with the research or if you find a nagging question that you need to go to grad school to answer, then you can decide to go to grad school.",
      "author": "ye_itsher",
      "created": 1637557036,
      "upvotes": 13,
      "replies": {}
    },
    "hllrez3": {
      "link": "/r/GradSchool/comments/qzctie/advice_on_going_to_grad_school_or_not/hllrez3/",
      "text": "Regardless of your reasons, you're unlikely to succeed if you aren't committed. People who are just sort of lukewarm on it rarely succeed. Applying with just two weeks notice and your recommendations not yet sorted is also unlikely to work out, especially after a similarly half-hearted strategy failed last time.\n\nI suggest that you not apply this cycle and spend the next few months seriously considering what you want your career to look like over the next five, ten, twenty years. It's possible grad school is not an important component of that for you; it's possible it's essential. Then, if you decide to apply next cycle, start early and take it seriously.\n\n23 is not a late age to begin at. Early 30s is unusual but by no means unheard of. That you currently have a job that's in your field bodes well for your application not going \"stale\" due to lack of recent experience. If you're not already, perhaps you could find a way to contribute to a research project at your current job? That would go a long way towards bolstering your application.",
      "author": "UmiNotsuki",
      "created": 1637557070,
      "upvotes": 9,
      "replies": {}
    },
    "hllri0z": {
      "link": "/r/GradSchool/comments/qzctie/advice_on_going_to_grad_school_or_not/hllri0z/",
      "text": "Absolutely not uncommon. Most of my department and others I have met are between the ages of 25-29 or in their 30s. Some departments will have a lot of people straight from undergrad, but it is definitely not \"weird\" to be older. In fact, I love talking to people that have real world experience in my cohort, they have advice and insight that is different than what you learn from sitting in a classroom. Don't feel pressured to apply right now, in fact I would advise against it based on what you've wrote here.",
      "author": "bonefarmer",
      "created": 1637557118,
      "upvotes": 6,
      "replies": {}
    },
    "hlmvdvw": {
      "link": "/r/GradSchool/comments/qzctie/advice_on_going_to_grad_school_or_not/hlmvdvw/",
      "text": "I do not think you will benefit from another rush of applications.  You have a job, you enjoy it at least for now. Spend some time thinking about what you want. What do you like about your job? Not like? Do you want more responsibility/independence? Figure out if you need grad school to accomplish those things. Many employers have tuition assistance programs.  Down the line you could benefit from that. I didn't start my Ms in Chemistry until my early 30s. There is no set path. My job pays for it and while I am busy juggling work and school, I do not have the financial stress that a grad stipend of about 40% of my current pay would cause. Benefits to different paths.",
      "author": "calmhike",
      "created": 1637587045,
      "upvotes": 3,
      "replies": {}
    },
    "hln7590": {
      "link": "/r/GradSchool/comments/qzctie/advice_on_going_to_grad_school_or_not/hln7590/",
      "text": "Making an effort to focus on your future at the end of the day after working a full time job is difficult. You should not beat your self up about that. There are different types of graduate programs with different focuses, if you haven't found a field/direction that you can see yourself doing in the future then it might be best to hold off and apply next cycle. \n\nGrad school's tend not to discriminate on age as long as you can show your skills are still relevant. It is fairly common to have students in their late 20s and 30s in your cohort.",
      "author": "local_man_says",
      "created": 1637593003,
      "upvotes": 2,
      "replies": {}
    },
    "hlp73bg": {
      "link": "/r/GradSchool/comments/qzctie/advice_on_going_to_grad_school_or_not/hlp73bg/",
      "text": "If you are in any way not sure if you want to do it, don't. \n\nI'm kind of starting to realize that the main reason I applied for my current degree is because it's what I was supposed to do, not necessarily because it was what I wanted to do. Will I regret it when I finish? Probably not (though the day after graduation, my liver might). Would I have done things differently knowing X, Y, or Z? Maybe.\n\nI would recommend you wait at least another year and think about it. It's basically never too late to go back to school, and you may have an advantage if you do wait (i.e., you have actual experience). If you're in a lab, find someone who can mentor you and talk about it with them.",
      "author": "awksomepenguin",
      "created": 1637622448,
      "upvotes": 2,
      "replies": {}
    }
  }
}