{"sid": "puk1ey", "link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/", "title:": "Does anyone else sabotage their own PhD?", "text": "I have a really bad problem with self-sabotaging behaviour generally, but it’s becoming a real problem with my PhD. I’m in my 4th year of a (UK) PhD so I should be completely done by the summer, and I have *so* much left to do. I just can’t bring myself to do it. I have all day to work and don’t, I stay up all night when I don’t need to, I can’t concentrate for very long when I do work. \n\nI just want to get this PhD over and done with, why can’t I do it.\n\nEdit: thanks everyone for your kind words and suggestions!", "author": "unemployedgraduate12", "created": 1632490940, "retrieved": 1632952045, "over_18": false, "upvotes": 233, "upvote_ratio": 0.97, "comments": {"he6vecp": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he6vecp/", "text": "Take a few days off no guilt and don't think about giw late you are", "author": "glassheart93", "created": 1632550523, "upvotes": 1}, "he6do1j": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he6do1j/", "text": "If you can recognize when you’re doing it, that’s most of the battle.", "author": "ogroyalsfan1911", "created": 1632539903, "upvotes": 3}, "he60tsd": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he60tsd/", "text": "My supervisor tolerated me going way longer than I needed to for my PhD, but to be fair most of the last two years of it was just grinding out draft after draft after draft of a paper and never satisfying exactly anyone - and in the process doing some needed re-analysis of my data. Eventually I finally managed to get a paper prepared that didn't tweak someone's nose. And then I defended my thesis not long after.\n\n[ EDIT: And yes, I did have more than a few days where I'd put off the writing to watch $TV_SHOW. ]", "author": "alvarkresh", "created": 1632533786, "upvotes": 3}, "he5jlec": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he5jlec/", "text": "In my case, I just needed the extra time to process and articulate what the phd was about. Don't lose hope, but also don't make this more important than it should be.", "author": "lulalilikabaloo", "created": 1632525794, "upvotes": 1}, "he56qi5": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he56qi5/", "text": "I’ve been in my PhD for about the same amount of time and go through this cycle often, so a lot of what you’re saying about self sabotage sounds familiar. For me the highest priority is forcing myself to sleep at a regular time so I can break the pattern. When I’m not sleeping enough I get too tired during the day to do decent work, or to even force myself to work. I realized it was “revenge procrastination” and a mix of other anxieties keeping me up, so it’s likely to be different for you. But the nice thing is it just takes me a day or two to get back to a regular sleeping schedule. Then I can start to add other strategies one at a time. And then I’m in a little bit of a better place than I was a few days ago and that matters. I might not be as productive as I’d like to be but at least it’s not nothing. Try starting with sleep. Instead of 4am try 2am.", "author": "kipscore", "created": 1632520088, "upvotes": 2}, "he4zkq9": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he4zkq9/", "text": "This is not you sabotaging yourself, this is you being human and experiencing the extreme stresses that programs like yours induce in their participants. Please do not blame yourself, instead try to understand that it is a perfectly normal reaction to the sorts of pressures you are under--especially at the end.\n\nOthers have suggeted breaks, which sound great. You should also reach out to someone you can talk to in order to learn techniques that can help you through this.\n\nRemember: you're right there--it's just waiting. Decide whether it's worth continuing on or not.", "author": "stolid_agnostic", "created": 1632517032, "upvotes": 5}, "he4rkgf": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he4rkgf/", "text": "It sounds like you are avoiding your work more than you are actively sabotaging it.\n\nMy generic advice for dealing with avoidance is this:\n\n1. Be open to working even when you feel bad. It is still possible to do quality work even when our feelings are not cooperating.\n2. If you feel so bad that you cannot work then try to engage with something else that brings you value. Do chores. Catch up on sleep. Make art. But don't avoid everything all at once.\n\nIf you can think of something that helped you overcome avoidance in other areas of your life then you should apply that here. If you are caught in a cycle of avoidance in other areas of your life, then it is probably time to see this as a bigger issue and contact someone who is an expert on avoidance and anxiety.\n\nI feel for you. Grad school is notoriously bad for mental health. I hope you find some relief soon.", "author": "HerndonMath", "created": 1632513691, "upvotes": 3}, "he4mtem": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he4mtem/", "text": "Some really good advice on this thread. Something I realized while reading some resources on finishing your dissertation is that your behaviour has roots in very valid emotions. And I used to refuse to validate those emotions, and swept them under the rug; instead, I would focus on the behaviours that were holding me back (eg not starting work till late in the day, stopping early because of lack of motivation) and just bury myself in guilt. Which just led to even less motivation.  \nSomething that helped was acknowledging that there were emotions causing the behaviours (fear of failure was a big one) and accepting them, and focusing less on the behaviours themselves. And then, setting myself little tasks that I felt capable of during that time, and keeping myself accountable by telling other people my intentions.", "author": "WickedSpite", "created": 1632511736, "upvotes": 6}, "he4kp8m": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he4kp8m/", "text": "Currently going through this and have been told by admins that it’s happening a lot right now. I’m done with my PhD, but I’m still doing research around students. COVID burnout is real.", "author": "kmhuds", "created": 1632510868, "upvotes": 3}, "he4hz6b": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he4hz6b/", "text": "You are describing the last few months of my PhD. I wrote the last part of my dissertation with so little interest that I don't think I even re-read the last few chapters to edit them. I desperately wanted to be done and I was emotionally exhausted and at that point, done was better than good. I put a ton of work into the presentation but I was totally checked out on the written document. It basically ended up being the papers I published over the years with some extra writing to glue it all together.", "author": "shitstep", "created": 1632509731, "upvotes": 2}, "he4ez4f": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he4ez4f/", "text": "I think you should speak to a therapist.", "author": "Superduperbals", "created": 1632508457, "upvotes": 5}, "he43rgs": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he43rgs/", "text": "As others have asked, if it's your passions disappearing, being burnt-out, etc. \n\nIf you know that it is workload and find that overwhelming, can you get help with that? Like ask colleagues to do \"online work hours\" if you work from home, go to the office, try setting small goals with your supervisor or even see if they can help you out there. Some supervisors love asking for a 500 things without any consideration of what it means in practice, and that doesn't work for everyone. \n\nMy advice is this, 60% day is so much better than 0% day, small bits done are so much better than no bits done. Take what you can.", "author": "redditmat", "created": 1632503737, "upvotes": 4}, "he4251s": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he4251s/", "text": "Not in a PhD, but another doctoral program that has no breaks except the two weeks in between semesters and seriously considering it. Ugh", "author": "kyokogodai", "created": 1632503045, "upvotes": 2}, "he41gi9": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he41gi9/", "text": "Yeah I think this is pretty common. I had this issue this past year where I no longer had much motivation to do my research because I had gotten an internship I was proud of and the experience of doing the exact same work I was doing as a PhD, just with a fat paycheck really made working for a PhD feel less rewarding… also not leaving my house at all other than to buy a 5 dollar latte because of the pandemic really killed my vibe. It’s fairly annoying to think that I *could* be living my ideal life in a different city with a large income and a cozy apartment, but I just don’t feel comfortable not having a large amount of personal development as I work and so my identity and ego are basically holding me hostage to work hard for little reward for the next 3-5 years.", "author": "gentleboys", "created": 1632502758, "upvotes": 10}, "he417cw": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he417cw/", "text": "Yeah. I finished in under 3.5yrs but I could have finished in 3yrs. For literally the final 5mo or so, I procrastinated so much, I did about a month of work. This got worse as every year went on.\n\nIt's easy to say 'just do it' but sometimes you need to step away for a while. So sometimes 'sabotage' isn't really sabotage, but it feels like it at the time.", "author": "RedSquaree", "created": 1632502649, "upvotes": 2}, "he3y3au": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3y3au/", "text": "Second year PhD student and I am the same. I have been getting therapy to try and help. For me, it seemed to be related to burnout and other mental issues. It's very difficult.", "author": "Runebro", "created": 1632501352, "upvotes": 2}, "he3vfdy": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3vfdy/", "text": "I'm in this boat a little bit too. \n\n6th year. was doing great until Covid. Got a Fulbright to finish my dissertation, though I was sitting pretty. Travel got canceled. Therefore also didnt get the money.  All my interviews are in a language that i speak OK but not well enough to translate full speed hour long interviews in colloquial Tibetan by myself. Nearly impossible to find a reliable translator of this fairly rare language in the US during covid. Really fucked me. Applied to 5 grants and 30+ jobs last year. Didnt get a single interview. even for ones outside of academia. \n\nI've started to pull myself out of it a little. Here's what worked a little\n\nI really lost steam because (i know this will sound cheesy and performative) during covid i was so isolated and felt so selfish and self-centered. I taught in Tibet for 3 years before starting my phd and whenever things got rough during the fist years of my phd i could look at the pictures of my students and remember easily why i wanted to do a phd and my inspiration for doing so. Those kids had lives 10x harder than mine and worked their fucking asses off. They'd stay up all night in the stinky bathroom to study because its where the only light in school was after hours! Surely i could work hard enough to succeed, right!?\n\nBut covid cut me off from them, from the place, from my data, interpreters, purpose, everything. And everything was *there.* i dont really like living in the US, so being stuck at home was doubly bad. \n\nWhat's been working is simply digging deep to remind myself of the reasons I want to get a phd and finish this. I still truly want to understand how minoritized students get fucked in mainstream school and it's still important to me. Reading inspiration biographies of great tibetan saints has been very helpful in this regard! \n\nAnd the second thing thats been working is to break everything into *super* bite-sized chunks. The more desperate we get to finish, the more we want to just crush the thing in a single afternoon, the more overwhelming it seems. You aint gonna finish your dissertation by tomorrow. But i bet you can write one chunk of one argument of one section of one chapter by tomorrow. Rather than trying to get it all perfect on round 1, ive literally just started writing what i think is true. I'll deal with cleaning it up later. \n\nGood luck out there!", "author": "BlancheDevereux", "created": 1632500259, "upvotes": 7}, "he3qd9h": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3qd9h/", "text": "This is burnout. It's very normal. I'm literally in the throes of this right now, and can sympathize with you, /u/--ikindahatereddit--, and others in this thread.\n\nBest suggestion is to be kind to yourself and take a day completely off. Try to jump back in with a manageable set of small to-do list type items, just little things you can check off a list to feel some accomplishments. You'd be surprised how little things can add up, and once you're on a roll just go with it.\n\nThis too shall pass -- just try to do a little bit each day, and if you can do a little more than the last day, great. But at a certain point you'll realize you're just spent. That's when you take a day off, recuperate, and start small again. Repeat.", "author": "Jack-ums", "created": 1632498173, "upvotes": 16}, "he3om8y": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3om8y/", "text": "I relate to this a lot, currently trying to overcome this to varying degrees of success. Asking for help more often, trying to create some external structure (e.g. \"fake\" deadlines, to do lists), and working on my mental health have all helped. This article might resonate with you as well: [https://www.nytimes.com/2019/03/25/smarter-living/why-you-procrastinate-it-has-nothing-to-do-with-self-control.html](https://www.nytimes.com/2019/03/25/smarter-living/why-you-procrastinate-it-has-nothing-to-do-with-self-control.html)", "author": "NotNathyPeluso", "created": 1632497447, "upvotes": 4}, "he3m4in": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3m4in/", "text": "i would see a therapist because this sounds like it could really upend your life if it goes unmanaged. i'm not sure how available they are in the UK but this has helped me get out of ruts in the past.", "author": "imatthewhitecastle", "created": 1632496401, "upvotes": 3}, "he3iekg": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3iekg/", "text": "This could be a sign of burnout or depression friend.\n\nI do this too. I picked up an another entirely different graduate degree to avoid the work I should be doing. It is done this semester though and I don't have any more excuses.", "author": "Lord_Blackthorn", "created": 1632494831, "upvotes": 48}, "he3i3ew": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3i3ew/", "text": "How is your relationship with your adviser? Do you think you would feel comfortable or supported if you brought these issues to them? If so, I would recommend going to them and telling them that you're having some trouble, but you want some help coming up with a roadmap to get back on track. It's sometimes helpful to have someone else help you chunk up a task this massive into smaller, digestible parts. If you're not comfortable raising these issues to your adviser, reach out to your director of graduate studies to discuss what is going on; they should be able to direct you to resources that can help (ideally, I know graduate student support in academia is generally fucked).\n\nI'd also recommend, if you haven't, that you think about finding a therapist. Avoidant behaviors like the ones that you're describing (procrastination, lack of focus, insomnia or inability to sleep) are far more common among graduate students than the general population, and can also come on for all sorts of reasons. Just like you need support in your work, you also sometimes need support putting together a plan to deal with your mental health.", "author": "Argikeraunos", "created": 1632494702, "upvotes": 19}, "he3clf7": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3clf7/", "text": "Literally what I’m doing right now. I’ve been “working on” my exam proposals almost the entire year. I know three people who started with me who are ABD. My advisor needed to take sabbatical, but they told me they would absolutely be here for anything that I needed up to and including exams. But I am still terrified of them and don’t want to reach out until everything is perfect. I might be a fourth year but still call myself a third year because it feels better. \n\nEmotionally I just can’t. I have jobs part time that make money that I can’t do either. I go back-and-forth between complete rage and abject depression. Isolated introvert with some mental issues on board. Everyone thinks I’m doing wonderfully but I don’t have anything to show for the past 12 months except lists of books I’m supposed to be reading and half baked ideas that are not fully formed because I’m not reading. Writing this at 9 AM while I’m still in bed. \n\nSo yeah. Things are great. This is fine.", "author": "--ikindahatereddit--", "created": 1632492318, "upvotes": 114}, "he3c8vv": {"link": "/r/GradSchool/comments/puk1ey/does_anyone_else_sabotage_their_own_phd/he3c8vv/", "text": "Are you enjoying the work in your program? Did you ever? If you did, maybe take a few days to figure out your issues. You might be burnt out so a little break wouldn't hurt.", "author": "cuassant", "created": 1632492165, "upvotes": 22}}}