{"sid": "p35zsj", "link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/", "title:": "Most of my department's building burned down last night, so let me take a moment for a PSA: keep several backups of your data!", "text": "Maybe this sounds a little alarmist, but really -- [you never know what could happen](https://i.imgur.com/tW4s3rc.jpg). You are early-career academics and you don't want to lose years of your hard work, or data for future projects. We lost our personal desktops and a portion of the department servers/storage, and for some of us, those were the only backups in existence. No one was physically harmed in the fire, but the mental and career blow for some has been substantial. It's truly terrible.\n\nPersonally, I avoided buying a cloud storage subscription for the silly reason that I didn't have funding for it. It totally would have been worth it to pay out of my own pocket.\n\nKeep a couple physical backups *in different locations* and a cloud backup.", "author": "geoemyda_spengleri", "created": 1628793575, "retrieved": 1632953856, "over_18": false, "upvotes": 399, "upvote_ratio": 0.99, "comments": {"h9nrhe4": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h9nrhe4/", "text": "Sorry to hear about your situation. But thank you for this alarm. Backups is indeed something most of the companies do not rely on or are not willing to invest in...until a disaster happens...", "author": "Pvt-Snafu", "created": 1629466284, "upvotes": 1}, "h8tgj0f": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8tgj0f/", "text": "Anyone doing data-focused work that isn’t backing up at least the vital parts of their research on a cloud is basically just willfully ignorant at this point.\n\nI haven’t stored anything locally for years that wasn’t a *massive* data file and even those, I have backed up on a second hard drive and instructions on how to re-create relatively quickly on a cloud-stored document.\n\nReally sorry this happened to you- it really sucks.  It took my mom losing all her phone photos to 3 times before she finally asked us how to set up cloud storage.  Hope this only takes you once.", "author": "Weekly-Ad353", "created": 1628881636, "upvotes": 1}, "h8sny8d": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8sny8d/", "text": "Our standards were to keep 4 backups. One on the same computer's second hdd (daily), one on external storage in a lab drawer (weekly), one on external storage off-site (monthly, lab manager took them home), and one cloud backup (daily).\n\nWe never needed this level of redundancy, but we kept easy knowing it was there. Our data was mostly field data, so not easily repeatable, and therefore all the more valuable.", "author": "Verdris", "created": 1628870231, "upvotes": 2}, "h8sed41": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8sed41/", "text": "Just a reminder also to everyone that not all data can be stored on anything else but university servers/computers, especially if you're working with human participants. Check your ethics approvals and with your PIs to make sure it's ok!", "author": "valryuu", "created": 1628866147, "upvotes": 3}, "h8s19g1": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8s19g1/", "text": "You got a PhD in astronomy? Damn how’s life as an astronomer? Is it fun? PM me if you want.", "author": "TheEvilGhost", "created": 1628859082, "upvotes": 1}, "h8rwhbg": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8rwhbg/", "text": "Was it an accident or did someone take *the dog ate my homework* too far?", "author": "aknb", "created": 1628856313, "upvotes": 1}, "h8rrjyc": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8rrjyc/", "text": "Dude, get Dropbox.", "author": "jackandjill222", "created": 1628853221, "upvotes": 0}, "h8rfq1m": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8rfq1m/", "text": "Thanks for the tip! What country is this in?", "author": "ADifferentDimension", "created": 1628843667, "upvotes": 2}, "h8r3hoy": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8r3hoy/", "text": "Omg, I'm so sorry this happened...", "author": "givemeyourdonut", "created": 1628833991, "upvotes": 1}, "h8qlnmt": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8qlnmt/", "text": "A few months ago I bought a 5 TB WD Passport external hard drive. I generally leave it at home but it's small and light enough that it's easily portable, so you can backup a desktop at the lab and take it home with you every day. They usually retail for $150 - $200, but it looks like they're currently on sale for just over $100 at Best Buy. I definitely recommend picking one up, especially if you use multiple machines in the course of your work.", "author": "Libran", "created": 1628823455, "upvotes": 1}, "h8qeqkd": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8qeqkd/", "text": "You don't even need to buy anything. Here's how to get encrypted cloud backups for absolutely free:\n\n1. Locate the folders that have the most important files. Try to stay below 10 gigabytes in total.\n\n2. Have a Google / OneDrive / etc. account.\n\n3. Install and set up [Duplicati](https://www.duplicati.com/) (open source software).\n\n4. Duplicati will back up all your data in encrypted format (both filenames and contents) to whichever service you picked up (I use Google Drive as I inevitably have one and it gives 15Gb free space which is plenty enough for my most important stuff).\n\nIf you are more of a techie, you can also go with rclone. I recently switched to rclone because it's in Debian's package repositories, but either is a good choice. Duplicati is easier, rclone is more configurable. I have rclone run automatically every other hour, on the half hour.\n\nNow, Dropbox, Google Drive, iCloud, etc. are not backup systems. They are for syncing. They aren't encrypted, they don't run on all systems, and they are not great at preserving file metadata. They can also corrupt your data. They are useful, and you can use backups and these cloud sync stuff in tandem, but they don't replace each other.\n\nTogether with the above, try to set up full local backups too. I have a Raspberry Pi 3B+ single board computer. It just sits by the router and has a 128Gb USB stick plugged in, and I do full backups of all my data to it (roughly) daily.\n\nNow, some of you may be using git or other version control systems, but they are not a replacement either. If an HDD gets corrupted, your repository (the .git/ subdirectory) can get corrupted too, in which case your history will get corrupted, and if there's enough corruption, your repo will become unusable. Had that happen to me.\n\n**tl;dr** cloud sync =/= cloud backups =/= git =/= local backups. Ideally you want to use all of them. Trust me, I've learned my lesson the hard way for each of those \"=/=\"s.\n\n---\n\nEdit: I got carried away by the memories of my horrible past of data losses and forgot to say: really sorry about what happened and lucky none of you were physically harmed. Sad that such a beautiful place burned down too.", "author": "gkayaalp", "created": 1628820085, "upvotes": 5}, "h8qcc55": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8qcc55/", "text": "My condolences to your colleagues data and research. A little thanks and good fortune that nobody was hurt.\n\n&#x200B;\n\nI'm possibly more paranoid than most people about data loss and I'm possibly more tech savvy than most people but my advice in order of complexity (mind you I do *all* of these things):\n\n&#x200B;\n\n1. [Backblaze](https://www.backblaze.com) on your computer(s). I pay out of pocket because the school doesn't cover it.\n2. An external backup drive (USB plugged variety) that you connect every so often. (Time Machine or similar)\n3. A local NAS drive that your computer syncs to automatically ([Time Machine can talk to these usually](https://www.ixsystems.com/documentation/truenas/11.1/sharing.html))\n4. If the NAS runs TrueNAS then you can easily setup [cloud sync tasks](https://www.truenas.com/docs/core/tasks/cloudsynctasks/) like this one to download a copy of your Google Drive, Box, DropBox, or anything else onto local storage if your account is hacked or deleted.\n5. And if you are worried about having your actual email address hacked and deleted, or if you run your own domain then use something like [Cloudally](https://www.cloudally.com) or [Backupify](https://www.backupify.com). They sync your email account to a separate service online. Of course you need to trust them.... Trust... It all boils down to trust?\n\n&#x200B;\n\nI guess I'm a little paranoid about data loss. As a tangent to the home NAS I actually run a second home NAS which is just a backup target of the first home NAS if the home NAS fails..... I worked in IT before graduate school. Data loss is real.", "author": "NormalCriticism", "created": 1628818948, "upvotes": 3}, "h8qb9rv": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8qb9rv/", "text": "Oh wow that is insane. Damn", "author": "Dustin_Bromain", "created": 1628818432, "upvotes": 1}, "h8pynkk": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8pynkk/", "text": "Wow. Very sorry to hear this.", "author": "aqjo", "created": 1628812660, "upvotes": 1}, "h8prspg": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8prspg/", "text": "My condolences. What happened?", "author": "llamarloon", "created": 1628809460, "upvotes": 3}, "h8pn848": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8pn848/", "text": "Oh no I hope you still have some data and don't have to redo everything (and same to everyone else in your building).\n\nWhen I was in undergrad, the oceanography and geology building was partially destroyed (I don't remember if it was flooding or a fire). The labs there almost all did physical sample collection and processing, and I heard there were several PhD students in their third or fourth who lost all of their samples. And I know a couple other students who again, had only physical samples with little to no information accessible by personal computers who were locked out of their labs due to lockdown and it took months to get clearance to get back inside to get to their work.\n\nI got my desk in the department building and met my PI in person last week and data storage was one of the first things I brought up to talk about.", "author": "ConfusedCuddlefish", "created": 1628807232, "upvotes": 1}, "h8pmviy": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8pmviy/", "text": "If your program has an office 365 subscription, that includes quite a bit of cloud storage (even though one drive really sucks if you need cross compatibility)", "author": "Milch_und_Paprika", "created": 1628807067, "upvotes": 1}, "h8pljkk": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8pljkk/", "text": ">Keep a couple physical backups in different locations and a cloud backup.\n\nBasically, it calls the 3-2-1 backup approach. When you have at least 3 copies of data, 2 different media, 1 copy offsite: [https://www.starwindsoftware.com/blog/3-2-1-backup-strategy-why-your-data-always-survives](https://www.starwindsoftware.com/blog/3-2-1-backup-strategy-why-your-data-always-survives) \n\nThe offsite copy might be another NAS solution in a different location or cloud storage. You can use encryption or zip archives to reach some level of security. \n\nIn this case, your data is safe enough. It's a pity to hear about losing data. And it is a tragedy to hear about losing academic data.", "author": "-SPOF", "created": 1628806469, "upvotes": 16}, "h8piy7c": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8piy7c/", "text": "Wooton what happened 😳", "author": "SaltyPlans", "created": 1628805379, "upvotes": 3}, "h8phi7q": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8phi7q/", "text": "3-2-1. 3 different backups, at least 2 different devices, at least 1 offsite.", "author": "hausdorffparty", "created": 1628804783, "upvotes": 28}, "h8pglg9": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8pglg9/", "text": "Damn your research was fire 🔥", "author": "Int_traveller", "created": 1628804403, "upvotes": 28}, "h8pb0a5": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8pb0a5/", "text": "Very sorry to hear this.\n\nUsing Dropbox + Github in tandem for document versioning *and* cloud backups has been my go-to solution for a few years.\n\nSince Dropbox syncs with multiple computers I use, I have copies on multiple harddisks as well as in the cloud. And if anything happened to their servers, I also have Github.\n\nAnd the best part is that this is the most straightforward solution. I literally just save documents as I normally would, and when I feel like versioning, I push to Git.", "author": "Protean_Protein", "created": 1628802134, "upvotes": 96}, "h8p9ezv": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8p9ezv/", "text": "oh no! I'm so sorry!!!", "author": "EpiJade", "created": 1628801501, "upvotes": 2}, "h8p7hsf": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8p7hsf/", "text": "Omg! I’m so sorry!", "author": "marbelousgeologist", "created": 1628800743, "upvotes": 27}, "h8p1fel": {"link": "/r/GradSchool/comments/p35zsj/most_of_my_departments_building_burned_down_last/h8p1fel/", "text": "During undergrad a math faculty longingly wished for their department building to catch fire.", "author": "Glarkin42", "created": 1628798379, "upvotes": 37}}}