{
  "sid": "q3p6on",
  "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/",
  "title:": "Did you get a professional Engineering MSc?",
  "text": "I’m deciding between thesis based and a professional degree. I’m not interested in a PhD, I mainly want to learn more about Env E and broaden career opportunities but I also don’t want to end up spending 50k out of pocket. What’s your experience and decision making process for choosing a professional grad program over a research based program?",
  "author": "zippideedoodaa1640",
  "created": 1633662887,
  "updated": 1634099841,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hg0b19v": {
      "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/hg0b19v/",
      "text": "I’m currently doing a professional engineering MS after having worked in industry for about 4 years after graduating undergrad. I’m working part time for the same company while in school and they have an educational assistance program that helps pay for part of it. I’m not sure how it is for environmental engineering but I’ve had friends in the industry say that doing a thesis is only helpful if you plan on continuing in academia or if you need it to help pay for school.\n\nPersonally, I wasn’t interested in doing research and am just using this to transition into a slightly different field. I already have an offer for a promotion after I graduate and it’s been helpful for me to continue gaining work experience while earning a salary and having school partially reimbursed.\n\nSo it really depends on your situation. If you’re coming straight from undergrad, a thesis-based MS will be better because it’ll be some technical experience that you can leverage. On the other hand, if you’re not completely sure, you have the flexibility to go back and do an MS later on.",
      "author": "famaf",
      "created": 1633803312,
      "upvotes": 2,
      "replies": {}
    },
    "hft9yl7": {
      "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/hft9yl7/",
      "text": "A lot of people think a professional MS will result in a pay boost. Possibly if you are doing good work. Since I started mine I've earned 30k more through experience and proving myself.\n\nOn the flipside, I'm not getting a raise because I have a masters. In fact I'd argue the only good reason to do one is, it's free to you, and you like learning.\n\nAny other reason is misleading at best.\n\nWill it open up opportunities to more jobs than a bachelor's, possibly, is the time cost and financial cost worth it? Possibly, you've got to weigh it yourself.\n\nGood luck",
      "author": "Big_Faithlessness625",
      "created": 1633663441,
      "upvotes": 1,
      "replies": {
        "hftahrz": {
          "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/hftahrz/",
          "text": "Yeah, I do have to do some weighing. It’s more like, I am afraid I won’t find a job in my field because there are so many Env Sci graduates being pumped out of colleges and not enough related jobs to go around… so Env Engineering may be a better way to distinguish myself and find more of a niche in the environmental field. I’m just not sure I have the direction/drive/discipline it takes to do an entire Master’s thesis knowing I don’t plan to go into academia.",
          "author": "zippideedoodaa1640",
          "created": 1633663737,
          "upvotes": 1,
          "replies": {
            "hftaux7": {
              "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/hftaux7/",
              "text": "I'm not suggesting a thesis is better. I would discourage it if you don't want to do a PhD and at that if you do, apply to the PHD Directly and get funding/grants and live cheaply. \n\nAll I'm saying here is don't think further education equals better job or pay in engineering, usually it just means more time and more money.",
              "author": "Big_Faithlessness625",
              "created": 1633663940,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfvrjlj": {
      "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/hfvrjlj/",
      "text": "I'm not in grad school for engineering; I'm switching to public health. But I was a mechanical engineer for 14 years prior to this, and so I got to know plenty of engineers and how their career choices played out.\n\nEvery engineer I know who did a masters program admitted eventually that it was a waste of time and money. They didn't end up getting more significant of a position due to the masters, but they did miss out on a year of salary. No engineer I know skipped grad school and regretted it. Myself, I didn't do grad school for engineering, and it made no difference at all in my career. When I walked away from this, I was making $104k a year, and I live in flyover country, not some high class, high cost of living part of the country where that's a more standard salary. I did really well for myself with just an undergraduate degree.\n\nJust my two cents.",
      "author": "malachai926",
      "created": 1633716516,
      "upvotes": 1,
      "replies": {
        "hfvwr3l": {
          "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/hfvwr3l/",
          "text": "But the thing is, I don’t have the undergraduate engineering degree. My degree is in Environmental Science and only a minor in civil engineering. I guess the question is, is it worth it to go back to school for another bachelors but get it in Engineering? Or is it more worth it to go into a Master’s program that will allow me to catch up from a non-Engineering background?\n\nLike, it’s not like Engineering firms want me after I graduate, so I wouldn’t be missing out on an engineer’s salary in the year or two it would take me to complete a masters. I just feel so discouraged because I like environmental science but there are way too many recent grads in Env sci that got into their niche earlier and can go get the Env Sci jobs. The rest of the grads are left to…. Idk… outreach? academia? policy? None of which I am that interested in.",
          "author": "zippideedoodaa1640",
          "created": 1633718758,
          "upvotes": 1,
          "replies": {
            "hfy260o": {
              "link": "/r/GradSchool/comments/q3p6on/did_you_get_a_professional_engineering_msc/hfy260o/",
              "text": "If you want an actual learning environment, you're going to want to do it in person. Online MEng degrees are just a tick on a checklist. You took classes and did homework. You're not in a learning environment. You're not going to soak up the information. \n\nBut only do an MS of you're funded via GRA or GTA. Funding includes tuition and ~$26,000 /year. Nearly all people who go to grad school get funded unless you choose a school that only funds PhDs. Just avoid those few schools and you're fine.\n\nYou're going to want a MS over an MEng because you need Research engineering experience, since you didn't have the senior design / club / lab experience you would with a BS in engineering. It's really your only way to get the experience. In interviews they'll ask you about a time you did something technical, and you'll need the research experience to answer that.",
              "author": "Engineer_Noob",
              "created": 1633754931,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}