{
  "sid": "pq81d0",
  "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/",
  "title:": "Drug consumption and grad school",
  "text": "Anyone else facing heavy drug consumption/abuse during grad school ? Does it harm you ? Does it help you ?  On my case I’ve been consuming weed almost daily during my almost 2 years of PhD , and I’m afraid I might have been sluggish , stupid , lazy & unconcerned due to this drug and my level of consumptions . My drug intake increases when approaching deadlines and I have pulled out some miracles during doing high af all nighters , but at what cost I wonder .\n\nEdit: thanks everyone for your comments <3\nI did not expect such positive vibes and so many personal experiences . Really great full ! \nI want to mention that I also consume pills for ADHD and anxiolytics, so THC might be getting rough with those guys over there :)",
  "author": "Inevitable_Ad_133",
  "created": 1631910369,
  "over_18": false,
  "upvotes": 72,
  "upvote_ratio": 0.93,
  "comments": {
    "hdct6kc": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdct6kc/",
      "text": "I'm a 50-year-old Oregonian and almost every professional I know uses cannabis or cannabis products. While there are fields where it is still forbidden or stigmatized, they are few.",
      "author": "Weaselpanties",
      "created": 1631986704,
      "upvotes": 1,
      "replies": {}
    },
    "hdcjfg7": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdcjfg7/",
      "text": "When I'm very stressed, I do better work after some low grade edibles or 1 drink. It's also, unfortunately, very hard for me to stop there when I'm very stressed. During the beginning of the pandemic, I started drinking a lot more and had to intentionally cut down because being hungover in the morning and starting to crave a drink around lunch was affecting my work. \n\nNow, I sometimes have some weed or a drink if I'm working late, specifically when writing. If it gets the point where I have cravings during the day again, I'll stop. I don't think it makes me perform my best intellectually, but sometimes it's just a case of mediocre work being better than no work. \n\nBut everyone's different. I guess if you think you may be consuming too much or too often, you might be. Do you feel like you can cut down? Would anything get worse if you did?",
      "author": "RiskyCelery",
      "created": 1631982687,
      "upvotes": 2,
      "replies": {}
    },
    "hdc22r5": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc22r5/",
      "text": "For those who are cannabis users and want to talk about regulating/rightsizing their use (whatever you want to call it, lol) there is r/petioles\n\nFor those who are serious about quitting cannabis, r/leaves",
      "author": "--ikindahatereddit--",
      "created": 1631975053,
      "upvotes": 2,
      "replies": {}
    },
    "hdbryul": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbryul/",
      "text": "I'm a near daily cannabis user, helps with anxiety and costs a hell of a lot less with significantly less side effects of commonly prescribed antianxiety meds. I'm on the spectrum, so I tend to hyper fixate on things like research that seem like and endless chasm. If I fix these lines of code. If I spend a few extra hours in front of the microscope, well then I will solve the problem and can stop. But that's not how it ever turns out, and I end up burning myself out.\n\nSo I smoke a bit and relax, that guilt goes away, and I can be with my partner, friends, or just myself and be able to enjoy that and be in the moment.",
      "author": "Outmodeduser",
      "created": 1631969911,
      "upvotes": 2,
      "replies": {}
    },
    "hdbrb76": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbrb76/",
      "text": "It was good and helpful at first, but became a crutch and an addiction.\n\nI would miss deadlines, I became apathetic, the brain fog built up and I just wasn’t sharp anymore. Being a little high strung and slightly anxious is what helps me succeed, I guess? So I had to find better ways to manage that balance.\n\n*obligatory this isn’t true for everyone and I know that comment*",
      "author": "franklikethehotdog",
      "created": 1631969546,
      "upvotes": 3,
      "replies": {}
    },
    "hdbopoc": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbopoc/",
      "text": "I mean I stopped smoking when I graduated high school for just this reason. For context, I got a sub 3.0 GPA in hs, got a nearly 4.0 in college with 4 publications and ended up at a top university for my program for my PhD.\n\nObviously I also just grew up a bit. But I’m never smoking weed again if that helps at all. \n\n[not saying you can’t be super productive while doing it. I just feel better and have a better time spending my afternoons doing other things]",
      "author": "gentleboys",
      "created": 1631968073,
      "upvotes": 1,
      "replies": {}
    },
    "hdbnkk2": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbnkk2/",
      "text": "Why do you choose to do it so often?",
      "author": "RipVanWinter",
      "created": 1631967381,
      "upvotes": 1,
      "replies": {}
    },
    "hdbkg4m": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbkg4m/",
      "text": "I used cannabis heavily throughout grad school. The last two years I got into MDMA too (just on special occasions).\n\nNo regrets.",
      "author": "arcadiangenesis",
      "created": 1631965413,
      "upvotes": 2,
      "replies": {}
    },
    "hdbkasb": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbkasb/",
      "text": "I mean, yeah, you probably have been sluggish, stupid, lazy & unconcerned during those 2 years.\n\nTo be fair, many grad students hit periods of time where they’re sluggish, stupid, lazy & unconcerned.\n\nAll that matters is the end result and getting your first job.  If you think it’s going to inhibit those, I’d probably try to pull out of it at least a little.  No point in being in school if you’re not going to be able to graduate and get a good job on the other side.",
      "author": "Weekly-Ad353",
      "created": 1631965315,
      "upvotes": 0,
      "replies": {}
    },
    "hdbg9bo": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbg9bo/",
      "text": "I started doing drugs in grad school mainly bc of the pandemic!! Harder drugs made excelling at school more difficult but I pulled through! Just be careful — substance abuse is a hard habit to kick",
      "author": "TacoSluuut",
      "created": 1631962404,
      "upvotes": 1,
      "replies": {}
    },
    "hdbftes": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbftes/",
      "text": "I smoke weed but I don't drink. Granted, I don't stone myself to death. I 100% prefer weed over alcohol. Since I started smoking weed, alcohol disgusts me. Also I use it to relieve cramps, to reward myself after a writing session, etc. It all depends on how much weed, and the strain of weed, that you use to roll your joint. There was a strain of weed that made me super focused on reading and writing. You can abuse pretty much anything, from food to weed, it's all a balancing act.",
      "author": "Normal_Kaleidoscope",
      "created": 1631962058,
      "upvotes": 2,
      "replies": {
        "hdc1bbt": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc1bbt/",
          "text": "This. I would be much more concerned about myself if I drink alcohol even 2 to 3 times a week. for me alcohol is like once maybe every 4 to 6 weeks.",
          "author": "--ikindahatereddit--",
          "created": 1631974689,
          "upvotes": 2,
          "replies": {
            "hdc7ys3": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc7ys3/",
              "text": "Also, I've often seen alcohol at department events. I drink very rarely, but why frown upon weed when alcohol is so much more disruptive? Academia is so weird sometimes.",
              "author": "Normal_Kaleidoscope",
              "created": 1631977754,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hdbfnna": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbfnna/",
      "text": "I’ve been drinking 6-12 beers 4 nights a week since the pandemic began.",
      "author": "lazerlass",
      "created": 1631961931,
      "upvotes": 1,
      "replies": {
        "hdbpw5u": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbpw5u/",
          "text": "Please don't.",
          "author": "RipVanWinter",
          "created": 1631968757,
          "upvotes": 2,
          "replies": {
            "hdd82c2": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdd82c2/",
              "text": "I am getting better but one night a month I will slip up and do it again. Luckily, I never leave the house.",
              "author": "lazerlass",
              "created": 1631992812,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hdc1cfm": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc1cfm/",
          "text": "Sounds like you have a lot going on?",
          "author": "--ikindahatereddit--",
          "created": 1631974703,
          "upvotes": 1,
          "replies": {
            "hdd8656": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdd8656/",
              "text": "Haha, yeah. It’s hard to pass up a good opportunity. But I am stretching myself thin.",
              "author": "lazerlass",
              "created": 1631992856,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdbc8xq": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbc8xq/",
      "text": "I did zero drugs during grad schooo, and I earned a 4.0",
      "author": "False-Hat",
      "created": 1631959115,
      "upvotes": -1,
      "replies": {}
    },
    "hdb9yzk": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdb9yzk/",
      "text": "After pretty heavy use in college, I smoked pot every day for about 2.5 years of my PhD - primarily for anxiety relief, because I hated the side effects of SSRIs. That mind sluggishness that comes the day after smoking a shitlload REALLY helped with my racing thoughts and hyperactive brain. I also smoked for relaxation and to cope with the daily struggle of PhD life (it was also a ton of fun initially). It got to the point where it began to severely affect my quality of sleep and mental health, which resulted in my quality of work declining significantly. I stopped smoking and started seeing a therapist bi weekly and psychiatrist, where I was prescribed some new drugs that ended up working better than anything I've ever taken.\n\nApproaching the end of my PhD, I ended up getting a sweet job offer for a national lab in US. After submission and consideration of my SF86  (document for security clearance) post defense, the offer was rescinded due to my prior extensive use. \n\n\nQuick digression - if you have any desire to do anything defense related or where clearance is required, stop using pot immediately. The federal government gives ZERO fucks that it's legal in your state (sadly). The system is EXTREMELY antiquated. My pot use is a problem, but motherfuckers get hammered and make stupid decisions and get clearances... A drunk would definitely be a bigger threat to security then a recreational pot user- End digression\n\nAll that being said, I enjoyed my time with that sweet, sweet devil's lettuce. A ton of fun. We've had great times. Listened to some great music. Watched some amazing television. Experienced some extremely sketchy situations. I will say though that after almost a year of not getting stoned, I feel so much clearer, aware, and motivated.",
      "author": "doooooiiitttt",
      "created": 1631957118,
      "upvotes": 4,
      "replies": {
        "hdc37uq": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc37uq/",
          "text": "If I may ask what might be a naive question, how exactly did the extensive drug use show up? This is me assuming you spent about 4-5 years on your PhD. Was it through an extensive background clearance or did you volunteer the information?",
          "author": "Oluwa5eun",
          "created": 1631975593,
          "upvotes": 2,
          "replies": {
            "hddgtjo": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hddgtjo/",
              "text": "I was applying for a top secret clearance. In the sf86, very specific questions are asked, including history of drug and alcohol use. The federal government will actually send federal agents to speak with your family and your friends to verify the specifics you put on this form. \n\n\nSo I gladly listed the information on the sf86 for two reasons:\n\n1. The consequences of lying to the federal government. Lying can result in jail time and/or fines. With this, you will have a felony on your record, which may result in challenges with finding another job. The feds aren't dumb - they will ask appropriate questions to the right people. All it takes is one fuck up from one person, whether it be family or friend.\n\n2. Integrity is huge for me. Lying makes me feel disgusting, and absolutely consumes my mind. Especially as someone who suffers from intense anxiety.\n\nThe consequences alone make lying not worth it. If you want a job with the feds, I would recommend abstaining from drug use for more than a year to prevent any hiccups.",
              "author": "doooooiiitttt",
              "created": 1631996417,
              "upvotes": 2,
              "replies": {}
            },
            "hdcx74b": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdcx74b/",
              "text": "Also curious about this, commenting to get notification if answered.",
              "author": "greynecessities",
              "created": 1631988354,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdasmfk": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdasmfk/",
      "text": "Get diagnosed ADHD that will help had no idea I was but it's.common to use weed to medicate also to use it to medicate the hell out of grad school and after",
      "author": "anon1_mouse_stache10",
      "created": 1631942973,
      "upvotes": 2,
      "replies": {}
    },
    "hdapsxs": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdapsxs/",
      "text": "I'm trying to cut alcohol consumption and only take it when the reviews come back. When it's bad I'd usually finish a bottle of whiskey. I'd like to think that it's on reviewer#2's tab.",
      "author": "GoofyMaximus",
      "created": 1631941047,
      "upvotes": 1,
      "replies": {}
    },
    "hdan3k7": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdan3k7/",
      "text": "This isn’t an issue for me, but only because I decided years ago that drugs/alcohol would turn too easily into a coping mechanism for me and I stopped drinking alcohol altogether. But I can assure you, you’re definitely not alone.\n\nI’m an older student and now that I’m back in grad school, it’s kind of jolting how much my classmates talk about using alcohol or drugs to cope with ‘stress’. They mention it at least once in every conversation we have together, like it’s a given that grad students turn to substances to cope. The crazy thing is that most times it seems they only need them to cope with anxiety related to their procrastination habits, and not the work itself.\n\nIn truth, whether it’s an issue all depends on the substance and what you’re getting out of it. If you’re using CBD oil every now and then to manage anxiety, that’s one thing. If you’re consuming weed to the point that you think you’re high every time you go to class or complete an assignment, that’s definitely a concern. It sounds like you also have an issue with procrastination. It might be worth looking at how your marijuana use might be contributing to that. Procrastination amps up anxiety and stress by 100 easily, meaning all of that stress and anxiety can be avoided in another way. Alcohol is another beast. I won’t even go into it.\n\nWhat helps you manage your anxiety and task levels day-to-day? And more importantly, what can you do in your daily life that *prevents stress from happening* in the first place? \n\nFor me, it’s keeping my space (home and office) tidy and clean by doing a little cleaning every day, setting aside time to spend/play with my family, planning what I need to get done week to week ahead of each minor and major assignment, eating healthy (most of the time), exercise, and trying to limit interruptions while I work. I don’t always do these things, but I’ve been able to ingrain them into my life enough that they usually pick back up again quickly.\n\nTLDR, no you aren’t the only one. But it’s worth picturing how your life (and what you’re getting out of you’re degree) would be like without weed. Is weed helping you become the person you want to be? Is it helping you to prevent sources of stress (not just manage them)?",
      "author": "FakinItAndMakinIt",
      "created": 1631939267,
      "upvotes": 10,
      "replies": {
        "hdcwrvs": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdcwrvs/",
          "text": "“The crazy thing is that most times it seems they only need them to cope with anxiety related to their procrastination habits, and not the work itself.”\n\nThis is such a good observation. I’ve been finding that if I limit how self-conscious/guilty I feel about smoking I am less likely to get anxious enough to procrastinate/smoke to soothe anxiety. Then it’s just for fun as I colour and doodle in the eves to chill out. :)",
          "author": "greynecessities",
          "created": 1631988182,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdafsbp": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdafsbp/",
      "text": "Yeah I definitely abused weed during my second year especially since lockdown started, have been constantly high, but still getting results somehow. Also used other substance more sporadically, I wouldn’t consider those a problem,  but weed I definitely abused. It actually ended up exacerbating my anxiety badly, so I quit and have now been completely sober  for a couple of months (yes, no caffeine either)",
      "author": "obinaut",
      "created": 1631934958,
      "upvotes": 4,
      "replies": {}
    },
    "hdadptc": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdadptc/",
      "text": "Covid is probably part of the problem too.\n\nThis comments section is so validating. You should probably cut down a bit if you are concerned. I am practically in the same shoes (finishing undergrad high as a kite, and not getting less high in grad school.) However I was using it as a way to cope with insufficient social stimuli for the last year. I used my holidays to cut down the usage and am going to try using in a limited fashion, and changing things in my life instead.\n\nKeep strong, and never blame weed, it's awesome. Its just that MAYBE you don't relate to it in a healthy way.",
      "author": "rehrev",
      "created": 1631933859,
      "upvotes": 9,
      "replies": {}
    },
    "hdacxvc": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdacxvc/",
      "text": "Yes, nearly dropped out from substance abuse. I found myself not being able to sit down and work without booze next to me. I took time off to get better before starting school again.",
      "author": "pixlkiss",
      "created": 1631933450,
      "upvotes": 5,
      "replies": {
        "hdc1nvb": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc1nvb/",
          "text": "Glad to hear you are doing better 🙌🏾",
          "author": "--ikindahatereddit--",
          "created": 1631974857,
          "upvotes": 2,
          "replies": {
            "hdj1hlp": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdj1hlp/",
              "text": "Thank you! Much better!",
              "author": "pixlkiss",
              "created": 1632095350,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hdac1b1": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdac1b1/",
      "text": "By my fourth semester I was drinking so much and consuming so much caffeine I had 2 trips to the ER",
      "author": "biscuitman76",
      "created": 1631932984,
      "upvotes": 1,
      "replies": {}
    },
    "hda3pwv": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda3pwv/",
      "text": "From my junior year of undergrad up until I finished masters, I was stoned a few times every week at a minimum. The trick is to just finish all your work for that day before partaking. It worked out just fine and I studied engineering. Just gotta be responsible with how you use it",
      "author": "legendofzelda13",
      "created": 1631928707,
      "upvotes": 16,
      "replies": {
        "hda3z47": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda3z47/",
          "text": "One of my problem is that I often smoke during work hours , that usually gets me off schedule",
          "author": "Inevitable_Ad_133",
          "created": 1631928836,
          "upvotes": 6,
          "replies": {
            "hda4knp": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda4knp/",
              "text": "I can definitely see how that would become a problem. I would strongly suggest trying to keep it recreational. The few times I smoked when I really should have been sober were pretty stressful. I always sort of thought of it as a reward for getting my shit done. I people smoke for different reasons though of course and it's not always quite that simple.",
              "author": "legendofzelda13",
              "created": 1631929144,
              "upvotes": 13,
              "replies": {}
            },
            "hdbtomq": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbtomq/",
              "text": "Even as someone who used to smoke it daily during undergrad/early parts of grad, I would never have recommended using it during work hours. Finish your work for the day, then partake. Its effects are not usually very beneficial for getting work done and being focused and productive.",
              "author": "ArnieAndTheWaves",
              "created": 1631970835,
              "upvotes": 7,
              "replies": {}
            },
            "hdc0448": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc0448/",
              "text": "I had this issue to when I was in grad school and sometimes I would die laughing the next morning when sober me saw what high me wrote. I think it’s all about finding the right balance for yourself and being gentle with yourself on days where you partake before you finish your work. Cause this shit ain’t easy!! But all in all, I found weed to be very helpful for me while I was in grad school/finishing grad school in a pandemic. I got my MPH with a 3.7 GPA and smoked daily!",
              "author": "mrscohenplease",
              "created": 1631974099,
              "upvotes": 2,
              "replies": {}
            },
            "hdc1vmc": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc1vmc/",
              "text": "Do you find that it helps to get you ready for work? Is the day so stressful that you reach for it to calm down? I’m just wondering if there’s any adjustments that can help you move it to a time when you’re done with everything",
              "author": "--ikindahatereddit--",
              "created": 1631974959,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hdc1pwj": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc1pwj/",
          "text": "This is my MO.",
          "author": "--ikindahatereddit--",
          "created": 1631974883,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hda0v8y": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda0v8y/",
      "text": "Definitely higher alcohol consumption, and since moving to a state where it’s recreationally legal, I started smoking weed regularly. I didn’t seek it out in undergrad, but if offered I usually wouldn’t say no. \n\nThese days I’m actually nearly a month sober from weed - it threw me into depression when I wasn’t on it and made life and work absolutely miserable. I shit you not, I was barely functional while that was occurring. I’m still trying to decipher my notes from those weeks (I do wet lab and rodent stuff, so notes are VERY important to keep track of lineage etc.)\n\nWould not recommend doing weed every single day.",
      "author": "TheWiseGrasshopper",
      "created": 1631927253,
      "upvotes": 3,
      "replies": {}
    },
    "hda0a28": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda0a28/",
      "text": "Heavy drug use will harm you. It's fine to use weed/alcohol/etc, but if you're using daily and worried about how it's impacting your life and work, you're probably using too much too often.",
      "author": "mediocre-spice",
      "created": 1631926956,
      "upvotes": 3,
      "replies": {}
    },
    "hd9u34j": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9u34j/",
      "text": "Idk but smoking weed got me this far I don't know if stopping now would be good. Learn to control when you smoke weed. Push through, get more caffeine. It's got it's downsides but every drug does. \n\n\nFor me, it evens out the caffeine. I don't drink alcohol anymore because I'm an alcoholic. I'm also just a lowly masters student but I did last 2 years in undergrad with a 3.9 and high as hell because I was so bored and 'ovrr it'. Hopefully this job will help me cut down on consumption, but I mean I know what drug doesn't work for me : it's alcohol. \n\nIt fucks my life up. I've accepted I'll likely abuse a substance because I go hard, so I must do these silly things like pack tiny capsules in my volcano, not a big bowl (if I got stuff to do). I also definitely refuse to work full time and do school full time. There's benefits, there's downsides. It's just life. Shit breaks; people die.\n\n\nEdit: formatting",
      "author": "Anarchy_Lurker",
      "created": 1631923849,
      "upvotes": 29,
      "replies": {
        "hdboe41": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdboe41/",
          "text": "The volcano is a great invention. Personally I've quit everything except caffeine, but I still can't deny the sheer elegance of that device. Great for passing around too, at least it was before the days of COVID-19. In the stoner/gamer house I inhabited during undergrad, we used to walk around handing the bag to one another all day... \n\nI don't miss that life, but I always remember how great that device is compared to every other method.",
          "author": "RipVanWinter",
          "created": 1631967882,
          "upvotes": 6,
          "replies": {
            "hdby0ns": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdby0ns/",
              "text": "as a weed smoker: would you say not indulging is a sign of subjective maturity? just curious",
              "author": "apeekintonothing",
              "created": 1631973057,
              "upvotes": 3,
              "replies": {
                "hdc0oea": {
                  "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc0oea/",
                  "text": "I don't know. I only know that I smoked compulsively for years, to the point that it had a negative effect on my life. I would even do it when I knew that I would regret it.\n\nI was addicted, and now I'm not. I don't know what maturity is exactly.\n\nSeveral factors helped me escape the addiction. I became more concerned about the unknown long-term physical and mental effects, instead of just rationalizing it as \"just weed bro.\" I also started weekly talk therapy to deal with other issues, not my addiction directly. But therapy helped me become more aware of my own patterns, and the various lies I would tell myself.\n\nStill, despite those factors, I relapsed repeatedly. I don't mean the occasional slip-up, I mean falling back into full-blown every-waking-hour THC consumption. The one thing that finally allowed me to break free for good was a simple realization: that weed doesn't do what I thought it does. **It doesn't expand my consciousness.** At least, not when I do it all the time.\n\nThe thing that kept me coming back to weed was not the desire to chill out and go to sleep, because weed never effected me that way. It was the desire for a mild *psychedelic* experience. I thought that weed made the colors brighter and music more beautiful. I thought that it stimulated my creativity, and allowed me to step outside myself and see reality more objectively. Because that's what it used to feel like when I was a teenager. But now, I realize that it actually does the opposite when you use it compulsively, excessively. I feel so much more alive than I did during the eight years that I was addicted.\n\nThanks for your question. I'm probably going to copy and paste this comment into its own post on /r/leaves now.",
                  "author": "RipVanWinter",
                  "created": 1631974377,
                  "upvotes": 3,
                  "replies": {
                    "hdcmi8q": {
                      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdcmi8q/",
                      "text": "tysm for the thoughtful response",
                      "author": "apeekintonothing",
                      "created": 1631983956,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "hdc0pl2": {
                      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc0pl2/",
                      "text": "Here's a sneak peek of /r/leaves using the [top posts](https://np.reddit.com/r/leaves/top/?sort=top&t=year) of the year!\n\n\\#1: [4 years ago I told my dealer not to sell to me ever again.He said are you sure? Once I black list you there no going back I said yes And paid him the money I owed after he fronted me a ounce . Haven't talk to him since .So I called him...](https://np.reddit.com/r/leaves/comments/lc2rnd/4_years_ago_i_told_my_dealer_not_to_sell_to_me/)  \n\\#2: [I found weed, I rolled a joint](https://np.reddit.com/r/leaves/comments/kcq8f9/i_found_weed_i_rolled_a_joint/)  \n\\#3: [Everything I wanted from weed I’ve found in sobriety](https://np.reddit.com/r/leaves/comments/kp8o6r/everything_i_wanted_from_weed_ive_found_in/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/)",
                      "author": "sneakpeekbot",
                      "created": 1631974392,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hdc0cs4": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc0cs4/",
          "text": "You are not a ‘lowly’ masters student. And congrats on your GPA. Nice job. \n\nI restrict my Mighty use to evenings, sometimes late afternoons on the weekends. During the week it’s maybe two bowls at night. Double on the weekends. \n\nStuff does absolutely break. People do absolutely die. Life is, I don’t even know what life is these days. Wonderful, a complete mess, shit, all of it.\n\nSubstances are weird. It is important to know how to sort of keep cannabis use in its spot during the day, during my life, I guess. \n\nJust wanted to say I hear you.",
          "author": "--ikindahatereddit--",
          "created": 1631974218,
          "upvotes": 1,
          "replies": {
            "hdd6x7i": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdd6x7i/",
              "text": "Thank you for this thoughtful comment. I meant lowly masters student because I am having a hard enough time figuring out a thesis topic for this whole degree - I couldn't imagine if it had to be original research",
              "author": "Anarchy_Lurker",
              "created": 1631992344,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hd9rzx5": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9rzx5/",
      "text": "My alcohol, ketamine, adderall (not all together) consumption has gone through the roof during grad school. Been able to tone things back so far this semester but the last year and a half has been pretty shit barely scraping by",
      "author": "LiveNDiiirect",
      "created": 1631922825,
      "upvotes": 10,
      "replies": {
        "hda06tg": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda06tg/",
          "text": "Serious question: where does one find ketamine these days? (Check my account history if you honestly think I’m a narc… I’m not.)",
          "author": "TheWiseGrasshopper",
          "created": 1631926911,
          "upvotes": 4,
          "replies": {
            "hda0qhz": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda0qhz/",
              "text": "Uh just know a guy who knows a guy",
              "author": "LiveNDiiirect",
              "created": 1631927186,
              "upvotes": 3,
              "replies": {
                "hdaaaca": {
                  "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdaaaca/",
                  "text": "Could also just say “darknet” lol",
                  "author": "TheWiseGrasshopper",
                  "created": 1631932072,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hd9qbdw": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9qbdw/",
      "text": "I don’t see anything wrong with occasional recreational drug use, but if you need to self-medicate daily, you’d be better off in the long-run getting some professional help to address whatever it is you’re trying to escape from.",
      "author": "HouseNegative9428",
      "created": 1631922012,
      "upvotes": 14,
      "replies": {}
    },
    "hd9olh0": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9olh0/",
      "text": "In the long run, it's probably not great for you. If you ever have major surgery, prolonged used of weed (or alcohol, most harder drugs) makes you more difficult to sedate. If you choose conscious sedation, then you're much more likely to remember shit and feel what they're doing. It tends to be more stressful for the nurses too, because your vitals can become less stable the more sedatives (usually a benzo+fentanyl) they have to give you.\n\nTLDR it wouldn't hurt to cut back in the long run",
      "author": "Carl_Dubya",
      "created": 1631921194,
      "upvotes": 10,
      "replies": {}
    },
    "hd9nmys": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9nmys/",
      "text": "Would you consider giving high strength CBD weed/hash a go? Great body high, negligible psychoactive effects.",
      "author": "Shitlivesforever",
      "created": 1631920740,
      "upvotes": 1,
      "replies": {
        "hd9oiv8": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9oiv8/",
          "text": "I would , but in my third world country it’s not easy to find such stuff . You just either find good weed (indoor) or bad weed ( god knows what’s in there )",
          "author": "Inevitable_Ad_133",
          "created": 1631921159,
          "upvotes": 1,
          "replies": {
            "hd9q3pw": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9q3pw/",
              "text": "Right, that's fair enough. Is CBD legal where you are?",
              "author": "Shitlivesforever",
              "created": 1631921909,
              "upvotes": 1,
              "replies": {
                "hd9w8ub": {
                  "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9w8ub/",
                  "text": "The drug laws are not so clear and stablished here . Weed is not legal but consumption is so high that most people don’t care , unless you have a huge plantation or a huge indoor and you are selling . Selling and buying are more penalized than consumption . So yeah , I might be missing something but I don’t know of anyone buying pure CBD here",
                  "author": "Inevitable_Ad_133",
                  "created": 1631924927,
                  "upvotes": 1,
                  "replies": {
                    "hd9xdjy": {
                      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9xdjy/",
                      "text": "There are many vendors selling online that ship internationally, though maybe the cost would be high compared to local prices for weed where you are.\n\nGrowing magic mushrooms at home is another option, it's relatively cheap. Microdosing has been very beneficial for my health. \n\nI hope you find a solution that suits you, and good luck with your studies.",
                      "author": "Shitlivesforever",
                      "created": 1631925492,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hd9hguh": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9hguh/",
      "text": "Substance abuse is an integral part of the graduate experience CMV :\\^)",
      "author": "seikuu",
      "created": 1631917814,
      "upvotes": 41,
      "replies": {
        "hd9vxu3": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9vxu3/",
          "text": "What does CMV stand for ?",
          "author": "Inevitable_Ad_133",
          "created": 1631924774,
          "upvotes": 3,
          "replies": {
            "hdb06vi": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdb06vi/",
              "text": "It's cytomegalovirus in my field.",
              "author": "baenpb",
              "created": 1631948762,
              "upvotes": 9,
              "replies": {}
            },
            "hda1s2c": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hda1s2c/",
              "text": "\"Change my view.\"\n\nThere's a sub for that: r/changemyview.",
              "author": "gobucks314",
              "created": 1631927721,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hd9dknf": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9dknf/",
      "text": "I began using cannabis during the lockdown/2nd year. I use it most days to help me sleep, and I have used it for focusing/writing papers, to positive effect. I’m older, not a typical student.\n\nEdit to add: I feel like I’m supposed to be ashamed of it or something. I’m in a legal recreational state. I remember posting something about cannabis use along academics and I got what felt like the cold shoulder.",
      "author": "--ikindahatereddit--",
      "created": 1631915997,
      "upvotes": 46,
      "replies": {
        "hd9jnyf": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9jnyf/",
          "text": "That's pretty strange to me in 2021. I had my first edible on a weekend about a month ago, being nearly 30 and having never been not sober before, and the first thing I said on Monday when I got to the lab was \"So I had an edible this weekend\" and got either a positive or neutral reaction. Maybe there's a lot of lab/department/university variation there, but in my experience, I can't think of many labs at my university where it's be a big issue. Also, if it's of note, at an R01 in US doing cognitive neuroscience research.\n\nEdit: point isn't to invalidate your experience. I just mean don't be ashamed. It's probably just  stupid people being stupid.",
          "author": "DonHedger",
          "created": 1631918861,
          "upvotes": 17,
          "replies": {
            "hdbsyi8": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbsyi8/",
              "text": "I had a brilliant physics professor who taught my gravitation and spacetime class. One of the students asked if he had any plans for 4/20 and he winked and said he wasn't going to say whether he did or not lol. I live in a state where it's been decriminalized but it's not fully legal yet",
              "author": "saor_alba17",
              "created": 1631970445,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "hdb29l8": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdb29l8/",
          "text": "I’d much rather get high all the time than drink all the time. My liver thanks me. My lungs not so much but that’s why I exercise ALOT",
          "author": "7empest-tost",
          "created": 1631950507,
          "upvotes": 6,
          "replies": {}
        },
        "hdbonzq": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbonzq/",
          "text": "It's still frowned upon in many fields because of their close association with federal funding sources and many departments view themselves as a PhD to DOE (or DOD or DARPA or god save your soul, ICE/DHS/NSA) pipeline. Meaning, if you work security adjacent or Federal adjacent, smoking weed is considered a career no-no. Hell, my friend at NASA got a letter saying \"Hey weed might be state legal but its federally not so don't smoke weed.\"\n\nSo yeah, you can engineer hypervelocity weapons which turn people into red paste, simulate new atomic weapons to annihilate people 10% more efficiently, or create AI tools which aid the panopticon of agencies keeping tabs on people. But don't you DARE smoke a joint.\n\nThat's wrong.",
          "author": "Outmodeduser",
          "created": 1631968045,
          "upvotes": 5,
          "replies": {}
        },
        "hdbfxqj": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdbfxqj/",
          "text": "Why ashamed though? All of my younger colleagues smoke. And sometimes, older ones too! Some people like a glass of red 🍷, other people like smoking a joint.",
          "author": "Normal_Kaleidoscope",
          "created": 1631962152,
          "upvotes": 4,
          "replies": {
            "hdc2u0n": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc2u0n/",
              "text": "Honestly it’s probably my fundamentalist Christian upbringing that I can’t shake. Also, born and raised in the Midwestern US which is all piety crap. And I am throwing around the words fundamentalist, Christian, and piety, as a person who has a couple of degrees in theology.\n\nI also have a history of people standing outside of my life, having no idea what I’m going through, and then telling me what they think I need to do, and walking away is if they have done something of consequence or importance, or done something helpful for me.\n\nEdit to fix a lot of typos made while voice typing",
              "author": "--ikindahatereddit--",
              "created": 1631975414,
              "upvotes": 3,
              "replies": {}
            },
            "hdc39m6": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc39m6/",
              "text": "Maybe it’s generational. I’m 50.",
              "author": "--ikindahatereddit--",
              "created": 1631975615,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hdc10ej": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc10ej/",
          "text": "For the haters: (edit, I know that it’s a little combative to come off with that greeting when I have 47 upvotes , sorry - I feel a little misunderstood and defensive. I admit that)\n\nIt is just killing me how many people elsewhere in this thread are talking about low motivation, laziness, addiction, etc. But nobody is talking about millions of people dead worldwide, C-PTSD, racial and genocidal trauma, intersectionality, climate collapse, economic collapse, or just the fucking stress of academia’s constant bullshit when you’re trying to get an advanced degree. Not to mention difficulty maintaining friendships and romantic relationships if you happen to be lucky enough to have them. I don’t have many at all. \n\nI’m not asking for advice. Don’t tell me to get therapy. I’ve I had a dozen therapists over the past 30 years, I’ve been on three different RX is. If my cannabis use bothers you enough for you to try to tell me what to do, go look in the mirror.\n\nI share my experience here because I know I’m not the only one having it. If anyone else feels the way I do, they are tired of and actually harmed by overblown morality, toxic positivity and easy answers bullshit.",
          "author": "--ikindahatereddit--",
          "created": 1631974540,
          "upvotes": 4,
          "replies": {}
        },
        "hd9i8g4": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd9i8g4/",
          "text": "I get you , cannabis is kind of polarizing in my opinion . It’s either drugs are bad you junkie or weed is good for you wym. It works different on different people and depends on your consumption levels",
          "author": "Inevitable_Ad_133",
          "created": 1631918176,
          "upvotes": 4,
          "replies": {
            "hdc361l": {
              "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hdc361l/",
              "text": "Right",
              "author": "--ikindahatereddit--",
              "created": 1631975570,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hd98zk7": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd98zk7/",
      "text": "Definitely have experienced a higher alcohol intake than normal since being in grad school.",
      "author": "chemistrybae",
      "created": 1631913939,
      "upvotes": 57,
      "replies": {}
    },
    "hd937ak": {
      "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd937ak/",
      "text": "Is this Frank Ocean’s alt account?",
      "author": "FlyAnHourOrWalkAWeek",
      "created": 1631911395,
      "upvotes": 18,
      "replies": {
        "hd93hx9": {
          "link": "/r/GradSchool/comments/pq81d0/drug_consumption_and_grad_school/hd93hx9/",
          "text": "xD I just really like that song , and that part hits me hard ( prolly cause I always listen to it while stoned )",
          "author": "Inevitable_Ad_133",
          "created": 1631911522,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064985
}