{
  "sid": "qcdpii",
  "link": "/r/GradSchool/comments/qcdpii/uk_help_with_the_stick_it_out_or_leave_decision/",
  "title:": "(UK) Help with the stick it out or leave decision",
  "text": "Background: I am 4.5 years into a 4 year physics/material science doctorate. I got some extra funding because of COVID, did 2 months unfunded and then took 4 months off. I came back from that 4 months into a job in a mainly unrelated field (software developer for a science team) I am starting on 3 days a week with the plan to use 3 more for finishing my degree. Good financial situation, no need to worry about that.\n\nSupervisor: Can't say we have ever got on but I wish him well. A couple of problems with supervision such as hundreds of miles away and generally don't trust him with good decision making for me. Has used the phrase: \"you'll never speak of that idea again!\". \"That\" then became half of my degree work (micro vent). Can't help but think based on my friends experiences (both his students, who systemically submit late and other supervisors students) that I would either be done by now or kicked off with a different supervisor. Retiring soon (few months).\n\nCurrent situation: I like the job and I'm more of a 4 day a week than a 6 day a week person (aren't we all) so want to leave the EngD. Basically have no motivation/bounce off any EngD work because it's unrelated to my future career and no one cares about it at all. My experiments are done, but I can't see a finish line, as I've only really written one chapter of (8?), and still have code work to do, then said code has to be tested, used and written up. My only concerns with leaving are possible pay reductions in future careers because of no Dr title. Never cared about doing a doctorate, was offered it for the same pay as a job I applied for.\n\nFinal notes: I don't regret doing it for one moment, looked after myself for the first time in my life and had a generally amazing time outside of work and learned a lot during the degree. Learned about myself, project management, dealing with others and feel very confident to work independently. Have already found myself taking initiative at work and charge of situations that definitely wouldn't have been the case beforehand. Time well spent.\n\nAdvice request?: I'm not infallible, have I missed some reason to stay? **Do I stick it out or do I go?**\n\nPs. Never mentioned this before on the internet but also am a sufferer of trichotillomania and it's generally much worse when thinking about/doing EngD stuff. This is its own issue to sort out, but causes a shit ton of negative feelings and I didn't have any problems in the 4 months I took off :D",
  "author": "CRBN_hoops",
  "created": 1634771776,
  "updated": 1634849804,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {}
}