{
  "sid": "r1m2fk",
  "link": "/r/GradSchool/comments/r1m2fk/austin_bound_mccombs_in_the_future/",
  "title:": "Austin bound... McCombs in the future?",
  "text": "Hey yall it's my first time on this sub and I wanted to ask the grad wizards of Reddit about their thoughts on my chances of getting into grad school. It isn't part of my plans right now but I want to gauge how difficult this would be a couple of years in the future.\n\nI am in my senior year at Purdue University's Engineering Program, I have an engineering role at Amazon, based in Austin, and have internships at Apple, Tesla, and Anthem. I got 1480 on my SAT without studying I'm hoping if I prep I could get a good GRE score. HOWEVER, my GPA is going to be between 2.8 and 3.0 (under the requirement). I adjusted poorly my freshman year, covid started my second (and I took half the year off to work at Tesla), I adjusted poorly to remote school junior year (and focused too much on getting work experience), and my classes right now are definitely not GPA boosters.\n\nThat being said I saw on the UT Austin site that they are open to candidates explaining how their GPA doesn't measure their ability. I feel this applies to me but is the GPA too fucked up anyway? :(\n\nTLDR: I want to get into McCombs Schools of Business in a couple of years. Good work experience, good undergraduate school (#2 in the nation for IE), good standardized testing skills, really shit GPA. Thoughts?",
  "author": "KondorKid",
  "created": 1637808627,
  "updated": 1638208025,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hm00qfp": {
      "link": "/r/GradSchool/comments/r1m2fk/austin_bound_mccombs_in_the_future/hm00qfp/",
      "text": "Let them decide whether it’s good enough. Don’t decide for them.  Admittedly, you’re GPA is not great.  I’d be curious what the requirement is.  But the reasons you’ve cited will provide meaningful insight.  The program has said that they will take these factors into consideration.  Give them a chance to do that and see what comes of it.   \n\nOne thing I would mention is that while these are very reasonable contributing factors that explain your prior performance you wIll need to reassure them that they will not affect your future performance.  What have you learned about yourself?  How would you manage these types of challenges in the future?  In other words, why should they not think that something similar won’t happen to you again while you’re in their program?",
      "author": "DicaxErsatz",
      "created": 1637817654,
      "upvotes": 1,
      "replies": {}
    }
  }
}