{"sid": "pjokpn", "link": "/r/GradSchool/comments/pjokpn/rewriting_my_own_text_of_the_thesis/", "title:": "Rewriting my own text of the thesis", "text": "Hi grad school ppl!\nI have a very moronic task of re-writing my own text of the thesis. Has anyone faced such a problem before? Is there maybe a way to solve it without torturing my mind?\nThe issue is that before submitting my thesis, its text body has to be checked for plagiarism by some program (I think it's quite a common practice nowadays). What makes it ridiculous is that I have several first-author publications, which basically constitute most of my thesis, and some phrases and sentences from there simply can't be avoided or reformulated. If I don't, the plagiarism detector will determine a low % of text originality, and no one GAF that the author of the source of material is myself.\nHow do you deal with this crap efficiently? I've started to re-write it and already dread the process. The original text was nicely polished, and because now I have to actively avoid it, this shit looks horrible.", "author": "th3REDpriestess", "created": 1631026307, "retrieved": 1632844730, "over_18": false, "upvotes": 9, "upvote_ratio": 0.86, "comments": {"hbzs6yz": {"link": "/r/GradSchool/comments/pjokpn/rewriting_my_own_text_of_the_thesis/hbzs6yz/", "text": "I asked my university and I could exclude the text of my own papers as sources. If this is in Turnitin there's an easy way to do that. You can easily get the % down to below 10% that way. Also exclude the bibliography. The only requirements my university had were to obtain explicit permission to reproduce my articles in my dissertation from the journals.", "author": "WickedSpite", "created": 1631057153, "upvotes": 1}, "hbys1pz": {"link": "/r/GradSchool/comments/pjokpn/rewriting_my_own_text_of_the_thesis/hbys1pz/", "text": "Stupid question, but can't you just declare your thesis as a cumulative thesis instead of a monograph? This way you can rightfully copy your papers into the thesis.", "author": "Zitzeronion", "created": 1631041578, "upvotes": 5}, "hbyjh1e": {"link": "/r/GradSchool/comments/pjokpn/rewriting_my_own_text_of_the_thesis/hbyjh1e/", "text": ">\tand no one GAF that the author of the source of material is myself.\n\nHave you confirmed this with your committee/department?", "author": "mooshicat", "created": 1631038002, "upvotes": 4}, "hbxx7e3": {"link": "/r/GradSchool/comments/pjokpn/rewriting_my_own_text_of_the_thesis/hbxx7e3/", "text": "It is OK if the detector finds your work. That result should not affect thesis submission.", "author": "IkeRoberts", "created": 1631028864, "upvotes": 10}}}