{"sid": "ph53q5", "link": "/r/GradSchool/comments/ph53q5/fall_2022_vs_spring_2023/", "title:": "Fall 2022 vs Spring 2023", "text": "Hey all, so a little bit of a long post here,\n\nSo I am planning on doing my Master's in either Data Science or Artificial intelligence mostly in the US.\n\nWhat I am confused about is, should I aim for Fall 2022 or Spring 2023 and I was hoping I could find some good advice on this sub.\n\nProfile right now -\n\n* Btech + Mtech 5 yr Dual Degree Program in CS from a good state-level university with a CGPA of 8.7.\n* Have done 3 academic projects(2 related to DS and AI). Couple more personal projects after getting a job(Full-stack web dev).\n* Unfortunately no paper/journal publications.\n* Currently, 1 yr experience as a Developer(would be 2+yrs for Fall 2022 and 2 1/2+ for Spring 2023) in a well known MNC but a service-based company tho.\n* Have done few Udemy courses on ML, DL(not sure how much this counts)\n* I am aiming for 320+ in GRE which would be pretty good I guess to get into good universities and also apply for some scholarships, other financial aid.\n\nSo here's my situation - I haven't started preparing for GRE and TOEFL/IETLS yet, I haven't started any of the paperwork like writing SOPs, requesting for LORs, getting all the transcripts, etc.\n\n**Why Spring 2023? -**\n\nMost people say that I can prepare for 1-2 months and give GRE and TOEFL at the end of October while preparing all the paperwork and start applying for universities in November. I personally feel like it would be really tight and hectic given that I have a full-time job.\n\nAnd another reason I am considering Spring 2023 is that maybe I can improve my overall profile a bit more by doing some related certifications, I am currently preparing for \"Professional Machine Learning Engineer\" certification from GCP (this is a fairly new certification, not much guidance is available online, so, not 100% confident that I would clear this), maybe one more online certificate in a related subject from a top university, do some hackathons, do some other side projects, etc.\n\n**Why Fall 2022?** \\-\n\n* I just get the feeling that spring intake would not give me the complete \"MS experience\".\n* For starters, few good universities do not have spring intake at all (related ques to this - based on my profile which universities could I aim for? so that I could choose between fall and spring).\n* No orientation (ik in the bigger scheme of things it doesn't really matter but still)\n* Less on-campus jobs\n* Lesser internship opportunities\n* Lesser intake...could mean lesser financial aids.\n* Fall students have the additional benefit of completing 3 semesters instead of 2 like spring students by the time job fairs and other employment opportunities start which could mean a better profile and better chance of employement.\n\nSo if u read the whole thing, u would have figured it out by now that I am in a huge dilemma.\n\nBased on all the info stated here, if it is true at all, what would u suggest I do? maybe list the pros and cons of fall and spring.", "author": "DifficultIncrease845", "created": 1630675512, "retrieved": 1632953165, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hbgggls": {"link": "/r/GradSchool/comments/ph53q5/fall_2022_vs_spring_2023/hbgggls/", "text": "If you did a dual degree program you already have a masters, right?\n\nWhy are you getting a second masters? What is your goal? What job do you want at the end of this?\n\n\nI started grad school in the spring but it was an extremely specific situation. Most schools (that I know of) do not do spring admissions.", "author": "harper_kentucky", "created": 1630682721, "upvotes": 1}}}