{
  "sid": "eagquv",
  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/",
  "title:": "Maybe some undergrads shouldn't graduate.",
  "text": "I teach an undergrad lab which requires 10 labs to be turned in throughout the semester.\nIt's the end of the semester. I'm done with all my finals and I've finished all my grading  right before the end of this week. Final grades are officially due next Monday, but my advisor needs them early because he has to input the grades himself.\n\nI'm about to send him the final grades from my class when I receive a frantic email from a student at 11:55pm. She just saw I posted the final exam grades and she's concerned about passing the class. She's only turned in 3/10 if the labs and she wants to know if she can still turn them in so she can pass the class. \"I'm set to graduate next semester and it'll be very difficult for me to do so if I don't pass this class\".\n\nI talked to my advisor about it today. He laughed and said it was up to me, but feels that she should just get the F since she obviously didn't try in the class.\n\nI took his advice. I feel bad giving a student an F, but good god I didn't want to grade a bunch more labs.",
  "author": "Aerismeow",
  "created": 1576307789,
  "over_18": false,
  "upvotes": 308,
  "upvote_ratio": 0.96,
  "comments": {
    "faxlklr": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faxlklr/",
      "text": "Grades were released yesterday, save 10% attendance/participation. A student received a 62, 58, 58, and 60 on the four assignments. They emailed my friend (the TA) asking to be bumped up a bit in the participation and final essay, because they didn't get the 65 they need to proceed in the program. This student needed something like 113% on the final essay and 100% in participation to pass. They never got a single grade above 62, never emailed, never came for help, never spoke to her. And it's just now donning on them that they won't pass with a 65???? After everything is handed in, and you've seen all of these low grades come in all semester?? Some of these students baffle me, because they're not the only one.\n\nAnd keep in mind, it's not a 65 to pass the class, is a 65 to be allowed to move forward in the entire program..",
      "author": "fliffers",
      "created": 1576385724,
      "upvotes": 3,
      "replies": {
        "faxnt3p": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faxnt3p/",
          "text": "Oof, this hurts.",
          "author": "Aerismeow",
          "created": 1576386728,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fawruyf": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fawruyf/",
      "text": "I felt a similar struggle teaching a composition course this quarter, my very first time instructing. I'm often reminded by my peers, therapist, and loved ones how into my work and passionate I am, considering that it took me until undergrad' to finally succeed in education. Teaching students from all different majors, however, made me realize how many other students don't care or contribute when trying to earn good grades.\n\nNow, a majority of my students passed the class, while only 25% actually not passing. Despite the division of grades, or the clear evidence of students simply not caring about the work, I had several students contest me on why they should pass the class (or be saved). One example was a student who I'll call Grace. She was energetic and youthful, very much someone excited about being at a new level if not new position with age. Alas, she came to class on her phone, asleep, and hardly participating, never asking questions; yet, when I would hand  work back, she would flag me down during or after class to explain why I gave her marks and/or low results. I emphasized that she needed to perform tasks as discussed in lecture, and she would simply return with, \"So how do I do that?\"\n\nI've learned that the students who really want to succeed are going to show up and do so. If not, and if they do show signs of struggling, they realistically must expect that they must ask for help or guidance. It's impossible for us to save them, putting all effort on our end instead of theirs (it takes one to save another, just as it takes one to succeed on their own effort).\n\nWhile your professor's comment (or laughter) makes me wince, I support you for doing the right thing and giving the student the grade that they deserved. It hurts having to be the one to make the hard decisions, but if they were actually going to graduate the following quarter, then it was up to them to put the work in to do so.",
      "author": "fictionfelid",
      "created": 1576374711,
      "upvotes": 2,
      "replies": {}
    },
    "fawrs54": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fawrs54/",
      "text": "This hits soooo close to home rn",
      "author": "danishruyu1",
      "created": 1576374677,
      "upvotes": 2,
      "replies": {}
    },
    "fawnm2w": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fawnm2w/",
      "text": "To be honest, this is me this semester (not literally). I've always done well in classes (As/Bs), but this semester I seemed to stop trying. I just lost interest and started doing the bare minimum. It caught up with me when I realized I failed two classes. I didn't petition either of my teachers - I understand it was my own fault, but it was an eye opener. I wanted to attend grad school. This is a terrible mindset. But it was definitely the kick in the butt that I needed. I reconnected with faculty and applied to a ton of internships for the summer hoping to get back on track. We'll see if it worked out, but I already feel better owning up to my mistakes.",
      "author": "betta_fische",
      "created": 1576373440,
      "upvotes": 3,
      "replies": {}
    },
    "faweivw": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faweivw/",
      "text": "Some of life’s best lessons are learned hard. You did not turn-in the labs late (or not turn them in), the student did. Grades and degree’s should be earned, you/she are devaluing your course, her degree, and the institution by letting her slide where others were not afforded the same.",
      "author": "Red_Dragon_Actual",
      "created": 1576369946,
      "upvotes": 2,
      "replies": {}
    },
    "fauxhi8": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauxhi8/",
      "text": "I recieved an email like this at 2 am even though final grades were put in yesterday already. I will never understand some people. Like you knew the semester was ending why not at least try asking before the last second?",
      "author": "teddyamber",
      "created": 1576353750,
      "upvotes": 5,
      "replies": {}
    },
    "faupmcq": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faupmcq/",
      "text": "> I talked to my advisor about it today. He laughed and said it was up to me, but feels that she should just get the F since she obviously didn't try in the class.\n\nIf there were clearly outlined due dates, then it really *isn't* up to you to show clemency in this situation. It isn't equitable to all of the students to have different expectations.",
      "author": "junkmeister9",
      "created": 1576350836,
      "upvotes": 5,
      "replies": {
        "faupr0e": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faupr0e/",
          "text": "The syllabus has clear due dates and a statement that no late assignments will be accepted.",
          "author": "Aerismeow",
          "created": 1576350904,
          "upvotes": 3,
          "replies": {
            "fawunjp": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fawunjp/",
              "text": "Then there's no question. Showing this student \"mercy\" would have been ethically wrong, imo.",
              "author": "junkmeister9",
              "created": 1576375633,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "faun625": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faun625/",
      "text": "As a student who generally did try (and had struggles, didn't we all at times), thank you.\n\nWe all knew who these people were in labs: they would have nothing to turn in, or give 2 pages when 10 were assigned. These were the people who rode on the back of others in the lab, or forced us to stay late because they didn't do the preparation.\n\nWhen they showed up in the next level of the course, we all wondered how they squeaked by. In the end, it made our hard work feel useless.\n\nSome people need extra work to get through the degree, and I totally get that. I think in general we were all willing to help each other out, and get TA help when needed. It's different though when someone comes to you with two days left in the semester, frantic to get their grade up.",
      "author": null,
      "created": 1576349878,
      "upvotes": 7,
      "replies": {
        "faup9li": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faup9li/",
          "text": "> These were the people who rode on the back of others in the lab, or forced us to stay late because they didn't do the preparation.\n\nI hated that. I felt like doing lab work for classes was always manic because in addition to doing the work, I had to deal with unprepared students slowing me down, copying my work, and asking me to explain things to them. Once, after being exploited by a student all semester, they mispronounced my first name because they had only seen it written.",
          "author": "junkmeister9",
          "created": 1576350642,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fault1j": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fault1j/",
      "text": "Some undergrads definitely shouldn't graduate for this behavior. I feel for people who have to miss class or are scraping the bottom of the barrel for time for assignments, but this is just neglect and not giving a flying eff about the class because you think it's an easy A. Like, I medically cannot make it to half of my classes and there's nothing that disability services can do for me, and I spent enough time in doctor's offices and hospitals every term to fill the time of a part-time job, but I work my ass off and try and I still manage to maintain an A/B average. Hopefully this is her wake-up call to get her act together and learn to be a functioning adult.",
      "author": "ConfusedCuddlefish",
      "created": 1576349412,
      "upvotes": 3,
      "replies": {}
    },
    "faujfic": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faujfic/",
      "text": "This might be harsh, but in my opinion, this is 100% her problem, not yours. She had 10 assignments for an entire semester and only did 3. Even if there is/was a legitimate reason, it was her responsibility to properly communicate that to you much earlier in the semester. I have students like this too and it frustrates me to see students who feel entitled to a grade or a passing grade without having to earn it, and then take zero responsibility when they don't like what they get. \n\nWhile it sucks that she'll likely fail, maybe it'll be a life lesson for her. If she knew she was supposed to graduate this year, then she should have known it was her job to complete her assignments. If it were me, I wouldn't pass her either and I'd maybe have a talk with her about responsibility and just 'life' in general. Plus, it's not fair for the students who actually put in the effort and got their work in on time.",
      "author": null,
      "created": 1576348609,
      "upvotes": 6,
      "replies": {}
    },
    "faui76p": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faui76p/",
      "text": "I'll just add my comment in. When I get a TA, I normally have the philosophy that I'm not supposed to pass a moral judgement on their learling style, or their priorities. My job is to judge whether they have an acceptable technical understanding of the topic.\n\nIf she did bad in the exam and only turned in 3/10 lab reports, chances are she doesn't understand the material (even if she would hurriedly do the rest of the reports now). So that's a fail from my side.",
      "author": "fuckwatergivemewine",
      "created": 1576348217,
      "upvotes": 6,
      "replies": {}
    },
    "faubr27": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faubr27/",
      "text": "Note to self:\n\nDon’t disturb professors on weekends.",
      "author": "MrUnknown1996",
      "created": 1576346607,
      "upvotes": 14,
      "replies": {}
    },
    "fau7os0": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau7os0/",
      "text": "Don’t feel bad. Student got the grade they earned. That’s how it’s supposed to work. \n\nThis was my first official semester teaching and I told my students that I won’t bat an eyelash giving them an F if that’s what they earned. I only had one student consistently demand preferential treatment (they never got it). \n\nI teach microbiology lab for pre-nursing students so they know if they don’t do well in the class, their odds of being admitted to nursing school drop exponentially.",
      "author": "cowboysmarilyn",
      "created": 1576345346,
      "upvotes": 9,
      "replies": {}
    },
    "fau48b1": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau48b1/",
      "text": "Consequences are an important thing to learn. If she needed this class to graduate, then she needed to prioritize it previously. Hopefully this makes her more resilient and careful in the future.",
      "author": null,
      "created": 1576344229,
      "upvotes": 2,
      "replies": {}
    },
    "fau1l5d": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau1l5d/",
      "text": "You know how easy it is to ace undergrad? I have zero sympathy for people who aren't willing to put the smidgen of effort in.",
      "author": null,
      "created": 1576343504,
      "upvotes": -4,
      "replies": {
        "faudnc8": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faudnc8/",
          "text": "Is that a US thing? Aceing undergrad is nigh impossible in South American (good) universities",
          "author": "Moontide",
          "created": 1576347104,
          "upvotes": 2,
          "replies": {
            "faunv17": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faunv17/",
              "text": "Depends on your major. If you're in computer science or chemistry, it's harder to ace it. Anyone saying that's easy is just gifted. Or goes to a cupcake school.\n\nIf you're in sociology or education or something, then yes it's probably not too hard to get a 4.0 even if you aren't a gifted student. It's more about effort level, consistency, and being social in those programs.",
              "author": "a_Mangy_Meowth",
              "created": 1576350113,
              "upvotes": 2,
              "replies": {
                "fauwzku": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauwzku/",
                  "text": "That's kind of interesting. In the UK its considered much harder to get high grades on essay based subjects (i.e. sociology) because grading is more subjective. This is borne out in final degree classification which is generally higher in maths and science subjects (as far as I am aware).",
                  "author": null,
                  "created": 1576353636,
                  "upvotes": 3,
                  "replies": {}
                },
                "fav2p9n": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fav2p9n/",
                  "text": "I see.\n\nIn Brazil getting a 10 is basically impossible because that means you were perfect in the class (and that rarely, if ever, happens). Most gifted/hard-working people score between 8,0 and 9,5, and the average of the class is usually around 6 and 7 (passing grade is 5.0 for my uni).",
                  "author": "Moontide",
                  "created": 1576355096,
                  "upvotes": 1,
                  "replies": {
                    "faveh8c": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faveh8c/",
                      "text": "US is much different. I would estimate that 10-15 percent of the class will achieve the highest grade, but that varies a lot based on the class. You don’t have to be perfect, on a scale of 0-100 you need 93. But sometimes its even less than that.",
                      "author": "xMestas",
                      "created": 1576358155,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "faujga5": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faujga5/",
              "text": "Given the downvotes I'm getting, I honestly don't know. My undergrad experience was nothing but A's & a few B's near the end, and I didn't feel like it was all that hard. I never got even remotely close to failing a course, and I honestly feel like as long as you put some effort into reading the material and figuring out how things work you'd pass. \n\nI'm honestly confused. I know I went to fairly well regarded schools. Not overly prestigious or anything, but certainly not diploma mills.",
              "author": null,
              "created": 1576348615,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "fatx1bw": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatx1bw/",
      "text": "I'll tell you right now that it is the same thing in high school.   I teach a robotics class right now where I have 4 of my kids who do literally nothing.  When i put grades in, they come up to me and ask \"Mister, why do i have an F?\"  Hmmm, I wonder why.  Given I also work at a school for at risk kids, so it's expected.  Our jobs also involve teaching them important character values that their parents didn't.  But it is difficult because most of that character building its cemented in when they are children.  Often we find that kids will change when get to their junior/ senior year when they get some revaluation, but this also means they've missed 11 years of instruction and are struggling to make up for it.  So when a kid from this kind of background goes to college, they being this kind of attitude with them.\n\nOn one hand i feel for that person because college is 10000 dollars and year (if you were a cheap ass like me and went to a cheap school) plus opportunity costs of not working vs high school which is virtually free.  So not graduating has the potential of completely upheaving a person's livelihood.\n\nOn the other hand, as educators, we can't affirm this kind of behavior.  Sometimes you can get away with stuff like this in the real world, but if you make it a habit, then it tarnishes the reputation of the education system, completely waters down the usefulness of grades (which are already a shitty way of measuring skill), and turns kids into crappy workers.\n\nIf it were me I'd probably split the difference, let her complete the labs and give her the lowest possible passing grade.",
      "author": "j0shred1",
      "created": 1576342363,
      "upvotes": 9,
      "replies": {
        "faui0mj": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faui0mj/",
          "text": "Robotics in high school sounds like an amazing class!!",
          "author": "Aerismeow",
          "created": 1576348157,
          "upvotes": 2,
          "replies": {
            "fawowib": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fawowib/",
              "text": "For my kids, it's one of those thugs where you get out what you put into it.  I have a couple kids who went from knowing nothing about programming to being able to program arduino robots so I'm proud of them.",
              "author": "j0shred1",
              "created": 1576373826,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fatvzwi": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatvzwi/",
      "text": "Definitely right to fail her. In the UK late policies are standardised across faculties to keep consistency between modules. My faculty's policy was that late assignments are capped at 40% and the cap is reduced by 5% every day until 0 whereupon you can't turn it in anymore. It was all automated too so even if the professor wanted to be nice, they physically can't raise your grade. The only exception is if you submit an official extenuating circumstances form which gets decided on by an impartial committee in the case of medical/personal issues. The professor can support your application, but the decision whether to penalise you or not isn't up to them because their relationship with you shouldn't impact your grade.\n\nBy the end of the first year, the people who couldn't cope failed out or voluntarily left. Everyone who remained got good grades because they knew they had to stick to the rules. It's a tough system, but it's fair across the board. I think it's unfair to have left this decision up to you, but don't feel bad for failing someone who doesn't deserve to pass.",
      "author": "FifthEllyment",
      "created": 1576342149,
      "upvotes": 8,
      "replies": {
        "fav44rd": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fav44rd/",
          "text": "I think (at least MY) Universities' failures to create and enforce a universal policy for late submissions contributes to the problem. My current department has a zero-tolerance policy (online submission time at 11:59pm, if the submission is even 10 seconds late it's a zero). Some faculty find this problematic and individually extend or ignore the standardized policy based on individual preference, sometimes without the student reaching out. This causes a lot of, \"Well, Dr. A let me turn things in late!\" It's a nightmare.\n\nI worked at a different program that allowed individual faculty to dictate their own late-work policies and that worked a LITTLE better because at least each individual professor enforced their own policies consistently.",
          "author": "ChicksDigLibraries",
          "created": 1576355474,
          "upvotes": 5,
          "replies": {
            "faviv9y": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faviv9y/",
              "text": "The zero-tolerance online submission thing sounds pretty problematic even just due to technical issues. If your internet drops for a minute when you would have had the assignment in on time, you have no way of proving that.",
              "author": "mfball",
              "created": 1576359256,
              "upvotes": 4,
              "replies": {
                "favyn0d": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/favyn0d/",
                  "text": "On the other side of the coin-- and the general sentiment shared-- why are you waiting until the last minute to submit something? It's a Liberal Arts and Social Sciences department, so assignments are always essays and generally open longer than a 4-day period minimum.",
                  "author": "ChicksDigLibraries",
                  "created": 1576363686,
                  "upvotes": 1,
                  "replies": {
                    "faxayh9": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faxayh9/",
                      "text": "I knew someone would ask that, and I think ultimately it doesn't matter why anyone waits until the last minute. If you were supposed to turn it in sooner than that, then the deadline should have been set for sooner. Plus, just having gone to college, I know that the systems a lot of schools use are utter shit, and so lags, errors, and crashes happened all the time. \"Zero-tolerance\" anything is usually a bad policy, but doubly so when students are relying on bad technology.",
                      "author": "mfball",
                      "created": 1576381249,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fatv8o1": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatv8o1/",
      "text": "It's unfortunate that someone made it all the way up to a upper-division class with that work ethic. I'll certainly admit that I've done terrible jobs in classes before, but I've taken my beatings and changed how I work. That's a failure of the system and the person, not you.",
      "author": "SpetsnazCyclist",
      "created": 1576341883,
      "upvotes": 2,
      "replies": {}
    },
    "fatv78z": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatv78z/",
      "text": "F\n\n\nIs their grade this semester",
      "author": "Redd889",
      "created": 1576341871,
      "upvotes": 4,
      "replies": {}
    },
    "fattrvy": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fattrvy/",
      "text": "You didn't give her an F, she earned it. I would have failed her too.",
      "author": "Necrodancer123",
      "created": 1576341514,
      "upvotes": 6,
      "replies": {}
    },
    "fatkicf": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatkicf/",
      "text": "You didn't give an F, this student earned it.",
      "author": "corgi_burrito",
      "created": 1576339085,
      "upvotes": 90,
      "replies": {}
    },
    "fat22qc": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fat22qc/",
      "text": "This happened to me. A student didn't take/turn in a handful of quizzes and sent a frantic email about it the week of finals. They had the entire semester to bring this up but didn't.  I talked to my PI and she even gave her one last chance to turn them in. She didn't. \n\nI'd say give her the grade she earned. Unless she has a very compelling reason, she had all semester to bring this up but didn't. She can't get through classes like that.",
      "author": "Konjonashipirate",
      "created": 1576333858,
      "upvotes": 21,
      "replies": {}
    },
    "fasxly1": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fasxly1/",
      "text": "Don't feel bad. Part of teaching is assessment. Good assessment means you lay out the guidelines for success in the class ahead of time and both you and the students agree to them. Due dates are part of assessment.\n\nAlso consider that you are teaching more than just your subject. As a teacher there is a lesson in every interaction you have with students. Sometimes the lesson is turning in assignments late means consequences. \n\nBy giving the student an F you're actually bring a good teacher and don't let anyone tell you otherwise.",
      "author": "hdorsettcase",
      "created": 1576332640,
      "upvotes": 12,
      "replies": {}
    },
    "fasvz92": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fasvz92/",
      "text": "It will be very difficult for her to graduate next semester if she doesn't do assignments in *those* classes, either.\n\nSeriously, though, she already used up her one get-out-of-jail-free card (and then some) when you let her re-sit a midterm exam that she skipped(!) for no reason. She doesn't get to re-write the syllabus requirements - including due dates - on a whim, because she figured out at the end of term that she fucked up.\n\nYou're not going to email all of your other students and invite them to submit all their missed assignments for immediate grading, are you? And if you don't, how is it fair to the students who actually did their coursework when assigned? (Especially since the late submitters may have access to the complete, graded lab reports written by their more conscientious colleagues to use as templates....)",
      "author": "cryptotope",
      "created": 1576332032,
      "upvotes": 22,
      "replies": {
        "faw2if0": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faw2if0/",
          "text": "I think this is the most compelling for me. If you let her turn in her assignments, I would feel guilty bloated to offer that to all other students unless she had some serious reason, but she doesn't.",
          "author": "Willingo",
          "created": 1576365057,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "faso7ro": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faso7ro/",
      "text": "Bachelor’s (and probably Master’s, if not then soon) are meaningless now. For every student like yours who isn’t successful in getting moved along, I’m sure plenty are.",
      "author": "DianeSucks",
      "created": 1576329470,
      "upvotes": -17,
      "replies": {
        "fassk1w": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fassk1w/",
          "text": "Useless? You've been watching too much Fox News.",
          "author": "ATWdoubleA",
          "created": 1576330906,
          "upvotes": 17,
          "replies": {
            "fastc97": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fastc97/",
              "text": "I said meaningless, not useless. A Bachelor’s is useful, of course — you get to check the box on the job application. But what does it signify when college is more about earning the degree and getting into as little debt as possible rather than actually learning for (what I presume to be) the majority of students.",
              "author": "DianeSucks",
              "created": 1576331203,
              "upvotes": -1,
              "replies": {
                "fatnesh": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatnesh/",
                  "text": "I definitely don’t find my BA or especially my MS classes to be useless or meaningless. My depth of knowledge that I can pull upon at different moments completely justifies the degrees. I think most students learn a lot even if they don’t always intend to. I attended both private and public universities and in both cases, professors had high expectations of the students.",
                  "author": "simplyderping",
                  "created": 1576339918,
                  "upvotes": 3,
                  "replies": {
                    "fatq5v3": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatq5v3/",
                      "text": "I mean, we’re on a grad student subreddit. I’m sure virtually everyone here (myself included) loves learning and the things we learn in our fields of study. Otherwise, we wouldn’t be doing what we do.\n\nBut we are not the majority. To me, most people are in college just to check a box and get it over with, and some grading policies I’ve seen reflect it.\n\nBut anyway, there’s no point discussing this because it’s so anecdotal and subjective. Also not the right place.",
                      "author": "DianeSucks",
                      "created": 1576340625,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fatxada": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatxada/",
          "text": "I wouldn't say meaningless, but I definitely agree they've depreciated in value. It's so sad that the focus is on passing tests ans ticking boxes rather than learning for the sake of learning. Nowadays for my field you have to get a PhD or else you hit the progression ceiling really early in your career.",
          "author": "FifthEllyment",
          "created": 1576342441,
          "upvotes": 4,
          "replies": {}
        },
        "fau14az": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau14az/",
          "text": "If that's the case, then we need to make school harder. There's a lot to learn, and if you feel your education is meaningless in the real world you probably haven't learned the things you were supposed to.",
          "author": null,
          "created": 1576343414,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "farjpek": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/farjpek/",
      "text": "I had colleagues in my undergrad that counted on the teacher not wanting to leave someone behind to pass. Unfortunately they were right the majority of the time and graduate to become entitled professionals that didn't understand basic concepts (like getting on time to work and stay until the end). You did absolutely the right thing.",
      "author": "Rrlgs",
      "created": 1576316847,
      "upvotes": 56,
      "replies": {
        "farycrn": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/farycrn/",
          "text": "I read this and my eyes rollled into the back of my head (it's true).",
          "author": "gathrowawayac",
          "created": 1576321431,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "far4zz7": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/far4zz7/",
      "text": "Already good comments, I want to also share my experience on the other end. There was a course I hadn't done well in and was a required 2 part fall-spring course. I ended up in a similar position (65%ish) and made a ditch effort to email the professor. Fortunately, he was an excellent professor and failed me. The excellent part came from the time he spent sitting me down and explaining why that can't fly in the real world. As a result, my undergrad took an extra year but I am a much better person because of it. I am now pursuing a PhD in my passion and I am doing quite well. I genuinely don't think that I'd be in this position today if I hadn't learned my lesson the hard way.\n\nIn a nutshell, tell a kid all day long to not stick their hand in a fire, but the second they do, they won't do it again.",
      "author": "thingythangabang",
      "created": 1576312183,
      "upvotes": 260,
      "replies": {
        "fau1qgl": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau1qgl/",
          "text": "Similar thing happened to me.. I flunked a prereq (calc3) and it would set me back a semester but the major course sequence made it a year long delay. \n\nI pleaded for a coreq override to stay on track (~2 years deep into a Meteorology degree). My advisor denied me and gave it to another student. I was so disheartened I quit.\n\nThing was, I was barely staying afloat with a low 2. something GPA and was partying too much to be successful out of undergrad.. it took a long road of joining the guard, acing the second crack at a BS, and sneaking in a deployment.. but 8 years after that advisor meeting I'm on my way to a PhD in a program I love.\n\nSuper thankful for that prick..er.. great professor.. haha",
          "author": "citylikeAMradio",
          "created": 1576343557,
          "upvotes": 51,
          "replies": {}
        },
        "fauakqi": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauakqi/",
          "text": "I have similar experience. Took one extra year during undergrad but it changed my whole perspective on science and academia.",
          "author": "Lady_of_Ironrath",
          "created": 1576346325,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "faqx0v6": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faqx0v6/",
      "text": "I can never understand their mindset. Like it seems they really want to pass the class but never try hard enough to just pass. I just don't get it.",
      "author": "EuRadical",
      "created": 1576309398,
      "upvotes": 115,
      "replies": {
        "far268l": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/far268l/",
          "text": "They just assume it's an easy A lab class. If they do no work they'll still pass. Like it's High School.",
          "author": "Aerismeow",
          "created": 1576311138,
          "upvotes": 60,
          "replies": {
            "fau6nzn": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau6nzn/",
              "text": "Especially if it is one of the first lab classes they take in college. If they took any type of lab class in high school, odds are pretty decent you would pass with an A just for showing up and not eating the plant samples that were given to you. So that transition to a college lab course, where techniques often build on each other and you can't just show up and get the A comes as a shock.\n\nI always try and emphasize the importance of how showing up and turning everything in on time is, but there are always a few stragglers who don't get it the first time around. Bonus points if they are Pre-something.",
              "author": "Soulless_redhead",
              "created": 1576344979,
              "upvotes": 25,
              "replies": {}
            },
            "fatncgo": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatncgo/",
              "text": "I don't think that's true. A lot of the time students do something that's just stunningly stupid, there's something else going on. I was probably this student a few times in undergrad and it was always health and personal issues rather than laziness. It didn't mean I deserved higher grades (and I wasn't quite this bad), but it was also literally easier for my classmates to get everything in than it was for me.",
              "author": "mediocre-spice",
              "created": 1576339898,
              "upvotes": 39,
              "replies": {
                "faudjvr": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faudjvr/",
                  "text": "Everybody's got shit going on in their lives. Many of those classmates probably had a lot more of it than you did, but still did the work. That doesn't mean they weren't lazy, though. Doing school work can be a way to avoid doing things that matter even more.",
                  "author": "yerfukkinbaws",
                  "created": 1576347075,
                  "upvotes": 5,
                  "replies": {
                    "fav83zk": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fav83zk/",
                      "text": "Everybody diesnt go through the same type of shit at the same time. I have a classmate whose sister just died. I know a student who refuged fron Syria with a few members from his extended family because his parents died in the war. You are indeed taking a dig at this person's struggles (I dont know what they were but if they say they were struggling, they were). Yes everyone has problems in their lives but this sentence is so overused for really shitty purposes. Not everyone has the same crises.",
                      "author": "ceriolie",
                      "created": 1576356478,
                      "upvotes": 12,
                      "replies": {
                        "favo61b": {
                          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/favo61b/",
                          "text": "Right, that's exactly my point. \"Everybody's got shit going on\" doesn't mean everybody's got the same shit going on, it means stop trying to compare yourself to them as if their experiences are commensurate with yours.\n\nWhen people compare their crises to someone else's as justification for the position they find themselves in, they automatically lose a measure of sympathy because it shows a lack of awareness of just the kind of complexity to life experiences you're talking about and which is the actual positive thing we can get out of all this shit.",
                          "author": "yerfukkinbaws",
                          "created": 1576360684,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "faulp4p": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faulp4p/",
                      "text": "Sure. I don't know why you needed to make a dig about the struggles I had, but that's not the point. Thinking undergrads are just lazy and entitled is not helpful to anyone. Not to you, not to the student. Be kind. Stick to the syllabus, give them the grade they earned, but be kind and compassionate.",
                      "author": "mediocre-spice",
                      "created": 1576349375,
                      "upvotes": 13,
                      "replies": {
                        "faurt77": {
                          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faurt77/",
                          "text": "> I don't know why you needed to make a dig about the struggles I had\n\nOkay, and seriously no offense intended, but you shouldn't say things like \"it was also literally easier for my classmates to get everything in than it was for me\" unless you're looking to compete in the hard-knock life olympics. And who would want to do that?",
                          "author": "yerfukkinbaws",
                          "created": 1576351970,
                          "upvotes": -2,
                          "replies": {
                            "fautsuq": {
                              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fautsuq/",
                              "text": "Come on, I was clearly making a general point - the fuck up students probably aren't just stupid entitled fuck ups, but instead likely have more barriers to their success than the other students. I've seen this over and over again as a student & teacher, but just picked myself as an example. It's really not a controversial statement that it's harder for students with health issues to get everything in than students without health issues.",
                              "author": "mediocre-spice",
                              "created": 1576352584,
                              "upvotes": 12,
                              "replies": {}
                            },
                            "fauu2ku": {
                              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauu2ku/",
                              "text": "> unless you're looking to compete in the hard-knock life olympics\n\nKinda looks like you’re looking to judge those olympics tho.",
                              "author": "justme909",
                              "created": 1576352725,
                              "upvotes": 10,
                              "replies": {
                                "fauuwph": {
                                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauuwph/",
                                  "text": "Yeah, anyone who enters will be judged.",
                                  "author": "yerfukkinbaws",
                                  "created": 1576352981,
                                  "upvotes": -3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "faxmiv1": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faxmiv1/",
                  "text": "I agree, and try to have this mindset when teaching and be extremely lenient. BUT my biggest lesson the year was that some students really just don't give a shit and don't care to try. And unfortunately it can sometimes be impossible not to tell them apart. I try to give everyone the benefit of the doubt, and I make sure to connect with students that are willing to get help or accommodations, but I learned that some just really don't care if they get a 50 and I'm not helping them at all by making assumptions and letting it slide.",
                  "author": "fliffers",
                  "created": 1576386156,
                  "upvotes": 1,
                  "replies": {
                    "faxoeld": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faxoeld/",
                      "text": "I'm not saying let it slide. I'm just saying give the benefit of the doubt. It's really easy to slide away from empathy into just crotchety groaning and seeing all your students as scammers. It's not a huge leap from some of the comments in this thread to things like the post last week where a prof didn't believe a student's dad had died.",
                      "author": "mediocre-spice",
                      "created": 1576387002,
                      "upvotes": 3,
                      "replies": {
                        "fazumjz": {
                          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fazumjz/",
                          "text": "I agree, sorry!! I just actually found myself as the opposite where I gave everyone the benefit of the doubt and ended up feeling terrible for every bad mark I gave.",
                          "author": "fliffers",
                          "created": 1576419817,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fatok92": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatok92/",
          "text": "You have no idea how many times I've had students come to me the day before an exam complaining that they don't understand the material. Then they come in with no lecture notes and having done zero readings and expect me to teach them the entire course in 30 mins. So many students would pass if they had simply just *come* *to* *class*. Its such a simple concept and I'll never understand the students who are shocked at their grade for not having done it.",
          "author": null,
          "created": 1576340206,
          "upvotes": 18,
          "replies": {
            "fau348e": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau348e/",
              "text": "This is my experience as well. I give them a 10-part assignment with full instructions and tips and notes. When I assigned this I gave them the advice this would probably take many hours and they should send me drafts questions, etc. Many question-less weeks later, it's due tomorrow...... one student asks, \"How many of these do we have to turn in?\" ........ guess who didn't turn in all 10 parts and got a shitty grade? :P",
              "author": "sueness",
              "created": 1576343895,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "fau46n8": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau46n8/",
          "text": "They just think that you won't actually fail them and make them take another semester.",
          "author": "Mezmorizor",
          "created": 1576344213,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "faqvtzc": {
      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faqvtzc/",
      "text": "With 0 legitimate (medical/personal emergency type of situation) excuse for why they only turned in 30% of their assignments? There’s no question, you did the right thing. You shouldn’t feel bad that you failed her, because it’s their job to prove that they should pass. At my school we also offer grades of Incomplete if they’re missing some part of their final grade and would like extra time over winter break to finish, but they have to be currently passing when they request it. A student can’t just do nothing for the entire semester and then expect to pass a class.",
      "author": "stockfishgg",
      "created": 1576308887,
      "upvotes": 94,
      "replies": {
        "far1y12": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/far1y12/",
          "text": "Yeah, no excuses. The student would leave early every lab period. She also decided to skip an exam and told me through email that she'll take it during my office hours... and it was not a question. In my generosity I allowed her to take it then.\nThis is not a student I think should be allowed to graduate.",
          "author": "Aerismeow",
          "created": 1576311039,
          "upvotes": 90,
          "replies": {
            "far9qr6": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/far9qr6/",
              "text": "Normally I'd be like 'consider the tuition. is holding her accountable and causing her to pay an entire extra semester's worth of tuition really worth it? isn't that a real handicap you're putting on her?' - but with how she acted, lol. NTA OP. This is easily a case of entitlement. The F was justified. 100%. You have good judgement. just the fact that you're struggling with this shows that you care. you made the right call. tough love. hopefully she learns a lesson about work ethics and communication or some such...",
              "author": "MishaRenard",
              "created": 1576313577,
              "upvotes": 51,
              "replies": {
                "fat220s": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fat220s/",
                  "text": "Its unfortunate that the cost of degrees are so high now failing students has become this kind of moral dilemma, because now you are fucking with student's lives. I think its more common for professors/grad students to pass students who don't deserve to pass than people want to admit.",
                  "author": "stathicus",
                  "created": 1576333850,
                  "upvotes": 38,
                  "replies": {
                    "fatl0pq": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatl0pq/",
                      "text": "I've said it before, don't be worried to fail students. I'm a lenient instructor, hell I'll bypass policy and directly tell the administration I'm bypassing university policy to get students out of a bind if they are legitimately honest with me and have fallen into hard times. But the moment student's stop showing up to class, submitting the easy assignments, not showing up to office hours, not reaching out to me by email for clarification and generally not doing anything, I'm prepared to throw the book. \n\nBack to the failing students thing, it's really easy to be empathetic to students. It's part of human nature (for most of us anyway). Generally you don't want to create another obstacle for someone else but sometimes if they're not pulling their weight, it's the right thing to do. Keeping in mind the university also has a certain level of rigor that's expected and perhaps if we don't take that responsibility on, we're doing a greater disservice to society.",
                      "author": "goku_vegeta",
                      "created": 1576339256,
                      "upvotes": 13,
                      "replies": {
                        "fauujma": {
                          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauujma/",
                          "text": "This 100%. This was so perfectly articulated.",
                          "author": "MishaRenard",
                          "created": 1576352853,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "fatvbgu": {
                          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatvbgu/",
                          "text": "Oh no, don't get me wrong, I think the student described in this post should have definitely failed. I'm totally in the camp that its too easy to get degrees nowadays. I don't teach anymore, but when I did I was lenient with students who I knew tried but if they didn't try at all I had no sympathy for them. But I also mostly taught freshmen or juniors who could like retake the course next year. I never had someone tell me that they wouldn't graduate if they didn't pass. I don't know what I would do in that situation. \n\nBut also, when I was a TA it was always the professor who would bend over backwards for these students. I can honestly say I had students who I believe should have failed but the professor essentially let them pass (like OPs student. The professor let the student hand in all their missing assignments right before the final, which I had to spend all weekend grading). It would *piss me off*",
                          "author": "stathicus",
                          "created": 1576341908,
                          "upvotes": 2,
                          "replies": {
                            "fatx38w": {
                              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatx38w/",
                              "text": "Indeed! Was merely expanding upon your point, and yes that would annoy the hell out of me as well. Although that's when I would keep meticulous track of hours and fill out an overload form or say \"Whoops, can't work anymore hours due to union agreement\"  But hey if they're willing to pay me *more* I guess I wouldn't mind *that* much.",
                              "author": "goku_vegeta",
                              "created": 1576342380,
                              "upvotes": 2,
                              "replies": {
                                "fau34gs": {
                                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau34gs/",
                                  "text": "\\>  Although that's when I would keep meticulous track of hours and fill out an overload form or say \"Whoops, can't work anymore hours due to union agreement\" \n\nHaha. Nice. My grad school wasn't unionized but I wish I could have done this",
                                  "author": "stathicus",
                                  "created": 1576343897,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fat40lr": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fat40lr/",
                      "text": "True. You're right,  it shouldn't have to be this level of moral dilemma!",
                      "author": "MishaRenard",
                      "created": 1576334422,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "favga97": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/favga97/",
                  "text": "Also, she put the handicap on herself. If she didn't want to pay an extra semester of tuition, she should have put in the effort to graduate on time. I know that everyone has shit going on, but if you don't seek help when SO much of it is offered to you in undergrad, then you should fail.",
                  "author": "mfball",
                  "created": 1576358579,
                  "upvotes": 3,
                  "replies": {}
                },
                "fau5c7d": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau5c7d/",
                  "text": "> is holding her accountable and causing her to pay an entire extra semester's worth of tuition really worth it?\n\nYes. It's a degree. It's supposed to show that you know shit, not that you could afford 8 semesters of tuition. Plus letting incompetent people into the workplace with a degree from your school actively hurts you. It only takes one terrible employee to sour a manager from a school. Especially if it's a non local school.",
                  "author": "Mezmorizor",
                  "created": 1576344507,
                  "upvotes": 4,
                  "replies": {
                    "faut824": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faut824/",
                      "text": "Lol. There's a huuuge gap between having a degree and getting a job. I doubt a difference of one semester would be the make or breaking factor in landing her a job. Likely, if this is the type of student she is - she won't get one to begin with unless she knows somebody (which is it's own kind of BS). I was posing this more as a question asking if OP wanted to carry the weight of making a choice that could financially burden the student in today's economy. The student deserved the F, and the OP shouldn't have remorse, but sometimes our empathy fights our logical reasoning and we end up hating the choices we have to make. It's a lose lose - yes, it's not OP's fault, and it's a stupid situation to exist. The 'worth it' had more to do with OP, and less about the student's future - which I'm sure, regardless of anything OP has done, will likely not be too great with their work ethic as is.",
                      "author": "MishaRenard",
                      "created": 1576352382,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fatz87s": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fatz87s/",
              "text": "> In my generosity I allowed her to take it then.\n\nLike, WHY? I will never understand why people reward this sort of behaviour. That's how you get these kind of students - it keeps working out for them.",
              "author": "simoncolumbus",
              "created": 1576342944,
              "upvotes": 9,
              "replies": {
                "fauhtfb": {
                  "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauhtfb/",
                  "text": "Believe me, I gave her a penalty grade of -20% for taking the exam late. She had no excuses other than, \"I didn't know we had exams in this class\".\nThis was the 2nd exam and she had showed up to the 1st one, so idk. She did poorly on the exam.",
                  "author": "Aerismeow",
                  "created": 1576348094,
                  "upvotes": 7,
                  "replies": {
                    "fauu6xp": {
                      "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauu6xp/",
                      "text": "Teachers can be awesome. I took a college geology class with my friend - I was a straight A student. My friend was constantly failing. She was a hot mess, and turned in 3/10 HW assignments. One weekend, we spent 7 hours studying together. That test was the first one she didn't fail. The professor was so amazed by the effort he could see that *she clearly put in* (and she did. I witnessed it*)*, that he volunteered to allow her to submit her missing 7 assignments late. Did he have to? No. But his compassion gave her a new respect for his profession, made her more excited and invested in class, and motivated her to pass.\n\n Everyone gets so stand-offish about being compassionate, but it's hard to get a job if you ARE qualified - so i don't think that was the concern for the student here. I don't think OP was trying to work out weather or not to let her into the work force, just if they were willing to accept being the disciplinarian, and holding them accountable for what they did (and therefore causing them inconvenience caused by their own stupidity). Not everyone wants to do that, and to OP's credit, they did - and I think their concern is more telling about the sort of caring and mindful person they are - and also how good their judgement is, that they consider these things carefully.",
                      "author": "MishaRenard",
                      "created": 1576352782,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fau8x7o": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fau8x7o/",
              "text": "> She also decided to skip an exam and told me through email that she'll take it during my office hours... and it was not a question.\n\nwtf? yeah no she does not deserve to pass. that's madness.",
              "author": "curryisforGs",
              "created": 1576345772,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "faueos2": {
          "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/faueos2/",
          "text": "You can also feel bad for doing the right thing. Those aren't mutually exclusive things because the choices we face aren't always between a good solution and a bad one. Often both choices are shitty, so you're right to feel bad even about doing the best thing you could.",
          "author": "yerfukkinbaws",
          "created": 1576347339,
          "upvotes": 6,
          "replies": {
            "fauv03k": {
              "link": "/r/GradSchool/comments/eagquv/maybe_some_undergrads_shouldnt_graduate/fauv03k/",
              "text": "I learned this lesson from playing video games like Wolf Among Us, and Dragon Age - where I was like 'no matter what I do, someone's still angry with me!' and then i realized these games were mirroring real life in that specific respect. It changed my thoughts on video-game story telling into seeing it as just another medium helping human connection. I do... exclusively play RPGs though....",
              "author": "MishaRenard",
              "created": 1576353020,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634065556
}