{"sid": "pxfy8a", "link": "/r/GradSchool/comments/pxfy8a/decided_to_take_a_leave_of_absence_loa_from_school/", "title:": "Decided to take a leave of absence (LOA) from school", "text": "Hi everyone,\n\nI decided to take a LOA from my master's of social work program. Some context: I just graduated with my BSW this May after pushing through most of my undergrad. I was excited to finish school but was extremely burnt out from just \"going through the motions\" of school/life during my undergrad. I am *still* extremely burnt out from a social work-related job that I had quit back in *January*. During the summer I was considering deferring for a year and taking time to focus on myself because I was dealing with some mental health struggles after breaking up with my mentally abusive boyfriend of two years. I also wanted to defer because I wasn't sure if I *truly* wanted to pursue a career in social work. Despite my doubts and struggles, I decided it was just \"jitters\" and that I could push through (just as I had done the last three years of undergrad).\n\nA month into the program and I was having more doubts about whether social work was right for me and my mental health struggles only increased. I talked to people in the field, family, and friends, but ultimately, I \"spoke\" to myself. For once in my life, I have decided to trust my intuition and take a *break.*I'm not quite sure where life will take me, but I'm very excited. I feel happier, less stressed, and have just felt better overall after making my decision. I usually have everything planned out and try to stick to my plans regardless of whether it's still what I want. During undergrad, even when I was burnt out and having doubts about my next steps in social work, I didn't take a second to stop and ask myself, \"Is this what I *really* want?\", and I wish I had.\n\nAnyway, I'm just posting this because I want to tell people that it's okay to take a break, it's okay to ask yourself if this is what you really want. No, I'm not suggesting that you quit your programs, I'm just saying that it's okay if you decide to take a break and/or quit your programs. :) Thank you all for listening!", "author": "babygarden", "created": 1632863216, "retrieved": 1632951941, "over_18": false, "upvotes": 8, "upvote_ratio": 0.91, "comments": {"heqdlqp": {"link": "/r/GradSchool/comments/pxfy8a/decided_to_take_a_leave_of_absence_loa_from_school/heqdlqp/", "text": "Thank you. I needed to read this so badly. \nI’m a year into an online program for a MA psych for marriage and family therapy and get debilitating anxiety opening my damn books. I’ve been thinking of cutting back on classes or taking a break for a bit, and it’s really nice to be validated that it’s ok. Thank you, and good luck!", "author": "shareyourespresso", "created": 1632929108, "upvotes": 2}, "hep0c6p": {"link": "/r/GradSchool/comments/pxfy8a/decided_to_take_a_leave_of_absence_loa_from_school/hep0c6p/", "text": "I’m all for a break bro. I think you made a good choice.", "author": "TheRealDrRat", "created": 1632897581, "upvotes": 2}, "heorcp3": {"link": "/r/GradSchool/comments/pxfy8a/decided_to_take_a_leave_of_absence_loa_from_school/heorcp3/", "text": "I’m not doing great mentally and I’m a month into it and I have over 100% in all of my classes, but it’s just not good for me.", "author": "According_Age8997", "created": 1632891134, "upvotes": 2}, "heo0a0n": {"link": "/r/GradSchool/comments/pxfy8a/decided_to_take_a_leave_of_absence_loa_from_school/heo0a0n/", "text": "This post really helped me calm down. I also took a leave of absence one month into my program. I really doubted my choice as I’m also an international student and there were immigration complications to worry about. But I honestly feel so much lighter now.", "author": "miscpj", "created": 1632877180, "upvotes": 2}, "hen97y5": {"link": "/r/GradSchool/comments/pxfy8a/decided_to_take_a_leave_of_absence_loa_from_school/hen97y5/", "text": "I feel like online learning is responsible for a lot of burnout. I just graduated undergrad this may and that whole year was just hard. I feel burnout now, but it’s just from constantly being told no. I just got denied entry to the grad program at my school, and that was after a bunch of jobs also said the same thing. All that time and effort for nothing. I’m looking at grad school somewhere else but goddamn, just tired of how things have been going.", "author": "mynameizham", "created": 1632864665, "upvotes": 3}}}