{"sid": "m9k9fw", "link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/", "title:": "Liberty U is a joke.", "text": "I’m in the beginning stages of getting applications together for my Masters of Mental Health Counseling. I’m looking at online options right now mainly because I have three young kids, and that just seems logical.  My top choices are NC State, NC Central, and Wake right now.  (I’d love to hear your opinions on other online options!!)  Liberty is my last ditch fallback.  I spoke on the phone to Liberty after submitting my information and it was painful.  They couldn’t tell me their program acceptance rate, pass fail rate for the licensure exam, graduation rate, how many people are in each cohort, nothing.  I am 100% sure I’d get in, but I don’t even think I want to apply there.  When I asked about acceptance rates the guy told me I had a good chance of getting in and I said “well I want to know if the program is competitive so that I can be competitive in future job prospects”.  He said “oh, no one has ever asked me that before”. 🤦‍♀️💀", "author": "VegetableEffective16", "created": 1616286979, "retrieved": 1632954477, "over_18": false, "upvotes": 275, "upvote_ratio": 0.97, "comments": {"gt7slfr": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/gt7slfr/", "text": "Any resume that crosses my desk with Liberty on it immediately goes in the trash.", "author": "orson-hells", "created": 1617424735, "upvotes": 2}, "grridi7": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grridi7/", "text": "As a current undergraduate online student at Liberty, I would personally not recommend going there, especially not for graduate school since that will be the last school (normally) on someone's resume that people see.\n\nFor me, it wound up being a cost and the particular program they had thing, but I feel like there is a lot of hidden costs and I'm spending a lot more than I thought.. Loan doesn't always cover my tuition since they do terms instead of semesters.. I don't know if that for sure throws it off since this is my first experience with loans but I was just stunned I couldn't have my classes covered by a loan. \n\nEvery school I had been to before gave me the pell grant. When I go into the fafsa, it shows I still have more of that to use but for some reason it isn't being used at Liberty. It could be because I was working a lot in the years that its pulling for Liberty and that's what made me no longer qualify for the grant but I barely made anything... you'd think I would just get less. And what do they do for people who no longer work at the place but the financial aid is determined by a job you no longer have?\n\nAs you can see, another big issue is there is no help with Liberty. Since I'm states away, I can't just make an appointment with financial aid or walk into the office - and the place is run like a call center. If you talked to one person about an issue, you only talked to the one person, even if they transfer you you have to retell everything, even if it's on e-mail where there is an e-mail chain connecting everything - they are too lazy to read through it and you have to re-explain everything.\n\nThe same thing goes for the live chat. I even asked one of them if they can see the history of the chat and they said they could. -.-\n\nTo be honest, I am actually really pleased with the academic part of it, believe it or not. I have quite a bit of experience with other online programs and this is probably one of my favorite, if not my favorite. Maybe it's also because I'm more mature now and I'm able to retain things better than when I was young and fidgety, but I just feel like I'm learning a ton.\n\nBut, if I had to do it again I would go somewhere else - anywhere else that actually has people to help you with things. You don't even have an assigned advisor here, which is nuts, it's the first school I've ever been to that didn't either have an advisor or mentor assigned to you. It helps a lot when you are trying to figure out billing, fafsa, whatever issues. It's been an absolute nightmare for me to get things done, and as a person who is applying to graduate school I would have loved more resources and connection with someone but there is just no one. \n\nSo, I would not go unless its all paid for, or its just a stepping stone to further school and you're going somewhere else. Also I wouldn't go if you can't stand religion in everything. I had been to a catholic university before this, but they didn't have religion in all the classes like they do at Liberty. Something I don't care for, personally.", "author": "yourtipoftheday", "created": 1616375928, "upvotes": 3}, "grqg800": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grqg800/", "text": "Liberty \"University\" is a regressive, racist sham college that should be avoided at all costs.", "author": "lift_heavy64", "created": 1616356660, "upvotes": 2}, "grpnygu": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grpnygu/", "text": "Get your MSW, you'll have problems billing with an LPC or LMFT.", "author": "huckleberryrose", "created": 1616342981, "upvotes": 0}, "grplvbd": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grplvbd/", "text": "It's very nearly a fake university. Don't go there.", "author": "l_lecrup", "created": 1616341983, "upvotes": 3}, "grpka6y": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grpka6y/", "text": "I didn't see this in the comments at all, but when it comes to a counseling program the most important first thing to check is making sure it is CACREP accredited. Steer clear of programs that are not!", "author": "tvvb1793", "created": 1616341196, "upvotes": 2}, "grpiwnk": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grpiwnk/", "text": ">...I can be competitive in future job prospects”. He said “oh, no one has ever asked me that before”. 🤦‍♀️💀 \n\nBecause competent Liberty grads are virtually guaranteed jobs working for \"their side\", and virtually ignored by the rest of society. \n\nAnyone remember when Regent law grads were the top choice for W's DOJ ahead of Harvard and Yale JDs? Liberty is a similar institution, filling a similar niche, and actually a few hours down the road. The entire purpose of the institution was to create educated evangelicals that could fill credential requiring roles in Southern society without being exposed to normal liberal evils of \"college\".\n\nIf you want to get a job at a place where the unwritten, primary qualification is being a \"Good Chrisrian\"™️, go to Liberty, otherwise I'd think you'd be better off elsewhere.", "author": "Ut_Prosim", "created": 1616340523, "upvotes": 3}, "grpgdgb": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grpgdgb/", "text": "Isn't that the loony fundamentalist Christian school? You'd be better off with no masters at all.", "author": "Icestar1186", "created": 1616339261, "upvotes": 8}, "grpdoci": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grpdoci/", "text": "The only reason one should seriously consider this institution is if one plans to spend their entire professional and academic life working in narrowly-defined evangelical spaces, and even then, Liberty's reputation is (rightfully!) tarnished in much of American Christian discourse as well as probably every imaginable academic and professional context.\n\nAvoid unless your professional aspiration is to become a megachurch youth pastor. And even then...", "author": "Samaahito", "created": 1616337837, "upvotes": 4}, "grpc6bk": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grpc6bk/", "text": "Wake's counseling program seems legit, I was in the Comm masters program a floor above.", "author": "TenaciousKory", "created": 1616337043, "upvotes": 2}, "grp8weu": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grp8weu/", "text": "Check out Northcentral University. They are online, are regionally accredited and have several programmatic accreditation’s to support their degrees. They have several clinical counseling/therapy degrees that lead to state licensure, and help you set up practicum and internship in your local area to get the hours and practice you need for licensure and your program.  https://www.ncu.edu/", "author": "Frostygoat", "created": 1616335157, "upvotes": 2}, "grp4f6f": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grp4f6f/", "text": "It’s a newer university. So if you are looking for prestige you won’t find it. The questions you ask are excellent!! Keep asking them!!\n\nI know the federal government has stats....Department of Labor (might be Education, actually) .. about school such as the rate of employment in the industry and graduation for the bachelors level. Might be worth seeing if grad schools are there too.", "author": "shadeofmyheart", "created": 1616332226, "upvotes": 1}, "grp1ylp": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grp1ylp/", "text": "Don’t go there!!!!!!! Why would you go there? It’s not even accredited for most programs", "author": "EcoRavenshaw", "created": 1616330567, "upvotes": 8}, "grp1icy": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grp1icy/", "text": "Please be careful choosing programs for counselling, especially. You’ll be working with vulnerable people and need the proper training. You’re not going to get it at a school like this and could end up doing more harm than good to your future clients (if you’re even able to get licensed with the degree).", "author": "lkr01", "created": 1616330253, "upvotes": 24}, "groy3r4": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/groy3r4/", "text": "Aren't they one of those non-accredited for-profit diploma mills? When I was looking at schools I just didn't even register those as options I could consider.", "author": "son_of_tv_c", "created": 1616327686, "upvotes": 2}, "grov0ye": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grov0ye/", "text": "I personally would not even consider it a fallback. Imo, having an online degree from Liberty is worse than having no degree at all. It would be much better to wait a year, potentially work someplace relevant to what you want to do, and then reapply to reputable schools. An education is supposed to have a positive return on your investment, but I think a degree from Liberty would actually get you a negative return on your investment. I don't think I'd even go there if I was paid. \n\nThere are plenty of religiously oriented schools that have a good academic reputation (e.g. Baylor in Texas) that are not essentially diploma mills, so if you are looking for a religiously oriented school, there are much, much better options out there.", "author": "False-Guess", "created": 1616325067, "upvotes": 13}, "grosi2e": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grosi2e/", "text": "I'm sorry but mental health counselling and evangelical education do not mix. You will struggle to find clients that are not religious fundamentalists if you attend liberty U. Their beliefs will get in the way of their recovery.", "author": "Fun_For_Guill", "created": 1616322685, "upvotes": 23}, "groruk9": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/groruk9/", "text": "Liberty U is a trash school. They are nothing more than a degree mill and their \"education\" makes Devry look like a real school.", "author": "bttrflyr", "created": 1616322044, "upvotes": 13}, "groox6a": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/groox6a/", "text": "For mental health counseling, keep in mind that not every state will recognize a degree completed online when it comes to licensure.", "author": "penguinhearts", "created": 1616319084, "upvotes": 14}, "grol56i": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grol56i/", "text": "Not only is the school a joke, but its not the best place to live I'm VA either.\n\n\nIts funny, because since it's fame, it has one of the highest application rates in the country.  Everywhere else, for undergrad, there is a correlation between high application rate and increasingly higher scores of the applicants.  In other words, as a school becomes more popular, smarter people start applying there.\n\n\nIf you were to graph application rates vs incoming SAT scores,  and fit a line, it would be sloping up and to the right, and you would notice the biggest outlier is LibertyU.  For such a high application rate, they have really low SAT scores of incoming freshman.  Because only morons apply there. This is what the data shows, not my opinion.", "author": "Midnight2012", "created": 1616315302, "upvotes": 21}, "grojqkf": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grojqkf/", "text": "They also teach creationism as a scientific fact.", "author": "FunnelCakeGoblin", "created": 1616313918, "upvotes": 9}, "groghgi": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/groghgi/", "text": "Plus, ya know, they are evil.", "author": "BlokeyBlokeBloke", "created": 1616310810, "upvotes": 8}, "grodntm": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grodntm/", "text": "My friend brought over a crazy Liberty U political science student (he needs to stop bringing his deranged gf's). She was a know nothing, and that's putting it mildly. Blathering on about how masks don't work, how the Democrats started the COVID-19 conspiracy, etc.", "author": "New-Mathematician-83", "created": 1616308281, "upvotes": 21}, "groc3vw": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/groc3vw/", "text": "Don't go there dude. Diploma's not worth the paper it's printed on.", "author": "KXLY", "created": 1616306971, "upvotes": 58}, "groasvp": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/groasvp/", "text": "I’ve heard online options are not credible and are degree mills. I would highly consider not investing in an online option, you will be competing with a significant amount of individuals that received their degree in person, whose degree is given more respect.", "author": "tristin_23", "created": 1616305922, "upvotes": 6}, "groamht": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/groamht/", "text": "I’m in grad school at Wake at the moment and I would highly recommend! The program is not fully funded though so if you are looking for funding that might be something to consider", "author": "cret-amazing-", "created": 1616305783, "upvotes": 7}, "gro9kqj": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/gro9kqj/", "text": "The same Liberty U that gave Charlie Kirk an honorary doctorate degree in Politics and Policy 😂 clowns", "author": "iRosay", "created": 1616304967, "upvotes": 76}, "gro2lpb": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/gro2lpb/", "text": "That would be like “going” to PragerU", "author": "Gerardo1917", "created": 1616300200, "upvotes": 30}, "gro0f9g": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/gro0f9g/", "text": "Hi from NC State", "author": "articlesarestupid", "created": 1616298854, "upvotes": 6}, "grnz0a5": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnz0a5/", "text": "It's well known that Liberty University's online \"educational experience\" underwrites their brick and mortar experience. Meaning that the quality is incredibly low. I can't speak for their academics, it's a fundamentalist Christian school so I guess if that is part of your goals/worldview, maybe that is a good thing. But brick-and-mortar is going to be a better experience overall.", "author": null, "created": 1616297982, "upvotes": 76}, "grnyc6n": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnyc6n/", "text": "Isn't that the conservative hack school?", "author": "FuckYourPoachedEggs", "created": 1616297577, "upvotes": 96}, "grnwjn9": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnwjn9/", "text": "They're intentionally not telling you this information so that you won't be dissuaded from attending.", "author": "Terrible_Detective45", "created": 1616296507, "upvotes": 43}, "grnsuth": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnsuth/", "text": "Here’s an article about the former president of this \"Christ Centered\" scam. \nhttps://people.com/human-interest/liberty-university-launches-investigation-after-falwell-sex-scandal/", "author": "aqjo", "created": 1616294322, "upvotes": 35}, "grnozkw": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnozkw/", "text": "Save your money. It's a joke.", "author": "MichaelLewisFan", "created": 1616292097, "upvotes": 28}, "grnnmb3": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnnmb3/", "text": "Liberty is a joke. I applied free of charge for their MPH program. I got accepted in minutes I believe. \n\nI did it even tho I was currently in my MS program just for hahas. They are so hungry to get money. It’s pathetic. \n\nCASH COW go Moooooooooo\n\nEdit: So I went back to my email to check the dates and times. It literally took them 8 hours to accept me to their graduate program. Here is screenshot proof:\n\nhttps://ibb.co/KbJCkLq - emails from liberty university showing the free application on May 6th, 2020 and me being drunk on May 11th and being like “imma apply to liberty durrr hahaha”\n\nhttps://ibb.co/WBWw2ct - application submitted May 11th, 2020 at 10:19 PM\n\nhttps://ibb.co/nDFMD9r - acceptance on May 12th, 2020 at 5:44 am \n\nUnless they have admissions officers working at 12 am at night I can assure you they will accept anyone with a pulse. So yeah this isn’t some meanie boe beanie shit. Liberty is hella scummy just like ITT.", "author": "Thecatofirvine", "created": 1616291298, "upvotes": 216}, "grnll1h": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnll1h/", "text": "Yea...don't go there.", "author": null, "created": 1616290137, "upvotes": 51}, "grnl2fh": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnl2fh/", "text": "I for one am shocked, shocked I say!", "author": "Mikazukinoyaiba", "created": 1616289838, "upvotes": 14}, "grnjocx": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnjocx/", "text": "My wife is doing an online masters at Utah State and having a good experience. But since we moved to eastern time many of the classes are late for her. I think her program is rehabilitation counseling. Also if you end up making a visit, it's a gorgeous place", "author": "electriccroxford", "created": 1616289040, "upvotes": 33}, "grnip2t": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grnip2t/", "text": "Not even worth it as a fallback.  There are online programs from reputable schools that would make better fallbacks.", "author": "thiccet_ops", "created": 1616288483, "upvotes": 400}, "grniabw": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grniabw/", "text": "Is this the same Liberty U that jerry Falwell ran? I’d be worried about you getting a job with a degree from there", "author": "rummncokee", "created": 1616288249, "upvotes": 299}, "grngcc1": {"link": "/r/GradSchool/comments/m9k9fw/liberty_u_is_a_joke/grngcc1/", "text": "yikes, sounds like ITT tech grad school edition", "author": "soihavebeenthinking", "created": 1616287139, "upvotes": 90}}}