{
  "sid": "phnkse",
  "link": "/r/GradSchool/comments/phnkse/is_it_worth_applying_to_highly_competitive_us_phd/",
  "title:": "Is it worth applying to highly competitive US PhD programmes as a UK student with a GPA equivalent of 3.7-3.8?",
  "text": "Haloo! I am a biosciences student hoping to complete my degree in biosciences this summer with a UK score of 70-80% (GPA conversion by some sources to 3.7 others to 4.0) at a top UK university and a year of full-time research experience at an industry lab (although quite research-like). This is all good but it's not amazing. If I want to do a PhD straightaway I would need to apply now, but my favourite academics and my preferred topics are at highly competitive institutions (UCSD, UCLA, UCSF, MIT, Harvard, Caltech, Berkley...). Is it even worth applying to any of these? Given the above, what kind of universities can I apply to and get a decent chance to get in? Moreover, what would you advice me doing so that I can get into one of these top universities within the next 5 years? Doing a master's could be an option, but I cannot afford it given the fees in the us and the UK, so perhaps elsewhere in Europe...",
  "author": "JumpingAmygdala",
  "created": 1630743166,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hbl3unu": {
      "link": "/r/GradSchool/comments/phnkse/is_it_worth_applying_to_highly_competitive_us_phd/hbl3unu/",
      "text": "I wouldn’t worry about your gpa, that should be just fine. The biggest thing for getting into most PhD programs is research experience. Good grades help, but from everyone I’ve talked to that have been on admissions committees, they treat it more as a binary filter, like if you gpa is above a certain mark, they don’t worry about it. At least in my fields in humanities and social sciences, they all said that mark is somewhere around 3.4 or so.",
      "author": "ThrowawayHistory20",
      "created": 1630773936,
      "upvotes": 1,
      "replies": {}
    },
    "hbkd85z": {
      "link": "/r/GradSchool/comments/phnkse/is_it_worth_applying_to_highly_competitive_us_phd/hbkd85z/",
      "text": "Definitely! You just may have to explain the grading system because a 70-80% looks low in the US for people who are not used to it. My friend graduated from Cambridge with that score and they originally thought it wasn't a high enough GPA to gain admission to the PhD program. But after explaining, they understood and she was accepted.",
      "author": "Comprehensive-Pea952",
      "created": 1630761515,
      "upvotes": 4,
      "replies": {}
    },
    "hbk6wpg": {
      "link": "/r/GradSchool/comments/phnkse/is_it_worth_applying_to_highly_competitive_us_phd/hbk6wpg/",
      "text": "Yes, worth trying. Apply for a few EU masters programs as backups, if that is your plan B.",
      "author": "Monsteriah",
      "created": 1630757682,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634066349
}