{"sid": "lanrdk", "link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/", "title:": "A PhD in a pandemic rant", "text": "I had a really short rope already like everyone else and on Friday it snapped so here's me letting off steam in hopes that strength in misery numbers will somehow buoy my motivation to continue...\n\nHas anyone else seen a complete deterioration of their degree and educational experience, which started out as a bearable 'for now' feeling, but now it feels like a derailed freight train, except that train carried no cargo in the first place?\n\nI never discuss science (in STEM)  anymore with colleagues, since we're discouraged to spend time near others due to social distancing. The number of seminars (and interest in internal seminars) has plummeted since the beginning of the pandemic and I think even departments have stopped bothering to invite external speakers. Workshops, **conferences**, and overall quality is training is heavily reduced because we're obviously not traveling, networking, meeting future employers...\n\nWorse yet, and not unique to us, we can't celebrate any milestones. Successful committee meeting? Passed your candidacy exam? Did your comps and they didn't tear you a new one? GOD FORBID, DEFEND YOUR THESIS? Can't celebrate, can't congratulate.\n\nForget about the personal toll that the pandemic takes on everyone, much less students, postdocs, and academics, which tanks our ability to want to be imaginative, to delve into literature and actually be excited about our work ahead.\n\nI try hard not to be negative, but when you're doing a PhD, it kind of is also your life when you're used to living and breathing your work. It makes me sad to think that we are so robbed of what should be such formative years in our careers.\n\nSomehow a year into this mess, I'm still grieving over the loss of what could have been a good PhD.\n\n*     \n^^oh. ^^and ^^still ^^trapped ^^in ^^the ^^same ^^5 ^^mile ^^radius ^^of ^^my ^^house. ^^thanks ^^UK.", "author": "mymindisapipebomb", "created": 1612241372, "retrieved": 1632953785, "over_18": false, "upvotes": 440, "upvote_ratio": 0.97, "comments": {"glw8ul9": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glw8ul9/", "text": "Ever tried Zoom?", "author": "genitame", "created": 1612379195, "upvotes": 0}, "glvmjxh": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glvmjxh/", "text": "I recently opened up to my girlfriend how different my phd is going to how I thought it would be, and then read her this thread and she looked me dead in the eyes and asked me if I wrote it. Thank you for sharing and honestly there is strength in misery", "author": "DamMofoUsername", "created": 1612370387, "upvotes": 1}, "glsuhro": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glsuhro/", "text": "It’s been pretty bad for me, for the exact reasons you said. It’s very hard for me to acclimate but I feel like I’m slowly being able to “work at home”, after almost a year of this pandemic.", "author": "eratosihminea", "created": 1612310870, "upvotes": 1}, "glsouqs": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glsouqs/", "text": "As an MA student I crashed and burned Apr 20 --- ~Nov 20. So much opportunities lost, education or otherwise. There were many opportunities esp. near the city I moved to, multiple international conferences, and some that I could've attended about last spring should the Shit Hath Not Hit The Fan, do that was doubly sad.\n\nBut as my thesis neared (which I'm beginning to work on nowadays, the semester ended ~5 days ago), I focussed on it and it's really helped catch my breath and keep up.  It'll still be difficult, as I'll have to work with human participants about the summer and god knows wtf the world will be doing about then, but still it's a great goalpost and it's _mine_, which is an immensely better motivator than all the handout-able lectures and bullshit homeworks we did.\n\nIn the end, I'm not in the MA for the MA, I'm here because I want to become a scientist, and when I can remind myself of that, a lot of hills flatten and mountains dwindle, so to speak.", "author": "gkayaalp", "created": 1612308209, "upvotes": 3}, "glslclo": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glslclo/", "text": "Lol I created a Zoom hangout so myself and other grads in the program could hangout and talk shop like we used to in our office. Not one person has dropped by and it turns into me playing the piano to an empty zoom meeting.", "author": "bbrickell-_-", "created": 1612306615, "upvotes": 3}, "glskbdt": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glskbdt/", "text": "Tell me why I read this as “a PhD as a pandemic rat”", "author": "_constantly_eating_", "created": 1612306166, "upvotes": 2}, "glsd842": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glsd842/", "text": "This post resonates with me deeply.\n\nWhen I defended my PhD in December my committee first said !!CONGRATULATIONS!! and then, almost immediately, they all individually said their version of \"Sorry about not being able to celebrate this achievement in person.\" Extremely anti-climactic after so much turmoil.\n\nI feel like for the rest of my career people who have gone through this pandemic will look at my resume, see that I graduated in 2020, and think \"oof\"", "author": "30_rocks", "created": 1612303132, "upvotes": 3}, "gls8bic": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/gls8bic/", "text": "I feel you OP. My graduate school experience is a total wash. I moved to NYC last January to start masters program. Six weeks into my new life, the pandemic cancelled everything and threw classes online. Was ultimately forced to go back home after months of moving around trying to make it work. \n\nThe pandemic ruined me. Now I'm in final semester and feel like I have nothing to show for it.  I absolutely hate online learning, met only a small handful of classmates, moved countless times and worse I'm paying SOOOO much money for an all around unpleasant/unfulfilling experience.\n\nYou're not alone. We just have to struggle our way to these degrees and chart a better path forward for ourselves. At the end of the day, nobody could've foreseen a global pandemic on the horizon when applying for gradschool school", "author": "Emergent_System", "created": 1612301217, "upvotes": 3}, "gls5qei": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/gls5qei/", "text": "Dang. I feel it all too much. I completed my masters with my adviser and decided to continue on for a phd in a different topic because I enjoyed working with him so much. The first 2.5 years of my phd were a blast, and I had an awesome relationship with my adviser, we travelled abroad for fieldwork and had plans to continue that. We celebrated milestones, it was special. Our lab started out pretty optimistic too, but somewhere along the way we decided this was it and settled in. I've tried to suggest things like lab hikes or other outdoor field excursions to keep morale up but my adviser wont participate. We have weekly lab meeting on zoom, which is the one cohesive thing we've got going right now. I definitely got some PTSD from being ripped away from my community at the lab. Maybe some would say its unhealthy, but I was doing well with that being my community while I completed grad studies. \n\nOn top of relationships deteriorating, which may not mean that much to some, the grant money for my field work has been slow as molasses to come in, and resulted in me not getting a whole lot done last summer/fall, which should have been my major field season. The university has also taken back almost all of my advisers discretionary funds which were slated for my work and subsequent publications. It just sucks. It was kind of the best time of my life so far and I'm still mourning the loss or relationships and experiences. Im finally back on track and pumping out publications but it all feels so empty without being able to share the excitement with people. Now I need to schedule my quals, which I'm sure will once again be on zoom. So that's great. \n\nHoping the university comes through for us and helps us get vaccinated before summer. But I'm afraid that I'm once again being overly optimistic.", "author": "Lord_Velvet_Ant", "created": 1612300261, "upvotes": 3}, "gls3nrb": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/gls3nrb/", "text": "I just started my masters and it feels like I’m doing this completely alone 😔😔😔", "author": "Talnix", "created": 1612299421, "upvotes": 4}, "glrskyl": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glrskyl/", "text": "Preach. I defended last month and I'm starting a postdoc this month. My job has moved hundreds of miles and here I am at the same desk at home I've been confined to since last year. I've been totally robbed of the excitement and momentum of my career progress. And I'm one of the luckiest people in the world to be able to make career progress at all right now...\n\nToday I went to pick up some takeout and learned that a local restaurant has decided to open back up for in-person dining. The highly infectious variant is spreading in our community. When I got back to the car I screamed at the top of my lungs, left my throat sore. Not about anything in particular. Just had to let it out.", "author": "UmiNotsuki", "created": 1612295066, "upvotes": 3}, "glrm6ah": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glrm6ah/", "text": "I had a buddy die from an OD over the break and my department has been very understanding fortunately. I've been given half a year to just teach and focus on the grief counseling. Yeah, it's been rough.", "author": "Horace_P_Mctits", "created": 1612292552, "upvotes": 1}, "glrlts8": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glrlts8/", "text": "I'm so sorry for you and everyone else who is going through this. In addition to all of the support posted by others here, I would offer this:\n\nDuring the pandemic, I actually think that my friendships with academics at other institutions has improved, thanks to **Twitter**. It felt silly at first to get on Twitter, a place I knew mostly for political arguments and memes, but I've actually found a really great corner of the social network by following researchers in my field and adjacent fields. I tracked down old acquaintances from conferences, and we all celebrate virtual candidacy wins, Zoom dissertations, and multi-tweet, GIF-heavy Twitter threads about new papers. I've attended way more virtual conferences this year than I ever could have afforded to attend in person, and the Slack/Discord channels for those conferences are a lot of fun.\n\nI know it can never replace in-person interactions, but just putting that out there in case it helps you the way it helped me. I even got a contract job via a mutual on Twitter, so I'm picking up some extra remote work to squirrel away some money for a hiking trip this summer! Sending lots of love <3", "author": "gardenfractals", "created": 1612292417, "upvotes": 3}, "glranoa": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glranoa/", "text": "I feel ya. I defended my thesis earlier in the pandemic and am taking extra time to write and apply for jobs, and it's hard. I mourned the loss of my ability to celebrate properly, but I got over it eventually, and came to accept it. Lots of other big personal milestones as well (re-planning and postponing my wedding, elder care and eventual death of pet, moving multiple times). Yet as the pandemic drags on, it feels less like \"at least I'll have a story to tell/memorable experience/we can just celebrate later\" and more like \"will this ever really end or have meaning again?\"", "author": "JamesTiberiusChirp", "created": 1612288036, "upvotes": 5}, "glr3751": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glr3751/", "text": "Yes yes yes yes yes. I’m supposed to graduate this semester. My defense will have to be done on Zoom. No post-defense party. No celebrating with friends. No graduation ceremony. I’ve been working towards this for soooo long, and it feels like my big dramatic finish is being stolen. This all hit me the other day and I just cried and cried. \n\nThe last time I worked in-person was March 6. Almost a full year. And since then there have been basically no seminars, and the few we have had on Zoom, most people have their cameras off and don’t say anything. No conferences. And I’m job searching. Sigh. Just joining in your rant I guess, lol. But yes, I feel you completely.", "author": "weddingthrow27", "created": 1612285160, "upvotes": 5}, "glr2gvx": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glr2gvx/", "text": "[deleted]", "author": null, "created": 1612284891, "upvotes": 6}, "glr1w3n": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glr1w3n/", "text": "I feel this. I started my PhD in Fall 2020. That means I interviewed online, never visited the campus and got an apartment all sight unseen. It has been incredibly isolating. I know no one in this city and haven’t had opportunities to meet people. Although I’ve walked around campus, I’ve never stepped foot in the school. I’ve never met anyone in my cohort and met my advisor once in August for 15 minutes. \n\nOne the positive side, first year is very course heavy, so it hasn’t really impacted my research yet. I can just plug along, getting the required courses out of the way so I can take my prelims. \n\nBut yeah, what a waste. I feel like I’ve been in hibernation for a year. If we can’t do in person by Fall 2021, I will consider taking a semester off. \n\nI need the opportunity to network and connect with other people.\n\nAlso, I’ve been drinking much more alcohol than I’d like. I guess it’s how I deal with stress. I tried “dry January” but only made it to January 6... for obvious reasons. Can anyone else relate?", "author": "embeeclark", "created": 1612284679, "upvotes": 6}, "glqjanm": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glqjanm/", "text": "[removed]", "author": null, "created": 1612278048, "upvotes": 6}, "glqarhc": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glqarhc/", "text": "This exactly. All our conferences were canceled or are remote, so it takes all the fun out of traveling. They’re simultaneously punishing us for working from home by moving up deadlines and giving us more work because of the assumption we have more time. For example: our comprehensive exams in September they made 5x harder so we “couldn’t cheat.” I work in mental health, and research trauma, so while I’m not doing the fun things like traveling to conferences; I was supposed to go to India last summer to study art therapy abroad, I am locked inside reading and studying all the worst things about humanity. In our internships, we are listening to people recount their paint and suffering, past and present, for free (technically we are paying the school via tuition). Our professors are clueless too, or at least pretend to be", "author": "hilaryfayesvan", "created": 1612274555, "upvotes": 5}, "glqamd7": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glqamd7/", "text": "I hear you totally. I’m a historian, I started my\nPhD in October 2020 after working on my\nMasters. I live in the UK and feel totally thrown under the bus by the government. \n\nI’m at the point where I work really long hours but make little to no progress as I’m at home and have lost motivation.  I need to travel for my PhD to a different country but am limited due to a mixture of Britexit and COVID. I’m a shy person and have got worse as I’ve got older (mid 30’s). I’ve lost touch with most of my friends now as have little reply from any of them so given up. Where I would be able to network this has gone. My supervisor is fantastic and keeps me going, but I’m sick of zooms and teams.  I’m at the stage as well where I don’t sign up for some conferences or even the virtual drop in run by the societies etc as it just doesn’t work for me. \n\nI’m at a point of thinking of deferring or quitting, I try to stay positive but im losing all hope. It doesn’t help when I see how my government in the UK are handling things and it feels that they keep changing things not for the best of reasons.", "author": "Denule84", "created": 1612274485, "upvotes": 3}, "glqa9fa": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glqa9fa/", "text": "It's the same for everyone I know, though. Or worse. My friends who worked in offices now stay home all day. My mom works in a restaurant, how she is even making enough money I have no idea. Plus, she's walking around people eating indoors, with no vaccine in immediate availability. My grandparents are finally on the list, but they're still stuck at home because it would probably kill them. \n\nI'm tired of zoom seminars, but really I just think it sucks for everyone and it's going pretty well for me in comparison to many people. My paycheck is unaffected. I go into lab some, which is a change of scenery and gets me exercising for the bike commute. I'm not struggling to get enough food to feed a family, or about to be evicted, or laid off, so I feel lucky most of the time. Or at least I try to figure on that when I am stuck in the mental doldrums.\n\nFeel you on the lack of celebrations. Sharing food and spending time with other people to celebrate accomplishments is very missed. We just finally got a paper out and... I guess the champagne goes on the shelf until we can drink it together?\n\nEdit: but I am also a champion at compartmentalizing, so I'll probably feel worse about everything when it's \"over.\"", "author": "rebelipar", "created": 1612274308, "upvotes": 13}, "glq6r6q": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glq6r6q/", "text": "I hate to add to this because it all sounds so sad. I'm starting my Master's program in August, and I was beating myself up for spending an extra year off between undergrad & grad, but this makes me kinda glad I did? My MA is a one year program, and I certainly wouldn't want to spend it like this. I know it might not be *much* different in the fall. My heart breaks for you all.💔", "author": "sloanieg", "created": 1612272502, "upvotes": 3}, "glq688x": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glq688x/", "text": "You should be doing it for yourself.\n\n>we can’t celebrate milestones\n\n>I don’t have anyone to talk ‘STEM’ with\n\nYou are in it for entirely the wrong reasons if these are your complaints. Covid has offered a distraction free period we are unlikely to see again. Video chat, MS Teams and other tools have made collaborating more seamless than when everything was open. If you can’t talk to people, you aren’t trying or nobody wants to talk to you.\n\nI’m tired of all the complaints and self absorbed whining that gets posted here.", "author": "FeistyHelicopter3687", "created": 1612272212, "upvotes": -21}, "glq5ygs": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glq5ygs/", "text": "I defended my PhD last July and still haven't been able to do anything about it. No convocation, no bars with friends, nothing. Just cut your emotional losses and accept that this is complete shit. It was shit before, now it's like wading through an entire shit swamp. Fuck academia.", "author": "purple_ombudsman", "created": 1612272060, "upvotes": 31}, "glq0axy": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glq0axy/", "text": "Here goes my rant:\n\nI started my programme in Fall 2020, it's been online and so far I have no clue what's going on and how or what I'll be doing over the next 5 or so years. PI isn't always available and she asks me to chill when I ask her anything! It's weird to sit in front of the screen and just google and scan through loads of research papers. Not sure when I can go back to campus and start working in the lab/field. Job opportunities are bad. I don't know my labmates personally. My friends think I'm doing better than them as I'm doing a PhD. I'm at my parent's now, and they think PhD is staring at screens and have been advising me to keep looking for 'better' opportunities (I'm first gen grad in my family). Add to all these, heartbreak from a long time relationship and sad winters. I'm kinda glad I'm not alone in this period of grief but I honestly wish things were better and people had more empathy.\n\nI kinda wish to attend some lousy seminar and have the lousy coffee and sandwich and then complaint about the said seminar, sandwich and coffee and take home a tote bag and some goodies. \n\nI really hope things get better for everyone and may everyone find their motivation back, do good research and contribute to the greater good.", "author": "AnGuinn", "created": 1612268497, "upvotes": 47}, "glpyaem": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glpyaem/", "text": "PhDs were already pretty lonely experiences before the pandemic, and now they are pure torture.", "author": "Piledhigher-deeper", "created": 1612267015, "upvotes": 34}, "glpxuv0": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glpxuv0/", "text": "I understand what you are saying, it’s definitely difficult right now. At the moment I am in the process of carrying out interviews for my research. Not sure how this will impact my writing (since I cannot meet my participants in person). \n\nI wish you the very best, try some self care and other things that help you remember why you started. Envision the future and remind yourself you have less time to go than you did before you started, say by day, little by little, you will make it happen!", "author": "Professional_Zeal", "created": 1612266686, "upvotes": 3}, "glpvrb6": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glpvrb6/", "text": "I'm pretty introverted, so the social distance/isolation doesn't bother me as much as some, or so I thought until I visited family for the holidays. Being away from family wasn't really that difficult when I had friends to see all the time, but now that I can't do that it's much harder. I also think that some professors think that work/research needs to continue at the same pace as before, and maybe there's validity to that mentality idk, but it's difficult. I'm also having trouble focusing on work and research because every day is pretty much the same. Being able to go into my office provided some regularity, but my apartment is so small I don't really have the space to create a home office so I end up spending all day, every day, in bed.", "author": "False-Guess", "created": 1612265005, "upvotes": 23}, "glpp1d8": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glpp1d8/", "text": "I’m an MRes student and I feel like this too. I feel so distanced from the idea of being an academic now, I’m hating it. And when things get difficult I’d normally be able to talk it out with friends in the office, or in a cafe, but I’m just stuck at home. It’s so hard to find creative solutions to problems too", "author": "beautyonthebiside", "created": 1612259141, "upvotes": 5}, "glplxwm": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glplxwm/", "text": "And my supervisor has clearly taken too much on since it takes them upwards of a week to get back to me after I send things they asked for. It’s so frustrating especially because I’m also in my first year and I’m spending it staring at Microsoft teams.", "author": "Weekend_metalhead", "created": 1612256326, "upvotes": 16}, "glpeypz": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glpeypz/", "text": "You put into words what I have been feeling for months now. I am in my third year. I feel like so much of my grad school experience is being taken away from me. I've stopped signing up for virtual conferences because I just hate them. I am not getting anything out of this experience right now except stress and doing extra lab work to compensate for the fact that we can't have undergrads in the lab right now (undergrads can't be in without a grad student, but there's a one person in the lab rule due to space.) No networking. No eating lunch with my cohort. No interesting seminars. No social events. No celebratory happy hour beers. \n\nI hate it. If I wasn't already 3 years in I would defer. It is so, so demoralizing and feels like all of the worst parts about grad school with none of the things that make it worthwhile. \n\nGrieving is a good way to put it. I definitely mourn the experience I was having prior to the pandemic. I'm not going to get this time of my life back.\n\n/end rant lol", "author": "CurvyBadger", "created": 1612250280, "upvotes": 71}, "glpd28k": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glpd28k/", "text": "I've become so detached from the whole experience. I work on it daily but the progress over this past year feels so intangible, and I can't relate to the idea of myself as a scientist anymore. I feel like I am working in a void on meaningless problems, with no connections, friends, or professional purpose... which is disconcerting as I am in my fourth year and my mid thirties.", "author": null, "created": 1612248847, "upvotes": 115}, "glp9jsi": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glp9jsi/", "text": "I WANT MY FREE FOOD.", "author": "UnspectacularAim", "created": 1612246267, "upvotes": 151}, "glp8p9m": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glp8p9m/", "text": "Amen 🙏", "author": "JanSnolo", "created": 1612245663, "upvotes": 10}, "glp5108": {"link": "/r/GradSchool/comments/lanrdk/a_phd_in_a_pandemic_rant/glp5108/", "text": "Yup. Not only is this making an already VERY stressful experience more stressful but I'm still buttmad about not being able to take advantage of the allotted funding to travel to new places for conferences. Instead I get to just sit at home and try to focus on my screen for hours.", "author": "bottledutopia", "created": 1612243197, "upvotes": 199}}}