{
  "sid": "qvo6i9",
  "link": "/r/GradSchool/comments/qvo6i9/need_advice_on_phd_clin_psych_psyd_programs/",
  "title:": "Need advice on PhD (clin psych) & PsyD programs",
  "text": "I've always been told that you should never disclose your own struggles w/ mental health issues as your motivation for pursuing a doctorate during interviews. Does this also apply to friends and/or family members? Where is the line drawn?",
  "author": "Disastrous_Fig_3762",
  "created": 1637114387,
  "updated": 1637182636,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkxy46h": {
      "link": "/r/GradSchool/comments/qvo6i9/need_advice_on_phd_clin_psych_psyd_programs/hkxy46h/",
      "text": "Never seems a bit extreme.  I don’t think it either gets you in the door or ends with the door slamming in your face.  It’s just not surprising that it’s the case and it’s very common.  Most people go into psychology because they are interested in themselves and other people.  And it’s fine if your own experiences or family experiences sparked your initial interest.   Concerns do arise if there is a sense that these challenges may compromise your ability to successfully complete your graduate studies or clinical training in a timely manner.  However, these things are typical starting places.  Tell them what you did after your initial was sparked.  What’s maintained your interest? How have you engaged with psychology since that time? How have you expanded you’re knowledge and experiences beyond your personal experiences? Unless you communicate these or other things it sort of leaves the assessors with the feeling of is that all?  If you go on and on about it, it’s not been very long and the issue was not effectively dealt with it can backfire and end up raising concerns.",
      "author": "DicaxErsatz",
      "created": 1637119150,
      "upvotes": 2,
      "replies": {}
    },
    "hkzp0jh": {
      "link": "/r/GradSchool/comments/qvo6i9/need_advice_on_phd_clin_psych_psyd_programs/hkzp0jh/",
      "text": "I think the key element is to avoid uncomfortable over sharing. For example, I would avoid something like, “My mother had schizophrenia and often screamed at us and left us alone while I was growing up. It was very scary and made me depressed, and now I want to help people with schizophrenia.”\n\nYou could briefly say something broad like, “I first became interested in clinical psychology when a loved one experienced some challenging mental health issues. Since then, my interest has evolved (in this way).” \n\nAnd you want to base it on more than just your friend/family/self. There should be other elements to your motivation/goals",
      "author": "Jwalla83",
      "created": 1637159654,
      "upvotes": 2,
      "replies": {
        "hl011ms": {
          "link": "/r/GradSchool/comments/qvo6i9/need_advice_on_phd_clin_psych_psyd_programs/hl011ms/",
          "text": "This is helpful. Thanks.",
          "author": "Disastrous_Fig_3762",
          "created": 1637164720,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}