{"sid": "pp10m0", "link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/", "title:": "considering dropping out of my masters program at week 3. I cant keep up.", "text": "Today is the last day to drop classes without penalty. I'm thinking of withdrawing from the entire program. \n\nI currently work full time and also take 3 classes, so I am considered full-time in graduate school. We just had a 10-point quiz today and although I was almost up all night reading the research articles to discuss in class today, I still am almost sure I got a zero or a very low score on the quiz. I can't possibly go to work full time and do all of these classes and excel. A B- is a failing grade in my program. Although I am trying to tell myself that a 10 point quiz is not going to determine my whole grade, I feel like it's just going to keep getting worse from here on out. We NEVER had pop quizzes when I was in undergrad. Even when I'm reading research articles, it is very hard for me to not focus on details and focus on the main picture like I am supposed to. I also have a very, very hard time retaining information and understanding the words.\n\nHaving a full time case management job is not helping me but I can't just up and quit, I'm dealing with health problems and need the insurance; I turn 28 next week. I haven't been in school since 2016 and it's really hard for me to adjust. I truly believe that I am not smart enough for this program and it is really embarrassing. I can't think critically. I can't contribute to conversations. Even if I read the material, I don't retain and cannot explain it when I am quizzed on it. Almost all of the questions on the quiz today were short answer and I did my best but I know it wasn't totally right. \n\nThis is why I didn't go back to school for 5 years. I couldn't handle it, emotionally. Now I really can't handle it. All of my peers are 22-23 years old and can keep up and I can't... I hate myself.", "author": "peanutpadthai", "created": 1631746504, "retrieved": 1632844222, "over_18": false, "upvotes": 38, "upvote_ratio": 0.9, "comments": {"hd4tgrv": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd4tgrv/", "text": "Omg I’m in the same exact position. I feel like I can’t contribute a lot even when I read the materials and prepare for the class. I’m working full time and have health issues that I’m dealing with. I completely understand what you are saying. It is a lot to handle. I am giving myself more time to get acclimated to it and hopefully it will get better. Hang in there!", "author": "sprinlover", "created": 1631829487, "upvotes": 1}, "hd3x54v": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd3x54v/", "text": "Just remember to always research the flexibility of a program before you apply. I entered a masters program that considered 2 classes to be full time and it’s designed 100% for people who already work full time. I feel that if I didn’t have a program like that. It would have been way harder. Don’t feel like a failure, it just may not be a good fit. Maybe wait until you get your score back, who knows, you may not have failed. And my program is the same, B- or higher but since they are more flexible (online classes, in person, various locations, friendly professors) it has been helpful.", "author": "cookie058", "created": 1631816106, "upvotes": 1}, "hd3khfp": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd3khfp/", "text": "Whatever you decide to do, please don’t tell yourself that you can’t do it because you’re not smart enough. You simply just don’t have enough time in the day to do both. You may be thinking that “smart” people will read the research articles and get it right away. In truth, they are probably spending hours reading, taking notes, and trying to fully understand everything. You simply do not have that kind of time given your job. This has nothing to do with your intellect or ability to think critically.", "author": "You_Stole_My_Hot_Dog", "created": 1631811004, "upvotes": 1}, "hd2qgim": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd2qgim/", "text": "Dude slow down. Take 1 class a semester. You can’t work that much outside and inside of school.", "author": "Auzaro", "created": 1631798551, "upvotes": 1}, "hd2lk0t": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd2lk0t/", "text": "You thought working full time and taking three Gradschool courses at once was possible?", "author": "flyonwall_", "created": 1631796128, "upvotes": 0}, "hd2inqo": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd2inqo/", "text": "Hey, I’m reading a lot of your replies and it sounds like you’re doubting yourself and your abilities. \n\nThere’s NOTHING wrong or inadequate about you. Graduate school has a way of making us all doubt ourselves, our intelligence, and whether we belong.\n\nPlease be kind to yourself and give yourself grace. Being an adult is fucking hard by itself without being an adult student. Graduate school with a full course load IS a full time job. So basically you have enough on your plate to be working two full time jobs. \n\nWhatever you decide just remember that you are not defined by your grades, your degree or what anyone thinks of you. If you have to drop out, that’s okay. School will always be here. You’re wiser now and know what you might need next time you go for it!", "author": "raeee_0710", "created": 1631794540, "upvotes": 1}, "hd2fj7s": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd2fj7s/", "text": "I did part time for courses that require a lot of attention. Two classes is a lot in graduate school. Then did three (two classes and internships).", "author": "Round-Life-1108", "created": 1631792698, "upvotes": 1}, "hd2fcki": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd2fcki/", "text": "Are you in a part time MSW program? Same here. You've got this. Bring it up with the professors and they're generally super accommodating. Be warned about field practicum though, that's taking on a PT job and might require leaving your current. The MSW pay is generally far and above case worker pay, and LCSW even more so. Pick the priorities for your future and go with those. You've got this stranger, god speed.", "author": "noprofiles", "created": 1631792583, "upvotes": 1}, "hd2ctma": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd2ctma/", "text": "A couple of questions, because I'm really feeling sketchy about your grad program.\n\n1) Is student health insurance for graduate students not available? At my program, it was about 1200/yr for GREAT coverage; like, better than my job.\n\n2) you don't have advisors? Do you have some sort of faculty member who's tasked with helping you get through the program successfully? Or are you just being left floundering?\n\n3) You're only in your 20s. Many people start grad school in their 30s or 40s. You're genuinely the oldest student there?\n\n4) Where are the support services? First of all, if you're struggling to understand and retain information from articles, you should be supported through some sort of student support center that offers one on one tutelage. Where is that?\n\n5) Is there a career center with folks to speak to? I found although ours was mostly geared toward getting jobs afterward, they were a super supportive resource for navigating work+school.\n\n6) You're not being paid to participate in this program? Do you have scholarships? Are you paying out of pocket? Is this a for-profit school?\n\n7) You never had quizzes in undergrad? What was your major? How were you usually scored?\n\nJust know that you are not at all a failure -- I'm mad on your behalf that a program would accept a student and then offer them zero support when they need it!", "author": "alezsu", "created": 1631790964, "upvotes": 4}, "hd26vdf": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd26vdf/", "text": "Hey there, you might consider dropping one class (this one obv) to give you some relief. I’m also working full time and I’m grad school and my first semester was outright brutal. Talk to other students, see about study groups. Etc. If you do drop, it’s okay! You can come back later if you want. Sometimes timing isn’t right.", "author": "LookingforDay", "created": 1631786384, "upvotes": 1}, "hd25dgq": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd25dgq/", "text": "I’m in a similar boat. I’m 29 and turn 30 next month. I just started a masters program and am going into week 3. I’m doing 2 classes both of which were part of my undergrad major. Yet, I’m so rusty and making dumb mistakes in the hw.\n\nIt’s good to take a hard look at your workload. Maybe drop 2 classes and focus on one class for this semester? Masters program advisors especially for part-time programs aren’t always the most accessible or helpful. It’s largely self-guided from what I’m learning.\n\nDon’t be totally disheartened. I’d say give it a shot but reduce your workload so pick the one class you’re best at where you currently have the best grade and go from there. Managing your time is an exercise in self-awareness and it’s important to get the learning you seek out of the program. Don’t rush and don’t beat yourself up. All the best!!", "author": "RavenKlaw16", "created": 1631785015, "upvotes": 1}, "hd1h3hl": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd1h3hl/", "text": "Could you qualify for medicaid if you went part time at work? Most states require you to be working or going to school full time, sometimes just one.", "author": "a-deer-fox", "created": 1631765661, "upvotes": 2}, "hd1fgcl": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd1fgcl/", "text": "You're doing too much trying to be full-time in grad school and a job at the same time. There's no way you can keep up with both, and if by some miracle you did for a while it would be at the expense of something else such as your health. I think you have to make some hard choices, and unfortunately you don't have a lot of time to decide. If your courses aren't going well, can you drop two of them and keep just one? Or can you drop your courses but leave the door open to coming back in the spring after you regroup and have time to make a plan to support yourself while you're in school?", "author": "eleveneels", "created": 1631764701, "upvotes": 3}, "hd14k7h": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd14k7h/", "text": "[deleted]", "author": null, "created": 1631759021, "upvotes": 46}, "hd116qk": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd116qk/", "text": "I just had to get out of a program because of the same issues. I still feel a bit guilty like I should have been able to do it. It was a masters program for Management information systems. I know for a fact that data isn’t going anywhere and the people that can get through that program are going to make bank. I just wasn’t one of those people. I know it’s easier said than done but don’t beat yourself up. I’m 27 and I haven’t even got my career started and I have a whole masters degree already. I hope your situation gets better I really do. Take care of yourself.", "author": "HungryDragon93", "created": 1631757413, "upvotes": 2}, "hd10s61": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd10s61/", "text": "You could consider dropping down to part-time classes? Full time job and full time school is two full time activities, of course that’s too much for most people.", "author": "HouseNegative9428", "created": 1631757221, "upvotes": 16}, "hd0wrrg": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd0wrrg/", "text": "Hey! Feel free to PM me. I am dropping out of my program, one with a lot of prestige from a big brand name school after years of wanting my masters because after further inspection…. The program is not what I want or need. I’m reapplying to other schools this cycle. I also have health problems and work full time but I was only taking 6 units. It’s just not worth it. Nothing is worth sacrificing your health. There are so many programs out there. I would encourage you to not feel bad about dropping out if that’s something you feel like doing. You can always come bwck", "author": "Mysterious_Donut_750", "created": 1631755336, "upvotes": 12}, "hd0n19g": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd0n19g/", "text": "Maybe it’s the program that’s the problem - maybe it’s just not a good fit. I’m doing pretty well in a PhD program right now but if my classes were like that, I definitely wouldn’t be! That sounds extremely stressful for anyone, let alone with a job top of that. No possibility of health insurance through the university or through Medicaid so you can quit the job to focus on school?", "author": "xenondeadtime", "created": 1631750749, "upvotes": 10}, "hd0g1nk": {"link": "/r/GradSchool/comments/pp10m0/considering_dropping_out_of_my_masters_program_at/hd0g1nk/", "text": "Call, text, or chat with your advisor ASAP to see what kind of help is available and what they recommend in your case. They've seen situations like this before.", "author": "PM_YOUR_MANATEES", "created": 1631747411, "upvotes": 63}}}