{
  "sid": "qa6r8b",
  "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/",
  "title:": "Can someone think of a professional way to say this?",
  "text": "What I want to say to my supervisor is this:\n\n>\"Bro straight up I am not feeling it and I'm not jamming with the work and have no motivation\".\n\nThat's literally it, I want to say that I'm lacking motivation and struggling to see the big picture but that's really unprofessional isn't it?\n\nWould it be better to perhaps say\n\n>\"I'm a little unsure about the big picture and I'm struggling to work towards it because I don't feel that my current knowledge/ output enables me to confidently reach it\"?",
  "author": "Erwin_Schr0dinger",
  "created": 1634501792,
  "updated": 1634655418,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.93,
  "comments": {
    "hh12gex": {
      "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/hh12gex/",
      "text": "Try the first, you never know 😂\n\nThe professional version sounds fine, assuming you’re going to use specifics. Your lack of motivation may well be caused by a lack of direction so hopefully thrashing it through with your supervisor will reinvigorate your studies. \n\nGood luck!",
      "author": "singinhallelujahtoem",
      "created": 1634503746,
      "upvotes": 29,
      "replies": {}
    },
    "hh19ggm": {
      "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/hh19ggm/",
      "text": "What’s your relationship with your supervisor like? I 100% sent mine emails like the first, and worse 😂 Honestly, sometimes you just have to say what you’re actually feeling. \n\nBut if it’s not an option, I think the second is good, but I would be a little more direct. “I’m struggling with reaching/achieving (x particular method or project or experiment) because I don’t feel confident in my understanding of (x). It would be really useful for me to clarify this with you in terms of the big picture of the project so that I can continue my work.”\n\nOne thing my supervisor did hate was me complaining without asking for help with something concrete - she was totally cool with my ranting for 15 minutes about how I wanted to give up and work on inventing time travel instead so that I could go back to before I started a PhD, but I also had to specify what I needed from her to get over it.",
      "author": "butforevernow",
      "created": 1634506762,
      "upvotes": 14,
      "replies": {}
    },
    "hh2cnhh": {
      "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/hh2cnhh/",
      "text": "\"I'm unsure about the big picture/future of the project and I have no motivation as a result\"",
      "author": "ning7",
      "created": 1634525861,
      "upvotes": 4,
      "replies": {}
    },
    "hh1ck35": {
      "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/hh1ck35/",
      "text": "I think it may depend on the generation or background of the recipient. When I started to read the first sentence my first thought “What the hell are they taking about?!”",
      "author": "UleeBunny",
      "created": 1634508127,
      "upvotes": 2,
      "replies": {}
    },
    "hh2gtvi": {
      "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/hh2gtvi/",
      "text": "I’m about to have this same conversation with my advisor this week. It feels a bit awkward because I don’t want to come off as ungrateful, but at the same time this project has zero direction and it’s killing my motivation completely.",
      "author": "AccomplishedBanana16",
      "created": 1634528126,
      "upvotes": 2,
      "replies": {}
    },
    "hh72v4n": {
      "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/hh72v4n/",
      "text": "Ask to do something to do a literature review together. Tell them that you feel like getting a foundation will help you understand the problem and your approach. Make a PowerPoint that review the literature. Do a single slide for every paper. Establish a problem. And propose a solution. Or if they have one. Tell them how you understand it.",
      "author": "LegallyThrownFarAway",
      "created": 1634617314,
      "upvotes": 1,
      "replies": {}
    },
    "hh2sk6t": {
      "link": "/r/GradSchool/comments/qa6r8b/can_someone_think_of_a_professional_way_to_say/hh2sk6t/",
      "text": "Depends. If you’re confident that you’re doing as good a job as anyone could do you can say the first. If you’ve been slacking and are therefore not getting as much out of your research as you could maybe wait it out sport.",
      "author": "greens_giga_chad",
      "created": 1634535525,
      "upvotes": 0,
      "replies": {}
    }
  }
}