{
  "sid": "qt6vay",
  "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/",
  "title:": "Serious: how do you make friends?",
  "text": "I'm back in the office and literally have no idea how to make friends with the people I'm with. I've tried so much to chat with them and introduce myself but I still can't make friends :( \n\nI keep thinking that they probably see me as the office weirdo and I feel very isolated and self conscious because of it. Literally what can I do to make myself seem less awkward and more approachable?",
  "author": "Nuclear_Fermion",
  "created": 1636827431,
  "updated": 1637182732,
  "over_18": false,
  "upvotes": 70,
  "upvote_ratio": 0.97,
  "comments": {
    "hkhxhcf": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkhxhcf/",
      "text": "I found the best way for to make friends was to start by being a better friend to myself. I know it might sound corny, but making friends with myself is actually the best practice I could ever get. It also takes a lot of the discomfort out of making friends with other people, because I've diminished the potential risk that a poor interaction will come back to haunt me through self-criticism or the influence of exterior judgments. From there, I am more comfortable initiating interactions when I actually want them, which makes for higher quality interactions when they do occur.\n\nYou are enough just as you are.",
      "author": "EtTuSouffle",
      "created": 1636835444,
      "upvotes": 71,
      "replies": {
        "hkjrqpt": {
          "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkjrqpt/",
          "text": "Yo. This 🙌.",
          "author": "yaneeda",
          "created": 1636865050,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkhf9vd": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkhf9vd/",
      "text": "Friendship isn't a switch.  It's a plant.  It's gotta grow naturally.\n\nHaving said that, try out \"Hey do y'all wanna go grab some coffee real quick?\". Ask a group of a few at a time so there's no misunderstanding of intention.  \n\nA few times of that, then it's \"hey I'm gonna grab lunch, y'all wanna come?\"",
      "author": "hixchem",
      "created": 1636827663,
      "upvotes": 41,
      "replies": {
        "hkjwlm7": {
          "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkjwlm7/",
          "text": "Funny how I was in adult school that on the way out we walked towards the same way and just started talking.\nIt.comes naturally sometimes awkward but you gotta jump in.\nOther's didn't really talked back so you could see who wasn't socially viable so you leave those behind.\nSucks that I didn't get some people's socials or numbers since covid hit without knowing it was gonna shut us down for 2 years and going.\nI regret not getting their numbers they were chill.",
          "author": "JAKEDICARLO",
          "created": 1636867543,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkkjszk": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkkjszk/",
      "text": "Also understand that some office environments may not be conducive to making friendships, other than normal chatting. Offices also have people with special characteristics. They may be competitive, selfish, suspicious etc. Once you start to recognise these things, you will doubt myself less. Being happy with yourself is more important.",
      "author": "Kingarvan",
      "created": 1636883420,
      "upvotes": 5,
      "replies": {}
    },
    "hkhgn7i": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkhgn7i/",
      "text": "I attended a virtual conference and the whole time I was worried if I was misspeaking. Being socially isolated has really impacted my self esteem.",
      "author": "redditknees",
      "created": 1636828260,
      "upvotes": 11,
      "replies": {}
    },
    "hkj4e4v": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkj4e4v/",
      "text": "Making friends is often times one of those things that happens accidentally.",
      "author": "MrUnknown1996",
      "created": 1636854093,
      "upvotes": 7,
      "replies": {}
    },
    "hkj8mpc": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkj8mpc/",
      "text": "My Grad school was harsh, too much of a toxic environment. Try to have a hobby or people outside that context. I met my fiancée on Tinder, that app helped wonders.",
      "author": "SamuelFontFerreira",
      "created": 1636856010,
      "upvotes": 5,
      "replies": {}
    },
    "hkiue5o": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkiue5o/",
      "text": "I’m having the exact same experience! I’m trying so hard to make friends with the folks in my lab and making conversation is a lot of work sometimes",
      "author": "Ashamed-Dust-2430",
      "created": 1636849555,
      "upvotes": 2,
      "replies": {}
    },
    "hkjl1n6": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkjl1n6/",
      "text": "What is your body language and tone of voice like?",
      "author": "Sniffalisp",
      "created": 1636861827,
      "upvotes": 1,
      "replies": {}
    },
    "hklbzjt": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hklbzjt/",
      "text": "I am generally a picky friend maker, I just click with very few people but I do find these people often. But I only really get a glimpse of them when I go out with them for a coffee or hang out for a while. Get to know their interests and see if it matches mine. Try to look for some red flags. That sorta thing.",
      "author": "Blankifur",
      "created": 1636901035,
      "upvotes": 1,
      "replies": {}
    },
    "hkqwl5v": {
      "link": "/r/GradSchool/comments/qt6vay/serious_how_do_you_make_friends/hkqwl5v/",
      "text": "Snacks!\n\nI'm not telling you to \"buy\" your officemate's friendship, but I find that sharing with my officemates has helped. This is the 1st semester I spent at the office (due to COVID), and I found that my officemates and I connected very easily and very quickly over food.   \n\n\nAnd don't worry... it'll come to you. :) Friendship comes to slower to some people... including myself.",
      "author": "j_ur_ak",
      "created": 1636999673,
      "upvotes": 1,
      "replies": {}
    }
  }
}