{
  "sid": "q5sr44",
  "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/",
  "title:": "How did you know grad school was the way to go?",
  "text": "I’m currently an undergrad and I graduate in the spring with a BA in International & Comparative Politics with a focus on environmental policy. \n\nI’ve poured over many articles online and I even found some grad programs that I would love to pursue. I know grad school is no joke. I’m a first gen college student and all of this is overwhelming.",
  "author": "phantom9088",
  "created": 1633947382,
  "updated": 1634099740,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hg7q7s3": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg7q7s3/",
      "text": "What jobs I wanted to do and what education requirements they had is what pushed me to grad school.",
      "author": "MotvStr",
      "created": 1633949179,
      "upvotes": 35,
      "replies": {
        "hg7taly": {
          "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg7taly/",
          "text": "Thank you!",
          "author": "phantom9088",
          "created": 1633951576,
          "upvotes": 4,
          "replies": {}
        },
        "hg9d05o": {
          "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg9d05o/",
          "text": "Yup I totally second this. I knew I wanted to do evolutionary bio research and basically the only way to is to go to grad school. \n\nI've heard from my advisor, more advanced grad students, my committee members and others that a PhD should just be viewed as a license to work the work you want to do.",
          "author": "KiwiTheKitty",
          "created": 1633977629,
          "upvotes": 2,
          "replies": {}
        },
        "hgah1rg": {
          "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hgah1rg/",
          "text": "This. In chemistry you can't do shite with a BS.",
          "author": "rthomas10",
          "created": 1633996055,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg807in": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg807in/",
      "text": "Do you want to pursue a career related to politics and/or environmental policy? If so, I’d recommend starting your career first. Find a job in that industry to first see if it’s a good fit that you want to continue with and to narrow your interests.\n\nIf after a few years of working you find that having a masters degree is going to help your career, go for it! An MPP, MPA, or MA in a relevant field seems like it might certainly be very helpful. Some employers will even pay for your masters degree! Anecdotally as well, I’m in a related MA program right now. There’s tons of mid-career students in both my program and the MPP program at my school.",
      "author": "ThrowawayHistory20",
      "created": 1633956088,
      "upvotes": 14,
      "replies": {
        "hg80gpi": {
          "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg80gpi/",
          "text": "I do, this time. Thank you so much! This is the best piece of advice I’ve received!",
          "author": "phantom9088",
          "created": 1633956237,
          "upvotes": 3,
          "replies": {
            "hg86f46": {
              "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg86f46/",
              "text": "The added bonus is that having a few years of good professional experience will boost your CV so much! You’ll probably get into a higher caliber program and/or get funding offers that you wouldn’t get if you applied right now.",
              "author": "ThrowawayHistory20",
              "created": 1633959434,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hg88iob": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg88iob/",
      "text": "When all the jobs I wanted required me to get a grad degree.",
      "author": "iammaxhailme",
      "created": 1633960449,
      "upvotes": 7,
      "replies": {}
    },
    "hg8ri0y": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg8ri0y/",
      "text": "I wasn't satisfied with the amount of knowledge I acquired with a BS degree. I didn't feel particularly educated and I wanted to delve deeper into some questions I had about my field, so I pursued a MS degree. I felt the same way when I graduated with my MS degree, so I applied to a PhD program. At least with a PhD program, I feel more confident that, while I might not know the answer to whatever question I might have, I will have the skillset to better able to come up with an answer on my own. It's one thing to aimlessly pontificate, it's another to contribute intelligently to a discussion about a field where two people have three opinions (politics). \n\nI am also first gen, so I also kind of figured that if I was the first in my family to go to college, why not also be the first in my family to get a PhD?",
      "author": "False-Guess",
      "created": 1633968761,
      "upvotes": 5,
      "replies": {}
    },
    "hg8qhwc": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg8qhwc/",
      "text": "I am getting a grad degree because I need it to have a better chance at immigration and getting a job in my field, as my undergrad is not at all related to the field I am in now. \n\nDeciding about grad school can be overwhelming if you don't have people who have done it to help you. Does your current program have advisors you can talk to about what going to grad school would mean for you career-wise? You also don't have to go directly into grad school. Taking a year or two to work and explore can help you to not only figure out if you want/need a graduate degree but also what exactly you want to be doing in one. You'll have a much clearer sense of what you want that way. From graduating undergrad in 2018, I didn't start a grad program until 2020 and I then switched programs this year (I got into my dream program, which really cinched the switch for me). If I had gone directly into grad school from undergrad, I would have been in a totally different field and I would not be as excited by what I was doing. Don't be afraid to take your time!",
      "author": "starryeyesmaia",
      "created": 1633968335,
      "upvotes": 3,
      "replies": {
        "hg94bo2": {
          "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg94bo2/",
          "text": "I worked full time  for a year in property management while also studying full time. \n\nIt’s very difficult to get help from my school advisors because I go to a small private school in which the student body is made up mostly up rich kids who are children of politicians/business people. \n\nSo a lot of them have a bunch of stuff lined up for them.",
          "author": "phantom9088",
          "created": 1633974002,
          "upvotes": 0,
          "replies": {
            "hg94vk0": {
              "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg94vk0/",
              "text": "Working full time while studying full time is not the same as taking time between undergrad and potential grad school to figure yourself out. I worked full time for two and a half out of my four undergrad years and I still needed that time after to reorient myself when I didn't have undergrad to deal with anymore.",
              "author": "starryeyesmaia",
              "created": 1633974224,
              "upvotes": 3,
              "replies": {
                "hg95iy2": {
                  "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg95iy2/",
                  "text": "Yes, you’re right. Thank you. \n\nI also did learn from that industry, I like it but not something I would like to work in for a long time.",
                  "author": "phantom9088",
                  "created": 1633974481,
                  "upvotes": 1,
                  "replies": {
                    "hg963fm": {
                      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg963fm/",
                      "text": "That's a good thing to have learned. You could try to find something in line with your degree or your desired career - that way you get experience in that and you start to figure out if you need a master's to progress and if so, what specific subjects interest you more. Taking time to work doesn't have to be in unrelated jobs. In my original master's program, most of my classmates were in their careers already, doing their master's to pivot their positions or to be able to keep progressing or just because they really loved the subject and their job was willing to fund them going back for a master's.",
                      "author": "starryeyesmaia",
                      "created": 1633974710,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hg7sy1m": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg7sy1m/",
      "text": "Find graduate school that drastically increases your salary cap and where there are industries willing to pay for graduates with that degree + from that school.\n\nOtherwise you’re just lighting money on fire because you have an expensive hobby “just how to pursue.”",
      "author": "Weekly-Ad353",
      "created": 1633951321,
      "upvotes": 7,
      "replies": {
        "hg7t9tc": {
          "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg7t9tc/",
          "text": "Thanks. That’s why I feel I messed up with my current major.",
          "author": "phantom9088",
          "created": 1633951560,
          "upvotes": 2,
          "replies": {
            "hg7teci": {
              "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg7teci/",
              "text": "It’s pretty common.",
              "author": "Weekly-Ad353",
              "created": 1633951650,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg8vtn5": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg8vtn5/",
      "text": "I knew I had an end goal of working as a research physicist at a government lab. That required me to get a PhD in physics. That is the main reason I decided to go to grad school. Anything else is just window dressing.",
      "author": "DoctorWatchamacallit",
      "created": 1633970542,
      "upvotes": 2,
      "replies": {}
    },
    "hg8xciu": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg8xciu/",
      "text": "Masters is the baseline for what I do - artificial intelligence, so the choice was obvious.",
      "author": "HuntersMaker",
      "created": 1633971163,
      "upvotes": 2,
      "replies": {}
    },
    "hg92s1c": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg92s1c/",
      "text": "When I learned I wouldn’t survive in my industry without at least a masters.",
      "author": "MrUnknown1996",
      "created": 1633973386,
      "upvotes": 2,
      "replies": {
        "hg94czg": {
          "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg94czg/",
          "text": "May ask what industry?",
          "author": "phantom9088",
          "created": 1633974017,
          "upvotes": 1,
          "replies": {
            "hg94xti": {
              "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg94xti/",
              "text": "Archaeology",
              "author": "MrUnknown1996",
              "created": 1633974250,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgaensi": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hgaensi/",
      "text": "Hi! I’m pursuing a masters in IR and my area of focus is queer security in Sub-Saharan Africa. \n\nI wanted to get my masters because I absolutely needed a change in career. I sold cars for 7 years after undergrad and the pandemic really put things into perspective for me. Because I want to go into human rights, I felt like my experience wouldn’t be sufficient for the career change I wanted for myself. So I’m treating these two years as job training. I’m currently working with a human rights group from El Salvador for a human security course I’m taking, and I wrote a paper that is being published as a chapter in a book in west African identity politics. Projects like these wouldn’t have been available to me if I had directly applied for human rights jobs. But this is setting me up better for the future.",
      "author": "Nam3Tak3n33",
      "created": 1633994869,
      "upvotes": 2,
      "replies": {}
    },
    "hgbz9qj": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hgbz9qj/",
      "text": "As another environmental policy person, I knew I wanted to go to grad school because I really enjoyed researching and learning about environmental policy and justice but also because most careers that I wanted to do in the field required it! Straight out of undergrad I wasn’t qualified for what I wanted to do even with relevant work experience so it really reinforced my desire to pursue graduate education",
      "author": "raviolu",
      "created": 1634027492,
      "upvotes": 2,
      "replies": {}
    },
    "hg9n1k8": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg9n1k8/",
      "text": "I have very narrow interests and being a college math teacher is the only thing I want to do lol",
      "author": "Limit97",
      "created": 1633981951,
      "upvotes": 1,
      "replies": {}
    },
    "hg9n956": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg9n956/",
      "text": "I am 3 years in and still unsure",
      "author": "triggerednormie",
      "created": 1633982044,
      "upvotes": 1,
      "replies": {}
    },
    "hg9y6ol": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg9y6ol/",
      "text": "I was an ESL teacher making a meager amount but the administrators had master's degrees or PhD's which netted them an incredibly comfortable salary. As it should I mean they're administrators...",
      "author": "Casually_Carson",
      "created": 1633986943,
      "upvotes": 1,
      "replies": {}
    },
    "hga89vc": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hga89vc/",
      "text": "I chose grad school because I did very well in undergrad but I didn’t have too much career development / guidance and I figured grad school would give me more direction and time to figure out what I wanted to do.",
      "author": "matveyivanovich42",
      "created": 1633991736,
      "upvotes": 1,
      "replies": {}
    },
    "hgauhhq": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hgauhhq/",
      "text": "I panicked when the pandemic hit and I had just received my bachelors and everything went on a hiring freeze.",
      "author": "lazerlass",
      "created": 1634002441,
      "upvotes": 1,
      "replies": {}
    },
    "hgbfias": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hgbfias/",
      "text": ">How did you know grad school was the way to go?\n\nThere are two main reasons to go to grad school\n\nIt's important to your career goals.\n\nYou're super excited about learning a lot more about a particular area of study.\n\nIf either one of those apply to you, then you could go for a Masters. \n\nIf you aren't sure, then it's worthwhile working for a year or two to gain some perspective after college.  To figure out where you want to be career wise and what you want to study.",
      "author": "raistlin65",
      "created": 1634012360,
      "upvotes": 1,
      "replies": {}
    },
    "hg8uubx": {
      "link": "/r/GradSchool/comments/q5sr44/how_did_you_know_grad_school_was_the_way_to_go/hg8uubx/",
      "text": "It just kind of happened organically.",
      "author": "Plutonium_Nitrate_94",
      "created": 1633970137,
      "upvotes": 0,
      "replies": {}
    }
  }
}