{
  "sid": "q29s0w",
  "link": "/r/GradSchool/comments/q29s0w/im_only_23_with_no_bfa_in_an_mfa_program_help/",
  "title:": "I'm only 23 with no BFA in an MFA program: help.",
  "text": "Hi friends,\n\nIt's my (23F) first semester in a MFA in Studio Arts program. I'm feeling really overwhelmed and like some of my peers (and even professors) don't respect me as much as others. My BA is in urban studies with a minor in Film/media studies. I'm originally a documentary filmmaker but turned into a Video/digital artist, so I have a lot of experience in my area for my age just not much traditional fine arts education. (ie. Drawing, painting, color theory, etc) Most of my art has to do with feminist expression and queerness.\n\nI got close to this guy (Ray) in my year, and he has a friend who's a second-year (Amanda). Amanda can be gossipy and critical. I was surprised how much she was saying about other students in front of me even though I had just met her. Ray seems super nice and we seemed to connect over being the two only openly queer people in our year. Today though we clashed over what a professor said in class last night. The professor asked me if he thought my queerness gave me an advantage in academia which I found super hurtful; the professor isn't queer himself, and it seemed to invalidate my identity a bit. When I talked to Ray about it later, he said he didn't think Prof meant any ill-will, which helped, but when we talked about it more it seemed like he was implying that I need to read more to inform my practice, change some of my approach to my artmaking, etc. \n\nDuring the critique with all three years, I felt like I got little feedback compared to others which was really discouraging. My advisor has been really supportive and says I deserve to be here, but I'm just stressed and anxious. \n\nI'm also navigating late-diagnosed ADD, which isn't very helpful. (very sensitive, trouble focusing, etc.)\n\nMaybe there isn't really any particular advice I'm looking for, just any encouragement would be helpful.",
  "author": "DowntownButterscotch",
  "created": 1633481739,
  "updated": 1634099879,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hfk4n9o": {
      "link": "/r/GradSchool/comments/q29s0w/im_only_23_with_no_bfa_in_an_mfa_program_help/hfk4n9o/",
      "text": "\nYou are what? Not quite at the halfway point of the first semester?\n\nYou're sort of in the lull before the storm of all the projects you'll need to do for the end of the semester. If nothing else, remind yourself that it's time to start focusing on that.\n\nSome people in MFA programs can be highly competitive. And that extends into their personal interactions with others. So you kind have to not give those people headspace.\n\nThat's what an MFA is: an opportunity to focus on your work. So don't let other people interfere with that.\n\nAt the same time, the first semester of graduate school is a lot like the first semester of undergrad. You are still adjusting. You're perspective on things could be a lot different by next semester.\n\nAs far as your professor, it's hard to know what was said exactly based on what little you said. But if you're really concerned about this, go talk to your professor in office hours.  \n\nTake what your professor said at face value as well intended, and ask what your professor thinks that means for your current work, and the direction you might take with your work. You can do that in a non-confrontational way. And that's better to continue speculating on it with your peers.",
      "author": "raistlin65",
      "created": 1633488082,
      "upvotes": 5,
      "replies": {}
    },
    "hfkn590": {
      "link": "/r/GradSchool/comments/q29s0w/im_only_23_with_no_bfa_in_an_mfa_program_help/hfkn590/",
      "text": "I'm so sorry you had that experience and your feelings are definitely valid. Definitely agree that you need to give yourself a good 1-2 semesters to adjust to your program and grad school in general. I've not been in your situation before, but as someone who has been to art school (BFA) and grad school (medical/research field), both really (should) challenge your perceptions about your art practice, knowledge base, and intentions. While you should certainly never lose sight of who you are and what your interests/passions/goals are, you should keep yourself open to growth, including rigorous research and investigation. It will only make you and your art stronger and better. Maybe that's what your friend meant to say, but idk. Grad school and art school are tough, but don't lose sight of why you are there and keep moving forward! Being honest with your friends and/or professor about what you experience and feel and what your motivations are could help. Not trying to make excuses for them but sometimes other people truly just don't get it. Good luck!",
      "author": "seaside1508",
      "created": 1633499038,
      "upvotes": 2,
      "replies": {}
    },
    "hfjuhki": {
      "link": "/r/GradSchool/comments/q29s0w/im_only_23_with_no_bfa_in_an_mfa_program_help/hfjuhki/",
      "text": "Your prof was out of line and IMO you should consider reporting it.",
      "author": "era626",
      "created": 1633482851,
      "upvotes": 2,
      "replies": {}
    }
  }
}