{
  "sid": "d0jja5",
  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/",
  "title:": "How to address inappropriate looks from a professor?",
  "text": "I have a weird problem I have no idea how to address.One of the  professors I am currently working on a project with has a tendency to stare at my breasts during our meetings (and before people jump in to ask: I am not wearing anything that shows cleavage or is inappropriate for professional settings in any way). When I catch him do that, it distracts me from our meeting and makes me feel uncomfortable and upset. I  go from feeling like a student having an intellectual conversation with a professor to feeling like a woman talking to a man, who is displaying inappropriate behavior for a professional setting. I know this professor well enough to know that he has no harmful intentions. He has been quite helpful with my time here at my graduate program and I am grateful for the project we are  working on now. So I keep reminding myself that this person is on my side, it might be natural for some people to get distracted like that etc but it's not really working.  I am still uncomfortable  and I get distracted by his looks in return.\n\nThe problem is, this project will continue on for at least a few more months (+ he is in my committee) and it is also very uncomfortable to point this problem out to him. So I have no idea how to address the issue but I would like to, somehow.I am sure (unfortunately) that I am not the only female graduate student who has experienced this. So my question is if someone else here has also experienced it and found a way to address it, what did you do? Any suggestions?\n\n**Edit:** I realized that this post has been getting downvoted quite a bit lately. Sorry if people think it is not fitting for the subreddit. However, this seems like an experience some female graduate students (like myself) do experience in graduate school, and given the power dynamics, it is especially hard to navigate it. \n\n**Edit 2:** Thank you very much to everyone, who proposed solutions! There were some great ideas I never thought of myself that I think might actually be effective. I will try some of them out next week and I hope they make a difference :) And if I find out that this is happening with other female students, too, I will follow u/husky54's advice on talking to the department chair about it. Note: It's been pointed out by u/LastLioness that a faculty member/department chair would better know how to handle this professionally. So I will think about directly talking to them (but will probably keep the identity anonymous at first).",
  "author": "Clous09",
  "created": 1567789979,
  "over_18": false,
  "upvotes": 350,
  "upvote_ratio": 0.94,
  "comments": {
    "eze4uzh": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/eze4uzh/",
      "text": "Title IX recently gave a training at my institute and provided some examples of how people have used their services in the past. Could you contact Title IX, ask them if they will deal with it? They can contact this professor on your behalf, sit him down, tell them there has been an anonymous concern and no formal complaint will be filed. He doesn't have to know it came from you and he won't get in trouble.",
      "author": "sneakypickle25",
      "created": 1567859101,
      "upvotes": 2,
      "replies": {
        "ezex2ut": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezex2ut/",
          "text": "A friend also suggested talking to Title IX about it anonymously. In my undergraduate institution, a student went to Title IX to get advice but then was pressured to give out more information. She later raised her problems with  how Title IX handled her case etc and there were some changes in the department. So I was concerned about accidentally escalating this way more than I intend to. But I guess I could still talk to them.",
          "author": "Clous09",
          "created": 1567869953,
          "upvotes": 1,
          "replies": {
            "ezjqajl": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezjqajl/",
              "text": "I hope your Title IX office has improved. If you choose this route, remember that you are in control and don't have provide them with any extra information. You could begin by giving them the scenario with no names and ask how they would handle it. Good luck to you. Let us know the outcome. Thanks for sharing",
              "author": "sneakypickle25",
              "created": 1567948617,
              "upvotes": 2,
              "replies": {
                "ezjvhld": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezjvhld/",
                  "text": "I am at a new institution for my graduate studies so Title IX here might be better (and I hear it improved back at my undergrad institution).\n\nThank you!",
                  "author": "Clous09",
                  "created": 1567950970,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezblipu": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezblipu/",
      "text": "Carry a stack of papers and hover it over your chest regions whenever his eyes start to wander perilously close.",
      "author": "PunchingTurtles",
      "created": 1567822087,
      "upvotes": 1,
      "replies": {}
    },
    "ezbb7yb": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezbb7yb/",
      "text": "How about just telling him to stop looking at your tits next time he does it? \"Umm, excuse me Professor X, would  you mind not staring at my breasts? It makes me very uncomfortable and disrupts professionalism. Thanks.\"",
      "author": "Monitorul",
      "created": 1567817288,
      "upvotes": -3,
      "replies": {}
    },
    "ezbayhf": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezbayhf/",
      "text": "Next time he does it, threaten to murder his family",
      "author": null,
      "created": 1567817108,
      "upvotes": 1,
      "replies": {}
    },
    "ezb9cse": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb9cse/",
      "text": "Please take a look at this link if you get a chance. I realize these situations are really very different from one another. However, just because you experience glancing looks doesn't mean that he isn't this way with other women. All I'm saying is use this as a cautionary tale of what can happen if this behavior escalates.\n\nThis man was a professor at the University of Tennessee where he was tenured in the geography department. He was a world leader in dendrochronology. He testified in courts as an expert witness to the validity of violins from centuries ago just by looking at the rings on the wood. But, all of that is to say that no matter how senior the professor, if they perform behavior like this professor did they need to be dealt with. Best of luck.\n\nhttps://photos.google.com/share/AF1QipMSw4JW8YI5xTfBZLA6SKp5RYlXLf3HN0ZTlAevNsirDkdHw1fyWpES-3Vb-dI2_Q?pageId=none&key=VFd1MzVwSnBhUlRsRW5POWM3VkFJemhvNFhEVWZ3",
      "author": "ToolBoxTad",
      "created": 1567815976,
      "upvotes": 4,
      "replies": {
        "ezbf0oj": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezbf0oj/",
          "text": "That is a brilliant illustration of his offenses.",
          "author": "KnightLifer",
          "created": 1567819583,
          "upvotes": 2,
          "replies": {
            "ezbf4a2": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezbf4a2/",
              "text": "I agree. It was so incredibly on the nose.",
              "author": "ToolBoxTad",
              "created": 1567819621,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ezewdph": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezewdph/",
          "text": ">[https://photos.google.com/share/AF1QipMSw4JW8YI5xTfBZLA6SKp5RYlXLf3HN0ZTlAevNsirDkdHw1fyWpES-3Vb-dI2\\_Q?pageId=none&key=VFd1MzVwSnBhUlRsRW5POWM3VkFJemhvNFhEVWZ3](https://photos.google.com/share/AF1QipMSw4JW8YI5xTfBZLA6SKp5RYlXLf3HN0ZTlAevNsirDkdHw1fyWpES-3Vb-dI2_Q?pageId=none&key=VFd1MzVwSnBhUlRsRW5POWM3VkFJemhvNFhEVWZ3)\n\nThank you very much for warning me! I think I will approach the professor with more caution.    \nBtw- very upsetting story but great infographic!",
          "author": "Clous09",
          "created": 1567869687,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ezb0i04": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb0i04/",
      "text": "everyone here has such great suggestions but maybe this requires a much simpler solution: a blanket. Whenever he stares, hold it up to cover everything but your face and keep on talking. Don't be afraid to become an amorphous blob with just a face. Plus you will be ready for naps anywhere.\n\nRemember, he's an adult who can control his eye movement and he chooses to place his eyes on your chest while you talk. He doesn't do this to everyone, just the isolated female grad student. Seems like regardless of his intentions, the message he sends out to everyone, especially you, is pretty clear.",
      "author": "cat_barista",
      "created": 1567810876,
      "upvotes": 5,
      "replies": {
        "ezb1emw": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb1emw/",
          "text": ">Remember, he's an adult who can control his eye movement and he chooses to place his eyes on your chest while you talk. He doesn't do this to everyone, just the isolated female grad student. Seems like regardless of his intentions, the message he sends out to everyone, especially you, is pretty clear.\n\nYou do have a good point. I have been trying to dismiss it for a while (until today I realized my level of discomfort is not going to go away) but perhaps I shouldn't be dismissing it. I do value his support to my dissertation, though, so I hope there is a way to deal with this and not lose that support.   \n\n\n>everyone here has such great suggestions but maybe this requires a much simpler solution: a blanket. Whenever he stares, hold it up to cover everything but your face and keep on talking. Don't be afraid to become an amorphous blob with just a face. Plus you will be ready for naps anywhere.\n\nWhile this sounds like an effective idea (preventing him from staring and drawing attention to his stares by doing it whenever he actually stares), isn't it highly unprofessional to go to a meeting with a blanket and then using it? I mean, sure his stares are also highly unprofessional, but I'd rather make things more professional than get more casual with him. I will think about this one.",
          "author": "Clous09",
          "created": 1567811343,
          "upvotes": 2,
          "replies": {
            "ezbc5t5": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezbc5t5/",
              "text": "I forgot to point out that the blanket idea was not serious, thus a hard turn from everyone's amazing suggestions on how to deal with this. \n\nYes, grad school is tough because you are there for a bit while they are part of the institution. On top of that, you're the only female, so you're already singled out in your cohort. Which is probably why you brushed it off for so long and even now you try to justify his behavior and dismissing it. It's hard to rock the boat when you're the only one that sees the need to do it. But you will be surprised at how many allies you will find either among your cohort or among other faculty members. If he is so open about objectifying you like this, you're not the first and you won't be the last. But you can choose to make your experience better by refocusing his energy from constant leering to actually tutoring. Which is what you're doing by taking this first step.\n\nGood luck with this!",
              "author": "cat_barista",
              "created": 1567817942,
              "upvotes": 2,
              "replies": {
                "ezewrev": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezewrev/",
                  "text": "Thank you! Sorry I did not realize you were sarcastic with the blanket idea. There were many creative ideas coming in and I thought this was one of them. I think someone else suggested a different version of this with papers etc which might be a good idea, too.",
                  "author": "Clous09",
                  "created": 1567869833,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ezb1jb1": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb1jb1/",
          "text": ">Remember, he's an adult who can control his eye movement and he chooses to place his eyes on your chest while you talk. He doesn't do this to everyone, just the isolated female grad student. Seems like regardless of his intentions, the message he sends out to everyone, especially you, is pretty clear.\n\nYou do have a good point. I have been trying to dismiss it for a while (until today I realized my level of discomfort is not going to go away) but perhaps I shouldn't be dismissing it. I do value his support to my dissertation, though, so I hope there is a way to deal with this and not lose that support.   \n\n\n>everyone here has such great suggestions but maybe this requires a much simpler solution: a blanket. Whenever he stares, hold it up to cover everything but your face and keep on talking. Don't be afraid to become an amorphous blob with just a face. Plus you will be ready for naps anywhere.\n\nWhile this sounds like an effective idea (preventing him from staring and drawing attention to his stares by doing it whenever he actually stares), isn't it highly unprofessional to go to a meeting with a blanket and then using it? I mean, sure his stares are also highly unprofessional, but I'd rather make things more professional than get more casual with him. I will think about this one.",
          "author": "Clous09",
          "created": 1567811408,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ezay5j4": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezay5j4/",
      "text": "> I know this professor well enough to know that he has no harmful intentions. \n\nI admit that I am a cynic in these situations. However, if you're not comfortable talking about this issue with him directly, and you have no idea how he would respond if you did, then imho you do not know him well enough to have a good grasp of his intentions. He is a grown-ass man, well-educated, AND in an authority position. It's very likely he's well aware of where his eyes tend to \"drift\". \n\nThat being said, it is not your job to confront him, and it's dangerous for you to do so (I mean this primarily professionally but also personally). You need to talk to someone with authority over him, someone you trust to talk to him about this issue with the option of keeping you anonymous. I suggest getting someone to help you advocate - perhaps one of the women on your committee can go with you to talk to the department chair (the HR department would also be a good option, possibly even better). \n\nAs a side note, I would make a mental note if this only happens when you are alone with him or if he does this to you or other women in front of his colleagues and bosses.",
      "author": "LastLioness",
      "created": 1567809606,
      "upvotes": 1,
      "replies": {
        "ezazb7g": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezazb7g/",
          "text": ">It's very likely he's well aware of where his eyes tend to \"drift\".\n\nIt has been happening so frequently that I am sure his stares are no just a coincident due to randomly spacing out or something. What I meant by \"I know that he has no harmful intentions\" is that I find him trustworthy enough to think he doesn't intend to do anything more serious. But you do have a good point -- I don't know him \\*that\\* well so I could be wrong and this has been going on for a long time now that he really should be aware of what he is doing and stop. It seems most people here agree I should consult with some faculty/chair etc so I am getting a little more serious about doing that. I am actually curious what sort of advice they would give.\n\n>As a side note, I would make a mental note if this only happens when you are alone with him or if he does this to you or other women in front of his colleagues and bosses.\n\nThis happens when there are other people around in the same room/meeting with us but it definitely happens way more frequently when we are alone.  \nThank you for your advice!",
          "author": "Clous09",
          "created": 1567810273,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ezax5f3": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezax5f3/",
      "text": "Can you Skype or call the person instead of meeting in person?",
      "author": "crazyreddmerchant",
      "created": 1567809033,
      "upvotes": 2,
      "replies": {
        "ezazgj4": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezazgj4/",
          "text": "Our offices are quite close. I don't think I have any good excuse to Skype other than saying \"I am more comfortable avoiding coming into your office\", which would lead to the direct confrontation myself.",
          "author": "Clous09",
          "created": 1567810348,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ezanv68": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezanv68/",
      "text": "If you otherwise get along with him and have a good rapport, I'd say bring it up to him directly. At the same time though, mention it to one or both of your female committee members. That way if he reacts badly, he can't turn it around on you and try to convince the other profs that you were in the wrong or making things up. Also then if he continues, you can let the other profs know that his behavior didn't change and maybe they can intervene. If you don't address it, it'll only continue to stress you out over these next months. \n\nHang in there, and good luck.",
      "author": "ConfusedCuddlefish",
      "created": 1567804610,
      "upvotes": 3,
      "replies": {
        "ezaq17v": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaq17v/",
          "text": ">At the same time though, mention it to one or both of your female committee members.\n\nThis sounds like a good advice. After trying less direct methods, if I find that I need to directly talk to him, I will make sure to first mention this issue to the female committee members. Thanks for the great idea!",
          "author": "Clous09",
          "created": 1567805646,
          "upvotes": 3,
          "replies": {
            "ezaxgwg": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaxgwg/",
              "text": "I can pretty much guarantee that any indirect method won't work if he's doing it on accident. Humans are surprisingly pretty bad at catching unexpected social cues.",
              "author": "hardolaf",
              "created": 1567809198,
              "upvotes": 1,
              "replies": {
                "ezazj1s": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezazj1s/",
                  "text": "Did you mean \"indirect method\"? Otherwise I don't quite understand of what you meant.",
                  "author": "Clous09",
                  "created": 1567810382,
                  "upvotes": 1,
                  "replies": {
                    "ezb1c07": {
                      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb1c07/",
                      "text": "Yes. Sorry about that.",
                      "author": "hardolaf",
                      "created": 1567811307,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ezakafc": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezakafc/",
      "text": "I have definitely experienced this. I’ve had everything from male professors looking at my chest, to male professors staring at me from across the room at dinner parties (while their wives, female professors who I work with, are standing right beside them). \n\nI’m going to be honest. I can’t imagine saying anything about it... these sorts of situations are handled so terribly by universities, and I feel like I’d likely face backlash/retaliation and ultimately it wouldn’t be worth it. I instead deal with it by wearing high necklines, looser tops, and even a sweater/jacket on days that I’m meeting with male professors.\n\nI also will very obviously put my notebook/purse in front of my chest, zip up my jacket, block the view with my arm, etc. to let them know that I see them looking and it makes me uncomfortable. If the issue is really bad, I just avoid meeting. I’ve found that I can get away with not meeting with certain people for months, even if I have an ongoing project with them. \n\nI hate my advice to avoid/ignore, but that’s sadly all I’ve got. I hope that you can be braver then me and choose to say something to someone about it. I’m sending you strength, and hoping he will stop!",
      "author": "iloveteax",
      "created": 1567803003,
      "upvotes": 10,
      "replies": {
        "ezanzvt": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezanzvt/",
          "text": "> I’ve had everything from male professors looking at my chest, to male professors staring at me from across the room at dinner parties (while their wives, female professors who I work with, are standing right beside them).\n\nThis sounds like such a bad experience. Sorry you had to go through this. I think this sucks everywhere but especially at grad school, where professors are supposed to be focused on mentoring you in their relationship with you and are higher up on the power hierarchy. I do hope that it didn't end up affecting your career in a significantly negative way :/\n\n> these sorts of situations are handled so terribly by universities, and I feel like I’d likely face backlash/retaliation and ultimately it wouldn’t be worth it. \n\nYeah, I am also afraid of retaliation and that's why didn't know how to address it. I am glad some people here gave me ideas on indirect ways to address it, though so I will try them.   \n\n\n>If the issue is really bad, I just avoid meeting. I’ve found that I can get away with not meeting with certain people for months, even if I have an ongoing project with them.\n\nThis is what makes me very frustrated. A student shouldn't have to avoid seeking mentorship just because of the shape of their body. I find this very unfair but don't know how to really solve the issue...\n\n>I hate my advice to avoid/ignore, but that’s sadly all I’ve got.\n\nI understand how you feel. On the one hand, I feel mad at myself for not being better at standing up for myself, but on the other hand, I think my concerns are valid. This has beeen going on for about 8 months now so it's not like he spaces out and randomly stares at things so I think I need to address it somehow if I keep interacting with him.\n\nI hope you are not experiencing the same stuff anymore.",
          "author": "Clous09",
          "created": 1567804672,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ezajv33": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezajv33/",
      "text": "Wow, this sucks, I'm sorry you have to go through that.\n\nI think the best bet would be someone else talking to him e.g. female professor. Is there someone you could reach out to?",
      "author": "Sonic_Pavilion",
      "created": 1567802824,
      "upvotes": 3,
      "replies": {
        "ezam8th": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezam8th/",
          "text": "I think there might be a few female professors in the department I could talk to. I'll probably mention the issue without giving his name first to see what they will say. Thank you",
          "author": "Clous09",
          "created": 1567803873,
          "upvotes": 2,
          "replies": {
            "ezb2rpm": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb2rpm/",
              "text": "This sounds like a smart way to go about it, wish you the best",
              "author": "Sonic_Pavilion",
              "created": 1567812035,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ezajaxr": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezajaxr/",
      "text": "Re: your edit: I think this post **is** appropriate for this sub. I've seen many other productive threads on similar topics in this sub. \n\nI think the most important question here is: how well does this professor take criticism? \n\nIf he takes criticism well, you could talk to him directly (but gently). \"Hey, sometimes I notice you looking at my chest during meetings. I'm sure you don't mean anything by it, but it's actually really distracting for me.\"  \\[and obviously completely inappropriate, but he *should* be able to figure that out by himself.....\\]\n\nIf he doesn't take criticism well, I would address it indirectly to avoid a stubborn response, or worse, retribution. Have someone who knows him very well talk to him about this (embarrassing and highly inappropriate) habit. They might not even have to mention you at all, since you said he does this to other women, and colleagues close to him will have noticed the problem at large. If the colleague you talk to is really a good friend of his, they should want to bring this up with him to protect him from more serious consequences if he continues with the habit, since this is something you and others could certainly report. \n\nYou might also get advice from your ombudsman, if yours isn't a mandatory reporter.",
      "author": "myristicae",
      "created": 1567802549,
      "upvotes": 41,
      "replies": {
        "ezaly95": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaly95/",
          "text": ">Re: your edit: I think this post **is** appropriate for this sub. I've seen many other productive threads on similar topics in this sub.\n\nThank you very much! I believe this post has been productive (at least for me), too because I got some good advice and ideas from people I could not think of myself. I am looking forward to try them out.\n\n>If he takes criticism well, you could talk to him directly (but gently). \n\nYeah, so I am not too sure about whether he takes criticism well. I haven't seen anyone criticizing him for something serious yet (other than things like \"oh Bob your desk is messy\" or something). He has a calm and kind personality that I think he might take it lightly. But I don't know if it will actually lead to some sort of retaliation. I think it definitely is awkward and might change our interactions in a negative way. I am not able to predict it well. So I think I will try the non-confrontational / indirect methods first.",
          "author": "Clous09",
          "created": 1567803740,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ezahsth": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezahsth/",
      "text": "If I were in your shoes I would use vocal cues to try to snap him out of this behavior. You can do this in a way that’s not directly calling him out for looking at your breasts but still acknowledging the distraction and solving your problem.\n\nI’d play it out like this.\n\nYou: (have awesome intellectual discussion about dissertation)\nHim: *staring at your breasts*\nYou: hey! [his name] (loudly and waving a hand near his face, even smiling is fine here to make it light). I feel like you’ve been distracted, I find it difficult to gauge my progress without eye contact. (Light laugh here). Would you help me out? \nHim: Oh! Sorry about that, had a lot on my mind (gives him a face saving out). (Starts to talk to you giving you eye contact)\n\nIf he repeats the behavior, which he might depending on how much the first “calling out” impacted him\n\nTry responses like “I keep getting distracted without eye contact” or (give him very direct eye contact) or (trail off as he stares at your breasts and speak normally when he gives you eye contact) \n\nIf he still continues then you have no choice but to live with it (ugh, I wouldn’t want that from a male colleague or superior or anyone not my boyfriend for that matter!) or address it with him directly \n\nI hope these other methods work for you though! I haven’t used these tactics on a professor before but when I worked in industry it worked well and with other male grad students it worked well. I’m also a bit chesty and even if I wear extremely modest blouses, blazer, and sweaters, my breasts are large and noticeable. Not a problem we should have to deal with but hope my advice helps since it’s your situation right now",
      "author": "nemoflamingo",
      "created": 1567801735,
      "upvotes": 13,
      "replies": {
        "ezailka": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezailka/",
          "text": "This is good because as a dude I feel like sometimes I phase out and stare into space where someone might think I'm looking at their chest but I'm actually not.",
          "author": "_Ctrl_Alt_Delete",
          "created": 1567802172,
          "upvotes": 7,
          "replies": {
            "ezapkit": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezapkit/",
              "text": "Yeah, since I don't think he has a deliberately bad intention, I wouldn't want to directly call him out on it, either (plus I feel awkward about it anyway). I get that people get distracted and occasional, unintentional stares will happen. If I were unintentionally staring at someone , being called out on it would be me feel embarrassed (although I would think they were right to call me out on it).I don't think this (spacing out and coincidental staring) is the case here, though. This has been going on for about 8 months now but especially in today's meeting, it happened maybe 10 times within a span of 30 minutes. His eyes often goes from my face to my breasts back to my face again. It changes my feelings towards our mentorship meetings and leaves me feeling uncomfortable.",
              "author": "Clous09",
              "created": 1567805422,
              "upvotes": 3,
              "replies": {}
            },
            "ezax6oq": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezax6oq/",
              "text": "My head naturally starts looking down when I'm concentrating. I'm sure I've probably accidentally freaked a few women out over the years as I have noticed that it occasionally might look like I'm looking at their breasts, due to the angle, but honestly, I kind of just stop processing information from my eyes a lot of time when thinking. Like my brain is doing something with it, but I don't actively think about it. If anyone asked me to stop or pointed out me doing it, I'd definitely actively try to avoid it at all. But these days, I typically only interact with computer screens so...",
              "author": "hardolaf",
              "created": 1567809051,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ezaiqa2": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaiqa2/",
          "text": "I love this idea, too. I am letting him know I noticed he got distracted without mentioning where he is staring.I will try this, too. Thanks a lot for the good ideas!",
          "author": "Clous09",
          "created": 1567802243,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ezah9ph": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezah9ph/",
      "text": "[deleted]",
      "author": null,
      "created": 1567801448,
      "upvotes": 49,
      "replies": {
        "ezahusv": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezahusv/",
          "text": "Wow, this is such a creative and smart idea! I think it would make him aware that he was staring and I noticed it. I will try this next week and see if it helps. Thank you! :)",
          "author": "Clous09",
          "created": 1567801765,
          "upvotes": 19,
          "replies": {
            "ezayx0q": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezayx0q/",
              "text": "This will only potentially work if he is 100% innocent, and he would have to have extremely poor self-awareness for that to be the case. A truly well-intentioned man who catches himself staring at a woman's chest gets embarrassed and makes a focused effort to not do so again. It's not a difficult fix. \n\nAssuming he's not 100% innocent, this technique has the potential to backfire horribly by opening a door for him to interpret you as flirting or purposefully drawing attention to your privates. It will also give him an \"out\" if someone speaks to him on your behalf - \"Oh, she had a coffee stain on her shirt yesterday. That's probably what she was talking about.\" Then you will have to confirm that you did, indeed, have a coffee stain on your shirt and the whole issue will be dismissed.",
              "author": "LastLioness",
              "created": 1567810069,
              "upvotes": 34,
              "replies": {
                "ezb07z3": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb07z3/",
                  "text": ">this technique has the potential to backfire horribly by opening a door for him to interpret you as flirting or purposefully drawing attention to your privates.\n\naha, this is a very important point.\n\n>It will also give him an \"out\" if someone speaks to him on your behalf - \"Oh, she had a coffee stain on her shirt yesterday. That's probably what she was talking about.\"\n\nAlso this.  \nI think I have been assuming 100% innocence from the start, but you do raise very good points that might end up being critical later on. Thank you\n\n(edited for clarification)",
                  "author": "Clous09",
                  "created": 1567810734,
                  "upvotes": 16,
                  "replies": {
                    "ezd1y28": {
                      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezd1y28/",
                      "text": "Not sure if this is a good idea, but you could do something simpler - next time you notice him staring, say \"oh, do I have something on my shirt?\"",
                      "author": "misanthpope",
                      "created": 1567843953,
                      "upvotes": 3,
                      "replies": {
                        "ezeap9d": {
                          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezeap9d/",
                          "text": "Perfect! This is less risky, more direct. Especially if you do it every single time you notice it. If he’s doing it unconsciously, this will bring his attention to it and it will stop. If he’s just a creep, this will bring everyone’s attention to it and it will stop.",
                          "author": "sirtwixalert",
                          "created": 1567861429,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "ezahxeq": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezahxeq/",
              "text": "Let me know if it helps!!",
              "author": null,
              "created": 1567801802,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "ezawxrx": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezawxrx/",
          "text": "I love this!!",
          "author": "tentkeys",
          "created": 1567808932,
          "upvotes": 1,
          "replies": {}
        },
        "ezb7f28": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezb7f28/",
          "text": "This is amazing, thank you",
          "author": "goshlookatherwow",
          "created": 1567814632,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ezag2q5": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezag2q5/",
      "text": "That's a tricky one... bringing it up might make things awkward between you in a way that is harmful to you. Although Me Too has led to some progress, it would still be hard to prove he was doing it deliberately, and if you bring it up at all (even just discreetly saying something to him) you risk being labeled as \"that nasty hysterical woman over-reacting to a poor innocent guy who wasn't even doing anything wrong\" and having it screw up your degree and your career. That isn't fair, but unfortunately it is the world we live in.\n\nYou could handle it like a \"sub-tweet\" -- wear a shirt with an arrow pointing up that says something like \"my face is up there\" (they exist. And you could have just happened to wear one on the day of your meeting, it wasn't *necessarily* aimed at him, just like he wasn't *necessarily* looking deliberately...). That way you haven't actually said anything or suggested he was doing anything wrong (so it's unlikely to be held against you) but the message should get through loud and clear.\n\nOr if you don't want to be that direct then dress to minimize, eg. sports bra/baggy clothes.\n\nIt sucks. It absolutely sucks. You should just be able to say \"stop looking at my boobs\" or report it or something, but the reality is still that as women if we do anything like that we are taking a risk. For a PhD student who will be in professional networks with these people for the rest of your career, that risk is particularly dangerous. And boob-gazing (unlike more overt/demonstrably-intentional kinds of harassment) is probably not worth taking that risk over... at least, I wouldn't if I was in your situation.",
      "author": "tentkeys",
      "created": 1567800805,
      "upvotes": 7,
      "replies": {
        "ezai7xz": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezai7xz/",
          "text": "Thank you, I am afraid of something similar: the possibility of it adversely affecting me if I were to address this openly (not to mention the awkwardness)\n\nI actually thought of the t-shirt idea because I saw a woman wear that on the street about a year ago and thought it was hilarious. But I think the problem with it is he might realize I wore it for our meeting on purpose and he might interpret this as a passive aggressive and awkward attempt to warn him, which might still adversely affect our professor - student relationship. I might be too anxious about he t-shirt idea for no good reason and it might be a good solution, though. I  am not sure.   \n\n\nIt actually does happen less often when I am wearing baggy clothes or thick cardigans/coats on top. It does still happen, though. But paying attention to wearing baggy clothes to a meeting with him might make things at least a bit less  uncomfortable.",
          "author": "Clous09",
          "created": 1567801966,
          "upvotes": 2,
          "replies": {
            "ezanfgg": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezanfgg/",
              "text": "How about a less direct message on the shirt then? \"Men of quality support women's equality.\"\n\nDoesn't say \"stop looking at my boobs\" and most likely won't seem intentional or directed at him at all. But every time he looks, he'll get a gentle reminder why he shouldn't. (That said, lettering on your chest may accidentally increase looking...)\n\nOtherwise, if you're going with the \"baggy clothes\" approach, consider a high-quality sports bra or even a binder. Depending on your size, baggy clothes can only hide so much -- adding some extra control/compression can really help.",
              "author": "tentkeys",
              "created": 1567804407,
              "upvotes": 2,
              "replies": {
                "ezaoow3": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaoow3/",
                  "text": "Oh I do love that less indirect t-shirt idea. That doesn't  feel passive aggressive or awkward at all. Something like \"I support #MeToo movement\" (or whatever, I couldn't really come up with a good idea on the wording yet) could also keep the focus on sexual harassment related issues. So it wouldn't be direct yet it would still be on point. \n\nThank you very much for helping out !! :)",
                  "author": "Clous09",
                  "created": 1567805006,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezabtvc": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezabtvc/",
      "text": "Given that you're fairly confident he doesn't have bad intentions and he's been helpful otherwise, it may be possible to talk to him directly about it. It's largely a question of how comfortable you are bringing it up like that. I'd say keep it light, try to avoid a serious half-hour meeting on the topic, so like the next time you notice him doing it say something like \"hey Bob, I've been meaning to bring something up with you, often when we're in meetings like this you seem to be looking at my breasts while we talk and it makes me really uncomfortable. Could you make an effort to look at my face instead?\" and see what response you get. This may be some horrible habit that he's developed without thinking about it, or that he thinks other people don't notice, and once you point out that you have noticed and it's not OK it may be enough to embarrass him into stopping. \n\nLike I said though, depends on your comfort level. If that sounds like a nightmarish conversation to start then /u/prettyvioletlilies' suggestion of having another professor talk to him about it is a great option, especially if it turns out he does this with other women as well and someone needs to address the full pattern of behavior with him.",
      "author": "eukomos",
      "created": 1567798476,
      "upvotes": 21,
      "replies": {
        "ezak0l0": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezak0l0/",
          "text": "I thought about how I could have a light-hearted yet direct conversation about this with him but whatever scenario I play out in my head about it, it feels too awkward. Yeah, I do feel like he is well-intentioned towards me and wants to help me out in my education. So perhaps you are right, he might bee fine with a direct conversation. I actually don't think he will verbally react to it in a negative way but I think it might change his support towards me in a more implicit way. Or that's what I am afraid of and don't feel comfortable talking to him about it as a result :/ If he were a fellow grad student, I would not feel awkward about it, though so I think this power dynamic thing plays a significant role with my comfort. I think I will take the advice by u/nemaflamingo on using more subtle verbal cues, as well as the other non-confrontational suggestions here like a coffee stain, and talking someone else about it without giving names.   \nThank you! :)",
          "author": "Clous09",
          "created": 1567802890,
          "upvotes": 4,
          "replies": {
            "ezax5ue": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezax5ue/",
              "text": "If you bring this issue up with him, I would make sure someone else on your committee knows in advance so they can monitor his behavior afterwards in case he does a 180 on you, which I'd say is likely.",
              "author": "LastLioness",
              "created": 1567809039,
              "upvotes": 2,
              "replies": {
                "ezaz7bx": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaz7bx/",
                  "text": "I would say highly unlikely. More likely is he'll be embarrassed and go out of his way NOT to not act with prejudice just to be on the safe side.",
                  "author": "thielemodululz",
                  "created": 1567810218,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ez9yini": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ez9yini/",
      "text": "Are you allowed to change/drop members from your committee? At my institution, we can do that through the department chair, without having to ask the person being replaced beforehand. They simply get an email saying that their assistance is no longer needed.",
      "author": "squirrels33",
      "created": 1567791818,
      "upvotes": 12,
      "replies": {
        "ez9yo8v": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ez9yo8v/",
          "text": "I am able to; this is something for me to think about. This person's expertise matches my thesis topic, though (and they have provided help with another project, too), so I am not entirely sure if I want to do that just yet. However, I think if the situation persists or gets worse, I would.",
          "author": "Clous09",
          "created": 1567791899,
          "upvotes": 5,
          "replies": {
            "eza1wi1": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/eza1wi1/",
              "text": "I, too, have one person on my committee that I'm not crazy about, and I'm stuck with him, since there's nobody else available. I'm not dealing with any of the things you're dealing with, like sexual inappropriateness; I just find this faculty member to be infuriatingly opinionated & egotistical while also being unqualified to give feedback on my writing, to the point where it's difficult to maintain a respectful attitude in his presence. As a result, I try to conduct communication as much as possible through email. This might be another option for you, if in-person interactions are uncomfortable and you find that you cannot change your committee.",
              "author": "squirrels33",
              "created": 1567793561,
              "upvotes": 7,
              "replies": {
                "eza3qmb": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/eza3qmb/",
                  "text": "This is a good idea, too. It is not possible for now since we are working on a project together but I see the project (hopefully) coming to an end in a few months. After that if he is still on my committee, I'll probably limit my interactions with him to a minimum and rely mostly on e-mails when I need to. He doesn't display this behavior as frequently when there are other people in the room, actually. It still happens but rarely. But when we are alone, it is more frequent so avoiding alone time with him might be important. I wish there was an easy way to make him aware of what he is doing in a way that won't negatively affect my relationship with him or make things more awkward/uncomfortable. I don't understand if he doesn't realize it or for some reason thinks it is completely harmless so it's okay? I don't know",
                  "author": "Clous09",
                  "created": 1567794420,
                  "upvotes": 3,
                  "replies": {
                    "eza41fl": {
                      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/eza41fl/",
                      "text": "I get you. If it’s happening to others as well, maybe someone in your university’s administrative arm could speak to him without saying who made the complaint. But yeah, if it’s just you, I can see why you’d be worried about retaliation.",
                      "author": "squirrels33",
                      "created": 1567794556,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ez9w9xp": {
      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ez9w9xp/",
      "text": "Is there someone else on your committee that you trust and who is female? You can try to talk to her about it (don’t be specific at first) to see if she can intervene on your behalf. I’ve been in this situation before but I was too embarrassed to do anything. I regret being silent because that year caused a lot of anxiety.",
      "author": "prettyvioletlilies",
      "created": 1567790654,
      "upvotes": 152,
      "replies": {
        "eza0m90": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/eza0m90/",
          "text": "I think this is good advice. Not only can this improve your situation, but it also allows you to bring up the problem to an outsider - if this guy does it to all female students, that's a big problem! Whisper networks, unfortunately, do serve a purpose.",
          "author": "cassia_14",
          "created": 1567792904,
          "upvotes": 47,
          "replies": {
            "eza16yy": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/eza16yy/",
              "text": "I actually have no idea about his interactions with other female students. That's a very good point",
              "author": "Clous09",
              "created": 1567793209,
              "upvotes": 24,
              "replies": {}
            }
          }
        },
        "ez9xbpe": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ez9xbpe/",
          "text": "I never thought of this, actually. It sounds like a great idea. There are two female professors on my committee. The one I am closest to is a junior professor  (the male professor I describe above is a senior professor) so I am guessing she might also feel uncomfortable intervening. But I won't know until I mention it to her. I could first mention it without giving away the name of the professor and see how she reacts.\n\nThe other one is a bit more senior and established. I am not as close to her but I think she would take it seriously and would want to help me out in some way.\n\nI am sorry that you had to go through a similar experience. I wish problems like this that women experience  were easier to address. Navigating the power hierarchy, social dynamics and office politics in the midst of problems like this is difficult. Thank you for your suggestion; I will try it out!",
          "author": "Clous09",
          "created": 1567791218,
          "upvotes": 54,
          "replies": {
            "ezaiun9": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaiun9/",
              "text": "Perhaps part of your potential recourse here is to involve the chair of the department as well. The university has an obligation to you to provide a safe work environment free from harassment of all kinds. Sadly, sometimes you have to circumvent otherwise normal avenues to for protection. \n\nI am sorry that this is happening to you. It is entirely inappropriate and I hope that you can find a resolution that protects your work and your progress quickly.",
              "author": null,
              "created": 1567802307,
              "upvotes": 10,
              "replies": {
                "ezap095": {
                  "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezap095/",
                  "text": "My department chair is a sensible, successful female professor, who seems easy to talk to. So I think this is indeed a possibility. I think I will start by trying out the less direct suggestions. I think some ideas here (verbal cues, tshirts tricks etc) have the potential to solve this. If not, talking to the department chair sounds like a good idea since I find her approachable and she is a feemale so she might be more likely to understand my problem.\n\nThanks!",
                  "author": "Clous09",
                  "created": 1567805158,
                  "upvotes": 17,
                  "replies": {
                    "ezay2vj": {
                      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezay2vj/",
                      "text": "It also will make sure this is resolved professionally. No accusations thrown around. You are just trying to solve a problem. You’re not trying to embarrass him or throw him out of his job. Faculty are supposed to be trained in diversity and inclusion, and I’d hope that your chair would know what institutional steps she needs to take to de-escalate the situation. She is a resource for you so you don’t have to bear the burden yourself! I’m sorry you’re dealing with this and all my strength to you 💙\n\nRule of thumb: when in doubt, go with your gut. If you’re getting red flags, trust them.",
                      "author": "prettyvioletlilies",
                      "created": 1567809564,
                      "upvotes": 11,
                      "replies": {
                        "ezayior": {
                          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezayior/",
                          "text": "Hmm, that's a good point.Actually, it is probably likely that a faculty member (especially someone like a department chair) knows how to deal with this appropriately better than I do. I think I'll ask for their opinion on the matter and what I could do.",
                          "author": "Clous09",
                          "created": 1567809834,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "ezaqapt": {
                      "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezaqapt/",
                      "text": "I think those subtle methods are great. It may be worthwhile to bring this to the chair’s attention for the long term, too. If he’s creeping a bit on you, it’s probable he’s creeping, has creeped, and will creep on others as well.",
                      "author": null,
                      "created": 1567805772,
                      "upvotes": 12,
                      "replies": {
                        "ezasy6h": {
                          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezasy6h/",
                          "text": "My understanding is that you are suggesting I shouldn't just try to make him stop this with me,  I should try to make sure this doesn't happen with any student. I think you have a good point that I am likely not the only student who has experienced this with him. I am close with a female student who also works with him, so I could probably mention this casually and see what she says. Tbh, I think this might be related to being a busty person (even if you don't wear tightly fitting / cleavage-showing clothes, some people stare) so I think women's mileage with him might vary. But if she experiences similar things, we could probably talk to the department chair together, which would be the ideal option.   \nI feel comfortable starting out with the more subtle methods because I have hope that if he realizes I notice he keeps staring, he might get embarrassed and modify his behavior in general. I'll still talk to the other female student to see what she says. \n\nAgain, thank you!",
                          "author": "Clous09",
                          "created": 1567807038,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ezacs8l": {
          "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezacs8l/",
          "text": "[deleted]",
          "author": null,
          "created": 1567799012,
          "upvotes": -46,
          "replies": {
            "ezao7vh": {
              "link": "/r/GradSchool/comments/d0jja5/how_to_address_inappropriate_looks_from_a/ezao7vh/",
              "text": "I take offense at you suggesting that feeling continuously objectified in a professional relationship at an educational institution is a petty issue. I am happy for you if you never had to deal with that.",
              "author": "Clous09",
              "created": 1567804780,
              "upvotes": 20,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634066842
}