{
  "sid": "qzz6du",
  "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/",
  "title:": "PSA: Buy a fountain pen!",
  "text": "All of my pens ran out of ink around the same time from the many notes I've been taking and I didn't want to have to keep buying plastic cartridges, so I bought a fountain pen and a bottle of ink. This is seriously the best grad school supply decision I have ever made and I can't believe this didn't occur to me during undergrad so wanted to share with you all.",
  "author": "battleofwords",
  "created": 1637624076,
  "updated": 1637689755,
  "over_18": false,
  "upvotes": 44,
  "upvote_ratio": 0.86,
  "comments": {
    "hlpbb5l": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlpbb5l/",
      "text": "Ditto! Love my fountain pen. But be careful, it can be hard not trying to collect more!",
      "author": "impendingcrown",
      "created": 1637624348,
      "upvotes": 20,
      "replies": {
        "hlpni5w": {
          "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlpni5w/",
          "text": "Already feeling the temptation!",
          "author": "battleofwords",
          "created": 1637630096,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlpxz9d": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlpxz9d/",
      "text": "I still remember that one time when I dropped water on my pages after writing with an ink pen which meant I had to rewrite my homework and couldn't understand what I had written earlier....Love my handwriting when I write with one but haven't used a fountain pen since then, 20 pack ball pens ever since.",
      "author": "enigma142",
      "created": 1637634980,
      "upvotes": 4,
      "replies": {
        "hlq7nem": {
          "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlq7nem/",
          "text": "Bulletproof inks from Noodler's are extremely water resistant. I've had pages survive rain and be readable.",
          "author": "_perpetual_student_",
          "created": 1637639651,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hlpquga": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlpquga/",
      "text": "Do everything in your power to enjoy every little thing you do. There's not much better than writing in a good journal with a fountain pen.",
      "author": "LAl3RAT",
      "created": 1637631668,
      "upvotes": 15,
      "replies": {
        "hlpuc8x": {
          "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlpuc8x/",
          "text": "I have beautiful notebooks for my notes and a few of those Peter pauper journals for my personal journals. I think I’ll take the step into a fountain pen soon! Life is precious and short, you’ve got to enjoy and romanticize the hell out of it even if it makes your grad school career feel a little too dark academia for comfort.",
          "author": "OldSweatyBulbasar",
          "created": 1637633271,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hlpfskp": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlpfskp/",
      "text": "I love my piston filled Pelikan fountain pen, but it's easy to end up with a collection.",
      "author": "mleok",
      "created": 1637626434,
      "upvotes": 3,
      "replies": {}
    },
    "hlq7ipf": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlq7ipf/",
      "text": "Saved my hands. I've hundreds of pages of handwritten notes. No pressure writing went a long way to eliminate hand cramps.\n\nSerious caveat: don't spend serious money on any pen that will leave your home. Buy the less expensive good workhorse pends like the Pilot Metro, Lamy Safari, Jinhao, and Twisbi Eco other sub $40usd pens. Things will happen and you will lose pens, you don't want to lose a $100+ usd fancy pen or have nib damage. My phd pressie to me is a Conklin full abalone stub nib. It doesn't leave my desk.\n\nInk is cheap. Piston fillers have huge reservoirs. Have lots of fun with it.",
      "author": "_perpetual_student_",
      "created": 1637639585,
      "upvotes": 3,
      "replies": {}
    },
    "hlqepgu": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlqepgu/",
      "text": "Just keep in mind a lot of inks, especially some of the cheapest ones, are NOT WATERPROOF! I thought this would be fine until I got caught in a bad storm. Rain drenched through my backpack and into my notebooks...",
      "author": "pinguinblue",
      "created": 1637643508,
      "upvotes": 3,
      "replies": {
        "hlruc3o": {
          "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlruc3o/",
          "text": "Definitely important to remember. If you look on the different sites that sell inks some of them have a comparison chart so that you can see how each holds up to water.",
          "author": "battleofwords",
          "created": 1637679147,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlrrz55": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlrrz55/",
      "text": "Omg are you me?? I was literally running a new pen dry every week and got tired of it. I got the pilot metropolitan fountain pen (one of the more affordable ones) and an extra pack of catridges. I love it! Btw, (i hope this is allowed) I ordered mine from the small business the goulet pen company and was very pleased with their customer service so I’d recommend supporting them!",
      "author": "quintessentialquince",
      "created": 1637678099,
      "upvotes": 3,
      "replies": {}
    },
    "hlqph71": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlqph71/",
      "text": "I almost never use pen and paper. Can’t remember the last time I used them. I sometimes take notes on my iPad with Apple Pen, but that’s it.",
      "author": "bahasasastra",
      "created": 1637650562,
      "upvotes": 3,
      "replies": {}
    },
    "hlri6i4": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlri6i4/",
      "text": "A 24 pack of ball point pens is like $9",
      "author": "alexminne",
      "created": 1637673119,
      "upvotes": 1,
      "replies": {
        "hlruhvf": {
          "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlruhvf/",
          "text": "I prefer thicker writing so that it stands out from the page (and feel guilty throwing them or the cartridges away since I've been going through so many lately)",
          "author": "battleofwords",
          "created": 1637679217,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlpt8yh": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlpt8yh/",
      "text": "Highly recommend the Pilot Kakuno with the Con-70 converter (this ink converter is important, it has high ink volume and easy filling mechanism).",
      "author": "coffee24",
      "created": 1637632780,
      "upvotes": 1,
      "replies": {}
    },
    "hlq0rkh": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlq0rkh/",
      "text": "Also the pilot precise RT has super easy to refill cartridges and a nice fine point!",
      "author": "SnooCats9803",
      "created": 1637636303,
      "upvotes": 1,
      "replies": {}
    },
    "hlqn7vr": {
      "link": "/r/GradSchool/comments/qzz6du/psa_buy_a_fountain_pen/hlqn7vr/",
      "text": "I prefer ball point better, but i want to get into using my fountain pen more, seems more classy",
      "author": "bonswag25",
      "created": 1637648939,
      "upvotes": 1,
      "replies": {}
    }
  }
}