{"sid": "cfc1i4", "link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/", "title:": "Update: My adviser has been removed as chair and been ordered not to communicate with me", "text": "[Previous Post](https://www.reddit.com/r/GradSchool/comments/c5qtcn/update_submitted_a_formal_grievance_against_my/)  \n\n\nSo after an exhaustive investigation I am meeting weekly with the Dean of my College as the new chair of my committee. I am at the end of my 5th year. I submitted a review in April without my adviser's approval and its been accepted without revisions. The Dean and other professors are working with me to put together a dissertation on negative results from my attempted experiments. I think the level of mismanagement I've been under is forcing their hand to get me out.  \n\n\nIn addition I've been allowed to add a chapter on my teaching methods. I have a copyright on some of my materials and wanted to publish when I first came here. Unfortunately every professor rejected working with me. I got published through another university and have been working with other institutions to move these projects forward. The Dean was flabbergasted at the work I've done with my teaching and that faculty have given me no guidance on turning this into a PhD.   \n\n\nMy lab is shutting down and the Dean will be personally funding me to move to another city, live with my girlfriend, and finish writing.  \n\n\nAnd the best part. After meeting with the Dean my adviser has been attempting to meet with me to discuss the situation. He's only on campus from 11-2 so I've been taking long lunch and going to the library to avoid him. The Dean has told him all communication is to include him, and these E-mails have been to me directly. I've replied cc-ing both the Dean and the School of Graduate Studies. His replies have all been to me directly. Everyone has seen this. He has done it multiple times over the past two weeks even after the Dean E-mailed the both of us telling him to stop.  \n\n\nMy adviser is now considered to be directly defying the Dean and acting contrary to how he's agreed to move forward. The Dean has said he doesn't think my adviser understands what the problem is, how serious it is, and why he can no longer participate in my graduate committee. He's been told to end all communication with me and is being called in to review his behavior for a third time this year.  \n\n\nIt means a lot to me to be told that this situation is not my fault and that me working harder is not the solution. I'm trying to dig myself out of the despair that I've fallen into as a result of this program. The Dean and the other faculty that are working with me are very positive and are making me want to get back into my field. I believe when I move and am living with someone who loves me I'll be able to put something together and defend in the Fall.", "author": "hdorsettcase", "created": 1563564782, "retrieved": 1632845807, "over_18": false, "upvotes": 412, "upvote_ratio": 0.98, "comments": {"eubwl4c": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eubwl4c/", "text": "Good on you for being persistent and refusing to lie down. Props to the dean too forfinally addressing this", "author": "offtonopeville", "created": 1563658842, "upvotes": 1}, "euaoawq": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/euaoawq/", "text": "Hang in there. You've remained so strong in a terrible situation. Good luck and hope you land that dream job!", "author": "sgaw10", "created": 1563627046, "upvotes": 1}, "euakf18": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/euakf18/", "text": "Congratulations on making it this far!!!!\n\n&#x200B;\n\nYou will finish which is the main thing :) and even if you didn't learn what you went to grad school to learn maybe there's some light in the tunnel and in learning how to navigate academic politics you have learned a skill for life", "author": "cupoftea_I", "created": 1563622785, "upvotes": 1}, "eu9xmhw": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu9xmhw/", "text": "I’m sorry you’ve had such a shit experience. I hope the next few months go better for you.", "author": "microvan", "created": 1563593916, "upvotes": 1}, "eu9x0x6": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu9x0x6/", "text": "So you went head-first into hell, and came out alive and stronger?  Congrats.  I hope the rest of your time in the program goes smoothly, now that your Advisor is off your Committee!", "author": "_Doctor_D", "created": 1563593371, "upvotes": 3}, "eu9hfen": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu9hfen/", "text": "Glad to hear the dean has your back. What do you plan on doing after graduation, if you don't mind me asking?", "author": null, "created": 1563580652, "upvotes": 3}, "eu99ytk": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu99ytk/", "text": "Bro this is scary. Good luck!", "author": "_elonmusk", "created": 1563575177, "upvotes": 3}, "eu97vtm": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu97vtm/", "text": "Every time I read one of your updates it makes me more thankful for my PI. Sorry he put you through all of this.", "author": "NintendoNoNo", "created": 1563573750, "upvotes": 6}, "eu93z45": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu93z45/", "text": "I'm utterly fascinated by your story. This was a horror scenario I was avoiding in my own grad life. Although I had experiments that worked and published, the uncertainty and feelings of being stuck and out of control definitely made a major negative impact on my mental health. Kudos for making your way thru this. Sometimes all you need is to endure. The reality is that the work behind the PhD  isn't as important as the journey and the degree. No one will really care too much once you leave academia. So, what's next on your path?", "author": "dr_gymrat", "created": 1563571145, "upvotes": 44}, "eu93twu": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu93twu/", "text": " Glad to see an update on this, happy it worked out", "author": "Running_Is_Life", "created": 1563571048, "upvotes": 2}, "eu92v4o": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu92v4o/", "text": "This sounds terrible. As someone who has alsohad an abusive advisor and nightmare situation, I want to repeat what you said about feeling relief when other people tell you it's not your fault. I spent too many months trying to also work my way out before I realized it was not going to get better for me. Other people should know to not wait longer to talk to someone. Seek help as soon as you feel like something is wrong. It can save you so much agony.", "author": "elainejftwk", "created": 1563570405, "upvotes": 12}, "eu8xzhi": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu8xzhi/", "text": "Thank you for sharing.", "author": "PopCultureNerd", "created": 1563567249, "upvotes": 13}, "eu8xv5w": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu8xv5w/", "text": "So glad the administration is taking ownership and not making you feel as if this is your fault. Hope the move and time away from the place will help you regain your balance after all your despair. Best of luck.", "author": "magpie2295", "created": 1563567170, "upvotes": 89}, "eu8x1ig": {"link": "/r/GradSchool/comments/cfc1i4/update_my_adviser_has_been_removed_as_chair_and/eu8x1ig/", "text": "What a nightmare, at least there's a light at the end of the tunnel now. Good luck.", "author": "MisanthropicPotato", "created": 1563566639, "upvotes": 107}}}