{
  "sid": "pmwqo4",
  "link": "/r/GradSchool/comments/pmwqo4/is_my_gpa_good_enough/",
  "title:": "Is my GPA good enough?",
  "text": "I'm not sure if this sort of thing is allowed on this subreddit, and my apologies if it's not. I'm applying for my history masters at a bunch of \\~prestigious\\~ schools, a handful of which rejected me when I was applying for my B.A. My GPA is a 3.66, and I'm so nervous that it's not going to be good enough. I know they also look at your recommendations and writing samples, but I am feeling very insecure about it. All of it.",
  "author": "confusionconsultant",
  "created": 1631466718,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.84,
  "comments": {
    "hcnbp1a": {
      "link": "/r/GradSchool/comments/pmwqo4/is_my_gpa_good_enough/hcnbp1a/",
      "text": "That isn't bad! I haven't applied for history MAs or even researched them that much but as a history undergrad, my impression of the field as a whole is that the writing sample would probably make up the largest chunk of what they consider (which is luckily the thing that you have the most control over now). But even so, a 3.6 isn't a bad GPA by any means. \n\nGood luck!",
      "author": "likenightfall",
      "created": 1631502293,
      "upvotes": 2,
      "replies": {}
    },
    "hcm5vvk": {
      "link": "/r/GradSchool/comments/pmwqo4/is_my_gpa_good_enough/hcm5vvk/",
      "text": "Grad school is a lot more than your GPA, and while it’s not a 4.0, a ~3.7 is _solid_!!",
      "author": "al_the_time",
      "created": 1631482894,
      "upvotes": 3,
      "replies": {}
    },
    "hclvcnk": {
      "link": "/r/GradSchool/comments/pmwqo4/is_my_gpa_good_enough/hclvcnk/",
      "text": "I got into a top school with a 3.49, the rest of my application was stronger though",
      "author": "gardenbitch420",
      "created": 1631478586,
      "upvotes": 3,
      "replies": {}
    },
    "hcl0zxn": {
      "link": "/r/GradSchool/comments/pmwqo4/is_my_gpa_good_enough/hcl0zxn/",
      "text": "i mean an application is far far more then just a GPA but yes a 3.66 should be FINE!! I got into a top 5 US program with a 2.9 GPA lol (different field from yours though).",
      "author": "Contagin85",
      "created": 1631466804,
      "upvotes": 12,
      "replies": {}
    }
  },
  "updated": 1634066881
}