{"sid": "prpt2q", "link": "/r/GradSchool/comments/prpt2q/nsf_grfp_advice_and_reviewer_request/", "title:": "NSF GRFP Advice and Reviewer Request", "text": "I am on my 5th major revision of my research proposal for the NSF GRFP and I was hoping that I could get feedback or ways to improve my proposal. \n\nFor context, the research proposal focuses heavily on mitochondrial biology. Also, I am a planning to apply for Ph.D. programs in the fall, and I currently work at a biopharm/biotech startup in the neurodegenerative diseases space as a Sr. RA.\n\nAny help is appreciated. Thanks in advance!", "author": "Modysseusakash", "created": 1632122536, "retrieved": 1632844130, "over_18": false, "upvotes": 2, "upvote_ratio": 0.75, "comments": {"hdqdjie": {"link": "/r/GradSchool/comments/prpt2q/nsf_grfp_advice_and_reviewer_request/hdqdjie/", "text": "congrats on applying!\n\nAs others said, it’s hard to offer specific advice without seeing your draft, but here are my go-to tips for applicants:\n\nResearch statement:\n\n-Try to avoid jargon and acronyms as much as possible. Assume that it’s midnight and your reviewer has a beer in one hand and 50 other applications to read in the other. Make it as easy as possible for them to follow your ideas and not get bogged down in the technicals.\n\n-Ask non-scientists to read your research statement. If someone who has taken college level bio classes can get the gist of what you’re proposing, then you’re in a good spot.\n\n-Make use of a good figure! A schematic-type figure that illustrates your aims is especially helpful.\n\nPersonal statement:\n\n-Don’t be afraid to bold or underline (but not both) certain sentences that underscore your capabilities. You WILL feel silly, but lean into it. \n\n-In your broader impacts section, when talking about mentorship or outreach activities you participated in, mention the lasting impact you had! where are your mentees now? what impact did your outreach organization have on the community? \n\n-if you’re currently in grad school or you know which grad school you’re going to, underscore how it’s the ideal environment for you. Underscore that the people, the methods, the science at the institution set you up for success.\n\n-Multiple professors have told me this, so ymmw, but don’t start your personal statement with a personal anecdote (my grandmother had alzheimer’s and now I want to study the brain, etc). I don’t have an opinion on this but it seems to be contentious.\n\n\nOne more thing: keep in mind that the NSF GRFP does *not* fund translational/biomedical proposals. If you currently work on neurodegeneration that’s cool, but be wary of proposing a neurodegenerative project.\n\nBest of luck!!", "author": "nixon_jeans", "created": 1632240342, "upvotes": 1}, "hdo91qm": {"link": "/r/GradSchool/comments/prpt2q/nsf_grfp_advice_and_reviewer_request/hdo91qm/", "text": "For the NSF, one thing to keep in mind is you're not expected to do the research you propose. So it's mainly an exercise in crafting a research plan and to show the reviewers that you can come up with a problem and how to logically answer it. Also, have a hypothesis. Literally say \"my/the hypothesis is...\".", "author": "Plasma4life", "created": 1632192425, "upvotes": 1}, "hdlcgp5": {"link": "/r/GradSchool/comments/prpt2q/nsf_grfp_advice_and_reviewer_request/hdlcgp5/", "text": "I think its hard for anyone to give you feedback without knowing anything.  You're on a 5th revision, I assume then that someone else has been giving you feedback on writing and what not.  \n\nThe GRFP has alot of components but I think focus heavily on the two (Broader impacts and something else?), but if you can't at least outline your research proposal on here then we can't give much advice.  Otherwise, theres alot of good material on the internet, and websites that host previous years awardees proposals.  I would suggest comparing yours to theirs and seeing what is different.\n\n&#x200B;\n\nI got good scores, but not funded.  This website was alot of help and breaks down previous proposal examples by their fields which may help.\n\nhttps://www.alexhunterlang.com/nsf-fellowship", "author": "idk_witty_username", "created": 1632147108, "upvotes": 5}}}