{
  "sid": "laa1q9",
  "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/",
  "title:": "It's after noon and all I've done today is start a dishwasher and cry. So normal Monday, how are you?",
  "text": "How are you? Doing okay? Taking you-time? Drinking water? Seriously checking in. Between reading, writing, research, and TA responsibilities (not to mention life complications), sometimes it's hard to feel able to initiate checking things off the perpetual to-do list from under all the weight. What helps you persevere on your harder days?",
  "author": "iamgoosee",
  "created": 1612203737,
  "over_18": false,
  "upvotes": 304,
  "upvote_ratio": 0.99,
  "comments": {
    "glrfgh7": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glrfgh7/",
      "text": "Have all my upvotes. Not even a grad student",
      "author": "CellgoneViral",
      "created": 1612289926,
      "upvotes": 2,
      "replies": {}
    },
    "glrd839": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glrd839/",
      "text": "Seems like we had a similar monday... I realized that I was really tired. So did two long power naps, did house tasks, went to bed early. Today is a lot better.\n\nMoral : it happens, and sleep is a key ingredient of an academic.",
      "author": "jtmooon",
      "created": 1612289047,
      "upvotes": 2,
      "replies": {}
    },
    "glr49p7": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glr49p7/",
      "text": "Little late to this but. I got a 94 on a Endocrinology test and a 54 on a Biochem test so mixed emotions. Do I cry or be happy lol\n-MS. Physiology & Biophysics",
      "author": "MrPhysiology",
      "created": 1612285563,
      "upvotes": 1,
      "replies": {}
    },
    "glqze8s": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glqze8s/",
      "text": "SPSS won’t let me change the variable age to scale so I can’t run my analysis, but I’m gonna bake cookies now and forget about it.",
      "author": "dheatttttt",
      "created": 1612283773,
      "upvotes": 2,
      "replies": {}
    },
    "glqfm3i": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glqfm3i/",
      "text": "Good job starting the dishwasher! Sometimes it's a great effort to do anything at all.\n\nI started journaling this year after months and months of malaise and anxiety. Journaling doesn't make me more productive, but it does help to \"talk\" and forgive myself for not doing enough. My field was very easily moved online, so every day I wake up, stare at a screen all day, and go to bed. Combined with the majority of everyone's interpersonal relationships being stripped away, it has been an isolating, demoralizing year.",
      "author": "mathbender99",
      "created": 1612276730,
      "upvotes": 1,
      "replies": {}
    },
    "glqboha": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glqboha/",
      "text": "Woke up late, straight past my goal to start study before work. Then watched Concussion with my dad after work before finally getting my online lecture done at midnight.",
      "author": "JavsGotYourNose",
      "created": 1612275002,
      "upvotes": 3,
      "replies": {}
    },
    "glpwf8n": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glpwf8n/",
      "text": "Wow this was me yesterday",
      "author": "Substantial-Froyo655",
      "created": 1612265546,
      "upvotes": 2,
      "replies": {}
    },
    "glppw1c": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glppw1c/",
      "text": "I also cried yesterday. But it was needed, I let myself feel like shit for the afternoon, and moved on afterwards. I feel more able to crack on with it this morning :) just got to keep making small, baby steps towards that bigger goal (even if everything I do feels like the tiniest, most painstakingly slow baby step)",
      "author": "beautyonthebiside",
      "created": 1612259915,
      "upvotes": 2,
      "replies": {}
    },
    "glpenaj": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glpenaj/",
      "text": "Yesterday was the day I hit rock-bottom. I was already feeling negative vibes Sunday evening and they transfered on to Monday. Just the overall hopelessness of the current pandemic and lockdown got the best of me. I started my workout but it did not go well, I started to read some literature and had to read the same sentence over and over again. I started crying and eating to find some comfort, resulting in some more crying out of shame and guilt. Eventually I wrote down how I felt in my diary and after some reflecting I was able to do everything I wanted to get done that day. But in the evening there was more crying and sadness.\n\nToday started better, I feel more optimistic and try to remember it all will get better and we are all in this together",
      "author": "joketem",
      "created": 1612250040,
      "upvotes": 5,
      "replies": {}
    },
    "glp6y84": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp6y84/",
      "text": "I'm waiting for my dissertation to do itself...\n\nI'm too tired now..",
      "author": "Sadrien6",
      "created": 1612244464,
      "upvotes": 2,
      "replies": {}
    },
    "glp6mvu": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp6mvu/",
      "text": "I wrote 200 words and read 3 pages of a PDF. That's not nearly close to what I wanted to get done today",
      "author": "gleamblossom1021",
      "created": 1612244257,
      "upvotes": 3,
      "replies": {
        "glpfdeh": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glpfdeh/",
          "text": "That sounds like more than 0 to me :)",
          "author": "justwannalook12",
          "created": 1612250595,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "glp4p94": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp4p94/",
      "text": "Sent my first draft of my MS thesis to my advisor, which should be a good thing. She literally read 1.5 pages (of 120) and sent it back saying it was unacceptable because I didn't have a literature review.....\n\nI literally have a chapter titled 'Literature Review' it's 40 pages long, and includes 9 subsections. \n\nSo I spent months working on a document and she couldn't even be bothered to scroll through it and look at the the chapter titles before calling it unacceptable. \n\nShe wonders why I turned down her PhD offer.",
      "author": "sherminnater",
      "created": 1612242987,
      "upvotes": 11,
      "replies": {
        "glq0b0v": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glq0b0v/",
          "text": "Wow that’s huge for an MSc! Did you not have any limits? \nI was limited to 15,000 words for mine. \n\nThat sucks though, what an unprofessional response!",
          "author": "SkiingisFreeing",
          "created": 1612268499,
          "upvotes": 2,
          "replies": {
            "glq6m5d": {
              "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glq6m5d/",
              "text": "No limits, it's about 26,000 words with the bibliography included. This isn't the first time she's read a fraction of something I've wrote and called it unacceptable. \n\nI'm really happy with the results and think I've got a pretty good chance of getting a publication from it. Having some real feedback would have been nice, but I guess her time is much to valuable.",
              "author": "sherminnater",
              "created": 1612272426,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "glp4kc3": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp4kc3/",
      "text": "I didn’t even get my fatass out of bed until 11:45.",
      "author": "MrUnknown1996",
      "created": 1612242902,
      "upvotes": 3,
      "replies": {}
    },
    "glp32l6": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp32l6/",
      "text": "Hey you did more than me. \nFor me, on these days I sometimes just accept that I won’t get anything done. I embrace the suck, laze the fuck out and vow to get right back on the grind the next day. It usually works",
      "author": "insideman513",
      "created": 1612241974,
      "upvotes": 3,
      "replies": {}
    },
    "glp2lfr": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp2lfr/",
      "text": "Just a little perturbed because I have no idea what I'm supposed to be doing on this homework that's due tomorrow. It's just great having a professor who is at least 87 years old try to teach online by essentially reading from his handwritten notes.",
      "author": "awksomepenguin",
      "created": 1612241682,
      "upvotes": 3,
      "replies": {}
    },
    "glp0lo8": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp0lo8/",
      "text": "My to-do list is back to point one from week 2 in January because my experiment tanked and now I have to restart.\nMotivation? Completely lost.",
      "author": "mymindisapipebomb",
      "created": 1612240510,
      "upvotes": 2,
      "replies": {}
    },
    "gloy8aw": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/gloy8aw/",
      "text": "I’ve poured my coffee down the drain thinking I was gonna microwave it.... now I’m drinking wine and about to roll a j.",
      "author": "megarocket1",
      "created": 1612239193,
      "upvotes": 4,
      "replies": {}
    },
    "glowl1n": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glowl1n/",
      "text": "It's almost 11:00 and I've only worked on my dissertation for about 45 minutes today. The rest of the day was spent oversleeping, shopping for my mom, walking the dog, staring at my phone, and spacing out.\n\nJust like every other day. I'm so frustrated with myself.",
      "author": "baboonchute",
      "created": 1612238315,
      "upvotes": 7,
      "replies": {
        "glpy0eg": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glpy0eg/",
          "text": "I feel this so much. It’s 12pm for me here today and I’ve only just opened my computer. Blankly starting at my dissertation rn with no signs of anything happening",
          "author": "skittles615",
          "created": 1612266803,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "glowbjl": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glowbjl/",
      "text": "Hey, sometimes crying and doing minimal things is needed. Take breaks! \n\n(I should follow my own advice, but lately I’ve just been sinking further into a hole of limited productivity... mostly because I took on too many projects at once, and legit can’t handle it... but don’t know how to tell my PI. Soooo yeah.)",
      "author": "BiologyPhDHopeful",
      "created": 1612238176,
      "upvotes": 4,
      "replies": {}
    },
    "glot92v": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glot92v/",
      "text": "Thanks for checking in, I got a 40 on my first economics quiz today.  Econ has never been my strong suit and I’m honestly trying to think positive because it’s totally possible to finish with an A still in the class.  Now to continue writing my paper for my OB class due tomorrow evening before class.",
      "author": "Jaso1n1",
      "created": 1612236608,
      "upvotes": 7,
      "replies": {
        "glotvx7": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glotvx7/",
          "text": "That's tough, but it's going to be okay! It's only the first one. There are always office hours too. Definitely do keep thinking positive! It's easier to stumble on what's ahead of you if you're too focused on what's behind you. Kick ass on your OB paper!",
          "author": "iamgoosee",
          "created": 1612236926,
          "upvotes": 3,
          "replies": {
            "glovnd7": {
              "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glovnd7/",
              "text": "Appreciate the kind words!  Love that quote as well, I’ll have to keep that one in mind.  Today has been a really tough day with just thinking of a lot of negative thoughts about myself, like if it’s better for me not to be in the program and if I even have what it takes, etc.  but, I know I can’t think like that and just keep going.",
              "author": "Jaso1n1",
              "created": 1612237828,
              "upvotes": 3,
              "replies": {
                "glow5qq": {
                  "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glow5qq/",
                  "text": "I'm having the same kind of day. I'm 3.5 years into my PhD and I can't tell you how many times I've questioned whether it'd be possible to get even where I am now. A younger version of you might have wondered if it'd be possible for you to be where you are now too. You always have what it takes.",
                  "author": "iamgoosee",
                  "created": 1612238094,
                  "upvotes": 7,
                  "replies": {
                    "glowo6h": {
                      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glowo6h/",
                      "text": "Seriously needed this after today, thank you so much. Along from the career opportunities, It’s been a personal goal of mine to get my MBA, maybe even a DBA one day.  I have so much more motivation to continue this paper now lol.  Thank you again.",
                      "author": "Jaso1n1",
                      "created": 1612238361,
                      "upvotes": 3,
                      "replies": {
                        "glox07o": {
                          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glox07o/",
                          "text": "Good luck! You can do it!!",
                          "author": "iamgoosee",
                          "created": 1612238535,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gloqhol": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/gloqhol/",
      "text": "OMGGG right there with you! i cried on sunday too. i’m feeling so exhausted, overwhelmed and stressed. i watch some friends (the tv show...not my friends.....that would be creepy) every night before bed. on sunday, i rewatched some standup on netflix to laugh after i cried...hang in there. glad you posted this because you’re definitely not alone. and the pandemic doesn’t help. it’s not like i partied it up before but iono...i feel so cooped up. \n\nif you like vulgar standup, maybe these will make you laugh:\n- tom segura, ball hog\n- bert kreischer, secret time\n- bill burr, paper tiger",
      "author": "vanillaladiee",
      "created": 1612235224,
      "upvotes": 5,
      "replies": {
        "glouon4": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glouon4/",
          "text": "That's been me too! New Girl has been my go-to before bed. There really is something about the pandemic, I wasn't an out-goer much before, but it's almost like just not being able to makes it more annoying.\n\nAhh ok I've seen and loved the Segura and Kreischer ones so I'll definitely be giving Paper Tiger a watch. It does feel really nice to have a good laugh after a good cry!",
          "author": "iamgoosee",
          "created": 1612237328,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "glopo47": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glopo47/",
      "text": "Waking up feeling glued to my bed but my little cells need attention so to lab I went...",
      "author": "roseleaf8926",
      "created": 1612234819,
      "upvotes": 8,
      "replies": {
        "glouwq2": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glouwq2/",
          "text": "FTC (for the cells)!! #hero",
          "author": "iamgoosee",
          "created": 1612237444,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "glopfyx": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glopfyx/",
      "text": "My MIL fell and broke her hip so I ended up not only taking a day off of work but losing a night of homework... and it's totally not her fault, but I'm feeling very burned out as a caregiver and like I'm not doing well three weeks into my program. :(",
      "author": "darth_advocate",
      "created": 1612234711,
      "upvotes": 5,
      "replies": {
        "glot7av": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glot7av/",
          "text": "I'm so sorry to hear this! I wish your MIL a fast recovery and I hope you're able to work it out between caregiving and your program. Luckily the more you can communicate with those who need to know in your program, the more understanding they can be when you need a little extra time.",
          "author": "iamgoosee",
          "created": 1612236584,
          "upvotes": 4,
          "replies": {
            "glovwbi": {
              "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glovwbi/",
              "text": "Thankfully I’m in a social work program, so I’m sure they’d be more than understanding. I just don’t want to have a crisis so soon into starting the program.",
              "author": "darth_advocate",
              "created": 1612237957,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "glom3t2": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glom3t2/",
      "text": "Sometimes when this happened I would just call it on school for the day and instead purposefully not do any work. I would go out and get food and watch Netflix and paint my nails and things like that. CHOOSING to take a day off vs feeling like it just kind of happened helped me recharge better even though the same amount of stuff got done (which was nothing).",
      "author": "museum_hoe",
      "created": 1612233104,
      "upvotes": 17,
      "replies": {
        "glov7h1": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glov7h1/",
          "text": "YES honestly this is what I ended up trying today, just leaning into the time off, and it took all the pressure off. It was amazing! It helped so much.",
          "author": "iamgoosee",
          "created": 1612237599,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "glojg7g": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glojg7g/",
      "text": "I have been meeting with a counselor once every two weeks and that seems to be helping! I also run to clear my head and avoid responsibilities (while also keeping somewhat healthy). In my opinion,  sometimes you just have to embrace those days where you have no motivation!",
      "author": "_insertjokehere_",
      "created": 1612231819,
      "upvotes": 8,
      "replies": {}
    },
    "gloiidj": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/gloiidj/",
      "text": "I want to scream. I thought I was within spitting distance of collecting data, only for a hardware interfacing issue to set me back anywhere from two weeks to six months. Combing over thousands of lines of a former student’s code is not how I thought my stem PhD would go.",
      "author": "Potsoman",
      "created": 1612231363,
      "upvotes": 12,
      "replies": {}
    },
    "gloabtb": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/gloabtb/",
      "text": "ugh, I finally got time on the IC after months of it not working, and went to review my data to see what samples I needed to run.... oh yeah, all of them, since the data I did have sucked 🙃",
      "author": "Capt_McDinoWoman",
      "created": 1612227479,
      "upvotes": 3,
      "replies": {}
    },
    "glo5jpg": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glo5jpg/",
      "text": "I feel ya. Rough personal day for me and I can’t even motivate myself to make one slide that I need to",
      "author": "bgnano",
      "created": 1612225220,
      "upvotes": 20,
      "replies": {
        "glp3nfs": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glp3nfs/",
          "text": "I thought it was only me....took ages to get out of bed",
          "author": "ash4reddit",
          "created": 1612242328,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "glo16o2": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glo16o2/",
      "text": "Currently sitting topless on my couch ignoring my emails and too lazy to go out in the snow for groceries 😬",
      "author": "hilaryfayesvan",
      "created": 1612223197,
      "upvotes": 21,
      "replies": {
        "glrb8cz": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glrb8cz/",
          "text": "Are you my long-lost twin sibling? Because MOOD.",
          "author": "ChezJason",
          "created": 1612288265,
          "upvotes": 2,
          "replies": {
            "glrc18s": {
              "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glrc18s/",
              "text": "I finally found a shirt and turned on my switch, so we may be here a while ✌🏼",
              "author": "hilaryfayesvan",
              "created": 1612288578,
              "upvotes": 2,
              "replies": {
                "glrhps5": {
                  "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glrhps5/",
                  "text": "Damn I just remembered that I haven’t watered my animal crossing flowers in months. Happy playing!!",
                  "author": "ChezJason",
                  "created": 1612290823,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "glnze17": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glnze17/",
      "text": "I’ve been having a good day but don’t feel like it’s been a good day. My lecture went well and I got research work done, and I will run later and have a good dinner. But I feel like doing this for the next 3.5 months is impossible. I set up an appointment to meet with a new potential counselor and maybe they’ll be a good match for me and I can start dealing with all this exhausting anxiety.",
      "author": "LadyOfNumbers",
      "created": 1612222380,
      "upvotes": 28,
      "replies": {
        "glppjxk": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glppjxk/",
          "text": "Having had counselling for anxiety, it’s super helpful! Well done for setting up that appointment :)",
          "author": "beautyonthebiside",
          "created": 1612259610,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "glmwfkr": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glmwfkr/",
      "text": "Today I woke up at 5 am to work from 6 am-4:30. I get home at 5pm, let the dog out, and then leave to go to my personal trainer (which I’m stuck with until May). I get home again at 7:00, eat dinner, take a shower and then start school stuff some time between 7:30-8. I’ll watch my one hour lecture from today, read a few pages of textbook, and then go to bed. Just to do it all over again tomorrow 🙃. Idk how I’m going to keep doing this. The only thing keeping me going is knowing how terrible it’ll be if I get behind since I’m already struggling",
      "author": "idontknowwhattodo93",
      "created": 1612206731,
      "upvotes": 24,
      "replies": {
        "glnfl94": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glnfl94/",
          "text": "Wow, good for you! Maybe I'll try implementing better structure like this. Especially with working from home, setting boundaries between work time and downtime is probably easier when there's an itinerary to stay accountable.",
          "author": "iamgoosee",
          "created": 1612214106,
          "upvotes": 14,
          "replies": {
            "glnrcnn": {
              "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glnrcnn/",
              "text": "I work full time and am required to go into the office. I did have to quarantine for a week and work from home though awhile back. It was so hard to focus. I kept wanting to do little chores, eat snacks, play with the dog, etc... More power to you if you are doing everything from home, it’s not as easy as it sounds!",
              "author": "idontknowwhattodo93",
              "created": 1612218927,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "glmrofi": {
      "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glmrofi/",
      "text": "[deleted]",
      "author": null,
      "created": 1612204946,
      "upvotes": 95,
      "replies": {
        "glndjiv": {
          "link": "/r/GradSchool/comments/laa1q9/its_after_noon_and_all_ive_done_today_is_start_a/glndjiv/",
          "text": "Hey me too.",
          "author": "Contntlbreakfst",
          "created": 1612213329,
          "upvotes": 18,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066202
}