{"sid": "ihcrzf", "link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/", "title:": "Online Classes Suck", "text": "Just want to be a grumpy little goblin. Please feel free to share your grumpiness as well. \nOnline classes fucking suck. They just do, and everyone knows they do. I am incredibly relieved that I'm able to take online class, and I'm not forced to risk my health to go to class. Still. Staring at zoom for ten hours a day is awful. Fighting with technology every day is awful.\nAnd worst of all is professors trying to make the best of it. I know they are just trying to teach effectively and make this 1% less miserable. In theory, I really respect and appreciate that. But fuck I hate online teaching pedagogy!!! \nNo, I don't want to work in small groups once a week. I don't want to do more discussion board posts. I certainly don't want to comment on all my peer's posts. These activities don't actually build community. They don't actually prevent zoom fatigue. I miss last semester when everyone just leaned into how much everything sucked. Now everything sucks and I have three times the busy work in an attempt to somehow make me feel better. \nI can't imagine doing this for the rest of the semester, let alone potentially doing it in the spring. \nI love my work, and I love my research, but goddamn this is miserable.", "author": null, "created": 1598495198, "retrieved": 1632845388, "over_18": false, "upvotes": 495, "upvote_ratio": 0.96, "comments": {"gfxiz9x": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/gfxiz9x/", "text": "I feel like I don't learn as much with online classes. I think professors use peer to peer reviews so they don't have to review our stuff. Plus, it feels like the professors expect you to know how to do everything all the time. At times I feel like I'm teaching myself and paying them to do it. It fucking sucks.", "author": "Iamhere0907", "created": 1608047772, "upvotes": 1}, "gfxinhh": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/gfxinhh/", "text": "On a side note, I love your name. Lol.", "author": "Iamhere0907", "created": 1608047612, "upvotes": 1}, "g331nfi": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g331nfi/", "text": "Omg, yes! This is my first year in grad school and it has been extremely stressful and even physically painful. My eyes, even with glasses prescribed specifically for computer usage, have been extremely uncomfortable after long hours of staring at a computer screen and I cannot, for the love of god, focus because I physically get so worn out from staring at a computer screen so many hours throughout the day. My eyes don't get to rest and I have constant and frequent migraines because of this as well. It's only day 2.", "author": "spacewasabi606", "created": 1598575117, "upvotes": 2}, "g32456y": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g32456y/", "text": "The thing I hate about online classes is when people do synchronous lectures. I am low income, live in a studio apartment, and the only place I have to work is my bed because I don't have other furniture. I don't feel comfortable sharing my screen in synchronous lectures for that reason.\n\nIt's also really annoying because so many people have different audio qualities, and the constant feedback, background noise and changes in volume give me a headache and make it hard to concentrate. I will frequently mute my computer when other people talk for this reason. \n\nI have a lot of sympathy for faculty who are scrambling to throw together courses last minute because of administrative tomfoolery, or who may be a bit older and unfamiliar with technology. Online education isn't a simple translation of in-person class to digital format. It's a whole different experience and skillset, and I don't think administration understands that.", "author": "False-Guess", "created": 1598558230, "upvotes": 4}, "g31vcsb": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31vcsb/", "text": "I feel the same. I’m a first year who took “time off” and so, in addition to feeling a little out of practice and learning how to grad student, I have to deal with online classes and the world feeling like it’s ending. I like to think maybe I’d feel less bitter if it wasn’t my first year back in the field. \n\nI can’t keep up with notes because professors have everything pre-written and speed through the material because they don’t have to write it down. Notes help me stay engaged and process, but I can’t do that now unless I take 4 hours to rewatch lectures. There’s a lag with the audio and the document camera (which also stutters!) so my professor’s pointing to “this, that, and this” is impossible to follow. I’m struggling to focus in class because they are back-to-back for 4.5 hours on top of the speeding through it. Sometimes my internet is shit so I miss things. \n\nI’m glad I can take them online. I like not commuting, dressing more comfortably, and being able to get a snack whenever. There’s a sense of “shit is crazy and we’re all in this together” in my cohort which is comforting. I like having recorded lectures. \n\nThat felt nice to get off my chest. Thanks for this.", "author": "abstractquatsch", "created": 1598554246, "upvotes": 3}, "g31v4gp": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31v4gp/", "text": "Wow I feel like I wrote this.\n\nI HATE the way my online classes are functioning. There is so much forced group work in one of my courses, and we get no say in who we work with.\n\nFor me the thing that sucks is how little some of my professors are willing to take feedback. I think everyone hates the format of one of my classes, and it's my teachers first time trying any online teaching so all of these techniques are new to him too, but every time we express concern he just stresses that this is new to all of us and it will get better as we get used to being online. The issue here isn't that we're online, its the methods he's specifically using. I feel like I'm learning nothing in class and doing all of the heavy lifting outside, which would be fine if class wasn't so frustrating that I want to pull my hair out. I LOVE the material its on but dread going to class. Which is obviously a terrible sign.", "author": "amberskied", "created": 1598554143, "upvotes": 3}, "g31torb": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31torb/", "text": "I am in a field where being in-person is particularly important in order to best practice our developing skill set ((counseling)), and so I tend to agree that online classes are far from ideal. I often find myself zoning out, doing other things on the computer like typing emails or finishing tasks for my internship, when I know I wouldn't be doing those things if I were in-person. I really hate the awkwardness of discussions on Zoom (\"I was think-\"  \"In my opinion-\"  \"Ooops, sorry, go ahead!\") and have noticed that I'm always anxious for class to be over and I get impatient towards the end. It's just draining.\n\nThat said, I *do* appreciate the fact that I don't have to commute to campus this term. My program is 'cameras on at all times' so I don't lounge in bed during class, but it's nice to wear yoga pants and hop on one minute before the course starts, rather than having to leave my apartment an hour early and fight the crowds via public transportation. I suspect I will be especially thankful for this once the colder, snowier months hit.", "author": "tequilamockingbird16", "created": 1598553504, "upvotes": 5}, "g31rvod": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31rvod/", "text": "I completely understand. My dad's a prof, and especially in the early stages, he had to work late into the night every day, just grappling with the technology, dealing with students being unable to access certain online materials, etc. It's hell for everyone involved.", "author": "amerikajin-janaidesu", "created": 1598552754, "upvotes": 3}, "g31n9c2": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31n9c2/", "text": "I’m really sad that I’m not getting to meet my peers in person!", "author": null, "created": 1598550816, "upvotes": 7}, "g31lnzg": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31lnzg/", "text": "I haven't taken any online classes in years. But now I'm teaching a lab that has both online and f2f sections. To say I have to adapt all the assignments to go online is an understatement. It's a complete overhaul. It eats a huge chunk of my time. And it's stressful, trying to come up with assignments that the students will get something out of without thinking the whole thing is just a drag. This whole situation sucks. I think we just need to pause everything in the world that isn't absolutely essential, get the COVID situation under some form of control, and hit reset on life in a year or so.", "author": "LowCream", "created": 1598550156, "upvotes": 3}, "g31liho": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31liho/", "text": "As a professor, I hate discussion boards and don't use them. I agree, I don't think they build a sense of community. I just go with asynchronous content and then meet once a week for a few hours with everyone to discuss points that are still confusing. It isn't ideal, but it has worked alright so far. \n\nIt sucks for everyone, and I want to go back to working closely with my students. I still haven't figured out what I'll do about labs...", "author": null, "created": 1598550085, "upvotes": 3}, "g31e3a5": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g31e3a5/", "text": "Going against the grain here, but I'm totally okay with online classes. If I could do my entire PhD this way (do online classes and in person research), I absolutely would. I did my masters online though, so I'm probably biased.", "author": "Reductate", "created": 1598546679, "upvotes": 3}, "g318q2j": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g318q2j/", "text": "You took the words right out of my mouth. One of my classes is hybrid and I've chosen to be online and there's just nothing being gained from it for me. I miss out on in-class discussion, there are technological issues, and it's just a nightmare. For my other online-only classes, one professor can't get Zoom to work so we're planning on a 5 (!) hour-long class next week to make up for missing this week's, as though we don't have other work or other classes. \n\nThis is such a shitty time and I really appreciate you being honest about it. Everyone is trying to act as though it's fine, but it's garbage. I'm not learning as effectively, things are shitty, and I'm still paying tuition.", "author": "citymiddled", "created": 1598544180, "upvotes": 3}, "g313khm": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g313khm/", "text": "Completely understand how you’re feeling. It’s definitely a challenge sitting on zoom for hours on end then studying for hours on end. I’m lucky this semester I don’t have to take classes and can just focus on my research until Spring. \n\nBest of luck to you!", "author": "Late_Place", "created": 1598541724, "upvotes": 2}, "g310vvj": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g310vvj/", "text": "I respectfully disagree. I’m in the last semester of an 100% online master’s program, and on my way to a doctoral program that has a hybrid format. Online has worked for me, as a working professional- I get to participate in lectures online and submit work without the hassle of adding a commute to a campus as part of my work day. IMHO, online is great for folks who are self motivated, and work well independently...", "author": "SwingL7", "created": 1598540421, "upvotes": 2}, "g30zo47": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30zo47/", "text": "You are an extrovert, aren't you...", "author": "qofworld", "created": 1598539821, "upvotes": 0}, "g30yzpk": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30yzpk/", "text": "Ugh I feel this. The barrage of discussion posts is starting to get on my nerves. And the overachievers who write massive essays from basic discussion posts. \n\nEspecially when it’s some trivial question and I see other students write these impressive essays with so many resources, and I just write a few paragraphs (I feel like I’m just trying to keep up). The dedication is great but I have actual research and papers I’m working on.", "author": "xWhiteRavenx", "created": 1598539484, "upvotes": 5}, "g30y5z2": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30y5z2/", "text": "All I can do is upvote because if I could learn stat mech via videos I’d have just done it on YouTube instead of taking the class", "author": "pttm12", "created": 1598539076, "upvotes": 3}, "g30w8ey": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30w8ey/", "text": "I don't mind online classes because I'm an introvert but I'm taking a class right now that's duel for undergrads and grad students, undergrads watch the Zoom lectures and grad students are supposed to receive slides but our Proff hasn't posted anything and we're a week in. This will be interesting", "author": "izzyjuell", "created": 1598538106, "upvotes": 2}, "g30voke": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30voke/", "text": "I’d also like to add: THE MIX OF ONLINE + IN PERSON IS CRAP. I have an IP class/lab and directly after I have an online course. The problem? There are no public spaces open to sit and zoom on campus (eyeroll) and I do not have enough time to get home. This semester bites.", "author": "PaleoNimbus", "created": 1598537823, "upvotes": 2}, "g30v8u9": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30v8u9/", "text": "If it wasnt for the fact I'm terrible at this subject and wanted to take in person classes due to it I would be 100% fine. :(", "author": "kisarax", "created": 1598537598, "upvotes": 1}, "g30ukv8": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30ukv8/", "text": "The burnout from online classes while also working full time online is real. It feels like my retinas are burning from all the computer time. \n\nI’m working on my MBA and the online format hasn’t been great for the program, which needs case studies and in-class participation/break out sessions. \n\nI’m sure the online classes are hard for professors to prepare for, but I have had 4 classes since COVID lockdown in March and all of them have decided to cut 3 hour lectures down to 30 min-1 hour and assign a whole textbook to read to make up for it. I can’t absorb all the information from reading alone, and I also can’t manage having 100 pages to read for each class (2) every week while also trying to work full time.", "author": "trvlust45", "created": 1598537247, "upvotes": 5}, "g30o4m2": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30o4m2/", "text": "you are so right, pls scream it into the void. i have an assistantship so not only am i sitting on zoom for three hour classes, but also 5 hour shifts. it fuckin blows. not to mention i took a semester off (graduated early) so it’s kinda my first time doing zoom classes and i feel so behind. idk proper zoom etiquette. \n\nyour comment about discussion board posts hurt my heart for the accuracy but also warmed it to know i’m not alone lmao. with everything going on, ya i’m grateful, but fuckkkkk i’m not sure i’ll make it through 😅", "author": "uhimsyd", "created": 1598533670, "upvotes": 4}, "g30nxlf": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30nxlf/", "text": "I think the major problem is that a lot of faculty try to recreate the traditional face-to-face experience rather than accepting that online education is an alternate modality and should be treated as such. \n\nI'm a professor now. I'm trying to draw inspiration from YouTubers and streamers and imagine myself as a content creator more than anything else these days. I loathe discussion board posts, Zoom breakout groups seem like digital prison, I don't understand why everyone wants to meet synchronously exactly the same number of times per week as an IRL course. It's like putting old wine in new bottles, rather than creating something new. \n\nHere's a sample of what I'm trying to create. Not perfect, but I feel like I'm going in a more productive direction that starring into the abyss of Zoom.\n\n[https://youtu.be/u6R5W4lixpQ](https://youtu.be/u6R5W4lixpQ)", "author": "Mtt76812", "created": 1598533551, "upvotes": 22}, "g30m1v8": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30m1v8/", "text": "I've been doing my entire second master's online because I work full-time, and it's been awesome. But I think that a lot of profs who were teaching in-person and are now going to online are just trying to recreate IRL lecture classes online, which is silly.\n\nI've never had to show up for a virtual lecture in 3 years of this program.  Assignments/discussion boards are due on one day, the new module opens with that weeks readings, videos, etc. Sometimes there's group stuff that requires some communication to get on the right schedule together.\n\nThere's still a lot of work to do, and a lot of reading (of course, it's grad school) but it's so flexible while still being pretty rigorous. \n\nBut to all those new to online learning, and with profs who are new to online teaching- good luck this semester!", "author": "llamalibrarian", "created": 1598532382, "upvotes": 2}, "g30itai": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30itai/", "text": "As someone who has been doing online learning for a while, I share your pain.\n\nHave you got that one person that doesnt shut the fuck up yet? I find theyre the worst part of it.\n\nAlso, ten hours a day is too goddamn much, and they want you to do some extra shitty engagement metrics shit on top of it? What a bunch of hacks.", "author": "nerdyogre254", "created": 1598530166, "upvotes": 5}, "g30h18c": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30h18c/", "text": "This isn't applicable to just grad school... this is everything! But I'm you 100%. The irony is that I turned down jobs that were going to make me teach online and now here I am... 100% online. Life is wild.", "author": "ajd341", "created": 1598528765, "upvotes": 3}, "g30glvn": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g30glvn/", "text": "Nobody has mentioned tuition increases. Thats was makes me sad. Its absurd that schools, NYU being mine, are raising tuition (NYU 4%). Like fkoff", "author": "Kroland12", "created": 1598528422, "upvotes": 5}, "g3065c6": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g3065c6/", "text": "I am still moping a little bit, because I worked so hard to get to go to an international conference. This was supposed to me my special treat, instead the conference went virtual (they did a very, very good job though) and I got to do shitty work at my uni instead.\n\nThe only good thing about the whole remote/digital thing. I am writing this, while \"attending\" a course that is a waste of time for me. Just turned my camera off and muted the mic and have to have one ear for the course to come back, when I need to say anything.", "author": "sneleoparden", "created": 1598518299, "upvotes": 3}, "g301ua3": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g301ua3/", "text": "I think this depends on the professor. \n\nI did online courses while I was attending undergrad in person. The professors weren't great, and it's because their primary mode of instruction was in-person. \n\nI just finished my grad program and I did the whole thing online. Loved it. I honestly think I learned way more in 1.5 years than I did in my dual degree 4 years at undergrad, but I think it's because the professors primarily teach online and have an effective way of doing so.", "author": "DoubleDVa", "created": 1598514020, "upvotes": 2}, "g300pap": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g300pap/", "text": "Not a grad student. But I have been through many majors and have been doing online classes for years. I love it!! The only thing that's annoying is the new restrictions they are doing for COVID and changing the structures of most classes. I hate this part so much because I'm traditionally and online student and its all throwing me off my usual acitivities. More face stuff. More meeting blah blah. Blah. I don't need someone to teach me anything. I just take my classes study on my own time and do excellent. I'm sure this differs with grad school but gosh us traditionally online student are affected too.", "author": "Zyrf", "created": 1598512904, "upvotes": 0}, "g2zxdsn": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zxdsn/", "text": "That is so true. I just cant take it seriously and i lost interest way too fast when its online. I don't believe you can actually get proper education from online classes and assignments. You wouldn't even have the motivation since youre still at your comfort zone at home which we all know is associated with relaxing and free time not work and studying.", "author": "farahgh", "created": 1598509813, "upvotes": -2}, "g2zsw53": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zsw53/", "text": "I feel that. I'm really lucky because my program has an online only option prior to covid that a lot of people do. I still moved my partner and I a few states over because I wanted to learn in person. And now everything is online and I feel like it's all for nothing. Yeah I'm grateful that I have online classes already structured to be online, so they're not scrambling too hard right now. But it just sucks. Especially because this is my last year. It feels somehow like it was all for nothing.", "author": "betty_deez", "created": 1598506103, "upvotes": 4}, "g2zsopx": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zsopx/", "text": "I don’t really mind the classes online(although the social aspect, I do miss it), but starting research without having your lab mates or advisor helping has been quite a test.", "author": "slumpRib", "created": 1598505948, "upvotes": 6}, "g2zsm3h": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zsm3h/", "text": "Only thing I like about online classes is that you can just lie in your pajama's and stuff your face with food and verbally express yourself your honest thoughts such as wtf and such without people judging you or giving you mean looks.", "author": "Anonymous2212t", "created": 1598505893, "upvotes": 77}, "g2zsj8q": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zsj8q/", "text": "To be honest, I waver between being depressed about the remote situation, and then cheering up because I’m focusing on the bright side of it. In my personal experience, focusing on the things I ~can~ control and the benefits of staying home helps me temper the creeping depression. For example, I enjoy that I can get a LOT more research and self-care done in the day because I don’t have to commute, plan my lunches (& dinners, lol) at the office, or have awkward gaps between classes. I’m also really enjoying the reprieve from the insanely annoying drama and gossip that goes on in my department. At least 50% of students in my program occupy their offices on any given day for hours at a time, and end up distracting each other with banal gossip, and it drives me fucking nuts because we all share offices, so it’s hardly ever a quiet environment and I really don’t care to know what is going on in their personal lives. So yea, happy about not having to deal with them. \n\nI wouldn’t be lying if I said I wasn’t also really sad about the isolation, and that I’m literally counting the weeks until we do get to potentially go back. Especially not happy about being a TA, where I’m lucky if a quarter of my students show up to section. \n\nAll in all though, this is a temporary situation, and while it’s a totally valid response to be upset about having to do this, I do also think that focusing on elements you can control that make you feel better, and trying to emphasize positive thoughts for the sake of your mental health, will be beneficial (sorry for my unsolicited advice 😅)", "author": "LebaneseGangsta", "created": 1598505833, "upvotes": 29}, "g2zs6hx": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zs6hx/", "text": "Had first zoom class yesterday. Professor had crap connection. Sounded like dalek from Dr Who, screen share didn’t work, he reconnected like 20x in 15 minutes before throwing in the towel. Honestly it was extremely frustrating. However I’m no stranger to online self paced courses so I’m really feeling bad for the students who have little to no experience on the subject and actually need that interaction. I worked specifically in the area this course is about for 10 years and am probably going to be bored for at a minimum the first 10 weeks of class. If this remains a trend I’ll really be feeling bad for my fellow students.", "author": null, "created": 1598505570, "upvotes": 21}, "g2zo63m": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zo63m/", "text": "I've never understood the big deal about classes -- I've hated them online and offline -- and isn't research far more important for career anyways? It's not like anyone asks what gpa you got in your phd", "author": null, "created": 1598502678, "upvotes": 5}, "g2znxtu": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2znxtu/", "text": "I feel you!!! We are all doing the best we can.", "author": "BlissMeli", "created": 1598502521, "upvotes": 3}, "g2zn9s4": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zn9s4/", "text": "I was supposed to start my MSc next month, something I've been looking forward to for a while. But it's going to be a \"blended experience,\" so I deferred it. I'm glad I did but I'm not sure how I'll make it through another year of stagnation while my friends move forward.", "author": "Dorwytch", "created": 1598502074, "upvotes": 11}, "g2zn7p7": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zn7p7/", "text": "Honestly I have been loving the online stuff\n\nNo need to plan my commute or decide between making lunch for the day, use money to get take out, or just skip and starve. \n\nIf I need food, run down to the kitchen, feeling a bit tired? Take 5 steps to my bed and nap.\n\nI am in a CS program so the switch to online was seamless and normally I would be stuck in front of a PC anyways since I can't get much work done on campus without my own desktop.", "author": "Mikazukinoyaiba", "created": 1598502034, "upvotes": 87}, "g2zleux": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zleux/", "text": "I especially hate when professors insist that all cameras are off. Like Jesus Christ I don't want to look at a bunch of initials while you drone on with no engagement whatsoever.", "author": "Gerardo1917", "created": 1598500867, "upvotes": 9}, "g2zjrax": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zjrax/", "text": "Not trying to sound elitist, and I know that this will make me sound that way, but I have never understood how employers can consider a purely online degree the equivalent of a residential experience. It's not the same and this pandemic drives that point home.", "author": null, "created": 1598499840, "upvotes": -11}, "g2zfbdj": {"link": "/r/GradSchool/comments/ihcrzf/online_classes_suck/g2zfbdj/", "text": "I feel this so much. Online classes are definitely the worst. I'm just starting my graduate studies and am really sad that these very cool and hard classes I'm taking are all online. One class I can be on campus for once a week, maybe. I'm teaching a lab that I can be on campus for once a week, but getting the undergrads to adhere to social distancing in a lab environment is a pain and makes me sad...Ugh and don't get me started on my research. Everything is just not how I pictured it and it makes me really sad. \n\nSo I'm right there with you in being a grumpy goblin. Hang in there!", "author": "tiffily109", "created": 1598497166, "upvotes": 100}}}