{"sid": "l6aeo4", "link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/", "title:": "I just lost my dad while doing my master’s and now I have no motivation to do school right now.", "text": "Hi everyone,\n\nMy father just died of COVID-19 on January 6th. We were still on winter break at the time (I’m from Canada). He was literally my BEST friend and #1 confidant. I was a daddy’s girl my whole life (I’m only 23) so it’s been pretty hard. I was initially still in shock at the time of his death because I had to take care of my mother and her fight with the virus for a couple weeks after (she is over the virus now 👍🏼). Since then, dad’s death really sunk in and I miss him TERRIBLY. School started on January 18th and I told my professors that I wouldn’t be attending the first week of classes. For the most part, my professors were very understanding and accommodating. It is now the second week, and I have been attending but I haven’t been doing the readings for class. I have no motivation to do them right now. I’m usually a motivated/studious person and I did really well in my first semester. Now I feel so much guilt, because I don’t feel too motivated now. Perhaps it’s because I am still grieving. I just feel so lost without him because he was my biggest cheerleader &amp; always encouraged me to attend to my studies. I feel like I’m just holding onto surviving for the sake of my mom (who I am close with, but not as close as I was with my father). The thing is though, a leave of absence is not an option because it would mean that I wouldn’t be able to take classes until they are available again next year. \n\nWhile he was in his death bed, I virtually promised him that I would finish my master’s. I really want to. But as of right now, I only have motivation to attend class. Not sure what I should do to get all of my motivation back. Should I attend grief counselling? Has anyone been in this position? \n\nThank you so much\n\nSide-note: I love you all so much. Loving all of these posts right now, I am in awe. I’m sending Internet hugs to you all, especially those who are also facing their own situations with grief. Praying for you. All of your messages have given me so much reassurance that my feelings are very real and valid. My Asian mother had been pushing me to continue (it is in her belief that you just need to move on and deal with it), so YOU ARE ALL HELPING ME SO MUCH AIN REALIZING THAT GRIEF IS A REAL PROCESS THAT TAKES TIME. THANK YOU GUYS &lt;3 THESE ARE HELPING ME A LOT", "author": "honeymooonavenuee", "created": 1611770276, "retrieved": 1632953320, "over_18": false, "upvotes": 583, "upvote_ratio": 0.99, "comments": {"gnr40d5": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gnr40d5/", "text": "You must go on.would your dad want you to quit?????\nI dont know your dad,AND IM VERY  VERY SORRY.   MAYBE YOU SHOULD SEND A PRAYER TO HELP YOU WITH THIS DECISION", "author": "Junior_Truck_6307", "created": 1613558963, "upvotes": 1}, "gl4pl6p": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl4pl6p/", "text": "I recommend you obtain professional counseling. Grief takes time, strength, and determination. Good luck.", "author": "BPP1943", "created": 1611860578, "upvotes": 1}, "gl3r38o": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl3r38o/", "text": "I am so sorry. It is so awful what you are going through. I lost my step-dad whom I was close with two years ago, and then my father was diagnosed with cancer and almost died multiple times. It's been a very rough couple of years. My anxiety in grad school went sky rocket high. If you ever need someone to talk to you are welcome to DM me.", "author": "confidelight", "created": 1611848348, "upvotes": 1}, "gl2r4d6": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl2r4d6/", "text": "I am so sorry to read this, my heart goes out to you and family. Personally, I would take the semester off. This will you give you the ability to go through the grieving process and spend time with your family. If you need some sort of structure or distraction then consider keeping one class that you think you could still do while making yourself, your family, and your mental health a priority. \n\nI suffered some mental health problems not related to a family death but I wish I would have taken the semester off. My grades really suffered during my undergrad because of this. You’re in grad school so you’ve already proven you aren’t a “slack” student and I think 99% of people would be accepting of this. Good luck with whatever path you take.", "author": "nedonath", "created": 1611834033, "upvotes": 1}, "gl2px7y": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl2px7y/", "text": "You can always finish your masters... take time to cope and spend time with your fam... don’t push yourself if the mindset isn’t right", "author": "acs20596", "created": 1611833129, "upvotes": 1}, "gl2jmaz": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl2jmaz/", "text": "I’m really sorry to hear about your loss. Grief take its toll on people in different ways. I would suggest you strongly consider deferring a year and giving yourself some time to recover. \n\nTake care of yourself. This Reddit stranger is always here if you need a chat (also from Canada).", "author": "TheMDDream", "created": 1611827984, "upvotes": 1}, "gl2d9pp": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl2d9pp/", "text": "I'm truly sorry for what you're going through.", "author": "adclol", "created": 1611822617, "upvotes": 1}, "gl2c7zk": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl2c7zk/", "text": "Hey friend\n\nI’m so sorry that you’re going through this. I wish I could give you a hug!\n\nI know it’s hard to take practical steps right now but please please keep your professors updated. Let them know you are struggling more now. Do you have a personal tutor? (Or head of course or year of something) They should know more about your options and support available. This is absolutely a mitigating circumstance. \n\nYour uni should have counselling/well-being/mental health service as well (though this may depend where you are). They should also have info on getting extensions etc for extenuating circumstances. And they should have some counselling stuff available. \n\nLast but not least - it is FINE if you need to take a break from your Masters. Finishing a year later than you planned is not ideal but I’m sure you can make it work if there are any practical barriers. Lots and lots of people do it. Can you switch to part time? It sounds like your big barrier here is emotional though - your dad would absolutely not have wanted you to stress about this! Taking some time off is not the same as not finishing. And circumstances change - he would not be disappointed if you decided this masters isn’t for you. Making that decision is very difficult and I’m always impressed when people make the right decision for themselves.\n\nSorry for writing so much. I just want you to be okay. You’re doing so well <3", "author": "sexy_bellsprout", "created": 1611821762, "upvotes": 3}, "gl2bc27": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl2bc27/", "text": "I also lost my dad during my masters program. I'm so sorry. It gets easier, but the grief just sort of stays there. It's been a year and a half for me if that matters.\n\nYour university should have counselors you can reach out to, just keep in mind that sometimes the wait can be long.", "author": "sirziggy", "created": 1611821038, "upvotes": 1}, "gl1c3o1": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl1c3o1/", "text": "My dad died when I was 24, right before starting graduate school. I ended up postponing my start day by a semester. I am glad I did, it was still hard, but I don't think I would have been able to pay any kind of attention in class if I had started right away. I encourage you to talk with your advisor (or whoever would be appropriate) to see what your options are. Maybe a leave of absence is an option. Either way, I also recommend you don't force yourself to go through this alone. Lean on your friends, family, and therapist if you chose to see one.\n\nTake it one day at a time, this is so hard, but you will get through it. I am so very sorry for your loss and I am sending you loving and peaceful thoughts.\n\nninja edit to add: I ended up making it through grad school, I will defend my dissertation this semester. I made it through with the help and support of family, friends, therapist, a wonderful advisor, and patience for myself. Try to have some patience and kindness for yourself. Sending you a virtual hug.", "author": "somemoreagain", "created": 1611800614, "upvotes": 1}, "gl1as5e": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl1as5e/", "text": "I am so sorry to hear this. Both my partner and I are graduate students too and his father passed from COVID complications this past September. It has obviously affected my partner tremendously and I feel so bad for him. Try to surround yourself with your friends and family and do not be afraid to reach out to others for help; and like the other posters here, I would attempt to seek out therapy or perhaps talk to a mentor or colleague that you are close with. You and your family are in my thoughts and you got this <3", "author": null, "created": 1611800029, "upvotes": 1}, "gl0zlu7": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0zlu7/", "text": "Hugs!", "author": "immunobio", "created": 1611795274, "upvotes": 1}, "gl0x4om": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0x4om/", "text": "Go to THERAPY, baby!", "author": "apsg33", "created": 1611794433, "upvotes": 1}, "gl0w9wt": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0w9wt/", "text": "I am so, so sorry for your loss and am sending a big virtual hug.\n\nYou have your whole life and many, many years to finish this degree. If you feel overwhelmed or are struggling with grief, that is so incredibly valid and you should not worry about taking some time away to focus on yourself and do what it will take to get through the acute stages of grief (counselling, moving home for a bit, whatever else helps you).\n\nI lost my grandpa who was my best friend in the whole world during undergrad and I regret trying to push through with school. I was miserable and depressed, and my performance showed it. Some people are better at handling grief, but I would have been better served taking time away.\n\nETA: Sending a lot of love to everyone in this thread, especially those who are also sharing their stories of loss. It is really incredible to see such an immense sense of community, and I wish I had read a thread like this all those years ago.", "author": null, "created": 1611794152, "upvotes": 2}, "gl0v5a1": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0v5a1/", "text": "Wow, this hit so close to home. I lost my dad on January 6th 2020 to cancer, one semester into my PhD. No advice can really tell you how to cope with that kind of loss, especially during such a stress-filled and trying period in your life. \n\nI ended up (on the advice of a professor) taking a semester off. It was an unofficial mental health leave during which I still TAed but took no classes. During that time I felt like I had essentially given up, or at least proven that I didn't have what it takes to stick through my degree. \n\nNow I realize that if I HAD tried to push through I WOULD have given up. 9 months later I got back into school full time. I'm not a perfect student (and a pandemic doesn't help), but I love what I'm doing. I'm not 'over' losing my dad. I don't think I ever will be. But I'm in a better place now after being able to grieve without the stress of grad school over my head. \n\nI don't know you or your program, but I know that grad school is about being able to immerse yourself in your work and having the freedom to chase down every lead in the literature to answer your questions. Honestly ask yourself if you will be able to do that this semester, even with a few weeks off. Grief is not something that you can schedule like a vacation. It is going to come in waves, and sometimes you are going to feel like you are drowning in it, a minute after you felt like you just learned how to swim. I think a future you (a successful academic, I'm sure) will be grateful that you took time off to deal with your loss, rather than struggling against the current just because you want to hit a dead line. \n\nI realize that I was in a privileged position of being able to live off of my funding and savings for a few months without taking classes. I hope you are in a position to be able to do the same. \n\nLastly, I am so so sorry that you lost your father. It is the worst thing I have ever felt. The feeling of loss, the absence of that steady guiding hand, that honest advice-giver, and that dedicated hugger, is really indescribable. I hope you find peace in your grief and in the memories of your dad which will always be with you. \n\nPlease message me if you'd like to chat.", "author": "chunkyheron", "created": 1611793788, "upvotes": 2}, "gl0sb71": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0sb71/", "text": "I’ve just lost my grandmother and best friend over the break and am in the same boat. Grief comes in waves. I’m so sorry for your loss. I would have dropped out if it was my dad....he is also my best friend and #1 supporter. \n\nI unfortunately don’t have any advice. But just know who ever you are. You are loved and not alone!!! Don’t be afraid to lean on friends and let them know what your going through. No one should go through it alone.", "author": "GuyFierititbutter", "created": 1611792864, "upvotes": 2}, "gl0mkx4": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0mkx4/", "text": "Please learn from mistakes, so you don't end up fucked up and burnt out in 3 years' time, like i did after my mom passed.\n\nYou promised you'd finish. But please, please, please consider taking proper time off, 1 or 2 semesters. School will be there, but right now you're not there (mentally speaking).\n\nDon't push pash the lack of motivation and hide from your grief in your work, you'll end up tired and depressed and burned out and in fear that the true motivation you once felt to learn and improve and achieve will never return. There is no true honour in pushing yourself back into school/work before you're ready, and it won't help you in the long run.\n\nTake your time to go through the process, whatever that may mean for you. Allow yourself to feel all the feelings as they come so they don't end up overwhelming you. Focus on yourself, your mom, any family in your bubble, all your lives are now changes in big and small ways and you need each other's support. \n\nThere are ways to pay the bills with (legal and sfw) online, remote, part time work. PM me if you want OP and i'll be glad to recommend a platflorm i used to freelance.\n\nMuch love to you, internet stranger.", "author": "flowerchild413", "created": 1611790489, "upvotes": 2}, "gl0if5r": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0if5r/", "text": "My condolences to you and your family.\n\nThe death of your dad is the worst feeling in the world. My heart goes out to you and your family. I really don't have the right words to say, all I can do is share my experience with you if you'd like to read it. \n\nLast year, 2020, I graduated from my undergrad program in May. Two months before that (March), my father died, his heart stopped but it was mostly related to his kidney failure. It was a very tragic experience to go through as I was 26 years old with only 2 months to go to graduate with my BA. \n\nOn top of that, the covid restrictions had taken place literally the day after. My sister (24) is the one who finds it more challenging at the moment. Myself, it sucked, cried my heart out, sleep, eat, didnt eat, insomnia, thoughts, dreams. I accepted the fact that he gone and that it is part of life, even though I drive up to the cemetery and cry at random. \n\nI miss him so much that at times I dream of him and hug him, only to wake up in tears hugging a pillow. What I miss the most is his voice. But those cries help me clear my mind. I allow myself to have a good cry, I allow myself to feel as a man with a hispanic culture, where it is typically looked down upon for men to show feelings. \n\nYou say you are thinking of counseling, so whenever you are ready to talk to someone besides your family or friends, go ahead and make that phone call to make an appointment with a professional. There are also hotlines you can call (**1.833.456.4566)**  or [Canadian Crisis Services](https://www.crisisservicescanada.ca/en/) is a website you can look at in case you are in crisis and need to talk to someone.\n\nRemember, school will always be there. If you decide to take a break from school, that is absolutely okay. If you want to push through this semester, that is completely okay as well. I hope you get the peace, reassurance, and motivation to continue your education and live on to resemble your dad and your family. Feel free to send me a message if you ever need to talk to someone.", "author": "MultiPattern", "created": 1611788722, "upvotes": 2}, "gl0gocx": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0gocx/", "text": "I would really consider taking a semester or even two off, and if you can get grief counseling. I lost my dad during my bachelor's degree and tried to push threw. I ended up failing every class that semester and a bunch the semester after. I totally destroyed my GPA and wasted a lot of time and money. It would have been a lot better if I spent that time focusing on my family, mental health, and grieving. Im so sorry your going threw this.", "author": "sea_horse_mama", "created": 1611788011, "upvotes": 3}, "gl0egih": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0egih/", "text": "I am sure he was very proud of you. I know everyone’s experiences are different but perhaps I can share  what  I learnt when I lost my father to cancer while doing my masters during my first year. I know it is very easier said than done but you have to be strong by yourself. Talking to people might ease it but you will always be reminded of him at this difficult time when you are alone. Looking at his phone number tore me apart. I am not saying do this all on your own, by all means please talk to people, it helps. But when you are alone, memories will inevitably flood your mind. Please do grieve and reevaluate why he was so personal to you. No one will ever understand but you about your special connection. I am quite sure it will take time. Use it as a personal motivation to why you do what you want to do. Rest is up to you. I think it is possible to have motivation in your masters study. I completed everything on time and now his memories gives me so much stamina to work on my PhD. But then as I pointed out, every ones experiences are different and how I coped with my loss might not work with you. But please cry your heart out and think of all the good memories with him. Be strong where it counts and make him proud!", "author": "Okoraokora1", "created": 1611787139, "upvotes": 3}, "gl0d9qg": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0d9qg/", "text": "I'm really sorry to hear that. I'm in my master's right now and I went through an unexpected divorce. I tried to push through the emotional pain and keep working, and I completely fell apart. I thought if I took a leave of absence it would prove I'm a failure and weak. \n\nIf you can't work right now, you need to be okay with that. Let yourself grieve. Your worth does not come from your master's. \n\nTry to remove as many \"shoulds\" from your life as you can right now. You need to allow yourself to grieve without the extra pressure of your degree. I know it's hard, but you need to be in a good headspace to finish your degree. \n\nI'm so sorry to hear what you're going through. Take time for yourself. You're worth it, regardless of what happens with your degree.", "author": "Seag5", "created": 1611786654, "upvotes": 2}, "gl0cmix": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl0cmix/", "text": "There is so much love and sympathy happening in this thread. My heart goes out to all of you. \n\nI was in the same boat 10 years ago (whew 10 years flies by). My dad was my best friend, he died suddenly my first semester of undergrad. At the time I thought the best thing for me was to power through and finish my degree. That's what my dad would have wanted right? It took my two years to finally seek counseling and it took and extra semester to finish my degree.\n\nTen years of hindsight and I wish I hadn't been so stubborn. I wish I had been more patient with myself and given myself time to grieve. I grieved a long long time. I can't help but feel like if I had given myself a break I would have had a much better experience in undergrad...but here we are. \n\nEvery person is different but I hope someone else's perspective will help inform your own decision.", "author": "alexenrose", "created": 1611786393, "upvotes": 3}, "gl08yi8": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl08yi8/", "text": "I’m so sorry.\n\nFwiw— I lost a close  friend in school and wish I’d taken time off to grieve and heal. Instead I plowed ahead, which I regret.", "author": "Working-Blacksmith21", "created": 1611784936, "upvotes": 4}, "gl07wv5": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl07wv5/", "text": "Sending you big internet hugs. Please listen to your needs! I lost my dad in February of the 2nd year of my master’s. I felt I couldn’t take a leave because I was teaching, reliant on the income, and so fearful of disappointment. Being open with my advisor allowed her to collaborate with our program director to create accommodations for me to still complete courses even if needing to miss classes. Though I didn’t wind up take additional time away, simply knowing I had the option without an official leave was relieving. To get through, I reasoned that there was comfort in the structure of school/class/work, even if I was struggling to cope with my underperformance. With the help of my community, friends, advisor and a really great counselor, I was able to finish the program...but it was hard and I avoided/compounded a lot of my grief at the time. Your pain is very real and it is 100% ok to not be ok right now. Please try to seek out grief counseling, nestle in your blanket forts when needed, and allow yourself the big cries. Grief is not graceful, and it never quite fully fizzles, but it is a silent partner that will help you remember the most important moments with your dad. Sending lots of warmth and love.", "author": "commodifiedscholar", "created": 1611784516, "upvotes": 2}, "gl07kva": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl07kva/", "text": "God give you strength to deal with your loss", "author": "grandpassacaglia", "created": 1611784385, "upvotes": 1}, "gl05wo6": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl05wo6/", "text": "I'm in a very similar boat. My boyfriend just committed suicide on 1/14/21 and my semester started 1/25/21. I told my faculty and all my professors and they are working with me. I haven't done my readings, and I'm not really paying attention in class. It's very tough, especially as the reality starts to set in.\n\nI don't actually have advice. But just remember to sleep, eat, and take care of your basic needs before you think about school. We got this together. We can survive this.\n\nI'm sorry for your loss OP. It's never easy.", "author": "LachrymoseAuthor", "created": 1611783736, "upvotes": 11}, "gl05e9w": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gl05e9w/", "text": "Oh my sweet friend I lost my dad back in may and I completely empathize. To function, I’ve been following the “if you can’t fly run if you can’t run walk if you can’t walk crawl” since then. Sometimes even getting out of bed is the greatest accomplishment in the world when you’re going through a grief like this. I would 110% try grief counseling/group counseling. If you ever wanna share a memory but don’t know who to tell, rant, or share your accomplishments of the day, my inbox is always open for you! Rooting for you.", "author": "vantabean", "created": 1611783538, "upvotes": 3}, "gkzw8sr": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzw8sr/", "text": "You need to take more than a week break! Definitely recommend grief counseling as well. I lost my best friend in an accident my second year of my PhD and there is no working around it. You have to let yourself feel and work through it, and that’s going to take some time. I’m so sorry this happened to you, but you shouldn’t feel guilty at all for not having motivation right now. That’s completely normal.", "author": "queensofconvenience", "created": 1611780005, "upvotes": 5}, "gkzt8pv": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzt8pv/", "text": "I’m so sorry for your loss.\n\nMy dad died just over 2 years ago, at the end of my first quarter of my PhD. My advice is to take time for yourself. Ask your advisor if you still have time to take a planned leave of absence or to drop your classes and just take research credit this term. My dad died during finals week of Fall Quarter and I was back in classes by Winter Quarter. In hindsight it was a really bad decision. The whole quarter was a blur.\n\nYou can still graduate even if it takes you an extra term. Take time for your needs. Make space for your needs.", "author": "NormalCriticism", "created": 1611778814, "upvotes": 4}, "gkzscvg": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzscvg/", "text": "I am so sorry, the same thing happened to me the last semester of my bachelors and right before starting my masters. I wish I had words that made it all better, but there truly are none. I scraped through and did what I could to graduate and survive, sometimes that's all you can do.", "author": "MsCreature", "created": 1611778483, "upvotes": 2}, "gkzr6tn": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzr6tn/", "text": "I'm so sorry for your loss. My father was recently very sick with covid, and it was terrifying even though he survived; I can't imagine what it feels like for you right now. \n\nMaybe this is just because I've had a different path academically, but could you not take a year-long leave of absence and pick up your classes next year? At both my undergraduate and master's universities (in the UK) this is a fairly normal option and I'm sure your tutors would be sympathetic, given your circumstances. That would allow plenty of time for counselling, grieving, and eventually healing. \n\nI'm sorry if that isn't helpful and I really feel for you. Don't push yourself too hard or feel guilty about being unmotivated, because I think anyone would struggle to study in your position.", "author": "socialdeterminants", "created": 1611778047, "upvotes": 4}, "gkzqstc": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzqstc/", "text": "I understand how difficult this time is and I am so so sorry. I lost my dad last year and I just completely gave up on that semester. I don’t even know what my final grade was because I ended up withdrawing. My advice will be repetitive but it’s important. First, seek counseling. I started with a grief counselor who ended up referring me to a psychologist and from there a trauma specialist (I ended up being diagnosed with CPTSD and my father’s death triggered a lot of suppressed emotions). Also be open with your professors. I just posted on another sub about my success in opening up about my difficulties and he was able to help me with some leniency and empathy.\n\nI understand how hard it is getting through each day with such a heavy feeling in your heart, but I promise you will get through. You may never get over it, I mean how could you, but you will get stronger each day.", "author": "g-wenn", "created": 1611777898, "upvotes": 2}, "gkzqntk": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzqntk/", "text": "Sorry for your loss.", "author": "1812CE", "created": 1611777844, "upvotes": 3}, "gkzo9mn": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzo9mn/", "text": "I’m so sorry you’re having to go through this. I lost my mom during my masters program, it is so hard. That on top of the pandemic stress, it makes complete sense why you’re feeling overwhelmed. I’d say therapy would definitely be helpful. I was in therapy for about a year after my mother past away and don’t think I would’ve been able to process it in a healthy way without that outlet. Ultimately you know whether you have it in you to continue the semester or not, either way is okay. If you need to take a break that’s not giving up, you Can take a leave and come back to the program when you feel like you have the headspace for it, or if you feel you can continue but may just need supports, talk to your advisor or head of the program. I talked to the head of my program and she informed all of my professors for me and they all gave me as much time as I needed to turn assignments in, I didn’t submit one assignment on time that semester. Just know whatever decision you make is okay and doesn’t say anything about you or your work ethic, grad school is hard, and loosing a parent is harder, give yourself grace to do what you need to do to take care of yourself because at then end of the day I’m sure that’s all your dad would’ve wanted. Best of luck ❤️", "author": "glitteryslug", "created": 1611776902, "upvotes": 2}, "gkzlb3g": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzlb3g/", "text": "Counseling sounds ideal. Also, have you considered taking some time off, maybe a semester? Your Masters program will always be there for you to come back to. You can return when you're mentally and emotionally prepared. This will help you achieve the space to heal as you need, and return to the program without the guilt that accompanies unmotivated attendance in the program. \n\nI can see how this might turn financially messy considering the semester has already started and you might have paid for it already, but your mental health will ALWAYS come first. Especially knowing that your emotional state can and will impact your motivation and productivity.", "author": "Daydreaming_Candy", "created": 1611775415, "upvotes": 30}, "gkzkajp": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzkajp/", "text": "I’m so, so sorry you are going through this. My heart aches for you. One of my closest friends in grad school lost his dad suddenly as well, and he did therapy and found it valuable; he said it was more focused on developing coping skills and setting up a support network, since he wasnt ready to talk about the grief yet. He took a semester off after that and the academic counselor allowed the schedule of courses to change in his circumstance- he still did the capstone but attended a research seminar the following semester when originally it was a prerequisite to capstone. Sometimes they can override those pre-reqs; In general I do feel like advisors want to work with you to finish the program. I would def go to them or the department head and discuss your options. It took me twice as long as my cohort to finish my degree because of finances and having to work summers but overall it was worth it. I am wishing you the best 💗", "author": "ck-dearie", "created": 1611774869, "upvotes": 5}, "gkzjgfh": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzjgfh/", "text": "The size of your grief is a reflection of the size of your love for your Dad. I can't imagine what you're feeling right now, and how hard the thought of trying to return to \"normal\" must be. Normal for you may not be possible, because normal meant being able to call up or visit your Dad. I don't know how accessible school counselling is, but a book that I found incredibly helpful to read about grief is called \"it's okay that you're not okay\".  Hang in there!", "author": "Ginger_Underlord", "created": 1611774444, "upvotes": 7}, "gkziyj4": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkziyj4/", "text": "I’m so sorry for your loss. Although I haven’t had the same exact experience, my aunt died suddenly about a month ago and I’m struggling as well, so I can’t imagine what you’re going through. I’m not sure what your school offers in terms of counseling, but I know friends/family who have done grief counseling and it has really been helpful. I had no idea that my university offered 10 sessions a year included in your student fees. \nIm not sure about the flexibility of your program but I know with covid and extenuating circumstances I was allowed to extend to graduating in the summer instead of the spring, so I can focus on classes now and finish my research in the summer. I know this is kind of a luxury, but something else to maybe ask about. Again I’m so sorry, I hope you find what you need to continue through school and take care of yourself.", "author": "whitcantfindme", "created": 1611774190, "upvotes": 5}, "gkzis8f": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzis8f/", "text": "I lost a classmate last year about this time. I ended up getting a month behind in all my classes due to grief. I ended up dropping one. A lot of my other classmates got behind as well.\n\nI scheduled a meeting with one of my professors to discuss how to get caught up in the other class.   She told me about the time her father passed and how she took a leave of absence for the entire semester when she was a grad student. She also told me not feel guilty.  \n\n\nGrief takes time and you can't really rush to get over it. I would recommend getting in touch with a grief counselor right away. You can make a plan and adjust it as needed. With grief you can sometimes have bad days even years after the death. Never feel guilty for them. I wish you the best in this difficult time.", "author": "FlopperPants", "created": 1611774095, "upvotes": 10}, "gkzibqe": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzibqe/", "text": "I can't begin to imagine what you're going through, but you have one more internet stranger rooting for you. The other suggestions about counselling sound like they might be useful.", "author": "Its_4_AM_Man", "created": 1611773908, "upvotes": 5}, "gkzgslp": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzgslp/", "text": "I was in the same position in high school, went to get grief counseling and I think that helped me a lot. If I was in your situation I most likely would just take a leave of absence for a semester due to what happened and go back when I felt more mentally able to do so. My program has processes in place that allow for taking time away from the program due to personal situations, perhaps yours does too?", "author": "StiffWaffle", "created": 1611773333, "upvotes": 5}, "gkzf0r2": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzf0r2/", "text": "I can relate to this so much. More than a decade ago I was accepted into two graduate programs and was in the process of picking one and enrolling. My parents were part of the conversation and I had about a month to decide. My mom got very sick very quickly and unexpectedly passed before I even made a decision.\n\nA month later I moved away from home to begin a graduate program that was very challenging. I had a chemistry major and all my professor expected me to be more of a physicist. I barely slept back then and it was also my first time being away from home and on my own.\n\nTo say that it was hard is a big understatement. I survived but it definitely took everything I had. My mental health suffered and I made many mistakes and acted in ways I wouldn't have otherwise. But I've learned that grief changes you in many ways no matter where you are and so in hindsight I'm glad I didn't take any breaks.\n\nI was sort of on academic probation at the beginning so that gave me something to work on. Also, I was lucky to be part of a small cohort of students and we were very close.  I can see how in current times you may not have the same luck. I think seeking counseling is a good idea. And try to establish and maintain some friendship or even just academic relationship with your peers, it pays off to have to show up for others.\n\nI'm truly sorry you're going through this.", "author": "pumpkinpecas", "created": 1611772666, "upvotes": 14}, "gkzc3p1": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzc3p1/", "text": "Hi my friend, thank you for sharing this with us. I'm so sorry for your loss; your relationship with your dad sounds really beautiful. \n\nIf you're already considering grief counseling, I'd say go ahead and make an appointment. Death and grief are huge and overwhelming and you need support. **Do not** tell yourself that you have to handle this experience alone!!\n\nAs for your master's, whew, that is so hard. I wonder if a leave of absence truly *is* an option–maybe that's something you can re-consider with a grief counselor. It's normal to have your life uprooted by grief. You may decide you don't want to take a break from school, and your motivation comes back. Or you may decide that waiting one more year is not that big of a deal in the grand scheme of your life, and you want to take this time to remember your dad, take care of yourself, and be with your family.", "author": "Particular333", "created": 1611771661, "upvotes": 57}, "gkzbrz2": {"link": "/r/GradSchool/comments/l6aeo4/i_just_lost_my_dad_while_doing_my_masters_and_now/gkzbrz2/", "text": "If you’ve thought of going to counseling, then go. \n\nMy group friends and I have all gone through death of parents or near death experiences (like cancer), and no one can tell you how to cope. \n\nTalk to your mom or siblings/other close relatives and see what they would think. Sitting alone thinking that your dad would be disappointed if you took an extra semester could entirely be in your head from over thinking/exhaustion from the situation. \n\nYou took care of your mom and now you need to take care of you. Do what you need to do, but try to not create long term problems (i.e. failing all your classes because you’re not ready, or becoming and alcoholic instead of processing, etc)", "author": "FutureDrDr", "created": 1611771547, "upvotes": 129}}}