{"sid": "pws3qw", "link": "/r/GradSchool/comments/pws3qw/supervisor_worried_about_my_progress/", "title:": "Supervisor worried about my progress", "text": "I’m in my fourth year of grad school (PhD student) and my supervisor keeps putting pressure on me and has told me that he is worried about my progress and whether I have enough to graduate. He was passive about it for a while but recently I was going through a few personal things, one of them he knew about and things did slow down with my experiments and data collection a lot. Initially he seemed supportive with me dealing with a lot in my life. Now though, he brought it up again and questioned me whether  I think I am being productive enough. The weird part too is that I have never mentioned anything about my graduation or pressuring him about graduating quickly.\n\nIt’s getting really annoying because even though we meet regularly he won’t actually hear me out properly and help me with things that I have struggled with in my project. He also is sitting on this manuscript which consists of mainly my work that just needs to be submitted but keeps putting it off for months. I know I haven’t been as productive lately but I am exhausted and don’t know how to handle this. I decided that I am going to start putting together my data so that we can both see how much I have done and what I should actually prioritize. I tried to do this a few months ago but he just gave me a random list of experiments in response for me to complete over the following months. I’m hoping this time to actually finalize my plan to graduate and have a proper discussion over experiments needed to complete. Any other recommendations here?", "author": "triplem6", "created": 1632781257, "retrieved": 1632843932, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"heiyxeg": {"link": "/r/GradSchool/comments/pws3qw/supervisor_worried_about_my_progress/heiyxeg/", "text": "\n\nBy fourth year you should have a good idea of what is left for you to finish up and a good timeline. Obviously life sometimes gets in the way, but right now it is critical to do the following:\n\n1. As you suggested, gather all of your past and current data as well as your past and current manuscripts.\n\n2. Come up with a well thought out plan including what experiments you will complete and papers you will write, and then create a reasonable timeline to finish everything, including writing your dissertation. Do not commit to anything that you don't think is reasonable or doable.\n\n3. Schedule a meeting with your advisor and go over everything. Ask them for any input they want. And make it clear that your intention is to follow the timeline and not add significant work not included on it once you two agree on a timeline. If your advisor gives you too much pushback here you need your other committee members onboard\n\n4. Once you have it in place it's time to buckle down and execute. If you do not follow through there is a distinct possibility that your prior hard work and time will go down the tubes. \n\n\n\nA bit about my own experience (PhD in molecular biology and biochemistry). I spent 3 years designing a novel complex assay. The week that I finally got my first results validating the assay my PI (before I even mentioned the results to him) said basically out of the blue that I should think about starting to wrap up. Now his style was to push people in and out and it was very effective, but I thought it would have been atleast another 6-9 months before we started having this discussion.\n\nFortunately with my validated assay I then completed my actual set of experiments for my PhD work, wrote my dissertation, and defend (successfully) 5 months later. I worked 7 days a week about 16-17 hours a day, with two or three all nighters at the end. I would not recommend that to anyone but it's what I felt I had to do to get it done. I had a calander that I basically accounted for all my time and I stuck too it. Again I just want to emphasize, this is what worked for me, it does not work for everyone. The important thing is to be realistic with your own abilities and your own timeline.\n\nI'll also note, in retrospect I believe I could have pushed back a bit on the timing. I realized after completing my PhD that other students in my lab also were given fast timelines but they pushed back a bit and extended it by a few months. I probably could have done the same.\n\nBest of luck, you can do it.", "author": "frazzledazzle667", "created": 1632783109, "upvotes": 4}, "heiw1ar": {"link": "/r/GradSchool/comments/pws3qw/supervisor_worried_about_my_progress/heiw1ar/", "text": "Depending on the field and program you may be very behind. I would recommend looking at the progress of your closest peers to see if you are progressing at the same speed. In a business school you would be expected to already have at least two working papers written (not necessarily ready to submit to a top journal) at this point in your program. \n\nMy best advice is get into a routine. If you can manage to figure one out that works for you it should help with your productivity. Also, when you are resting during dedicated resting time stop working entirely (or thinking about work) so that you could prevent burning out.", "author": "imjustbrowsing123", "created": 1632781730, "upvotes": 4}}}