{
  "sid": "qmc7oc",
  "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/",
  "title:": "Is it feasible to try to get into grad school in the same place as your partner?",
  "text": "Okay, to start off this post, I'll admit that I'm very far off from the point in my life where I'll actually be in this situation. Still, I worry about the future a lot so I'm making this post anyway.\n\n\nI currently have a partner who's been with me for a while now, and who I really think is going to be with me for the long haul. They are one year behind me (they are a year younger) in school, and want to pursue an academic career as well. Having that in mind, how difficult is it to find PhD / Master's programs in the same place for two people? Especially in a different institution from where we are both doing our undergrad, since due to the state of science and education in my country, even though we are in a very prestigious and reputable university, it would still be better to study internationally in the US/Europe.",
  "author": "dawii15",
  "created": 1635998029,
  "updated": 1637417860,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 0.83,
  "comments": {
    "hj8tt48": {
      "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hj8tt48/",
      "text": "In honesty it would be very challenging. Your best bet would be to find big cities with multiple universities and hope that you can both get into nearby programs even if it’s not the same institution. \n\nThere are just so many intricate details that factor into grad admissions, especially on the PhD level: does the program have a faculty member who matches your research interests, is that person taking grad students/will they have funding guaranteed for one or more students, can you be competitive for that spot, are you a good personality fit, is the program a good personality fit for you… and then to find cases where all of these stars align for two people, yikes.\n\nIt would be more plausible if one of you were doing a masters and the other a PhD or masters, because masters programs are generally much easier to get into and much more available.",
      "author": "Jwalla83",
      "created": 1636000130,
      "upvotes": 46,
      "replies": {
        "hjansk8": {
          "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hjansk8/",
          "text": "my concern about master's would be tuition/funding. as far as I understand, getting into a scholarship/fully funded program is much more common for PhDs.",
          "author": "dawii15",
          "created": 1636041337,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hj976zm": {
      "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hj976zm/",
      "text": "As others have said, this can be quite difficult so it's important to carefully select which schools to apply to. My partner and I went through the same thing a few years ago, and we did end up at the same university. We applied to about 10-15 programs in total in only 3 different geographical regions, so it increased our chances of being able to live together even if we didn't end up in the same school.",
      "author": "531n7z0r",
      "created": 1636010225,
      "upvotes": 11,
      "replies": {}
    },
    "hj9y9w3": {
      "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hj9y9w3/",
      "text": "It is difficult, but possible! My partner and I did this five years ago. We applied to ten schools each. Sometimes those schools overlapped, but more often than not they were different schools in the same city. We ended up having three overlapping acceptances, and ultimately ended up in Pennsylvania based on our interests and the fit of the programs. It is possible, just do a lot of research and find things that work for you both. Keep in mind, you may have to compromise a bit on your preferences if you care about staying with your partner. We are now at the postdoc label, and I promise it’s much easier to find overlapping jobs at this stage, you can do it!",
      "author": "bulletproofshadow",
      "created": 1636030501,
      "upvotes": 6,
      "replies": {}
    },
    "hj94g0a": {
      "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hj94g0a/",
      "text": "It is difficult, especially if you are trying to study in two different specialties. I had a labmate who is from Ecuador who brought his spouse with the hope that she would get into the psych department to do her graduate studies. She didn't get in after 3 years of trying. So she put her education on hold for him to get his, and now they are at a different university where she is getting her education while he works in a job that he is overqualified for. This \"trade-off\" of years for couples to both achieve their goals is very common, although, separation is even more common.",
      "author": "JenAnnMad",
      "created": 1636007856,
      "upvotes": 10,
      "replies": {
        "hjajp1b": {
          "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hjajp1b/",
          "text": "This is something some folks in my lab have done as well. As long as you’re not hellbent on being in the same household and are ok with a 2-3 hour distance gap between you, it works out well. There’s less of a compromise on halting your career if you’re ok with looking into a cluster of cities nearby each other. \n\nI did my PhD 2 hours away from where my partner had his job, wasn’t a huge deal for us to drive to see each weekend to visit. Some people in my lab did similar stuff. I did part of my PhD in Europe, and met a few folks who lived a 2-3 hour train ride from their SO (TGV in France is a game changer!!). I didn’t find the long distance relationship terrible because the week days are chock full of research and I used my weeknights to do chores and errands. I’d front load my weeks so that I could leave early on Fridays if I was driving to him. That freed up my schedule from Friday afternoon to Sunday night to spend with friends and my SO.",
          "author": "happytransformer",
          "created": 1636039750,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjanxjy": {
      "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hjanxjy/",
      "text": "It might be pretty hard considering you are going to be trying to get a visa to do this. I would apply to multiple places together, that would really increase your chances. But depending on where you are from, getting a single visa might be super hard, getting two to the same country might be nigh impossible.",
      "author": "hiagha",
      "created": 1636041390,
      "upvotes": 0,
      "replies": {}
    },
    "hjugzaq": {
      "link": "/r/GradSchool/comments/qmc7oc/is_it_feasible_to_try_to_get_into_grad_school_in/hjugzaq/",
      "text": "I would defer your application for a year so you apply at the same time. Being able to 'follow' someone is a lot more difficult than developing a joint plan because they need to get in (and be happy going) wherever you choose to go. That's very different than applying to a set of places together and making a decision about where to go after you both get accepted.",
      "author": "-jautis-",
      "created": 1636402674,
      "upvotes": 2,
      "replies": {}
    }
  }
}