{"sid": "m0tn7v", "link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/", "title:": "To new graduate students: never settle", "text": "For 7 months I rotated in 5 different labs trying to find a mentor. I had PIs tell me that they don’t know how I got into my program, and that the grants I want to apply for are a pipe dream for someone “like me”. I had one PI call me a slacker and many others insult my intelligence and ability. I watched all of my friends commit to labs happily for months before me. I experienced students tell others that I was the problem. Even my own program heads were questioning what was taking me so long. Almost everyone told me what I wanted out of a PI was not possible, that I was being too picky, that I needed to “just choose already”.\n\nToday, after 17 zoom interviews, 5 rotations, and 7 months of searching while balancing some of the worst self-doubt and pressure to join a lab from my department: I found a PI who truly believes in me, supports me, and inspires me everyday. And I could not be more proud to officially join their laboratory. \n\nTL;DR Never settle\n\nEdit 1: Thanks for the support/ awards/ kind remarks. I acknowledge the privileged situation I was in to be able to take so many rotations and speak to so many PIs. I wrote this in hopes to let people know that regardless of your situation in life you don’t have to settle for less than you deserve. I settled in a horribly abusive relationship for many years of my life, and recently I have been able to prioritize not doing so in personal and professional aspects. I want those reading this to know it *does* get better. There is a light at the end of the tunnel: and it’s yours.", "author": "the_girly_scientist", "created": 1615247500, "retrieved": 1632845219, "over_18": false, "upvotes": 737, "upvote_ratio": 0.95, "comments": {"gqpysw0": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqpysw0/", "text": "Wow. I am going to share this story with some of the other students in my cohort. I am in my first year and we just finished our standard three lab rotations and there are still some who are in this grey territory of a fourth rotation and beyond.\n\n&#x200B;\n\nLike you said, although maybe not as explicitly as your situation, but some of these PIs do see fourth rotation students as a red flag. It sucks. Maybe this can uplift some spirits on this side. Thank you!", "author": "ocfl8888", "created": 1615576070, "upvotes": 2}, "gqctdpc": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqctdpc/", "text": "This is really very field specific though. You're honestly privileged to be in a major where you can get into a program before getting a PI. We have to have a PI lined up already for admissions to even look at your application and you're often committing to their lab without having a chance to even meet them in person, unless you've been fortunate enough to have had an undergrad internship with them. Then it's very hard to switch labs after getting in because other labs have already lined up all the grad students they want and you've usually signed onto your PI's grant when you accepted which makes it awkward to leave", "author": "bi_smuth", "created": 1615313575, "upvotes": 6}, "gqcsksl": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqcsksl/", "text": "Your PI is roughly 95% of your PhD experience. So finding the right PI for you is massively important. Investing even 7 months to find the right fit is so worth it. I'm glad it worked out for you OP :)", "author": "madbadanddangerous", "created": 1615313215, "upvotes": 2}, "gqcd0am": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqcd0am/", "text": "Kudos to you for standing up for yourself and knowing your worth. This got to be the best attitude ever to get through in life, be it professionnal or personnal related. You got this !", "author": "jtmooon", "created": 1615306899, "upvotes": 2}, "gqcaw73": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqcaw73/", "text": "I had a really similar experience in 2019. I ended up being rejected by nine or so professors in my department and ultimately re-applied to graduate school that Fall. I was so mad that I was even accepted in the first place when I couldn't actually find work! Sometimes it was money, but sometimes it was accusations or assumptions of not being good enough, passionate enough, hard-working enough. The list goes on and on. I eventually found a PI in a different department who really believed in me and was comfortable investing in me as a scientist (but I still eyed other universities just in case before deciding on this group). It was such a trying experience, but frankly now I feel invincible. Like, what can be worse than be nearly kicked out of your own department in your first semester 😂", "author": "cucurbitacin", "created": 1615306117, "upvotes": 5}, "gqc6m2d": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqc6m2d/", "text": "I’m so happy for you. I’m thinking about switching grad programs because I feel so unhappy with my current one, just unwelcome and like I don’t belong. I hope I find a place where I fit!", "author": "HighlyPolitical16", "created": 1615304456, "upvotes": 2}, "gqauf2c": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqauf2c/", "text": "Thank you for this. Lifts up my spirit 🙌", "author": "SnooBeans3895", "created": 1615270116, "upvotes": 3}, "gqam0rm": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqam0rm/", "text": "As someone that settled on a PI after 3 rotations and had to leave that lab after 4 years to start over, I commend you. \nI’m still unsure if I’m not a good judge of labs, or things take time to reveal themselves. I’m just curious as to how you are sure you found the right one?", "author": "snoop_pugg", "created": 1615264249, "upvotes": 10}, "gqaf715": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqaf715/", "text": "Congrats on finding a PI that supports you fully.  I'm curious if it took that entire search process to find this PI, or now that you've gone through it there were signs that pointed to this PI being good but never surfaced at first glance?", "author": "charlieplexed", "created": 1615260225, "upvotes": 5}, "gqa93as": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa93as/", "text": "Awesome on you for finding a program and person that works with you.\n\nThat said, I disagree that this should be general advice. I fully believe and support OP in what they say, but in general if there is no one that is a good fit for you or no one that you get along with, you need to start looking inward.", "author": "FunnierBaker", "created": 1615256851, "upvotes": 21}, "gqa43mw": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa43mw/", "text": "[deleted]", "author": null, "created": 1615254111, "upvotes": 5}, "gqa2ohn": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa2ohn/", "text": "Were you only surrounded by such negative put-downy people? What kind of program is this so I can remember to avoid it? I know that hoping everyone in academia would lift each other up is wishful thinking but this seems overly hostile", "author": "Dustin_Bromain", "created": 1615253328, "upvotes": 35}, "gqa0wu2": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gqa0wu2/", "text": "That’s not possible for most students. So many programs don’t have rotations, and if you need more than 3 then you’re kicked out. Good on you that it worked, but this isn’t good advice. I would counter with, pick a PI, and if it doesn’t work after a year for “reasons” then switch to a similar lab/ collaborator. You got this win, but it is not possible for the vast majority of PhD students.", "author": "krazyk1661", "created": 1615252369, "upvotes": 88}, "gq9zrwu": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gq9zrwu/", "text": "This sort of groundwork to pick the best mentor possible will pay dividends in the future. Other students will just say \"pick already\" but you'll find some of those students picked suboptimal mentors and when the going gets rough, there'll be a lot of eating of crow. I literally tracked down my future PI's previous lab mates in-person and got character references lol.", "author": "Stereoisomer", "created": 1615251745, "upvotes": 145}, "gq9ug5t": {"link": "/r/GradSchool/comments/m0tn7v/to_new_graduate_students_never_settle/gq9ug5t/", "text": "Win. Nuff said.", "author": "theP0M3GRANAT3", "created": 1615248840, "upvotes": 100}}}