{
  "sid": "qno67o",
  "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/",
  "title:": "Looking for advice on how to move toward a grad program unrelated to my bachelor's degree.",
  "text": "I have a bachelor's degree in anthropology, however I am setting my sights on a path towards a career in entomology. I'm really having a hard time figuring out what the best move is to get myself into the academic sphere of entomology. The two ideas that make the most sense to me are: (1) get a 2nd bachelor's degree in entomology at one of the dozen or so schools in the country that offer such a degree or (2) get a degree in biology or zoology at a university or community college and apply for a masters program in entomology. (There is a program at my local community college for an associates in biology, but not sure if that is enough to successfully apply for a masters program).\n\nIf anyone has any advice or experience regarding how to navigate this path between unrelated disciplines I would really appreciate you sharing.",
  "author": "A_hershey",
  "created": 1636157055,
  "updated": 1636656905,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hjhle2u": {
      "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/hjhle2u/",
      "text": "I mean. First look at the requirements for the program. Some may not care, if that is the case. Then you are set, self study and apply!  If they require specific classes, ask if you can return to college as a post bachelor student to complete the required classes without needing to sit through another degree. I had a friend who returned as a post bachelor student to do like 3 classes for a requirement from one of the med school programs he was interested. With everything though, results may vary lol. Good luck OP!",
      "author": "Maskedxangel",
      "created": 1636157740,
      "upvotes": 9,
      "replies": {
        "hjhogcx": {
          "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/hjhogcx/",
          "text": "Interesting, I didn't know that was an option! I will definitely ask some entomology departments about that. One of the things I am most worried about, and what pushes me towards getting a second bachelor's, is not having any connections with former professors from my first bachelor's degree. So with regard to having letters of rec, I'm pretty screwed in the academic arena. Being able to go back for another undergrad degree would give me more time to form relationships with professors and have better connections for a grad program. Or maybe I'm overthinking the importance of that aspect of applying for a grad program.",
          "author": "A_hershey",
          "created": 1636159101,
          "upvotes": 2,
          "replies": {
            "hjkm6al": {
              "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/hjkm6al/",
              "text": "A whole bachelors program is a lot of time... and money.\n\nThere are post-baccalaureate and certificate programs that can be completed in 1—2 years. They supplement a Bach degree and can be used to switch fields. Most of these programs are tailored for working adults.\n\nI did a neuroscience certificate before getting into a MS program at the same university. It was basically 6 of the core neuro classes (incl. capstone) for the BA, but on an accelerated timeline.\n\nDefinitely look at the requirements: my masters program at a Veterinary School required only 1 biology class at the undergrad level.",
              "author": "riceboi69467",
              "created": 1636219098,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjhlpjn": {
      "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/hjhlpjn/",
      "text": "What the other poster said. You can often enroll in a university as a non-degree seeking student once you have a bachelor's to take undergraduate courses.",
      "author": "raistlin65",
      "created": 1636157880,
      "upvotes": 3,
      "replies": {}
    },
    "hjhotkx": {
      "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/hjhotkx/",
      "text": "I'm in a completely different field, so take what I say with some salt.\n\nAgreeing with the others here. Many people overestimate the need for another full degree when switching fields. Normally you just need to get the prerequisites (and lab experience if you can swing it financially, as you'll often start as a volunteer).\n\nIn your case, I bet there are a small number of biology classes you'll want to take that could be done at a local university even. The prestige of the university for your post-bacc credits normally doesn't matter either -- adcoms use the prestige of your degree-seeking institution as a signal, but largely consider core classes to look similar across the board. As for lab experience, which may not be necessary but helpful for sure, you typically don't even need an entomology lab, just a zoology or biology lab in general.\n\nBest of luck!",
      "author": "a-perpetual-novice",
      "created": 1636159270,
      "upvotes": 2,
      "replies": {
        "hjhp7ti": {
          "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/hjhp7ti/",
          "text": "That said, do look into the career prospects for lab sciences, especially if looking to do a master's degree and not a PhD. It can be really hard out there for lab scientists despite the general saying that STEM degrees lead to job security. Zoology, biology, and chemistry have many fewer natural career pathways so you'll want to keep that in mind.",
          "author": "a-perpetual-novice",
          "created": 1636159450,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hji7wzw": {
      "link": "/r/GradSchool/comments/qno67o/looking_for_advice_on_how_to_move_toward_a_grad/hji7wzw/",
      "text": "Just get another B.S. if you can stomach the loans. I did this and it took me 2.5 years to complete it because all the non-degree reqs were out of the way, and some of the classes I took as electives for my first BS (design) were degree-related for the second (biology). I was living in a city with a state university already so I just went there. It's probably ideal that you do entomology, but I think biology would be fine if you focus your classes on organismal/ecological/bug stuff. As someone else said, you probably don't need a full BS, but doing it won't take that long and more than a year in a research lab will give you a much better idea of if you actual want to do it as a career. Taking classes alone is not enough to determine that.",
      "author": "greenzymes",
      "created": 1636168306,
      "upvotes": 1,
      "replies": {}
    }
  }
}