{
  "sid": "ms1ui9",
  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/",
  "title:": "Professor sees my passivity as negligence and believes I should be panicking. Except I am, but it’s internal.",
  "text": "We seem to have a lot of these strange communication behaviour misunderstandings. \n\n\nThis is my thesis year, and although I’ve been struggling a lot, he sees my general demeanor as someone who doesn’t care, is lazy, and is wasting his time. \n\n\nIm tired of him waving all sorts of threats over my head. “You might not finish”; “why aren’t you struggling”; “you say you understand but you don’t”.\n\n\nI can’t help but feel that the best thing to do or happen would be for me to simply collapse on his lap, so that he can believe that I am indeed feeling the pressure. I’m in therapy once a week, deep mental issues going in my family, about to start acupuncture to work with my stress-related chronic pains, trying to get a part-time job to I can get some form of security. \n\n\nDeep inside, I know that he is also a human being, and knows my life doesn’t revolve around my research. I know he wants me to do more, but each time I do more, he tells me it’s meaningless because it’s not done in the right way. I’m stuck between not moving and making a move risking it being totally wrong and getting scolded for it.\n\n\nReddit, I looked him dead in the eye and considered telling him that I’d save him the time and simply drop out. I’m exhausted. \n\n\nThank you for reading.",
  "author": "duascoisas",
  "created": 1618575159,
  "over_18": false,
  "upvotes": 344,
  "upvote_ratio": 0.98,
  "comments": {
    "gv6mb5j": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gv6mb5j/",
      "text": "You all, thank you for the awards! I was just venting, but this community has been so kind to me! \n\n\nI’ve since communicated more with my professor, have been having a lot more meetings, and are taking things reeeeeally slowly. I’m also trying to sleep early, do yoga, breathing exercises etc so I can better regulate my emotions and be able to communicate under pressure. \n\n\nI’m really grateful for this community. Grad school is hard as fuck you all.",
      "author": "duascoisas",
      "created": 1618910935,
      "upvotes": 1,
      "replies": {}
    },
    "guwhhs4": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guwhhs4/",
      "text": "Talk to your PI. This whole thing is misunderstanding in both directions. Email them and say you want to schedule a meeting to talk about your work experience. In person or over a video chat. \n\nTell them you know they’ve been worrying about you. Cite specific incidents. Tell them how you’re feeling. I told my boss I go to weekly therapy sessions and it helps me focus because I unload those burdens.\n\nIf you’re feeling overwhelmed but just internalizing it, tell him that (and also work on getting it out productively). \n\nIn the best light, they want to see you succeed and you’ve admitted you have a lot going on emotionally that is complicating the situation. \n\nPart of it is process, part of it is results. If your PI disapproves of how you seem to be working, then I don’t really see that as a big deal. And tell them that. If you’re comfortable with how you’re working and making progress, tell them that. On the other hand if you agree that you’d like to make more progress but you’re struggling, tell them that! They could help you set attainable goals. \n\nIn the end, it’s about the results. If you’re making progress on your work, then your PI needs to see your process is working well enough. On the other hand, if you are struggling to meet reasonable expectations because of extenuating circumstances, I think your PI might be able to help. Or at least hear where you’re coming from.",
      "author": "frausting",
      "created": 1618694143,
      "upvotes": 1,
      "replies": {}
    },
    "guw9lq8": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guw9lq8/",
      "text": "I've never met a person who is lazy, I have met many people who are struggling with some internal difficulties, making it appear they are lazy. Do you have anyone to share with?",
      "author": "PeaceAndPrajna",
      "created": 1618690767,
      "upvotes": 1,
      "replies": {}
    },
    "gut9y0s": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gut9y0s/",
      "text": "Oof, you need to talk with your prof and set boundaries right now.",
      "author": "exmachinalibertas",
      "created": 1618639299,
      "upvotes": 1,
      "replies": {}
    },
    "guspmmm": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guspmmm/",
      "text": "Dear OP, my sympathies for the place you're in. It's awful having to share your struggles with anyone because sometimes it doesn't translate to words, but a professor such as this can worsen how you're already feeling. I've been there and I'm so enraged at the insensitivity you're having to contend with. Should you choose to share your struggles, please do so via an email so there is a record of you reaching out for help, because often times these profs get away with \"Oh, you could have just asked for help!\" after they  make themselves unavailable. All the best. I hope you get through this.",
      "author": "jroy_95",
      "created": 1618625927,
      "upvotes": 1,
      "replies": {}
    },
    "gusj61e": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusj61e/",
      "text": "I’m feeling the same way. I’m finishing my master degree in a few months and I’m feeling rather passive towards finishing it. I felt lots of pressure throughout the years and had a couple of anxiety attacks cause I thought I wouldn’t be able to produce good enough work. Now I’m just taking it easy and not letting stress take the best of me. I’m lucky to have an understanding supervisor though. Find someone in the faculty you can talk to, maybe someone within the department who can give you good advice on how to handle this situation. Hope things work out for you.",
      "author": "ninhny",
      "created": 1618622368,
      "upvotes": 3,
      "replies": {
        "gutn0l7": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gutn0l7/",
          "text": "Thank you so much for this. Of the three members in my committee, one left and hasn’t been replaced. There’s one more that I can talk to, although they’ve been pretty passive. \n\n\nBut I will definitely simply reach out, ask for help, guidance, and harness all the brains in my dpt to get me through this!",
          "author": "duascoisas",
          "created": 1618650526,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gusds9f": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusds9f/",
      "text": "Are you sure that's really how he sees you or is that your interpretation? It honestly sounds like he's trying to motivate you and to see that you're taking it seriously and doing the things you need to do to succeed. He doesn't want you to drop out he wants you to succeed and finish (as far as I can tell from reading this of course). If you are doing things the \"wrong way\" the solution isn't to be stagnant and afraid to fail, it's to take action and ask about how to do things better. You can do this! You've gotten this far, right?",
      "author": "Ceej640",
      "created": 1618619409,
      "upvotes": 0,
      "replies": {
        "gusilz8": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusilz8/",
          "text": "Am I sure? No, I can’t be sure, I’m not inside his head. I can only assume and speculate and take in what he tells me. It’s not fun to experience someone getting frustrated at you, and actually saying it verbally. I don’t think he legitimately wants me to have a crisis, but how he puts it out is that if I “cared” (put more effort in the way he wants to see) then I would be “panicking”. Maybe by panic he means I could be more proactive, which I have tried in different ways and will not take a different approach we’ve discussed. \n\n\nBut my little rant was more about these criteria and expectations that exist. It’s not exactly that I’m stagnant, it’s that I’m not moving in the way he expects me to. I respond to his emails quickly which for me is a great sign of respect and proactiveness, but he thinks it’s “horrifying” because if I’m writing back so quick then I must not be thinking deeply about it. It’s a question of how we perceive each other. \n\n\nI’ll take more time to answer emails then, fine. If that’s what he needs to see in order to feel that I am indeed thinking through this exercise.",
          "author": "duascoisas",
          "created": 1618622063,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gurr57b": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gurr57b/",
      "text": "The reality is — some people believe everyone has to work hard as they “thought” they did. But OP, things may come more naturally to you than they did to him — and it can a case of “downwards jealousy.” Even if you were lazy — is the work you’re doing incorrect or lacking in some theoretical/applied soundness? Is it just boring, or is it *just enough but not more*? \n\nOr it could also be that they feel like to be worthy of a PhD, maybe more so a “competitive” one representing as his mentee/pupil, he is expecting more?",
      "author": "StreetBug8523",
      "created": 1618607745,
      "upvotes": 5,
      "replies": {
        "gusjq85": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusjq85/",
          "text": "At this point I don’t really know. At times it feels like he really gets and believes in my topic, but I don’t fully. It’s frustrating for both of us because with all the energy that he spends on it and giving me feedback, I feel like he might want to take it forward, towards a PhD who knows.\n\n\nBut. It’s not really my ambition. I want to master out. I’m here as a transition, hoping to get an interesting job, live abroad in another place, and invest more time in my other talents. I think he sees that too. \n\n\nI know research is important. I know it’s important for him. It’s important for me too but not at the cost of my life and aspirations. I’m just not that “passionate”, but I still what to do an acceptable job. Maybe that’s it. Unfortunately I’m not really trying to change the world with this thesis. I just want to complete it.",
          "author": "duascoisas",
          "created": 1618622671,
          "upvotes": 3,
          "replies": {
            "gutl502": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gutl502/",
              "text": "So, I’m not a PhD... I almost went that route, but I have 1 master’s degree and graduate certificates/coursework that add up to a full other master’s degree. I knew after the first semester in grad school I did *not* want to do research. While I can respect research, I also believe that a lot of academics don’t encourage students to attempt non-research or non-instructing roles, which can be a disservice depending on the field. \n\nMy masters is in the engineering discipline. My husband and I both talk about how many engineers graduate with masters and PhD’s and do not know how to apply their “research” in their daily lives for work. While backed by genuine data, when it comes time to actually plan out solutions... there’s always someone that evolved through the ranks, even many folks that have only went to trade school, that corrects their applied method. \n\nI remember taking a cross-discipline (/interdisciplinary) course in undergrad that was also a requirement for folks on a specific pre-law track. The professor was a successful lawyer, 25+ year career, and did an excellent job connecting theory, research, and how it can be applied in his day-to-day. I think we all did graduate level work for that course, as the professor wanted us to truly think at that level. I checked his salary online. Holy shet. He made more than 3x what his peers in that program made. You CAN have both, just know this, and there is a need for folks that know both. Good luck to you.",
              "author": "StreetBug8523",
              "created": 1618649096,
              "upvotes": 1,
              "replies": {
                "gutmhuj": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gutmhuj/",
                  "text": "Exactly. Don’t get me wrong, I’m an “academic” at heart. A true nerd. I love me all these books. My vision of a Masters degree was, what I now know, a “taught” degree. The one where you take a bunch of classes, have a lot of diverse projects and assignments, an internship, and an oral defense. This was going to be it for me, it’s still what I want. I’d still jump at the opportunity to keep studying, pursue another masters, if it truly gets to be interdisciplinary, practical, critical, and applicable. \n\n\nHowever I found myself in a University that is super pushy about writing and publishing. So much so that my classes are a joke. The content is not at all engaging, very detached from the real world, as professors are researchers with very little pedagogical training. I’m here to watch my professor and copy him in hopes of producing something decent. \n\n\nI am being a bit brute about it but it’s just how it is. Seeing the bigger picture, I’m okay with it. I’m a better speaker and an enthusiastic learner, but I’m okay with the opportunity to learn more about research. I just don’t want to lose myself because of it, even if it’s required of me.",
                  "author": "duascoisas",
                  "created": 1618650136,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gurd7d5": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gurd7d5/",
      "text": "Everyone panics. Your professor does too. Everyone does, even your professors. Everyone in life does. Take it one small step at a time and go from there. You got this.",
      "author": "Boydey",
      "created": 1618601423,
      "upvotes": 1,
      "replies": {}
    },
    "gur2wwp": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gur2wwp/",
      "text": "I panic giggle to similar effect. A bit like the kid on the simpsons. Had similar issues with teammates and supervisors-- eventually I became self aware enough to figure out what was going on and I started leting people know what was going on in my head when that happens. It helped...",
      "author": "wickzer",
      "created": 1618596777,
      "upvotes": 2,
      "replies": {}
    },
    "gur1dde": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gur1dde/",
      "text": "Sounds like an asshole to be honest",
      "author": "Extreme_Pomegranate",
      "created": 1618596098,
      "upvotes": 4,
      "replies": {}
    },
    "gur0vwa": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gur0vwa/",
      "text": "I went through the same feelings. I remember staring at my email app paralyzed because of fear and anxiety. I would bargain with myself to reach out at x time, then pussy out. The only advice I can give you is that the fear is worse than the act. Once I came to terms with that I was ok. Good luck man",
      "author": "Rascal_Ralts",
      "created": 1618595885,
      "upvotes": 1,
      "replies": {}
    },
    "guqzstc": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqzstc/",
      "text": "I can relate to this....I get the impression my supervisor thinks I'm being lazy and uninterested and as if I'm way over my head with completing on time....but the truth is I panicking on the inside but I have so many health problems that are stacking up lately and my supervisor is only making things worse and I just can't focus anymore. I don't understand this logic because its a lose lose....its similar to people in pain because if your whining too much your begging for sympathy or annoying and if you don't say anything people assume your faking it to get an easier treatment.",
      "author": "PSFREAK33",
      "created": 1618595412,
      "upvotes": 2,
      "replies": {}
    },
    "guqx8yg": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqx8yg/",
      "text": "> I’m stuck between not moving and making a move risking it being totally wrong and getting scolded for it.\n\nThis really shouldn't be much of a dilemma. Doing something wrong and getting scolded for it is nothing to be afraid of. In fact, it's a learning opportunity, which is the whole reason you're in grad school.\n\nDoing nothing, on the other hand, can only accomplish nothing.",
      "author": "yerfukkinbaws",
      "created": 1618594292,
      "upvotes": 2,
      "replies": {}
    },
    "guqtqrd": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqtqrd/",
      "text": "This sounds *remarkably* like my experience writing my masters' thesis, to the point where I'm having a hard time writing a civil comment and not just angry, incoherent rambling, lol. So, you're not alone! A few thoughts:\n\n1) his method of communicating, from what you're quoting here, is unhelpful *at best* and probably highly toxic (threatening you and criticizing what you do right after he tells you do more is not acceptable behaviour). So, I will say, as someone who's been in your position: It's not your fault. \n\n2) I don't think you collapsing in a heap of panic in front of him will help anything, and frankly (from my own experience) I'd be worried about him using that sort of vulnerability against you. What you could do is have a meeting with him, or ideally with him and your committee and/or the department grad chair, to nail down a timeline and specific goals and expectations that you both then stick to. Your other option is simply to keep your head down and push through, do what he tells you as best as you can, do what you think is best for the thesis, and try to get through.\n\nI'm not going to tell you not to drop out if things become too much, but please don't drop out just because of this guy. You're so close, you've made it this far which means you're plenty capable, and you deserve to get your degree despite someone's shitty communication style.",
      "author": "Mad_Cyclist",
      "created": 1618592770,
      "upvotes": 3,
      "replies": {}
    },
    "guqpu2v": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqpu2v/",
      "text": "First of all, Do not drop out! That is not the solution! And please do not bottle up all these emotions! You could end up exploding and saying things you might later regret! I think you should be honest with him and tell him exactly how you are feeling, mentioning every single thing you're doing to be able to finish your thesis. I would write and email him a letter telling him as professionally as possible how you feel. I say writing is best since you read over it and edit it as much as you want to. Do not be afraid to send it once you are comfortable with everything you expressed in it.\n\nI recently had my first-year annual review, and I wrote in my progress self-report how I am doing everything in my power to get through with this semester. I explained the multiple and never-ending issues I've had, and how much I want to be in this program. Two current professors and even my potential advisor contacted me to check on me and offer their help. I cannot thank them enough! \n\nI encourage you to be honest and hopefully this will get resolved. I wish you the best!",
      "author": "lebohardwitztyle",
      "created": 1618591098,
      "upvotes": 5,
      "replies": {}
    },
    "guqikyz": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqikyz/",
      "text": "I'm sorry you're not getting any affirmation from your advisor. Sounds like you're doing all you can, and your advisor just isn't a very good mentor tbh. He might legitimately think he's being motivational. \n\nMaybe this isn't great advice, but maybe meet with him less? Or take command of the conversation and don't let him guilt trip you. Idk.\n\nFor what it's worth, sometimes I wish my advisors would tell me if I should be panicking or not. I'm still convinced when they say \"you're making good progress!\" they're lying lmao.",
      "author": "wildernesspizza",
      "created": 1618588004,
      "upvotes": 2,
      "replies": {}
    },
    "guqa9mg": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqa9mg/",
      "text": "I just wanted to say that I have been in the exact same position. \"You're not doing enough! You're not serious enough! You're not setting yourself up for success! You're not going to find a job! \" \n\nAt some point, my advisor and I hit a breaking point. It was over a dumb mistake. She told me I wasn't taking things seriously and I had ruined the relationship she worked so hard to cultivate with the department (which wasn't true). I low-key exploded and explained that I was taking things so seriously I hadn't slept in several nights and was having several panic attacks a day.  And I think that was pretty eye-opening for her. \n\nIt took a breaking point for me to have that conversation with her, but that was ultimately the only thing that helped. It hasn't solved the problem...just yesterday I got scolded for focusing on the wrong things and failing to produce enough \"key deliverables.\" But it did help. \n\nMaybe it's worth having a conversation. I think that the issues my advisor and I have are rooted in our VERY different personalities, which can only really be resolved through communication. Maybe your situation is similar. \n\nGood luck.",
      "author": "kewlkatakan",
      "created": 1618584410,
      "upvotes": 18,
      "replies": {
        "guqsdj5": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqsdj5/",
          "text": "^ This sounds about accurate. \n\nOP: what you wrote in your original post was very clear, and it also was subjective, since you gave the benefit of the doubt that they aren’t seeing what’s going on internally, or else they would be more empathetic. \n\nI would recommend just copying and pasting your original post as you  wrote it and show him. If he is really a person, or a good professor, they should know the right thing to do. Telling people to succeed without showing them “how” is a sign of immaturity. He *should* be more understanding but... life can be weird that way. He’s probably frustrated because you as his student doing poorly is a reflection on him. But he doesn’t know how to get you to where you “should” be so he is acting like a monkey. His fear brain is taking over, blocking out the insightful part of his brain. He probably hasn’t experience what’s you are describing, so he doesn’t know how to handle it, and maybe doesn’t believe it could exist.",
          "author": "sweetmagnets",
          "created": 1618592184,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "guq91ii": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq91ii/",
      "text": "Hello. As a professor and having been a PhD student once, I understand the pressure you're under and both sides of how this dynamic can play out. First of all, I want to say I am sorry you are going through so much and that you and your advisor seem to be having serious communication issues.  \n\nIt seems to me that it would be good for you to take a step back and reassess what the options look like in terms of taking care of yourself and getting your work-life balance and your PhD back on track. Can you take a break or leave of absense? If not, is it possible for you to break down your current research project(s) into small steps you can accomplish? Being paralyzed by the fear of being scolded or getting it wrong can lead to a vicious cycle; after all, we only learn by making mistakes, and it's important to take things one step at a time.  \n\nI don't know much about your advisor, but do remember whoever is your boss now or in the future is also a flawed human being, and they're probably trying to help out, guide you through the work and push you to complete it, even if they're doing so in a misguided and limited way. \n\nIt sounds to me like you are somewhat intimidated by your advisor and don't feel comfortable sharing your situation with them (I was there once, too). As much as possible, it is important that you sit down with him and tell them what is going on and how you feel. If you don't feel comfortable doing this one on one, maybe there's someone who can act as a mediator in this.  Overall, I think coming up with a way to navigate this with your advisor and coming up with a plan might help, but what do you think?",
      "author": "vanoroce14",
      "created": 1618583876,
      "upvotes": 33,
      "replies": {
        "gusj9tw": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusj9tw/",
          "text": "I think I fear that he will see it as me playing the victim for sympathy. I’m in a country where you’re supposed to endure everything. Suffering equals resilience here, so I suspect that my lack of apparent suffering is really rubbing him off. It’s like there is no other way to measure success if the student is not practically sleeping in the lab. \n\n\nMy friends hide their thriving lives outside of academia to their professors, because profs will be like “oh so you have a girlfriend when do you make to make time to study?”\n\n\nMy own prof was shocked I took holidays during christmas. I mean.",
          "author": "duascoisas",
          "created": 1618622425,
          "upvotes": 3,
          "replies": {
            "gut1s79": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gut1s79/",
              "text": ">I’m in a country where you’re supposed to endure everything. Suffering equals resilience here, so I suspect that my lack of apparent suffering is really rubbing him off. \n\nOh boy. Can I ask where that is? All cultures have their issues but... that doesn't sound good. \n\n>It’s like there is no other way to measure success if the student is not practically sleeping in the lab. \n\nWhile I must admit I pulled my share of all-nighters, what concerns me is that it is evident that this level of stress is paralyzing you. \n\nIf I can try to encourage something... whatever you do, don't let fear stop you. Take small concrete steps. It's better to produce something, tick some todo list boxes and to build your confidence a little at a time. \n\nThe impostor syndrome is not fully going away, I know, but know all of us feel that way. I am a TT professor and I still feel impostor syndrome some days. \n\nI remember when I was a student, my (very Russian) advisor was very strict and business only. Coming from a warmer climate, for the longest time I thought his lack of positive feedback meant he must think I was stupid or incapable. \n\nHe also would email on Saturdays, not only during my holidays but during his asking about work. \n\nTurns out the dude is just that intense. Had nothing to do with the quality of my work... that's just how he rolls. \n\n>My own prof was shocked I took holidays during christmas. I mean.\n\nWow. I mean... you gotta draw those lines. My students lives are none of my business, and honestly, burnt out students don't work very well anyways, so... thats dumb all around.",
              "author": "vanoroce14",
              "created": 1618633216,
              "upvotes": 2,
              "replies": {
                "gut6yge": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gut6yge/",
                  "text": "When he questioned me about my Xmas holiday I just lolled. \n\n\nBut I don’t meant to paint an extreme picture. I feel calm about it, although yes, it paralyses me. I don’t want to get scolded, I also don’t want to spent my energy “trying to please”. It’s tough because I am resisting the culture of this country.\n\n\nI prefer not to reveal what country it is. But let’s just say honour and sacrifice are everything here. And I just don’t want to sacrifice. I’m here to live a beautiful life. (I also just watched Soul last night!)",
                  "author": "duascoisas",
                  "created": 1618636925,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "guq240d": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq240d/",
      "text": "Fuck any PI who thinks there is bandwidth left for acute outwardly expressed panic.",
      "author": "MercuriousPhantasm",
      "created": 1618580729,
      "upvotes": 106,
      "replies": {}
    },
    "gupzvde": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupzvde/",
      "text": "“Deep inside, I know that he is also a human being, and knows my life doesn’t revolve around my research.”\n\nHunny, I regret to inform you that you are in academia. Faculty are obsidian soulless carnivorous beasts that feed off the soul of obsequious desperate anxious graduate students. They starve without you saying “oh yes, I will absolutely do this professor, my soupologius, I love u daddy ❤️.”",
      "author": "Thecatofirvine",
      "created": 1618579644,
      "upvotes": 73,
      "replies": {
        "guqxeq5": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqxeq5/",
          "text": "This is honestly why I hesitate to apply for grad programs. I’m 40, have been working for years, and have zero patience for that sort of garbage. I’m the type who goes into work, do my job, then I leave and not bring work home with me. \n\nBet that will go over like a lead balloon with departments that live for drama. I probably would have shriveled up had I immediately entered grad school after my undergrad.",
          "author": "Rowan1980",
          "created": 1618594362,
          "upvotes": 7,
          "replies": {
            "guuzagh": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guuzagh/",
              "text": "I mean, there are lots of departments that are ok with the 9-5 mindset and encourage good work-life balance. The fraction these represent depends on your field. This is why it's so important to apply for several programs (>3) and talk to department members extensively before you accept any offer.\n\nWorking 9-5 is 100% fine as long as you're consistently getting stuff done in that time. Lots of grads haven't yet learned how to be really focused for the full work day (they get distracted), so they have to work more hours. Profs have learned to expect this behavior, so they may be suspicious of a 9-5 schedule until you show them that you're getting results with it.",
              "author": "pb-pretzels",
              "created": 1618672373,
              "upvotes": 3,
              "replies": {
                "guuzqxe": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guuzqxe/",
                  "text": "I’m not worried about that as much as I don’t have the time or energy to deal with a professor’s ego trips. As with anything, that varies by institution and program, for sure.",
                  "author": "Rowan1980",
                  "created": 1618672524,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "guq06zv": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq06zv/",
          "text": "Lol major daddy vibes. I wonder if I’d have a different experience with a female professor?",
          "author": "duascoisas",
          "created": 1618579800,
          "upvotes": 15,
          "replies": {
            "guq6jvg": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq6jvg/",
              "text": "I had a female PI for my masters, and currently working for a man during my PhD. Of the two of them, the woman was much worse. She induced depression, stress, so much self-doubt, and had me absolutely hating research by the end of working with her. \n\nCurrent boss does have his issues (no one is perfect), but he is much more encouraging and understanding. \n\nI have known women professors who were AMAZING bosses, I just know it can go either way because people are complex and a lot of us suck.",
              "author": "VivaciousApothaker",
              "created": 1618582787,
              "upvotes": 17,
              "replies": {}
            },
            "guq765l": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq765l/",
              "text": "Eh,  i had a female PI and she did the same thing. I think some people that become professors know so much about one topic that they never learned to be a teacher and mentor. She would micromanage how many times I emailed her (not too many things but not too few) and also just not show up to meetings/be an hour late to meetings with me (her lab manager) and (often) the undergrads I was in charge of.\n\nThere also seems to be a mentality that explaining things is “handholding” and not appropriate for grad school, and that toxicity and lack of communication and causing the student to struggle purposefully is part of the learning experience.\n\nI agree with the person below that it’s professor dependent, and finding a good professor is really important.",
              "author": "cocofluo",
              "created": 1618583061,
              "upvotes": 14,
              "replies": {}
            },
            "guq3d2g": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq3d2g/",
              "text": "My professor is a woman and she has two kids. Even if she’s like a superhuman who can do it all (like how tf you can manage being involved in multiples labs, being a tenure prof, publish multiple times a year and have TWO KIDS), she super understanding. Covid took a real toll on my mental health and productivity and she’s the one who helped me find a therapist.\nI don’t want to generalize, but when I compare my experience with a female professor and the experiences of my friends who have male professors, I feel like woman are generally more empathetic.\nI never realized how important it is to find the right professor. It can really change it all.",
              "author": "Sufficient-Kitchen41",
              "created": 1618581323,
              "upvotes": 30,
              "replies": {
                "guqb8ee": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqb8ee/",
                  "text": "The most demonic, everyone-work-til-you-drop prof in my department was a woman. She had a child while I was working on my degree and we all watched with interest to see if she would mellow out and become less of a workaholic drill sergeant. She did not. We’re thinking the nanny will formally introduce the kid to her at the age of majority like some kind of old English gentry.",
                  "author": "eukomos",
                  "created": 1618584827,
                  "upvotes": 26,
                  "replies": {
                    "guqbuf3": {
                      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqbuf3/",
                      "text": "Omggg... hopefully she’s a ‘leave work at work’ type of person? Otherwise this kid is under a lot of pressure to fulfill his stages of development perfectly.",
                      "author": "Sufficient-Kitchen41",
                      "created": 1618585091,
                      "upvotes": 11,
                      "replies": {
                        "guqqz41": {
                          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqqz41/",
                          "text": "lol",
                          "author": "sweetmagnets",
                          "created": 1618591590,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "guq6o5v": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq6o5v/",
                  "text": "I have had the same experience and I think it’s because women are used to having things interfere with work in a way men are not. Just on a base level, if you have a period, it’s going to incapacitate you sometimes. Ditto for being pregnant and having kids! It’s also just more accepted for women to talk about their feelings instead of fighting them down.",
                  "author": "throwaway-soph",
                  "created": 1618582840,
                  "upvotes": 9,
                  "replies": {
                    "guq6vv0": {
                      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq6vv0/",
                      "text": "Could not agree more!!",
                      "author": "Sufficient-Kitchen41",
                      "created": 1618582936,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gurtg7n": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gurtg7n/",
                  "text": "> and she’s the one who helped me find a therapist. \n\nWow, that's beautiful and amazing.",
                  "author": "bluerabbit08",
                  "created": 1618608863,
                  "upvotes": 3,
                  "replies": {
                    "gurtqtz": {
                      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gurtqtz/",
                      "text": "Told you: superhuman",
                      "author": "Sufficient-Kitchen41",
                      "created": 1618609008,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "guq7fin": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq7fin/",
                  "text": "Yeah I had to survival-switch advisors in my first semester from an old boys’ club bully to superwoman. When I was shopping around for my new advisor during the transition period I kept noticing this pattern everywhere myself. My friends who were applying to their programs last year noticed it too. (There are some younger male professors who provide the same quality, though.)\nI wish I could go back in time now that I realize how much more selective I could have been from the get go. You need to assess potential advisors for what theyre providing you holistically, and if they give off even a hint of making you feel not good enough or insecure, fucking NOPE. I find the ones that make you feel insecure are usually lower quality and (in the end I discovered) don’t know very much anyways. Look for an advisor who builds you up, and who you feel completely comfortable going to.",
                  "author": "Puzzleheaded-Scene14",
                  "created": 1618583174,
                  "upvotes": 7,
                  "replies": {
                    "gus1bhd": {
                      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gus1bhd/",
                      "text": "yea, the ones who know how to manipulate you are the ones that need your ideas and labor",
                      "author": "turds_vs_birds",
                      "created": 1618612797,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "guqd5m1": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqd5m1/",
              "text": "My second committe member is a woman and amazing, but I've also had a female professor in the program who was more cruel and demanding than anyone else, men included.",
              "author": "carlaacat",
              "created": 1618585664,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "guq2e3w": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq2e3w/",
          "text": "Omg ☠️☠️☠️ Why is this so accurate??",
          "author": "MercuriousPhantasm",
          "created": 1618580862,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gupykm1": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupykm1/",
      "text": "That sounds like a terrible experience. To me, it sounds like you two have very different communication styles that’s causing the mixed signals. If your advisor is a decent human being, I’d consider laying out the communication gap issue and come up with a solution together. If he’s not a nice person.... I’m sorry you’re in this bind. Take care of yourself the best you can.",
      "author": "BelgaerThinker",
      "created": 1618579008,
      "upvotes": 42,
      "replies": {}
    },
    "gupxkp2": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupxkp2/",
      "text": "If panic accomplished anything I'd be some kind of bajillionair blackbelt bikini model.\nPanic is not work, and its not progress.\nIt drains you mentally and physically. I don't think your professor is being realistic.",
      "author": "HeavyAssist",
      "created": 1618578490,
      "upvotes": 225,
      "replies": {
        "guqq9j7": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqq9j7/",
          "text": "\"Panic\" is OP's phrasing. I'm sure their advisor would describe it as \"buckling down\" and \"focusing\" and point out that it is a better response to pressure than the internal panic and exhaustion that OP says they are feeling.",
          "author": "yerfukkinbaws",
          "created": 1618591283,
          "upvotes": 27,
          "replies": {
            "gusirti": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusirti/",
              "text": "This is exactly it. He just wants me to appear more proactive. It reminds me of when I was working, an older man gave me some advice: always look busy. Just run around, don’t sit down at your desk for too long, stand up and go talk to people instead of sending emails. Because it’s now about whether the work is done, but if the work is done and the worker “seems” calm, then the boss will doubt it. \n\n\nWeird stuff.",
              "author": "duascoisas",
              "created": 1618622152,
              "upvotes": 16,
              "replies": {}
            }
          }
        }
      }
    },
    "gupxcal": {
      "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupxcal/",
      "text": "Is it possible to have an open conversation about it? E.g., sending an email that you want to talk about it, set a date, and then share or ellaborate on your situation?",
      "author": "avigna",
      "created": 1618578367,
      "upvotes": 57,
      "replies": {
        "gur9naf": {
          "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gur9naf/",
          "text": "This OP!! Honesty is how you get what you want. He will see through the façade if you try to fake your personality. He clearly just doesn’t understand you. \nPersonal example is i was born with a bit of hearing loss. A lot of people though I was ignoring them and I started being more open about it and the reaction is much different and better than me being embarrassed or ashamed for being who I am.",
          "author": "hanngart123",
          "created": 1618599798,
          "upvotes": 15,
          "replies": {
            "gusj0pc": {
              "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusj0pc/",
              "text": "I don’t know how to bring it up. Im genuinely confused. Should I show him receipts of my therapy appointments so he can believe that I’m “panicking”? If I do that, will he feel reassured that I’m “taking this seriously”? \n\n\nLadies and gentlemen, I don’t want to panic. I actively try to have a calm, simple, beautiful and pleasurable lifestyle. This doesn’t mean I don’t care or am not putting effort into this. But there’s a true divide between us. My bids for clarity are perceived as excuses and I regress to being 4-7 years old simply watching as adults became frustrated with me precisely because I was always a calm child.",
              "author": "duascoisas",
              "created": 1618622286,
              "upvotes": 3,
              "replies": {
                "gusjwx5": {
                  "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusjwx5/",
                  "text": "My point is you don’t need to “panic” you need to be honest with how you’re feeling. People can easily misunderstand one another if they can’t empathize with them. He is a panicky person who gets his motivation from anxiety. He doesn’t get you. So help him empathize with you. you could either a do it situationally where if you says something like that again be frank and tell him respectfully I try to stay calm but I do care about this and I feel like panicking isn’t my way of doing things but it doesn’t mean I don’t care. Or you could actually set a time and speak with him. Start off with I noticed that you make comments that have been upsetting for me and then go on taking about how you feel. Plan what you say, practice in a mirror, you want this to come across respectful and not overly emotional but sincere.\nShow him who you are, a caring person. If you bring this up I bet you it will help him realize this.",
                  "author": "hanngart123",
                  "created": 1618622773,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634065726
}