{
  "sid": "q2p5zq",
  "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/",
  "title:": "Backpack alternatives?",
  "text": "Hello all, this is a bit of a silly question, but I'm going to ask it anyway. I started my grad program straight out of undergrad, and have only ever used a backpack to carry around my laptop and various notebooks. If anyone has suggestions for a more professional style of bag (I'm open to satchels, brief cases, oversized purses, or even backpacks that don't make me feel like I'm still in junior high) please drop a suggestion or a link below!\n\nSincerely,\n22 year old who still feels like she looks like a child at bring your kid to work day",
  "author": "notsonotinsane",
  "created": 1633541147,
  "updated": 1634099860,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 1.0,
  "comments": {
    "hfmpz4m": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfmpz4m/",
      "text": "I'm a second year PhD student and just bought my first backpack since junior high. They're way more convenient and comfortable than anything one shouldered/handed, especially if you have to walk to campus.",
      "author": "UmbranHarley",
      "created": 1633543033,
      "upvotes": 74,
      "replies": {
        "hfoll3i": {
          "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfoll3i/",
          "text": "I like Timbuk2 for having good professional looking backpacks. They have good sales.",
          "author": "spacefurl",
          "created": 1633573725,
          "upvotes": 7,
          "replies": {
            "hfpxayr": {
              "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfpxayr/",
              "text": "I just got a $30 one off Amazon. Its waterproof and fits my laptop and waterbottles.",
              "author": "UmbranHarley",
              "created": 1633608905,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hfq1mcy": {
          "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfq1mcy/",
          "text": "I tried doing like professional messenger bags and satchels when I was working between undergrad and grad and always came back to backpacks. They really are just leagues better than anything else imo in comfort, capacity, organization, durability and whatever else you can think for the prices.",
          "author": "DonHedger",
          "created": 1633611273,
          "upvotes": 2,
          "replies": {
            "hfqacd3": {
              "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfqacd3/",
              "text": "I used a laptop messenger bag through high school and undergrad, but I finally caved and switched to a backpack literally this week. I agree that they look less professional, but when everyone has them it doesn't even matter.",
              "author": "UmbranHarley",
              "created": 1633615553,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfmomdg": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfmomdg/",
      "text": "They have backpacks on wheels or rolling briefcases that look more businessy, but in academia so many people have backpacks that I don't think anyone bats an eye. I've had professors in their 60's bring backpacks to class.\n\nI used to use messenger bags because they looked a big more scaled up from the standard backpack, but the problem is that if you have a lot of stuff to carry, messenger bags can really hurt your shoulder. Schlepping around a laptop might be the heaviest thing, but it sure can feel that way. Backpacks at least distribute the weight more evenly. \n\nI like Swissgear backpacks. I've had one for over 10 years now and it is as good as new. I probably paid like $100 at target for it, but it was worth the price. It doesn't look like a high schooler's backpack and they are very sturdy and well-made.",
      "author": "False-Guess",
      "created": 1633542471,
      "upvotes": 31,
      "replies": {}
    },
    "hfnengr": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnengr/",
      "text": "What's wrong with backpacks lmao",
      "author": "sensorimotorneuro",
      "created": 1633553530,
      "upvotes": 32,
      "replies": {}
    },
    "hfn0z0g": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfn0z0g/",
      "text": "I don't see backpacks as being childish at all. Lots of professors in my department use backpacks on a day-to-day basis. Perhaps you can upgrade to a more professional-looking backpack in some way, like solid, muted colors and maybe not so rugged-looking. \n\nVera Bradley has some really nice-looking backpacks in solid, muted colors, both in their usual quilted format or made out of recycled bottles. I have one of the recycled bottle ones in a plain grey color. It fits everything that I remotely want to carry around with me but still looks stylish.",
      "author": "aggressive-teaspoon",
      "created": 1633547782,
      "upvotes": 24,
      "replies": {}
    },
    "hfno59z": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfno59z/",
      "text": "Grad school is completely backpack kind of vibes, embrace it! People can expect professional attire when we're payed a professional wage",
      "author": "UsernamesAreHard2684",
      "created": 1633557734,
      "upvotes": 24,
      "replies": {
        "hfp4112": {
          "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfp4112/",
          "text": "Even in the “real world” a lot of people use backpacks if they’re lugging their computer between home and the workplace.",
          "author": "CoomassieBlue",
          "created": 1633584732,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hfn3485": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfn3485/",
      "text": "I bought a leather backpack. It looks professional, stylish, and doesn't hurt to wear unlike satchels, totes, etc. Mine is from Fossil. I use a leather cleaner + conditioner to maintain it.",
      "author": "phdreaming234",
      "created": 1633548673,
      "upvotes": 9,
      "replies": {}
    },
    "hfn54ti": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfn54ti/",
      "text": "funnily enough, my first year at my PhD before I got my car I actually \\*did\\* get mistaken for a high schooler (by a high schooler no less) because I was wearing a backpack and walking towards the bus stop to get to my university. Apparently, I \\*happened\\* to be walking past a high school bus stop at around the time the school buses did their rounds and they just assumed. What made it even worse was when she struck up conversation I actually thought she was an undergrad at my university, which lead to a \"whose on first\" esque situation where the two of us were talking about two different schools and neither realized it until she said something that tipped me off that she thought I was 16. I kind of had to say I was 26 and walk away \\*really\\* sheepishly. \n\nBut the thing is... I still use my backpack anyways. It's way too convenient to not use it that way, and I'm not the only one. Faculty often outright use them in my department so nobody really seems to care in the space where I actually spend most of my time. The occasional mistaken age thing (which doesn't really happen often) doesn't outweigh the benefits I get from the practicality of a backpack.",
      "author": "DoctorWatchamacallit",
      "created": 1633549519,
      "upvotes": 7,
      "replies": {}
    },
    "hfnf57h": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnf57h/",
      "text": "I'm with everyone on this. This is not something you need to worry about.",
      "author": "odesauria",
      "created": 1633553740,
      "upvotes": 8,
      "replies": {}
    },
    "hfmmigv": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfmmigv/",
      "text": "How much stuff do you need to carry?  \n\n13 or 14\" Laptop & charger.  \nMaybe a wireless mouse.  \nOne textbook.  \nOne or two spiral notebooks.  \nCell phone charger.  \nPens, Pencils, chapstick and water bottle.  \n\nIf that's the right ballpark then:  \n\nhttps://www.everki.com/us_en/studio-slim-laptop-backpack-up-to-14-1-inch-macbook-pro-15.html  \n\nWe can talk about messenger bags if you want, but putting ~10 pounds (4-5kg) on a single shoulder just isn't healthy.  \n\nIf you need to carry more than one textbook at a time, or if you have a big 15.6\" laptop then something like this, perhaps:  \n\nhttps://www.everki.com/us_en/atlas-travel-friendly-laptop-backpack-11-inch-to-15-6-inch-adaptable-compartment.html",
      "author": "VA_Network_Nerd",
      "created": 1633541601,
      "upvotes": 6,
      "replies": {
        "hfnfwok": {
          "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnfwok/",
          "text": "Does the slim one have enough room for a change of clothes (t-shirt and shorts) and a lunch, you think? I really like it, but can't easily justify spending that much if I can't hold my stuff.",
          "author": "XBBXBX",
          "created": 1633554064,
          "upvotes": 2,
          "replies": {
            "hfngh8g": {
              "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfngh8g/",
              "text": "> Does the slim one have enough room for a change of clothes (t-shirt and shorts) and a lunch, you think?  \n\nI own the Slim, and (when I went to the office) carried it every day.  \n\nIt has just enough room for the essentials.  \n\nIt was exactly what I thought I wanted - the slimline, minimalist and professional, approaching executive vibe.  \n\nBut I kinda wish I had bought something a little bigger.  \n\nI'm thinking about buying the smaller Atlas.",
              "author": "VA_Network_Nerd",
              "created": 1633554311,
              "upvotes": 2,
              "replies": {
                "hfo5geo": {
                  "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfo5geo/",
                  "text": "Alright thanks, I'll probably just stick with my current bag then",
                  "author": "XBBXBX",
                  "created": 1633566053,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfq3clp": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfq3clp/",
      "text": "Lol I'm 27 and used to wear heels and fancy purses for my old job. Grad school is pure backpack and sneakers vibes because more convenient to carry everything around without causing back issues.\nMy backpack is a freebie from a corporate conference, but you can definitely get something much nicer.\nJust embrace it. No one will think you're more professional or adult for not using a backpack",
      "author": "Blabitybla2021",
      "created": 1633612175,
      "upvotes": 6,
      "replies": {}
    },
    "hfne4ny": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfne4ny/",
      "text": "messenger bag is useful and maybe a tad more professional but honestly if you like using a backpack just use it.",
      "author": "HanSolo139",
      "created": 1633553310,
      "upvotes": 4,
      "replies": {}
    },
    "hfnjd2l": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnjd2l/",
      "text": "I really like my timbuk2 messenger bag. I've had it for almost 10 years now and it's still going strong. Room for laptop, iPad, water/coffee, dongles, papers as needed, wallet... etc etc. It's much more comfortable than other messengers I've tried and is made to really fit across your back instead of dangle down towards your butt (so less pressure on the one shoulder). They were first designed for bike messengers.",
      "author": "boilerlashes",
      "created": 1633555575,
      "upvotes": 2,
      "replies": {}
    },
    "hfo72x2": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfo72x2/",
      "text": "I’ve literally never seen anyone not use a backpack lol",
      "author": "IntelligenceisKey729",
      "created": 1633566815,
      "upvotes": 2,
      "replies": {}
    },
    "hfxcwjn": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfxcwjn/",
      "text": "I feel the same way as you, especially when people think I'm still in undergrad. Also a 22 y.o. F. But then I think about saving myself back pain > looking 'immature.' Anyways, I have a [Swiss Gear](https://www.amazon.ca/Laptop-Backpack-Compartment-Hidden-Pocket/dp/B08K87BVQ6/ref=asc_df_B08K87BVQ6/?tag=googleshopc0c-20&linkCode=df0&hvadid=540626975969&hvpos=&hvnetw=g&hvrand=8377921087920167481&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9000840&hvtargid=pla-1410526611762&psc=1)black backpack, and I think it looks good for grad students.",
      "author": "funkykookaburra",
      "created": 1633741840,
      "upvotes": 2,
      "replies": {}
    },
    "hfmsnlf": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfmsnlf/",
      "text": "I have a leather coach backpack. I get tons of compliments. It retails for around $700 but I got it on sale from coach for like $270\n\nAlso…I lightened my load significantly since virtually everything I read and write is on my iPad and computer",
      "author": "CMRattray2020",
      "created": 1633544228,
      "upvotes": 5,
      "replies": {
        "hfotb2x": {
          "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfotb2x/",
          "text": "Same but I got a used one for about $70 I think. I love it.",
          "author": "the-tautologist",
          "created": 1633578121,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfn23od": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfn23od/",
      "text": "Backpacks are just for middle schoolers lol they’re functional and not too expensive (most of them, anyway). I would say at least half of my fellow students in my grad program use backpacks, including me",
      "author": "rainydayinmay9",
      "created": 1633548250,
      "upvotes": 1,
      "replies": {
        "hfq3jvo": {
          "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfq3jvo/",
          "text": "Do you mean *not* just for middle schoolers lol",
          "author": "KiwiTheKitty",
          "created": 1633612278,
          "upvotes": 3,
          "replies": {
            "hfqmuta": {
              "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfqmuta/",
              "text": "Yes lol",
              "author": "rainydayinmay9",
              "created": 1633620980,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfn576c": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfn576c/",
      "text": "I used a nice canvas laptop bag that had some extra room for notebooks, mechanical pencils (Im a leftie, pens smudge), Kindle, and perhaps a snack or two. Had a nice strap so I could slip it over my shoulder or carry it by the handles like a briefcase. Got it at Staples for $30.",
      "author": "PhosgeneCowboy",
      "created": 1633549547,
      "upvotes": 1,
      "replies": {}
    },
    "hfnavot": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnavot/",
      "text": " North Face Jester back pack. Super professional.",
      "author": "Competitive_Union_22",
      "created": 1633551916,
      "upvotes": 1,
      "replies": {}
    },
    "hfnr3bz": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnr3bz/",
      "text": "Best backpack ever, you won’t have to buy one for years. They make satchels as well. \n\nhttps://www.511tactical.com/rush24-2-0-backpack.html",
      "author": "Money_Nvr_Sleeps_",
      "created": 1633559062,
      "upvotes": 1,
      "replies": {
        "hfq5baf": {
          "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfq5baf/",
          "text": "Also a great backpack: https://sandpiperca.com/collections/gear-packs/products/three-day-pass-black",
          "author": "awksomepenguin",
          "created": 1633613157,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfnr3w5": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnr3w5/",
      "text": "You can get really nice sleek professional backpacks. I did many years of high-level workshops and conferences in the professional world prior to PhD and bought a profesh looking backpack to use just for those occasions. It's the best way to carry laptop + notebooks/books for a full day, and they are widely used by most people (even more than briefcases). A really nice one may run you $200 or more though.",
      "author": "Interesting-Gold-720",
      "created": 1633559069,
      "upvotes": 1,
      "replies": {}
    },
    "hfnurra": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfnurra/",
      "text": "Just get a professional backpack or wheeled backpack. Don't get one with flower patches on it. Briggs & Riley, or Pacsafe are nice backpacks and just an example of professional looking backpacks. Im sure there are tons of options. It depends how much weight you have to carry you might want a rolling backpack.",
      "author": "wutsmypasswords",
      "created": 1633560820,
      "upvotes": 1,
      "replies": {}
    },
    "hfo2fjw": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfo2fjw/",
      "text": "I’m not a shill but Mahi leather has some good leather bags and backpacks if you’d like to treat yourself. You can add your initials to personalize it but it comes at a steep price",
      "author": "2shizhtzu4u",
      "created": 1633564608,
      "upvotes": 1,
      "replies": {}
    },
    "hfo38re": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfo38re/",
      "text": "If you watch when you're walking around campus, you'll even see some professors carrying backpacks.\n\nSo you can certainly get a messenger bag if you have a laptop and only one or two books to carry. But if you need to carry more than that, stick with a backpack.",
      "author": "raistlin65",
      "created": 1633565003,
      "upvotes": 1,
      "replies": {}
    },
    "hfon7y4": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfon7y4/",
      "text": "Bags and jackets are probably my two favorite fashion items. In my pre-PhD professional life I used an amazing Italian briefcase/messenger bag hybrid that I got for 20 bucks and probably sold new for over $600. Love that bag. \n\nBut in grad school I've settled on a smaller satchel bag. It fits my surface pro 7, 2 folders, SSD, all the cables, my kindle, my personal notebook, and my hearing-aid accessories. All that fits in way smaller a space than the nice backpack I got in my first year.",
      "author": "Pr0gr3s",
      "created": 1633574615,
      "upvotes": 1,
      "replies": {}
    },
    "hfp9wsr": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfp9wsr/",
      "text": "I'm 33 and my industry job paid for a backpack, almost all my colleagues have one as it's more convenient when carrying a lot of heavy stuff (like laptop, notebook or the current prosthesis we work on).  \nCarrying about your back more than fashion is actually a very grown up thing to do. (Plus, backpacks obviously can also be fashionable.)",
      "author": "LittlePrimate",
      "created": 1633589430,
      "upvotes": 1,
      "replies": {}
    },
    "hfpsh9e": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfpsh9e/",
      "text": "You just need a nice backpack.\n\nI have an under armor one that’s really bitchin’.  Definitely doesn’t look like I’m in junior high.  If I’d been that cool in junior high, maybe I wouldn’t have had to go to grad school… 😂",
      "author": "Weekly-Ad353",
      "created": 1633605887,
      "upvotes": 1,
      "replies": {}
    },
    "hfqbgf3": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfqbgf3/",
      "text": "I ditched the backpack after undergrad (no choice there) b/c of how much it was hurting my back. Started using a \"messenger bag\" by Targus. Looks far more professional & less easy for someone to rifle through if I need to take a bus or go somewhere with a crowd of sketchy ppl.",
      "author": "Duc_de_Magenta",
      "created": 1633616071,
      "upvotes": 1,
      "replies": {}
    },
    "hfqzvjz": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfqzvjz/",
      "text": "I have a Herschel Little America Backpack. It is 25 Liters and looks better than my worn out backpack from Undergrad. It fits everything I need (only downside is no side pockets so my Hydroflask has to go in the bag or I have to hold it). It cost me about 75 dollars on Amazon for the color I got. I can also use it for travel!",
      "author": "skhansel",
      "created": 1633626265,
      "upvotes": 1,
      "replies": {}
    },
    "hfr664a": {
      "link": "/r/GradSchool/comments/q2p5zq/backpack_alternatives/hfr664a/",
      "text": "I think backpacks are fine but I also have a very nice canvas bag that can be carried as a briefcase or a messenger bag or a backpack. it's spacious and all extra straps can be hidden when not in use.",
      "author": "LaLexxia",
      "created": 1633628833,
      "upvotes": 1,
      "replies": {}
    }
  }
}