{"sid": "b3wykj", "link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/", "title:": "Baby + Grad School achievement unlocked", "text": "Am currently writing my dissertation proposal with my newborn strapped to my chest while bouncing on an exercise ball.  [Seriously](https://imgur.com/nw0yJnA).\n\nAny other new moms out there?  How ya doin'? Tell me your secrets!", "author": "MissBee123", "created": 1553207224, "retrieved": 1632845890, "over_18": false, "upvotes": 369, "upvote_ratio": 0.93, "comments": {"ej5t5oz": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej5t5oz/", "text": "I wanted to add: please take care of yourself and your own health as well. Babies are hard (generally), grad school is also generally difficult, so it’s easy to put yourself last. Don’t. Make some time for yourself and your health (mental and physical), it’s easy to get burnt out otherwise. I really regret not taking better care of my health after having my kids, especially with the second. \n\nAnd also, just enjoy your baby. It goes by so fast. Grad school will sort itself out if you just keep constantly chipping at your dissertation, even if you can’t spend as much time on it as you’d like right now. Wishing you and your family all the best!", "author": "trivenefica", "created": 1553300400, "upvotes": 3}, "ej4iu1c": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej4iu1c/", "text": "That is one cozy baby.\n\nI never cease to be amazed at people who manage grad school with families. Couldn't do it.", "author": "DoctorAcula_42", "created": 1553269822, "upvotes": 3}, "ej4gill": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej4gill/", "text": "Am finishing up a master’s. I don’t have kids, but I do work with the. and when they don’t nap, it can be hard for me to do my homework. If you can afford it, hire a babysitter for a few hours to do work, or nap! I have babysat for several clients who were getting Ph.D’s. The mom’s get a break, I get money and the baby learns to be around other people! ", "author": "degrassibabetjk", "created": 1553268487, "upvotes": 1}, "ej4c9sh": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej4c9sh/", "text": "How did it feel when you ascended to your final form and realized that you no longer needed sleep?  Was the process painful?  How much juice did you drink?  How many situps? ", "author": "_Doctor_D", "created": 1553265980, "upvotes": 3}, "ej43y4x": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej43y4x/", "text": "New dad here, does that count? I had some 3am dissertation writing with baby asleep on my shoulder. Super awkward.\n\nI recognize that \"grass\" drying rack in the background too.", "author": "m3wolf", "created": 1553259867, "upvotes": 4}, "ej42qec": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej42qec/", "text": "I’m very impressed. As a grad student thinking of my future career and starting a family this is very motivating to see. I wish you all the best ", "author": "valerierw22", "created": 1553258770, "upvotes": 2}, "ej42clw": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej42clw/", "text": "I'm not a woman but I could not imagine having a child in grad school. The commitment you have doing this is incredible. ", "author": "DataScienceUTA", "created": 1553258404, "upvotes": 3}, "ej41gff": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej41gff/", "text": "Check out flatcomics on Instagram, she's another grad student Mama. ", "author": "GrandmaMabelGrey", "created": 1553257524, "upvotes": 2}, "ej41blo": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej41blo/", "text": "I don't know how you do it, but I'm impressed to say the least. Good luck and congratulations!", "author": null, "created": 1553257388, "upvotes": 2}, "ej3vnrf": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej3vnrf/", "text": "You're a bad ass. Couldn't even imagine trying to do Grad school with a baby. Rock on", "author": "eisi0523", "created": 1553250434, "upvotes": 2}, "ej3gxxc": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej3gxxc/", "text": "Haha you're just like one of my committee members. She's a beast; has a 3 year old and an almost 1 year old, runs a full computer science lab, handles multiple interdepartmental projects like mine, working on her own projects, paints, mentors a bunch of undergrads....\n\nI don't know her secrets. I think she just truly enjoys what she does or finds the positive and fun part of everything she does. ", "author": null, "created": 1553228718, "upvotes": 3}, "ej3dt8d": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej3dt8d/", "text": "That's a fantastic achievement you unlocked. I'm a dad in my fifth year. My first born was 7 months old when I started grad school. I also have a two-year old now.\n\n  \n\n\nHere's some of the tricks I used to survive:\n\nGot a rocking recliner with big arms that cold hold my laptop. I held a baby and rocked it to sleep with my left arm and typed most of my papers and master's thesis with my right. It's obviously slower, but it keeps the work flowing.\n\nI also used any method I could to have texts read to me whenever possible. It's worth investing in (or pirating ;) ) a copy of Adobe Acrobat. It can scan image PDFs into readable text. It has a text to speech function. You can also sort PDFs to a word document, and create your own ebook that you upload to Google play books, which has great text to speech tech. I used this method to free to time in my day. I listened to readings while I cleaned the house, did dishes, laundry, dinner, took the baby out for walks, etc. While at home, I would leave a copy out for me to make notes on when needed while I was listening and doing housework.", "author": "strykerace1985", "created": 1553225733, "upvotes": 12}, "ej3au68": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej3au68/", "text": "Finished my program at 9 months pregnant. Boy, did I want alcohol for dissertation phase... Moved to take a job when baby was 2 weeks old. Left husband in another time zone for 6months until he found a job.\n\nBaby 2 came in my 3rd year of TT. That one almost killed me (figuratively and literally). That year was horrible.\n\nThings I've learned: ask for help, that sleep when they sleep thing is BS, print articles to read, it's easier if they are passed out on you, enjoy the cuddles. If you're nursing, protect your time to pump or feed. Let that time be work-free. It'll help reduce stress. Know it is ok to come home from work and be mom. Work doesn't have to be 100% if the time... But guilt as an academic and as a mom will make you feel it is.\n\nLast: pick up a copy of Mama PhD. It really gave me a lift when I was down.", "author": "sjgw137", "created": 1553223182, "upvotes": 16}, "ej39xfc": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej39xfc/", "text": "Currently writing my dissertation at 5 months pregnant and I have a 10-year old. Lots of support from husband is important, but my son is pretty independent. When I was an undergrad with a newborn, I would nurse my son and work on the computer or read and then my husband would do the burping and playing!  \nAlso, do what you can even if it means only working while baby is asleep. ", "author": "lifesaboxofchocolate", "created": 1553222438, "upvotes": 5}, "ej38ezs": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej38ezs/", "text": "I'm not a mom, but as a struggling grad student, you go girl!", "author": "ozzalot", "created": 1553221204, "upvotes": 3}, "ej341ke": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej341ke/", "text": "One of my cohort seems to be doing great, going a year strong now! I love seeing her sharing moments, alternately, of baby growing up and of dissertation writing.", "author": "carlaacat", "created": 1553217720, "upvotes": 2}, "ej338zz": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej338zz/", "text": "good for you mama keep it up", "author": "bearded_scythian", "created": 1553217088, "upvotes": 2}, "ej32ld0": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej32ld0/", "text": "You're rocking it! That ball is going to be your best friend. Also, I found my kids don't care what you read to them, as long as you do. So I read most of my assigned readings out to them during the day.\n\nI finished my last semester with a newborn. I found on nights where she was struggling to sleep, I'd set up in the lounge room. Me comfy on the couch, her on my chest, pillow under her butt so I could be hands free. Then laptop on the pillow, book on other side of the pillow, pens on arm rest. TV on for background noise and light to write by.\n\nIt's tough, but I found studying with the kids was easier than when I was just doing the stay at home mum thing with my first. Something just for me.\n\nBest of luck! Be sure ask for help and communicate early with your professors.", "author": "so_sayeth_i", "created": 1553216563, "upvotes": 10}, "ej32h6w": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej32h6w/", "text": "I’m 34 weeks and I have my MFA thesis the last week of June. This post was much needed after a rough day - total inspiration!", "author": "paintingxcult", "created": 1553216473, "upvotes": 11}, "ej32e6e": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej32e6e/", "text": "moms (and dads) in grad school are seriously my heroes", "author": "rectanglethemime", "created": 1553216405, "upvotes": 13}, "ej31r1m": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej31r1m/", "text": "I finished my MS thesis while on maternity leave from a corporate job- phew talk about burning the candle at both ends. SOOO HARD- but you’re totally a rock star. I want to go back for a PhD but want to pop out one more kid first 😜", "author": "tinatodemoides", "created": 1553215890, "upvotes": 5}, "ej31hh1": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej31hh1/", "text": "I’m just here to say you’re amazing! Keep it up.", "author": null, "created": 1553215678, "upvotes": 2}, "ej31eg5": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej31eg5/", "text": "Not a mom, but new dad here! We are fostering a sibling pair, 18 and 8 months old when they were placed in our home beginning of January! It certainly turns grad school from hard to expert mode lol. The worst part is that one or both of them seems to be sick every week, so I find myself staying home with a sick baby many days when I need to be getting lab work done... I have learned to get work done when I have the chance, even if that’s the middle of the night! ", "author": "jethvader", "created": 1553215609, "upvotes": 7}, "ej31c5u": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej31c5u/", "text": "Keep crushing it!", "author": "Krzysiuu", "created": 1553215560, "upvotes": 2}, "ej2zfg2": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2zfg2/", "text": "I had mine during finals of first semester. Literally during my Organometallic and Transition metal chemistry mechanisms final. It's been a whirlwind these last five years, but I wouldn't trade the kiddo or the grad school. Also working on getting outta this place!", "author": "useless83", "created": 1553214044, "upvotes": 5}, "ej2z382": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2z382/", "text": "Looks like you’ve figured out a good system!  I had my first in the middle of grad school and was 8 months pregnant when I defended my dissertation. It’s hard! But I figure newborns are always hard, at least in grad school my working hours were flexible! I survived by taking it slow and just pushing back graduation. ", "author": "goodusernamestaken_", "created": 1553213778, "upvotes": 10}, "ej2y59t": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2y59t/", "text": "You look amazing! I took the GRE 8 weeks pregnant and started grad school with a 7 month old. It sucks butt but I swear mom strength is some extra level super power. You got this! ", "author": "kettles", "created": 1553213025, "upvotes": 26}, "ej2y1cd": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2y1cd/", "text": "You’ve got this! I have a very similar photo with my second child as a newborn in a wrap while I was writing my dissertation. I successfully defended shortly thereafter. I won’t lie....it was HARD. But in my last few months leading up to my defense, my husband made sure I had a hot meal to come home to, and he put the kids to bed while I either went back to the lab, or wrote in my home office. I had a strong support system. And I hope you have one too. Good luck!", "author": "scarieb", "created": 1553212939, "upvotes": 38}, "ej2xvrg": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2xvrg/", "text": "I’m currently in a PhD program with a 9 year old and baby fever so keep on keeping on and giving people like me hope that it can be done! You Rock!!", "author": "ellaAir", "created": 1553212818, "upvotes": 25}, "ej2wo45": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2wo45/", "text": "Damn, you go girl! I took a CNA class while I was breastfeeding, and THAT was enough.", "author": null, "created": 1553211869, "upvotes": 2}, "ej2vb1b": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2vb1b/", "text": "I don’t have a baby and definitely did not have one when finishing my Masters. \n\nSo I’m just here to say keep kicking ass, keep being an amazing academic, mom, and woman! ", "author": "sleanne14", "created": 1553210798, "upvotes": 56}, "ej2t0nc": {"link": "/r/GradSchool/comments/b3wykj/baby_grad_school_achievement_unlocked/ej2t0nc/", "text": "Sounds like you're figuring it out!\n\nFor some stupid reason I decided to undertake a paralegal certificate course when I was on maternity leave. Turns out that writing up pretend litigation documents chanelled my new mom anger pretty well. \n\nI found the best way to handle a baby was to just wait it out until it turned one, then it wasn't a baby anymore and I technically had a toddler instead. Works every time.", "author": "doobeedoo3", "created": 1553209056, "upvotes": 90}}}