{"sid": "nk3d7f", "link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/", "title:": "Anyone else NOT a workaholic?", "text": "I keep seeing posts/tweets where people can’t take weekends off or feel bad for taking a break in the day. I just wanted to show another perspective and ideally someone to validate I’m not just lazy....\n\nI pretty much keep a 9-5 schedule except for when I have long in vivo experiments, a big presentation or the rare occasion I have motivation. Sometimes if I have no lab work I just take a day off if I’m tired/bored or just don’t want to work. \n\nMy advisor is happy with my progress and I should finish with 2 first author papers. I still die from imposter syndrome when I read about people doing 80 hour weeks though", "author": "NovigradScientist", "created": 1621877369, "retrieved": 1632953192, "over_18": false, "upvotes": 1005, "upvote_ratio": 0.99, "comments": {"h0krptv": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/h0krptv/", "text": "Thank you for this post. I hate the culture of overwork and I hate that people complain/brag about it. I'm proud to take time off and work light days!", "author": "goodgrow", "created": 1622820083, "upvotes": 1}, "h0kd3e7": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/h0kd3e7/", "text": "what you do is something I admire. I used to not give a shit and do bare minimum in bachelors and still made it. But in masters, maybe it's covid and boredom. I have spent long hours on work and I keep on taking more work in hopes that it will pay off. \n\nAnd im starting to feel bad about it. I am more anxious these days. Cant relax even when my exams are over. In fact I am searching up Workaholism on reddit to find similar experiences and solutions to get out of this mindset. \n\nMy advice? Nothing. You are doing amazing. You manage to hold your position, get satisfactory results while keeping a healthy and sane head on your shoulders. This is something I want to get to right now. So be proud. Also Imposter Syndrome affect everybody at some point, some people for longer. Hustle culture is being paraded everywhere. It's shit. That is really making people sick. So don't worry, you are healthy. It's them who need to worry about.", "author": null, "created": 1622813479, "upvotes": 1}, "h0468mk": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/h0468mk/", "text": "Well I wasnt a workaholic and did not want to work on weekends or at night. In the end I wanted a job with reliable off time. It cost me my PhD program but I feel I made the right choice. No regrets. It was what I hated the most about being a PhD student and I didnt feel it would have gotten any better if I made it a career.\n\nMy Masters was no problem though. I probably could have done the PhD if I was actually capable of studying 9 to 5 daily like you mentioned, but I wasnt. I studied maybe 30 minutes a day.", "author": "P90K", "created": 1622490945, "upvotes": 1}, "gzxlfbd": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzxlfbd/", "text": "I am not a workaholic either. I tend to be in hyperfocus mode for a several days a week or a week, get a lot of stuff done, then i take pretty much chill for a couple of weeks, or do some minor work, and then a cycle repeats again. A bit more work before deadlines, but not tragic 🤷 In my last year now, advisor’s happy with my progress, so idk.\nUnpopular opinion, but I enjoy doing my PhD a lot.", "author": "coyote-schmoyote", "created": 1622339429, "upvotes": 1}, "gzf6dzv": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzf6dzv/", "text": "You've probably only got 2-4 hours of good research and writing in you every day. Makes sense just to do that. And as my supervisor says, when your thinking about the PhD, you're doing the PhD. So  on that basis I guess I work 18 hours.", "author": "AbandonshipUK", "created": 1621967633, "upvotes": 2}, "gzf25oa": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzf25oa/", "text": "In fact, I reckon that to be workaholic might have negative consequences not only on your mental health but also on your work itself since you may not notice some significant things and ideas", "author": "fibonacci_bokertov", "created": 1621965875, "upvotes": 1}, "gzeppb7": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzeppb7/", "text": "Smart and planned work is key. That's how you spot real geniuses imo... If you plan well I think you can even work 50% and go way faster than a 100% PhD student who's just a repeating machine who believes that long work means great work.\n\nJust remember the students sitting a FULL day at the library when they were studying for exams: they're usually the ones failing. They read 1 sentence every 30min and only feel safe because \"they spent the day at the library\".\n\nImo, it is the same thing in the lab. Don't stare at the clock for the sake of bragging about your 80hours that could be squished to 10 if you planned them well.\n\n(Once again it's my opinion, up to discuss)", "author": "LowmanaXL", "created": 1621960490, "upvotes": 1}, "gzep944": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzep944/", "text": "This is the way. I've been golfing three mornings a week these days, and feeling pretty good. You set the deadlines in grad school no matter how much work is on your plate. Make time for yourself. If you work all the time you are paid less than minimum wage for work that requires a college degree. I like to think I make a little more now than I did flipping burgers in high school 10 years ago, or cutting grass in summers between undergrad, but that's only the case if I'm firm about working no more than 40 hours (even then). Say no to those conditions and invest time in yourself instead.", "author": "bigvenusaurguy", "created": 1621960300, "upvotes": 1}, "gzechys": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzechys/", "text": "I try to work the least amount I can while still getting my stuff completed.", "author": "revolutionPanda", "created": 1621954766, "upvotes": 1}, "gze6dko": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gze6dko/", "text": "I used deep work periods to get through my degree. At the end of my PhD, my schedule was 3.5 hours of work (usually writing), 30 min - 1 hour break, 30 minutes for email, 3 hours of work (usually reading, meetings, interviews), 15-20 min break, 1 hour of email and prep for the next morning's writing session, done for the day. I might skim a paper before bed, but I tried to only do that if it was a paper that I really wanted to read and would get me excited to write more the next day. \n\nI did my writing early in the morning, like starting at 7 am. So I always had time in the evenings to have hobbies and a life. I usually tucked myself into bed by 10:30-11. \n\nEveryone works differently, but I think coming up with a system for how you work is critical to your success as grad student and beyond. \n\nEven today, I have set hours where I open my emails because I hate how email fragments the day and distracts from major tasks. My colleagues know that if there is something earth shatteringly important, they should call. Otherwise, I'll get back to them in a few hours.", "author": "radicalcartograph", "created": 1621951994, "upvotes": 1}, "gze66v7": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gze66v7/", "text": "I'm definitely not a workaholic but I get shit done and my supervisors seem happy with my progress. I love my research; I'm passionate about it and want to give it my best, but I'm also a mom to two young kids and I want to give my best to them as well. Balance is super important for me and I think it has helped keep me on track and prevented burn out so far.", "author": "naughty_bunny", "created": 1621951906, "upvotes": 1}, "gze2hi0": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gze2hi0/", "text": "Honestly good for you that you can keep healthy boundaries and a work-leisure balance. Some people brag about their hours, are overburdened, or might have a other things affecting their productivity ( like undiagnosed executive dysfunction). If your advisor is happy with your work and feels you are on track, count it as a blessing. \n\nImpostor syndrome affects a lot of people - just remember you are putting in the work/effort. You deserve to be here , just based on that", "author": "Researcher_Life", "created": 1621950178, "upvotes": 1}, "gzdxexn": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdxexn/", "text": "I want to thank you for your post. I have been feeling really bad. My day basically consisting of working, eating and sleeping. And I still feel like I am not doing enough.I feel bad about taling a break and have not been taking up the vacation days I should take. My idea was..'well, everyone does it like this apparently'. So I felt bad for feeling unwell. But your post proves me otherwise. Thank you", "author": "potterheadwithtardis", "created": 1621947538, "upvotes": 1}, "gzdwgz2": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdwgz2/", "text": "It depends on the research I guess, I work in a synthetic lab and sometimes just cleaning the glassware before and after the experiment takes hours.", "author": "MIA_AIM1", "created": 1621947026, "upvotes": 1}, "gzduos5": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzduos5/", "text": "I relate so much to this. Back to my undergrad, MSc, and research assistant days I was a workaholic. I realized that I actively wean myself out of the \"workaholic researcher\" state of mind during the last months of my RA days in preparation for the start of my PhD. I actually was successful during the first year of my PhD-- supervisors were happy with my progress  even though I don't spend 50+ hrs in the lab. I had time to join uni clubs & societies and attend most/some of their events as well as do some of my hobbies.\n\nI started to feel pressure to overwork again during the lockdown when I would see one of my labmates still going to the lab almost everyday even though our supervisor didn't really require us to (we were both considered essential workers for our institute since we were in charge of refilling N2  for one of the NMRs in our bldg). Soon, other labmates were also coming to the lab even during lockdown since they also feel pressured to come (including me), seeing that my supervisor was pleased that this one student that was still generating results/data. I relapsed to my workaholic researcher days shortly after this, to the point that I felt guilty not working during the Christmas break because I knew that my labmates were still working in the lab (granted most of them did not celebrate Christmas). I burned out around that time and what's worse is it took like 2 months of barely scraping by (and a very disappointing progress report during our lab meeting) before I can regain interest with my research again. \n\nIt's just really hard to maintain a non-workaholic attitude when you see all the people in your lab being a workaholic. I just really want to go back to that time when I'm not affected by the overworking culture of my labmates because I know I was effective during that time. 😢", "author": "peppergirl24", "created": 1621946019, "upvotes": 1}, "gzdu83m": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdu83m/", "text": "I am completely with you. I did my whole PhD including three first author pubs in good journals on a basically 8 to 5 schedule. No weekends except where it was absolutely necessary and during my thesis writing stage. \n\nIt may depend a bit more on your project and your PI though. My results came relatively easily, but I know people who had to slave away just to get one sample or set of data. Also my advisor was really cool and adamant that people should not work at all on weekends or holidays.\n\nPostdoc has been a bit more difficult to maintain this kind of schedule. But overall I am still keeping my weekends and holidays free except when I have to teach.", "author": "handwavingmadly", "created": 1621945746, "upvotes": 1}, "gzdrpy3": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdrpy3/", "text": "I am a huge workaholic. I do 12 hours day and even more. The thing is, I feel obliged to do more, be more and achieve more. There is a lot at stake for me being a first-gen student so I always feel like it is my responsibility to work hard and excel. Academia placements are highly competitive in my country and one needs to graduate with good publications to work in a good university. I just look at it as a sacrifice for the next 2-3 years to get a job I want.", "author": "givemeyourdonut", "created": 1621944223, "upvotes": 1}, "gzdogmb": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdogmb/", "text": "I am a workaholic, and the reason is I struggle to work efficiently 9-5 (I think i have undiagnosed adhd). I am also super anxious, and struggle to sleep and enjoy my free time. I used to not be a workaholic until my PhD progress blew up a bit and slowed down.", "author": "Runebro", "created": 1621942047, "upvotes": 1}, "gzdlkmp": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdlkmp/", "text": "SAME. This was refreshing to read. :')", "author": "lowkeystrange", "created": 1621939893, "upvotes": 1}, "gzdh5no": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdh5no/", "text": "You just described me perfectly. I work 9-5 where possible (sometimes 10-4), am mostly on track to finish my research masters and take days off when I need it. My supervisor says I’ve got a good chance of publishing. If I publish the papers I want to and finish my masters thesis, I’m planning to make a post here about how you don’t need to work 12+ hours a day to succeed.", "author": "beautyonthebiside", "created": 1621936036, "upvotes": 1}, "gzdfvxz": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdfvxz/", "text": "I’m not either. I work long hours in the lab because we are restricted in access still at the moment (I get two days a week), so I make the most of it, but otherwise? My weekends are my own unless a big deadline and I work 10-7 with breaks and rarely work later. I’m in my final 7 months too.", "author": "ayeayefitlike", "created": 1621934815, "upvotes": 1}, "gzdfl9h": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdfl9h/", "text": "I am definitely not a workaholic. I try to keep a regular schedule for work but always find myself getting distracted. Other days I don't want to do anything but work and I'll end up putting in 14 good hours. It's seemingly random and not tied to submission deadlines. In any case, what needs to get done gets done, which is what matters to me. After constantly hearing about students' lives being invaded by graduate school, I made a point of keeping a healthy distance from that lifestyle.", "author": "MrMeatScience", "created": 1621934527, "upvotes": 1}, "gzdf10i": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzdf10i/", "text": "I just started last Saturday and I am so intimidated and feel like I have impostor syndrome. All my batch mates are so quick on their feet like they lead everyone else about coursework etc. and me, Im still so lost and confused about the online platform we’re using still lol.. im like huhhh what?! Where did you find those files?", "author": "losingweightgirl", "created": 1621933995, "upvotes": 1}, "gzda2ff": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzda2ff/", "text": "Finally, I am not alone :)\nI work 35h in average, peaked at 82h/week once and sworn to never do this again. \n\nBut I found a huge difference to these \"Workaholics\". Most of them just are fk inefficient. While there are some that actually work every hour of their 80h week, most people I know don't. They have a coffee break every 2h for half n hour. They never prepare their lab work and just start planning when they enter the lab. They can't finish a paper in one read. They talk and gossip to others 24/7. They just keep distracting themselves from their own work and then work 80h ish to keep up with their work. \nBut instead of working more efficient they call themselves \"Workaholics\" and blame you for not working enough, so they can feel better themselves and avoid recognizing their own failure.", "author": "TheGoalkeeper", "created": 1621929158, "upvotes": 1}, "gzd21fh": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzd21fh/", "text": "Yes!!! Thank you! I tell people all the time in my program that they need to take time off, take care of themselves, and better manage their workloads. I think a lot of grad students don't understand that they have the power to say no (unless they have an abusive advisor). \n\nHow I see it, it is my responsibility to modulate the amount of work on my plate. I often push back on my advisor. He'll say \"I need you to do A, B, and C by next week\" and my response is \"Ok I can have two of those done, which two are most important?\". I understand it is not that simple for many people with their advisors, but it's an example of how I modulate my workload.\n\nIn order to get around the imposter syndrome, I did a lot of reading about how much work is feasible in a week. Turns out that we can only productively focus on \"deep work\" for \\~4-5 hours a day (measured by time spent completely tuned in and focused). Most Ph.D. work (learning, writing, coding, etc) is considered deep work. We also cap out at about 45-50 hours a week (at a desk, not necessarily 100% focused) before we hit diminishing returns. Anything above 55 hours, and you can actually start to have negative returns because you start to make mistakes. \n\nAlso, there are innumerable short- and long-term health impacts of overworking. The WHO just came out with a report that showed in drastically increases the risk of stroke down the line (10+ years after the overworking)\n\nMoral of the story, it's actually detrimental to work that many hours.", "author": "banamana27", "created": 1621922336, "upvotes": 2}, "gzd1mji": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzd1mji/", "text": "Having self respect is not a bad thing", "author": "balljointedmae", "created": 1621922015, "upvotes": 2}, "gzd0fyt": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzd0fyt/", "text": "I've begun to wonder if such long work times are due to inefficiency.when I work, I work. Nothing else aside from bathroom breaks and a meal break. I have daily and weekly goals. \n\nI find a standard work week is often more than enough to accomplish my tasks, but I'm also not saying yes to a lot of extra responsibilities.", "author": "GayDeciever", "created": 1621921137, "upvotes": 1}, "gzcui61": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzcui61/", "text": "Same, definitely not at all. I go out quite a bit. Exercise at least an hour and a half a day. Don't do any work after 10pm (unless absolutely necessary). Gradschool is not my life, it's just my interest.", "author": "DarthFarris", "created": 1621916989, "upvotes": 3}, "gzckypn": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzckypn/", "text": "I would say I'm absolutely not, but everytime I do people laugh, so ¯\\ (ツ)/¯", "author": "DonHedger", "created": 1621911247, "upvotes": 1}, "gzcgzk7": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzcgzk7/", "text": "They don't pay me enough to be a workaholic.", "author": "silkchemise", "created": 1621909117, "upvotes": 4}, "gzcgt0b": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzcgt0b/", "text": "holy shit thank you for making this post", "author": "spuckyspud", "created": 1621909021, "upvotes": 6}, "gzcgkmz": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzcgkmz/", "text": "I feel this 100%, was starting to feel like I was doing something wrong reading so many posts about having no free time", "author": "chatsurlalune", "created": 1621908895, "upvotes": 2}, "gzcfzzy": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzcfzzy/", "text": "As a lurking undergrad, thank you for sharing another perspective!", "author": "sayhi2yourmother4me", "created": 1621908590, "upvotes": 1}, "gzcek00": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzcek00/", "text": "Me. I spent my last year in undergrad a workaholic, doing a thesis, frantically applying to grad school.\n\nThen i spent my first semester of grad school as a workaholic. The winter semester? Ive totally relaxed things and placing a huge emphasis on my hobbies. I'm still productive, but my quality of life is waaay better.", "author": "pinkolomo", "created": 1621907829, "upvotes": 1}, "gzce5pn": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzce5pn/", "text": "Yep, 9-5 here for the most part. 7 papers total from PhD or collaborators so it is possible, if you’re able to treat it like a “real” job.", "author": "selkie340", "created": 1621907622, "upvotes": 2}, "gzcbpl2": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzcbpl2/", "text": "ME! I shoot for 8-5 (often take a couple of hours during the day to walk my dog too). This is for 3 jobs on top of classes and thesis (MS student). Obviously I sometimes have to work more than that, but I always make sure to have an entire day off each weekend and prioritize things like spending time with my family and going to the gym. I have zero interest in making school/work my life.", "author": "arl1286", "created": 1621906359, "upvotes": 2}, "gzca2ww": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzca2ww/", "text": "im sortof the opposite in that I really really really am struggling lately to get anything done.", "author": "Peter_See", "created": 1621905507, "upvotes": 3}, "gzc8f5q": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzc8f5q/", "text": "Hello from the other side.\n\nYes, I was. I felt like constant work was the only defense against imposter syndrome and how to avoid \"cheating on my degree.\" Many of my colleagues worked more normal hours - they are all called Doctor now, too.\n\nGrad school is hard in ways you cannot anticipate. Comparing yourself to anyone who else just increases anxiety and frustration. If you work shorter hours, but get plenty done, then that's the only metric you need to care about. \n\n\"Comparison is the thief of joy.\" Find your joy, your balance, and stick to it. My anxieties drive me in grad school and made me miserable because of fears of not measuring up. You don't have to be that way, just trust in yourself.", "author": "atchemey", "created": 1621904631, "upvotes": 5}, "gzc44ka": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzc44ka/", "text": "I'm a recovering workaholic. I went from 12 hour days 5-6 days a week to my regular  9-5 M-F. It is amazing.", "author": "Pigtailsthegreat", "created": 1621902431, "upvotes": 2}, "gzc2gf9": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzc2gf9/", "text": "I've never been a workaholic and I'm still here. Somehow I manage to do things and, lately, it feels great not being so damned pressured by peers and friends. The secret is to compare with no one, but yourself from a day ago. And I also enjoy little things and silly hobbies. I love my life the way it is right now <3", "author": "roymustangsimp", "created": 1621901582, "upvotes": 1}, "gzc0apw": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzc0apw/", "text": "I am very strict about only staying 8 hours in lab (usually 8-4 because I prefer starting early) unless something really needs to be done that will take longer, and I NEVER go in on the weekends unless absolutely necessary (I’m very lucky to work in a field where very little ends up needing to be on a Saturday or Sunday!). I still feel guilty now and then for leaving when other people are still working, but I just try my best to shrug it off. As long as I am efficient and finish my to-do list for the day, that’s enough for me. I also agree that it’s a good idea to take a day off every now and then if you’re feeling super tired and know the quality of your work will be meh if you force it.", "author": "iced_yellow", "created": 1621900436, "upvotes": 1}, "gzc030q": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzc030q/", "text": "Im doing a PhD and rarely work a weekend, and basically do a 40 hour work week most of the time. I’ve worked much less this month since the semester ended, including a couple weeks off for my wedding and vacation. I’ll start working a lot again in June when my field work gets into full swing. It does sometimes make me feel guilty to not work all of the time, but I seem to be doing relatively well and it makes me happy to spend time on my relationship, hobbies, and relaxing in general. I have better ideas when I have a better work life balance.", "author": "cadco25", "created": 1621900323, "upvotes": 1}, "gzbusac": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbusac/", "text": "I was not a workaholic. I usually did 9 or 10 hour days in the busiest times but rarely did weekends. I'm married and had no desire to be in lab at all hours. Working efficiently was far more effective than working long hours, but I also had a PI who valued work output over hours, so as long as you were getting results, that's all that mattered. \nI graduated and have been in a non-academic job for about 6 months now and I can assure you that the whole \"grind til you die\" mentality is not a reality where I am. If I work over 42ish hours, I'm being asked why. \nSo if your PI is happy with your progress and what not, don't worry about what others are doing. You do you, and that is more than enough :) you will all have the same degree at the end anyway!", "author": "Team_Cap", "created": 1621897581, "upvotes": 1}, "gzbtlwf": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbtlwf/", "text": "Thanks to my Master's advisor I've managed to convince myself that I really am stupid, and that the only way for me to succeed is to put much more time into my work than anybody else.\n\nI'm doing my doctorate now at a different University but I can't seem to shake the belief that the only way for me to succeed is to work 70-80 hours a week. I'm working on it though (decreased my hours a lot!).\n\nI've been in grad school for a total of 3 years now, and am still working on figuring out this work/life balance thing. Thankfully, my PhD advisor seems to really value it and actively discourages me working ridiculous hours alongside not setting ridiculous expectations for me. It's a nice pace of change to be treated as a colleague, rather than seen as just another cog on a wheel whose sole purpose revolves around the betterment of the academic standing of the professor.", "author": "Climate_Crisis_420", "created": 1621896976, "upvotes": 4}, "gzbr52z": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbr52z/", "text": "honestly? good for you. I think we need more people who A) are willing to assert their boundaries and B) aren't willing to be pushed beyond human extremes in the name of academia ... no paper is worth your life, sanity, or happiness. normalize regular work hours!!", "author": "time-2-sleep", "created": 1621895727, "upvotes": 2}, "gzbqgpq": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbqgpq/", "text": "I work crazy hours, except the thing is I am a very distracted worker. So like yesterday I could say I worked from 10am until 2 am on a project. But at the same time, I probably put in a total of 5 or 6 hours of actual work. Because I was watching hockey games, cooking dinner, chatting with friends, on reddit, on twitter, etc in between or while working. But it also helps right now that all my work is computer based, mostly data organization that can be done while watching TV, and I don't actually have to be physically present anywhere to do it except my couch.", "author": "archaeob", "created": 1621895390, "upvotes": 1}, "gzbqfow": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbqfow/", "text": "Same here. I think it's very field dependent, but because I don't have to run actual experiments and I don't work directly with anyone, I get to basically make my own schedule. I usually do roughly 9-5, and I never work weekends unless there's some kind of crunch or I'm suddenly motivated by an interesting idea. My advisor never bothers me about my schedule. As long as I'm making progress, he's happy with my work.\n\nI realize how fortunate I am; the workaholic culture of academia is prevalent, and I've even heard stories from my own department with advisors in different sub-fields. But I think it's healthy to make more time for myself, and as long as I feel like I'm progressing with this schedule, I intend to keep at it.", "author": "Drell-Yan", "created": 1621895375, "upvotes": 1}, "gzbpwoz": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbpwoz/", "text": "Lol, after the last year on top of my already abysmal work ethic, a 9 to 5 sounds insane to me... keep it up!", "author": "fake_plastic_peace", "created": 1621895114, "upvotes": 1}, "gzbnfod": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbnfod/", "text": "I am a workaholic at heart. But I burnt out hard after a few years in grad school and had to shift my habits. I’ve taken almost every weekend off in the past year and I’m almost comfortable with it. Unsurprisingly, I’ve published more and my advisor is happier with my progress than when I was a sleep deprived mess.", "author": "lkr01", "created": 1621893899, "upvotes": 1}, "gzbmlht": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbmlht/", "text": "I burnt out in my early twenties and suffered some really bad health effects. I am no longer a workaholic and am protective of my time and energy. Self is #1 (physical and mental health). Family is #2. Education and work goals are #3. \n\nHaving balance is not lazy and shame on anyone who says so.", "author": "two_moon_world", "created": 1621893488, "upvotes": 2}, "gzbmhn0": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbmhn0/", "text": "I’ll put in 40 hours per week. Maybe 50 if there is a lot going on or an experiment is being a punk ass bitch. I refuse to work more than that though. My PI is awesome and definitely one who is anti “work all day and night”. My attitude is if they want me to work more, pay me more!", "author": "Redd889", "created": 1621893437, "upvotes": 1}, "gzbjyfv": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbjyfv/", "text": "I look at it as being really efficient. I try to put in the least amount of effort with the highest amount of return, which generally means good work life balance and taking care of myself.\n\nI work full time w grad school and try to keep it like a job as much as possible. Almost had a breakdown when my gradschool class was 30 hours a week on-top of my day job. Don't understand how people can work 80 hours a week. Do you want to kill yourself? Even at my day job I try to only work about half the day, which if you read various studies on actual productivity is pretty normal. I try to put in about 4 hr of real work a day, and be available for emails and chit chat the other hours", "author": "Trakeen", "created": 1621892216, "upvotes": 1}, "gzbjeac": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbjeac/", "text": "In my experience, I've seen the folks who keep up a 9-5 for 5 years are usually the most prolific because they make the most of their time. \n\nI fall in the other category now but only because I spent several years being a 10-3 and 9-8 for 3 days of the week and then almost nothing for the other 4... so you gotta eventually make up for it someday and the 80 hour workweek seems like the only way out. But if I could go back, I'd take the dedicated 9-5 route and hope I can come to it someday.", "author": "vp1593", "created": 1621891953, "upvotes": 1}, "gzbiyj2": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbiyj2/", "text": "Another person chiming in to say you're definitely not alone!! I work about 40 hours a week, give or take depending on what's going on. I take probably 4-5 total weeks of vacation per year counting holidays, summer vacation, Fridays off, etc. Luckily I am in a lab where this schedule is the norm! \n\nI'm almost in my 5th year and am planning to graduate earlier than most in my department with an above average number of papers, and my PI is very happy with my progress, so I wouldn't say my work schedule has impacted my productivity at all. I have zero desire to work during the weekend or late at night. I'll do it if I need to, like feeding cells or meeting a paper deadline, but try to avoid it at all costs. I have no idea how people actually work 60-80 hour weeks - I would burn out so fast.", "author": "cacowaks", "created": 1621891745, "upvotes": 1}, "gzbhrtl": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbhrtl/", "text": "You aren't alone! I almost never hit 40 hours a week unless I'm in a field season.", "author": "countingmammals", "created": 1621891180, "upvotes": 3}, "gzbgz42": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbgz42/", "text": "Apparently my workload is not as bad as most grad students. Part of it is having less actual work but another part of it is that I absolutely love what I’m doing and think about it all the time. I’ve really economized data collection and writing drafts is fairly straightforward because it’s been rattling around in my head for a long time. Still I should get two first author papers out of it and get to speak at conferences. I feel guilty sometimes but it’s a relatively laid back lifestyle at the moment.", "author": "BrotherBringTheSun", "created": 1621890805, "upvotes": 2}, "gzbfyk2": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbfyk2/", "text": "On sites like Reddit and Twitter, the loudest voices are the ones who have something to get off their chest. Successes aren’t shared as often of the struggles, nor are the “I have a healthy work-life balance” posts over the posts highlighting the (often very real) toxic work environments. It’s a common social media selection bias but these sites aren’t all that representative of how the students in my program experience grad school on the whole.", "author": "WhoCaresWhyBother", "created": 1621890335, "upvotes": 3}, "gzbdqre": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbdqre/", "text": "I experienced some burnout towards the end of this last semester, I think that came from me *trying* to be a workaholic when I really am not one.", "author": "thelaughingmansghost", "created": 1621889344, "upvotes": 3}, "gzbd1cf": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbd1cf/", "text": "I feel the same way. The VA is paying for my PhD (vets message me for more details) so I don't really have to teach if I don't want to. Being in the military really honed my skills for telling people to not bother me any time that isn't between 9-5 and the weekend. Maybe I won't get as many publications or a fancy post-doc to Yale or something, but I have way more time for my personal life. If there is a *most important* thing I learned in the military it was that **No one is going to take care of you better than you can**.", "author": "Brohozombie", "created": 1621889020, "upvotes": 5}, "gzbcob0": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbcob0/", "text": "Yup! Graduating after a normal amount of years, too. And I'm kind of slow at stuff so I don't even really know how I'm graduating.. but I'm not complaining! It makes me feel bad when I see everyone talking about how overworked they are, like.. am I not working enough? But then I remember nah that's dumb, I've done the things I need to do to get the degree, so obviously I'm doing things right.", "author": "-space-witch-", "created": 1621888853, "upvotes": 5}, "gzbb2at": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbb2at/", "text": "I refused to work more than the 20 hours contracted as a graduate assistant, and if I didn't get my other work completed in the other 20 hours then it had to wait. I've kept the same approach since landing my tenure-track position. 40 hours a week, 10 months out of the year. The rest is my time, academia be damned.", "author": "Schmidty102", "created": 1621888118, "upvotes": 9}, "gzbahzm": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzbahzm/", "text": "Work smarter not harder was always my philosophy.", "author": "tequilamockingbird16", "created": 1621887861, "upvotes": 1}, "gzb91j3": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb91j3/", "text": "I’m not a workaholic generally, but I particularly decline to be a workaholic for anyone else’s benefit, such as an employer or university. With respect specifically to the latter and my graduate studies, I am clear on my obligations and I assertively call out attempts to move the goalposts at my cost. I do so confidently because I know my contributions are valuable and while I benefit from my association with my university, my university benefits even more from its association with me, my research, and my publications. Most of you are in the exact same boat, but many of you do not seem to realize that or have trouble internalizing that. I really encourage you to try because it will change your life and you deserve it.", "author": "hanawarrior", "created": 1621887189, "upvotes": 3}, "gzb8tug": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb8tug/", "text": "Yup. I finished my PhD in four years with four first-author papers (well, one technically still in review) while also somehow being a lazy piece of shit. I managed to put like 400 hours into Animal Crossing in the same 6 months I was wrapping up writing my dissertation. And before the pandemic I was partying nearly every weekend, and I'd travel a lot. I was originally only going to do a master's because I didn't think I had PhD level motivation but by year two my advisors were asking me to stay for my PhD based on my progress despite not working crazy hours. During normal times I tried to keep it as 9-5 as possible so that I could have my social life when all my non-ac friends were available. but during COVID I've gone more \"work whenever I feel like it\". So I frequently work evenings or weekends, but I also frequently don't even log on until noon or lose motivation midday and go run errands instead. \n\n&#x200B;\n\nI'm a post-doc now and still coasting on this work life balance despite what people say academia should be like.", "author": "MsAggieCoffee", "created": 1621887092, "upvotes": 15}, "gzb8nhy": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb8nhy/", "text": "I'm not. I was talking to one of my friends the other day and mentioned how, based on average life expectancy and my parents' age, I probably have 10 Christmases with them. Hopefully more, but when you can start counting holidays on two hands, it kind of reinforces the fact that your family isn't going to be around forever. I love my family and I want to spend as much time with them as possible while I still have it. When I'm in my 50's, I really doubt I'll be wishing I wrote one more paper in grad school, but I will certainly miss not being able to pick up the phone and call my mom.", "author": "False-Guess", "created": 1621887012, "upvotes": 27}, "gzb7r98": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb7r98/", "text": "Most people overestimate how much they work, and for the people who claim to be workaholics e.g. working 80 hour weeks, they're overestimating their hours more than most. There's a [Nature](https://www.nature.com/articles/526492a) paper about it.\n\nI have gone through periods of working more and less, but on average in grad school I would say it has averaged out to being 30-40 hours a week. I think it depends a lot on the field that you're in though. I have intense periods of field work for data collection vs. lab experiments. From the biomed folks I've talked to, there seems to be a lot of pressure for quick turnaround on writing papers and presenting results. That's not really the case in my field. Overall, I'm really grateful for that.  \n\n\nedit: typos", "author": "_rasb", "created": 1621886606, "upvotes": 8}, "gzb76wy": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb76wy/", "text": "Honestly? I don’t really see the point. If this is job training, then why would anyone work 50,60, 70 hours a week in grad school, when they want a job with a work life balance? Now if you want to work a ton or have a fast paced career, then have at it. Otherwise, get what you came for and exit with your sanity and your health.", "author": "Neon_Black_0229", "created": 1621886352, "upvotes": 3}, "gzb62ky": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb62ky/", "text": "I am also not a workaholic and (luckily) most of my lab and my PI are the same way. I am a vocal advocate for myself for a healthy work life balance. Everyone else in my dept and cohort are always complaining about working 12 hour days everyday and I just know I could never do that.", "author": "hippyaltaccount", "created": 1621885845, "upvotes": 2}, "gzb5ykz": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb5ykz/", "text": "I was pretty chary about my time in grad school. My weekends were my own and I basically did 7 AM - 3 PM and worked with lunch beside me.\n\nThere's no sense acting like it's a contest to see who can tire oneself out the fastest.", "author": "alvarkresh", "created": 1621885795, "upvotes": 2}, "gzb4lnu": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb4lnu/", "text": "Do not die from 'imposter syndrome' when you read about people who have no life or healthy boundaries. You probably get just as much if not more done by working proper hours and getting good sleep (which is SUPER important). There have been studies that show this. It's totally servile to wear overwork as a badge of honor. It's bad for health, and it's working towards burnout.", "author": "RuthlessKittyKat", "created": 1621885189, "upvotes": 7}, "gzb4ioy": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb4ioy/", "text": "Was the first few years in the program. Set hard boundaries for prioritizing my family and being a dad first and foremost. Still, as things moved ahead I realized how unhealthy my lifestyle was becoming. Once I decided I really had no interest in academia, I gave myself the freedom to dial things back. I'll finish up my PhD this summer and I'm less stressed than I've been in years.", "author": "SpearandMagicHelmet", "created": 1621885152, "upvotes": 3}, "gzb3h87": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb3h87/", "text": "TBH, most weeks I don't even work 40 hours. I like to think I'm efficient rather than lazy but who know.", "author": "squornshellous_zeta", "created": 1621884687, "upvotes": 79}, "gzb3gbe": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb3gbe/", "text": "I'm not really at all unless I have to be. I don't really have a set schedule, and since I started my current program I have kind of struggled at times with self-motivation when there isn't some kind of looming deadline. Now that I'm ABD and REALLY don't have a set schedule I'm concerned I might start falling behind with my dissertation, but my advisor and committee members seem to be happy with my progress so it's hard to fault myself for just kind of chilling and working at my own pace most of the time. I try to work at least a few hours every day except Sundays, but it's just....weird that I always feel less busy than just about everyone else, particularly in the last year since my courseload has pretty much evaporated. I feel like I should be doing way more, but just can't seem to find that spark to do so.", "author": "Levowitz159", "created": 1621884676, "upvotes": 11}, "gzb2mpm": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb2mpm/", "text": "Same here buddy!!!", "author": "forthegiftedamateur_", "created": 1621884355, "upvotes": 1}, "gzb1wb4": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb1wb4/", "text": "I quitted my first PhD since my former boss is an crazy workaholic and I'm so sick of that shit. \nCurrently I'm locking for a PhD fitting with a normal schedule.\nSo not a workaholic at all but nevertheless struggling to find something that fits.", "author": "pyruvste", "created": 1621884058, "upvotes": 1}, "gzb1uki": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb1uki/", "text": "Yeah I pretty much had the same schedule as you in grad school. Just ignore the people doing 60-80 or more hours per week. Your mental health will thank you down the line. As long as your advisor is happy with your progress then don't worry about having to fill every second of your day with work. \n\nOn a more philosophical level, I personally hate work in general simply because it requires me to be available at a position for 8 hours each day. I like what I'm doing as a job right now, but I would still rather not be *required* to do it every day.", "author": "AJs_Sandshrew", "created": 1621884037, "upvotes": 2}, "gzb1g25": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzb1g25/", "text": "I’m a lazy workaholic", "author": "Onion-Fart", "created": 1621883859, "upvotes": 10}, "gzaznls": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzaznls/", "text": "workaholic culture is borderline dangerous, tbh. personally, i’m disabled and i find it difficult to even work a 40 hour week but, since my illnesses are invisible, my bosses always think i’m lazy for not picking up shifts. hell, look at manga artist work culture in japan; plenty of people getting hospitalized or dropping dead from working 80-100 hour weeks. there’s no “grind,” there except grinding your physical and mental health into a pulp.", "author": "darnitross", "created": 1621883067, "upvotes": 1}, "gzazmzj": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzazmzj/", "text": "Nope im not either...finished my MS in 1 year and already more then halfway done with my MPH 1.5 years into it though....I just chug along and do have bursts of productivity but also periods of delay and procrastination but I also value my me/hobbies time and social time quite highly. I do have a full time job on top of the MPH though...so maybe some might call that workaholic?", "author": "Contagin85", "created": 1621883059, "upvotes": -1}, "gzayuti": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzayuti/", "text": "I am with you on this. Sometimes it's necessary to stay in lab longer, come in on the weekends or stay up late making slides, but I try to avoid it whenever possible. I love my science, but I also have a very rich and fulfilling life outside of lab that I very much enjoy as well.", "author": "IncompletePenetrance", "created": 1621882721, "upvotes": 41}, "gzaxj6x": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzaxj6x/", "text": "I am trying to not be a workaholic! Does that count?", "author": "AvengedKalas", "created": 1621882157, "upvotes": 0}, "gzawzmb": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzawzmb/", "text": "Was, no longer am. But I also left Academia.\n\nI definitely let my experiments take my life hostage during my PhD.    \nThe main problem was that I worked with monkeys and they benefit from a consistent schedule and many training days, so I refused to take any time off to not disrupt their training routine. In Germany you get 30 days of vacation, I have a lot of letters that I still have 20+ vacation days left and loose them off not taken by a deadline. I basically hoped to be done sooner by taking less time of (not even Sundays for while). Looking back I'm not actually sure this is true. I anyways had a fix deadline when my thesis had to be done and in the end I didn't even get recordings from both monkeys, just one. So my work anyways was unfinished.\n\nCompletely getting burned by that is one of the reasons I left and likely will never turn back. This was recently reinforced by a horrible publicating experience, where I also had to invest way too much of my free time to get everything done (since I no longer work with that PI I couldn't do it in my working hours).    \nYeah, I enjoy being lazy without having to worry about work related issues too much to every go back. In my field, getting burned out is normal.", "author": "LittlePrimate", "created": 1621881920, "upvotes": 2}, "gzawtox": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzawtox/", "text": "Yeah, I take it pretty easy compared to many graduate students in my university. I put in 40 hours weekly. Sometimes I find my work really interesting and passion/fun will drive me to 50-60 hours but that's pretty rare. I am fairly skeptical of the STEM academic job pipeline and I don't really think it would be worth it to absolutely slave away for a system that is unlikely to \"pay me back\". I spend a lot of time on hobbies and hanging out with family/friends and get a lot of value out of it. I work in robotic hardware/software so there's definitely going to be a job that will pay the bills somewhere.\n\nThat said, I don't look down on workaholics. Everyone should have the right to set their priorities as they see fit.", "author": "iliveinsalt", "created": 1621881847, "upvotes": 18}, "gzawsjr": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzawsjr/", "text": "Same here! Since my only job at this point is to maybe pump out one more paper and work on my thesis, I'm glad to say I'm not burning myself out because other people expect me to. In fact, that's the culture of academia I've been trying to push back against. The most valuable thing anyone can do, especially after comp exams and classes, is to set personal boundaries with yourself and professional boundaries with others: This includes your advisor. You don't have to state it outright with anyone, but you need to know when your body needs rest. What I don't finish one day becomes tomorrow's problem.", "author": "OfTheWater", "created": 1621881833, "upvotes": 2}, "gzaw5zr": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzaw5zr/", "text": "Compared to me, YOU’RE the workaholic, especially the past year or two.", "author": "New_Hawaialawan", "created": 1621881560, "upvotes": 31}, "gzaw1hu": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzaw1hu/", "text": "Fiance works from 11-7pm 6 days A week and no other time. Humanities though so it's a bit different.", "author": "husky429", "created": 1621881506, "upvotes": 3}, "gzavnu7": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzavnu7/", "text": "did I write this? lol", "author": "panda_rojo9", "created": 1621881342, "upvotes": 6}, "gzav9it": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzav9it/", "text": "Have you considered that different types of research are conducted differently? Some science has a lot of steps that must be done in several days. Talk to someone working with stem cells. \n\nAlso is it bad to be a workaholic if someone is taking care of themselves? I feel like we should encourage an environment to get research done, in whatever fashion needed.\n\nRather than downvote me, feel free to discuss with me. That is the purpose of reddit, not to harass people who have another opinion than you do.\n\nEdit to add: apparently you were looking for people to side with you rather than present another perspective. I will remove this after 24 hour to prevent unnecessary downvotes and make a mental note that this community is NOT for open minded folks.", "author": "sincere_eel", "created": 1621881168, "upvotes": 3}, "gzav8af": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzav8af/", "text": "This might be a stupid question, but does anyone have any tips on how to STOP yourself from becoming a workaholic? \n\nI spent my entire undergrad heavily involved in classes/organizations/research/work (literal 6am - 12 am every day) and senior year where I planned to reconnect with friends and have fun is when covid hit. I regretted it deeply and going into grad school I don’t want to make the same mistakes. Obviously I won’t be able to have as much/the same fun as in undergrad, but I would rather make strong progress without burning myself out like I did in the past. I really do want to just enjoy hanging out :)", "author": "smilingseoull", "created": 1621881153, "upvotes": 5}, "gzav4wx": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzav4wx/", "text": "These days I'm happy if I get half a day's work in... and yes, the imposter syndrome kicks my ass! That aside, I value my evenings and weekends. My PIs do too and encourage me to take time for myself, and they seem happy with my progress to date.", "author": "sophia_s", "created": 1621881111, "upvotes": 48}, "gzav2jx": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzav2jx/", "text": "My PI is a workaholic, and I resisted it for years. Then I got tired of grad school and now I'm trying to speed run the PhD. In my field that's actually possible, which is nice.   \n\n\nAlways do you.", "author": "Moseyic", "created": 1621881082, "upvotes": 10}, "gzau4gj": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzau4gj/", "text": "Results, progress, effective communication. I used to think that hard work was virtuous and that physically doing the hard work and grinding away at something was how you showed people that you were committed to it. Life experience has taught me that if you're busting your ass at something, especially in my field, that you're doing it wrong or you're doing it right but you're making money for someone else. To be honest unless you're in exceptional circumstances, you shouldn't work more than 40 hours a week because your brain needs rest in order to be productive during your working hours. The people in my lab who grind and grind aren't in better standing than me and some of them are in worse standing. Our advisor doesn't give a shit how long we work, he just wants us to get the results that we can publish.", "author": "erehin", "created": 1621880688, "upvotes": 27}, "gzatczb": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzatczb/", "text": "I have been an overworker all my life, but I had a baby right before grad school and there was this whole global pandemic thing. Both of those events forced me to change my habits, and I now work 30ish hours a week and spend the rest of the time caring for my little one so my partner can work.\n\nI was amazed to find that I could be successful with that kind of schedule. My research actually goes better when I give it 5 daily hours of my best self rather than trying to squeeze out 8-10 hours of mediocre effort. I simply have better ideas when I'm well rested. \n\nMy advisor told me she's happy with my progress and doesn't expect any more out of me, except for big pushes around important conference submission deadlines. I still struggle with guilt over not working hard, but by any external metric this schedule is really working for me.", "author": "bandrus5", "created": 1621880366, "upvotes": 122}, "gzasy9y": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzasy9y/", "text": "Me. I can barely focus when deadlines are coming up, I can't just read or research or work all damn day let alone my life I'll be working after graduation, I want to at least enjoy some of my life before then.", "author": "thecrimsonfucker12", "created": 1621880184, "upvotes": 6}, "gzaswti": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzaswti/", "text": "When I took classes, worked as a TA and did research, I typically worked around 30-35 hours/week. Now, working solely as an RA, I don't exceed 20 hours/week.", "author": "n1ck6667", "created": 1621880165, "upvotes": 29}, "gzas4we": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzas4we/", "text": "Yes, me too. We need to normalize this. So much of the 80-hour week grind isn't because there actually needs to be that much work done. It's just that people think they need to do that to keep up and do way more than necessary. If everyone just collectively decided that's not appropriate, we would all be better off.  It's not lazy, it's human. My weekends are sacred and I do not work on them.", "author": "sagesteppe", "created": 1621879821, "upvotes": 154}, "gzar8ob": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzar8ob/", "text": "I personally hate workaholic culture and tend to be pretty insistent on keeping my workload <=40 hours most weeks (since before big deadlines I sometimes wind up with up to 60 hour weeks). I'm very lucky to be in a department where TA duties are fairly relaxed and pay is acceptable (which I know contributes to many grads' need to work beyond otherwise reasonable bounds). But yeah you're not alone, it sometimes feels alienating to establish a firm work-life boundary because academic culture doesn't always support having one (and it certainly is a privilege to be able to do so).", "author": "acid_zaddy", "created": 1621879429, "upvotes": 179}, "gzapzor": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzapzor/", "text": "ME, I am not a workaholic at all and it feels pretty bad since basically everyone in my lab and my PI is one.", "author": "knowuow", "created": 1621878885, "upvotes": 338}, "gzanzbd": {"link": "/r/GradSchool/comments/nk3d7f/anyone_else_not_a_workaholic/gzanzbd/", "text": "[deleted]", "author": null, "created": 1621877991, "upvotes": 15}}}