{"sid": "o44pe4", "link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/", "title:": "If 'Mastering Out' of a PhD is an option, why wouldn't every MS student start as a PhD student?", "text": "PhD Pros:\n\n* You could still get a full PhD if you really enjoy your program\n* You actually get paid (instead of paying the school)\n* You could always just leave with a masters\n\nPhD Cons:\n\n* Lower Acceptance Rate\n\nSo even if one was only interested in a master's degree, why wouldn't the default be to pursue a PhD program with the intention of mastering out, unless/until the prospect of staying becomes highly compelling?  \n\n\nUpdating after discussion: \n\n* You might be *taking the opportunity* from somebody who actually wants to see their research through. But then again, you might decide that you like living at college, love your research, and want to stick it through yourself\n* You're sort of exploiting the system, but at the same time, the system itself is a bit exploitative, so maybe you have the right to be Machiavellian\n* Unless you're absolutely sure that you don't want to see a doctorate through, starting as a PhD student gives you more optionality either way\n* Canada seems to do everything more reasonably  ", "author": "Von_Rommel", "created": 1624192280, "retrieved": 1632954458, "over_18": false, "upvotes": 280, "upvote_ratio": 0.94, "comments": {"h2i71lg": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2i71lg/", "text": "This definitely depends on your field and specific policies at your department, but outcomes and training might not look the same if you’re enrolled as a PhD student intent on mastering out vs. enrolled as a master’s student. \n\nFor example, in my department (biostats), the degree is different (MA for mastered-out PhD students vs MS for students who came in on a master’s) and it would be easy to tell at a glance (if one is honest about the degree name) the difference. There are also separate classes, which the doctoral-level classes being more theoretical and the master’s level classes being more applied. It’s not a difference of the doctoral-level classes just having additional work—they straight-up have different curricula and you would not walk away from the courses with the same practical abilities. After two years in the PhD program and mostly done with my coursework, I would say that I’m very much *not* qualified through my coursework to do a lot of master’s level work in industry; our department designed the PhD coursework to be deliberately different.", "author": "aggressive-teaspoon", "created": 1624250113, "upvotes": 3}, "h2hwewd": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2hwewd/", "text": "It is a common thing in HBCUs. HBGI grants + stipends, meant for doctoral students, are not that difficult to obtain, so they get in on a doctorate, finish coursework reqs, pass quals, then withdraw. Our departments complains about it constantly.", "author": "thisisbasil", "created": 1624243591, "upvotes": 1}, "h2hm2e9": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2hm2e9/", "text": "In my field (STEM) research, mastering out isn’t ideal and usually means a student couldn’t complete their project for various reasons. It can be a red flag if you ever decide to go into a different PhD program or during job applications/interviews.", "author": "am_crid", "created": 1624237957, "upvotes": 2}, "h2hj8hn": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2hj8hn/", "text": "I wanted to do a master’s first to make sure I liked my research topic (I was making a major field change), because I missed the deadlines for the top schools that I’d want to graduate with my PhD from, and because I really wanted to take a gap year after my master’s. I did the master’s in the end, and now that I’m just about done, I wouldn’t go back in time and do it any differently. I did get to take a gap year (just started that) that turned out better than I could have ever imagined, and I want to switch topics and schools for my PhD. I’m much more prepared for a PhD now, and my application will be much stronger.\n\nI was quite lucky to get a fully funded master’s at a top school for my field, so there was no downside to doing it first. But when I decided to get my master’s, I did not know I’d get full funding at this school. I did know I would at least get full funding at my undergrad institute, though it was much lower ranked and not specialized in my area of interest. If I ended up taking that route, I’m not sure I’d come to the same conclusion I have now - that getting a master’s first was worth it.", "author": "cracrag", "created": 1624236355, "upvotes": 2}, "h2hfxcr": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2hfxcr/", "text": "Everything is set on a different schedule for phds so you wouldnt be working quickly enough at the right pace and it would probably take you way longer to graduate than needed. Also you have to like... get accepted into the phd lol. And then theres the issue that there are often different requirements and youd be doing unnecessary work. I'm not about to take comps for no reason.", "author": "bi_smuth", "created": 1624234472, "upvotes": 3}, "h2hdtet": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2hdtet/", "text": "a lot of folks who do MS programs in the US do it to fill in the gaps in their undergrad education and in case they didn't have great grades they can get an extra chance to improve there and to do research.", "author": "caug37", "created": 1624233241, "upvotes": 3}, "h2hasf0": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2hasf0/", "text": "I can only speak for myself, but in my case it was a pretty necessary step. I wanted some research experience and some graduate level classes to sort of test the waters to ensure I want to continue onto a PhD. I am not the sort of person that could have committed to a PhD without doing the MSc as a trial run for grad school. I've decided that I would like to go on of course, but I'm not sure at the end of my undergrad that I even felt prepared and qualified to start the MSc. Sometimes the 2 years of a masters can be more about personal growth than serving some academic need.\n\nAlso, in my particular case, my MSc is designed to hone in on a more particular branch of my field, as my BS is in physics, but my MSc will be in geophysics.\n\nAs a result of this, I will have a Masters to my name, and a much nicer CV with solid research, and a TA position, among other things, attached to my PhD applications as a result. Your mileage may vary of course.", "author": null, "created": 1624231486, "upvotes": 2}, "h2has7t": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2has7t/", "text": "In my program if they find out somehow your intentions were to only get your masters but you came as PhD track, you could have to pay for the credits you took up to that point. How they'd know? I have no idea.", "author": "Its_Just_Jen", "created": 1624231483, "upvotes": 2}, "h2hac31": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2hac31/", "text": "Blood money", "author": "Grampyy", "created": 1624231234, "upvotes": 1}, "h2h9ibz": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2h9ibz/", "text": "Funny enough, I actually planned on joining a PhD program and mastering out for the reasons you outlined. Ended up staying because I really liked the research/lab. Accidentally became a Doctor. Woops. \n\nActually have a few friends that did something similar. Might be why schools keep this \"loophole\" around.", "author": "dimapitt", "created": 1624230774, "upvotes": 3}, "h2h771j": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2h771j/", "text": "The answer is you can’t really on the same timeline. G2 you’re barely past quals, so the program isn’t gonna give you a masters to leave that fast. At minimum it’d take another yearly. \n\nIn addition, at least in my case, my PhD program doesn’t have a separate masters, so the masters degree you’d get just signifies “you did a PhD for a bit but didn’t finish. I’m not sure how much added value that gives you over not doing the degree, or in comparison to what you could’ve done in that time.", "author": "jlpulice", "created": 1624229488, "upvotes": 2}, "h2h50b6": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2h50b6/", "text": "It's not just that there's a lower acceptance rate, you're evaluated on different things. It's more like going for a job listing than undergrad/master's admissions. They're investing in you rather than you paying, so a major factor in admissions is showing you're committed and a good investment. If you have zero interest whatsoever in a PhD and just see it as a cheap way to get a master's (which frankly isn't worth much in most fields), it's going to be hard to bullshit to your recommenders and the professors that interview you.", "author": "mediocre-spice", "created": 1624228283, "upvotes": 2}, "h2gx0e5": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gx0e5/", "text": "In the US we don’t pay masters students; they have to pay to be there.\nPeople who want to master in pay into the system.\nPeople who leave a PhD with a masters are probably seen as a lost revenue opportunity.", "author": "TheEvilBlight", "created": 1624224084, "upvotes": 3}, "h2gui74": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gui74/", "text": "My school only has the option to get a master's in my field (physics). It was the only one I got accepted to. I'm not a terrible student, I just applied to a handful of schools. Then Covid happened, and the schools that were still looking over applications stopped accepting new students. I'll get a PhD once I'm done", "author": "saor_alba17", "created": 1624222806, "upvotes": 2}, "h2gtxax": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gtxax/", "text": "Cause this is only an option in a few countries. Almost all european countries require having finished a (research) master before you're applicable for a phd position. Moreover, you're hired and do the phd as your job, so there are not that many positions.", "author": "doornroosje", "created": 1624222507, "upvotes": 2}, "h2gl1lu": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gl1lu/", "text": "I don't want a PhD. They're different programs. Especially if one is not becoming an academic.", "author": "RuthlessKittyKat", "created": 1624218280, "upvotes": 1}, "h2gkq0h": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gkq0h/", "text": "Isn’t it more difficult to be accepted to a top PhD program than masters program at the same school? That’s just one reason I can think of.", "author": null, "created": 1624218110, "upvotes": 4}, "h2gh6jg": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gh6jg/", "text": "I could ask you the reverse, why don't PhD students start as MS and after 2 years decide if they want to keep researching. This will give those who end up hating it an out before fully committing.", "author": "AlexaTesla", "created": 1624216262, "upvotes": 7}, "h2gh56c": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gh56c/", "text": "You run the risk of burning bridges when mastering out and for some, that alone is not worth the risk. Personally, I prefer for my advisors to know my plan so that they can help me get the most out of my education.", "author": "TheVillageOxymoron", "created": 1624216242, "upvotes": 2}, "h2gf5a9": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gf5a9/", "text": "Another point I haven't yet seen: a MA is not always valuable in certain fields. A MA in certain areas of study does not necessarily get you very far in every field despite a PhD opening up more opportunities, particularly because some careers really prefer to see more professional masters degrees rather than a typical MA you would get \"along the way\" during your PhD.\n\nFor example, a MA in political science actually doesn't get you much. In undergrad, I was told that the typical advanced degree tracks for political science majors were to get a MA in Public Admin, Public Policy, International Relations, etc. (a \"professional\" degree) or to get a PhD if I wanted to go the academic route. A MA in political science is a stepping stone to the PhD, and most related careers would prefer to see a professional degree like listed above rather than a MA in political science. So mastering out in some fields may get you a masters degree, but that masters on its own may not be as valuable to you as a masters from a more specialized, separate degree route that you could have gone.", "author": "junemoon21", "created": 1624215211, "upvotes": 6}, "h2gasct": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gasct/", "text": "Another consideration is that not everyone is competitive for PhD admissions. There are a certain number of spots for PhD students. Already, at least in my field, the vast majority of Master's students would not be competitive for the slots that exist. Increasing applications (because Master's applicants apply to PhDs instead) would certainly not help. And spending time prepping to get into a more competitive program *that you don't actually want to do* is a waste of time-- potentially years of time.", "author": "intangiblemango", "created": 1624212984, "upvotes": 6}, "h2gaqsw": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2gaqsw/", "text": "The PhD program isn't going to want to accept people with an intention of mastering out. They want it to be a rare and somewhat random event. So you'd have to be pretty convincing and a good liar.", "author": "comedybingbong123", "created": 1624212963, "upvotes": 2}, "h2ga3cc": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2ga3cc/", "text": "For my country and field (Canada STEM)\n\n* Often a Master's is a prerequisite for a PhD.\n* PhDs progress at different scales than Masters (for example you can spend a full year or two before starting experiments in a PhD.\n* You can often transfer from a Master's into a PhD (from what I've seen it typically adds 1 year to the PhD).\n* PhDs are a lot more paper focused, while Master's students aren't always interested in publishing.\n* Funding and responsibilities are different for both programs.", "author": "half_a_lime", "created": 1624212639, "upvotes": 1}, "h2g8u9k": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2g8u9k/", "text": "A Master's program might accept 100s of students, the corresponding PhD program might accept 25 students. Also you need significant research experience to get into a PhD program.", "author": "roonilwazlib1919", "created": 1624212002, "upvotes": 3}, "h2g56b7": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2g56b7/", "text": "If your employer is willing to pay for your graduate education and you had no desire for a doctoral degree, then why would you pursue a Ph.D. program first?", "author": "BourbonCoug", "created": 1624210248, "upvotes": 3}, "h2g4quh": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2g4quh/", "text": "From my point of view, the biggest reason not do is it feels morally wrong. You're wasting the professors time if you know you're going to leave with just a master's and you're taking a spot from someone who truly wants to do a PhD.\n\n I understand that some people decide that a PhD isn't for them after trying it out and leave with just a masters and that's totally fine. But to start a PhD with a plan to leave after a master's seems incredibly uncool and wrong.", "author": "koalabur", "created": 1624210036, "upvotes": 4}, "h2g2ydv": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2g2ydv/", "text": "Way easier to get in as a Masters student", "author": "doyouevenIift", "created": 1624209170, "upvotes": 3}, "h2g04og": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2g04og/", "text": "Yes, I planned to get an MA, dept chair told me to apply for PhD. Here I am", "author": "isaac-get-the-golem", "created": 1624207787, "upvotes": 2}, "h2fxjs8": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fxjs8/", "text": "For me, 100% getting the opportunity to take on a PhD. My PI wants to retire soon and didn’t want to take on a fresh PhD student.\n\nYou can often turn your masters into a PhD, and often PhD is an over qualification that will exclude you from jobs you might want.", "author": "wildlife_bee", "created": 1624206547, "upvotes": 4}, "h2fwhpg": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fwhpg/", "text": "One of my professors legit suggested we all do this lol", "author": "gendertreble", "created": 1624206021, "upvotes": 9}, "h2fvwtg": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fvwtg/", "text": "Terminal masters tend to be treated with more credibility, and some programs require a masters before PhD work. As others noted, it can also be a fraught experience and may potentially sit poorly with your peers and record. This seems especially true in the humanities based on experience, but I honestly don't know widespread that is.", "author": "Joe_Meursault", "created": 1624205728, "upvotes": 3}, "h2ft75e": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2ft75e/", "text": "From my own experience, this is the exact advice I would give to someone. Take the Ph.D. funding, tailor your coursework, and then see if it's worth continuing. Worst case, you get your Master's paid for and then move on. My field specifically might be structured for this route better though, since I see some people saying it's less possible in their respective fields. \n\nI would also add one note about the \"dishonest / dick move\" mentality. Grad school, in a lot of ways, is already exploitative. Doing what you need to do to put yourself first at the cost of a university's endowment is not the crime some of y'all think it is.", "author": "Pretrise", "created": 1624204347, "upvotes": 4}, "h2fs0da": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fs0da/", "text": "This was exactly the advice I always got about grad school for my field. I wasn't sure if I wanted to do a full PhD but everyone I asked said to apply anyway and either Master out or stay the course. The only forseeable reason to pay for a degree rather than get paid to earn it is if there's something at a certain highly specific program that you can't get anywhere else, and they also don't take on PhD students or something. It has to be worth not just the tuition cost but the opportunity cost of not making money those 2 years.", "author": "quoththeraven929", "created": 1624203738, "upvotes": 5}, "h2frw51": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2frw51/", "text": "I think it really depends on the field. I sought a terminal masters exclusively for several reasons that included having no desire to have a career in academia (it was advised for my field to not bother unless I wanted that or government path). I also had the desire to have more focused attention from faculty - if they're more invested in their PhD students who may be future academia collegues I wouldn't be taken as seriously. There were other factors, but these were both huge for me in determining which programs to even apply to. I'm very glad I made the terminal masters choice because it was a struggle for me to finish, and I personally *needed* it to feel like an accomplishment after delaying so long rather than feeling like a failure at getting a masters.", "author": "dorothysideeye", "created": 1624203678, "upvotes": 3}, "h2fpdmy": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fpdmy/", "text": "At major universities (at least big state universities), they typically won’t accept masters students. They may technically offer the degree, but no PI wants to waste the resources on a student who be gone as soon as he’s trained.", "author": "FeistyHelicopter3687", "created": 1624202374, "upvotes": 3}, "h2fokwl": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fokwl/", "text": ">\tYou actually get paid (instead of paying the school)\n\nIn my field, a large amount of Masters students get paid too.", "author": "Reverie_39", "created": 1624201952, "upvotes": 2}, "h2fnol0": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fnol0/", "text": "I mastered out of my PhD and I did get the pros you mention (primarily that I got paid, not paid tuition) but because it wasn't my aim at the beginning, my efforts were not optimized towards finishign the masters-portion of my PhD as quickly as possible. Therefore it took 3.25 years to get a masters instead of the 1.5-2 years it usually takes, and I did a LOT of work for my dissertation that ended up being a total waste of effort. \n\nOf course, if I was planning on mastering out from the beginning I could have avoided that, but I think in that case, it would have been obvious what I was doing and I may have been kicked out.", "author": "iammaxhailme", "created": 1624201475, "upvotes": 50}, "h2fno66": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fno66/", "text": "Because some don't qualify to be PhD. It's the same reason why all squares are rectangle but not all rectangles are squares. They are similar but one does not qualify you for the other. There are also greater commitments for hiring a PhD then hiring a masters, and needs to be accounted for.", "author": "discount-doubledoink", "created": 1624201470, "upvotes": 33}, "h2fnnke": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fnnke/", "text": "Because that's what some people would call a \"dick move\".", "author": "eng2016a", "created": 1624201461, "upvotes": 13}, "h2fnix6": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fnix6/", "text": "Mastering out doesn't reaoly exist outside the US and, for the most part, you can't start a PhD without a master's outside of the US", "author": "ArguablyCanadian", "created": 1624201393, "upvotes": 16}, "h2fnix3": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fnix3/", "text": "Mastering out is not an option at every university, nor every program. But if you think you are interested then by all means do it.\n\nThere is far less stigma away from academia for mastering out btw. But there is a bit of high brow attitude in the ivory towers on this topic. Like figuring out what you want to do with your life is a bad thing. People suck everywhere.", "author": "wondert", "created": 1624201393, "upvotes": 9}, "h2flqph": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2flqph/", "text": "schools usually allocate more funding for phd students. \n\nTheres also the cool-ness factor. If your phd is funded you can relocate to another state or city. For a masters you are usually still taking out loans unless you got an ra/ta ship.", "author": null, "created": 1624200464, "upvotes": 1}, "h2fkkf8": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fkkf8/", "text": "In my case I went for the masters in Mol bio pretty thoughtlessly, I just wanted to graduate early from my bachelor's and move to a city that didn't offer a PhD at any of its local universities. It worked out nicely because now I'm getting a European PhD and having a masters is a requirement.", "author": "erehin", "created": 1624199848, "upvotes": 1}, "h2fkfes": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fkfes/", "text": "In my field, doing a Masters and then a Ph.D. is the norm. You will be very hard pressed to find a PI who is willing to take you on as a doctoral student straight out of undergrad (let alone a department that will do it). Granted I'm speaking exclusively w/in the US. Not sure if that's the case in other countries.", "author": "BrownBear_96", "created": 1624199775, "upvotes": 18}, "h2fijsb": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fijsb/", "text": "Just to add a couple other thoughts: I know some PhDs are full time whereas Masters can be more flexible and part-time. It depends on the degree but if, for instance, you have a full time job, mastering out of a PhD would be tough. Also, some PhD programs have requirements near the beginning that would be a waste of time for someone mastering out", "author": "Palex9", "created": 1624198788, "upvotes": 17}, "h2fickp": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fickp/", "text": "Honestly it just comes down to acceptance rates and extra work. It’s harder to get into a PhD program and they have less seats. They typically are given to people that want to finish, but there are some who will master out.\n\nTypically for a PhD program to be awarded a stipend (or free) you need to do some sort of work for the university, wether that is through TA or RA responsibilities. These are not required for many masters programs and often your obligations are mainly class. This of course doesn’t outweigh the cost of a masters program tuition, which is why people choose to “masters out” of a PhD program instead. \n\nI have met people that have openly admitted to joining for this very reason. Although it is a bad look, there’s nothing stopping you. If I were to do it I wouldn’t tell anybody about it.", "author": "scientist99", "created": 1624198682, "upvotes": 57}, "h2fi73q": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fi73q/", "text": "A couple of reasons: \n\n1. A master's degree and the first two years of your PhD are not the same education. At then end of the master's degree you have learned the skills that you went in hoping to learn (assuming you took your education seriously). At the end of the second year of your PhD, you've completed some classes and got some lab experience, but the skills you've learned might not be comparable to the terminal skills focused on in the Master's. \n\n2. It's very field dependent. For my degree, I knew I needed the PhD and just straight up skipped the master's to save time. Not every field will do that, and not every field needs a PhD. \n\n3. Stigma. There's a HUGE stigma against Mastering Out. Peer pressure is real and keeps people going longer than they should. Plus, bailing on your PhD can be really detrimental to your future opportunities. It very much depends on each specific situation. I've seen people master out because they realized they hated academia and the terminal PhD just wasn't worth it. I've also seen people master out for mental health reasons. These are generally viewed as fine reasons. But, if I found out one of my students joined the program with the intention of mastering out after two years, I would be livid. Especially if they were funded by our lab's grants. Its just highly unethical.", "author": "kitzdeathrow", "created": 1624198599, "upvotes": 130}, "h2fajm9": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2fajm9/", "text": "My experience - at a Canadian university, in a STEM program - was that MSc students were paid a stipend only slightly less than the PhD students.\n\nAll students entering my program without a prior master's degree were admitted to the MSc program, and were expected to transfer to the PhD program within two years if they wanted a PhD. (The transfer oral exam served essentially the same purpose as a PhD qualifying exam.)\n\nIt meant that students who didn't like their project, their supervisor, or the academic world had a straightforward off-ramp, without spending four years spinning their wheels. Students who decide to go ahead with their PhD don't lose time writing an MSc thesis, and have a pretty clear idea of what they're committing themselves to.", "author": "cryptotope", "created": 1624194360, "upvotes": 278}, "h2f8f77": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2f8f77/", "text": "Not every program has a mastering out option and doing two separate degrees at separate institutions is generally a good idea.\n\nAlso, many MS programs pay you as a Grad Assistant. So saying “you actually get paid” is definitely not applicable to large number of people. Both of my grad departments fund MS students, as did every single one I applied for.", "author": "wxnick10", "created": 1624192942, "upvotes": 122}, "h2f8df3": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2f8df3/", "text": "One it is dishonest in an “industry” that demands honesty. \n\nTwo if you actually wanted to pursue a PhD next it would make it harder since letters of rec, reputation, etc may be more challenging.  I have seen serious retribution from folks trying this…", "author": "b_ro_rainman", "created": 1624192908, "upvotes": 47}, "h2f8bjp": {"link": "/r/GradSchool/comments/o44pe4/if_mastering_out_of_a_phd_is_an_option_why/h2f8bjp/", "text": "Sometimes “mastering out” means an MA instead of an MS, but also, you burn a lot of bridges.", "author": "RoyalEagle0408", "created": 1624192871, "upvotes": 70}}}