{"sid": "lw87u6", "link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/", "title:": "Remember undergrads are people too", "text": "I’m a TA and I started to notice a downward trend in a students performance and decided to reach out to them. Turns out her father was dying, but because he had been sick for so long she didn’t feel like she could ask for help. I immediately spoke with the professor of this class and we worked together to extend deadlines and make the class more manageable for them. I know grad school is a busy time but don’t forget that undergraduates have difficult times too. Just like we are sometimes afraid to talk to our advisors they are afraid to talk to us\n\nWow guys, thanks for the upvotes and awards. To those of you have shared your stories, thank you. Also, I am deeply sorry for any of you that had a terrible experience with your TA or professor. No one should ever have to deal with that and yet it seems to have been normalized. I hope that this will change", "author": "coops389", "created": 1614707817, "retrieved": 1632845157, "over_18": false, "upvotes": 1637, "upvote_ratio": 0.99, "comments": {"h2a8bpt": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/h2a8bpt/", "text": "Thanks for being trauma informed. I feel like my background in education and working with high schoolers made me all the more ready for supporting them when they transition to college. Unfortunately, I think there is too much gatekeeping and replication of THE instructor that made college tough for some as the benchmark for \"teaching.\" \n\nWhenever I have student go radio silent (either r not showing up, or not submitting assignments) I message them simply with... \"Hey I noticed _________. Is everything okay?\" \n\nWe gotta ask ourselves, \"What is happening to this student?\" ... NOT \"Whats wrong with this student?\"\n\nI also make it clear that I don't need details. Seriously. The types of things students have disclosed to me for fear of not being believed is bothersome. That shouldn't be necessary.\n\nAnd now that we are looking at undergrads as humans, I'll add my final 2 cents about late work and punitive measures. Might be an unpopular opinion, but I don't deduct points for late work. What are you measuring compliance to rules or comprehension of material? For me, I let students know for however long it takes for them to submit something is how long I'll give myself to grade it. Those students that are in a lull and need support will follow through beyond the bad week they had. The students that just don't turn things in, will continue to not turn things in. \n\nThats my PSA. We teach people, not content.", "author": "skidmark_whalburgerz", "created": 1624071070, "upvotes": 1}, "gxn6ej9": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gxn6ej9/", "text": "This is such a great post and I upvoted as well even though I’m many days late on this post. I will be graduating with my bachelors degree this weekend so I’m very happy!\n\nWith my personal experience, I was diagnosed with gerd and Barrett’s esophagus a couple months ago, but I had symptoms over a year. Symptoms of sternum pain can be unbearable at times which I still need to find out if gerd is causing all of this. My last 2 semesters of my undergraduate I asked the school if I can do everything virtually due to the pandemic and fear of getting sick with a preexisting condition. Some teachers understood my problems and stated they will give extra time and some professors just graded harshly regardless of your problems, but all in all I’m still graduating so it didn’t matter.\n\nMoral of the story is, as teachers we should try to understand what the student is going through as we are all human and should be sympathetic or empathetic towards others. I already signed up for my masters and got accepted online through Grand Canyon university but will see how my health issues hold up. I do one day want to work in college or work in the government and will always have in mind to always try to understand the other person before judging or giving them a grade. Thanks for the post again!", "author": "Santizzo91", "created": 1620674601, "upvotes": 1}, "gqwvd9m": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gqwvd9m/", "text": "As someone who had many chronic health conditions and was not allowed to retake an orgo exam that I had a grand mal seizure during and left in an ambulance, I really appreciate this post", "author": "coco_new", "created": 1615741410, "upvotes": 1}, "gpk4dqs": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpk4dqs/", "text": "I want to share my experience in regards to dealing with professors when I had personal issues going on during my undegrad:\n\nAbout 3 years ago, my mom (may she rest in peace) was dealing with cancer and every school day, I would drive directly from my university to the hospital (30-40 minute ride minimum).  I was struggling to balance school work and dealing with my mom's declining health situation.  I recall specifically that I told one of my professors about my mom's situation and at the last week on Finals, I asked him via email if I could turn in all the work that I missed out on.  During my section's final exam, he read my email out loud (not saying my name).  I was so shock that someone would do something like that and I couldn't focus on my exam.  After I handed in my exam, he says \"Hey [name], it was a pleasure having you in my class\".  I didn't respond.  \n\nThat same semester, I fell behind on the final project for another class (even though I turned in all prior assignments on time, would often ask for his help during class and office hours, and did well on them).  During class, I hear him talking to another student and from their conversation, it sounds like she had a family issue at home and he seemed to be understanding about giving her extra time to turn in her work.  I ask him for additional time on my project and he tells me to come with him to his office.  He doesn't ask me about my situation at all.  He proceeds to yell at me very loudly and says \"oh, too busy slacking off at on your vacation?\" (I didn't show up to class some days because I was trying to catch up on work while taking care of my mom).  I just didn't say anything and gave into whatever he was saying because I just wanted to finish this project and pass the class.  \n\nI think I posted about this in the past on my school's subreddit and some people don't seem to care and they always try to defend the professor's side.  But professors are capable of being unreasonable and being unempathetic.  Some people don't understand that.", "author": "NoBrightSide", "created": 1614794405, "upvotes": 2}, "gpjo9yk": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpjo9yk/", "text": "TAs are the true MVPs. I always loved my TAs", "author": "RadGrandpaDragon", "created": 1614787532, "upvotes": 1}, "gpjee4l": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpjee4l/", "text": "yesterday an undergrad emailed my PI, the chair and the dean requesting that i be fired (or at the very least barred from grading her work) because she failed an assignment where she *literally* answered everything wrong and I still gave her a 40% so it wouldn't be impossible for her to come back from", "author": "funeralssuck", "created": 1614783110, "upvotes": 1}, "gpjdsg6": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpjdsg6/", "text": "I totally agree. I'm at a large university, and among some of the student body I think they assume that profs are too busy to care so they don't bother explaining their difficulties. I think  caring is one of my largest roles as a TA, since we need to create a culture where undergrads feel comfortable talking to us when they need some extra grace extended to them. \n\nI was teaching a lab with an outdoor field component, and one of my students showed up an hour and a half late. He didn't say a word, just joined up with the group as we walked around. I took him aside and asked him what was up, since I knew he had a son and family, and it turns out his car had been impounded and he wasn't able to get it back for another week or two, so he was taking the bus and walking everywhere (we don't have a great bus transit system). To this day I get sad that he didn't feel comfortable enough to communicate with me so we could work something else out. \n\nOf course there's always the whiners who stayed out late partying and slept through my class. I don't have time for that ;P", "author": "selkie340", "created": 1614782830, "upvotes": 1}, "gpipgpg": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpipgpg/", "text": "I have complete respect for undergrads. I've seen grad students who are worse than undergrads, and grad students know better.", "author": "mymatrix8", "created": 1614766009, "upvotes": 2}, "gpie2tx": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpie2tx/", "text": "The only TA that I remember and forever will remember is the one who reached out to me after seeing I hadn’t turned in one of our main essays. She asked if everything was okay. I remember just breaking down because I felt like no one had cared up until that moment and I was going through a really difficult time. I truly think academia would be a different place if TAs and professors were more like you and her. Thank you so much for this. You made a huge impact on that students life.", "author": "cinnamondolcelatte19", "created": 1614755401, "upvotes": 1}, "gpi4s1x": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpi4s1x/", "text": "I’m so grateful for TAs like you. Thank you so much", "author": "lovemoontea", "created": 1614748457, "upvotes": 1}, "gpi2xo4": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpi2xo4/", "text": "You are a good person. Thank you.", "author": "abuhamza23", "created": 1614747252, "upvotes": 1}, "gpi1fxt": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpi1fxt/", "text": "In our country, the educational system is really toxic. Some (not all) TA/instructors/professors are really toxic. During online classes, they would even humiliate students who answered wrong during recitations. They would even say bad words and the most discouraging words. These people do not know the meaning of \"undergrads are people too\". But at some point, I also get them, that they just want us to exert effort and bring out the best in us. But, they are just really harsh, to the point that they demotivate students, instead of providing encouragements :(( . I hope more educators are like you.", "author": "Psychological_Sign42", "created": 1614746329, "upvotes": 3}, "gph73tm": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gph73tm/", "text": "When I was an undergrad at some point (I kind of dropped out and then went back a few times before finishing my degree), I had a lot of severe mental health issues. I'd barely show up for classes, and if I did, I couldn't focus, etc. My quiz/test scores were pretty abysmal (until I finally went back to college and finished my degree, by which point I was doing well and even taking grad classes as an undergrad).\n\nMy own experience taught me to not immediately judge the students who turned in shoddy work, or who never did the readings, or who had terrible class attendance. When I was a TA earlier in my grad school career, there was a student I could tell was dealing with a drinking problem. Another student was a veteran and had a lot of frustration directed towards having to take the introductory course I TA'd for. I mean, he literally wrote \"this is bullshit\" on the final exam. You could tell he was a deeply unhappy and angry person. Students who seem to not give a fuck still get under my skin, but I try to remind myself that perhaps, they are struggling a lot in ways I'll never know. I don't inflate grades for students who I suspect are troubled or anything, but I do try to not just dismiss them as bad students. You never know what people are going through.", "author": "vapemistake", "created": 1614730343, "upvotes": 5}, "gph4ksc": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gph4ksc/", "text": "So many people in my teaching cohort that started last fall are immediately acting like their petty professors they've complained about and it's super disappointing to me to see. There's a real \"pay it forward\" mentality among professors, apparently.", "author": "Naxek", "created": 1614729050, "upvotes": 3}, "gph3rt4": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gph3rt4/", "text": "I'm definitely afraid to talk to my advisor :(", "author": "Lady_of_Ironrath", "created": 1614728636, "upvotes": 3}, "gpgwtwg": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgwtwg/", "text": "I had a similar experience last semester, one student hadn't been attending labs or submitting any assignments, she missed 3 in a row, so I emailed her to remind her gently that if she misses one more lab she fails the class. She emailed me back to tell me that she had moved back to China, had to quarantine in a hotel that had spotty  internet and couldn't access a lot of the websites required to complete the material, got Covid during her quarantine, and had to be admitted to the hospital. She was so panicked and sent me pictures of her hospital room and chinese medical documents (that I obv couldn't read).. but I worked with her, and graded all her late submissions because that felt like the right thing to do, and she was really grateful.", "author": "pyritepyrate", "created": 1614725177, "upvotes": 5}, "gpgujmv": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgujmv/", "text": "Had a similar experience recently as a TA. Student stopped attending zoom lectures and when she didn't turn in an assignment, I emailed to ask how things were going. Turns out she was physically sick with probably covid, *and* she was trying to get a medical leave for depression but the university wouldn't let her without kicking her out of her housing. \n\nCurrent times are incredibly tough for undergrads. It's tough for me too, but at least I can go into lab and have some sense of structure and progress.", "author": "peregrination_", "created": 1614724083, "upvotes": 11}, "gpgt4ty": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgt4ty/", "text": "U mean like without sexual favors? What is this, community college?", "author": "RhythmofChains", "created": 1614723414, "upvotes": -21}, "gpgo4p0": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgo4p0/", "text": "As an undergrad/prospective grad student, thank you so much for recognizing this. There have been a few times during my degree when a TA gave me a little leniency or reached out to make sure I was okay, and it made such a difference.", "author": "YourLocalBi", "created": 1614721172, "upvotes": 8}, "gpgj1mh": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgj1mh/", "text": "As someone who is looking into labs, one of the more interesting things is how I see certain labs treat undergrad students. Some see them as \"helpers\" to the doctoral and post-doc students. Others give them their own independent projects. It has been interesting to see.\n\n&#x200B;\n\nRegardless, I will start as TA in the fall when I begin my PhD. I will follow your example. It is important people can ask for help. We were all once undergraduate students.", "author": "philliesdude1", "created": 1614718989, "upvotes": 24}, "gpgi64l": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgi64l/", "text": "I agree with you, and I think this is something professors need to be reminded of more than grad students, in my experience. \n\nI dealt with a couple similar situations. One student disappeared for two weeks, which prompted me to reach out. They confided in me that they had been the victim of a sexual assault. It was their first semester. The thing is, I know some people who just would have carried on and assumed the student was not interested in the class or the work and just kept issuing zeroes. Yes, it took some extra work on my  end to issue them an incomplete and accept late work after the course ended, but that was fine with me because this case required compassion. Other students I've worked with haven't dealt with those exact same circumstances, but they've had their own tragedies and hardships and my attitude is if I was going through something similar, I'd want people to be compassionate and understanding so I take that approach with folks in my classes. \n\nThe thing is, often times, the extra work we'd have to do is not all that extra. Logging into Canvas to extend an online assignment may take a minute, max. Giving an extra day or two costs no effort so why make it a big deal? If it's about fairness, then just make it a policy that people get extensions if they're going through a traumatic time. The reputation of being a soft is better than a reputation for being a callous ass. \n\nThis is why it angers me to hear tenured professors make jokes about things like an epidemic of dead grandparents during finals. Sure, *some* people may use that as an excuse, but I'd hate to be the asshole that further traumatizes someone legitimately going through a tragedy.", "author": "False-Guess", "created": 1614718623, "upvotes": 62}, "gpgf3gv": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgf3gv/", "text": "So true. Undergrads are looking to TAs to help them make sense of everything going on. Feeling cared about means so much to them right now.", "author": "MercuriousPhantasm", "created": 1614717331, "upvotes": 20}, "gpgf1nt": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgf1nt/", "text": "Bless you. Straight up, I could have used you when my dad suddenly died and I was told I still needed to take my online test that evening. I did- and I passed with flying colors- but damn it was rough", "author": "Leukloki", "created": 1614717310, "upvotes": 40}, "gpgadqz": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpgadqz/", "text": "When I was an undergrad student myself, my grandmother had a stroke and was in the hospital. In our area, if someone has a stroke, the hospital requires a family member sit by their bedside at all times to make sure they don't try to get out of bed and hurt themselves. As my dad and I kept vigil by her bedside, I emailed the TA from the hospital lobby computer (this was a long, long time ago pre-smartphones) asking to have an extension on a paper or be allowed to submit it over email just because I couldn't physically turn it into the TA's mailbox on campus. The TA told me that I needed a signed doctor's note from my grandmother's attending physician, which I then needed to deliver to the TA's mailbox by the end of the week or I would fail the paper, and therefore fail the class. Failing the class would mean I would then lose my scholarship and not graduate on time. \n\nAn incredibly heartbreaking time became infinitely worse because of a TA who couldn't have a little bit of compassion. I ended up reaching out to the professor, who told me that I didn't need the doctors note and could be excused from the paper. \n\nWhen I became a TA, I promised myself that I would never do that to a student.", "author": "robotscantrecaptcha", "created": 1614715311, "upvotes": 202}, "gpg9jdy": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpg9jdy/", "text": "[deleted]", "author": null, "created": 1614714951, "upvotes": 131}, "gpfzdak": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpfzdak/", "text": "[deleted]", "author": null, "created": 1614710610, "upvotes": -6}, "gpfy6ra": {"link": "/r/GradSchool/comments/lw87u6/remember_undergrads_are_people_too/gpfy6ra/", "text": "I just want to say that was incredibly kind of you and probably meant the world to that student. I'm glad you took initiative and reached out to them.", "author": "lumpytacos", "created": 1614710108, "upvotes": 478}}}