{"sid": "p9glog", "link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/", "title:": "hot tip for those doing grad school with brain fog", "text": "I'm starting the fourth year of my PhD, and I have a chronic illness that often manifests as a brain fog. One piece of advice I have for other people who are dealing with similar circumstances: Take thorough notes on *everything*. Not just on how you're doing your experiments but even your manuscript writing, papers you may someday want to check out and why, and really any thoughts you've had about anything related to your research or career because you never know when it will slip away. Write notes like you're writing to your collaborator (or even a mentee) and you want them to fully understand your reasoning and goals. Anything you can do to keep your thoughts straight in your brain will help you in the long run.\n\nAnyone else have any ways of dealing with brain fog during grad school?", "author": "catcherofthecatbutts", "created": 1629652866, "retrieved": 1632845382, "over_18": false, "upvotes": 501, "upvote_ratio": 0.99, "comments": {"ha1frbe": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/ha1frbe/", "text": "I'm not in grad school (one day!) but lurk here. \n\nDo you have any advice to reading book chapters specifically? For papers I usually just make a note about what they were about, but for book chapters where I need to actually know in more detail I'm struggling to read at a pace that is ideal. \n\nIt took me 1.5-2 hours today to read a short chapter on a topic I'm already semi-familisr with because I was making extensive notes. If I don't make notes, and just read, I tend to zone out or find that, after I've read a book, I can't recall arguments or find that later I can't recall where I need to go find something to cite it or etc. \n\nI've been back and forth on this a lot, and I'm thinking I'm doing to go back to a less note-oriented approach, but... Idk, this feeling that I'm spinning my wheels is frustrating.", "author": "haelaeif", "created": 1629730961, "upvotes": 2}, "ha0qtok": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/ha0qtok/", "text": "I found a medication that busts it completely!\n\nI'd tried every drug on-schedule for years and none of them had any positive effect whatsoever, but then one of my friends in university was dabbling with some different supplements, I agreed to try some, and it worked. My doctor agreed to give me an off-label prescription. There have already been trials showing it works for my condition, so hopefully it'll move to on-label soon. \n\nIf you have really debilitating fog, I think it's worthwhile discussing it with your doctor. Maybe you have a condition you weren't aware of, or maybe there's a different medication you can try. Electrolytes, hydration, exercise are good at what they do, but if you have ADHD and you need medication for ADHD, pure lifestyle changes probably won't kick that.", "author": "officially_anxious", "created": 1629718229, "upvotes": 2}, "ha0hg8n": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/ha0hg8n/", "text": "I was full Lyme disease in grad school, but had no idea of that fact or why my pain levels were high. The pain was bad, but the brain fog was horrible. And then I read about the Russian olympic team using rhodiola for their athletes.\n\nI got some the next day (can’t remember brand, if it was mixed, etc, as this was in 2003)\n\nAnyways, took some when I got home. Decided I’d better work while I could that night, as I had about 10 minutes in me. \n\n4 hours later, I move away from my desk after completing 4-5 hours of focused hard work like I’d always done. It felt surprising because the fog and exhaustion had been lifted.\n\nSo I highly recommend taking rhodiola. It did absolute wonders for me.\n\nI hope you have as good luck as I had.", "author": "zastrozzischild", "created": 1629710839, "upvotes": 1}, "h9zxjyb": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zxjyb/", "text": "I wonder at times if it's just dementia. I should probably get checked up.", "author": "-gun-jedi-", "created": 1629694603, "upvotes": 1}, "h9ztvw1": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9ztvw1/", "text": "I experienced heavy brain fog during my later grad period due to medication for gender transitioning. I was told by my advisor to \"Leave school and solve your problems.\" When I didn't, my advisor constructed more problems. Ultimately, I switched medications, but also left my graduate program behind as my advisor was a toxic dump of narcissism. The ensuing homelessness also contributed to \"brain fog\" as priorities readjust. I'm so scarred from that period that I don't think I'd ever be able to return to a graduate program and succeed. I concentrate now on things that are less abstract and more tangible, which helps.\n\nThat being said: exercise. Regular, uncompromising exercise was the only thing that kept my head above water. My device was running. I got pretty good at it. My fueul was anger and frustration and it provided some space for constructive thinking. Every hour I could spend running was an hour I wasn't thinking about how to end my life. Eventually, I ran away from that program. Here I am, still breathing. Walking does wonders too.\n\n&#x200B;\n\nAristotle had it right: a motile conversation works wonders for discourse, even if it's only with your own person.", "author": "daphnephoria", "created": 1629692286, "upvotes": 3}, "h9zrd5r": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zrd5r/", "text": "this post is making me realize that i've had perpetual brain fog for a while... LOL.... tbh i think it's mainly due from my non-existent sleep schedule (a whole other story), but i write down a lot of things as well!\n\nas a stem grad student, \n\n* i'm pretty good at writing things by hand/laptop nearly verbatim now -- in one ear and out the other hand, i'll go process it later. the actual writing itself is helpful for me too, when i see where i took time to write extra notes, etc, i can remember what else i was thinking at the time.\n* sooo many calendars. i have a google and 2 different written versions (one that i keep with me), and a to-do app on my phone, all basically the same thing with some modifications but just multiple reminders for me in multiple places. the act of doing the writing is also very helpful!\n* i keep pen/paper or notebook handy all the time. sticky notes are really helpful!\n* i never assume i will remember something lol. when a thought passes by, instantly get it down!\n* i find actual pen/paper to be more helpful than typing things out. the physical act and physical manifestation of what i need to do stuck to me more than just typing things.\n* date everything!\n* consistency/habits also really helpful -- doing things in the same order/way all the time could help me figure out how to troubleshoot when things went wrong.", "author": "superdesu", "created": 1629690791, "upvotes": 1}, "h9zr2ba": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zr2ba/", "text": "Notes and pictures literally have been my lifesavers", "author": null, "created": 1629690616, "upvotes": 1}, "h9zmeeo": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zmeeo/", "text": "This means so much to me! I will definitely take this into account. I start this week and I've been so nervous. It's hard to explain to people that you aren't joking when you say you have memory issues.", "author": "SnooComics8832", "created": 1629688002, "upvotes": 1}, "h9zlqa3": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zlqa3/", "text": "This. Post it's. Google reminders. A big calendar I write due dates on. I have trouble doing the readings (I'm getting an MSW) all done with notes so I highlight as I go.\n\nI also do reminders for chores in general if I need to so I'll actually keep up with day to day things that I'll overlook during brain fog.", "author": "hollytot", "created": 1629687638, "upvotes": 1}, "h9zl7ws": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zl7ws/", "text": "I’ve been doing this for years due to untreated ADHD and just subconsciously learned that’s what I had to do just to be able to keep up. Now that I’m diagnosed and more aware of my behaviors… and tracking practicum hours…. wow, I can’t believe how time-consuming it is taking notes on literally everything. I lose SO much time doing this. But it’s necessary, so it is what it is.", "author": "baebeque", "created": 1629687364, "upvotes": 2}, "h9zjfnt": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zjfnt/", "text": "Personally, the experience of brain fog was related to anxiety, and I learned to manage it with lifestyle changes. People experience anxiety in different ways, and once I finally put a name to the chronic feeling of being overwhelmed/checked out , I was able to start dealing with it.\n\nWhen it hits during stressful moments, I do things to center myself (some deep breathing, some cheesy self pep-talk, taking down notes and jotting down thoughts/feelings like \"I feel overwhelmed right now but I want to be focusing on _____ instead\"). \n\nBut what's really helped in the long-term is changing my lifestyle. Eating better, exercising better, *sleeping* better - these simple things are so, so important.", "author": "meditations-", "created": 1629686427, "upvotes": 1}, "h9zj3o9": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zj3o9/", "text": "Does anyone have a real description of what brain fog is and what it feels like? This all sounds like very helpful stuff in any situation - the less we have to recall because it's better documented, the better, right?", "author": "sinfonia21", "created": 1629686253, "upvotes": 1}, "h9zecxb": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9zecxb/", "text": "Thank you for this. I always felt ridiculous and like I was the only one who had to write things down in meticulous detail because my brain is so foggy from my anxiety.  Right in the beginning of my MSc my supervisor made me feel awful about writing notes in our meetings, but I wouldn't remember anything he said after I left his office - it's been better during covid because he can't see me writing when we're meeting on zoom...", "author": "pyritepyrate", "created": 1629683868, "upvotes": 1}, "h9z2e00": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9z2e00/", "text": "Thanks for this post! I'm reading through everyone's suggestions in hopes that I can keep myself on track the next time brain fog strikes again", "author": "fivefootwonder", "created": 1629677949, "upvotes": 1}, "h9yvdi3": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9yvdi3/", "text": "In addition to taking thorough notes on literally everything, I also take time when I'm having a good day to type what I've written/whiteboards I've photographed. This includes both the actual information from a class and the little side comments/quips I write in the margins. The result is that everything I do and think during class is completely searchable; even if I don't remember the details, I can look up a word or two and have an easy-to-read summary of both the information and what I thought when I first learned it. Also means I don't have to carry anything other than my laptop when I go off to study. \n\nOf course this takes a lot of time and energy, but I've found that taking the time when I can makes my life sooooo much better on days when I am less ok.", "author": "awildtrowawayappears", "created": 1629674532, "upvotes": 2}, "h9yum8o": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9yum8o/", "text": "Omg I'm gonna have to start doing this!!! \n\nWhenever I get brain fog, its usually my brain going into flight-mode (i.e. my brain says 'oh shit, I remember feeling like this before! Man, last time we did this you were stressed tf out :/ Lets not do that again. How bout we make you incapable of using your brain at all? That should work!') \n\nHence my go-to is usually meditation and/or a good ol' shower 😭 sometimes you just gotta step away from your stressor. But this is so good to know for when I needa power thru!!!!", "author": "hufflepuffhorcrux", "created": 1629674171, "upvotes": 3}, "h9ys9wb": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9ys9wb/", "text": "Thank you so much for this post and to everyone for replying with their solutions! This is a god send to me guys.", "author": "admcol07", "created": 1629673044, "upvotes": 1}, "h9yotjm": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9yotjm/", "text": "I am autistic and have ADHD, and I was able to get accommodations that help. I meet weekly with my PI, and email him my notes from our meetings to ensure I properly understood what we said and then I reference those notes daily.", "author": "realmuffinman", "created": 1629671401, "upvotes": 7}, "h9yalg7": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9yalg7/", "text": "[removed]", "author": null, "created": 1629664966, "upvotes": 1}, "h9y41dv": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9y41dv/", "text": "I don't know if this would work for everyone because my brain fog is induced by anxiety and depression, but I found that taking Bacopa monnieri as a supplement everyday has been surprisingly effective.  I've tried other supplements like ginko, l-theanine, lions mane, and none of those worked. But Bacopa seems to be helping a lot!", "author": "vanilla_warfare", "created": 1629662054, "upvotes": 7}, "h9y3tox": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9y3tox/", "text": "I don't know precisely what *brain fog* is, but I have OCD, and it surely feels like a lot of fog... I second your advice, I take handwritten notes of anything I read or I want to write.", "author": "Normal_Kaleidoscope", "created": 1629661957, "upvotes": 6}, "h9y0i9k": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9y0i9k/", "text": "Salt, lost of salt and gatorade like drinks. I find that my brain fog is the worst when I'm not hydrated or low on electrolytes so I keep salt snacks and electrolyte drinks everywhere! My husband loves that I have a snack stash in my car even.", "author": "shinygiraffestella", "created": 1629660488, "upvotes": 49}, "h9xycrz": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xycrz/", "text": "I commented on another post recently about hacking your own executive function in grad school when you’re overwhelmed (for any reason) - I’ll tag you!", "author": "errtffg", "created": 1629659563, "upvotes": 16}, "h9xxydc": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xxydc/", "text": "I exactly do this. 105 pages on my PhD diary so far. It is the best tool I have and a great tip for everyone in a PhD", "author": null, "created": 1629659387, "upvotes": 2}, "h9xxm5f": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xxm5f/", "text": "Yes! I can't really do \"planners\" but I have a small notebook that's just a running log of everything I've done, am doing, and plan to do.  \n\nAlso, I do a ton of stats, so I save a shitload of syntax files with all of my data cleaning and analyses so I can easily see what I've done so far or diagnose errors.", "author": "hooloovooblues", "created": 1629659238, "upvotes": 5}, "h9xwni3": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xwni3/", "text": "Livescribe smart pens and paper have been amazing for me. It’s expensive, but worth it.", "author": "Moon_In_Scorpio", "created": 1629658816, "upvotes": 7}, "h9xu5re": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xu5re/", "text": "Keep an appointment with yourself on a calendar app/whatever calendar tracking system works for you, ideally something that will ping you with a reminder. Use this time to find and organize the notes that you've taken on stuff throughout the week/month - I don't know about other chronically ill folks, but my brain fog lifts and falls at the most random of times, so I tend to leave a trail of notes behind me that I may or may not find again. Setting aside deliberate time to find, go back through, and put those notes in their proper places really helps. Saturday around noon is when I usually keep my self-appointments, since I use Sunday for prepping the next week.\n\nOn top of that, keep redundant notes but try to keep a predictable system. I write my to do lists on Trello, in a discord accountability server, and sometimes in my journal when I remember it exists. My meeting and research notes exist in either my Notion or a dedicated notebook that I keep in my bag or on my desk at all times. When systems cross, I end up losing notes for weeks or months because it isn't where it's supposed to be", "author": "ConfusedCuddlefish", "created": 1629657729, "upvotes": 16}, "h9xruh9": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xruh9/", "text": "Hi! Chronic illness brain fog person here too. And I agree with you: I take thorough notes on everything, write emails to everyone after meetings to keep track, have extensive to-do lists, and take a lot of photos, and I plan my experiments on paper in excruciating detail.", "author": "nietzschesoptimism", "created": 1629656732, "upvotes": 19}, "h9xn5ga": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xn5ga/", "text": "Great advice. I have wasted countless hours trying to recreate methods/results from grad school/early career.", "author": "HappyHrHero", "created": 1629654692, "upvotes": 24}, "h9xn0x7": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xn0x7/", "text": "Taking photos of things, having notes kept whenever I meet with my advisor, documenting every experiment I do in a very detailed way, stuff like that helps me a ton. I may get a voice recorder too, just as another way to take notes lol", "author": "molecularronin", "created": 1629654637, "upvotes": 30}, "h9xlk6n": {"link": "/r/GradSchool/comments/p9glog/hot_tip_for_those_doing_grad_school_with_brain_fog/h9xlk6n/", "text": "Yes this is so important. I also try to document things in multiple formats, like photos on my phone, lab notebook, google calendar, etc., and date everything. Everything. Sometimes I need to remember what exactly I did when, and I can piece the missing info together by looking at what else I did that day, looking through old emails, etc. If you’re in a wet lab, I take photos of cell culture plates, tubes, cage cards, etc., so that they are date and time stamped for future reference, and sometimes I even keep the tops of plates if it’s important.\n\nChronic illness life sucks…lol", "author": "shroompanda", "created": 1629654010, "upvotes": 124}}}