{"sid": "k0cnvh", "link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/", "title:": "Anybody else’s advisor expecting them to work on Thanksgiving since “youre not going anywhere”?", "text": "My advisor asked if I was going to be around on Thanksgiving day to work on a data set since I’m not going to be visiting family. First time I stood up for myself and said ‘nope, still observing the holiday with my bf and video calls’. What’s with advisors thinking we’re machines? Do they not remember when they were grad students?", "author": "beckygeckyyyy", "created": 1606248412, "retrieved": 1632845362, "over_18": false, "upvotes": 513, "upvote_ratio": 1.0, "comments": {"gdkhfo0": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdkhfo0/", "text": "I think a big issue is that many grad students have zero real world experience and don’t know that pushing back is a very normal thing and that no one can force you to do anything.\n\nAt the end of the day, your advisor is just a person, they aren’t a god. You don’t need to fear them or feel anxiety. They were in your shoes one point", "author": "hjohns23", "created": 1606323259, "upvotes": 2}, "gdjkc24": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdjkc24/", "text": "My lab and floor is like 50% non-American PIs and workers/students but most of them still have Wednesday-Friday off if they want it. Monday my PI scheduled a meeting for Wednesday (today) at 1:30 which he will definitely be an hour late for. He also asked me last week if I was definitely taking thanksgiving day off... They think we’re machines", "author": "biochemcat", "created": 1606301337, "upvotes": 2}, "gdjk8ia": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdjk8ia/", "text": "私たちは奴隷です", "author": "RedFlutterMao", "created": 1606301236, "upvotes": 1}, "gdj3tuy": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdj3tuy/", "text": "I wish I had a graduate advisor who gave me guidance. Instead I have no one and withdrew from this semester because I have nothing left to do but my thesis, but can't find a committee willing to work with me (rejected by the prof who initially said he'd work with me, on the premise that he did not have enough expertise in the field I'm researching).\nNot sure when I'll find enough committee members (it'll probably be when I can find profs from other universities that actually have coursework/research related to my interests), but even if not, I know now to break a neck. LOL/J/k (can't help it - I binged watched The Boys in two weekends and am feeling \"super\"  threatened because I'm a regular old human woman, hahahahahaha!). Anyway, enjoy your turkey day!", "author": "musicmaniac32", "created": 1606285979, "upvotes": 1}, "gdj2vyg": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdj2vyg/", "text": "I’m working on “Thanksgiving eve”, Thanksgiving, Christmas Eve, Christmas day, NYE, and New Year’s day...", "author": "potato-lady", "created": 1606285259, "upvotes": 1}, "gdj151c": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdj151c/", "text": "My advisor said I have lots of work to do, my competency exam & dissertation draft over thanksgiving. i just smile and nod. we both know i'm not finishing those things right now. They are grinches", "author": "SantismaMuerte", "created": 1606283939, "upvotes": 2}, "gdiwkp9": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdiwkp9/", "text": "My PIs already know that I’m not going to work on a holiday. But, I have been fiercely protective of my free time and work-life balance since day 1.", "author": "iloveteax", "created": 1606280777, "upvotes": 5}, "gdih1q5": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdih1q5/", "text": "I have 2 assignments due the day after Thanksgiving, and final paper for a class due on Sunday. One of our professors just sent an email saying they aren't allowed to have any due dates between 25-29 NOV, so she moved an assignment UP a day.... FML \n\nWhy didn't my other profs get the memo??", "author": "sailor_em", "created": 1606271459, "upvotes": 1}, "gdidg3z": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdidg3z/", "text": "Not that it makes it ok, but even in \"normal\" times I'd say it was pretty standard for a lot of faculty in my program to expect you to be doing work pretty much everyday, even Thanksgiving, Xmas, New year's, etc.", "author": "1piperpiping", "created": 1606269458, "upvotes": 1}, "gdi2z7e": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdi2z7e/", "text": "You should just call him/her multiple times throughout the day each time with a single question. When they get annoyed, ask what the big deal is, you know, since they’re at home anyway.", "author": "ion_nine", "created": 1606263727, "upvotes": 6}, "gdi072d": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdi072d/", "text": "What discipline is this? Terrifying.", "author": "isaac-get-the-golem", "created": 1606262213, "upvotes": 4}, "gdhzc23": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhzc23/", "text": "I’m glad you stood up for yourself. I’ve had conversations about life-work balance with my boss. We’ve come to a gentlemen’s agreement that I don’t work evenings or weekends but if there’s an emergency he can contact me. Otherwise he gets all the support he needs from me, and I from him, during regular business hours. \n\nObviously I’m flexible for things like conferences or major projects that have components on the weekend. It also definitely helps that I’m older (36) and we go for drinks casually along with other lab members.", "author": "ImperiousMage", "created": 1606261750, "upvotes": 6}, "gdhy73l": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhy73l/", "text": "Yeah no. After first year I was asked if I was going to get the ball rolling on some bullshit and I said “I was actually requesting time off, here are my plane tickets” fuck off type of email...", "author": "chonkycatsbestcats", "created": 1606261141, "upvotes": 1}, "gdhuv0g": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhuv0g/", "text": "My PI told me I had to come in on the weekend.... I just didn't reply and didn't come in on the weekend", "author": "luvtrencher", "created": 1606259360, "upvotes": 25}, "gdhukgc": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhukgc/", "text": "I mean...it’s sort of understood for me. I’m working on a diss chapter outline for my prospectus.", "author": "SpaceMonkey877", "created": 1606259206, "upvotes": 1}, "gdhsvto": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhsvto/", "text": "I’m meeting with my advisor to work on a grant the day before, in the morning. But on thanksgiving DAY? Nah...", "author": "AfroRugbyQueen", "created": 1606258332, "upvotes": 1}, "gdhriax": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhriax/", "text": "In our university there are fixed days off, and you can simply not show up/answer mails without any issues. That's simply a fixed rule, and supervisors can't really get around that (we don't have thanksgiving at our uni tho).", "author": "sight19", "created": 1606257625, "upvotes": 3}, "gdhq4bq": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhq4bq/", "text": "I work all 7 days of the week because I love my research and choose to work on it as much as possible. \nI work during the day and do my hobbies intermittently as breaks. Sometimes I’ll take a day off, but it’s pretty rare because I just legitimately enjoy my research. I do understand that people may want to take the holiday off and I probably normally would because I’d be visiting family but not this year since I’ll just be at home like usual due to COVID. Hope everyone has a safe Thanksgiving. 😊", "author": "Ryles2014", "created": 1606256916, "upvotes": 6}, "gdhon66": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhon66/", "text": "MY advisor kind of made me take thursday off. She said that we all deserve breaks, even for a day or two.", "author": "Vividersplash26", "created": 1606256171, "upvotes": 16}, "gdhntvf": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhntvf/", "text": " I don’t think anyone in my department has expectations for doc students to be working on thanksgiving itself, but we are definitely not allowed to take the whole week off like undergraduates might. Personally I’m taking off Thursday & Friday", "author": "Enzohere", "created": 1606255767, "upvotes": 8}, "gdhn74k": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhn74k/", "text": "My advisor isn’t expecting me to work on thanksgiving... but they do expect me to keep my cells alive so, I think it really depends on the field. I agree with most comments on here that being asked/forced to work on a holiday is horrible and shouldn’t be allowed. But, some of us have multi-month experiments going on that for our own benefit we need to maintain. So, for me, I will be going into lab on Thanksgiving for a few hours but not due to my PIs, my cells just don’t care it’s a holiday.", "author": "lep187", "created": 1606255450, "upvotes": 105}, "gdhn12l": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhn12l/", "text": "Well I guess my advisor didn't directly say that we need to be working through the holiday. Infact he very sweetly mentioned that we should all take a break and get some rest at our lab meeting earlier this week. He also cancelled all our individual meetings later in the week. However, we still have a lab meeting first thing next week where we talk about our progress. I personally also have a bunch of assignments and projects due for school next week. So I guess there's no break for me either!", "author": "OneArcher7", "created": 1606255366, "upvotes": 26}, "gdhlgt9": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhlgt9/", "text": "My advisor was pressuring my lab mate because he wants some data from her to write a grant and he thinks we are going into another shut down. Thing is, he has been pressuring her about doing “just another experiment” for so long. That experiment is never the last he needs for the grant.", "author": "fserv11", "created": 1606254608, "upvotes": 31}, "gdhkqt0": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhkqt0/", "text": "Yes!! I have so many homework assignments due this weekend", "author": "maureen2222", "created": 1606254257, "upvotes": 2}, "gdheyv6": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdheyv6/", "text": "This kind of shit is not appropriate and part of the reason that graduate students need union contracts with defined holiday off-time and harassment protections. You have a right to time off.", "author": "Argikeraunos", "created": 1606251441, "upvotes": 525}, "gdhdbvp": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhdbvp/", "text": "I mentioned once \"hey prof 'x' is a holiday, let's reschedule our meeting to the day after\", then during the meeting it was like \"did you work yesterday\"? \"yes, did you?\" \"yes\"\n\nProfs may be asking, without expectations, because lots of grad students do work on holidays.", "author": "academic96", "created": 1606250659, "upvotes": 77}, "gdhakkq": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdhakkq/", "text": "Out of curiosity why is your advisor setting your schedule? Do they tell you exactly which experiments to do and when", "author": "pictetstrangler", "created": 1606249346, "upvotes": 117}, "gdh8v0t": {"link": "/r/GradSchool/comments/k0cnvh/anybody_elses_advisor_expecting_them_to_work_on/gdh8v0t/", "text": "I don't know but I will also be working for thanksgiving. Its my own fault though, I will be correcting my mistakes. My advisor was sorry to tell me that I had to do it. But yeah, mostly commenting to say that you aren't alone working thru the holiday.", "author": "Crab_manager", "created": 1606248542, "upvotes": 12}}}