{
  "sid": "qrarrv",
  "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/",
  "title:": "Did you take time off to write your dissertation?",
  "text": "My PI gave me the green light to defend in March (so submit in Feb). I have 1/5 chapters written. He didn’t say anything about taking time away from lab to focus on writing. I plan on clarifying with him, but would like to know if there is a “standard” or not.",
  "author": "sociallyawkweird",
  "created": 1636598128,
  "updated": 1637413733,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hk5n5k4": {
      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk5n5k4/",
      "text": "Defending and graduating are the goals of grad school. Keep your eyes on the prize. Lab work would be nice but writing and prepping your defense presentation are far more important.",
      "author": "Octavious440",
      "created": 1636599830,
      "upvotes": 42,
      "replies": {
        "hk5pxji": {
          "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk5pxji/",
          "text": "This is literally the response I needed to see. Thank you!!",
          "author": "sociallyawkweird",
          "created": 1636601135,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hk5v2sw": {
      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk5v2sw/",
      "text": "I stopped working on any other projects once I had all of my dissertation data collected. Even moved to finish remotely so I physically couldn't be pressured into doing more work in the lab. Your dissertation is now your A goal and your only goal, no matter what your PI says. You don't have to dedicate time to anything else (unless you have a TA position or such for your funding obviously)",
      "author": "Unlikely-Name-4555",
      "created": 1636603644,
      "upvotes": 18,
      "replies": {
        "hk97e0k": {
          "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk97e0k/",
          "text": "Were you still getting paid on your assistance ship once you moved away? Or no? I have finished collecting data for my dissertation, but I’m on another project that is still very much ongoing that I’m not even writing on. Lab personnel is low so this got put off onto me, but I don’t care about anything besides defending in the month I want to defend in (for personal family reasons).",
          "author": "sociallyawkweird",
          "created": 1636667534,
          "upvotes": 1,
          "replies": {
            "hk9bs9h": {
              "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk9bs9h/",
              "text": "Same thing happened to me. I ended up being the only one left when COVID started and suddenly I was in charge of 16 projects. I worked on those while I collected my dissertation, but put my foot down that I'd be done with lab work once I had my dissertation data. \n\nMy program has always had a policy that you can't have funding (TA or AI) if you don't live here. You have to be available in person. COVID changed that and suddenly it was acceptable. This fall they tried to go back on what they said and take my funding away, but I fought it with copies of written responses from them and a contract guaranteeing my funding. I'm turning down the possibility of funding for the spring because I should defend in January/February and I know if I have funding they'll drag it out til May.\n\nEdit: I read your other comments, and yes it is exploitative. It is 100% free labor for them. And they put you in a horrible position of not wanting to be abused but also not wanting to piss off the one person who decides you can graduate. I sympathize greatly - that was the majority of my PhD experience and I didn't know better until it was too late",
              "author": "Unlikely-Name-4555",
              "created": 1636669402,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk5xl8q": {
      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk5xl8q/",
      "text": "I'm taking leave from work. It's really the only way. I work 48 hour shifts, but I'm in the office 6 or so days a week even on days off.",
      "author": "Belus911",
      "created": 1636604938,
      "upvotes": 2,
      "replies": {}
    },
    "hk7665v": {
      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk7665v/",
      "text": "What does defending mean? I’ve looked it up yes but it sounds very daunting. Do they just ask questions on your paper and hopefully you answer them and that’s about it?",
      "author": "Sadrien6",
      "created": 1636636782,
      "upvotes": 2,
      "replies": {
        "hk793h6": {
          "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk793h6/",
          "text": "You usually give a research presentation that covers your 3-5 years of research projects in grad school. Then your committee, (or an external examiner in some places) ask you questions about your research and your thesis, which you would have submitted in advance. Yeah, that's about it. In some places it's an exam where you get grilled, in others your advisor only lets you defend if they think you're sufficiently ready and then it's just a formality.",
          "author": "WickedSpite",
          "created": 1636638263,
          "upvotes": 5,
          "replies": {}
        },
        "hk7676v": {
          "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk7676v/",
          "text": "**Defending the Guilty is a  British television sitcom. It stars Will Sharpe and Katherine Parkinson as London barristers.**\n\nMore details here: <https://en.wikipedia.org/wiki/Defending_the_Guilty> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(delete)](https://www.reddit.com/r/wikipedia_answer_bot/comments/q79g2t/delete_feature_added/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot) ^(|) [^(GitHub)](https://github.com/TheBugYouCantFix/wiki-reddit-bot)",
          "author": "wikipedia_answer_bot",
          "created": 1636636797,
          "upvotes": -5,
          "replies": {
            "hk7w3cj": {
              "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk7w3cj/",
              "text": "Bad bot",
              "author": "Ecstatic-chipmonk",
              "created": 1636648452,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk78uzh": {
      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk78uzh/",
      "text": "time off of what? lab work? yes all my experiments were done kind of. I think I had one more reaction to run and a purification. I think I was a TA that quarter though because research was done so I still taught. (I think but that was a long time ago)",
      "author": "rthomas10",
      "created": 1636638146,
      "upvotes": 2,
      "replies": {
        "hk96rdo": {
          "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk96rdo/",
          "text": "All of my experiments are done but I have been assigned projects I’m not even writing into my dissertation that are still ongoing.",
          "author": "sociallyawkweird",
          "created": 1636667273,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk6jfrn": {
      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk6jfrn/",
      "text": "I gave myself six months from finishing all my lab work to write up my thesis. There was a tiny bit of data work up to finish, but there was certainly no expectation to do any additional experiments in that time. \n\nGood luck!",
      "author": "singinhallelujahtoem",
      "created": 1636619796,
      "upvotes": 2,
      "replies": {
        "hk972cn": {
          "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk972cn/",
          "text": "Lab personnel is low and we have gotten funding for more grants. As such I’ve been working on a project for two years that I’m not even writing into my dissertation. It’s ongoing work and I just don’t have time for it since I want to shift to writing. I just don’t want to burn any bridges, but at the same time I feel like I shouldn’t be forced to continue to work on this project.",
          "author": "sociallyawkweird",
          "created": 1636667400,
          "upvotes": 2,
          "replies": {
            "hk99b18": {
              "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk99b18/",
              "text": "I think you can suggest to your supervisor that you leave the work in such a state as to be easily picked up by the next person. They’ll understand that you have a thesis to write; just because you’re suggesting you leave the project to write up doesn’t mean you’re burning bridges, you just have different priorities. They may decide to keep you on as a postdoc to finish the work properly.",
              "author": null,
              "created": 1636668347,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk8cnru": {
      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk8cnru/",
      "text": "I'm a little confused what you'd be doing in the lab if you're that close to defending. I have not defended but both the students in my lab who have graduated didn't even need to think about stepping foot in a lab for like 6 months before their defense dates, maybe longer. They only did some stuff in the field to help out others and to get a break from staring at their computers, but they were never obligated to.",
      "author": "KiwiTheKitty",
      "created": 1636654972,
      "upvotes": 1,
      "replies": {
        "hk8d213": {
          "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk8d213/",
          "text": "Lab personnel is low and we keep getting grants funded and no one to do the work. I have all the data for what I’m writing. But I’ve been working on this project for over a year that I’m not even putting in my dissertation. And it’s still going…",
          "author": "sociallyawkweird",
          "created": 1636655129,
          "upvotes": 1,
          "replies": {
            "hk8emv2": {
              "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk8emv2/",
              "text": "Wow, honestly I consider that exploitative, I'm sorry.",
              "author": "KiwiTheKitty",
              "created": 1636655758,
              "upvotes": 1,
              "replies": {
                "hk8frst": {
                  "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk8frst/",
                  "text": "I was wrong. I’ve actually been working on it for two years. And I feel it’s exploitative too, I just don’t want to burn any bridges when it comes to recommendations for future careers/opportunities. It’s giving me so much anxiety",
                  "author": "sociallyawkweird",
                  "created": 1636656213,
                  "upvotes": 1,
                  "replies": {
                    "hk8gnoh": {
                      "link": "/r/GradSchool/comments/qrarrv/did_you_take_time_off_to_write_your_dissertation/hk8gnoh/",
                      "text": "Dang that really sucks. I think discussing this with your advisor is necessary. I mean in a few months you're supposed to be graduating anyway, so someone is going to have to take over the project one way or another. Good luck though!",
                      "author": "KiwiTheKitty",
                      "created": 1636656567,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}