{"sid": "po4e51", "link": "/r/GradSchool/comments/po4e51/how_long_between_emails_to_a_collaborator/", "title:": "How long between emails to a collaborator?", "text": "Hi all! Just to preface, I’m a Chemistry BS/MS student (basically a senior undergraduate student also getting a Master’s degree via a research thesis). I recently passed some crystal samples to a collaborator at a different university in the same city I go to school in for X-ray crystallography. We emailed before the drop off and the Professor seemed enthusiastic to check out my samples and see their viability. Unfortunately due to COVID restrictions, I was unable to go with them to the instrument and follow the process. So I had to hand them my samples and just wait. During the drop off, they mentioned a timeline that basically was: check the viability of samples on the drop off day, and if viable, run them the next day, with email updates as necessary. As you can probably tell from the title, that didn’t happen. It has been a week and I haven’t heard a word from them by email since. I emailed twice so far with my usual 3 days and 5 days follow up procedure but I’m hesitant to send more emails for fear of being annoying. Though I should mention that the samples I sent are kind of important to me as they are potentially something new and the project as a whole would definitely make for an interesting paper/thesis that I would like to finish this semester before thesis writing begins in earnest next semester. For any graduate students out there who are in or were in similar situations, what did you do? How long between emails? Did you ever consider calling them? Thanks for any suggestions or advice! Have a great day.", "author": "Alpz854", "created": 1631631347, "retrieved": 1632952619, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"hctz5er": {"link": "/r/GradSchool/comments/po4e51/how_long_between_emails_to_a_collaborator/hctz5er/", "text": "Get your advisor to give them a call.  Basically might be time to get some coverage from someone who is more senior.  You did what you could.", "author": "HalfEatenPie", "created": 1631634338, "upvotes": 3}}}