{
  "sid": "klm97k",
  "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/",
  "title:": "7th-year PhD student, just diagnosed with ADHD after my advisors intervened when I was seriously struggling. I'm grateful to them for not giving up on me, because I was certainly ready to.",
  "text": "I want to share this because I felt extremely alone for a lot of this experience, and I hope that being open about it can help others who might be going through something similar.\n\nI'm in my seventh year of a PhD program in the humanities; somewhere around year five or six, I started really struggling. I was done with the coursework and dissertation proposal stages of the degree and on to the pretty unstructured research/writing phase. I wasn't getting much writing done, but at first I was reassured by the fact that this seemed to be pretty normal; lots of other students told me that they didn't get much done in their fourth year and even fifth year, and that most of their writing happened in the last couple years of the program.\n\nIn year five, I got a grant that was intended to allow me to focus solely on research/writing. However, I got very little academic work done that year. I felt an increasing sense of paralysis as I stared at what was supposed to become my first chapter; it seemed inconceivable that I'd ever be able to turn it into anything resembling a legitimate dissertation chapter. Instead of working on writing it, I spent a lot of the time in the mountains (rock climbing, skiing, etc). At first I told myself that I was just trying to have some work/life balance, and that when it mattered, I'd be able to turn my focus to the dissertation; but as the year progressed, deep down I became increasingly doubtful.\n\nYear six (2019-2020) was where things really got bad. Possibly partly precipitated by a traumatic experience I'd had over the summer, I began to totally withdraw. I couldn't even open my unfinished dissertation chapter. I stopped checking email because I was afraid of what I might see. I had to go to the department to teach, but I would hurry in and out to try to avoid interacting with anyone. I was supposed to submit an application for a dissertation completion fellowship in January 2020; I watched that deadline come and go passively, without even communicating to my advisors that I didn't think I could make it.\n\nMeanwhile, other parts of my life were also deteriorating. There were a couple months where I didn't pay my rent, not because I didn't have the money but just because the process of writing the check and sending it to my landlord felt too overwhelming. Because I was completely avoiding my email at this point, I missed numerous communications from my landlord, and only by sheer luck happened to finally open my email shortly after he'd sent a message telling me that he would have to ask me to leave the apartment if I didn't pay immediately. My hygiene deteriorated, including on days when I had to teach, but I couldn't bring myself to care. I had a couple small jobs outside the department, and I found myself increasingly unable to fulfill basic responsibilities (sometimes as simple as printing a poster out) there, too.\n\nI felt like I was watching myself self-sabotage, but I couldn't understand why, or why I couldn't seem to even bring myself to really care. Every day I would wake up and tell myself that I'd turn things around; then I'd spend the whole day staring at distracting websites, feeling physically unable to bring myself to click on the email tab, much less open anything related to my dissertation. I felt constantly exhausted and guilty, and I began to withdraw from my social life because I couldn't admit what was going on to myself, much less to my friends. The one thing I did consistently manage to do was go climbing, which just made me feel more guilty: surely if I could motivate myself to get up at 5 am to go to the mountains, I should be able to print out a poster or mail a rent check, right?\n\nI was also reminded of my experience in college: I'd struggled in all of my exam-based classes, making poor grades (including a couple failing grades) and feeling generally not in control of my life. The by all accounts successful ≈10 years between then and now didn't seem to matter; all I could feel was that the \"real me\" was a failure, and that everything in between was a fluke that was destined to fall apart sooner or later.\n\nMy advisors had been reaching out to me, but because I wasn't looking at my email I didn't see their communication. Finally, in February, a professor was able to give me a note in-person, which prompted me to finally look. I saw that I'd received a letter from the department telling me that there was concern about my progress, and that if I wasn't able to show two chapters by the end of the year, I'd be put on academic probation; if I didn't show two chapters by the end of the following year, I'd be asked to leave the program. I felt numb, surprised that they were giving me that much of a chance, and pessimistic about my ability to take advantage of it. Nevertheless, I wrote to my advisors to set up a meeting.\n\nWhat surprised me was how kind they were at the meeting. Where I was expecting anger and disappointment, I instead saw concern. They acknowledged that I was struggling without pressing me to explain why, told me that they valued my work and wanted me to be able to continue to participate in the field, but also emphasized that the most important thing was for me to take care of myself and my mental health--whatever that might mean for my academic work. We talked through the letter and my options, and they gave me some on-campus resources to talk with.\n\n(I want to acknowledge here that I know that this kind of response is unfortunately not the norm in graduate departments. I feel extremely grateful that my advisors were so compassionate, and very angry that many people have much more negative experiences when dealing with mental health issues in graduate school.)\n\nI started working with a therapist, a psychiatrist, and an academic coach at my university. Pretty quickly they mentioned the possibility of ADHD. It wasn't the first time someone had suggested this (I had a couple therapists earlier in grad school who also suspected it), but it was the first time I began to take it seriously as something that might be affecting my work.\n\nUnfortunately, when the pandemic hit they had to put a diagnostic evaluation (and any stimulant medication) on hold, but the psychiatrist did give me a prescription for Wellbutrin (known to help both depression and ADHD). Probably more importantly, the academic coach helped me develop strategies for managing focus and motivation. With their help (plus some pandemic-anxiety-induced hyperfocus...) I was able to finish my two chapter drafts, and even successfully applied retroactively for the dissertation completion grant that I'd failed to apply for in January. The academic progress was obviously important, but even more than that I felt immensely relieved to begin to feel capable again and not to feel like I had to hide from my own life.\n\nThe last chapter of this somewhat rambling saga came this month. After delaying dealing with it for several months, I finally made an appointment to be formally evaluated for ADHD. The doctor confirmed the diagnosis and prescribed me a low dose of Adderall. It's only been a week, but the difference is already striking. I feel way less dread about starting work on the dissertation each day, and as a result, competing distractions feel less compelling. When I do get distracted, it doesn't feel like a monumental effort just to navigate back to the Word document. Maybe most surprisingly, I feel less imposter syndrome about the coherence of my arguments now that I'm able to focus on re-reading more than a couple paragraphs of my writing at a time.\n\nIn retrospect, the ADHD diagnosis makes sense of a lot of things I'd always just seen as personal failings/quirks: my extreme spaciness as a kid; my chronic inability to keep my personal spaces tidy no matter how much I want to; my tendency to fixate on things seemingly irrespective of their overall importance (often at the expense of basic needs like food or water); my anxiety about the fact that my ability to write has seemed to depend on intense surges of motivation/inspiration; my tendency to forget what I'm doing midway through a task; etc. No one picked up on it when I was a kid because I was a well-behaved girl who didn't fit the stereotype for ADHD. And while I'd been aware that a lot of this stuff might be related to ADHD for a few years, what I didn't expect was to feel like there were concrete solutions that could give me a greater sense of self-efficacy and clarity.\n\nAt the beginning of this year, I wouldn't have imagined that this sense of competence and hope was possible for me. I didn't really feel capable of thinking about the future at all; if I did, I probably imagined that I'd be living with my parents after having had to explain how I'd managed to be kicked out of a PhD program that--up to a certain point--I'd been thriving in. I certainly didn't feel I deserved a second chance: instead, I felt that I'd already been given too many second chances and that I had finally shown my true character when I failed at this one. I was ready to give up on myself, and I'm so grateful that my department didn't let that happen.\n\nWhile I was going through this, I felt incredibly alone and as though my failure was unique to me. It didn't matter that objectively I recognized that the stress of graduate school took a heavy toll on many of my colleagues; I was convinced that in my case, it was just because I wasn't good enough, and that I had squandered an opportunity I never deserved in the first place. I also felt deeply ashamed at just how much I was letting my life fall apart, and unable to talk about it to even my closest friends because of that shame.\n\nI realize now that this shame was incredibly destructive. One of the first things that actually made me feel better was when the academic counselor I met with told me that she'd met many other students who, like me, had avoided looking at email for weeks or months at a time. I had felt so ridiculous for being unable to bring myself to do something so simple; knowing that other people had struggled with it, too, suddenly helped me see my own experience with more compassion. I've realized since that shame about academic failure perpetuates a culture of silence in which people often feel unable to talk about the extent of their struggles in academia--even when the topic of mental health is broached.\n\nSo, if you are going through similar difficulties (whether ADHD-related or something else), please know that you are not alone. No matter how badly you feel that you're failing, there are other people who have been there, too. You might feel like you deserve to suffer for your failures (I know I did), but what you truly deserve is compassion and support. You deserve to receive resources to deal with whatever may be causing your struggles so that you can live the life you want to live--whether that's in or out of academia. And if your advisors/department doesn't give you that support (which is sadly all too common), I hope you're still able to find someone who can step in, advocate for you, and remind you that you are worth it in those moments where you might not feel that way.\n\nThanks for reading through this mini-novel if you've gotten this far :) I hope it's helpful to at least a few people; I know it felt helpful to me to write it all out.\n\n**Edit**: Thanks for all the really kind responses and the awards! It means a lot to realize how much of this experience is shared. Anyway, now that I've replied to all the comments, I guess I should go actually try to write my dissertation or something 🤣",
  "author": "zayexi",
  "created": 1609142517,
  "over_18": false,
  "upvotes": 908,
  "upvote_ratio": 0.99,
  "comments": {
    "gk56r63": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gk56r63/",
      "text": "Thank you for sharing this. I'm a junior in college. I was searching through the site to find advice for summer research applications and came across this.  I was diagnosed with ADHD last month. I'm a woman as well and I relate a lot to your experience. I went through a burnout period and a bout of depression in late September that I was able to get out of because of my eventual diagnosis and treatment. Even though the wait was painful, I know a diagnosis after two months of seeking one is unimaginable for some people. It's been such a relief having help with my symptoms but it's even better knowing that my failings weren't all on me and were out of my control. I'm just starting my journey and it's nice knowing that I'm sharing a similar experience with someone else, especially a woman pursuing a PhD, which I plan to do after undergrad. I'm really glad you had the support and encouragement you needed to get help.",
      "author": "honeygetintoit",
      "created": 1611290431,
      "upvotes": 1,
      "replies": {}
    },
    "ghi7zjx": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghi7zjx/",
      "text": "Thank you for taking the time to share your story! Women are so often under diagnosed because our symptoms tend to be more subtle and less destructive in early classroom settings (think; the little girl who can’t sit still so she always volunteers to be the teacher’s helper, or roams around the classroom trying to help others because she can’t focus on her own page in front of her, or the little girl who doesn’t do her book report and stays home “sick” instead of admitting that she couldn’t finish the book) \n\nI’m really grateful that my sister:\nA) noticed signs of ADHD when I was struggling with the first year of my undergrad, and\nB) encouraged me to talk to someone\n\nI was failing most of my first year of classes after never having failed a class before. I dropped out because the only thing I could do to self-soothe was play video games all day and the thought of even trying to study or write papers was overwhelming. \nWhen I was first diagnosed, I spent a lot of time feeling infuriated and let down by the public school system for not catching it sooner, but ultimately not being diagnosed early helped me develop some helpful coping strategies (and some not so helpful coping strategies that I spent a lot of time unlearning), and has helped me help other women get diagnosed too. There are at least 3 other women who have gotten diagnosed with ADHD as adults directly as a result of a conversation with me! So be angry, be grateful for answers, and use both of those new feelings to self-advocate and help others advocate for themselves! \nAnd congrats on doing the self-work needed to succeed. I know it sometimes feels like you don’t deserve praise because “it’s just the meds working” but really, medication only quiets your brain a little, the rest is all you :)",
      "author": "luna_loaf",
      "created": 1609342267,
      "upvotes": 3,
      "replies": {}
    },
    "ghdmbtd": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghdmbtd/",
      "text": "I also have ADHD. I think I got through undergrad because most of those “long term projects” could actually be panic-rushed at the last minute, but grad school and its lack of structure? I almost failed out of my masters program, so I finally got help and started treating it in PhD. I was doing... alright until the pandemic. Then my therapist finished her residency and left, I stopped getting out of bed for a while, and now I.. get out of bed, but haven’t actually been vertical more than like 4 hours in a row in weeks, and I keep napping.\n\nI don’t know why I’m still typing or what I’m trying to say. I also haven’t finished reading your post, because, well.. I haven’t taken my meds in days either. \n\nAnyway. If you haven’t found her already, Jessica McCabe of How to ADHD on YouTube (and Patreon) is... a fuckin miracle, if I’m being honest. Especially the discord server/support group for Patreon donors.",
      "author": "lea949",
      "created": 1609232869,
      "upvotes": 3,
      "replies": {}
    },
    "ghdb076": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghdb076/",
      "text": "jesus christ. you were in such a bad place, i’m super happy and impressed you pulled out of it! for the last few months i’ve been feeling that paralysis and seriously beating myself up about not doing more of the transcription work while i wait for the last 2 participants i need to hit my minimum. i thought my life was falling apart because i’ve been avoidant and lazy, but your post helped me see what rock bottom really looks like and made me feel better. :) thank you for that, and for being an inspiration!",
      "author": "PhDdegreeBurn",
      "created": 1609222339,
      "upvotes": 1,
      "replies": {}
    },
    "ghdai9v": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghdai9v/",
      "text": "Im reading this post and just thinking well shit as pretty much every symptom you describe is something ive been struggling with for years. Ive mentioned feeling like i might have ADHD or ADD to my therapist but she didnt seem to think going through the evaluation process was worth it because \"pills dont teach skills\"...im thinking i might need to research what resources my uni might have",
      "author": "BookQueen13",
      "created": 1609221944,
      "upvotes": 2,
      "replies": {}
    },
    "ghcxjls": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghcxjls/",
      "text": "How did you feel when you started the medication? Was there more focus or less anxiety or... how would you describe it? I feel such a sense of imposter syndrome I don't know if the medication is helping and I think i'm self-sabotaging by not taking it consistently and ony taking half?  I'm nervous of it helping me and nervous of it not.\n\nAny insight is appreciated!",
      "author": "ExcitedAlpaca",
      "created": 1609213491,
      "upvotes": 2,
      "replies": {}
    },
    "ghcs36b": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghcs36b/",
      "text": "This resonates sooooo much with me and I've been trying and failing to get evaluated for ADHD for the better part of this year. Thank you for posting this, I need to keep trying to advocate for myself in the new year.",
      "author": "EverythingsPeachy",
      "created": 1609210482,
      "upvotes": 2,
      "replies": {}
    },
    "ghcqhnt": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghcqhnt/",
      "text": "Really needed to hear something like this right now. I've been experiencing a lot of depression and struggling a lot with my work, thinking of dropping out of my program. This is motivating me to seek help. Thank you and God bless! Prayers for your continued progress and, most of all, for a happy life!",
      "author": "ParagonAlex333",
      "created": 1609209613,
      "upvotes": 2,
      "replies": {}
    },
    "ghcpkf0": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghcpkf0/",
      "text": "Your post made me cry. No kidding, I read up so many people’s stories on r/ADHD I’m kind of numb to it all. Yours was different though. It definitely hit a nerve when you said you felt ‘capable again’ and ‘not to feel like I had to *hide from my own life*’. That was when the flood of emotion just came over me.\n\nFor so long I kept denying I had a problem and ‘coasted’ through my life (I even had an elementary teacher tell me I could accomplish more in my life if I tried more). It sucks. I hate that feeling you describe where a deadline comes and goes and you feel.....nothing?\n\nI’m in that weird phase between undergrad and applying for grad school...only I’ve been stuck at the applying part lol. \n\nI don’t want to ramble, but I just want to say thank you for making me feel not alone and for giving me hope for the new year. I already have my diagnosis and prescription, but I still feel like I do the same routine. Maybe the missing ingredient is finding someone to talk to?",
      "author": "DasRaetsel",
      "created": 1609209118,
      "upvotes": 4,
      "replies": {
        "ghn6y3v": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghn6y3v/",
          "text": "Thanks so much for the kind words. I'm so glad it struck a chord and was helpful. I totally know what you mean about coasting through life, and that feeling of nothingness when you miss a deadline. I've spent so much of my life feeling like a fraud for being around (apparently) motivated and ambitious people but not feeling any of that myself.\n\nI think having someone to talk to is definitely helpful--the academic coach I worked with was especially helpful for me. I also think the grad school application process can be especially challenging because you often aren't in any kind of community with other people doing it, so you don't even have other people around you to help you be accountable or just commiserate during the process. I hope you find something that helps!",
          "author": "zayexi",
          "created": 1609450163,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ghc8okg": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghc8okg/",
      "text": "Thank you for sharing, this was really inspiring and hit close to home! I'm in the first year of my PhD and was diagnosed with ADHD during my second year of undergrad. I was close to having to switch out of being a science major because of my poor performance in core classes and decided to get tested since I really was at a loss for what was \"wrong\" with me.\n\nIt's amazing how getting the support and accommodations you need makes a huge difference for both academic performance and mental health. I relate to how being the \"quiet, obedient\" girl growing up might have been a core reason why getting tested earlier in life didn't happen. I'm so glad you're getting compassion and support from your program, good luck with your dissertation and everything else!!",
      "author": "a_gay_to_remember",
      "created": 1609199947,
      "upvotes": 4,
      "replies": {}
    },
    "ghc8muz": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghc8muz/",
      "text": "Thank you for sharing your experience. \n\nI am a senior and I am going to start my PhD track in fall 2021. I am on the autism spectrum with Aspberger's syndrome and have severe worries about my fit in any programs. Any advice?",
      "author": "philliesdude1",
      "created": 1609199922,
      "upvotes": 2,
      "replies": {}
    },
    "ghbv5ih": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbv5ih/",
      "text": "Came here to say I was also diagnosed with ADHD in my 6th year. I struggled to focus on work more than an hour or two a day and inevitably I would switch focus. I had inquired about ADHD as an undergrad and it was dismissed as 'imposter syndrome.' While that is a real thing, my insistence that it wasn't was disregarded. After I inquired again as a graduate and was prescribed medication, I could control my focus. My whole world changed. I felt like I finally had some agency.\n\nI still need to support my focus with sleep, nutrition, water, exercise, rest, and I won't be able to focus if I'm really distracted or upset, but under normal circumstances I can control my focus.  I still need help with some little quirks - like forgetting key terms, and I needing to check myself on how hyperfocused I may be getting on something, but those things are manageable. \n\nI'm sad that I didn't receive the medical support that I needed earlier, but grateful that I received it all. I am also grateful that my advisor was supportive in the process.",
      "author": "astromonerd",
      "created": 1609192660,
      "upvotes": 3,
      "replies": {}
    },
    "ghbrwya": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbrwya/",
      "text": "I'm relating with your story and with a lot of commenters in this thread. I have a question - do you think you would have got your diagnosis had you not been in \"crisis mode\"? For some reason I'm terrified of going to a doctor to find out if I have ADHD because I'm worried they'll laugh at me and turn me away, and it feels weirdly like my last recourse so I don't want to expend it lmao. I'm coping with my PhD as of now, and have developed tons of strategies to manage my work, but if I have a single traumatic experience like you did, I can imagine it all absolutely vanishing in the blink of an eye. I'm fairly sure I have some level of ADHD. One university therapist I talked to in undergrad suggested I get tested, but I didn't know how and I didn't (I still don't know how lol). I was \"spacey\" as a child too, and am now as well. I'm famous for not noticing things around me. I'm 100% all or nothing when it comes to focus. Unless a schedule is imposed on me, I absolutely cannot keep a schedule. There are a lot of ways in which I'm able to be competent right now, but I'd like to stop living on hard mode lol.",
      "author": "dantparie",
      "created": 1609190947,
      "upvotes": 3,
      "replies": {}
    },
    "ghbr0eh": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbr0eh/",
      "text": "This is encouraging to hear. I also have ADHD but when I was little my evaluation was messed up for a number of factors so I didn't get to start taking it seriously until later in life. \n\nIt is really good to hear how well the medication worked. I've been skeptical about trying it plus the financial hurdle of getting re-diagnosed, but I think if I get stuck on that phase it might also be the answer. \n\nIts great that you are doing better and yes, reading this was very helpful :)",
      "author": "lithobius1814",
      "created": 1609190475,
      "upvotes": 1,
      "replies": {}
    },
    "ghbqubn": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbqubn/",
      "text": "Thank you so much for writing this! As a second year grad student with a new ADHD diagnosis it’s relieving to hear that you were able to make a comeback. Also kudos on your engaging writing. I’m surprised I was able to stay focused enough to read through all that!",
      "author": "PepperoniPerson",
      "created": 1609190388,
      "upvotes": 3,
      "replies": {}
    },
    "ghbp9p4": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbp9p4/",
      "text": "This sounds like certain things I struggle with. I keep attempting to get it checked out in a school official way but that department has not been good about replying to my emails. I hope such aspects might allow my committee to cut me some slack on deadlines such as how long I am supposed to be allowed in the program.",
      "author": "Pagi101",
      "created": 1609189561,
      "upvotes": 1,
      "replies": {}
    },
    "ghboxpy": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghboxpy/",
      "text": "Thank you for writing this! I went through a very similar situation when I was writing my Masters thesis and I was lucky that, even after struggling with communication for months, my advisor met me with nothing but empathy and understanding. I really wish this weren't so uncommon!\n\nLast year, one year after finishing my Masters, I discovered that I am autistic and it was a huge relief to finally understand why I struggled so much. Receiving proper care has been life-changing. I'm going to start my PhD in 3 months and, while I believe I'll have a hard time during the writing process again, I also know that I have the right resources to make it work better this time.",
      "author": "LukewarmMushroom",
      "created": 1609189387,
      "upvotes": 2,
      "replies": {}
    },
    "ghb1k65": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb1k65/",
      "text": "Wow, I've pretty much known I had ADHD for a while now, but I think you've just shown me how much it is actually affecting me. I could've written half of this post about my Master's program. Except my issues are compiled with the fact that my advisor rarely responds to my emails. And my co-advisors never respond at all. I have no idea why. I assume they want me to just quit at this point, but yeah. Maybe I'll call my doctor.",
      "author": "stmasc",
      "created": 1609177593,
      "upvotes": 5,
      "replies": {
        "ghb9bym": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb9bym/",
          "text": "I'm sorry you're also struggling and that your advisors are MIA. Unfortunately, I've heard from way too many other grad students about advisors who rarely or never reply or check in (and even my advisors, for all that they stepped up during this situation, have generally been more absent than ideal, which certainly didn't help when I was in the earlier stages of writing paralysis). \n\nI definitely didn't appreciate the extent to which ADHD was actually affecting me until I started addressing it, and especially until I started medication.  I hope that calling your doctor helps if you decide to go that route and that you're able to find the support you need or want!",
          "author": "zayexi",
          "created": 1609181476,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ghaypme": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaypme/",
      "text": "Good thing you actually had decent human beings as your advisors. I didn't, so I almost suffered a mental breakdown due to chronic stress, overwork (had to both study and work to pay off student debt), but that luckily didn't happen cause I simply left my PhD studies. One of the better decisions I made actually.",
      "author": "VladimirLogos",
      "created": 1609176145,
      "upvotes": 4,
      "replies": {
        "ghb8w6p": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb8w6p/",
          "text": "I'm so sorry your advisors didn't treat you like a human being. Unfortunately, I have heard way too many stories from people who have had similar experiences, including in my own department. It's awful the way academia often preys on people's imposter syndrome and mental health issues and then gaslights them into thinking it's their fault. \n\nI sometimes wish I had listened more to my grad student friends who warned me about these things before I started grad school--I was rationally aware of these problems, but never thought they'd affect me as much as they did. I'm glad you were able to make the decision that was right for you and wish the circumstances you made them under had been better.",
          "author": "zayexi",
          "created": 1609181262,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ghaxpfd": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaxpfd/",
      "text": "Do PhD programs normally last 7 years?",
      "author": "orangeblackteal",
      "created": 1609175635,
      "upvotes": 1,
      "replies": {
        "ghb8d9u": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb8d9u/",
          "text": "It depends a lot on the program/institution. In my department, most people finish in 6-7 years. 5 is exceptionally fast, and 8 is slow but not unheard of. That's in large part because we have pretty strong funding and teaching opportunities, coupled with a pretty terrible job market (so to some extent staying in the PhD can feel like the preferable thing to do, even if you *could* finish faster...which I think definitely played a role in my paralysis).",
          "author": "zayexi",
          "created": 1609181000,
          "upvotes": 1,
          "replies": {
            "ghbb1a8": {
              "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbb1a8/",
              "text": "Understood, thank you. The reason I ask is because I'm a 44 year old junior, English major. I'll be applying for grad school soon and was curious about pursuing my doctorate as well but was unsure on a timeline. I don't know if I want to just be getting my PhD at that age or not.\n\nEdit: Spelling",
              "author": "orangeblackteal",
              "created": 1609182314,
              "upvotes": 1,
              "replies": {
                "ghbbif1": {
                  "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbbif1/",
                  "text": "Makes sense! If you end up reaching out to programs to discuss applying, I bet they'd be happy to talk to you about what a typical timeline looks like in their program. I think most departments would be delighted if you finished in 5 years (or even 4!), but often teaching responsibilities and other factors can make that challenging.",
                  "author": "zayexi",
                  "created": 1609182553,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ghavrol": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghavrol/",
      "text": "Ack are you me?? Don't give up!! Treating your adhd will change your life, I promise. Hang in there",
      "author": "kiwithrown",
      "created": 1609174637,
      "upvotes": 6,
      "replies": {
        "ghb86oh": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb86oh/",
          "text": "It's been so surprising (and helpful!) to realize the extent to which an experience that felt so isolating is actually shared. I already feel like starting treatment has made a huge difference and I definitely want to keep that going. I wish I'd figured it out sooner, but am grateful that I have now.",
          "author": "zayexi",
          "created": 1609180908,
          "upvotes": 3,
          "replies": {
            "ghbaa0a": {
              "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbaa0a/",
              "text": "[deleted]",
              "author": null,
              "created": 1609181940,
              "upvotes": 4,
              "replies": {
                "ghbav15": {
                  "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbav15/",
                  "text": "Thanks for sharing this. I've struggled with self-harm and suicidal thoughts intermittently since adolescence and never realized until starting medication how much of it was related to ADHD. Even though I'd suspected I had ADHD for several years before this, it didn't feel like a \"big\" enough problem to account for the level of distress I felt, and I thought I should just be able to deal with it on my own. It's amazing, but also a little sad, to realize that the reason so many other treatments seemed only to work partially was because they weren't addressing one of the root causes of what was going on.",
                  "author": "zayexi",
                  "created": 1609182228,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ghaqqc6": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaqqc6/",
      "text": "I have been weirdly sus that I have ADHD",
      "author": "Thecatofirvine",
      "created": 1609171971,
      "upvotes": 3,
      "replies": {
        "ghb7wfe": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb7wfe/",
          "text": "I'd definitely get it looked into if you have access to resources to do so--a therapist first suggested the possibility to me about three years ago, and I wish I'd looked into it sooner (but am so grateful to him for mentioning it so that I felt more able to get help when I was ready to do so).",
          "author": "zayexi",
          "created": 1609180765,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghapwob": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghapwob/",
      "text": "I’m also an ADHD grad student that discovered it late in life (32, I’m now 36). It’s a crazy ride of discovery the first couple years after diagnosis. Just be gentle with yourself.",
      "author": "ImperiousMage",
      "created": 1609171520,
      "upvotes": 9,
      "replies": {
        "ghb6fq9": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb6fq9/",
          "text": "Thanks for the kind words. I'm 33, and it's strange to think about how different my twenties might have been if I'd discovered this earlier. I'm definitely in an excited/hopeful \"omg everything makes sense\" phase right now, and I know that when that wears off I'll still be dealing with a lot of the deeper issues that have been building up over the last couple decades, so I really appreciate the reminder to be gentle with myself :)",
          "author": "zayexi",
          "created": 1609180031,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ghap9xo": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghap9xo/",
      "text": "I passed the adhd pre-screening with flying colors back in September, right before starting my first year of grad school. My health care provider has been dicking me around ever since, passing me from person to person in the mental health department without ever sending me to a psychiatrist. I switched providers starting in the new year so I really hope I can be evaluated ASAP. \n\nMy first quarter went alright, I did fine but not my best. Luckily I’m still riding on first year motivation but I know that will fade quickly. Your post has given me hope! Press on.",
      "author": "rawrpandasaur",
      "created": 1609171168,
      "upvotes": 2,
      "replies": {
        "ghb7psq": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb7psq/",
          "text": "Good luck! The mental health care system is so frustrating to navigate. I hope you're able to keep finding strategies to help you succeed in grad school while you work on addressing the underlying issues.",
          "author": "zayexi",
          "created": 1609180672,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ghaoemc": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaoemc/",
      "text": "A fellow ADD-er in a PhD program (finally diagnosed in my M.S. program). I'm so glad you had people looking out for your best interests. After struggling for so long, there's so much about the way my brain works that I appreciate, and learning tools to make the best use of it in spaces that aren't designed for us has made such a difference. If people aren't sure and able to, I encourage you to look into it for yourselves. Adult ADD/ADHD presents differently than in childhood and for different people, don't let anyone try to dissuade you/gaslight you/intimidate you from seeking the support you need (goes for anything really).",
      "author": "coffeejaunt",
      "created": 1609170673,
      "upvotes": 10,
      "replies": {
        "ghb64t4": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb64t4/",
          "text": "Yeah, it's definitely been revelatory to finally feel like my brain makes sense to me. I always felt like a fraud because I was able to produce work that other people found interesting despite not having the discipline of the people I saw around me, and because I was constantly relying on hyperfocus to get me through deadlines, I constantly felt like my ability to succeed might vanish at any moment. (So, when it did, it felt like a fulfillment of the inevitable rather than something I could get help for.) I really, really appreciate having people around me who were looking out for me and able to see the signs.",
          "author": "zayexi",
          "created": 1609179879,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ghal350": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghal350/",
      "text": "I seriously needed to read this. Thank you u/zayexi",
      "author": "manc4life",
      "created": 1609168727,
      "upvotes": 2,
      "replies": {
        "ghb81sg": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb81sg/",
          "text": "I'm so glad it was helpful; I know reading something like this would have meant the world to me several months ago. I hope you're able to take whatever steps are right to get the support you need or want.",
          "author": "zayexi",
          "created": 1609180839,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ghajmly": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghajmly/",
      "text": "This hits home, hard.\n\nBeing terrified of checking email, hurrying to avoid seeing anyone in person, even fully expecting anger and disappointment, and seeing concern instead parts all resonate with me deeply. I even refuse to turn my phone on as I am afraid they'd start calling or texting.\n\nI am your academic soul sister, except a couple years younger. I've decided to leave my program instead of completing my PhD. I have no idea what to do with my life next. \n\nI doubt anyone will give me a positive reference due to my inability to meet deadlines.\n\nThe shame-storm is real.",
      "author": "Performance_Mediocre",
      "created": 1609167829,
      "upvotes": 16,
      "replies": {
        "ghb556o": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb556o/",
          "text": "I'm sorry you're also going through this! I have gradually realized that these kinds of experiences are way more common than I believed.\n\nI hope you're able to find the next step in life that is right for you! I'm similarly struggling with the fact that if I do manage to finish my degree this year (big if...), I have no idea where I'll go next. I was always ambivalent about staying in academia, and the past couple years have really eroded my confidence that I could be happy and successful in an academic research job even if I manage to get one. My perspective on that is starting to change, especially with the medication, but I still feel really uncertain about it and also feel like I might have burned all my bridges and squandered my opportunities anyway.\n\nYour sentence about doubting anyone will give you a positive reference hits hard for me...every time I even think about applying for something this thought screams at me and makes me want to give up before I've even begun. And even though I'm trying to be more compassionate to myself, a big part of me still feels like I deserve it for having failed in pretty much every responsibility in my life this past year.\n\nGood luck figuring out life post grad school. I hope we both find what works for us!",
          "author": "zayexi",
          "created": 1609179384,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ghagq4n": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghagq4n/",
      "text": "this resonated with me so much..the line about, \"hiding from my own life\" i paused reading there for a sec bc thats exactly what i felt like for me at my lowest point a few months ago this year. the part about waking up every day thinking, okay this is the day i get it together, but then seeing the day pass and having to tell myself i had wasted yet another day. i frlt terrible for myself, yet i didnt feel i could do much for myself. very lonely and shameful experience indeed. \n\nthank you for sharing your story. im really glad youre feeling better.",
      "author": "sparklemoonflowers",
      "created": 1609165944,
      "upvotes": 19,
      "replies": {
        "ghb31qv": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb31qv/",
          "text": "It's an awful feeling, isn't it? For me, it became a physical sensation that I dreaded waking up to every morning. I hope things are feeling better for you, too!",
          "author": "zayexi",
          "created": 1609178337,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ghaf928": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaf928/",
      "text": "Good for you this is really great. \n\nGotta say tho I really hope they are not this lenient for medical doctors😅",
      "author": "CountReefer",
      "created": 1609164919,
      "upvotes": -8,
      "replies": {}
    },
    "ghadad3": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghadad3/",
      "text": "Oh Lord...this seems eerily similar to my story. I’m an Undergraduate graduating soon and looking into grad school. I may have to get myself checked.",
      "author": "jessekene",
      "created": 1609163486,
      "upvotes": 5,
      "replies": {
        "ghb3kx3": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb3kx3/",
          "text": "Good luck getting it checked out! I wish I had way earlier than I did. I really wonder how things could have been different if I had.",
          "author": "zayexi",
          "created": 1609178603,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghackrh": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghackrh/",
      "text": "Thank you for sharing this. I've been struggling this year too. I relate with feeling like I'm self-sabotaging. Glad to know things are looking up. :)",
      "author": "pluviasolaris",
      "created": 1609162949,
      "upvotes": 5,
      "replies": {
        "ghb3chs": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb3chs/",
          "text": "I'm sorry you've been struggling too--that feeling of self-sabotage is awful, it really sucks feeling like your failings are your fault but also feeling powerless to do anything about them. I hope things start to look up for you, too!",
          "author": "zayexi",
          "created": 1609178486,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gha8k9p": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gha8k9p/",
      "text": "thank you this really helped me this morning. I have had all of the reactions you describe, and its so painful when I feel like I am failing myself on things that a 15 year old could do. And I'm only on a Masters. Thanks and do you have any advice for the writing/revising part... whenever I see my words on a page I hate them immediately, and I can spend an hour on 2 sentences and when I come bak to them later I don't even like them. I am already on adhd and anxiety medication.\n\nThanks and I'm glad you found the answers you did!",
      "author": "Crab_manager",
      "created": 1609159563,
      "upvotes": 9,
      "replies": {
        "ghb2iiz": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb2iiz/",
          "text": "I'm so glad it helped! Yeah, it is really painful to feel like you're failing on things without understanding why they are so hard for you when they seem like they \"should\" be so easy.\n\nFor writing/revising, the thing I have found probably most helpful is to just write a highlighted note to myself in text when I find myself ruminating over a sentence/passage. Often it'll be something as simple as \"Try to make this more precise later\" or \"Not sure if this actually makes sense.\" (For some reason, I find it more helpful to do this in-text than in a comment.) This often helps me to move on (and to be honest I usually end up never returning to those comments and just deleting them in the final draft, haha). Maybe you've already tried this but I thought I'd mention it in case you haven't.\n\nI also have found accountability sessions with other graduate students to be pretty helpful--we usually meet either via Zoom or just text, state a goal for the hour, and then check in at the end of the hour to see how it went. I find it most helpful to do it with people I trust to be non-judgemental, so that I don't get defensive/defeated/just lie about my progress. I find it helpful having the little bit of extra motivation of stating a goal, but equally important for me is the conversations afterwards, since they often help me realize that I'm not alone in what I'm struggling with.\n\nLastly, I'm not sure how to make this into something immediately useful, but on the revising front, I found that actually finishing revising a chapter made subsequent revisions feel a lot less daunting. The truth is that I'd basically never truly revised anything in my life up until now (including any of my papers during coursework), so I had a ton of doubt as to whether it was something I was even capable of. Unfortunately, that's kind of putting the cart before the horse, though...but I definitely think that there's some truth to the idea that if you can find tricks to get yourself into the habit of doing something that feels hard, it will start to feel less hard as time goes on.\n\nI hope some of this is helpful! Good luck with your graduate work and finding solutions that work for you.",
          "author": "zayexi",
          "created": 1609178069,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gha7gmi": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gha7gmi/",
      "text": "Accepting that you have a mental illness can be an arduous task. Finding the right combination of medicine and support is key-and staying consistent with your medicine regimen is one of the most important aspects of dealing with your ADHD.\n\nHang in there friend. And of course always reach out for help in the future if you need it.",
      "author": "Mathemathematic",
      "created": 1609158545,
      "upvotes": 10,
      "replies": {
        "ghb7jde": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb7jde/",
          "text": "Thanks for the kind words :) Something that was strange for me was that even though I was pretty sure I had ADHD a couple years ago after a therapist suggested it for the first time, for a long time it didn't feel like a \"real\" or \"big\" enough problem to me to merit seeking help or to explain the distress I was experiencing. I felt like it was something I should be able to deal with on my own (especially since I more or less had for quite a while), and that if I couldn't then that was just laziness.\n\nWhat I especially didn't realize until starting medication recently was how much it had affected not only my academic success, but also my sense of self-worth and my emotional well-being. Looking back, I also realize that it also probably had a lot to do with my difficulty fitting in socially at school--both because of my spaciness and the difficulty I had taking care of myself, which made me feel different from the other girls without understanding why--and I think that had a lot of long-term ramifications for my sense of self. \n\nA lot of the psychological distress I felt so deeply connected to my basic sense of self that I couldn't believe it could be related to ADHD, which I perceived as just being about having trouble making deadlines or finishing tasks. While certainly there are other factors involved, I wish I'd realized sooner how big a role ADHD was playing and that help was available that could make a real difference for me.",
          "author": "zayexi",
          "created": 1609180582,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gha24nl": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gha24nl/",
      "text": "I was in my 7th year of my bachelors degree. It is nice that I had lots of coping skills and then got medication on top of it.  Sucks it had to suck so bad to get a diagnosis but im happy for you now!",
      "author": "bitetheboxer",
      "created": 1609153065,
      "upvotes": 12,
      "replies": {
        "ghb0wm9": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb0wm9/",
          "text": "Yeah, I definitely appreciate that I developed coping skills before being diagnosed, but am also sad that it took those coping skills totally breaking down to get a diagnosis and be able to seek help in a more intentional way. I definitely wonder how things might have been different if I'd been diagnosed sooner; it's unfortunate that the fact that I managed to (mostly) succeed in spite of challenges posed by ADHD symptoms meant that I wasn't able to access resources that could have made it easier on me.",
          "author": "zayexi",
          "created": 1609177265,
          "upvotes": 2,
          "replies": {
            "ghb8jwj": {
              "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb8jwj/",
              "text": "Ouch. Lol. I was diagnosed as a kid but rejected all of it. Till my mid 20s. Not that you would have. But it does put that particular might have been in perspective for me. Oh also there's a subreddit r/adhd\n\nSometimes helpful, aometime people calling everything adhd that isn't. But its nice to share it and have people understand. And a few times someone put something into words so clearly for me I couldn't believe it.",
              "author": "bitetheboxer",
              "created": 1609181092,
              "upvotes": 3,
              "replies": {
                "ghb9moh": {
                  "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb9moh/",
                  "text": ">Sometimes helpful, aometime people calling everything adhd that isn't. \n\nHaha, yeah, I've browsed that subreddit and some other social media groups and the \"calling everything adhd that isn't\" thing is definitely real. (But I guess understandable, since it can be such a relief to have something that makes sense of your experience that it's tempting to extend it to everything.) And it's definitely nice when people do put something into words that you'd always assumed was just an idiosyncratic experience or a character flaw :)",
                  "author": "zayexi",
                  "created": 1609181622,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gha0r1v": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gha0r1v/",
      "text": "I'm glad to hear a positive experience with this kind of thing. All I can say is, mine was not like that at all. It feels really good to know there are advisors who still care and value us as people. That's really really refreshing!",
      "author": "chemkitty123",
      "created": 1609151572,
      "upvotes": 5,
      "replies": {
        "ghazxi8": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghazxi8/",
          "text": "I'm so sorry that you didn't have a positive experience :( Unfortunately, I have heard way too many stories from people who also didn't, including in my own department. I hope that starts to change; it's awful having an environment that preys on people's imposter syndrome, exacerbates mental health issues, and then gaslights them into thinking it's their fault that they aren't succeeding :(",
          "author": "zayexi",
          "created": 1609176766,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gha0guu": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gha0guu/",
      "text": "This post came like a deus ex machina , as a PhD student who is suspected of adhd but cannot get the diagnosis due to corona induced changes to the health care system in Germany, who has been unable to leave his bed since 8 am (and it's almost 12 now), reading your post all I could think of was \"damn it must be the meds working for her, because I cannot imagine having the motivation to write up such a big post, hell is probably forget midway what I am doing\" \n\n\nThanks op, good luck in your research and career.",
      "author": "aaman2018",
      "created": 1609151262,
      "upvotes": 34,
      "replies": {
        "ghazlga": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghazlga/",
          "text": "Dealing with this during a pandemic is so hard! If I were back at my university, I suspect I still wouldn't be diagnosed due to the telehealth constraints. (Which felt a little frustrating--like, I appreciate the fact that the pandemic has upended things for everyone, but it felt a bit like the university health services was failing to recognize the fact that this was a real quality of life issue, not just a frivolous or minor complaint.)\n\nWhat ended up working out (accidentally) well for me is that I moved to a different state to be closer to family while writing remotely, and this required me to find an in-state psychiatrist. Luckily, they were able to do the evaluation. I definitely waited until the very last minute (when I was running out of my Wellbutrin prescription, lol) to make the appointment, though.\n\nGood luck to you, too--I hope you're able to get evaluated soon and that you're able to find strategies and resources that help make grad school more manageable in the meantime!",
          "author": "zayexi",
          "created": 1609176595,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gh9xlv0": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gh9xlv0/",
      "text": "Thanks for sharing. I’ve been suspecting I have ADHD for the last 4-5 years m, and I’m currently in paralysis mode right now. I’m glad I’m not alone feeling this way!",
      "author": "GrumpyCockatoo",
      "created": 1609148121,
      "upvotes": 54,
      "replies": {
        "ghaw3gj": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaw3gj/",
          "text": "I'm sorry you're in paralysis mode--I'm glad this helped you feel less alone, and I hope you find a solution that works for you!",
          "author": "zayexi",
          "created": 1609174808,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "gh9wi5h": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gh9wi5h/",
      "text": "I relate to this SO HARD it's scary. Like, are you me ? The only clue is that you're in the humanities and I'm doing maths.\n\nI didn't get officially diagnosed with ADHD, though, but it's all but confirmed.\n\nAnyways thank you so much for sharing, it feels so validating and it is very helpful !",
      "author": "robertofontiglia",
      "created": 1609146922,
      "upvotes": 10,
      "replies": {
        "ghb17j3": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb17j3/",
          "text": "I'm really glad it feels validating and helpful! It has been eye-opening to me to realize that so many things that I perceived as individual failings, and couldn't understand my inability to address, are actually widely shared and manageable. Good luck with your grad work and continuing to find resources to help with the ADHD!",
          "author": "zayexi",
          "created": 1609177419,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gh9w6xs": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gh9w6xs/",
      "text": "I am in the throes of ADHD related paralysis and have found myself unable to make any progress toward completing my MA thesis even after delaying repeatedly... reading your story has given me hope and encouragement that I might turn things around and get the chapters finished in the coming months. Thanks for sharing.",
      "author": "stinky-french-cheese",
      "created": 1609146581,
      "upvotes": 28,
      "replies": {
        "ghaw95d": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaw95d/",
          "text": "I'm glad it was encouraging, and I hope you're able to find resources and strategies to help you finish your chapters! Good luck with the thesis :)",
          "author": "zayexi",
          "created": 1609174890,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "gh9uduw": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gh9uduw/",
      "text": "I am in the process of getting the appointment of getting tested for ADHD and recognize so much of what you've been going through. Thankfully including the supportive advisors, it's pretty great to know that when I'm not doing well they are more concerned about me than my work.",
      "author": "MarijnBerg",
      "created": 1609144656,
      "upvotes": 16,
      "replies": {
        "ghaxold": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaxold/",
          "text": "I'm so glad you also have supportive advisors! Hearing them tell me that they cared about me above my work was honestly huge for me. Good luck setting up the appointment and with the whole process!",
          "author": "zayexi",
          "created": 1609175624,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gh9tm8e": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gh9tm8e/",
      "text": "Thank you for sharing your story. I have long suspected I have ADHD (as has my family, husband, and close friends), but the fact that I'm a woman in my mid-30s who is otherwise \"successful\" has always prevented me from being tested.",
      "author": "SuurRae",
      "created": 1609143848,
      "upvotes": 49,
      "replies": {
        "ghaxezj": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaxezj/",
          "text": "I had two therapists and several friends suggest that I had ADHD before things got this bad, but I never sought help (even though I suspected they were right) because I felt like I should be able to deal with it on my own. \n\nIt bothers me a lot that it took things getting so bad for me to be able to get help and be evaluated. In retrospect, there were a ton of signs when I was a child/adolescent, but none of the (several) mental health professionals I saw back then noticed it because the only thing that seemed to be acutely \"wrong\" was in the realm of emotional distress rather than schoolwork or behavior.\n\nAnyway, I hope you're able to find a doctor who takes your concerns seriously and who recognizes that just because you've generally succeeded in spite of the challenges posed by ADHD symptoms, doesn't mean you should have to keep fighting an uphill battle when resources exist that could make things easier on you.",
          "author": "zayexi",
          "created": 1609175489,
          "upvotes": 14,
          "replies": {}
        },
        "ghaa38r": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghaa38r/",
          "text": "I'd suggest looking for a neuropsychologist or a psychiatrist specialized in ADHD in adults, preferably one who has experience with ADHD in women. It can be hard to get a diagnosis, but it is not impossible.\n\nThere are plenty of us \"successful\" women who managed to get their diagnosis as adults. It's hard, but it is possible.\n\nI'd suggest checking out r/GiftedADHD, there are plenty of us that are (or were) in your situation.",
          "author": "couverte",
          "created": 1609160910,
          "upvotes": 20,
          "replies": {
            "ghb0qqj": {
              "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb0qqj/",
              "text": "The subreddit is private, unfortunately.",
              "author": "seacucumber3000",
              "created": 1609177181,
              "upvotes": 4,
              "replies": {
                "ghb0w1q": {
                  "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb0w1q/",
                  "text": "You can send a request via modmail,",
                  "author": "couverte",
                  "created": 1609177257,
                  "upvotes": 6,
                  "replies": {
                    "ghb61ci": {
                      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb61ci/",
                      "text": "How do you do that? I can’t see who the mods are, so I can’t message anyone.",
                      "author": "emily_planted",
                      "created": 1609179831,
                      "upvotes": 2,
                      "replies": {
                        "ghbavzh": {
                          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbavzh/",
                          "text": "There's a \"message the mods\" button in the side bar.",
                          "author": "couverte",
                          "created": 1609182241,
                          "upvotes": 2,
                          "replies": {
                            "ghbbrx1": {
                              "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghbbrx1/",
                              "text": "Thanks! I can’t see it on mobile, but I’ve been approved. It sounds like the perfect sub for me.",
                              "author": "emily_planted",
                              "created": 1609182683,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh9tf34": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gh9tf34/",
      "text": "I was also diagnosed ADHD in my 6th year of my PhD. It's weirdly common. Wrote the first half of my dissertation in 2 years, and the second half in 3 months. The meds make a huge difference. So happy you found something that helps! Congrats!",
      "author": "SuchAGeoNerd",
      "created": 1609143638,
      "upvotes": 81,
      "replies": {
        "ghavxge": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghavxge/",
          "text": "I'm glad you also found something that helps! I've definitely been surprised at how common it seems to be. I suspect academia, especially certain fields, can attract people with ADHD and work pretty well for us until it really, really doesn't.",
          "author": "zayexi",
          "created": 1609174721,
          "upvotes": 10,
          "replies": {
            "ghb23me": {
              "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghb23me/",
              "text": "I think it's common in smart people in general not just certain fields. Like many people who do grad school have adopted techniques throughout their lives that work for them and manage their studies. Our grades never slipped due to our ADHD so no one noticed it. But a PhD is so high stress and intense, those strategies start to fail. When I was first diagnosed they gave me info on methods to manage it with behavior changes, which I was already doing every single one of them before I crashed in my PhD. So I was self managing till then, but needed meds to get through.",
              "author": "SuchAGeoNerd",
              "created": 1609177863,
              "upvotes": 18,
              "replies": {}
            }
          }
        },
        "ghdal45": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghdal45/",
          "text": "words cannot express how much i wish i had received my diagnosis recently (currently in data gathering), and not during my MS in 2014. the drugs only work for so long, enjoy it ❤️",
          "author": "PhDdegreeBurn",
          "created": 1609222008,
          "upvotes": 1,
          "replies": {
            "ghdaorg": {
              "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghdaorg/",
              "text": "Have you tried a different class of drug? Isn't there a bunch you can cycle through?",
              "author": "SuchAGeoNerd",
              "created": 1609222087,
              "upvotes": 2,
              "replies": {
                "ghujma8": {
                  "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghujma8/",
                  "text": "yep yep. i’ve cycled through them all. whenever a new one comes out i give it a try, but tolerance is a bitch.",
                  "author": "PhDdegreeBurn",
                  "created": 1609611772,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gh9slwf": {
      "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/gh9slwf/",
      "text": "Good story! \nGlad you overcame your struggles! 🥳",
      "author": "Big_Daddy_Ivan",
      "created": 1609142790,
      "upvotes": 19,
      "replies": {
        "ghavxz1": {
          "link": "/r/GradSchool/comments/klm97k/7thyear_phd_student_just_diagnosed_with_adhd/ghavxz1/",
          "text": "Thanks!",
          "author": "zayexi",
          "created": 1609174729,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066237
}