{"sid": "a901de", "link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/", "title:": "I have discovered 6 new species in the past 3 years", "text": "Ever since I was a kid, I've wanted to name a new species of something. Anything, really... I just thought it was so cool to be the first person to name an organism. Three years into my grad program, and I have discovered six living things never before seen by human eyes. I've named two of them and have the others waiting on me.  \n\nDiscovering species isn't part of my thesis at all. I do this in my own time. One of the best parts of being in grad school is having 24/7 access to a world-class lab, but these aren't obscure microbes that require multimillion-dollar culture vessels to observe. I'm literally finding these things in puddles, on the side of the road, at the beach. The vast majority of the time, I can key out my critters and bugs with a few days' work in the library or a quick genetic barcode. But those times when I can't... those are the moments that make all this worthwhile. \n\nI went to grad school because I like new things. The irony is that new things are everywhere. You're probably stepping over new things on your way to the toilet every morning. The joy of being a lifelong student is looking where others never thought to look, and seeing what others never dreamed to see. ", "author": null, "created": 1545611689, "retrieved": 1632953504, "over_18": false, "upvotes": 494, "upvote_ratio": 0.97, "comments": {"ech85w8": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ech85w8/", "text": "Awesome work!! Just curious, how does one verify that a species has indeed been undiscovered before (layman here)?", "author": "azn2themax", "created": 1545684337, "upvotes": 1}, "ech0uf3": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ech0uf3/", "text": "This is so interesting...what is the process for discovering a new species? Who is the governing body and what sort of paperwork needs to be filed? Are there any financial ramifications?", "author": "Armadillo19", "created": 1545678641, "upvotes": 2}, "ecg72at": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecg72at/", "text": "What a great post. Thanks for the positivity, OP! :)", "author": "TheWholeCheese", "created": 1545645425, "upvotes": 2}, "ecg6cer": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecg6cer/", "text": "That sounds really fun! What a cool thing to do, hope you find loads more! ", "author": null, "created": 1545644183, "upvotes": 2}, "ecg19hf": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecg19hf/", "text": "I truly love this. This is the scholarly spirit.", "author": null, "created": 1545636340, "upvotes": 6}, "ecfz0uq": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfz0uq/", "text": "I grow crystals and get structures for them and it's really cool to sit there and realize \"wow, no one has seen this compound before!\" Probably the greatest thing in science.", "author": "spookyjeff", "created": 1545633126, "upvotes": 11}, "ecfq20d": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfq20d/", "text": "Cool!  What types or organisms are you waiting to name?  Care to describe them?", "author": "BlueberryPhi", "created": 1545623577, "upvotes": 3}, "ecfopgr": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfopgr/", "text": "My favorite part of this post was when you talked about how these new species were things you just found outside, \"while living,\" not while using multi-million dollar equipment.\n\nIt makes me think about how much we \"rely\" on the academy to provide for thinkers, when really, some of the best science happens outside, in fresh air.", "author": "HoloChild", "created": 1545622280, "upvotes": 8}, "ecfo347": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfo347/", "text": "It's so good to see a post here about someone doing well!    Thanks for this.  Keep up the great work!", "author": null, "created": 1545621672, "upvotes": 11}, "ecfiv6r": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfiv6r/", "text": "[deleted]", "author": null, "created": 1545616651, "upvotes": 21}, "ecfgzfn": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfgzfn/", "text": "Are any of them macroscopic? Either way, congrats!", "author": "iammaxhailme", "created": 1545614864, "upvotes": 15}, "ecfgmzf": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfgmzf/", "text": "Congrats! I study small fish and have an interest in taxonomy as well. I discovered my first new fish species last year while I was on a collecting trip. It's very interesting to me to describe something that no one has ever seen before. ", "author": "Etroyer", "created": 1545614541, "upvotes": 61}, "ecfgmxd": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfgmxd/", "text": "This warms my heart. Thanks for sharing, OP!\n\nAnd let the haters die angry. You do you :)", "author": "Voldy-HasNoNose-Mort", "created": 1545614540, "upvotes": 20}, "ecfffjg": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfffjg/", "text": "Discovering new species is rather pointless if they're not going to be studied afterwards, imagine if one of those microbes produced a new molecule with antibiotic properties, it's great that you found it and it's an accomplishment, but how is it useful to science? A new name among the immense data we're already swimming in? ", "author": "xomikron", "created": 1545613433, "upvotes": -57}, "ecfdx8b": {"link": "/r/GradSchool/comments/a901de/i_have_discovered_6_new_species_in_the_past_3/ecfdx8b/", "text": "Now I want to strive to do this. Thank you stranger!", "author": null, "created": 1545612122, "upvotes": 75}}}