{"sid": "phus7e", "link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/", "title:": "How long did it take you to adjust to moving to a new city, starting a new grad program, while not knowing anyone?", "text": "I'm not even a week in and feel unsettled and so out of place. It's tough and I'm hoping to gauge how long it took others to feel settled.", "author": "Fast_Cheetah_2095", "created": 1630773166, "retrieved": 1632953129, "over_18": false, "upvotes": 73, "upvote_ratio": 0.97, "comments": {"hbony1p": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbony1p/", "text": "I moved to a different country for mine, took me about 4-6 months to feel normal and settled.", "author": "Valeriyah", "created": 1630848768, "upvotes": 2}, "hbohrtx": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbohrtx/", "text": "I'm in my second year now. I moved to a different state, not knowing anybody. Took me maybeeee 6-8 months to finally feel like I had a grip on things. I made friends through classes and work. Don't think that you're unable to make friends in your program! People are more than likely in the same position as you! Don't be afraid to just reach out and ask people what they like to do and that y'all should meet up for coffee/drinks or study together! I've got faith in you! Good luck this semester :)", "author": "rainbowgirl6", "created": 1630845178, "upvotes": 4}, "hbo7b7n": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbo7b7n/", "text": "I settled in fairly quickly, but it was difficult because my boyfriend was about 3 hours away.  We saw each other about once a month.  (This was many years ago). I probably moved into my place a few weeks before the start of school and reconnected with a couple folks I already knew because we went to the same undergrad. \n\nOur graduate group had several orientation-type activities - a party, barbecue, and weekend getaway. All of these things were very helpful. If you don’t have any activities like that, maybe reach out to the other new students in your department and suggest a casual get together?  \n\nRegarding your spouse- definitely schedule daily FaceTime and start planning for visits a month in advance so you have that to look forward to. \n\nMaybe consider traveling home by train so you can do work while traveling and then maybe you can justify more visits. Also, of course, take advantage of being able to work remotely so you can spend more time at home with family. Possibly arrange your class schedule so you can have longer weekends to spend at home (cram all of your classes into the middle of the week). Good luck- I’m sure you’ll feel better when you get busy with classes!", "author": "maybelle180", "created": 1630837089, "upvotes": 3}, "hbnwfpe": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbnwfpe/", "text": "Hopefully soon. It’s kinda lonely", "author": "Glenncinho", "created": 1630827411, "upvotes": 3}, "hbnt5xq": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbnt5xq/", "text": "What do you mean by “adjusting to moving to a new city”? You mean, like, knowing my ways around? \n\nWithin a week, I’d say. \n\nIf you meant like feeling like it’s home, well, probably never.", "author": "OvulatingScrotum", "created": 1630824721, "upvotes": 3}, "hbnrsze": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbnrsze/", "text": "Winter/spring quarter of my first year I started to feel like I was vibing with the program and the city. My first quarter was weird and stressful and lonely.", "author": "MsAggieCoffee", "created": 1630823619, "upvotes": 3}, "hbmt1wl": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbmt1wl/", "text": "Two years in. Still adjusting.", "author": "RageA333", "created": 1630802688, "upvotes": 3}, "hbmn98j": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbmn98j/", "text": "I’m two weeks in and doing what I can to get involved by attending grad student events. It’s a little nerve racking going in alone, but I know it’s the only way to meet people.", "author": "4Mike", "created": 1630799696, "upvotes": 4}, "hbmjavf": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbmjavf/", "text": "About a full year and then some. Mind you just getting into a flow took way less. But that feeling of belonging took longer. You can speed it up by finding some deep friendships and clicking with folks... But only happens if you put yourself in a bunch of situations to meet new people. Your cohort is a good avenue but also any other graduates at your university.", "author": "DigitalPsych", "created": 1630797647, "upvotes": 5}, "hbmbdbk": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbmbdbk/", "text": "When I give talks, I try to think of the nerves as excitement. I did the same with moving, tried to think of it as an adventure rather than leaving where I was. \n\nTry to socialize at least some with fellow new grad students. They are going through the same emotions and can relate. \n\nHow long it'll take is really person dependent. I needed a change of scenery so was quick, but other took much longer.\n\nThe spouse issue sucks. Fortunately, met mine during grad as she was a local. But did have three months later apart during an intern. Texted throughout the day, but a set time every night to facetime/phone call was huge.", "author": "HappyHrHero", "created": 1630793716, "upvotes": 7}, "hbm8mre": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbm8mre/", "text": "I didn’t meet anyone face to face until about 8 months in. Everything was online. I felt incredibly isolated and the current events gave me a feeling of hopelessness. Also I was struggling with chronic fatigue and chest pain for most of that time. I’d say after about a year I’m feeling settled. It’s after getting to know my professors and peers that I’m feeling better. What would have helped me was making friends sooner, because having community is so important.", "author": "TechnologicalDarkage", "created": 1630792387, "upvotes": 4}, "hblzhlo": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hblzhlo/", "text": "Took me nearly two months to have my bedroom/apartment completely set up and to get into an everyday home-and-work routine. \nAcademically, it took me the first whole quarter.\nAnd emotionally, it took me almost three quarters (so pretty much the whole of 1st year)", "author": "Puzzleheaded-Ad9110", "created": 1630788163, "upvotes": 15}, "hblvrvn": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hblvrvn/", "text": "I’m 2 months in to a new country and it’s still an adjustment. Shit is not easy, but now that classes have begun at least I have a more defined schedule and feel like I have a goal", "author": "digandrun", "created": 1630786484, "upvotes": 8}, "hblmtwq": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hblmtwq/", "text": "Took a couple of months, you’ll get there! It helped me to settle into a routine: class, gym, a certain cafe, etc.", "author": "lurkergroove2", "created": 1630782417, "upvotes": 5}, "hblmqbh": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hblmqbh/", "text": "I moved about a month ago and I'm getting more adjusted every day, but I'm still having some terrible homesickness periodically. I'm slowly making friends in my program and adjusting to city life (I moved from a more rural area), but thinking about the next few years away from my family still puts a knot in my stomach. I think it'll get better over time. I hope you start feeling more comfortable soon!", "author": "badatpizza", "created": 1630782372, "upvotes": 9}, "hbli6s9": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbli6s9/", "text": "I'll let you know.", "author": "Pr0gr3s", "created": 1630780317, "upvotes": 31}, "hbl6qz9": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbl6qz9/", "text": "It took a full semester for me. At the time I thought I was just stressed about my workload, but really I think I was missing my friends/family/spouse and my lack of productivity made the workload seem like the problem. Try to accept every social invite you can because building up a support network is crucial in grad school. Also be patient with yourself and recognize that many people don't have the guts to do what you're doing.", "author": "riskingthebiscuits", "created": 1630775198, "upvotes": 30}, "hbl3cxx": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbl3cxx/", "text": "I moved a full month before my program started because i do not adjust well to change. I was lucky enough to have someone a couple years ahead of me take me under their wing. Start small. One friend at a time. They’ve all been there in that weird transition of everything at once.", "author": "ResponsibilityOk617", "created": 1630773717, "upvotes": 47}, "hbl2wik": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbl2wik/", "text": "It’s different for everyone I think, but I’m a month in and just now starting to feel a bit happier with where I am", "author": "anonymousavo", "created": 1630773516, "upvotes": 5}, "hbl2smy": {"link": "/r/GradSchool/comments/phus7e/how_long_did_it_take_you_to_adjust_to_moving_to_a/hbl2smy/", "text": "I moved about three weeks ago I think? I’m starting to feel pretty settled now home/living-wise. Program-wise, we’ll see, so far it’s kicking my ass.", "author": "ThrowawayHistory20", "created": 1630773469, "upvotes": 14}}}