{
  "sid": "pycgd6",
  "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/",
  "title:": "Lost 28 year old looking for some advice/help",
  "text": "Long story short I have a BA in Psychology from Temple University. To pay for school and my rent I worked full time in the restaurant industry (still do) and just got stuck. I found a passion for both counseling and research in my undergrad, but could never find work in a lab to gain any experience. \n\nSince I’ve graduated (2015) I’ve applied to hundreds of lab jobs but I think my restaurant heavy resume turns any potential employer off. I definitely want a masters in psychology but am totally lost as to where to start looking at program options or if I could even get into a halfway decent school (3.2 undergrad GPA). Just looking for any help or advice at all as I know my passion is psychology, and not bartending for the rest of my life.",
  "author": "sirdrinksal0t",
  "created": 1632976423,
  "updated": 1634100339,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hetez76": {
      "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hetez76/",
      "text": "If you want to be a counselor there are several different degrees that will get you there. Grad school in social work, counseling, and marriage and family counseling will also help you become a therapist. Just throwing that out there, good luck to you!",
      "author": "patchworkbanana",
      "created": 1632978711,
      "upvotes": 4,
      "replies": {
        "heth6ct": {
          "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/heth6ct/",
          "text": "Much appreciated!",
          "author": "sirdrinksal0t",
          "created": 1632980166,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hetk44w": {
      "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hetk44w/",
      "text": "This may be a small piece of advice, but I think it may still be helpful and semi relevant if you apply for a grad program or continue looking for jobs. Your resume should be tailored for the job that you're applying for, so if you're applying for a job or school, I personally think it would be better to leave irrelevant positions off of it and only include anything relevant to your degree. If during any interview (job or grad school) anyone asks about gaps - that's when you can be honest about what you were doing. Here's an inverse anecdote: I was applying for a job at a grocery store during school and when I used a lab-heavy resume, I was rejected. But when I resubmitted with a resume more tailored for the position (including my non-lab jobs from high school), I was hired, even though I had those positions 4+ years prior. Kinda silly, but it's an anecdote. \n\nIf someone disagrees or has anything to add, please feel free to respond\n\nGo Owls!",
      "author": "Enjuaguese",
      "created": 1632982268,
      "upvotes": 3,
      "replies": {
        "hetlkgq": {
          "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hetlkgq/",
          "text": "I appreciate the thoughtful reply. What I find difficult with my resume is that if I removed all unrelated jobs to positions I would like (for example, a lab) my resume is empty except for my degree. I got my foot slightly in the door at a small neuroscience therapeutic center (second interview) but they ultimately went with a more experienced candidate. I’ve just found it very hard to spin, on paper, largely customer service and hospitality positions into the career I want (psychology/neuroscience). \n\nAlso go owls!",
          "author": "sirdrinksal0t",
          "created": 1632983387,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hevda1o": {
      "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hevda1o/",
      "text": "I don't know if they still do, but when I was looking at psych grad programs the APA published a book called Graduate Study in Psychology and it listed most, if not all, of the programs in the US and Canada that offered grad programs in psychology. \n\nIt was *extremely* helpful because it was organized by state so I could look at different programs in states I'd want to live in and see a snapshot of the program, whether they offered a PhD in the field I was interested in, statistics of admitted students (if available), admissions requirements, application fees, etc. I used that to form an excel file with the different schools and then went to their websites to look more in depth about the type of research they do. Idk if they still have a paper book or if they have it online, I was only able to find [this](https://gradstudy.apa.org/), which is a monthly subscription.\n\nIt might be worth it if you buy the cheapest option and create a file with all the programs you might be even remotely interested in, and then cancel.",
      "author": "False-Guess",
      "created": 1633021264,
      "upvotes": 2,
      "replies": {
        "hevdp4k": {
          "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hevdp4k/",
          "text": "This is excellent advice I appreciate it!",
          "author": "sirdrinksal0t",
          "created": 1633021438,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hevo2id": {
      "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hevo2id/",
      "text": "Also a fellow 28 year old currently in grad school. It took me years of job-hopping and self-finding to find out which career path I should pursue, so its awesome you found your passion!!   \n\n\nI searched for potential programs and universities on a gradstudies website, but I live in Canada. See if there is a similar search engine like that for the States. It helps to evaluate the basic overview of programs and compare the differences. I also had a 3.2 GPA and was accepted to a few programs before finally choosing my current one. That being said, there are other things to consider in applications, like a portfolio (for my arch. degrees) and statement of intent where I specifically described my research and study interests rather than vaguely stating my qualifications.   \n\n\nFor your resume, you could look into volunteer opportunities related to psychology and counseling. When universities conduct research programs they usually take on volunteers with any amount of experience just to carry out field work or help gather data. Labs may be reluctant to hire people without experience, but they definitely might be open to volunteers! Good luck!",
      "author": "VivamusUtCarpeDiem",
      "created": 1633025726,
      "upvotes": 2,
      "replies": {
        "hexvpab": {
          "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hexvpab/",
          "text": "Appreciate the response! Yea it looks like the plan is to begin looking at graduate programs as well volunteer/internships to buff out the resume. Now to figure out how to pay for all that school…",
          "author": "sirdrinksal0t",
          "created": 1633063709,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hetjtyp": {
      "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hetjtyp/",
      "text": "I hope you get where you want to go! I graduated 2020 spring and was pretty lost. I worked in fast food in the mean time (2021 Aug.). Working towards becoming MLS/CLS and have to renew some classes b/c they are old. It'll be another year or half a year before I can apply to some programs.",
      "author": "Couchpotatoee",
      "created": 1632982054,
      "upvotes": 1,
      "replies": {
        "hetlodc": {
          "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hetlodc/",
          "text": "What is MLS/CLS?",
          "author": "sirdrinksal0t",
          "created": 1632983471,
          "upvotes": 1,
          "replies": {
            "heugh1g": {
              "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/heugh1g/",
              "text": "MLS - medical laboratory scientist, CLS = Clinical Laboratory Scientist. \n\nI keep hearing they are interchangable. They are one of the many kinds of people who are behind the scenes in healthcare. They run tests for healthcare providers that need to know your numbers of different white blood cells, and other kinds of details that I do not currently know. They're paid decently in my opinion and location can change the amount you are paid.",
              "author": "Couchpotatoee",
              "created": 1633007139,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hevhm41": {
      "link": "/r/GradSchool/comments/pycgd6/lost_28_year_old_looking_for_some_advicehelp/hevhm41/",
      "text": ">Since I’ve graduated (2015) I’ve applied to hundreds of lab jobs but I think my restaurant heavy resume turns any potential employer off.\n\nLook for an internship. Even unpaid. And you can still keep working in the restaurant industry while you complete it. That would give you a resume line in your field.",
      "author": "raistlin65",
      "created": 1633023041,
      "upvotes": 1,
      "replies": {}
    }
  }
}