{"sid": "pgc8ax", "link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/", "title:": "How to address the professor you are TA-ing for in an email?", "text": "As the title suggests, I’ve been wondering how I should address the professor of the class I am a TA in emails. I have been using the standard “Hello Professor X”. \n\nIs it weird to call him a professor if I’m his TA? Just for reference, he addresses me as “Mr. X” in his emails", "author": "kingswash", "created": 1630563849, "retrieved": 1632845139, "over_18": false, "upvotes": 14, "upvote_ratio": 0.89, "comments": {"hbjl93h": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbjl93h/", "text": "Go with how he signs his emails is usually the train iOS thought here. He may not be a professor in title.", "author": "cm0011", "created": 1630739573, "upvotes": 1}, "hbdtrth": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbdtrth/", "text": "It's definitely not inherently weird to address the instructor as \"Prof./Dr. Y\", and may be a good habit for you if he prefers that from the actual students.", "author": "aggressive-teaspoon", "created": 1630627736, "upvotes": 1}, "hbdhfjg": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbdhfjg/", "text": "My rule of thumb is Dr. X and if they’re not, Professor X. It is their title, whether they’re YOUR professor or not. That’s my logic.\n\nAfter a few weeks, they will start signing off with their first name, drop the formality, and at that point, you can address them by their first name. Unless they suck 😳😂", "author": "aka_hopper", "created": 1630621911, "upvotes": 1}, "hbdcjp8": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbdcjp8/", "text": "My suggestion is to just go for the most formal greeting first (Dr./Prof. Lastname), and they'll tell you what to call them.\n\nThat way you don't take the chance of offending someone. They get a chance to tell you what to call them without making themselves sound like a prick.\n\nI mean if you call them \"hey Joe\" and they don't like that, it'll be awkward for them to ask you to address them as Dr/Prof. But if you start with \"Hi Prof/Dr\", it's easier to say \"just call me Joe\".", "author": "roonilwazlib1919", "created": 1630619691, "upvotes": 1}, "hbbz95m": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbbz95m/", "text": "Professors are people just call them professor/doctor and if they prefer something else they'll tell you. You are really overthinking things. You need to get over it quickly or grad school is going to be hell because you have way too much other stuff to worry about.", "author": "Tcanada", "created": 1630599631, "upvotes": -1}, "hbbwf6t": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbbwf6t/", "text": "I call them Dr/Prof. depending on whether they're a professor or just a Dr.", "author": "jmr324", "created": 1630598502, "upvotes": 2}, "hbbpeku": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbbpeku/", "text": "“Sup nerd”", "author": "BoostMobileAlt", "created": 1630595622, "upvotes": 4}, "hbbe5xo": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbbe5xo/", "text": "How do they sign their emails to you? That’s usually a good clue. I always start with “Prof. X” but then shift to how they refer to themself.", "author": "jlpulice", "created": 1630590849, "upvotes": 2}, "hbb8e8v": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbb8e8v/", "text": "I work as a TA for a professor at the University I am entollef at and I call him Dr. X everytime. Sometimes I include \"Sir\" in betwern sentences to be polite but I have found that just calling them Dr. X would be better and sufficient.", "author": "Jarrah965", "created": 1630588245, "upvotes": 1}, "hbb3jh3": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbb3jh3/", "text": "If he’s formal enough to call you Mr. X, odds are he’d prefer to be Dr. X or Professor X. It’s not uncommon for grad students to call their professor by their first name (ymmv depending on where you live), but that’s at the prof‘s discretion.", "author": "themathymaestro", "created": 1630585792, "upvotes": 9}, "hbb3b1a": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbb3b1a/", "text": "I usually used “Dr. Last Name” but honestly a few of the professors I TAed for actually told me to call them by their first names after awhile so I’d say just start off being formal and then see how the relationship unfolds.", "author": "14kanthropologist", "created": 1630585668, "upvotes": 6}, "hbabe7w": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbabe7w/", "text": "Definitely not weird. Have they emailed you before? If so, they almost definitely signed it, so just use whatever they signed as (if they didn't sign it, then Professor is still totally fine). \n\nSome have signed on a first name basis, including my thesis advisor, but just like I could never call my parents by their first names I don't think I'll use my advisers first name until I graduate, itll always be professor ___.\n\nHonestly it does feel strange sometimes - when another random grad student asks who I work with, 'professor ___' does feel too formal but its just a polite title that at worst is a little extra formal.", "author": "Poge_", "created": 1630564313, "upvotes": 19}, "hbab4hv": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbab4hv/", "text": "Dr. X", "author": "Charok101", "created": 1630564107, "upvotes": 6}, "hbaaxfp": {"link": "/r/GradSchool/comments/pgc8ax/how_to_address_the_professor_you_are_taing_for_in/hbaaxfp/", "text": "Why don't you ask them? Different people have different preferences.", "author": "Superduperbals", "created": 1630563957, "upvotes": 26}}}