{
  "sid": "q63cx0",
  "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/",
  "title:": "I thought I hated college, but now I miss the pressure and am considering grad school after all",
  "text": "I'm not necessarily looking for advice, but I want to know if anyone has been in a similar situation. \n\n l completed undergrad a year early and summa cum laude. I was basically groomed for grad school by my professors and advisor. I also have been heavily encouraged by my family to pursue that route (I would be the first one to get an advanced degree, and perhaps I'm being cynical, but I also think they suspect academia is the only thing I have \"going for me,\" as I am not interested in having a family, and they want something to be proud of me for). Here's the thing: I thought I hated school. That's the reason I got out early. Specifically, I hated the thought that I could be out in the \"real world\" instead, actually making money. \n\nI worked full-time while in undergrad (service industry). Now that I've graduated I'm in a fairly stable 9-5 with good benefits but lackluster pay. I thought this was what I wanted, but I'm bored out of my mind and I miss the intellectual stimulation of undergrad. I also miss having something to constantly \"work toward.\" \n\n I miss the adrenaline rush from academic pressure, too. Looking back, that's where I was deriving my validation from.  \n\nI do wonder if this is just a \"the grass is greener\" situation. I am hesitant to seriously consider grad school because I truthfully don't care about being a professor or anything all that much. I think I would be truly content to just read and write papers all my life. I worry about debt and job prospects like everyone else, though, so I'm trying to make the most practical decision for my future while also weighing what would actually make me happy. \n\n I would love to hear what some of you think. ",
  "author": "culper-355",
  "created": 1633979739,
  "updated": 1634604490,
  "over_18": false,
  "upvotes": 23,
  "upvote_ratio": 0.82,
  "comments": {
    "hgaxs53": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgaxs53/",
      "text": "I think finding a better job would be better for you than grad school. It sounds like you are motivated by pay, challenge, and intellectual stimulation. There are jobs out there with all that. Go for it!",
      "author": "fwafwa",
      "created": 1634003921,
      "upvotes": 14,
      "replies": {}
    },
    "hg9spvs": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hg9spvs/",
      "text": "Depending on the field you’re in, coursework doesn’t really hold much of the same weight as it does for undergrad. \n\nIt also will depend on your PhD advisor. Some are super laid back and don’t really give you any direction. Some are constantly on your back pushing you to do more & more. It’s a spectrum.\n\nAlso, usually you’ll be publishing stuff in academic journals, so in addition to being criticized constantly by your boss (ideally it’s constructive criticism unless they’re a terrible person) but you’ll also have your work constantly criticized by who ever is reviewing your manuscripts for publication. \n\nThere isn’t a “yes/no/true answer” to “get a good grade” anymore. It’s a lot different.",
      "author": "helloitsme1011",
      "created": 1633984456,
      "upvotes": 7,
      "replies": {
        "hgbsjez": {
          "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgbsjez/",
          "text": "Yep, two completely different beasts undergrad vs grad school. \n\nFar more lonely/self-driven in STEM from what I've seen. Very different focuses overall. Main focus is research, grades/courses come second but you are still expected to get good graders (anywhere from A to high B, many programs will discipline if you repeated get lower grades). If you don't like public speaking, well typically there's a lot of it. Between conferences and lecturing, you'll be speaking in front of larger groups more often. You'll typically TA or be an instructor for around 20-30 hours per week if you do not have a fellowship or research assistantship. Most in STEM work anywhere from 40-90 hours per week total. There will be many times where your field/research will not be fun, it will lose some of it's \"shine\". Several times of higher pressure (quals, defense, even funding/grants, etc.).\n\nI highly recommend you careful consider why you want this PhD, because at the end of the day - it will only be you can drive you to the finish line. It's a marathon that has a 50% success rate. Be sure you're taking it on for the right reasons.",
          "author": "Dismal-Wallaby-2",
          "created": 1634021469,
          "upvotes": 3,
          "replies": {}
        },
        "hg9vdmx": {
          "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hg9vdmx/",
          "text": "I don't want to be too specific but my undergrad work probably aligned a lot more closely with grad level than a lot of people's. I went to a very small institution, in humanities, and 2/3 years were basically self-started research projects. I have also been published and previously worked as an editor, so that process doesn't scare me as much as it should, but that was fiction, so a little different. Grad level is still daunting for the reasons you mention, though I'm mostly concerned about the whole living in poverty and coming out with no job prospects thing, I guess. :/",
          "author": "culper-355",
          "created": 1633985644,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hg9vkbk": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hg9vkbk/",
      "text": "Go for it. Not sure what field you’re in, but a lot of entry level bachelor’s jobs are simple work. For me (bio student), most of my job prospects after undergrad were stuff like lab technician, sample collector, etc. I think I’d be pretty bored doing those jobs.  \n\nWith grad school, my options afterwards are much more intellectual and difficult. That’s exactly what I’m looking for. I need a job where I’m constantly learning and finding new challenges, and it seems like grad school is the only way to get there (you probably could move up the ranks with a bachelor’s, but it would take years).  \n\nIf you want to push yourself, definitely do grad school :)",
      "author": "You_Stole_My_Hot_Dog",
      "created": 1633985728,
      "upvotes": 9,
      "replies": {}
    },
    "hgbidj0": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgbidj0/",
      "text": "I don't know your entire situation, only what's in this post, but in general, I think going to grad school out of boredom or because you miss being in school/having structured incentives is a bad idea. Grad school is nothing like undergrad. Because it's primarily research-based, you don't have the same kinds of incentives to get stuff done (e.g. a good grade on a test or a project). You set the milestones for yourself, or in cooperation with your advisor, and they can and will shift as your projects evolve. Doing research in undergrad gives you a good idea of what this is like, but unless you were in a pretty extraordinary situation, the degree of autonomy that is expected of you as a grad student is still miles above what's expected of you as an undergrad. Things will fail more often than they will work, and there's very little external validation in that. I love grad school, but I know many people who went into it (often straight from undergrad) because they were groomed for it in similar ways, were very successful in undergrad, and had a vague notion that there was still so much left for them to learn. Those people either left or are sticking it out but are miserable. Wanting intellectual stimulation and challenge is necessary but not sufficient IMO.\n\nThen of course, there's the huge opportunity cost associated with a PhD. You lose out on at least five years of earning potential at a time in your career where you could be climbing the ladder. Even if you're in STEM, where stipends are highest, that's a lot of money. If you're in the social sciences and humanities, stipends can be as low as $20K/year, which is barely livable. One of the pieces of advice I heard as an undergrad is that generally speaking, because the cost of doing a PhD is so high, you shouldn't get a PhD unless you have a career goal that is unattainable without one. This doesn't necessarily mean you have to want to be a prof/go into academia (where 95% of people do not make it; that's a separate story), but I think it's important to at least know what your options are post-PhD in a way that's more concrete than \"reading and writing papers\". And if a research-based job where you read and write is what you're after, you don't need to go to grad school to do that.",
      "author": "rudolfvirchowaway",
      "created": 1634014070,
      "upvotes": 3,
      "replies": {
        "hgcg8yx": {
          "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgcg8yx/",
          "text": "This is well-said, and I agree with you. That's why I'm sort of bitching on reddit, I think, instead of just doing the damn thing. I know my reasons are not very good ones, and are at the end of the day driven by my ego. I think another comment that said I need a better job is probably the real best option. \n\nMy degree was in a humanities field (although I work in an unrelated tech job now) so that compounds my hesitation, as I would like to avoid starving to death if at all possible.",
          "author": "culper-355",
          "created": 1634040877,
          "upvotes": 2,
          "replies": {
            "hgoxnq0": {
              "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgoxnq0/",
              "text": "Re-reading my comment now, I think it came off as shorter and more harsh than I intended -- sorry about that! (I have a friend newly-ish out of undergrad who, after several failed attempts at getting into med school, is now looking to apply to grad school -- without any understanding of what that entails -- essentially as a means of giving his life meaning/direction again. I think some of my frustration at him bled over onto you.)\n\nBut yes, tbh a new job sounds ideal for your situation. In any case, grad school will always be there as an option. I'm in the sciences, so I can't speak much to the situation of academia in the humanities, other than that it's much, much worse. The issue as I understand it isn't people being unable to find a job that will pay the bills, but being unable to find one that's worth the years spent on a PhD.",
              "author": "rudolfvirchowaway",
              "created": 1634266003,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hga6hly": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hga6hly/",
      "text": "i worked a 9-5 job and had the same feelings:\"I'm bored out of my mind and I miss the intellectual stimulation of undergrad. I also miss having something to constantly work toward\", which is what pushed me to apply for grad school. \n\nNow i'm in a phd program and feel so much more motivated and energized. Take your shot and pursue a graduate degree, at least you know how the industry life is if you ever consider quitting grad school",
      "author": "International_Pop524",
      "created": 1633990864,
      "upvotes": 6,
      "replies": {}
    },
    "hgazmv7": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgazmv7/",
      "text": "I miss that and the social aspect. Graduated in May, but had to deal with virtual learning. Tried to get into the comp sci grad program where I graduated from, but was denied. I really want to do it, so tomorrow I’m talking to the admin manager for the comp sci program somewhere else.",
      "author": "mynameizham",
      "created": 1634004761,
      "upvotes": 2,
      "replies": {
        "hgcghog": {
          "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgcghog/",
          "text": "I don't miss the social aspect very much, but I'm a miserable hermit on a good day. The thing I hate most about my current job (besides the boredom) is not being able to work from home. \n\nGood luck!",
          "author": "culper-355",
          "created": 1634041023,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgco33j": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgco33j/",
      "text": "I had some of those same feelings when I finished my master's in May '20 and got a super boring job with low pay. I studied a bit on my own time, but eventually landed a challenging and engaging position with much better pay and it's been a relief. While the problems I work aren't aren't on my own terms as they would be in academia, I have work-life balance to pick up new hobbies like gardening and biking that I never would have time or energy for as a student. Spend some time looking at other jobs and it's no hurry, you can resume school in a few years if that still seems like the best decision.",
      "author": "saturnineoranje",
      "created": 1634045170,
      "upvotes": 2,
      "replies": {}
    },
    "hgjft9k": {
      "link": "/r/GradSchool/comments/q63cx0/i_thought_i_hated_college_but_now_i_miss_the/hgjft9k/",
      "text": "I felt this way and I'm 6 weeks or so into grad school and probably about to drop out. If you hated undergrad (I did) and think grad school will be any different it's not, it's much worse. There are more rewarding ways to challenge yourself than diving head first back into something you admittedly hated. Wish I knew this a few months ago",
      "author": "platinumsatan666",
      "created": 1634163307,
      "upvotes": 1,
      "replies": {}
    }
  }
}