{
  "sid": "qpers4",
  "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/",
  "title:": "Non-traditionals: How did you boost your application for your unrelated Master's/PhD?",
  "text": "I'd consider non-traditional students to have pursued graduate studies unrelated to their latest degree. A Master's in Computer Science from a Bachelor's in Biology, a PhD in Financial Economics after a Master's in Physics, a Master's in IT after an English degree, etc. I'd also consider a low GPA to be non-traditional.\n\nHow did you beef up your profile, especially if you did so after graduation?\n\nI want to apply to a Master's in Biostatistics. The program I'm targeting is course-based so no thesis, and is hosted within the university's public health faculty. My Bachelor's is STEM (non-quantitative) with only a minor in statistics. I work in consulting now so unrelated work experience.\n\nI'll need to take up a couple more classes in mathematics, that's for sure. Multivariate calculus, at the very least. Hopefully, I can find some way to take a class in mathematical statistics.\n\nThe GRE is not required for the program I'm targeting, nor is it for most programs I've looked into.\n\nI'm thinking of taking up a casual/part-time research project with a professor working in biostatistics, or public health.\n\nI could also see an argument for a side project, such as the analysis of a public health public dataset to showcase proficiency in statistical methods.\n\nI'd love to hear feedback/anecdotes/thoughts/success stories!",
  "author": "SlapperBapper",
  "created": 1636381700,
  "updated": 1636656573,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.7,
  "comments": {
    "hjtiyg6": {
      "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjtiyg6/",
      "text": "Non-traditional in the low gpa sense ahaha. Anyways, I’m a recent psych major applying to information science PhDs and cognitive science PhDs, and a couple psych masters. My gpa is subpar (2.87/4) but I think what’s really giving me a fighting chance is clear research interests and lots of prior research and work experience. Also my 60/90 gpa is a lot higher. If you approach a professor you’re interested in working with, with a good sense of direction and interest in theirs and your own research then that can really help your chances. You can also leverage your non-traditional major in your personal statement. If you can build a connection with a professor you’re interested in having as a faculty advisor prior to applying, your chances are a lot higher. Goodluck friend!",
      "author": "SlothTheScientist",
      "created": 1636389032,
      "upvotes": 3,
      "replies": {
        "hjtyuli": {
          "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjtyuli/",
          "text": "Ah, definitely feel ya on that uphill battle! \n\nI'm thinking of doing research work on the side which should be fun to balance with a full-time gig.\n\nGood luck with your applications!\n\nIf I can return the favor, I'd recommend that you take up some courses (Coursera, Datacamp, etc.) on R, SQL or Python! Coursera is free if you apply for financial aid (I've applied for like 5 classes and they've all granted me free tuition every time).",
          "author": "SlapperBapper",
          "created": 1636395381,
          "upvotes": 2,
          "replies": {
            "hjtzidz": {
              "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjtzidz/",
              "text": "Having a part-time gig is really nice! I currently work full-time as a ux researcher, and have research going in multiple labs at the moment and it’s great. That’s actually great advice! I’m pretty experienced with Python, but I didn’t know about Coursera’s financial aid! I’ll definitely look into it. Good luck on your applications too friend!",
              "author": "SlothTheScientist",
              "created": 1636395652,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjtb66l": {
      "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjtb66l/",
      "text": "Amazing to see people follow their passion !! I am an Aerospace Engineering undergraduate right now, trying to apply to a Masters in Astrophysics. I know it may not be too far'fetched but it is a switch over from engineering to a science degree. I did NOT have any coursework in Astrophysics at university and was only part of the science club, where I nurtured this interest. But every internship I've done was in the Astrophysics field, with research experience too. Haven't had the luck of publishing yet but I do feel confident working in this domain. I believe any sort of experience in the field you are applying to, can be possibly exaggerated to an amount, to make people know you are passionate. Looking forward to the comments of others as well, cuz it'll help me out too !! Cheers :)",
      "author": "Being_Spastastic",
      "created": 1636385853,
      "upvotes": 2,
      "replies": {}
    },
    "hju6hvs": {
      "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hju6hvs/",
      "text": "Prayers mostly.",
      "author": "LeavesTurnBlue",
      "created": 1636398446,
      "upvotes": 2,
      "replies": {}
    },
    "hjut25n": {
      "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjut25n/",
      "text": "I think your idea for the part time work in that lab is an amazing idea, especially if you communicate with your boss what your intent is- they will likely be ecstatic and help you develop the skills you’d need.\n\nI assume biostats likely needs programming and coding skills as well, there is a variety of free and paid sources to learn things like Python/R/SQL/etc online if you need it.\n\nGood luck!",
      "author": "Pikalover10",
      "created": 1636407487,
      "upvotes": 2,
      "replies": {
        "hjwgwzh": {
          "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjwgwzh/",
          "text": "Yep, you've read my mind! Been stacking up on Coursera and Datacamp classes on stuff like R, Python and SQL. Not sure which will be the MOST useful but I am not willing to take any chances.\n\nThank you!",
          "author": "SlapperBapper",
          "created": 1636434560,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjvig67": {
      "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjvig67/",
      "text": "I was starting grad school as a part-time student (and full-time employee) 7 years after my undergrad in a different field. I initially applied as a non-degree seeking student so that I could build rapport with professors who could write recommendation letters for me once I applied to the actual degree program a few semesters later.",
      "author": "lilibet89",
      "created": 1636418405,
      "upvotes": 2,
      "replies": {
        "hjwh0qf": {
          "link": "/r/GradSchool/comments/qpers4/nontraditionals_how_did_you_boost_your/hjwh0qf/",
          "text": "That's actually a really good idea. I'd love to do that and hopefully I'll be able to take my classes at my local university (ironically my target school too), as my safety option is to take them via an online university.\n\nI'll definitely look into that!",
          "author": "SlapperBapper",
          "created": 1636434621,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}