{"sid": "pniam6", "link": "/r/GradSchool/comments/pniam6/when_to_get_letters_of_recommendation/", "title:": "When to get Letters of Recommendation?", "text": "I'm currently a senior undergrad student in Psychology, and I know I won't be able to go to grad school straight out of undergrad due to my current financial situation. If I plan to go to grad school a few years from now, would it be better to reach out to get letters of recommendation now, or wait until I decide to go?", "author": "jayracc", "created": 1631548632, "retrieved": 1632844602, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hcqc4e0": {"link": "/r/GradSchool/comments/pniam6/when_to_get_letters_of_recommendation/hcqc4e0/", "text": "I took a gap year and had discussed eventually getting letters from my recommenders pre-graduation. A year and a half later, all I had to do was email them to let them know that I was getting ready to start applying to programs (I let them know about 6 weeks in advance). It's important that you do the work to make sure your recommenders have information about you. It doesn't hurt to remind them of classes you've taken with them, any big projects or publications you have, scholarships, etc. I sent my CV along with my emails to my professors too, just so they'd know what I'd been up to in undergrad and in the year since I'd graduated. One professor actually sent me a letter request form to fill out, which I ended up sending to all my recommenders anyway in case they wanted to know more about my goals and such, stuff that's not exactly in my CV.", "author": "badatpizza", "created": 1631563012, "upvotes": 1}, "hcpy78i": {"link": "/r/GradSchool/comments/pniam6/when_to_get_letters_of_recommendation/hcpy78i/", "text": "I asked for mine when I needed them Nd thankfully my profs remembered me. I don't know if there's a correct time, but the program's I applied for (doctorate) required that the profs send the letters directly to them so I never saw two of them, while the third asked me to write it and they would adjust it.", "author": "Conhbd", "created": 1631557380, "upvotes": 1}, "hcpeaxm": {"link": "/r/GradSchool/comments/pniam6/when_to_get_letters_of_recommendation/hcpeaxm/", "text": "Depending on how your field works, you might not even have to collect the letters yourself. Take this with a grain of salt as I’m in geography and Canadian, but all the universities I applied to for my master’s had me submit the emails of professors I had requested letters from, and they were invited to submit the letters on their own. I had no part in the collection process. All I did was ask if they were willing to write them!\n\nI hope someone in psychology comes along to give more info for you!", "author": "ChristianSky2", "created": 1631549183, "upvotes": 1}}}