{
  "sid": "qrexua",
  "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/",
  "title:": "In what ways can I figure out if pursuing a PhD is for me?",
  "text": "If I were to pursue one it would be focused somewhere within the natural sciences (ecology, botany, etc.) or evolutionary biology. I'd remain in WA State. I'd like to work at least partially in the field. \n\nI love school. In between my masters and bachelor's I did a ton of internships. I still have no idea what I want to do, I just know I'm passionate about ecology and learning about the bigger picture.",
  "author": "_unsteady_",
  "created": 1636612284,
  "updated": 1637416133,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk6aoy3": {
      "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk6aoy3/",
      "text": "The point of a PhD (or any school, really) is to get a job after that needs a PhD (unless you are just independently wealthy and decide this is how you want to spend your time). What is the job you want, and do the people doing that job have a PhD?\n\nAnecdotally, you are *less* likely to work in the field with a PhD (PhD is where the grant and management life starts).  Based on what you've written here, it seems like you should qualify for jobs that meet a lot of your interests as with a MS (that I assume is in Ecology?).",
      "author": "HopefulEmu3465",
      "created": 1636612893,
      "upvotes": 7,
      "replies": {
        "hk8cxab": {
          "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk8cxab/",
          "text": "Thanks, this helps. I definitely don't want to be stuck grant writing or being a manager. \n\nYes, my interest is more in ecology.",
          "author": "_unsteady_",
          "created": 1636655077,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk6u23x": {
      "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk6u23x/",
      "text": "Congrats on finding something you love!\n\nI'd recommend having a read through the current literature in your field to try and find a topic that interests you. As a polymath, I can completely understand how difficult it may be to narrow this down.\n\nYou may even want to look at specific researchers once you've done the above to see if they're interested in hiring graduate students. \n\nPlease bear in mind however that doing a Ph.D. is very different to doing undergraduate and master's degrees. You'll be in charge of your own research projects and it requires a great deal of work to get to the finish line.",
      "author": "singinhallelujahtoem",
      "created": 1636628902,
      "upvotes": 3,
      "replies": {
        "hk8dhfz": {
          "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk8dhfz/",
          "text": "Thank you, I really appreciate your guidance! It is definitely hard to find a specific topic within ecology to spcialize in when there's so many interesting concepts and organisms to learn about.",
          "author": "_unsteady_",
          "created": 1636655300,
          "upvotes": 1,
          "replies": {
            "hk8luxw": {
              "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk8luxw/",
              "text": "You’re more than welcome and happy to help! I had the same when I was looking for Ph.Ds. in environmental science. There aren’t enough lifetimes to study everything unfortunately! 😅",
              "author": null,
              "created": 1636658672,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7i3c2": {
      "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk7i3c2/",
      "text": ">I just know I'm passionate about ecology and learning about the bigger picture.\n\nIf you are passionate about your discipline, enjoy studying it and doing research, and want to keep learning more, that's a good reason to get a PhD.\n\nBut you do need to come up with a research agenda for applying for a PhD. If you're not sure what that is yet, it could be good to work in the field for a year or two, as that might give you a better idea.",
      "author": "raistlin65",
      "created": 1636642475,
      "upvotes": 2,
      "replies": {}
    },
    "hk8c3xp": {
      "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk8c3xp/",
      "text": "I'm a grad student in evolutionary bio. I feel like I should point out that school before grad school is completely different from grad school itself. The classes you take in undergrad are already going to be very different from grad classes (as you've probably seen in your Master's), and classes aren't even the most important part of grad school. I would argue in biology, they're actually one of the least important parts for a PhD.\n\nI personally think you should go to grad school if it will help you achieve a goal in your career path. You can work in the field doing ecology with a Master's. A PhD is for if you want to come up with and answer questions in your field and it entails a lot more than doing experiments and working in the field. Jobs that require PhDs require a lot of administrative work, delegating a lot of the research to others, writing, and mentoring. There's a lot more to biology careers than academia too, but I think you should look at different types of jobs and see what interests you. If you keep coming back to jobs that require a PhD, that could be an indication it's for you.",
      "author": "KiwiTheKitty",
      "created": 1636654753,
      "upvotes": 1,
      "replies": {
        "hk8cmw8": {
          "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk8cmw8/",
          "text": "Thank you, this is very helpful. Would it be accurate to say that PhDs within these fields cater more to job positions that emphasize managerial or leadership goals? I feel that I would enjoy research but probably not being a leader.",
          "author": "_unsteady_",
          "created": 1636654963,
          "upvotes": 1,
          "replies": {
            "hk8eb8c": {
              "link": "/r/GradSchool/comments/qrexua/in_what_ways_can_i_figure_out_if_pursuing_a_phd/hk8eb8c/",
              "text": "There's a huge variety, you should definitely look up actual job listings, or better yet, ask people who have PhDs in your field about it. I bet you could contact people from the department you did your Master's in about it. Or maybe finding people's CVs and seeing how they describe their positions. \n\nMy experience is basically only academia and government labs, but in both those types of workplaces, PhD level scientists usually end up doing research AND lab administration/leadership. Even people with lab managers end up doing things like writing grants, papers, reviews, funding plans, etc. I can think of examples of people I worked with at the USDA who had less of that stuff because they were researchers instead of PIs (principal investigators), but they still ended up having a technician or two and would manage their own research even though they had a PI who was their boss.\n\nI'm sure there are other structures and I have no experience in any other government department or industry at all, so you'll have to do your own research. Taking time to work in the field between a Master's and potentially going back for a PhD is a good idea too.",
              "author": "KiwiTheKitty",
              "created": 1636655629,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}