{
  "sid": "qf21mu",
  "link": "/r/GradSchool/comments/qf21mu/if_i_drop_out/",
  "title:": "if i drop out",
  "text": "*cross-posting in r/introvert*\n\ntldr: I'm considering drop out grad school. my advisor thinks i don't know english, and my working progress is unacceptable.\n\nI'm in my second year phd, and basically just a lab rat. But, I have problem speaking with my advisor. I don't feel comfortable talking to people face to face. So, when I'm nervous, my brain becomes blank. This is the worst because English is not my native. I can teach and speak naturally but in a slower speed. This makes my advisor thinks I don't know english, and I have a feeling he doesn't want to speak to me at all. It's a small wet lab (doing experiment). So, sometimes I need to wait for other members before I can use equipment, besides having classes and teaching. this make my work progress slower compared to other members who only do lab (I joined early this year, but started working in person this summer). My advisor thinks I'm lazy and don't do anything. I tried to come early and stay late (7am-9pm) to compensate the time i lost due to those reason but honestly i don't want to do this everyday. I'm tired and depressed. My family doesn't support my grad study. And basically no friend in this school.\nthank you for reading.",
  "author": "mmddmm19",
  "created": 1635112077,
  "updated": 1635185337,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhxc8gj": {
      "link": "/r/GradSchool/comments/qf21mu/if_i_drop_out/hhxc8gj/",
      "text": "The situation you are in is awful. Sorry to hear that you are having a crappy experience in grad school. Not sure if this is gonna be a solution but I'll add some comments here.\n\nI'm going to assume that you came to grad school straight out of college, or at least with not that many years of experience. No one should expect you to work from 7AM to 9PM, and you shouldn't either. Yes there are some shitty labs who may make you do that, but most of the time you probably shouldn't be there anyways if you have options. \n\nOne thing that took me forever to realize that I wish someone told me earlier: Your performance doesn't always scale with your work hours. Working reasonable hours and balancing social life, health, sleep etc are important. You are in a wet lab, there is only so much you can do in a week. There is only so much one can be all work and no play. Make sure to find balance in your life.",
      "author": "daquilark",
      "created": 1635119551,
      "upvotes": 6,
      "replies": {}
    },
    "hhy3sd9": {
      "link": "/r/GradSchool/comments/qf21mu/if_i_drop_out/hhy3sd9/",
      "text": "Talk to university counseling services.\n\nThey may be able to help you with this anxiety you have. And, if they feel it's warranted, they may talk to your professor for you. \n\nSo I would call them first thing tomorrow and make an appointment. You have nothing to lose by talking to them. Just be honest about the anxiety you're feeling and how it's affecting your work.",
      "author": "raistlin65",
      "created": 1635133952,
      "upvotes": 3,
      "replies": {}
    }
  }
}