{
  "sid": "qcb70x",
  "link": "/r/GradSchool/comments/qcb70x/doing_a_phd_with_pcs/",
  "title:": "Doing a PhD with PCS",
  "text": "Hello! I am a 2nd year grad student in a Neuroscience PhD program and have been living with Post Concussion Syndrom for about 3 years. I find the daily stress and rigor of grad school to really flair my symptoms and recovery typically takes weeks at a time (but I usually take a day off here and there). I have talked with my advisor who is super caring and considerate. But I am starting to feel she is getting annoyed with the physical symptoms that come. Anyone who has PCS knows its not something that you can really predict only manage from day to day. I'm not asking for medical advice more curious for community....if anyone else here lives with PCS and how they mange to get through the day doing research without feeling absolutely destroyed by the end.",
  "author": "unwantednoise",
  "created": 1634764582,
  "updated": 1634849810,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhez33q": {
      "link": "/r/GradSchool/comments/qcb70x/doing_a_phd_with_pcs/hhez33q/",
      "text": "My two best friends have long-term PCS. One completed her PhD and the other is currently in 3rd year. I've had concussions (fortunately do not suffer from PCS) but I can certainly empathize seeing what my best friends are going through. I think if your advisor is super caring and considerate then she likely isn't annoyed. Is there anything in particular you are struggling with that is consistent? Both of my friends just do what they can externally (eg: using Binasal Occlusion Glasses) to aid with their symptoms but it doesn't always work. When they need breaks they take them. I'm sorry for everything you're experiencing but I think it will get better and I wish you the best.",
      "author": "adnamanda",
      "created": 1634766376,
      "upvotes": 1,
      "replies": {
        "hhfmy04": {
          "link": "/r/GradSchool/comments/qcb70x/doing_a_phd_with_pcs/hhfmy04/",
          "text": "Yeah maybe I'm projecting my own frustration onto her feelings. But ultimately I feel like I'm concussed again. I get incredibly dizzy, that fog of the mind returns, I get hemiplegic paralysis, photophobia, and sensitivity to sound. If I continue working under these conditions I get aural migrane and then I just kinda loose my ability to function well. Usually solved with a hefty 2-3 hour reset of just sensory deprivation.  \n\nThe issue is I feel like I have these symptoms about 2-3 times a week and I don't know how to keep up productivity when I can't plan around these things. I think I ignored this disability so ultimately it got worse. I am in the talks with neurologist and neuroopthmologist. But nothing really seems to help unfortunately.",
          "author": "unwantednoise",
          "created": 1634777180,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}