{"sid": "grpbch", "link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/", "title:": "To Students Working Full Time During Covid- I See and Commend You", "text": "To all my fellow students holding down jobs and navigating what has been an incredible academic ordeal- I see you- ya'll are amazing.  \n\nTrying to navigate bumpy switches to online learning, internet access, changing graduation requirements, grading kerfuffles, and mourning our former lives while ALSO wading through cancelled professional events, crumbling markets, and the very real risk of unemployment right around the corner has been a terrifying and exhausting ordeal.  \n\nMany of my fellow classmates also are managing childcare and loss of loved ones alongside everything else.  Ya'll are superhuman.  \n\nWe may not know where the future will lead- as with many of my fellow professional grad students I am paying for my degree out of pocket.  It's scary to not know how the economy will be at the end of all this, and if the degree will pay-off in the job market of the future.  It's hard to focus with everything falling apart around us.  But I believe we can do this.", "author": "aloepant", "created": 1590604096, "retrieved": 1632845850, "over_18": false, "upvotes": 399, "upvote_ratio": 0.99, "comments": {"fs2f7h6": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs2f7h6/", "text": "So glad to hear we all are not alone! I’ve had trouble finding motivation to write my masters thesis while being essential at work.", "author": "cream-of-beat", "created": 1590651414, "upvotes": 1}, "fs22ysr": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs22ysr/", "text": "My dude, you have no idea how much I needed to hear that. I was just freaking out on my roommate about how I'm supposed to defend next month (after being pushed from April) and my control group is still wayyyy too small compared to my group of study (thanks for the recruitment help, COVID) and I still have two more chapters to write in my thesis. And I'm juggling working full time and buying a house in the midst of a pandemic because our landlord is not renewing the lease. \n\nI didn't realize an internet stranger's validation was important right now, but it was, so thanks.", "author": "Demodesrev", "created": 1590641557, "upvotes": 6}, "fs1gs9n": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs1gs9n/", "text": "Thank you.", "author": null, "created": 1590627933, "upvotes": 2}, "fs1fxnh": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs1fxnh/", "text": "I’m in grad school and work full time for an airline, so might get laid off in October. Plus my rent is going up starting August. I’ve applied to so many jobs and I’m lucky if I get a rejection email. This shit is stressful.", "author": "travelerrr91", "created": 1590627457, "upvotes": 3}, "fs1763f": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs1763f/", "text": "Thank you so much for saying this. Working a full time job I just started before covid lockdown is stressful with school. With deadlines, worrying about and grades AND job which pays for school and my family, this has a tremendous ordeal", "author": "TurtleKhan_", "created": 1590622627, "upvotes": 3}, "fs13ngp": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs13ngp/", "text": "Thank you so much for this! There have been times where I have been in a zoom class call while working at the same time with a Teams work call open next to it. Definitely has been an adjustment lol", "author": "betty_deez", "created": 1590620716, "upvotes": 5}, "fs116c6": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs116c6/", "text": "Thanks. It has been so difficult teaching online + learning online + keeping the toddler home from daycare and managing her.", "author": "trekkieminion", "created": 1590619399, "upvotes": 3}, "fs110rm": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs110rm/", "text": "Thank you. Working full time from home (Very grateful) and starting my dissertation.", "author": null, "created": 1590619318, "upvotes": 5}, "fs0xw64": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs0xw64/", "text": "Just graduated last week and it was rough at the end. I'm feeling for you all still in the thick of it.", "author": "spicy_taco_", "created": 1590617702, "upvotes": 5}, "fs0somp": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs0somp/", "text": "I wish my PI would acknowledge this :(", "author": null, "created": 1590615102, "upvotes": 12}, "fs0n5fc": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs0n5fc/", "text": "Thank you for writing this. I didn't know I needed to hear this as much as I did until I read it.\n\nI think part of me is still struggling with the dual role of being both a student and a full-time worker. I'm not sure about the rest of you, but I think I've had a hard time \"letting go\" of my professional-role self which is expected to be an adult, make decisions, and know what's happening so that my student self can ask for what it needs and just... not know things sometimes. Especially in a pandemic. Sometimes my student self just wants to say \"I don't know what's happening and I'm kind of overwhelmed right now.\" So I'm going to make a promise to myself to better at saying, \"hey - I'm not doing so great today. Maybe tomorrow I will be, but I just need a minute right now.\" And letting that be okay. \n\nTo everyone else out there - I hope you allow yourself to be extra kind and gentle with yourself right now. You're worth it and deserve it for working so hard.", "author": "Gizmo_the_Wizardo", "created": 1590612408, "upvotes": 33}, "fs0mpae": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs0mpae/", "text": "Without David Goggins, I wouldn’t have been able to push through. He has changed my life over the last few months.", "author": "m0therland", "created": 1590612194, "upvotes": 8}, "fs0hugm": {"link": "/r/GradSchool/comments/grpbch/to_students_working_full_time_during_covid_i_see/fs0hugm/", "text": "[deleted]", "author": null, "created": 1590609857, "upvotes": 48}}}