{
  "sid": "qlz4hk",
  "link": "/r/GradSchool/comments/qlz4hk/prospective_school_only_sends_rec_letter_emails/",
  "title:": "Prospective school only sends rec letter emails AFTER app submission? Is this as dumb as it seems?",
  "text": "So I’m applying to 13 PhD programs, mostly at large R1 state universities. Out of these, 12 do the usual recommendation process- the applicant enters the recommenders’ emails while filling out the app, and the recommenders immediately get an email with letter instructions. Most of my apps are due in December/January, and so I made sure to reach out to my recommenders in late September/early October so they have enough time. \n\nHowever, one school (app deadline of December 8th) requires full application submission before sending rec request emails. I confirmed this with the department secretary as well as the university’s graduate division. It’s not a big deal and it honestly helped me get some fire under my ass to start writing my generic statement of purpose ahead of time, but it was kind of annoying and strange when I found out.\n\nHas anyone ran into this? Why would a university engage in such a counterproductive and seemingly abnormal practice? I would expect something like this from a highly selective place to maybe cut down on the number of unserious applications, but the school in question is pretty middle-of-the-road. Anyway, just curious.",
  "author": "Fluid_Resident_3458",
  "created": 1635959350,
  "updated": 1636138138,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.8,
  "comments": {
    "hj6g3yc": {
      "link": "/r/GradSchool/comments/qlz4hk/prospective_school_only_sends_rec_letter_emails/hj6g3yc/",
      "text": "Makes sense actually - why send out the  the letter request if the application hasn't been completed. If they sent it out early they would be annoying faculty members for letters which aren't needed (for folks who did not complete the application)",
      "author": "MerbleTheGnome",
      "created": 1635963071,
      "upvotes": 16,
      "replies": {}
    },
    "hj6azak": {
      "link": "/r/GradSchool/comments/qlz4hk/prospective_school_only_sends_rec_letter_emails/hj6azak/",
      "text": "I guess I don’t really see the issue. They likely don’t consider the rec letters right away anyway. \n\nCan you explain to me what you see problematic about it? I’m not trying to be snarky I guess I’m just really confused about what the issue would be. Once you point it out I may see it and totally get it!\n\nEdit: to add to my post, many job applications don’t ask for references or contact them until you’ve made it through the first round anyway so this seems fairly in line with that",
      "author": "WitnessNo8046",
      "created": 1635961128,
      "upvotes": 11,
      "replies": {
        "hj7qywy": {
          "link": "/r/GradSchool/comments/qlz4hk/prospective_school_only_sends_rec_letter_emails/hj7qywy/",
          "text": "OP might be concerned because 1) he can’t send all the requests for letters of rec at once and 2) he has to finish his statement of interest, writing sample etc. etc. weeks before the actual deadline so that his profs have enough time for the uploads.",
          "author": "Chuot99",
          "created": 1635981623,
          "upvotes": 4,
          "replies": {
            "hj884kz": {
              "link": "/r/GradSchool/comments/qlz4hk/prospective_school_only_sends_rec_letter_emails/hj884kz/",
              "text": "You should submit your stuff ASAP anyway, never wait until the deadline! You never know when they may start reviewing early and you can be harder to get noticed, or you could just have some issue last minute that stops you from submitting on time.\n\nRegarding sending all the requests at once… I don’t think that matters either. Professors (and GAs who write letters) make one rec letter and spend two minutes changing the info with each resubmission. We don’t need it sent all at once.",
              "author": "WitnessNo8046",
              "created": 1635989165,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hj6cqh4": {
      "link": "/r/GradSchool/comments/qlz4hk/prospective_school_only_sends_rec_letter_emails/hj6cqh4/",
      "text": "when i applied to masters (by research) programmes previously and phd programmes this year, *all* of them only sent the requests for LOR after all my other application materials were submitted. i’m in psych, in case this is field-specific.",
      "author": "victoria-lobster",
      "created": 1635961794,
      "upvotes": 2,
      "replies": {}
    },
    "hj6j8ce": {
      "link": "/r/GradSchool/comments/qlz4hk/prospective_school_only_sends_rec_letter_emails/hj6j8ce/",
      "text": ">However, one school (app deadline of December 8th) requires full application submission before sending rec request emails.\n\nThe professors writing your recommendation letters are likely not writing a different letter for everyone. So they'll send it all along when they get the request. This won't matter to them. Just let them know they'll need to send it in early December when they get the email.\n\n>but the school in question is pretty middle-of-the-road.\n\nThen that makes sense. They're probably  trying to get the jump on better schools by recruiting candidates by getting you to submit your full app in early December.",
      "author": "raistlin65",
      "created": 1635964264,
      "upvotes": 2,
      "replies": {}
    }
  }
}