{"sid": "kdn2gh", "link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/", "title:": "Friendly reminder to take care of yourself today", "text": "I just spent the last few days visiting with my close family that I haven’t seen in over two years. It felt amazing to be surrounded by non-academics, and talk minimally about science (which almost entirely rules my life nowadays.) We spent most of the weekend hiking and sightseeing, which was really fun. \n\nWhen they left, I just kind of bawled my eyes out because I felt... like... fulfilled? (Or generally, that happy, warm & fuzzy feeling you get from spending time with good people, doing things you enjoy.) \n\nAfter feeling drained for the past 11 months of 2020, I actually feel recharged. \n\nSo, in case you needed to be reminded today: take time for yourself now and then, my people. Your research is worth getting lost in, but not losing yourself over (or your health).", "author": "BiologyPhDHopeful", "created": 1608043867, "retrieved": 1632953862, "over_18": false, "upvotes": 399, "upvote_ratio": 0.99, "comments": {"gfzw8o7": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfzw8o7/", "text": "Well glad someone gets time off. I dont think I'll get a day off anytime soon. Holidays just mean no classes to teach so more products are expected. Last time I had time off was a half day due to a heart attack.", "author": "SwimminAss", "created": 1608090413, "upvotes": 1}, "gfzp8je": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfzp8je/", "text": "After weeks of shit in the lab not working, I said fuck it, took ten days off and it was totally amazing and worth it. Came back today, and I figured out what was wrong. Breaks are necessary!", "author": "cpbivins28", "created": 1608086370, "upvotes": 1}, "gfzo01d": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfzo01d/", "text": "This is why I ultimately couldn’t commit to a PhD. I am in my 2nd year of my MS and it has been so mentally exhausting . I can’t imagine still being a grad student 4 years from now. \n\nSelf care is important.", "author": "PiikaSnap", "created": 1608085674, "upvotes": 2}, "gfzfjjd": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfzfjjd/", "text": "This is exactly why I’ll never move away from my close family and friends for graduate school. Whatever experiences or success you gain from it will never put weight true joy from genuine connection with people you love.", "author": "sanpellegringo1", "created": 1608080948, "upvotes": 2}, "gfy7b8b": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfy7b8b/", "text": "I’m feeling bummed out lately, it’s so hard to figure out  how to take time when there’s rampant virus and it’s cold. Plus my advisor is making us do big research updates both before and after the “break”, which are always competitive and high pressure. I’m having a hard time trying to find breaks and happy things, and I notice it when I sit down to work and I can’t focus at all or I get frustrated instantly.", "author": "shadeandsuede", "created": 1608059155, "upvotes": 6}, "gfy4uo0": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfy4uo0/", "text": "I like spending time with my friends who aren't academics because I've known these people for almost my whole life, and it's just a reminder that these folks like me for me, not because of my research or my accomplishments or what I can do for them. \n\nIt sucks that I won't be able to see them this year because several of them recently had (very cute) babies and are justifiably isolating, but that's the only reason I still have a Facebook lol", "author": "False-Guess", "created": 1608058069, "upvotes": 6}, "gfy3fpw": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfy3fpw/", "text": "I am considering a two to three-week break on all studies. My tank is bone dry.", "author": "gabe89san", "created": 1608057442, "upvotes": 18}, "gfy0osb": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfy0osb/", "text": "Thanks !!", "author": "AlphaBetablue", "created": 1608056185, "upvotes": 1}, "gfxx8ra": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfxx8ra/", "text": "Excellent post! I am soooo happy the mental health issues in academia are finally getting more traction.", "author": "extendedphenotypes", "created": 1608054591, "upvotes": 49}, "gfxqcgn": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfxqcgn/", "text": "True, research is important but we need to make time for ourselves.\n\nI was panicking about my progress one day so my friend forced me out of my house to get me distracted from my research.Somehow i felt better after spending less than an hour with her at the park and was relaxed enough to focus properly on my work afterwards. It was one of the most productive day i ever had.\n\nIt's easy to feel guilty about using  free time to relax instead of working but we need it. If anything, taking breaks here and there improves the quality of your work (at least, in my case it does).", "author": "LIFEOFPIZZA", "created": 1608051362, "upvotes": 22}, "gfxgcz8": {"link": "/r/GradSchool/comments/kdn2gh/friendly_reminder_to_take_care_of_yourself_today/gfxgcz8/", "text": "don't listen\n\nnot only is research worth getting lost in, its your only escape from the kind of saccharine gratification and beggared social acceptance peddled here.  \n\nbetter to work until your hands are just rotting gristle hanging off jagged bone and your skull is a scream chamber.  marvelous", "author": "manifest-decoy", "created": 1608046449, "upvotes": -63}}}