{"sid": "po9mph", "link": "/r/GradSchool/comments/po9mph/i_am_finally_switching_my_advisor/", "title:": "I am finally switching my advisor", "text": "We have a Zoom meeting in 15 minutes.  I have been anxious for over a week thinking about how to bring this up to him without upsetting him or feeling like I'm a failure for not sticking with him.  He is incredibly smart, experienced, and is generally extremely kind and helpful.  But we just do not work well together.   He's super hands-off and comes off a bit distant, so for the past year I've been wrestling with whether he hates me or not (lol).  After our meetings I would feel confused, sad, frustrated, and honestly stupid.  I know that isn't his intention, but it's just really hard for me to interpret what he thinks, and that spikes my anxiety.  I feel like I could never make him proud.  The main reason, though, is that my research interests are different now than when I first got into this program.  There is a new professor who came here last year -- whose interests line up *much* nicer with mine -- and I've finally asked him if he would be up for the switch.  He said yes, clearly, and we've already drafted up some much cleaner ideas for my thesis.  So now all that's left to do is break it to my original advisor, in what is now 8 minutes, and pray he doesn't tell the rest of the department how awful I am :). \n\nIf anyone was looking for a sign to switch advisors, here it is.  Wish me luck!", "author": "smgmx", "created": 1631647381, "retrieved": 1632844541, "over_18": false, "upvotes": 33, "upvote_ratio": 0.97, "comments": {"hcw8601": {"link": "/r/GradSchool/comments/po9mph/i_am_finally_switching_my_advisor/hcw8601/", "text": "This, very much! A month ago, I was in the same position: sad, frustrated, burnt out, and felt really dumb every time I met with my previous advisor. They were kind and patient, however, my research interests no longer aligned with the problem given to me or the branch of math I was working in. I emailed them that I was no longer interested and started working in the field of math that I enjoy and feel much more supported by my current professor. \n\nFor those of you thinking about switching, it is perfectly fine to switch. I thought that there would be some magical consequence to switching, from not getting a job to I won't be able to get my degree because I switched. But really, nothing happened. My previous advisor was salty (lol), but who gives a shit? I didn't do much anyway ( or I was so told :/ ). Anyway, good on you OP, I hope your thesis the smoothest ride.", "author": "datdestructor", "created": 1631668314, "upvotes": 3}, "hcvss2b": {"link": "/r/GradSchool/comments/po9mph/i_am_finally_switching_my_advisor/hcvss2b/", "text": "Update please! How did you tell him your decision? What was his reaction?", "author": "ConsciousReindeer265", "created": 1631661219, "upvotes": 2}, "hcvra5t": {"link": "/r/GradSchool/comments/po9mph/i_am_finally_switching_my_advisor/hcvra5t/", "text": "I'm glad to hear you're making this leap.\n\nI want to put out there for anyone else reading this - finding a supportive advisor is the number one most important thing you can do for graduate school satisfaction - studies and experience show this.\n\nSupportive will be different from different people, as we all have differing needs.", "author": "PeaceAndPrajna", "created": 1631660522, "upvotes": 4}, "hcvcmb0": {"link": "/r/GradSchool/comments/po9mph/i_am_finally_switching_my_advisor/hcvcmb0/", "text": "A line I love: the student always picks the teacher", "author": "suchapalaver", "created": 1631654063, "upvotes": 9}, "hcuwaec": {"link": "/r/GradSchool/comments/po9mph/i_am_finally_switching_my_advisor/hcuwaec/", "text": "Good luck!! Its so important that you can be with a supervisor that you’re comfortable with. I had a similar issue and ended up breaking things off with my first supervisor to be with two other supervisors currently who are so much more easier to work with. She didn’t take it too well, but at the end of the day i’m SO much happier that I made the switch. This will be worth it :)", "author": "RepresentativeLead70", "created": 1631647549, "upvotes": 10}}}