{
  "sid": "qf1yrt",
  "link": "/r/GradSchool/comments/qf1yrt/cs_phd_worth_it/",
  "title:": "CS PhD worth it?",
  "text": "I've been constantly debating if I should do a phd in CS (AI/ML/NLP) or do an MEng (which can be done during my 4 years of undergrad in my school) and just go into the industry for an SWE job. I'm currently a junior at a top ranking university, with decent GPA, an SWE internship at a big name, and ML research experience at school -- so basically on-track for either path, yet I'm having great trouble to make a decision.\n\n1. Sometimes I think research is interesting because it's creative work, and I'm creating intellectual input to the field, instead of doing repetitive work like writing code for softwares. If I got a phd, I still hope to work in research in the tech industry, so that I can see the research work being put into use.\n2. However, I don't know how much passion I have for a specific subject. Sure AI/NLP sounds interesting to me, but I don't really have a \"topic\" in mind yet which I would like devote 6 years to research on. I saw a lot on reddit that grad school can be very frustrating, which I also felt a bit when I work on research in undergrad. And I want free time and high salary too, which I assume won't be the case if I'm working towards a phd (sometimes phd just sounds like more work less pay to me).\n3. My parents also want me to get a PhD, because they think it \"gives me a better perspective of the world\" instead of putting making money as the top priority. Idk if it's them being too idealistic (neither of them works in tech or studied CS) or it actually makes sense lol\n4. The only thing that keeps me from going with MEng is that it seems like an \"easy\" path which doesn't require much additional work for me, and I'll just (hopefully) end up with a well-paid job and do that for the rest of my life. I'm afraid that I'll get bored of that quickly, and regret why I didn' t apply to grad school. \n5. Even if I apply to grad school after I worked for a while, I think that could be a disadvantage compared to applying right after undergrad, because I would lose connections with the professor for recommendation letters?\n\nDo you think getting a CS phd is worth it? Any advice?",
  "author": "KeyBaker5744",
  "created": 1635111836,
  "updated": 1635185342,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhy46i2": {
      "link": "/r/GradSchool/comments/qf1yrt/cs_phd_worth_it/hhy46i2/",
      "text": ">Sure AI/NLP sounds interesting to me, but I don't really have a \"topic\" in mind yet which I would like devote 6 years to research on.\n\nSounds like you should apply to Master's programs in CS that are focused on that. This will give you much more exposure to those topics. Then you can apply for a PhD program with a much better idea of what your research focus will be.\n\nOr you may find you don't want the PhD. But you'll have Masters and it's only a two-year commitment.",
      "author": "raistlin65",
      "created": 1635134191,
      "upvotes": 2,
      "replies": {}
    }
  }
}