{
  "sid": "q5dcln",
  "link": "/r/GradSchool/comments/q5dcln/anxiety_induced_insomnia_and_generally_not_having/",
  "title:": "Anxiety Induced Insomnia and Generally Not Having a Good Time",
  "text": "1st year PhD student who just graduated from undergrad in June. I was so burnt out from taking classes during the pandemic and doing remote research when I finished undergrad, but I figured that the research I’d be doing in my PhD program would reinvigorate me to keep going (I also had some teaching experience in undergrad that I really enjoyed, so I wanted to pursue that as a career path).\n\nHowever, taking 3 classes and 3 seminars is slowly eating away at my soul. One class in particular is causing my anxiety induced insomnia. This typically used to happen to me in undergrad when I was nervous about an exam and would only last a max of three days. But now that I’m in grad school and a B- is considered a failing grade, every day is extremely anxiety inducing. I’ve gone up to five days without sleeping.\n\nBecause of my anxiety (I haven’t officially been diagnosed, but I need to start using my university’s mental health resources) and the lack of sleep I’ve been experiencing, I’ve been completely and utterly useless over the past month. I can’t focus on my research because of this course. I just took an midterm exam in the said course causing the anxiety, and I absolutely bombed it (however upon looking over it, the TA left so really snarky comments on my midterm and was super harsh. regrades open up tomorrow and I will try and get some points back/escalate the issue with the professor).\n\nI wanted to do a PhD to do research on the stuff I’m interested in, not lose sleep over these courses and go through another round of academic hazing. In the past, I’ve spoken to older students who have said they’ve gotten a C+ and B- and been okay. But the 2nd years that were in the same course that I am got a B- and we’re forced to retake the course. I personally do not think I am strong enough to stay in this program if I have to retake the course. They say that our research should be the focus and not the coursework, but this obviously is not the case.\n\nIt’s to the point where I think about dropping out frequently because every day is miserable. I just want a good nights sleep and I’m so so tired. I start every day shaking like a Chihuahua because I’m so anxious. Any advice is appreciated on what I should do ❤️",
  "author": "SassySagittarian",
  "created": 1633889425,
  "updated": 1634099757,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.88,
  "comments": {
    "hg59a9u": {
      "link": "/r/GradSchool/comments/q5dcln/anxiety_induced_insomnia_and_generally_not_having/hg59a9u/",
      "text": "Can you go see a doctor? I was experiencing insomnia earlier this year, it was starting to get pretty rough. I’m not exactly sure why it happened, I was a little anxious about some things related to grad school at the time but nothing too terrible. Anyway, I went and saw a doctor and they prescribed me some medication to help me sleep. Something like that may not help with your anxiety much but at least you’d be getting more sleep which could help you out a lot",
      "author": "spoopyskelly",
      "created": 1633897521,
      "upvotes": 6,
      "replies": {
        "hg59pc1": {
          "link": "/r/GradSchool/comments/q5dcln/anxiety_induced_insomnia_and_generally_not_having/hg59pc1/",
          "text": "I’ll bring it up to the therapist once I get an appointment. Thank you ✨",
          "author": "SassySagittarian",
          "created": 1633897684,
          "upvotes": 3,
          "replies": {
            "hg5a2n3": {
              "link": "/r/GradSchool/comments/q5dcln/anxiety_induced_insomnia_and_generally_not_having/hg5a2n3/",
              "text": "You’re welcome! That may not have been super helpful but that was my experience. Hang in there! I hope you can get through this soon and start feeling better",
              "author": "spoopyskelly",
              "created": 1633897833,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg5j72i": {
      "link": "/r/GradSchool/comments/q5dcln/anxiety_induced_insomnia_and_generally_not_having/hg5j72i/",
      "text": "I have some problems with sleep and anxiety too. Go talk to a mental health professional and talk to a doctor about sleep meds. I found sleep aids were very helpful to me as long as I didn't take too high of concentration or at the wrong time. Good luck.",
      "author": "Ru-tris-bpy",
      "created": 1633901684,
      "upvotes": 6,
      "replies": {}
    },
    "hg7mmct": {
      "link": "/r/GradSchool/comments/q5dcln/anxiety_induced_insomnia_and_generally_not_having/hg7mmct/",
      "text": "Sustained release Melatonin is over the counter in the vitamin section. It may help a little or a lot for the insomnia depending on the person while you work on other things. Unlike most sleeping pills it is not addictive. Other people find Benadryl helpful. If it is legal, indica strain THC with a sublingual oil for longer action (around 8 hours).\n\nFor daytime anxiety CBD oil may help while waiting on therapy or other treatments.",
      "author": "UleeBunny",
      "created": 1633946118,
      "upvotes": 3,
      "replies": {}
    },
    "hg7lecv": {
      "link": "/r/GradSchool/comments/q5dcln/anxiety_induced_insomnia_and_generally_not_having/hg7lecv/",
      "text": "Speak to a mental health professional. Take a break if you can. Talk to your PI/prof/graduate co-ordinator. Remember that you are absolutely not alone in this, and it too shall pass. Hope you feel better soon.",
      "author": "SquirrelOnTheDam",
      "created": 1633945021,
      "upvotes": 2,
      "replies": {}
    }
  }
}