{"sid": "ht95w9", "link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/", "title:": "Title IX Violation at Uni", "text": "Hi all,\n\nLast year, I reported being inappropriately touched by a postdoc. I was forced to talk to my institutions Title IX office after coming forward, trying to get out of the lab I was in. It was reported to the PI on three occasions. The lab tech was also inappropriately touched. Several people saw this. Yale did not attempt to substantiate those claims. He also made inappropriate comments to a female undergrad that had been there previously. This was a pattern. First, when I told the PI about that, she laughed and said she, \"didn't get involved in personal matters\". The second time, we were standing in the lab, and I even asked the technician as well in front of her if she liked it when he came up and grabbed her from behind while she said 'no' and 'stop' repeatedly and tried to squirm away. She said she didn't like it. PI did nothing. Third try, I reframed it as a hinderance to my data. PI said she had NEVER HEARD OF THESE ALLEGATIONS BEFORE (lie) and only when her data could be affected did she do anything. When I reported this, I was made to stay out of the lab for two months-not the handsy post doc. Institution admitted that they knew I was touched, and said \"steps were taken to prevent a recurrence\". Nothing changed. We still had overlapping schedules. He's still there. When I opened the title IX report today, I was shocked to see that Yale said the claim was unsubstantiated. There were emails sent to other PIs questioning the conduct and relaying PIs response, consistently. Others who knew who the office said they wouldn't contact. This directly conflicts with what the investigators told me. I was told by two different investigators that they COULD substantiate my claims. That they had done something to prevent future incidents. Tonight, I opened their title IX report. I found mine easily.\n\nThey lied in their report. They didn't take it seriously. They have a national reputation for not taking harassment seriously, and it's spot-on.\n\nMy former PI said it sounded more like assault. I went nuclear and put it all on Twitter. No ragrets. Not even a single letter.\n\nIt's with the OCR and NIH, so I'm protected by federal whistleblowing laws.\n\nToday, the OCR attorney called my attorney just now and he was in the room when Yale admitted I was touched by this postdoc. They openly falsified their title IX report. They played themselves. This is it-they're sunk.\n\nI'd like this to get some more traction. If you can, I'd appreciate any retweets I could get. My handle is: DeathCab4Callie\n\nThe post is pinned!", "author": null, "created": 1595039811, "retrieved": 1632845245, "over_18": false, "upvotes": 679, "upvote_ratio": 0.98, "comments": {"fyhsq3g": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyhsq3g/", "text": "That's great that you're being listened to finally. But what are going to be the consequences, if any, for Yale and the postdoc? Yale needs to be punished, and the postdoc should be fired.", "author": "tunaMaestro97", "created": 1595103823, "upvotes": 3}, "fyhpq3k": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyhpq3k/", "text": "The title IX investigation I was part of at Kent State also said the claim was unsubstantiated...and the dude did the same thing 3 months later. Got a cushy separation agreement too. \n\nI’m so sorry.", "author": "RemarkableMushroom5", "created": 1595102205, "upvotes": 3}, "fyhacsd": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyhacsd/", "text": "Good for you that sounds awesome", "author": "deeznutz247365", "created": 1595093784, "upvotes": 3}, "fyh97z5": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyh97z5/", "text": "I'm sorry this has happened to you. This happened at my institution and the postdoc was removed within a week so hopefully the culture is starting to change.\n\nOut of curiosity, what happens when you confront the postdoc face to face? Sounds like he is either very immature or a bit of a sociopath. Maybe both", "author": "The_Neuroscientist", "created": 1595093159, "upvotes": 5}, "fyh3gfo": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyh3gfo/", "text": "Retweeted even though I have almost no follower base. \n\nI’m so sorry about your horrendous experience.\n\nAlso, I feel like there should be a social group for STEM women with overly bonded Aussies (Sorry so random.)", "author": "graygoohasinvadedme", "created": 1595089982, "upvotes": 4}, "fygtbp8": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fygtbp8/", "text": "This seems like a shining example of why creating a paper trail is so important. Document everything. Follow up conversations with emails memorializing the substance of the conversation. Take screenshots of text messages. Whatever you need to do to make sure people are accountable for what they knew and when.\n\nAnd my god. When the university falsifies a report and that can be verified, it is like they are asking for a hurricane of shit. Good luck, OP!", "author": "AlbanySteamedHams", "created": 1595084171, "upvotes": 18}, "fygshed": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fygshed/", "text": "Retweeted! Totally unacceptable, it blows my mind how major universities continue to ignore this problem", "author": "microvan", "created": 1595083663, "upvotes": 5}, "fygr6x3": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fygr6x3/", "text": "I'm so sorry you have to deal with that shit. Thanks for not staying silent. It's really brave to keep pushing to get some amount of justice or results. As a female in stem myself, one of my biggest fears is that I will have to deal with such a situation myself - I don't know if I would be as brave as you. I really have to thank you for speaking up & not just putting up with this. I'll go find your tweet &  retweet it!", "author": "mrross00", "created": 1595082869, "upvotes": 6}, "fyghefm": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyghefm/", "text": "Rooting for you.", "author": "PumpkinCrumpet", "created": 1595075997, "upvotes": 6}, "fygd8x5": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fygd8x5/", "text": "Keep us updated, we are rooting for you.", "author": "sapphireblues_", "created": 1595072252, "upvotes": 6}, "fyg2ad6": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyg2ad6/", "text": "Sure I'll retweet. It's terrible to hear what happened to you. But also good to hear you've stood strong. I'll ask my friends to retweet as well.", "author": "Annyunatom", "created": 1595060574, "upvotes": 6}, "fyg28ak": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyg28ak/", "text": "Holy shit, I’ve retweeted your thread but also what the actual fuck????", "author": "sailawayorion", "created": 1595060513, "upvotes": 15}, "fyfz0me": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfz0me/", "text": "So much love to you. I am so sorry to read about what you have gone through. \n\nI had an experience that is nearly identical to yours. My claims, and the claims of 4 other women before me, were found unsubstantiated. This is with audio and email proof of repeated harassment. Some PIs treated me differently after the investigative process; much colder, avoiding me, and so forth. That was, and has still been, hard. The worst part has been the backlash from my peers. I had a few male colleagues tell me it was all in my head, and these are men that proudly call themselves allies. I’ve had others claim I shouldn’t make a big deal about it. It is so frustrating to know so many men who are complacent to  these issues, or negate how exhausting it is being a woman in academia. \n\nI am so sorry for what you have experienced, and I am oddly comforted that I am not the only one. We stand together.\n\nI would like to share your story but I’m not on Twitter. Have you posted it anywhere else?", "author": "Shh_Hush", "created": 1595057134, "upvotes": 33}, "fyfyugd": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfyugd/", "text": "Maybe check out r/legaladvice as well btw", "author": "kentonw223", "created": 1595056955, "upvotes": 4}, "fyfwkp8": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfwkp8/", "text": "GoTtA PrOtEcT tHe YaLE rEpUTaTiOn\n\nThis is indeed morally bankrupt and let's hope that Yale will soon get their justice. I'm sorry to hear about what had happened OP, and I want you to double down your efforts to win this battle.", "author": "Kinsoo", "created": 1595054715, "upvotes": 49}, "fyfss2l": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfss2l/", "text": "Just RT’d. Love and strength, sis.", "author": "JediMasterVII", "created": 1595051234, "upvotes": 8}, "fyfmltp": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfmltp/", "text": "Can we get a pinned list of all departments with problems like this somewhere? If they can't govern themselves, maybe bad reputation and new students avoiding those departments might help.", "author": "UnspectacularAim", "created": 1595046309, "upvotes": 102}, "fyfmdle": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfmdle/", "text": "Just retweeted, I hope getting it out there helps! Best of wishes and stay strong- you’ve got this/DMs are always open if you ever need someone to talk to!", "author": "sassmaster24", "created": 1595046142, "upvotes": 20}, "fyfk7tm": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfk7tm/", "text": "Major kudos to you for speaking out, it is absolutely asinine what some of these schools think they can get away with in the realm of Title IX. You have my full support.", "author": "Kaysa_Dilla", "created": 1595044593, "upvotes": 47}, "fyfjbd9": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfjbd9/", "text": "Hey, I’m sorry this shit happened to you. Are you in contact with your student union at all?", "author": "maps1122", "created": 1595043971, "upvotes": 60}, "fyfgkk5": {"link": "/r/GradSchool/comments/ht95w9/title_ix_violation_at_uni/fyfgkk5/", "text": "I believe you, and I retweeted your tweet. No one deserves to go through this- your immense strength in coming forward is evident, as is your courage. Let me know if I can do anything else.", "author": "compost_bin", "created": 1595042098, "upvotes": 147}}}