{"sid": "810cer", "link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/", "title:": "Shout out to advisors who treat their students with respect", "text": "Before my PhD, I did not understand the importance of having a good mentor. My dissertation chair (mentor) treats me with so much respect, and I am beyond thankful. \n\nI’ve been having some difficulties with my dissertation topic lately, and I’ve left his office every time feeling so much better. He reassures me and reminds me why the research is important and why I’m getting this PhD. He challenges me, but never makes me feel stupid for not knowing something. \n\nSo, shoutout to all the mentors who treat their students like human beings and with the respect we deserve. ", "author": "mks93", "created": 1519857609, "retrieved": 1632953999, "over_18": false, "upvotes": 340, "upvote_ratio": 1.0, "comments": {"dv25dy2": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/dv25dy2/", "text": "Hm. Yea, absolutely.\n\nIn fact I just had a very recent experience that was a perfect juxtapose for a good mentor and a bad one.\n\nI'm in a project with a heavy computer science component but no computer scientists in our group or nearby. We have 2 mentors who are working with us.\n\nMentor 1 hates me. This stems from my tendency to enumerate a lot of the problems we have. For example, we've actually discovered someone's PhD thesis from 2003 where they directly solved (or... claimed to) solve our project. Like completely. However, we have no idea how they did it, and after nearly a month of analyzing their thesis, we're no closer to understanding it.\n\nThis has frustrated me to no end... and I may have let my frustration known. Specifically... this stupid fucking paper. If we understand what the fuck is going on, we can do it. But we can't... One mentor accused me of whining and basically glares at me w/o talking every time we see each other and meets. I have no idea what's going on in his head and I feel really bad since he was the one who recruited me onto the project.\n\nMentor two was basically, \"its alright that you don't understand this thesis, you've only spent a month trying to understand someone's life work in a field outside your own. What do you have so far?\"\n\nAnd basically has had the effect of shutting me up, really, and getting down to work.\nIts amazing how a single sentence can either make or break your entire moral during a tough project.", "author": "Dunewarriorz", "created": 1519971445, "upvotes": 1}, "dv1t6sf": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/dv1t6sf/", "text": "I always say that I feel like I lucked out with my supervisor. I used to sometimes be surprised that he dedicates the time he does to his students while managing all the other stuff he does. He takes us out for lunches or dinners all the time (as a lab), is easy to talk to, and is very casual. He's one of those professors that puts smiley faces in every email he sends to his grad students. Also very supportive. I just got some ridiculous reviews on a paper and he said he'd go to bat for me about them. Grad school is super stressful, but having him for an advisor makes it so much easier.", "author": "cm0011", "created": 1519956428, "upvotes": 2}, "dv13h7d": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/dv13h7d/", "text": "I have a very nice advisor too. He is currently talking with the PhD student who suffered a life-changing injury, trying to help the student continue PhD/career in the best possible way, whether that will be in our group (after the maximum allowed paid leave and as much unpaid leave as needed for maximum recovery) or elsewhere.\n\nI could have been, probably deserved to have been kicked out of my PhD many times (for poor research progress and generally not knowing WTF I am doing), but I am still here, because I have a very nice advisor, who is thankful for the little I do accomplish and respects the few useful traits I do have (better said, puts my weird traits to good use). \n\nI thought my nice advisor and my effort would be enough for me to succeed or at least get a PhD. But it may not be. It seems most PhD students in my field get extensive hands-on mentoring and all kinds of research and career help also by postdocs, more senior PhD students, etc. Which for me isn't possible to anywhere near that extent, mainly due to [language and cultural barriers](https://www.reddit.com/r/chemistry/comments/7vqb7h/how_would_you_do_a_phd_if_you_had_a_wellequipped/). It breaks my heart that if I fail people will blame my advisor. He has his difficulties, he is young and has little experience with PhD students, but he is nice and respectful and trying hard about us.", "author": "AstraGlacialia", "created": 1519931627, "upvotes": 1}, "dv0zjb8": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/dv0zjb8/", "text": "My advisor was the one reason I was sorry to move away from my hometown after undergrad.  I moved a thousand miles away and graduated last May and he still calls to see how I am and how applications are going. He's still reviewing papers for me and working with me on my languages. He may have the personality of Dr Sheldon Cooper, but he's my favorite person in academia.", "author": "dewitt72", "created": 1519928151, "upvotes": 1}, "dv0k5j0": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/dv0k5j0/", "text": "My potential dissertation chair noticed my recent lack of research productivity. Rather than attributing it to a personal failing on my part, she looked at the institutional circumstances that have produced it: namely, the stress of my current dual-appointment and how I'm being saddled with a lot of unnecessary work that's distracting me from my own writing. We are working together now to cut down on that mental load. Having someone encouraging who is like \"this is not your fault,\" while also holding you accountable when you need to be held accountable, is invaluable.", "author": "NotYourFathersEdits", "created": 1519913502, "upvotes": 10}, "dv0hz9e": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/dv0hz9e/", "text": "[deleted]", "author": null, "created": 1519910679, "upvotes": 4}, "dv0f2df": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/dv0f2df/", "text": "Yup! Some of us choose our supervisor based on this criteria :) It's important! The project *and* the group must be a good fit before accepting the position. ", "author": "ilovebeaker", "created": 1519905920, "upvotes": 3}, "duzxv2a": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzxv2a/", "text": "This is exactly why I stayed at my undergrad institution. My advisor reassures and supports me, yet pushes me to still be productive. It has made the grad school experience thus far rewarding and fun", "author": "bernoulli07", "created": 1519875035, "upvotes": 20}, "duzw7qu": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzw7qu/", "text": "My advisor always puts me down, only criticising but not contributing", "author": "rainbowbowbow", "created": 1519873185, "upvotes": 11}, "duzvynx": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzvynx/", "text": "I'd argue that having and working with a good mentor is the most important part of grad school and can make or break the experience. A good mentor is so important to success (not that you can't succeed without one, but man is it so much harder).", "author": "hypertrash", "created": 1519872909, "upvotes": 18}, "duzteoa": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzteoa/", "text": "So, for one of my friend's Master's defense, I was part of the audience for his defense presentation and my PhD advisor was on his committee.  At one point I jokingly made a loud comment about how happy I was I had an awesome advisor, and you heard that, didn't you? and she laughed.\n\nWell.  This poor guy defending.  His advisor was on the phone in his office as the scheduled time for his defense came.  The poor guy went to his advisor's office to get him like fifteen minutes after his defense was supposed to start.  Another fifteen minutes pass, and then one of the committee members went to get the advisor.  Another five or ten minutes, and the advisor finally shows up.  He sits down and says, \"Okay, now what's supposed to happen?\"  The committee member who went to get him said in a voice trying to hide irritation said, \"Well, now you introduce him and he gives a presentation.\"  Now, I went to plenty of defenses, and usually, the advisor stands in front of the audience and gives a brief introduction to the student (including things like educational background and major accomplishments) and the topic, and then sits down.  The asshole advisor just said, \"This is my student, he's going to give a presentation,\" without even getting up from his seat.  So, okay, that's weird.\n\nThe presentation ended.  The asshole advisor then said, \"So can we [referring to members of the committee] ask him questions, too?\" when it came time for the non-committee audience members to ask questions (which almost always involved some softballs because we were mostly students together and friends!).  The committee member who tried to fetch him initially said, \"Well, we can, but it's generally frowned upon.  That's for the closed-door session.\"  The fucker ASKS A QUESTION ANYWAY.  And not an easy one, either.\n\nFound at later that the fuckhead HAD ONLY READ HALF OF THE STUDENT'S THESIS THE NIGHT BEFORE.  I mean, my advisor, and most of the others in the department, wouldn't have let their student defend without feeling very confident that the thesis or dissertation was very close to a final form and any comments from committee members would be minor.\n\nThe advisor provided absolutely no guidance to his student, and the poor guy had to basically self-teach everything.  I mean, granted, a lot of self-teaching is expected in grad school--we're sometimes expected to master complex topics that our advisors don't know much about but our necessary for our research--but this was beyond excessive.\n\nAnyway, I shot my advisor a sincere e-mail saying, \"Yeah, you know how I was joking about you being a good advisor before the defense?  After that, I want to sincerely thank you,\" and she responded with, \"Yes, that was some interesting advising\" (which for her is a scathing insult, because she's genuinely one of the nicest people on the planet...like she almost makes Mr Rogers look like an asshole).\n\nAaaanyway, yeah.  She was a fantastic advisor.  She was nice, helpful, understanding about my mental illness issues, supportive, intelligent, etc.", "author": "StatusUnquo", "created": 1519870096, "upvotes": 101}, "duzsh43": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzsh43/", "text": "A good mentor is the most important part of a good PhD. Unfortunately too many mentors forget that. ", "author": "dreama7", "created": 1519869102, "upvotes": 16}, "duzqzxb": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzqzxb/", "text": " Agreed! You know when a little kid assumes that their teacher lives at school, and their minds are blown when they bump into the teacher at the supermarket on a Saturday morning? A lot of my advisors seemed to feel the same about me. ", "author": "Philieselphy", "created": 1519867504, "upvotes": 38}, "duzo9bv": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzo9bv/", "text": "Yeah! It makes a huge difference", "author": "thelinttrap", "created": 1519864521, "upvotes": 3}, "duzlxrf": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzlxrf/", "text": "Shoutout to my advisor who is very helpful at experimental design and believes in me and my project even thou sometimes im a dipshit! :D", "author": null, "created": 1519862005, "upvotes": 22}, "duzlneb": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duzlneb/", "text": "[deleted]", "author": null, "created": 1519861703, "upvotes": 8}, "duziug5": {"link": "/r/GradSchool/comments/810cer/shout_out_to_advisors_who_treat_their_students/duziug5/", "text": "Yes!", "author": "mcfluffle", "created": 1519858771, "upvotes": 7}}}