{
  "sid": "plshke",
  "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/",
  "title:": "My best reference/recommendation died before I got a letter of rec. What do I do?",
  "text": "TL;DR: My mentor/undergrad research advisor died in March. He was my best reference for applications. I'm hoping to apply this fall - what do I do?\n\nNot sure if this is the best sub to ask this question, so please direct me if there is somewhere better to post this. I'm planning to apply for PhD programs this fall after finishing my undergrad in 2018 and working for a couple of years to gain experience/save up some money. While an undergraduate, I developed enough faculty relationships that four professors offered to write me letters of rec when I applied for grad school. Of all these faculty, the strongest connection was my thesis advisor with whom I did tons of interesting, varied work and had a close friendship. He also had health problems and died suddenly in March. \n\nBased on the work we did together, I considered his letter of recommendation to be the strongest of the bunch by an order of magnitude. Additionally, I'm planning to enter a field (ecology and field biology) where research experience and recommendations are the primary consideration in selecting students. Is there any way to carry evidence of our relationship forward in my applications? Maybe I could have one of the his former grad students who knew about it write one? Should I give up on that recommendation and stand the others?\n\nAny advice is appreciated. Thank you!",
  "author": "dickfacejenkins",
  "created": 1631304045,
  "over_18": false,
  "upvotes": 45,
  "upvote_ratio": 0.96,
  "comments": {
    "hcf2rkt": {
      "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hcf2rkt/",
      "text": "Write it yourself.",
      "author": "kerstiin",
      "created": 1631354288,
      "upvotes": 1,
      "replies": {}
    },
    "hcdvgut": {
      "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hcdvgut/",
      "text": "You should ask the department chair to write one, and describe why.",
      "author": "ning7",
      "created": 1631323793,
      "upvotes": 5,
      "replies": {}
    },
    "hcdehja": {
      "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hcdehja/",
      "text": "I was actually in the same boat last year.  I worked for a woman who was huge in my field, but sadly she died before I applied (obviously it was sad for 1000 more important reasons).  I ended up reaching out to the PhD student I worked with the most who had since graduated.  I didn’t read his letter but he said in the letter he did explain the circumstances and noted what she had said about me to him.  I got in so I assume it all worked out.  Good luck!",
      "author": "tennmyc21",
      "created": 1631315266,
      "upvotes": 11,
      "replies": {}
    },
    "hcda99k": {
      "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hcda99k/",
      "text": "Hey, I'm a field ecologist (PhD). Here's what you should do:\n\n1. Was/is there currently a post-doc in the lab? This is the person who should write your letter, particularly emphasizing your roll in research in the lab. If there's no post doc then...\n\n2. Grad students, especially PhD students (go for the most senior.) If they can write you a supplemental letter explicitly stating your advisor died, that would give any committees a good context as to why a prof isn't writing your letter. \n\n2b. In conjunction with the grad student determine if there are other faculty that worked closely with your PI and talk to them. They might write you a letter or point you in the right direction.",
      "author": "teriyakidonamick",
      "created": 1631313217,
      "upvotes": 13,
      "replies": {}
    },
    "hcd6e6h": {
      "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hcd6e6h/",
      "text": "I would guess speaking to your department chair about the situation would help. They might write a letter in lieu of your deceased advisor - and could perhaps get background from the grad students you mention. Academic clout is a thing, so this is better than the grad student.\n\nAnother good option is a professor he was close with, especially if there was one that collaborated on the projects you did.\n\nMy guess is that the letter should include some explanation for the reader.\n\nI hope it  goes well!",
      "author": "PeaceAndPrajna",
      "created": 1631311395,
      "upvotes": 38,
      "replies": {
        "hcdf02h": {
          "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hcdf02h/",
          "text": "This is a great idea.",
          "author": "ThePeregrine_87",
          "created": 1631315521,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hccu5ie": {
      "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hccu5ie/",
      "text": "Do any of your other potential letter writers have knowledge of the work you did with him and your relationship? If so, you could ask one of them to address that in their letter along with the fact that he unfortunately passed away. Just something like \"dickfacejenkins worked closely with professor on x,y,z including on his thesis. Professor always had x good things to say about dickfacejenkins, but he unfortunately passed away this past March.\"",
      "author": "archaeob",
      "created": 1631305994,
      "upvotes": 5,
      "replies": {}
    },
    "hccszsk": {
      "link": "/r/GradSchool/comments/plshke/my_best_referencerecommendation_died_before_i_got/hccszsk/",
      "text": "You don't have to do anything special. The easiest option would be to find someone else lower on your list and ask them for a letter.\n\nIf you want to do something extra, you can usually send additional materials with your application. I suggest writing a letter that explains the situation. Be open about the loss and disappointment, but emphasize the work you did together.\n\n>Maybe I could have one of the his former grad students who knew about it write one?\n\nEh, I don't like that idea. It seems a little tacky to ask someone whose former advisor just died to do some extra work for you. I see where you are coming from, though.",
      "author": "HerndonMath",
      "created": 1631305501,
      "upvotes": 30,
      "replies": {}
    }
  },
  "updated": 1634067412
}