{"sid": "pj9nzz", "link": "/r/GradSchool/comments/pj9nzz/whats_been_your_experience_as_a_bipoc_in_grad/", "title:": "What's been your experience as a BIPOC in grad school?", "text": "As a POC enrolled at a predominantly white university, I feel very lucky to not have experienced explicit discrimination during my graduate degree. In fact, in my country, I would say that active efforts being made towards diversifying the academ-osphere. That said, I've definitely heard about others who haven't been as fortunate. \n\nIf you're a BIPOC grad student, do you have a story about grad school relating to your race/ethnicity (100-200 words) that you would be willing to have read on a podcast (not linking for sake of Rule 8)? It can be good or bad - I think it's important to highlight both!", "author": "GSconfessional", "created": 1630965954, "retrieved": 1632844764, "over_18": false, "upvotes": 0, "upvote_ratio": 0.5, "comments": {"hbw80se": {"link": "/r/GradSchool/comments/pj9nzz/whats_been_your_experience_as_a_bipoc_in_grad/hbw80se/", "text": "I definitely don’t feel like it has negatively or positively impacted my graduate education or opportunities. With that being said, I also haven’t tried to make my race a part of my graduate experience whereas some people are passionate about joining student orgs geared towards poc. \n\nThe only thing I’ve noticed during my time in grad school is when people try too hard to be “woke” and pc and it backfires. Especially when a non-poc tries to correct me or belittle me for saying something because they assume I’m not poc. The look their faces when tell them is priceless (followed by a “did you just judge me based off of the color of my skin?”). It’s like a uno reverse card lol", "author": "plz-wash-your-hands", "created": 1630989220, "upvotes": 2}, "hbvnq69": {"link": "/r/GradSchool/comments/pj9nzz/whats_been_your_experience_as_a_bipoc_in_grad/hbvnq69/", "text": "I am neither bi nor a \"POC\" but I find this question kind of ridiculous, probably 75% of the graduate student body are nonwhite foreign exchange students.", "author": "Glarkin42", "created": 1630978394, "upvotes": 2}, "hbv4im0": {"link": "/r/GradSchool/comments/pj9nzz/whats_been_your_experience_as_a_bipoc_in_grad/hbv4im0/", "text": "My race hasn't played a role in my education (to my knowledge) until this past year where suddenly everyone felt the need to acknowledge my skin color to be accepted in the popular political climate. Seems to be dying down just a tad bit now but for a while there I was reaching peak irritation.", "author": "Chiss_Navigator", "created": 1630968866, "upvotes": 9}}}