{
  "sid": "qbohwa",
  "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/",
  "title:": "How open are you about your mental health to your PI?",
  "text": "I know students have different types of relationships with their PIs, but I was interested in seeing in general how many fellow grad students are open about their mental health struggles with their PIs.",
  "author": "Pigeonheart21",
  "created": 1634688456,
  "updated": 1636199397,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hhawkdt": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhawkdt/",
      "text": "Very very open, especially over the last year. I even introduced him to spoon theory. He's also pretty understanding because his wife also suffers from depression. I honestly don't think I'd be doing as well as I have if I couldn't say, \"Boss, I've been super low this week and I'm sorry I haven't been as productive as I said I'd be.\"\n\nHe's very chill anyway, so I don't think he's treating me different than anyone else, but I still really appreciate it.",
      "author": "DecoherentDoc",
      "created": 1634689684,
      "upvotes": 8,
      "replies": {
        "hhdabg4": {
          "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhdabg4/",
          "text": "Same here, my PI is very understanding and tries to get us to take care of ourselves. We don’t,  but at least she tries.",
          "author": "BoostMobileAlt",
          "created": 1634742107,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhbwqwv": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhbwqwv/",
      "text": "Please let me know how I can accommodate you. But I don't want to be your therapist.",
      "author": "fwafwa",
      "created": 1634709094,
      "upvotes": 8,
      "replies": {}
    },
    "hhcb114": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhcb114/",
      "text": "I keep things professional. \n\nHe is aware that I have XYZ and I inform him when I won’t be in the office because of appointments, but it doesn’t go any further than that. If I were having a truly terrible day and needed to call out then I’d let him know that but without any real detail on my problems. I’m not going to send paragraphs describing my despair at the world. He’s my boss, not my gal pal, not my therapist. \n\nAnd he doesn’t tell me intricate details of his mental health status either. If you’re very, very open and the other person isn’t equally as open then the relationship is lopsided and you’re probably over sharing.",
      "author": "officially_anxious",
      "created": 1634721405,
      "upvotes": 7,
      "replies": {}
    },
    "hhdemn4": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhdemn4/",
      "text": "He is an old Russian guy and doesn't take mental health seriously :/",
      "author": "FreezerDust",
      "created": 1634743875,
      "upvotes": 1,
      "replies": {}
    },
    "hhey1y7": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhey1y7/",
      "text": "Not at all. Not his fault. I know if I fall into a pit of despair, he'll be supportive. I'm just not the \"let's share\" type. I prefer it that way. \n\nKeeping my professional life professional helps me compartmentalize everything going on in my head.",
      "author": "aquila0altaire",
      "created": 1634765942,
      "upvotes": 3,
      "replies": {}
    },
    "hhdwuek": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhdwuek/",
      "text": "Very open, I think. I don't go into all the gory details or expect him to become my therapist, but we've discussed anxiety and depression. I know he suffers from anxiety too and he's aware and supportive of my struggles with anxiety and depression. He's also aware that another labmate and I have ADHD and he doesn't treat us any differently as a result.\n\nI know some people that have a much more business relationship with their advisors and like it that way, but I'm thankful I can be open about it.",
      "author": "KiwiTheKitty",
      "created": 1634751083,
      "upvotes": 2,
      "replies": {}
    },
    "hhed4xx": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhed4xx/",
      "text": "He knows that I am a total wreck but haven't given up. I don't always mention it, though.",
      "author": "AAdrag0n",
      "created": 1634757608,
      "upvotes": 2,
      "replies": {}
    },
    "hhf2a7g": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhf2a7g/",
      "text": "More open than I'd like to be, but it has its benefits. I'm in clinical psych, so it's definitely a somewhat unique situation, but there's still a lot of stigma within the field regarding certain diagnoses. And, of course, issues of competency to practice can come up with any severe mental health diagnosis. (\"Will it harm my client for me to provide therapy/assessments/etc. when I'm feeling XYZ way? If so, what do I do during those times?\")\n\nBecause of our field, when I had to open up to him about my own difficulties (which fall under the stigmatized and questionable competency categories), he was more interested in all the gory details of my symptoms, feelings, level of suicidality, etc than I think a standard PI would be. He does give me a LOT of wiggle room on things in general, while still helping keep me accountable, though. It's pretty nice.",
      "author": "hermit_the_fraud",
      "created": 1634767766,
      "upvotes": 2,
      "replies": {}
    },
    "hhgn9gx": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhgn9gx/",
      "text": "I communicate my general capacity to take on new tasks etc. and she knows that I do occasionally take breaks on very short notice (she has to sign off when I want to take vacation days) but she doesn't need to know any details. She shares on the same level with me.\n\nI once had a breakdown in her office (during undergrad), and a few years later, I was there for her after she had shared her cancer diagnosis with her PhD students and student assistants, so it's not like we don't know that professionalism has (and should have) its limits. But in general, keeping things on a professional level serves us well.",
      "author": "No-Heart-1454",
      "created": 1634797317,
      "upvotes": 1,
      "replies": {}
    },
    "hhjvd3m": {
      "link": "/r/GradSchool/comments/qbohwa/how_open_are_you_about_your_mental_health_to_your/hhjvd3m/",
      "text": "Extremely closed. Medical issues do not need to be discussed with your boss.",
      "author": "groplittle",
      "created": 1634857317,
      "upvotes": 1,
      "replies": {}
    }
  }
}