{"sid": "pxfhhj", "link": "/r/GradSchool/comments/pxfhhj/i_hate_the_social_aspect_of_grad_school_lol/", "title:": "I hate the social aspect of grad school lol", "text": "I really finished my Masters thesis and actually really enjoyed the thesis completion aspect? I got to work on my personal research which I found absolutely fascinating, my supervisor and research team are more than ideal, I live with my fiancée, have tons of family and friends and work part-time research roles so I never felt super isolated or sad during that period. I actually really loved it. I now started my PhD in a program that’s related to my research but a lot of the students have completely different backgrounds than me. The course content isn’t relevant to my research at all it seems, I find the in class discussion horribly uninteresting and I can’t meaningful engage, I don’t really get along with the other students because our research is so different and I’m really struggling. Is this not the place for me? I just want to do my own research in peace, I don’t want to have annoying ivory tower convoluted discussions about theory. It’s stupid and boring lol. Anyways, does anyone else feel like this? Should I still pursue my PhD? I don’t know, I just really like research.", "author": "sanpellegringo1", "created": 1632862051, "retrieved": 1632951951, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"heqwy9x": {"link": "/r/GradSchool/comments/pxfhhj/i_hate_the_social_aspect_of_grad_school_lol/heqwy9x/", "text": "I'm in a similar situation -- I'm a statistical researcher in a very interdisciplinary cohort with curriculum requirements on qualitative research and things that don't quite apply to my work.\n\nWhat I am doing:\n\n* Taking classes and making friends in other department that is methodologically similar. I joined the board game hobby group in that other department hoping to make friends there.\n\n* Online social peer groups with folks at other universities doing similar research.\n\n* Find a small intersection. I changed my focus a bit to include some research questions that could benefit from survey work (Empirical Computer Engineering). Maybe there's one small area of theory relevant to your research interests that could benefit?\n\n* Learning to be more nature at friendships -- I'm likely autistic (undiagnosed) and just all around socially awkward, so doing some reading on how to make friends.\n\nBest of luck!", "author": "a-perpetual-novice", "created": 1632936842, "upvotes": 1}, "hep1eo5": {"link": "/r/GradSchool/comments/pxfhhj/i_hate_the_social_aspect_of_grad_school_lol/hep1eo5/", "text": "I am/was in a similar boat. I’m the only one in my lab other than a post doc I barely see and my advisor. Technically I’m apart of the chemistry department, but my research really isn’t chemistry either. All the other chemistry graduate students have their offices in a completely different building and their labs are close by to the office space. I work in a computer lab and barely see the other grad students in my program. I do see them in seminar and some classes I took, but that’s barely. Initially I made many efforts to talk to them and hang out and stuff, but that basically died out. I think the important thing here is that you came to school for the PhD, don’t worry too much about the other stuff.", "author": "TheRealDrRat", "created": 1632898443, "upvotes": 1}}}