{
  "sid": "qmm011",
  "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/",
  "title:": "Information session with PI",
  "text": "Hi all, I just finished applying to 9 very carefully chosen PhD programs and got an invitation to an \"information session\" with a PI who I would very much like to work with. I'm super grateful for the opportunity to learn more about the lab, but I'm honestly just not sure what to expect. It's too early for formal interviews and this isn't a department/school overview session. I'd like to be as prepared as possible. Anyone experience anything similar, and if so, what did you encounter? Thanks in advance for any help or feedback.",
  "author": "banjobeulah",
  "created": 1636036679,
  "updated": 1636138115,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hjad0iv": {
      "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjad0iv/",
      "text": "I would recommend reading up on that PIs research. They will likely ask you about your research interests, why you want to be a scientist, and what specifically about their work you find interesting and how that fits into your goals. Ultimately they will be trying to assess if your interests and personality will be a good fit for the lab, so go in fully prepared to articulate those interests and to express who you are.",
      "author": "LikeEpisodeVIThemost",
      "created": 1636037114,
      "upvotes": 5,
      "replies": {
        "hjadfoc": {
          "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjadfoc/",
          "text": "Ok, great feedback. I've been familiar with this person's work for a while now and have read over two dozen papers. I'll just go into this as though it were a kind of interview, I think, which is a relief because I'm fairly prepared for that part. Thank you!",
          "author": "banjobeulah",
          "created": 1636037284,
          "upvotes": 1,
          "replies": {
            "hjaij4f": {
              "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjaij4f/",
              "text": "Sounds like you’re in a great position then. Just be sure to express your interest in their work (which sounds like it’ll be honest and easy for you). Be prepared to talk about research you’ve done as well, and feel free to ask them what they’re currently working on. \n\nRemember that they know you’re not a graduate student yet so they won’t expect you to be an expert. Be honest about what you don’t know if they ask something and you aren’t sure about it. The best thing you can do in that scenario is say “I don’t know” or “I’m not sure” followed by an honest attempt to answer or speculate about an answer. PI’s love that. Almost no PI is going to try and bait or trick you.",
              "author": "ImJustAverage",
              "created": 1636039300,
              "upvotes": 2,
              "replies": {
                "hjakjkh": {
                  "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjakjkh/",
                  "text": "Thank you so much. I'm feeling better about this. The research I've conducted is strongly aligned with this person's work, and I have a good deal of experience with it. I think finding out what is to come for their lab in the following years could be a very good talking point.",
                  "author": "banjobeulah",
                  "created": 1636040080,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjadfnu": {
      "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjadfnu/",
      "text": "I applied to my current program just by messaging the supervisor/PI. He sent me an invitation to talk about my interests and why I'd like to work on that project. He also sent me his recent paper to read too get an idea of how much of the lab's research I'd understand; plot twist it went over my head but I managed to link some themes to things I read before. \n\nOtherwise, we talked about why I want to do research in that field, about why I think that a PhD is a better choice for my career given that going straight into industry would be a better financial choice. I ended up skipping a formal interview because of that talk as we ended up covering a lot of topics that would have been covered in an interview.\n\nSo... maybe read about what kind of research their lab does, try to read a paper, make some mental connections of how your background would be relevant to the lab.",
      "author": "yeast_revived",
      "created": 1636037283,
      "upvotes": 2,
      "replies": {
        "hjak9dj": {
          "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjak9dj/",
          "text": "Ok great, thank you. For every person I applied to work with, I did extensive reading to be sure I'd fit in and be able to do good work with their lab. It's helpful to know how your experience played out!",
          "author": "banjobeulah",
          "created": 1636039970,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjaf7l2": {
      "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjaf7l2/",
      "text": "Remember that picking your program/PI/workplace is also about having a nice place to work at for the years you will be there. Try not only talk about science, also talk about why they think their group and department is a good place to work at and why you would want to work there. Try to find out about their attitude about a healthy work/life balance and what kind of culture there is in the department. Of course it can be hard to navigate that kind of discussion when you want to be picked for the position, but it's so extremely important. A PhD will be one of the most challenging things you have done and so you will want to do it in an environment that is not only scientifically satisfying but also a good place to work at. If possible, discuss with their students what they find the best and worst things about working there, but also ask the PI this. Find out if people usually take all their vacation (idk how vacation works in other countries but where I am we get a few weeks vacation every year), if most people there work weekends and so on. You can have a good and productive PhD without working weekends and skipping vacations, but it can be hard to do it if the workplace culture is to never take any time off.",
      "author": "kuddkrig3",
      "created": 1636037996,
      "upvotes": 2,
      "replies": {
        "hjakv0w": {
          "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjakv0w/",
          "text": "These are excellent points, thank you. I know it'll be challenging, and some of the PIs I've applied to work for have told me in no uncertain terms that their support will be limited. It's hard to remember sometimes that they do need us, too.",
          "author": "banjobeulah",
          "created": 1636040201,
          "upvotes": 1,
          "replies": {
            "hjaq7jv": {
              "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjaq7jv/",
              "text": "They do! But it's also important to keep in mind that it's your project and the person you owe productivity to before anyone else is you! It's not your responsibility to further their career, that's their own. It's easy to forget that we work mainly for ourselves as PhD students.",
              "author": "kuddkrig3",
              "created": 1636042266,
              "upvotes": 2,
              "replies": {
                "hjau632": {
                  "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjau632/",
                  "text": "Yes, I'm sure this is true. Things are so competitive sometimes that it's easy to lose track. I was exceptionally selective in where I applied and who I flagged (many programs I only flagged one PI) because I really want that alignment. However, the personality of the PI and lab seem so critical to being able to complete the program and do good work. I feel like I'm so busy selling myself out of anxiety from that void of the unknown and I need to put the focus back on my own path and process, for sure.",
                  "author": "banjobeulah",
                  "created": 1636043775,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjaxax6": {
      "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjaxax6/",
      "text": "This is pretty common. I had a couple short phone calls with my PI before meeting up for what turned out to be an interview. Read up on the lab’s latest research and have a good idea of why you would be interested in doing similar work and how you would be a good fit for the lab. In my experience, academics love to talk about their work with people who show genuine interest. If you know even the basics you’ll get them talking about their passions and you’ll get a sense of their priorities, attitudes, and research interests. It doesn’t hurt to do some standard interview prep as well.",
      "author": "probablybroccoli",
      "created": 1636044979,
      "upvotes": 2,
      "replies": {
        "hjb8vi2": {
          "link": "/r/GradSchool/comments/qmm011/information_session_with_pi/hjb8vi2/",
          "text": "Thank you!",
          "author": "banjobeulah",
          "created": 1636049482,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}