{"sid": "lg4x2l", "link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/", "title:": "Follow up investigations released from 2019 PhD candidate suicide", "text": "Yesterday ACM released the findings of the ISCA'19 misconduct investigation. TL;DR: \"There was clear and convincing evidence\" for all allegations brought by Huixiang's suicide. https://www.sigarch.org/wp-content/uploads/2021/02/JIC-Public-Announcement-Feb-8-2021.pdf \n\nThe original story here: https://medium.com/@huixiangvoice/the-hidden-story-behind-the-suicide-phd-candidate-huixiang-chen-236cd39f79d3\n\nThis is all incredibly sad, and I wish Huixiang could have seen he was worth so much more than his research. I’m glad action was finally taken against his academic advisor, because his behavior was despicable. Really heavy reminder to all of us to find support when and where we need it, and that our identity and worth and even future isn’t written by our failures or even successes in academia.", "author": "errorFohOhFoh", "created": 1612882336, "retrieved": 1632845891, "over_18": false, "upvotes": 367, "upvote_ratio": 0.99, "comments": {"gniaen7": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gniaen7/", "text": "This story is just so sad. The world is too complicated for honest souls. His life is worth more than a degree and some people's wrongdoing, but the resource as a student is limited, not to mention being an international student.\n\nHope haven is a better place, and the bad guys get what they deserve eventually.", "author": "rgbmorningstar", "created": 1613367949, "upvotes": 1}, "gmrzqg7": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmrzqg7/", "text": "This is why so many departments are stressing mental health awareness in grad school. RIP Huixiang. I wish he saw past research and envisioned what he could be even without a PhD because he sounds incredibly smart.", "author": "HistoneHertone", "created": 1612927387, "upvotes": 3}, "gmrtdki": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmrtdki/", "text": "This post deserves more up votes!", "author": "heyxiang", "created": 1612924035, "upvotes": 3}, "gmrgpym": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmrgpym/", "text": "Thank you for sharing. I missed this story when it came out last year, so I’m glad it’s being shared now because what happened to Huixiang is horrible. As grad students ourselves, we need to continue to talk about this to protect ourselves, try our hardest to change the culture for future students, and to honor the memory of the ones who were abused. \n\nI’d love for stories like Huixiang’s to spark a conversation outside of academia to demand change. I doubt anyone in the general public knows how bad the culture is (unless they went to grad school and did research, I don’t even know if it’s a problem is coursework-based grad programs). If this conversation ever leaves academic circles, this isn’t just a “quit your job if it’s that bad” solution. The student-advisor relationship is a weirdly intimate one that can be abused so easily. I personally feel as if it’s not the normal boss-worker relationship because it has a personal/emotional component to it. Plus quitting is not an option for most, since their legal status depends on their enrollment.", "author": "happytransformer", "created": 1612917399, "upvotes": 8}, "gmracs8": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmracs8/", "text": "Honestly, I feel like the professor should be held criminally liable for this student's death since his corruption, dishonesty, and incompetence directly contributed to this students death. The family of Huixiang deserve some kind of justice. Someone posted an article awhile back of another graduate student who committed suicide a year or so ago, and the only consequence that adviser faced was being placed on  leave for a year (during which he took a prestigious position overseas) and ended up returning to the university. I don't know that he faced any real consequences either. \n\nThese people belong in prison, not academia.", "author": "False-Guess", "created": 1612914164, "upvotes": 14}, "gmr71xd": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmr71xd/", "text": "[deleted]", "author": null, "created": 1612912446, "upvotes": 15}, "gmqclo6": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmqclo6/", "text": "I wonder how much Chinese society’s old values of honor and face and submission to ones mentors played a role? I’m Chinese too, and did my PhD in Hong Kong, though I didn’t see anything like this, I saw plenty of questionable things. I feel so sad for the PhD candidate, and the lack of recourse he felt. I would’ve just up and left, but somehow he didn’t feel like he had the choice.", "author": "yenraelmao", "created": 1612898998, "upvotes": 24}, "gmq7cco": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmq7cco/", "text": "Thank you for sharing this. I hadn't known about this tragedy. Truly awful what happened to Huixiang.\n\nI was in a similar situation where 3 days before the paper submission deadline I found out from the ablation study that the entire idea which our paper was based on turned out to be flawed. I was fortunate enough that my team members and the supervisor were encouraging and supportive, and I was able to focus on doing 'good science'. We ended up retracting the paper submission but never have I felt more relieved. I was in constant stress before that. What I can share from my experience is that your integrity and the fact that you are doing 'good science' are more important than a cheap academic success at the expense of potentially bringing the field down (by not following proper tools of science and reporting false ideas that are not backed up by evidence).  \n\n\nps. do ablation study!", "author": "justanother142", "created": 1612896764, "upvotes": 27}, "gmpsebt": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmpsebt/", "text": "Thank you for posting this - I hadn’t heard about this at the time and what this student went through was just plain wrong. I am glad his story is being heard.\n\nHas anyone heard of the Academic Parity movement? I am listening to a seminar from one of the co-founders and he happened to put the information on his last slide. I was curious so I googled. Here is their URL: paritymovement.org. \n\nTheir website states: “The Academic Parity Movement is a non-profit organization born out of a need for justice, and the protection of students’, postdocs’, and early career academics’ (including junior faculties) most basic human rights within academic institutions.” \n\nYou can report an incident, but I’m not sure how useful it will be since you can’t report anonymously... still seems like a step in the right direction though. They have international partners as well. \n\nUltimately the culture within and outside labs has to change. So many PIs only chase power and prestige. The journals are too interested in maintaining their brand and selective image. And of course everyone who needs visas to keep doing research is uniquely susceptible to this kind of bullying.", "author": "memowz", "created": 1612890416, "upvotes": 38}, "gmpp9og": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmpp9og/", "text": "[deleted]", "author": null, "created": 1612889080, "upvotes": 128}, "gmpmbyz": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmpmbyz/", "text": "Thank you for posting this. Awful story. I wonder how many more like it are out there.", "author": "prevatius", "created": 1612887839, "upvotes": 34}, "gmpi1en": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmpi1en/", "text": "Less than half of people even end up working in the field they graduate in for most majors.  \n\nFor 95%+ of PhDs academia will not be the rest of your life.  Even adjunct positions at CCs are sparse nowadays.", "author": "natalfoam", "created": 1612885954, "upvotes": 49}, "gmpg46a": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmpg46a/", "text": "Oh no....I remember the original story. So heartbreaking!", "author": "chlcwelc", "created": 1612885091, "upvotes": 58}, "gmpdrhp": {"link": "/r/GradSchool/comments/lg4x2l/follow_up_investigations_released_from_2019_phd/gmpdrhp/", "text": "I hope that professor get rapes to death in prison after mentally abusing a student.", "author": "anavarzaaa", "created": 1612884018, "upvotes": -145}}}