{"sid": "pk645h", "link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/", "title:": "What PH.D programs merge Computer Science with Art?", "text": " I need your advice, I'm currently very lost. I have a Master's degree in Computer Science but my interests really lie in Art. In order to fulfill my dream of being a professor, I have to take a PH.D. I would just like to ask what programs I could probably take. Suggestions for universities will also be greatly appreciated.", "author": "SeigneurTiano", "created": 1631087961, "retrieved": 1632844720, "over_18": false, "upvotes": 4, "upvote_ratio": 0.7, "comments": {"hc44emg": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc44emg/", "text": "Ux ui and hci", "author": "Trakeen", "created": 1631140368, "upvotes": 2}, "hc3j045": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc3j045/", "text": "Draw art, mint it as nft on blockchain, so cryptography + security?\n\nJokes aside. Maybe HCI? Design more user friendly GUIs? I think that what HCI people do.\n\nAlso, Computer Graphics? Lots of math. I knew a student in CG simulated the whole cities to understand + address traffic problems. Look pretty cool.", "author": "diamondduck112", "created": 1631130254, "upvotes": 2}, "hc3g4aa": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc3g4aa/", "text": "Also fwiw- you can just do a PhD in computer science and study art however you see fit. Or do a PhD in art and study computer science however you see fit. A PhD is an opportunity to invent a field that does not already exist.", "author": "gentleboys", "created": 1631129069, "upvotes": 2}, "hc3fxzf": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc3fxzf/", "text": "UW and MIT are the only programs I can think of with work like this. Both good HCI schools with lots of “tangible media” type stuff and fabrication. If you’re into data visualization and consider that as part of art (which I personally do) Jeff Heer - the professor behind D3 - has a great group. Hiroshi ishi runs the tangible media stuff at MIT.", "author": "gentleboys", "created": 1631128994, "upvotes": 2}, "hc2ye3v": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc2ye3v/", "text": "Hey! Here’s a secret. Once you’re in grad school…you can do whatever you want! If you want to do computer science and art….no one is going to stop you!\n\nWhen you’re a PhD student, you are a contributing to academics as a whole and are free to do anything as long as it meets academic standards. To give an example, you can join a computer science PhD and still work with the art faculty while using your computer science perspective. Alternatively, you can get an Art PhD and work with computer science faculty on a project. \n\nI am an English PhD student but a professor of mine is working with computer science PhD students to help digitize archival work and experiment on how best to merge physical things like books and letters and even lost works to modern forms of reading and storage. \n\nTrust me, there’s space out there. But the bad news is that you kind of have to go out and carve that space for yourself. No one can really give you a program that does that. You kinda have to just do it for you", "author": "MinervaMinkMink", "created": 1631121784, "upvotes": 2}, "hc2ib33": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc2ib33/", "text": "You might want to look into the Media Lab at MIT. There are students from CS in those labs, and there is a degree in comparative media studies. \n\nThe media lab has had some scandals in the past few years, but many people have had good experiences there (from my friends' accounts it was limited to a few troubled lab groups and most had no idea of what was going on).", "author": "Aerokicks", "created": 1631115126, "upvotes": 1}, "hc22c6i": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc22c6i/", "text": "Not sure about education and degrees, but I hear that people are making CRAZY amounts of money off of generative art. So maybe in the meantime try to do that while you’re waiting to get in somewhere? :)\n\nTyler Hobbs’ Fidenza series is widely regarded as a holy grail in those realms. (See his other work as well, it’s quite impressive imo):\n\nhttps://tylerxhobbs.com/fidenza", "author": "TheWiseGrasshopper", "created": 1631108201, "upvotes": 7}, "hc1z6g3": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc1z6g3/", "text": "Human-computer interaction? You can do a lot of cool things like developing a new way to interact with or create art", "author": "tmonday", "created": 1631106653, "upvotes": 6}, "hc1s8d0": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc1s8d0/", "text": "Perhaps you would be interested in a PhD in Digital Media Studies?\n\nhttps://dm.lmc.gatech.edu/program/phd-program/?doing_wp_cron=1631085638.1344358921051025390625", "author": "raistlin65", "created": 1631102886, "upvotes": 10}, "hc1na3s": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc1na3s/", "text": "I've seen quite a lot of programs focusing on art using CS and specifically AI and they seemed real fun. I remember one research on music generation and they had created this beautiful platform.", "author": "Donut_Dudes", "created": 1631099686, "upvotes": 1}, "hc1klbv": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc1klbv/", "text": "Computer graphics maybe - lot of linear algebra tho :)", "author": "node1hometree", "created": 1631097670, "upvotes": 3}, "hc1ftk0": {"link": "/r/GradSchool/comments/pk645h/what_phd_programs_merge_computer_science_with_art/hc1ftk0/", "text": "Pixar U! ;)", "author": "UleeBunny", "created": 1631093547, "upvotes": 5}}}