{"sid": "d8pyy5", "link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/", "title:": "I am about to make the greatest decision ever.", "text": "My advisor is so quick to dismiss my ideas. “That’s not relevant,” “that’s not publishable,” “don’t waste your time,” “what is the significance?” That’s just the surface.\n\nLast semester I took two very heavy classes, and he suggested them. On top of that, I was his TA. In March, he put me on a new project and expected basically immediate deliverables. I told him my classes were taking up all my time and that in order to keep the minimum gpa requirement for the project I need to put more focus on my classes. Once the summer hit, I tried to close the gap between where I was and where the project was, but both I and the project were moving forward. It was far too overwhelming. At that point, I was just doing what they told me to do on top of what they’ve already done while I was trying to keep my head above the water.\n\nMy advisor said that because of my lack of contribution he didn’t want to completely dismiss me so he wanted to talk about options. For this project, he’d only to continue to support me if I step down as an MS student because “you’re not being a PhD student; you’re doing what you’re told; you’re being a technician. Consider this your last chance.” He was also the source of a lot of drama and miscommunication. His approach was “throw her into the pool and expect her to learn to swim.” But I was in a condition where I was already drowning as is.\n\nI consulted the grad office. I made sure I had nothing to lose. The thing about my university is I can switch back to PhD anytime I want to. So...to be funded, I temporarily stepped down.\n\nI recently took an interest in another direction of research. I talked to one of the professors of a class I’m taking. He apparently is currently doing research in that area. That professor is a world renowned physicist. Very famous. When I told him about my position and warned him of my lack of experience, he said he will actively work with me, not against me. When I told him about how my ideas get dismissed, he knew exactly who I was talking about and said “yeah he is very close minded.” The cherry on top is I can actively practice my Hungarian too! (My fiancé and I plan to spend part of our honeymoon in Budapest.)\n\nNot only did he listen to my ideas, but he said “let’s turn these into publications!” and “let’s write a proposal!”\n\nHe also said he’ll help me reach my target in graduating in two years because I already wasted 2.5 years. He also said my current experience helps tremendously.\n\nThank you for listening to my relief. :)", "author": "Palerthanghosts", "created": 1569344149, "retrieved": 1632953220, "over_18": false, "upvotes": 776, "upvote_ratio": 0.99, "comments": {"f1etwwv": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1etwwv/", "text": "Awesome. It's really nice when these huge names end up being great educators and not just research snobs.", "author": "purple_ombudsman", "created": 1569430162, "upvotes": 2}, "f1dnh2e": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1dnh2e/", "text": "Yes!", "author": "TakeOffYourMask", "created": 1569390878, "upvotes": 2}, "f1delkl": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1delkl/", "text": "I'm so glad you found the second prof. All the best to you!", "author": "instacandywhut", "created": 1569381620, "upvotes": 2}, "f1ddm55": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1ddm55/", "text": "Omg that’s awesome! I was expecting some bad news in this post but am happy it’s all positive!! Good luck 😊", "author": "FemaleScientist17", "created": 1569380763, "upvotes": 2}, "f1d7onm": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1d7onm/", "text": "Congrats! I entered as a PhD student in one program and essentially stepped down to an MS student after something far too similar happened. I then worked with a very sympathetic professor (part of the grad office) who helped me find my current program and advisor. I am again a PhD student and funded in a different program. It’s a much better fit for me and I used my experience to help find my new research topic (I am in a social science)! I love seeing people who had rough journeys like me happier now that they are on the other side especially when they are still in grad school. \nYour advisor can really make all the difference. \n\nGood luck with your new advisor!", "author": "PenguinFeather4", "created": 1569376048, "upvotes": 8}, "f1d5yx7": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1d5yx7/", "text": "It seems the importance of having a good advisor for having a good graduate school experience is difficult to overstate.", "author": "The-Credible-Hulk79", "created": 1569374760, "upvotes": 3}, "f1d0st1": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1d0st1/", "text": "[deleted]", "author": null, "created": 1569370882, "upvotes": 38}, "f1cz56f": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1cz56f/", "text": "And it's so nice to see a happy story once in a while. That was a roller coaster though!", "author": "lunatics_and_poets", "created": 1569369635, "upvotes": 3}, "f1cr27d": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1cr27d/", "text": "Check out researchgate for community regarding publications", "author": "acs20596", "created": 1569363744, "upvotes": 1}, "f1cppdw": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1cppdw/", "text": "Wow. So happy you could find someone who'd guide you appropriately for your PhD! 😃", "author": "clockworkascent", "created": 1569362802, "upvotes": 2}, "f1cnbyn": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1cnbyn/", "text": "I had a feeling this was physics. Congrats!", "author": "ktittythc", "created": 1569361228, "upvotes": 2}, "f1cd5su": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1cd5su/", "text": "Who your advisor is can make a huuuuuuuge difference... and bonus points for the fact that this guy knows that the problems with your previous advisor were largely caused by the previous advisor, and that his approach is different.\n\nI am VERY happy for you!!!", "author": "tentkeys", "created": 1569355114, "upvotes": 45}, "f1c97s3": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1c97s3/", "text": "Congrats.  It sounds like you will do very well under this new advisor.", "author": "engelthefallen", "created": 1569352706, "upvotes": 2}, "f1c3ha7": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1c3ha7/", "text": "This is so awesome! As a struggling undergrad in nearly your same position this makes me feel like there are great advisors out there :,)", "author": "annaballin69", "created": 1569349059, "upvotes": 5}, "f1c28ia": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1c28ia/", "text": "That's more like it! You are a real badass! Get in there.", "author": "fractionalhelium", "created": 1569348255, "upvotes": 2}, "f1c0hm7": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1c0hm7/", "text": "I look at these stories expecting to see \"and that is why I'm leaving grad school before finishing.\"  I'm happy to see that this one has a happier ending!", "author": "willbell", "created": 1569347124, "upvotes": 235}, "f1bzmeh": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1bzmeh/", "text": "Awesome, what an outstanding way to take charge and be proactive!  Good luck on the rest of your program!", "author": "kreuzensolo", "created": 1569346561, "upvotes": 7}, "f1bzizl": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1bzizl/", "text": "Congratulations!!", "author": "OracNimsaj", "created": 1569346500, "upvotes": 6}, "f1bynhq": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1bynhq/", "text": "Congrats! That is an achievement.", "author": "Yeti-or-Not", "created": 1569345934, "upvotes": 2}, "f1bxnad": {"link": "/r/GradSchool/comments/d8pyy5/i_am_about_to_make_the_greatest_decision_ever/f1bxnad/", "text": "I'm proud of you, well done!", "author": "ElectricalIons", "created": 1569345278, "upvotes": 55}}}