{
  "sid": "pyom2p",
  "link": "/r/GradSchool/comments/pyom2p/how_do_you_make_good_presentations_for_graduate/",
  "title:": "How do you make good presentations for graduate classes?",
  "text": "I know the more that someone practices the better they will get at something. \n\nI keep having flashbacks about how bad my first presentation was in one of my seminars. I stuttered and mixed up my words. I had to present on a book that talked about a particular artist. I was expected to tell the class the main arguments of the author etc. The professor gave me feedback after class. The professor was honest and said she wasn’t sure that my peers understood me enough to go back and read the book themselves. That really made me feel shitty but I know she was just trying to give me feedback. \n\nHow do I make good presentations in grad school and survive? I have really bad anxiety. \n\nGrad students, do you also have a hard time pointing out the main claims of an article or book?",
  "author": "haloflower157",
  "created": 1633022980,
  "updated": 1634100203,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hevivb6": {
      "link": "/r/GradSchool/comments/pyom2p/how_do_you_make_good_presentations_for_graduate/hevivb6/",
      "text": "Forget about the powerpoint, find an empty room, and talk to yourself.\n\nI've worked with a lot of people on public presentations, and often the most jarring part is switching between the way they visually vs verbally process information. They put together their slide deck, start practicing their talks, and run into all sorts of transition anxieties both within and between slides - making sure they list all the bullet points, trying to smooth out abrupt slide changes, etc. You're trying to coordinate multiple styles of communication which actually complicates your baseline presentation.\n\nPeople want to synthesize presentations by listening because it's natural, so you should always lead with your most natural verbal voice, and make the rest of your presentation fit that.\n\nSo I stand in a room and stumble over an introduction, and when I lose my footing I start from the top. Between practices I take notes of what ideas I've explored, skipped, or still need to attend to. Over time that builds up, and the momentum from having a strong verbal start lets everything else fall into place more concretely and constructively.",
      "author": "Qunfang",
      "created": 1633023552,
      "upvotes": 11,
      "replies": {}
    },
    "heviwfz": {
      "link": "/r/GradSchool/comments/pyom2p/how_do_you_make_good_presentations_for_graduate/heviwfz/",
      "text": "I find it helps to first make an outline with the salient points you wish to convey, and then build a presentation from that. Avoid putting too much text on slides, and instead use images/figures as memory prompts. Does your program offer any courses or workshops on how to deliver a sucessful presentation? They are usually super helpful",
      "author": "IncompletePenetrance",
      "created": 1633023565,
      "upvotes": 4,
      "replies": {}
    },
    "hevj4ie": {
      "link": "/r/GradSchool/comments/pyom2p/how_do_you_make_good_presentations_for_graduate/hevj4ie/",
      "text": "Are you talking about a formal presentation with presentation slides?\n\nThe best presentation slides are ones that emphasize what you say, not so verbose that they become the presentation themselves.\n\nAnd regardless of whether you use presentation slides or not, outline what you're going to say. That way you can well organize it ahead of time, practice it, and you have notes to refer to.",
      "author": "raistlin65",
      "created": 1633023660,
      "upvotes": 2,
      "replies": {}
    },
    "hew0spt": {
      "link": "/r/GradSchool/comments/pyom2p/how_do_you_make_good_presentations_for_graduate/hew0spt/",
      "text": "Hey! I have anxiety too, speaking up is hard\n\nIf you can, memorise what you're going to say. Write it down - practice over and over, learn a script as an actor would. Once you know it inside out, even when you're nervous, having the muscle memory of it in your head will take away some of the stress of being nervous to do a presentation as well as nerves about remembering your content.\n\nTake notes/cards to read off/check summary points as well, but try to use them as a complement to your presentation",
      "author": "borkinghampalace",
      "created": 1633031076,
      "upvotes": 1,
      "replies": {}
    }
  }
}