{
  "sid": "qvbxsp",
  "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/",
  "title:": "Straight from Undergrad to PhD and feeling like I'm already failing",
  "text": "TLDR: I'm the youngest in my grad school classes and surrounded by older, more experienced students and I feel wildly out of my depth. I feel extremely lonely and isolated from my friends, my peers, and my family.\n\nI graduated from a large state school in May 2021 with a BS in Plant Science, which is six hours from my hometown. My closest friends (tech people) are all moving across the country for their tech jobs right out of school, with most of my other undergrad peers jumping into employment as well. I was able to find a PI with funding for a privately funded project in my field, which sounds like a dream come true! Plus, I have the support of my parents providing me housing, emotional support, and food.  I've been able to reconnect with my old high school friends and hometown friends too.\n\nThe problem comes when I look to my peers here, and what they've always accomplished. Some already have their masters, some have had full careers in this field, some have worked for a while. My topic is also kind of an outlier too; the program is within Earth Sciences but collaborates frequently with the Biology department. I'm thinking about plant and soil chemistry when other students are working on hydrology, wetlands, and hurricanes.\n\nIt feels hard to make friends when most of the people here are 5+ years my senior. I've been a nerd and a relative introvert for most of my life, and I hardly feel like I can relate to others in this new program, much less this university. The uni itself is mostly a commuter school for locals but still has a great reputation for its secondary education programs. \n\nUnrelated but: I still have my doubts that I didn't try hard enough to get somewhere better, didn't look hard enough, didn't find the best option for me. Part of me avoided looking too hard out of fear for the future due to the pandemic, and fears that I would flounder upon moving to a completely new state, with no physical support and more financial debt.\n\nIt's so hard to adjust, to reach out for help. I'm so scared.",
  "author": "danifreedude",
  "created": 1637080863,
  "updated": 1637182633,
  "over_18": false,
  "upvotes": 42,
  "upvote_ratio": 0.96,
  "comments": {
    "hkvy0ff": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkvy0ff/",
      "text": ">The problem comes when I look to my peers here, and what they've always accomplished. Some already have their masters, some have had full careers in this field, some have worked for a while.\n\nNo one expects you to perform like they do. In a year or two, you will be like one of them :)\n\n>It feels hard to make friends when most of the people here are 5+ years my senior. I've been a nerd and a relative introvert for most of my life, and I hardly feel like I can relate to others in this new program, much less this university.\n\nWell, grad school is not about making friends in the way that undergraduate is. A lot of people are there to get the work done, and not socialize extensively like they did as an undergrad. As you say, many of them are older, and they may have lives outside of school. Whereas in undergrad, for many students, school is their social life.\n\nSo at least part of what you are experiencing is grad school for everyone. If you end up working in a lab with other students, or end up TAing where you're sharing an office with others, then you're more likely to get to know people.\n\n>My topic is also kind of an outlier too; the program is within Earth Sciences but collaborates frequently with the Biology department.\n\nThat can make it harder, because grad students often tend to connect to each other through shared academic interests. \n\nYou might want to look for regional or national organizations who are more focused on your area. Get involved, and you'll have a chance to meet other grad students with similar interests to you.",
      "author": "raistlin65",
      "created": 1637088925,
      "upvotes": 12,
      "replies": {}
    },
    "hkw4131": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkw4131/",
      "text": "Well, there's a few different issues here.\n\n1. You can reach out for help! Does your school have therapy?\n2. Grad school isn't always like undergrad, you aren't necessarily going to be friends with all the other students. That's okay! The main thing is that you find the social support you need *somehow*. And welcome to post-grad life - making friends out of undergrad takes a lot more effort. \n3. You can only get your PhD once. That's going to cause regret if you let it. I think everyone has thoughts if they made the right decision, but they usually pass once you get settled a bit. \n\nIt'll be okay! It's just your job, take a deep breath, and remember there's more to you than that! :)",
      "author": "HopefulEmu3465",
      "created": 1637091311,
      "upvotes": 7,
      "replies": {}
    },
    "hkwh6d7": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkwh6d7/",
      "text": "As one of those old people, we're jealous of your likely energy level, resilience to sleep loss, and ability to eat like crap with little consequence. \n\nAlso, some of these difficulties happen in reverse. I struggled with stats quite a bit in my first year. I was in my early 30's, had last taken statistics 11 years prior, and I was sitting next to a 20 year old who understood all the material effortlessly and had taken stats the year before. \n\nWhat I'm saying is there are advantages and disadvantages for everybody. Try and maximize your advantages and minimize your disadvantages.",
      "author": "Pr0gr3s",
      "created": 1637096478,
      "upvotes": 5,
      "replies": {}
    },
    "hkwo1ue": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkwo1ue/",
      "text": "I recommend staying in contact with your friends who are moving away. Try not to be intimidated by the other Phd students, they are your peers now. It doesn't matter that they accomplished other things, they are right there with you, trying to get a degree. They might not be all that confident either. You can make friends with people in the classes you are taking for your Phd whether or not they are in the exact same program you are in. You can make friends with students older than yourself. They are probably nice enough and you probably have a lot in common 5 years different isn't much. They may be good people to network with if they have job experience in an environmental field. \nNo matter how you feel right now, you are good enough for the Phd program. You made the cut for a reason. Try to remember that when impostor syndrome creeps up. You clearly have the ability to be confident, you went straight for the Phd. Other students in the Phd program took a more cautious approach and went for a Master's first. \nThere's nothing wrong with staying closer to home and out of debt if you found a program of interest there. That is just financially smart.",
      "author": "GeologistTrilobite",
      "created": 1637099203,
      "upvotes": 2,
      "replies": {}
    },
    "hkxi15h": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkxi15h/",
      "text": ">I've been a nerd and a relative introvert for most of my life, and I hardly feel like I can relate to others in this new program\n\nThe others in this new program were nerds and relative introverts for most of their lives. That might make them warm up slowly and oddly. But keep trying.",
      "author": "IkeRoberts",
      "created": 1637112027,
      "upvotes": 2,
      "replies": {}
    },
    "hkxtj1t": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkxtj1t/",
      "text": "Another thing worth considering is that you have not only earned a spot among more experienced peers, you’ve done so *without* that experience. What I mean is that they may be in the position of having done additional degrees, worked full careers, and be asking themselves if they should have feelings of imposterism because someone in their lab is working toward the same degree as them at a younger age, which may feel like an advantage. In other words, there are times when everyone feels like they’re the one who doesn’t belong. You belong. You’ve earned your spot",
      "author": "whycantusonicwood",
      "created": 1637117072,
      "upvotes": 2,
      "replies": {}
    },
    "hkvuwmv": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkvuwmv/",
      "text": "I'm 18, introverted, and applying for PhD programs at the moment, so I am intimately familiar with the isolating experience of being younger than everyone and intimidated by adults with much more experience. My advice on the friendship problem you mentioned is to stop thinking of yourself as \"the young one.\" People may try to pidgeonhole you into that role and make you feel different (often with good intentions) - have you heard the \"OMG, you're so young, why are you here, etc.\" schpiel often? I liked it at first but then realized it is not a confidence booster but rather a pattern that ultimately makes me feel isolated, lonely and othered. Once I started to think of myself as having earned my place at the table, one that is equal to others and requires competition at the same level (even if I had less life experience), I connected with people much more easily. I will not say that \"age is just a number\", and experience is certainly not just a number, but I would be willing to bet that you are not so inexperienced that you genuinely cannot relate to someone with 5 more years of work experience.\n\nGood luck with your program!",
      "author": "taqpolymaster",
      "created": 1637087715,
      "upvotes": 5,
      "replies": {
        "hkvz9ge": {
          "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkvz9ge/",
          "text": "Seconded! People going \"Phew! You are young\" was fun at first but then my immediate circle saw me as a really young human bean. On one hand it was pretty coddling-y, which I did not like. But on the other hand being accommodated for my lack of knowledge or understanding my coping mechanisms by these folks (to a certain extent, it is not perfect and it shouldn't have to be, considering the fact that they are also going into grad school), helped me a lot to adjust to the new country and environment and everything.",
          "author": "bookbutterfly1999",
          "created": 1637089421,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkvytgg": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hkvytgg/",
      "text": "ok hey hi! OMG ME TOOO!!!  \n\n\nSo I did a [B.Tech](https://B.Tech) in industrial biotech in my undergrad, and now am in a neuroscience PhD program!!\n\nAnd now I realise that I don't even know the basics of Neuro, while people here have an undergrad in neuro or psych plus some years of research experience or a masters, which makes me the most inexperienced (and young human bean) in my classes.\n\nBut one thing that's kept me sane is the people around me. It helped to know that I ain't the only one struggling, and while the amount I am struggling with is more, the others aren't just coasting by either, but are also having difficulties.\n\nI have done my best to socialize with my neighbors, and people of my own nativity (I am an international student, so needs must, especially in terms of food :P), but I also got to talking with some plant bio PhD folks during our life sciences programs orientation, leading to an interesting group of folks. I have been pumpkin carving, Halloween, trivia night (2 times) and a few pot lucks with these folks and its been pretty interesting hanging out with other new PhD folks of our cohort year but not in our program. Leads to several unique discussions both non-academic, and sometimes even academic ones!\n\nSo for your dilemma regarding friends, don't just look for people in your own department(s) or program and try to befriend folks you interact with daily and/or weekly. Definitely think about joining any clubs that are about your hobbies etc. Its good you have family and friends from before to support you.\n\nI suggest you talk to a guidance counsellor or anyone of that sorts on your campus regarding stress, since it is a compound issue that I am struggling with myself. I also talked to a cousin of mine who's in her 6th year of PhD and she told me that she does hikes and meditation to help cope, as well as talking to her on campus guidance counsellor for legitimate executable solutions to real valid troubles.",
      "author": "bookbutterfly1999",
      "created": 1637089241,
      "upvotes": 1,
      "replies": {}
    },
    "hky1tcq": {
      "link": "/r/GradSchool/comments/qvbxsp/straight_from_undergrad_to_phd_and_feeling_like/hky1tcq/",
      "text": "Seems like we are in a somewhat similar boat. Try coming out of a southern town where everyone got married and had children after high school. I moved to FL to get my bachelors in environmental engineering. Now, I’m almost done with it. (I’ve got this fall semester to finish up.. then the spring semester and my undergraduate degree is done.) I’ve already nearly finished all of my graduate applications for my master’s in atmospheric sciences and am looking at either Texas A&M, FSU, or Colorado Boulder University. Unlike you, however, I am an extrovert. So the social isolation and emotional problems have been much harder without close friends to talk to. I don’t know what to suggest other than maybe joining a club at your university if you want to find somewhere to feel like you’ve fit in. I’ve never felt like I fit in my entire life.",
      "author": "Snoo31272",
      "created": 1637120887,
      "upvotes": 1,
      "replies": {}
    }
  }
}