{
  "sid": "pwzw3f",
  "link": "/r/GradSchool/comments/pwzw3f/falling_in_a_black_hole_of_thoughts_after/",
  "title:": "Falling in a black hole of thoughts after starting MSc",
  "text": "*Please pardon my efforts of making this post anonymous. Would appreciate it if someone with a similar situation could reach out or comment below.*\n\n&#x200B;\n\n**Issue at hand:** \n\nI have been admitted at this above-average university in Thesis based Masters program. I came to this country (US/Canada) a month ago, primarily for Study purposes. I have 3+ years of study gap (was SWE). The course materials seem really advanced. The assignments are so damn difficult! and most importantly I hate doing thesis!!!\n\nI just don't know what I am gonna do. I am just so depressed and lost in my thoughts all the time.\n\nDid I make a mistake coming here, leaving everything and a secured life behind??\n\nAm I overthinking too much? Will I be able to do a Masters thesis?? That even ALONE????!! 😱😱😱 I just don't know...\n\nOh and not to mention the difficulties of international students in a foreign land..\n\n&#x200B;\n\n**Background:** \n\nI was born in a third world country. Never had any complaints or plans to come abroad for any reason. After completing my bachelor's in CS (with top results; 90%+; it was easy; HATED DOING THESIS), I got married and got into a private software company and within 3 years was able to make BIG BUCKS in my country's economic perspective. After getting the latest promotion, I was making so much money that me and spouse didn't even need to think twice before buying any day to day item in quantity.\n\nBUT, we both were very responsible adults and was spending money wisely. Before you know it, we had enough savings showing which we could easily go to North America (US/Canada). Even though I didn't have any plans to come abroad, things quickly started to change.\n\nThe political state of our country, day to day life quality, unimaginable level of corruption everywhere (except private IT sector) and most importantly my career growth reaching the ceiling level and having zero to no challenges at work (other companies couldn't afford me neither could offer the challenge of work that I was looking for) became some of the most pivotal points behind changing my mindset. Also, my spouse was always highly settling abroad, so much so that, they reached out to some professors in Canada with my profile and I wasn't really very aware of that.\n\nMeanwhile, I was applying at FAANG++ and was interviewing rigorously. Was unlucky at G because, even after getting a matched team I got rejected, but that's another story. Amazon, FB, MSFT interviews all resulted in rejects. I was really disheartened and on the other side, I totally lost interest in my job as it literally became child's play for me. I even managed a job abroad, but that county was on the same continent and wasn't really a first world country that I was looking for but the job really challenging and had amazing career growth for me!\n\nRight when I got the job offer, I also got a full fund scholarship for THESIS based Masters in CS at a North American University. So after much thinking, I rejected the job and came to this first world country to pursue my masters.",
  "author": "burn_side",
  "created": 1632808680,
  "updated": 1634100412,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}