{
  "sid": "qv17uq",
  "link": "/r/GradSchool/comments/qv17uq/i_dont_care_right_now_and_cant_force_myself_to/",
  "title:": "I don't care right now and can't force myself to.",
  "text": "Like so many peers on this sub, I am struggling. I'm going to word vomit my story and try to keep it short.\n\nIn 2016, I started work on my master's in microbiology. I was researching, teaching, and taking courses like most of us do. I actually loved it, but was super stressed and started to struggle. Eventually I ended up in the biggest depressive episode I'd ever had, and I was struggling with some health issues. I ended up running into problems doing my research because I worked with pathogens and I'm immunocompromised (it shouldn't have been an issue, but my PI got worried). I ended up having a seizure in the lab, then doing medical leave. When I came back, I got C. diff twice and started to have health issues, and I medically withdrew. I was SO upset. I had fought really hard to try and finish but I just couldn't. I felt so defeated and beaten down.\n\nI spent 2019 in and out of the hospital, moving back in with my parents, and with a homecare nurse. I have Crohn's disease and I had a huge flare - lost a ton of weight, was nonfunctional, etc etc.\n\nDuring that time, my work was actually published, so I felt at least accomplished on that end.\n\nSince then, I've worked on trying to get my health in order and trying to navigate the pandemic. I decided to go back this fall to finish up my master's - I don't have anymore benchwork, just some credits to finish and my proposal and thesis. I'm sad that I don't have lab work to do, but at this point I just want to FINISH. \n\nExcept it has been so fucking hard. It was a hot mess even getting back into school - I had a lot of hurdles but I've stayed really determined (and my therapist is cheering me on, ha). I started the semester with a C. diff infection - FOR THE SIXTH TIME. My grandmother, who I've helped care for in the past year, kept declining. She passed away in September and I've been a mess since then. I turned 30 right after she died and I just can't believe she isn't here. I didn't care about my birthday and didn't want to celebrate. I want to finish for her - I'm the first in my family to go to college, much less grad school, but god it's so hard.\n\nI've struggled so much with my physical health, which has just absolutely decimated my mental health, and on top of that I've had all these family set backs. I'm only in school part time right now (and I work part time, but take a lot fewer hours) but it's all too much. I struggle to do literally anything.\n\nI have to finish next semester. I just can't make my brain work. I can't make myself care. All I've wanted since I left school was to finish and get into my career, but I literally get beat down at every turn. It's either my own body working against me, or life just shitting on me. It's so hard to climb out of the hole, go to class, or get any work done. My health is a huge cloud over my life, and forces me to make difficult decisions. Now I'm just super depressed and it doesn't help. \n\nI want to rise above it all and FINISH but fuck. My brain has turned to goo and I'm just sad. I've never just not cared in this way. Always been a 4.0 student, very type A. But now I can't even open my notes and make an attempt.",
  "author": "niinetails",
  "created": 1637043229,
  "updated": 1637182668,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {}
}