{
  "sid": "qaacd2",
  "link": "/r/GradSchool/comments/qaacd2/feeling_lonely_isolated_and_jealous_in_grad_school/",
  "title:": "Feeling lonely, isolated, and jealous in grad school",
  "text": "I'm a first year PhD student and I just moved states hoping to not repeat the same mistakes in my undergrad. I used to be extremely introverted, but the pandemic ironically helped me get out of my shell a bit and now I feel like I have to talk to people, be social, and plan activities. I've been here for a month and a half and I'm constantly asking my cohorts if they wanna do something fun as a way to destress, but no one ever responds or take the offer. I understand we're busy but I don't know if i can dedicate my entire life to studying with no social outlet. Maybe grad school isn't for me. I'm only 22, about to turn 23 and I still want to experience things occasionally. I'm not a huge party person but feeling like I can have a casual group of friends to hang out with would be nice. I get jealous when I see friends back home or my partner say theyre being invited to parties or have something to do over the weekend while I spend most of my time alone. I'm depressed and can't focus on work because I have no motivation. I used to think my introversion was the reason I had no friends, but now I realize how much better I had it in undergrad and how much I miss them. Now I don't know what to do and I feel lonely and unwanted. I don't know what to do. I even joined a sports team to try to make friends there, and I know it's not immediate but I don't know how well those friendships are going. I'm just tired and I feel like my life is going nowhere, I'm not any happier and I don't care much for my studies right now, but I also don't know what else I'd be doing.",
  "author": "CloudyNebula",
  "created": 1634513288,
  "updated": 1634655420,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.95,
  "comments": {
    "hh1tzzx": {
      "link": "/r/GradSchool/comments/qaacd2/feeling_lonely_isolated_and_jealous_in_grad_school/hh1tzzx/",
      "text": "For what it’s worth, I graduated undergrad when I was 23. I was burnt out from undergrad and decided to work rather than move on to study for a higher degree. I’m just now returning to school to work on a doctorate at age 30. In those 7 years I took a lot of time to work and pay off my undergrad loans, travel, and figure out what direction I wanted to live my life. That doesn’t mean I think you should drop out on social reasons alone, but you’re not that old and you have a lot of time before you have to have your shit together. If you’re not happy with your program and think you need some time to figure it out, that’s totally normal.\n\nOn the subject of your classmates not wanting to do anything, I’d say give them some time. Doctoral programs attract a lot of Type A personalities and, assuming you started in August, most of them are probably still trying to figure out their work-life balance. Once they get into more of a rhythm, some of them should start to loosen up.",
      "author": "AveridgeGuy",
      "created": 1634516418,
      "upvotes": 5,
      "replies": {}
    },
    "hh1vtfk": {
      "link": "/r/GradSchool/comments/qaacd2/feeling_lonely_isolated_and_jealous_in_grad_school/hh1vtfk/",
      "text": "hey I'm  a MS(4+1 program but different campuses) student but I'm in the same boat as you due to the pandemic. I was very introverted but during the pandemic, I realized I'm lonely as fucked and decided to get out of my shell but everything been a failure so far(I have a very low social battery, always super exhausted hanging out with people). I've been having the same feeling as you where grad school isn't for me and looking at my friends back home clubbing and having fun every weekend while I am alone sucks ALOT. I am also not motivated anymore about my schoolwork and been trying to find the motivation I had when I started Uni. Unfortunately, I don't know the solution to our problem.\n\nHowever, thank you for this post. This gave me a bit of motivation to join a club next week.  There are a few things I do that makes me feel better hopefully it can help you out but the depression is usually overwhelming:\n\n1. Make plans for when you graduate. For Me, I want to go to Japan and Norway for a few weeks. Then work for a few years and get a house.\n2. Working out and meditating has been helping out a ton.\n3. Think about how only a small percentage of the population has a degree higher than a BS and how awesome you are.\n4. if you are in low sunlight areas I would get a sunlamp and some vitamin D. Not sure if its placebo but I feel a bit better.",
      "author": "pressurpoint",
      "created": 1634517324,
      "upvotes": 4,
      "replies": {
        "hh49j6o": {
          "link": "/r/GradSchool/comments/qaacd2/feeling_lonely_isolated_and_jealous_in_grad_school/hh49j6o/",
          "text": "About the sun lamp, I like having plants and I think those also work also work as plant lights. You can get a lot of free cuttings from all different kinds of plants on certain facebook groups so you can easily grow your collection. But mainly it helps me feel more connected to the local community when I'm able to participate in groups like that :)",
          "author": "kitt-cat",
          "created": 1634570875,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh3rauy": {
      "link": "/r/GradSchool/comments/qaacd2/feeling_lonely_isolated_and_jealous_in_grad_school/hh3rauy/",
      "text": "I'd say leave 'em be.  This close cohort thing I hear about online seems a myth to me, or maybe it's something you see in med school or similar programs.  Don't expect anything from them because it appears it will just keep letting you down.  They've done you the favor of showing their interest early, so leave it.  \n\nInstead, do as you already have start to; make friends elsewhere.  You're still at a uni, join clubs, go to the gym. And not just a gym that's 9.99 and full of old people (no offense old people), but look into like rock climbing gyms, any sort of martial arts gym, or dedicated weight lifting gym.  Those are the places where people love to talk about what they're doing there.  How big is the city you're in?  What other avenues of entertainment are there that you can make friends at?  For example, I love craft cocktails and have made some friends that way.  Not only that, but it'll help the general motivation. Giving you something to look forward to later, and give you focus to work now.  \n\n\nOn the club note, try some graduate student unions or clubs.  People there will be in a similar situation (e.g. grad school), but not uptight and worried about whos research is better because you're not competing.",
      "author": "idk_witty_username",
      "created": 1634562436,
      "upvotes": 2,
      "replies": {}
    }
  }
}