{"sid": "bgk0ar", "link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/", "title:": "Thesis defense this afternoon! It's blowing up.", "text": "I defend my master's thesis in a little over an hour. Just two hours ago my committee chair e-mailed me and said \"two committee members (note: I have 3 members total) are concerned about the quality of the content of the thesis. Please meet an hour before your defense to discuss.\" They've had the thesis for a while now, and I've tried to contact her for days now with no response. I've been through ups and downs with this thesis, and I've been working closely with the third committee member to even finish this thing. It's not even as if the two committee members who are \"concerned\" were out of the loop at any time! They could have expressed concern any freaking time last week! I forwarded the e-mail to the third committee member and she is so mad about the situation. It's nice to have at least have one person in my corner.\n\nSafe to say that I was far more confident before that e-mail today, and now I am completely shaken up. I can't imagine that anybody would have agreed to this if my paper was shit, but now I am feeling like it absolutely is a flaming pile of crap. More than anything in the world, I want to be done.\n\nWish me luck, y'all. I'm gonna need it!!\n\nEDIT: It was stupid bullshit drama between the three members, and I got dragged into it. Overall,  I got good feedback, and...I SUCCESSFULLY DEFENDED MY THESIS!!! WHOOOO!!!", "author": "yourdailyawkward", "created": 1556044874, "retrieved": 1632953901, "over_18": false, "upvotes": 371, "upvote_ratio": 0.99, "comments": {"elnyqz0": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elnyqz0/", "text": "In my PhD program we have a mini-thesis defense in place of quals and two of my committee members gave basically contradictory revision requests. \n\nFortunately one of them backed off quickly but for a while I was freaking out about it. Committees can suck", "author": "iammaxhailme", "created": 1556121188, "upvotes": 1}, "elnjvto": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elnjvto/", "text": "This is sadly more common than you might think. If other people in the department want to fire away at another faculty member and you happen to be their advisee... they use the thesis and dissertation process to pick battles. It is ridiculous and unfair to the student! \n\nI learned this lesson when looking at schools to do graduate work that it is important to ask about the dynamic between professors and try to sniff out this type of thing.", "author": "UnicornsandPie", "created": 1556111927, "upvotes": 2}, "elmyhf3": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elmyhf3/", "text": "Congratulations!!!", "author": null, "created": 1556086222, "upvotes": 1}, "elmmpe3": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elmmpe3/", "text": "This is my nightmare. Glad it turned out well and congrats!", "author": "TEE_EN_GEE", "created": 1556075455, "upvotes": 3}, "elmktdr": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elmktdr/", "text": ">\"two committee members (note: I have 3 members total) are concerned about the quality of the content of the thesis. Please meet an hour before your defense to discuss.\"\n\nDude (or dudette) I just want to say I massively sympathize.  When I got my MA thesis comments back (at our university we get them a week before the actual defense) one of the reviewers said \"there isn't actually a thesis here,\" i.e. it was shit, while the other gave it glowing reviews.\n\nI prepared for war, brought it, fought it, passed with minor revisions.\n\n>EDIT: It was stupid bullshit drama between the three members, and I got dragged into it.\n\nSometimes, it's just unnecessary stress and hoop jumping, but glad you made it through all the same.", "author": "bitparity", "created": 1556073973, "upvotes": 17}, "elmk0i0": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elmk0i0/", "text": "Now I’m dying to know - what was the drama between committee members about??", "author": "moocowohwow", "created": 1556073363, "upvotes": 24}, "elmfd34": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elmfd34/", "text": "> Just two hours ago my committee chair e-mailed me and said \"two committee members (note: I have 3 members total) are concerned about the quality of the content of the thesis.  Please meet an hour before your defense to discuss.\" \n\nGah. That is the sort of bullshit that should get them a stern talking to from their Department chair.\n\n(It's probably also the reason that my old department required a formal sign-off from committee members explicitly stating that they had read the thesis and provided their feedback to the student--before you could even schedule your defense.)", "author": "cryptotope", "created": 1556069960, "upvotes": 88}, "elm8jwr": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/elm8jwr/", "text": "Congrats on the successful defense!", "author": "DarwinZDF42", "created": 1556065126, "upvotes": 5}, "ellqpro": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/ellqpro/", "text": "Good luck!! \n\nKeep us updated (:", "author": "ApprehensiveWombat", "created": 1556052611, "upvotes": 3}, "ellfvtd": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/ellfvtd/", "text": "Keep breathing through this. Before making any major decisions, talk it out with a trusted mentor. You are strong. Keep us updated with what happens!", "author": null, "created": 1556046010, "upvotes": 4}, "ellf8ik": {"link": "/r/GradSchool/comments/bgk0ar/thesis_defense_this_afternoon_its_blowing_up/ellf8ik/", "text": "You got this!", "author": "Br0ken_Symmetries", "created": 1556045625, "upvotes": 4}}}