{"sid": "px0068", "link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/", "title:": "Is it weird to wear your undergrad merch in grad school?", "text": "This is probably a dumb question lol. I got some cute and comfortable undergrad sweatshirts (a couple even say alumni) that I’d like to wear. But even if they say alumni, they’ve still got the huge school name embroidered on it, and I’m obviously at a different school. My undergrad and grad schools are both in the UC system, so not technically rivals and relatively at the same ranking, but my undergrad is usually agreed to be a bit a more prestigious for undergrads, and I don’t want to get dirty looks from my current school’s undergrads (especially when I look like an 18yo freshman and not an older student lol). But do they actually care? I dunno, and I’m almost too afraid to ask here lol. What do y’all think? Serious answers please.", "author": "Mycrawft", "created": 1632809153, "retrieved": 1632843805, "over_18": false, "upvotes": 4, "upvote_ratio": 0.7, "comments": {"hellmlo": {"link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/hellmlo/", "text": "My experience is that anyone who notices it’s because they’re excited because they went to the same school or have friends who did or spent time there. It can be a great conversation starter. I wear whatever’s lying around so frequently it’s a sweatshirt from my partner’s alma mater (and I even wear an old one from his public high school sometimes).", "author": "SockaSockaSock", "created": 1632839712, "upvotes": 1}, "hell1i6": {"link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/hell1i6/", "text": "Wear whatever the fuck you want. You’re gonna be here for a minute, so get comfy.", "author": "BoostMobileAlt", "created": 1632839461, "upvotes": 1}, "heldet5": {"link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/heldet5/", "text": "On the contrary, people actually like it. I'm from the upper Midwest and I live in the Northeast now. I wear sweatshirts from the university where I grew up and where I went to undergrad and I always have other students and professors mention it because they're like, \"oh you're from Minnesota, I have a collaborator at the U and visited him last month!\" And I usually wear something on the first day I teach and I *always* have an undergrad who's like, \"omg I'm from Wisconsin hi neighbor :')\"\n\nThey're not rival universities with mine though lol I don't think we have a rival. But I don't think they'll care, at my undergrad, if someone wore merch from our rival, most people didn't *actually* care and just joked about it.", "author": "KiwiTheKitty", "created": 1632836035, "upvotes": 8}, "hel5c61": {"link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/hel5c61/", "text": "Nah nobody will care, I do it all the time.", "author": "ThrowawayHistory20", "created": 1632831889, "upvotes": 2}, "hel3tmy": {"link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/hel3tmy/", "text": "No", "author": "Weekly-Ad353", "created": 1632831004, "upvotes": 2}, "hekqnnl": {"link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/hekqnnl/", "text": "I considered buying merch from where I did my undergrad (20+ years ago)\nbefore starting grad school now at a different uni just so I could wear it there (I then decided it was too expensive so I bought Walmart T-shirts with sports teams from where I was living). Then again, I like being contrary and weird :).", "author": "UleeBunny", "created": 1632821273, "upvotes": 3}, "hekdtsd": {"link": "/r/GradSchool/comments/px0068/is_it_weird_to_wear_your_undergrad_merch_in_grad/hekdtsd/", "text": "It's not weird. Some people may ask you about it, but you shouldn't have to stop wearing those clothes because you're at a new school. \n\nI feel less attached (socially, ideologically, geographically) to my grad school institution and I'm less likely to rep gear from it.", "author": "phylosymbiotic", "created": 1632809940, "upvotes": 23}}}