{"sid": "o5042r", "link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/", "title:": "Update: Supervisor won't use correct pronouns?", "text": "Two weeks ago I posted about my supervisor changing my pronouns in a letter I wrote: [https://www.reddit.com/r/GradSchool/comments/nsolaf/supervisor\\_wont\\_use\\_correct\\_pronouns/](https://www.reddit.com/r/GradSchool/comments/nsolaf/supervisor_wont_use_correct_pronouns/)\n\nI appreciate the advice and support I got on that post, especially the folks who went to bat for me against bad faith commentary. Thank you! I wanted to write an update for how things have gone since.\n\nI spoke with my university's graduate support advisor and he was fantastic. He walked me through the various options available to me as a response. While my gut feeling about the correct course of action remained the same, it was great to get a better sense of what options and resources are available to me and other members of the trans community. This led to a different tack, which I'll get to in a moment.\n\nSo, I decided that I was going to email my supervisor and lay things out firmly and clearly, asking him to use the correct pronouns in the future. He and I have had a decent camaraderie since even before I came here, but I knew there was so much on the line if I pushed back and he doubled down. I felt a block about actually writing the email.\n\nThen, I attended an online conference and got a boost of confidence about my thesis (a professor I admire used similar sources to construct a parallel argument to one of my chapters). I sat down and wrote about that to my supervisor and then threw in a few lines about using my pronouns.\n\nA day later he wrote back, apologising for misgendering me and assuring me he won't do it again, and then went into thesis talk around this conference. I'm so relieved! I am so glad I wrote about it, and that my supervisor is understanding and supportive. While I don't think I'll be in a traditional TT academic career, it is great to know that path isn't closed to me by a hostile PhD supervisor.\n\nOtherwise, however, things have taken an interesting turn. When the support advisor gave me the rundown of my university's 'Gender Identity and Gender Support Policy' (which itself comes from a legal act!), I asked how their own Academic Registry (AR) still only supports M or F in its database. He didn't believe me until I showed him the screenshots of my requests to AR to fix my student record. The university's own gender support policy explicitly includes non-binary people! I had previously spoken about the limitations of AR's gender scheme to various groups on campus and everyone goes 'that's unfair!', but now we can say, 'that's illegal!'\n\nI'm not sure what the next step(s) will be. The support advisor says he's meeting with AR to fix this, but I've been trying for years now and don't have confidence in the process. I don't want to kick up a fuss for its own sake, but I'm much older than most students and I'd rather deal with the harassment and nay-saying myself in order to clear the way for teenagers to have a supportive environment at their university. Hopefully things will change.", "author": "Cuglas", "created": 1624295470, "retrieved": 1632953359, "over_18": false, "upvotes": 533, "upvote_ratio": 0.89, "comments": {"h2nhpn7": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2nhpn7/", "text": "I'm so happy for you!! As a nonbinary undergrad student who's considering grad school, seeing things like this turn out well really warms my heart.", "author": "Poppamunz", "created": 1624370415, "upvotes": 2}, "h2n8yy1": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2n8yy1/", "text": "Good job! So glad to hear it worked out", "author": "jae3013", "created": 1624365690, "upvotes": 2}, "h2mqnl6": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2mqnl6/", "text": "When I started grad school, my first meeting with my PI included a rundown of the project I would be starting and of the senior grad student I’d be working with. The grad student had recently come out as trans (MtF). The PI referred to the grad student first as “she”, then as “he” for the rest of the meeting. I knew her correct pronoun but felt awkward and kind of played dumb and paused when asking a question. I could see him realize he had been mistakenly using the wrong pronoun before he confidently “corrected” me. \n\nSometimes people make mistakes which can easily be interpreted as malicious. Sometimes those “mistakes” are malicious. I tend to give some latitude but completely understand those who aren’t afforded that luxury.", "author": "starbuilt", "created": 1624350599, "upvotes": 3}, "h2m1cu4": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2m1cu4/", "text": "Lmao", "author": null, "created": 1624331012, "upvotes": -1}, "h2l4hme": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2l4hme/", "text": "Great work! I'm so glad that worked out well and that you updated us.", "author": "Pr0gr3s", "created": 1624313211, "upvotes": 4}, "h2ky5yq": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2ky5yq/", "text": "Great job!!! Proud of your strength, determination and perseverance!", "author": "Dezamess", "created": 1624310196, "upvotes": 1}, "h2knfdm": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2knfdm/", "text": "Good job OP! I think the advocacy you're doing will make a difference down the line and make an avenue for your university to be more inclusive. It seems everyone is being respectful too and not being dismissive", "author": "Astsai", "created": 1624305270, "upvotes": 4}, "h2ki7nn": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2ki7nn/", "text": "Yay, what a great outcome - you got a result for yourself and you're paying it forward, good on ya!", "author": "coyotesandcrickets", "created": 1624302889, "upvotes": 4}, "h2kfqfg": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2kfqfg/", "text": "We are proud of your courage to stand up for yourself, and happy it worked out positively for you.", "author": "discount-doubledoink", "created": 1624301755, "upvotes": 1}, "h2kfbrf": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2kfbrf/", "text": "You did an excellent job navigating a very tricky and stressful situation. Thank you for the update! I hope you’re proud of how you handled this.", "author": "StringOfLights", "created": 1624301573, "upvotes": 4}, "h2kd75p": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2kd75p/", "text": "Attaway. I didn't respond in your original post because I didn't want to make it about my less-significant issue, but when I approached one of my profs about a comment she made, I was similarly terrified & relieved when she said she didn't realize that what she'd written could be harmful to someone with weight issues. I am glad to know that profs are able to adapt their modes of thinking.", "author": "cattleprodlynn", "created": 1624300615, "upvotes": 10}, "h2ka5k6": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2ka5k6/", "text": "Nice work! I'm glad it ultimately went pretty smoothly. You used a \"request sandwich\" technique that admins find quite effective when reminding faculty and students about policies. Mundane Topics A and C surrounding understated touchy policy topic B. I'm a big fan of asking the person responsible for the policy to send me an email that's a \"reminder\" they've asked me to forward. So topic B could read \"A reminder the registrar sent today, quoted below, about the school's legal requirements about pronouns...\"", "author": "dcgrey", "created": 1624299243, "upvotes": 15}, "h2k9uj9": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2k9uj9/", "text": "Glad everything worked out good job standing up for yourself! I wonder if the changes of pronoun in the document were more mechanical like muscle memory based. I’m not sure if you guys get a lot of international students but for the languages that don’t have gendered pronouns I know I’ve helped lab mates who’ve made a consistent mistake in identifying themselves (pronouning themselves?). I’m not okaying the behavior but just offering a potential explication if all other interactions seem so positive. But maybe I’m way off base. Either way glad everything has worked out :)", "author": "Hugsplease", "created": 1624299104, "upvotes": 9}, "h2k9ja0": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2k9ja0/", "text": "I hope you feel really good about yourself.  What a brave hero.", "author": "cmrocks", "created": 1624298964, "upvotes": 3}, "h2k6941": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2k6941/", "text": "Way to be an advocate for yourself and the community at large! This internet stranger (teacher and parent) is proud of you for sticking up for yourself and doing so in such an inspirational and methodical way!", "author": "Happy-birdie-918", "created": 1624297512, "upvotes": 179}, "h2k5gya": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2k5gya/", "text": "I appreciate hearing about these types of grad school experiences because I’m applying as a trans individual and I’m kind of preparing myself for these kinds of scenarios.", "author": "Parking_Pineapple440", "created": 1624297166, "upvotes": 96}, "h2k3d0j": {"link": "/r/GradSchool/comments/o5042r/update_supervisor_wont_use_correct_pronouns/h2k3d0j/", "text": "Is he using the biologically correct pronoun though", "author": "UncleSamsDevil1", "created": 1624296232, "upvotes": -76}}}