{
  "sid": "r2uwr8",
  "link": "/r/GradSchool/comments/r2uwr8/self_doubtnegative_self_talk/",
  "title:": "Self doubt/Negative self talk",
  "text": "Hi Reddit \n\nI need some advice and/or to vent or something. This semester, I’ve really been struggling with major feelings of self doubt and negative self talk. It doesn’t feel like “imposter syndrome” so much as just really bad doubt. I say it doesn’t feel like imposter syndrome because in these feelings of self doubt, I can see, objectively, how much I’ve learned in my short 1.5 years of my PhD. I also don’t doubt that when I applied, I was qualified, and that I was admitted to the program because I was qualified. I guess I just doubt my ability to succeed now that I’m here. \n\nThe sources of these feelings are one class that I’m taking that is particularly intimidating and my research that just feels like one road block after another. I’m at a point where I dread waking up, I dread going to class, I dread doing my work, and generally I dread being here. I also dread my future, because I have found since starting grad school that I don’t want to do academia, but my options for industry are basically limited to what this class that I hate so much is about. Now I don’t really know what I’m doing this PhD for if I don’t like what I can do with, or without it. It’s hard to feel motivated to do a PhD when you no longer see an end goal. \n\nBasically, I look at everyone else, either friends or just random strangers that I see going about their day, and I think “I wonder if they are confident in their intelligence” or “I wonder if they like their life” and also “I wonder what it is like to be so smart you know you’re smart” or “I wonder what it is like to like your life and to see what you’re waking up for.” \n\nI am seeing a therapist and we’re slowly working through a lot of stuff together, excluding and including this. I recently told her about all of this so I know we’re going to be working on this when I see her next (which unfortunately can’t be until January). She suggested the Coursera “the science of well-being course” which I’ve enrolled in to audit. But in the meantime, those of you who’ve been here before, do you have advice?",
  "author": "momhasbipolar",
  "created": 1637955099,
  "updated": 1638207999,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hm78vdc": {
      "link": "/r/GradSchool/comments/r2uwr8/self_doubtnegative_self_talk/hm78vdc/",
      "text": "I don’t have many words of advice, but just came here to say I feel your pain. A lot of what you are experiencing resonates with me. I’m also 1.5 years in and am trying to crawl out of this hole too. \n\nWhat you just described is a VERY common experience. I also think it comes in waves. Remember that if most people feel this way at some point in their program, we ALL have doubted our abilities at some point. And yet somehow, we still make it through! Think of all the people you know with a PhD…there’s some great ones, some mediocre ones, and some awful ones. You will decide which one you will be! And, if the awful ones could do it, you can too!!!\n\nI hope your therapist helps, and I also hope you find your “purpose” again.",
      "author": "Sperberino_",
      "created": 1637963141,
      "upvotes": 2,
      "replies": {}
    },
    "hm7y88q": {
      "link": "/r/GradSchool/comments/r2uwr8/self_doubtnegative_self_talk/hm7y88q/",
      "text": "Therapy and antidepressants have been life savers. I also have told my advisor some of how I was feeling. If you feel comfortable doing that, I found it helpful too.\n\nBest of luck. I hope you find some joy/interest in things again.",
      "author": "skierface",
      "created": 1637975523,
      "upvotes": 1,
      "replies": {}
    }
  }
}