{
  "sid": "qcb07j",
  "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/",
  "title:": "Can I get into grad school?",
  "text": "I am a junior in college, planning to get my undergraduate degree in biology. I currently have a gpa of 2.8, which I believe does not testify my intelligence. A few classes, along with COVID really killed my gpa. Those classes being physics and organic chemistry. For reference, I ended high school with a 3.9 gpa. I want to become a microbiologist, and hope to get a PhD in microbiology. I am planing to get a mentor to work in their lab over the upcoming summer. I am worried that I’ve reached the point of doom and cannot achieve this dream because of my gpa. I hope to study hard for the GRE, and get the best I can. Can I get into grad school if I do this? Or am I done for?",
  "author": "dylanhanson718",
  "created": 1634764060,
  "updated": 1634849812,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hhewacq": {
      "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/hhewacq/",
      "text": "Try looking into a postbacc, they’re ideal in situations like yours.\n\nYou can still get into grad school, it will just take a little bit more time and effort than you may expect. Don’t give up.",
      "author": "goatboat_",
      "created": 1634765191,
      "upvotes": 4,
      "replies": {}
    },
    "hhf017s": {
      "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/hhf017s/",
      "text": "i finished undergrad with a 2.8 GPA, i did a masters and finished it with a 3.3, and i'm now in a phd program. you should try to get your GPA above a 3.0, but you're not doomed if you finished undergrad with it below, you can do post-bac classes or a masters and gain some research experience before applying for a phd.",
      "author": "No_Narwhal7483",
      "created": 1634766781,
      "upvotes": 2,
      "replies": {
        "hhfdeni": {
          "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/hhfdeni/",
          "text": "Was the 3.3 your master's gpa or averaged across with your undergrad?",
          "author": "Diver808",
          "created": 1634772804,
          "upvotes": 1,
          "replies": {
            "hhil03b": {
              "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/hhil03b/",
              "text": "it was just from my masters.",
              "author": "No_Narwhal7483",
              "created": 1634837907,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhew7vq": {
      "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/hhew7vq/",
      "text": "Won't know until you apply. Also you have a year to bring up the gpa. Have you spoken to a adviser you want to work for? Volunteer to work in their lab before grad school starts (that summer). Get in good with an adviser as most of grad school is politics especially in the physical sciences. I think I had a 3.8 or something when I went in and it was physics and biochem that jacked that up. Biochem? bleah, and physics...self explanatory....",
      "author": "rthomas10",
      "created": 1634765162,
      "upvotes": 1,
      "replies": {}
    },
    "hhf12x4": {
      "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/hhf12x4/",
      "text": "You're gonna want to get that GPA above 3.0 because that's a hard cutoff for most schools.  Also, you may have better luck getting into some kind of master's program before going to your PhD, cause PhD programs are very competitive.",
      "author": "zeph_yr",
      "created": 1634767235,
      "upvotes": 1,
      "replies": {
        "hhf9xjd": {
          "link": "/r/GradSchool/comments/qcb07j/can_i_get_into_grad_school/hhf9xjd/",
          "text": "I am definitely gonna try to go into a masters program first",
          "author": "dylanhanson718",
          "created": 1634771179,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}