{"sid": "pkofp7", "link": "/r/GradSchool/comments/pkofp7/how_important_is_research_interest_vs_school/", "title:": "How important is research interest vs school ranking for PhD programs?", "text": "I found a PhD at an R1 institution which had research that I connected very well with. I had a chat with the potential advisor and he was thrilled and said for me to apply. He seemed very passionate and excited to have someone reach out. Accepted students receive full funding for 5 years btw.\n\nHowever.....despite this university being R1, it's not very highly ranked, and my application + work experience could place me into a top school. I've heard too many horror stories on here of like \"If you didn't do PhD at a top 50 school they won't even look at you when you graduate...welcome to post doc hell\". This school is probably like 200-250 in terms of national ranking, but the PhD is in a highly quantitative/in demand field (it's not like a humanities or social science PhD).\n\n\nShould I keep searching for other programs with higher rank or just stick with this?\n\nThe research I'm looking for is very interdisciplinary and hard to find. Some people do similar research but in an entirely different department. And in general, I just haven't really clicked with the research as well as I did with this place.", "author": "DarthHelmet123", "created": 1631153245, "retrieved": 1632952741, "over_18": false, "upvotes": 12, "upvote_ratio": 0.83, "comments": {"hc7kmek": {"link": "/r/GradSchool/comments/pkofp7/how_important_is_research_interest_vs_school/hc7kmek/", "text": "Is that the ranking for the school, or the ranking for the program? I ask because there aren’t even 200 ranked programs in my field. If a program ranks at the very very bottom of all programs, I’d be concerned about quality. Something is making people rank it lowly. Rankings aren’t everything, but they’re a thermometer of the opinions of people in your field.", "author": "passerem", "created": 1631211347, "upvotes": 1}, "hc6cxxz": {"link": "/r/GradSchool/comments/pkofp7/how_important_is_research_interest_vs_school/hc6cxxz/", "text": "Rank matters in getting your foot in the door.  “Rank doesn’t matter” isn’t applied to a top 10 vs a 200-250 school.  It’s a like a 5-10 vs a 10-20 school.\n\nYou matter in getting hired.\n\nYour school/rank, your thesis, your PI, your PI’s connections, etc., matter in getting your foot in the door.\n\nCan’t yet get hired if your foot isn’t in the door for a call back.  Consider all the variables before choosing but if the options are 1-10 vs 200-250, that’s probably too much of a handicap, for me personally, unless your advisor is a rockstar in the field and has a million connections.", "author": "Weekly-Ad353", "created": 1631192318, "upvotes": 4}, "hc64m4g": {"link": "/r/GradSchool/comments/pkofp7/how_important_is_research_interest_vs_school/hc64m4g/", "text": "You are shopping for an advisor with a supportive research group, doing research that resonates with you.  School “quality” is secondary at the grad level.", "author": "drzowie", "created": 1631187379, "upvotes": 7}, "hc58zpw": {"link": "/r/GradSchool/comments/pkofp7/how_important_is_research_interest_vs_school/hc58zpw/", "text": "Research interest and advisor fit do matter, but so does the environment/school you are in for the next ~5 years to an extent.", "author": "dsli", "created": 1631160958, "upvotes": 22}, "hc57ma0": {"link": "/r/GradSchool/comments/pkofp7/how_important_is_research_interest_vs_school/hc57ma0/", "text": "Apply broadly, see what sticks. Just because you have a top notch application doesn’t mean you’ll get into a top school, as unfair as that may be. Instead, just do your best and come back to Reddit/go to your trusted advisors and ask them which program to choose among those you’ve been admitted to.", "author": "p53lifraumeni", "created": 1631160037, "upvotes": 13}}}