{
  "sid": "pg4ciu",
  "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/",
  "title:": "Is it possible for grad school to not be a shitshow?",
  "text": "I’ve been preparing for six or so months now to apply to grad school and I realized I haven’t heard a super positive testimony about the grad school experience. \n\nI know this depends on a lot of things: everyone reacts differently to major life changes; expectations might not be met; it’s rigorous; sometimes advisors, classmates, or the institution turn out to be not what you thought or wanted. \n\nBut is it possible to be enjoyable and a good experience? Do people find it fulfilling a good amount of the time? \n\nI have been in the workforce for a time now and some of the grad school testimonies reek like my time in a toxic workplace. Now my work is amazing and I’ll be sad to leave it when I go back to school but going back is something I want to do for myself. \n\nBut I don’t want to voluntarily go into debt to be in a toxic workplace!",
  "author": "godlovesaterrier__",
  "created": 1630534316,
  "over_18": false,
  "upvotes": 69,
  "upvote_ratio": 0.99,
  "comments": {
    "hbhbiuz": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbhbiuz/",
      "text": "It’s possible if you have a good advisor.\n\nMy opinion is that grad school is so hit or miss because professors have so much individual power over their students - far more than any boss in any professional setting. Your entire future is in their hands while you’re making next to nothing for money and they can make the most arbitrary demands ever with no oversight at all. Grad school is incredibly hit or miss because of it, and it can easily turn into one of the worst periods in your life if you get a particularly abhorrent advisor.\n\nI’ve been a month away from graduating for the past year. Part of it is because my current advisor is picking at the most trivial things, but a bigger part of it is that my original advisor was a fucking idiot who mismanaged a gigantic code that a couple of his students developed that I got sucked into using for my thesis. He doesn’t even understand the language it’s designed in, *nor is he even remotely an expert in the specific field that the code falls under*, even though one of his students spent close to 8 years developing it. It’s bug-riddled and has basically no documentation and hundreds of thousands (maybe millions) lines long. I got sucked into one of his hare-brained ideas in something to do with the code thinking he knew more than me, managed to slap together preliminary exam materials and passed, but now it’s falling apart due to things I didn’t foresee that someone more experienced would have. I had to switch to someone who is an expert because the idiot kept making ridiculously unreasonable demands of me, and he was incapable of understanding how unreasonable they were.\n\nI’m just trying to hold on now and put a thesis together and graduate, but this would have been so much smoother if I had a decent advisor from the start who knew about the subject he claimed to be researching. So yeah… figure that part out early enough and your experience should go a lot smoother.",
      "author": "happily_masculine",
      "created": 1630695788,
      "upvotes": 1,
      "replies": {}
    },
    "hbcad6l": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbcad6l/",
      "text": "From my personal experience, it really depends on your luck. A lot of stars have to align for you to have a good gradschool experience. Your supervisors need to be supportive, your management needs to actually care about students, your faculty members need to not be toxic. Unfortunately, this does not happen most of the time which means there is a big possibility that things will more often than not turn sour.\n\nI think for myself, I expected the chaos of gradschool when I started out my PhD so I always had 1,2,3,4 backup plans. I always did things veryyyy early and I don't rely on others to get things done. It's a highly independent journey. \n\nMy thoughts, expect toxic behavior from people in your faculty but think about how you will deal with it. I personally stay away from toxic people and I build good relationships with those that are genuine (there are only one or two anyways). Other than that, keep on reading and writing!",
      "author": "givemeyourdonut",
      "created": 1630604002,
      "upvotes": 2,
      "replies": {}
    },
    "hbbwgcc": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbbwgcc/",
      "text": "It really doesn't have to be a shit show. I finished a masters, and yes, there were parts that I would call the toughest work I've ever done. I did go into therapy after my first year. I did have emotional break downs. I did struggle to finish my thesis. BUT those \"common\" grad school experiences were the result of pre-existing behavioral and personal factors that I finally had to address in order to achieve the milestones I wanted rather then being direct products of the grad school environment. Those factors would have been present whether I was in grad school or not, and frankly, I'm so happy I was. I'm a much more competent professional, analytic thinker, and kinder person for having done so.",
      "author": "EtTuSouffle",
      "created": 1630598514,
      "upvotes": 1,
      "replies": {}
    },
    "hbbrwhy": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbbrwhy/",
      "text": "And honestly, self-depreciating joke/meme is sort of grad school culture.",
      "author": "Aiorr",
      "created": 1630596642,
      "upvotes": 1,
      "replies": {}
    },
    "hbbqhz2": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbbqhz2/",
      "text": "Grad school is emotionally, psychologically, financially, and physically challenging while the dominant narrative pushes for more intellectual rigor. \n\nI LOVED my MA. And HATE my PhD. I think that all comes down to my fit within a certain department. My had program is pretty damn conservative and often hypocritical—which are two ideological orientations that really do not mesh well with my own personality. I’ve grown a lot as a scholar, and that’s expected, but my experience has not been good because of that growth.\n\nI agree with people that it comes down to selecting the right program, but people don’t often discuss the amount of sheer fucking luck that goes into being admitted, and a complete inability to really know the culture of a department until you’re in it. \n\nI have made some of the greatest friends in my PhD program. I’ve had a lot of successes and failures. For me, the five years of PhD work and the stagnation it has on other aspects of life has been really difficult to reconcile. Is it possible for it to not suck? Sure, it’s possible. I wouldn’t say it’s probable though.",
      "author": "ResponsibilityOk617",
      "created": 1630596062,
      "upvotes": 1,
      "replies": {}
    },
    "hbblzl6": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbblzl6/",
      "text": "It is, but you have to be lucky. What people dont tell you about graduate study is that trouble seldom comes from research. It often comes form unanticipated sources: reviewers, equipment, PIs, collaborators, colleagues, funding agencies,administrators....\n\nThe publish or perish culture has turned academia into a toxic cesspool. In my experience, there are still a small minority who genuinely care about their students and research. They tend to be younger and less established.",
      "author": "SquirrelOnTheDam",
      "created": 1630594190,
      "upvotes": 2,
      "replies": {}
    },
    "hbbbr7g": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbbbr7g/",
      "text": "Absolutely. I love what I study and I love the people I work with! It gets hard and sometimes it can be frustrating having a different lifestyle than your friends who go into industry but is worth it!",
      "author": "Lpdrizzle",
      "created": 1630589787,
      "upvotes": 1,
      "replies": {}
    },
    "hbayvlo": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbayvlo/",
      "text": "Grad school is not easy, and i think that’s why people complain about it so much… including myself…. Can’t wait to be done!",
      "author": "purplepancaks",
      "created": 1630583187,
      "upvotes": 1,
      "replies": {}
    },
    "hbauocp": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbauocp/",
      "text": "I had a great time as a postgrad. It's important to be sure you're going to a programme that is going to be a good fit for you, one where you're doing work you're interested in for a supervisor who will respect you and treat you well. This was the case for me, and I found it really fulfilling and not nearly as stressful (barring the weeks around a submission deadline) as people on this sub will make it sound.",
      "author": "MrMeatScience",
      "created": 1630580497,
      "upvotes": 2,
      "replies": {}
    },
    "hbaqwcp": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbaqwcp/",
      "text": "I had fantastic time and a great experience! I am writing up right now and even with the prospect of higher pay I am still sad that the PhD experience is over. Social media groups about grad school all tend to be biased towards the bad side of the experience, as that is when you need to commiserate with others who have faced similar issues. When things are going great there's less need to vent online to strangers, generally speaking.",
      "author": "UsernamesAreHard2684",
      "created": 1630577633,
      "upvotes": 3,
      "replies": {}
    },
    "hbahqvd": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbahqvd/",
      "text": "I think anyone getting through a PhD without hitting some tough points is very lucky. But those tough points can just be eg experimental problems that take a while to overcome, not a complete mental health breakdown.\n\nPersonally I had supervisor problems early on but they were resolved. Otherwise, it’s been very hard work, but I’ve enjoyed it. I’m in the final few months now and it’s stressful and I work long hours but I still love my project and I work with great people.\n\nI did come into it ready for it to be tough as I had friends finishing theirs off as I was applying, and I think being prepared for that made the reality easier to deal with, honestly. Better going in eyes open!",
      "author": "ayeayefitlike",
      "created": 1630569529,
      "upvotes": 3,
      "replies": {}
    },
    "hba5okv": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hba5okv/",
      "text": "[deleted]",
      "author": null,
      "created": 1630560190,
      "upvotes": 10,
      "replies": {
        "hbaoav0": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbaoav0/",
          "text": "I don’t think it means that 2/3rds are doing okay, it only means 2/3rds haven’t tried to seek help. Recognising there’s a problem and seeking help are massive hurdles so I’d expect a lot of people don’t even try.",
          "author": "officially_anxious",
          "created": 1630575432,
          "upvotes": 8,
          "replies": {}
        },
        "hbbnjq0": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbbnjq0/",
          "text": "I am happy I got my PhD, but the process of getting was a generally bad experience for me. I would answer yes to the first part, but I would not say grad school was ok.",
          "author": "RenegadeBevo",
          "created": 1630594862,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hba0j20": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hba0j20/",
      "text": "I'm in grad school and love it so far. In fact all my professors and classmates are more chill than in my undergrad.",
      "author": "thanks2616",
      "created": 1630556969,
      "upvotes": 2,
      "replies": {}
    },
    "hba0ej0": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hba0ej0/",
      "text": "I think, like anything in life, it's all about the people. They either uplift the situation, or break it. Make sure the place you've applied to, and the lab your aiming to be in is one worth it. Other grad students already in that lab usually have a good grasp on the vibe.",
      "author": "Jigglywolf",
      "created": 1630556895,
      "upvotes": 2,
      "replies": {}
    },
    "hb9wxyt": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9wxyt/",
      "text": "what does your common sense tell you?",
      "author": "wjrasmussen",
      "created": 1630554944,
      "upvotes": 0,
      "replies": {}
    },
    "hb9uuln": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9uuln/",
      "text": "Honestly, a place like Reddit is gonna mostly be venting. Kind of like with Yelp reviews, you really only hear the really shitty experiences.\n\nI barely started my PhD 3 weeks ago, but I did enjoy my masters. Of course, you’ll never escape writing. That part for sure sucks.\n\nThankfully I should be on track to have the title before I’m 30, so for me it’s like, “bust ass the duration of the program then pretty much be set.”\n\nAnyway, just my 2 cents",
      "author": "Glenncinho",
      "created": 1630553802,
      "upvotes": 3,
      "replies": {}
    },
    "hb9o0hm": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9o0hm/",
      "text": "Speaking only for myself I’m just a few weeks into my program. First year, first semester. I’m readjusting my brain to think more “graduate” if that makes any sense. Plus I got a GRA position unexpectedly on top of it all which is great for the pay and tuition coverage, but I know zilch about a lot of the technology related to it (I come from a restaurant/retail background as opposed to STEM) and I hope it doesn’t cause me to lose the position. Plus the fact that everyone in my cohort is logging a lot more in the way of hours. I feel guilty that it seems like my advisor is walking me through a lot of stuff I should just be able to jump into. But you can’t know what you didn’t know. Im sure it will get better but I’m all over the place right now.\n\nEdit- I do want to emphasize that I love it and am excited for it. I never dreamed I’d be here. Imposter syndrome is hard to shake but I’m working on that too.",
      "author": null,
      "created": 1630550251,
      "upvotes": 3,
      "replies": {}
    },
    "hb9hwnr": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9hwnr/",
      "text": "My PhD was am extremely positive experience. I had three very supportive and responsive supervisors who all worked well with each other. I got to travel and work on things I enjoyed. I was paid well and I honestly did not work that hard, I took a lot of days off when I wanted to.\n\nIf it's what you want to do though, it doesn't matter what other peoples experience has been, give it a go because it only matters what your experience is. If it's not good you can leave, you aren't stuck there forever.",
      "author": "antihero790",
      "created": 1630547276,
      "upvotes": 8,
      "replies": {}
    },
    "hb9azng": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9azng/",
      "text": "Reddit, grad cafe, and Facebook are not necessarily great representations of the all grad students. There is significant self-selection bias regarding what type of people go online to talk about their experiences. \n\nBut now that I've made that rational, logical point I'll say this - yes, grad school is always a complete and utter shit-show.",
      "author": "Pr0gr3s",
      "created": 1630544084,
      "upvotes": 44,
      "replies": {}
    },
    "hb9920a": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9920a/",
      "text": "Grad school was one of the best times of my life. Be careful in choosing a good program and advisor. Love your topic because you will be spending a lot of time on it!",
      "author": "fwafwa",
      "created": 1630543202,
      "upvotes": 29,
      "replies": {}
    },
    "hb966ts": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb966ts/",
      "text": "Honestly, it's felt a lot like working full time and I've enjoyed the parts of it that I am able to participate in despite working from home. I definitely think having a supportive and understanding supervisor is key to the experience but as someone who enjoys creative freedom and mastering things that I am interested in, I find it extremely fulfilling.",
      "author": "4-youreyezonly",
      "created": 1630541956,
      "upvotes": 17,
      "replies": {}
    },
    "hb907kp": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb907kp/",
      "text": "If you just go by what's posted on reddit everyone's life is always a gigantic disaster. Everyone's SO is cheating on them. Everyone's neighbors just cut down their 100 year old oak trees. Everyone's boss just folded to their malicious compliance, today you tomorrow me, that's man's name was Albert Einstein, 5/7 with rice. But that's just because normal everyday things aren't posted, aren't upvoted when they are, and aren't interesting to read.\nI mean, would you upvote a post that's like \"for the last few years I've met with my advisor a reasonable number of times, the administration was annoying some times but mostly didn't do anything, I worked hard but everyone was nice, and I'm graduating tomorrow and don't need any last minute encouragement because the process hasn't been traumatizing\"? I probably wouldn't. And it wouldn't even occur to me to try to post something like that either. And the same thing applies to all social media and, to maybe a lesser extent, personal conversations too. That's probably why you've got this impression.",
      "author": "InfanticideAquifer",
      "created": 1630538937,
      "upvotes": 209,
      "replies": {
        "hb9kmea": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9kmea/",
          "text": "Most true thing I’ve ever read on this website",
          "author": "Dustin_Bromain",
          "created": 1630548573,
          "upvotes": 23,
          "replies": {}
        },
        "hb9o3vi": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9o3vi/",
          "text": "Love this",
          "author": null,
          "created": 1630550298,
          "upvotes": 8,
          "replies": {}
        },
        "hbaoabx": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbaoabx/",
          "text": "That's true. It's one of the major reasons I don't frequent this subreddit anymore",
          "author": "meghpink",
          "created": 1630575419,
          "upvotes": 8,
          "replies": {}
        },
        "hbb341v": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbb341v/",
          "text": "You got me good with the oak trees haha",
          "author": "happyminty",
          "created": 1630585566,
          "upvotes": 4,
          "replies": {}
        },
        "hbb9vkd": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbb9vkd/",
          "text": "I mean, because grad school was so traumatic for me, I WOULD be interacting with \"grad school was fine/ok/a positive experience for me\" because it's uh, I'm jealous. I'd have liked to not have been traumatized. I'd have liked to not have been miserable for years. \n\nin general, though, you're right. only the extreme cases of things end up online because people don't usually post the boring stuff. this subreddit is going to give a skewed look because only the extreme cases are going to be here and we don't see the boring stuff.",
          "author": "EpinephrineKick",
          "created": 1630588941,
          "upvotes": 6,
          "replies": {}
        },
        "hbbu73y": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbbu73y/",
          "text": "Thank you.",
          "author": "longshotmiser",
          "created": 1630597613,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hb8vccc": {
      "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb8vccc/",
      "text": "I like mine so far. I make enough that money isn't a big stressor, though I'd of course rather be making more. I'm generally happy with my advisor and program. I'm working on a topic I really love and enjoy the day to day work of my field. The work is pretty individual, which can get a bit isolating especially in a new city and as college and high school friends seem to be \"moving on\" but it's work that I enjoy so overall, a good experience. The pandemic aspect has sucked but that would suck anywhere. I don't think you're any more likely to find a toxic workplace in academia than elsewhere, but we here more because the low pay, long hours, and limited career opportunities make the toxic workplaces less worth it when you do.",
      "author": "mediocre-spice",
      "created": 1630536498,
      "upvotes": 11,
      "replies": {
        "hb92mpz": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb92mpz/",
          "text": "Do you mind if I ask what you do to make money while simultaneously being in grad school? \n\nI’m very far off from such endeavors, so I’m endlessly curious/confused as to how people manage to pay their bills and earn a living during this phase of their academic/professional careers.",
          "author": "jalapenny",
          "created": 1630540180,
          "upvotes": 5,
          "replies": {
            "hb9582u": {
              "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hb9582u/",
              "text": "Sure! It really depends what degree, what country, etc but most PhD students in the US have a full scholarship for tuition and then either a teaching assistant job (TA), research assistant job (RA), or fellowship through school that provides a small stipend for living expenses. Those stipends can vary a lot, but usually in the sciences it's enough to live on though it's a pretty modest life.",
              "author": "mediocre-spice",
              "created": 1630541508,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "hbcrs4c": {
          "link": "/r/GradSchool/comments/pg4ciu/is_it_possible_for_grad_school_to_not_be_a/hbcrs4c/",
          "text": "I think it’s possible to have a good advisor and department, and a lot of people have positive grad school experiences, but there are factors about academia that absolutely do make it a breeding ground for toxic work spaces. For one, if you have a normal job with a bad boss, you can just quit and find a new job with relatively few consequences. Whereas is grad school, quitting without the degree can feel like throwing years of your life in the garbage. This leads to a lot of unhappy people sticking around and breeding resentment. Not to mention professors being selected for their scientific prowess not their leadership skills which makes them a lot less qualified to lead a group than managers in an industry setting. And the fact that tenure makes them almost impossible to fire for poor leadership or even harassment and toxic behaviors… anyway, I don’t want to keep ranting, but there are a lot of differences between a normal job and academia that I don’t think people who haven’t been through it would consider. And I wish I had been warned of these things before I joined.",
          "author": "werpicus",
          "created": 1630610966,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064585
}