{"sid": "phrv8o", "link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/", "title:": "Any tips to improve academic writing?", "text": "I feel frustrated cause I feel like I'm not good at academic writing. I really want to improve and I'm willing to improve. I always ask my professors for advices and tips but I feel like I'm not improving.  I've been in Grad school for less than a year.  Any tips?", "author": "LaraCroft792", "created": 1630763275, "retrieved": 1632953138, "over_18": false, "upvotes": 48, "upvote_ratio": 0.97, "comments": {"hbnxkrz": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hbnxkrz/", "text": "Watch this excellent talk!:\n\nhttps://youtu.be/vtIzMaLkCaM", "author": "oh-delay", "created": 1630828379, "upvotes": 3}, "hbmbxzy": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hbmbxzy/", "text": "Less than a year? How much writing have you had to do so far?", "author": "boiler_ram", "created": 1630793997, "upvotes": 2}, "hblmss7": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hblmss7/", "text": "This is something shared by my PI, and it's really neat neat!\n\nhttps://sites.duke.edu/scientificwriting/?action=lesson1", "author": "_thenotsodarkknight_", "created": 1630782403, "upvotes": 3}, "hblhtam": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hblhtam/", "text": "Coursera has a great course about academic writing from Stanford! It's really worth", "author": "immuno-cookies-340", "created": 1630780142, "upvotes": 9}, "hblh0l3": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hblh0l3/", "text": "Most universities have a writing lab, which could be worthwhile taking a visit to! They can help with the annotation style as well, which gets a lot of new graduate students.\n\nIf you want to send me a paper, I can provide some feedback on what you may improve, but our formats are probably totally different so I don't know how much help I'll be (APA). I'd definitely check out the other resources your university offers.", "author": "ajs423", "created": 1630779777, "upvotes": 11}, "hblaew1": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hblaew1/", "text": "Read the book They Say/I Say. \n\nAlso, just try to write as simply and concretely as possible. The number one thing that makes students' writing bad, in my opinion, is using too many abstract and general words. Even if you're talking about complex theoretical concepts, you can still be clear and specific.", "author": "nelliemcnervous", "created": 1630776818, "upvotes": 5}, "hbl1xb8": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hbl1xb8/", "text": "Strunk & White is very good while being very short and accessible.\n\nFor me though, I honestly think my writing has improved the most by just reading a lot. As you read academic texts make it a practice to consciously look for things you like and what you like about them.", "author": "ThrowawayHistory20", "created": 1630773090, "upvotes": 1}, "hbkrj1k": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hbkrj1k/", "text": "Fellow archaeologist here! Honestly the best way I learned to write the specific style for archaeology papers is to read a ton of archaeology papers. Look at how they are organized, what kind of language (high vocabulary, or more accessible vocabulary, or more theoretical etc), how they structure paragraphs. Country of origin matters too, like I have to read a lot of [Norway](https://www.nature.com/articles/srep28690)\\-based papers and their use of scientific language is different than [British](https://www.researchgate.net/publication/281609773_Archaeology_in_the_age_of_the_Anthropocene_A_critical_assessment_of_its_scope_and_societal_contributions), which is different from the papers that come from [China](https://core.ac.uk/download/pdf/161348933.pdf). You can see how different the writing style and paper organization is just by skimming them. Once you have read a lot, you can start imitating writing style based on what suits you the best. I personally use a lot of accessible language and technical vocabulary only when I feel like I can explain it well to a general audience.", "author": "bonefarmer", "created": 1630768463, "upvotes": 13}, "hbkpsr4": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hbkpsr4/", "text": "I don't know if your first language is English or not, but [Cambridge Write & Improve](https://www.cambridgeenglish.org/learning-english/free-resources/write-and-improve/) could be helpful. It's free, so you could try it and see if you think it will be helpful.\n\nEdit to add: Additionally, you could form a writing group with a couple of your classmates and review a page of each other's paper (from different classes to avoid accidental plagiarism) so that you can share tips with each other", "author": "shivurs", "created": 1630767668, "upvotes": 22}, "hbkmoeb": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hbkmoeb/", "text": "What discipline? What academic genres?", "author": "ResponsibilityOk617", "created": 1630766206, "upvotes": 3}, "hbkj3t5": {"link": "/r/GradSchool/comments/phrv8o/any_tips_to_improve_academic_writing/hbkj3t5/", "text": "I don’t know if this will be helpful or not, but I found Jordan Peterson’s guide to essay writing very helpful. It helped me improve my writing in general whether it was scientific or not. It’s worth checking out.", "author": "kafka-017", "created": 1630764516, "upvotes": -1}}}