{
  "sid": "qor1et",
  "link": "/r/GradSchool/comments/qor1et/burnt_out_on_my_first_semester/",
  "title:": "Burnt out on my first semester",
  "text": "This is going to be a rant post, I need somewhere to dump my thoughts to people who would get it, and hopefully help?\n\nThis is my first semester as a Master's student in biomedical engineering, and I'm already so done.\n\nTo begin with, I literally had a weekend between my bachelor's and master's degrees. I was already so tired, and didn't get time off. I don't do well with holidays or long weekends, even if I keep my schedule busy. Toxic household basically sums it up. \n\nCurrently I'm on a scholarship, and obviously have to maintain a 3.0, which wasn't that hard back in undergrad. Problem now is that this uni is forcing us to take general subjects that is not of my interest like biochem and physiology, when I'm focusing on the electronics/computer parts. And we take exams, which is my worst nightmare. I have a weak memory, no matter what I try and how much I study I almost always don't do well. So obviously I won't be able to have a good GPA from the first semester which sucks. I've gotten A+ on all of the projects and assignments so far, but on tests I've been on the range of C+ to B.\n\nI have 5 weeks left of this semester. I hope it ends well. I start my thesis next semester which I'm looking forward to because I won't be assessed by tests.\n\nEdit: I had to add that I LOVE working on projects, anything that requires experiments or hands on projects. Which is also why I'm bummed out by the structure of these courses. I cannot leave as I would breach the contract. :/",
  "author": "h0nque",
  "created": 1636299706,
  "updated": 1636656591,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hjorgfp": {
      "link": "/r/GradSchool/comments/qor1et/burnt_out_on_my_first_semester/hjorgfp/",
      "text": "Many students take on subjects that they are not interested in. You have another 5 weeks left, plan it well and structure the learning so that you can get the grades that you need to pass and maintain the 3.0. \n\nSometimes, we need to do the things we don't like to do the things we like. Finish this and then move on to better things.",
      "author": "givemeyourdonut",
      "created": 1636301278,
      "upvotes": 5,
      "replies": {}
    },
    "hjprgi2": {
      "link": "/r/GradSchool/comments/qor1et/burnt_out_on_my_first_semester/hjprgi2/",
      "text": "I wish I could help you. Our situations are pretty different from the sounds of it. All I can say is that you're not alone and if you'd like to talk, feel free to message me. It might not change anything, but sometimes just knowing you're not alone helps. :)",
      "author": "lauthom93",
      "created": 1636315410,
      "upvotes": 2,
      "replies": {}
    }
  }
}