{
  "sid": "qrdc4w",
  "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/",
  "title:": "Is my burnout justified?",
  "text": "I started grad school in 2020 straight out of undergrad. My department halted all in-person programming for us my first year, and of course things started going back in-person when we were cleared to join labs and actually start working. I worked through the holidays last year and worked \\~65 hour weeks in the summer before the semester started. I teach 5 days a week (M-F) part-time and now my working hours are probably \\~70-75 hours a week, including most weekends. I've worked through some federal and national holidays, but not all of them. I didn't take any time off during the summer, save for two working days to see my parents for the first time in over a year (they came to me).\n\nI'm tired. I can barely bring myself to grade. Despite the fact that I deeply care for my students, I can feel myself counting down the days until I teach my last section. My research feels like it's hit a slump and I don't feel productive enough. My walk home feels like it stretches forever and I sleep 3 hours a night. I've been taking classes and/or working for 15.5 months straight and I can't take it anymore.\n\nMy advisor told me that the winter break to go back home I planned for myself was too long, so I cut it. There are people who took more than a cumulative month's time off during the summer, while I stayed here and worked. I want to say this is punishment for not being productive enough, but I'm just so tired. I don't know what to do or think. Does it get any better?",
  "author": "lostgrad20",
  "created": 1636606676,
  "updated": 1636656488,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.93,
  "comments": {
    "hk61kwj": {
      "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk61kwj/",
      "text": "Without reading beyond the title, burnout isn't a thing to be justified.  If you're burned out, you're burned out.  Nobody can validate the stress you feel but you.\n\nSo go feel your feelings.",
      "author": "hixchem",
      "created": 1636607149,
      "upvotes": 53,
      "replies": {}
    },
    "hk640r1": {
      "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk640r1/",
      "text": "They're exploiting you mate, I'm doing solid research and rarely work 30 or more hours a week, every now and then there's a crunch but it's usually due to me procrastinating for a while, usually during midterms because of the grading. Highly competitive and skilled environments are still quite toxic, even more as many people don't really regard gradstudents as professionals but many of us are, as such we are unionized in my uni, check if you're not part of an union or a student group that can help.",
      "author": "Pablo_Ameryne",
      "created": 1636608581,
      "upvotes": 11,
      "replies": {
        "hk64kjb": {
          "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk64kjb/",
          "text": "To be fair, I kind of (?) choose to work those hours because I feel like I need to make progress. I joined my lab a few months ago, and apparently I work with something just very nasty to handle in vitro and in normal lab conditions. The things I do require lots of attention and are done over several days. \n\nWe're actually unionized. I just don't know what they can do to help here.",
          "author": "lostgrad20",
          "created": 1636608904,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk6rmle": {
      "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk6rmle/",
      "text": "Sleep deprivation damages your brain. You are harming your health and this cannot continue or you will physically break down as well as mentally. Talk to your advisor and get help from him. Delegate what you can or just flat out stop doing what is non-essential.",
      "author": "Boopsboops42",
      "created": 1636626955,
      "upvotes": 5,
      "replies": {}
    },
    "hk7lspn": {
      "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk7lspn/",
      "text": "First to echo u/hixchem, burnout doesn't need justification. It's a state of being like tired or hungry. It's your mind and body literally saying \"this situation is not returning the amount of energy I put into it\". Believe yourself and look for support from your advisor or admin.\nSecond, no one should have to just accept a situation that clearly harms themselves. Your needs and wellbeing are warranted by the mere fact of your existence, and you deserve to show yourself kindness and protect those needs from others who exploit you. As someone who used to get validation solely through work and others, I can safely say that therapy and self- compassion were my way to go from excessive hours and burnout back to a place where I'm excited about myself, my work, and my future. \nYou are worth more than your work.",
      "author": "EtTuSouffle",
      "created": 1636644123,
      "upvotes": 3,
      "replies": {}
    },
    "hk6uq94": {
      "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk6uq94/",
      "text": "I'm sorry to hear that you're in this situation.\n\nI'd recommend speaking to your supervisor, or someone else on your supervisory panel, ASAP. Your current work load is obviously unsustainable, and would be for anyone. You need to prioritise your own health so ask about a leave of absence, or taking a couple of weeks' holiday in the least. I'd also recommend dropping your teaching work to the bare minimum for the foreseeable and focus on your research when you return to the lab. Your supervisor needs to know about your situation; maybe you could also speak to the graduate welfare office as they may have resources to help in these kinds of situations. \n\nGood luck!",
      "author": "singinhallelujahtoem",
      "created": 1636629417,
      "upvotes": 1,
      "replies": {
        "hk7kynt": {
          "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk7kynt/",
          "text": "What do you do when your advisor just keeps giving you more and your exhaustion is irrelevant to them?",
          "author": "steezytang",
          "created": 1636643757,
          "upvotes": 1,
          "replies": {
            "hk7ydi1": {
              "link": "/r/GradSchool/comments/qrdc4w/is_my_burnout_justified/hk7ydi1/",
              "text": "The welfare of their graduate students should be a supervisor’s priority. \n\nIf you’re not doing so already, you need to say no to extra work, stating quite clearly that you can’t take anything else on right now. No one can make you do extra work. I think people tend to get caught up in the power dynamic in the supervisor-student relationship. Maybe in undergraduate studies, students still revere senior academic staff, but by the time graduate school roles around, you can and need to say no to anything that you can’t or don’t want to do within reason; it is, or should be, a much more level relationship. \n\nAs I mentioned, do you have anyone else either on your supervisory team, or another trusted academic in your department? They could lend an impartial ear or offer advice about how to manage your time. Failing this, and/or you think your supervisor still isn’t listening, escalate this to more senior people: graduate school administrators, the dean or head of the department etc. whatever it takes to ease your load. \n\nBurnout is serious and you need to take urgent steps before it impacts you long term.",
              "author": "singinhallelujahtoem",
              "created": 1636649349,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}