{
  "sid": "qaucku",
  "link": "/r/GradSchool/comments/qaucku/i_got_the_lowest_grade_in_my_class_for_an/",
  "title:": "I got the lowest grade in my class for an assignment",
  "text": "I am teetering between freaking out and not caring. I am taking one of the last required courses in my program and for some reason, I am just not understanding the material as well as I thought I would. On top of that, my mind was elsewhere because I was working on something major related to my research. \n\nI kind of knew I was not going to do well (couldn't even plot something simple in Excel until I asked my prof... and something just felt... off idk), but I didn't think I would get the lowest mark (60%). I'm lucky this was HW worth 6% and not a midterm but I really need to step up my game. I don't usually struggle so much or do this badly without getting better so I'm really hoping it's an anomaly in my work. Any advice or words of encouragement or helpful anecdotes will be so appreciated right now.",
  "author": "Anti-Itch",
  "created": 1634586227,
  "updated": 1634655395,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hh5ezr3": {
      "link": "/r/GradSchool/comments/qaucku/i_got_the_lowest_grade_in_my_class_for_an/hh5ezr3/",
      "text": "lol I scored like a 35% on a big exam in my functional neuroanatomy course.  It was ridiculous, the exam spanned something like 17 chapters the principles of neural science.  Still got an overall good grade in the class.  No one ever asked, or cared what my grade was.  It's all good it happens.  Just keep keeping on!",
      "author": "idk_witty_username",
      "created": 1634587937,
      "upvotes": 3,
      "replies": {}
    },
    "hh5yuup": {
      "link": "/r/GradSchool/comments/qaucku/i_got_the_lowest_grade_in_my_class_for_an/hh5yuup/",
      "text": "Just keep on keeping on. I wouldn't stress. If you are in STEM then it's your research that's important.\n\nWe were even told that any effort expended to get more than a B in grad classes was effort we could have better spent doing research. \n\nAlso, I got like a 40-something on a stats exam my first year. 4 years later I'm still alive.",
      "author": "Pr0gr3s",
      "created": 1634597249,
      "upvotes": 2,
      "replies": {}
    }
  }
}