{"sid": "pllii0", "link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/", "title:": "Anyone been tempted to put the 'diss' into dissertation acknowledgement? Anyone seen this done well?", "text": "I am writing my acknowledgement and am wishing I could say exactly what I want instead of lying to be polite.\n\nI'd love to find a clever way to be cheeky and failing that I don't wouldn't mind hearing your thoughts on this type of thing.", "author": "Ok_Organization5596", "created": 1631282079, "retrieved": 1632952705, "over_18": false, "upvotes": 47, "upvote_ratio": 0.93, "comments": {"hcf11ak": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcf11ak/", "text": "I know when it comes to applying for jobs it is not good to bad mouth your soon to be ex employers to your hopefully future new employers. People don’t want to hire some one with an attitude or who may say the same thing about them in the future. Plus, if they know the person you wrote about (as they are in your same field) and respect them it could be an issue. I would think leaving a neutral comment that could be interpreted as positive by someone else is best. Plus don’t write a scathing comment in a copy just for your viewing in any form that you could possibly end up sending my mistake instead of the one you want published.", "author": "UleeBunny", "created": 1631352732, "upvotes": 0}, "hcemn8u": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcemn8u/", "text": "Just think if you'd be okay reading what you wrote in 20 years.", "author": "entropyStable", "created": 1631340153, "upvotes": 1}, "hcee0m9": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcee0m9/", "text": "In my first and second draft I was polite, saying nice words. Then I couldn't lie to myself anymore. It all ended up to thanks Dr.... For his supervision and guidance. This dude is the biggest asshole I have ever met. If it was for me I would have dropped him a very long time ago.", "author": "CFDjedi", "created": 1631334050, "upvotes": 3}, "hce4p24": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hce4p24/", "text": "I thanked everyone except my supervisor.. I hope he got the hint.", "author": "itouchdirt", "created": 1631328598, "upvotes": 1}, "hcdph0e": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcdph0e/", "text": "My acknowledgements was solely to my funding. Did have a dedication and did that to my advisor who was amazing in my career development. Didn't mention committee members at all and they were even excellent. \n\nIf an advisor or committee was bad, take the high road and just don't mention them. You wont be lying, but your dissertation is permanent with your name on it. *in context to if you say something bad about others", "author": "HappyHrHero", "created": 1631320740, "upvotes": 1}, "hcdm59b": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcdm59b/", "text": "My main director mostly ghosted me and my second reader did all of the work. She got a paragraph in my acknowledgements dedicated just to her and her helpfulness and work, and my director got his last name listed in the middle of a handful of last names of people who had been marginally helpful throughout the process.", "author": "Jurgioslakiv", "created": 1631319068, "upvotes": 1}, "hcczgo5": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcczgo5/", "text": "In addition to the normal acknowledgements I included a page of \"honest acknowledgements\" in a private copy printed for myself", "author": "sybr-munin", "created": 1631308293, "upvotes": 13}, "hccvpgu": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hccvpgu/", "text": "\"And to ADVISOR, bless your heart for everything you did.\"", "author": "cattleprodlynn", "created": 1631306658, "upvotes": 21}, "hccs0fm": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hccs0fm/", "text": "While not something for the acknowledgement section, a couple of my friends and I have jokingly said that during a friends-only post-defense celebration, we should have a special dis-acknowledgement presentation dedicated to the advisors and admin who have only made the PhD journey harder.  😂", "author": "CuriosityDreams", "created": 1631305082, "upvotes": 3}, "hccm567": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hccm567/", "text": "In mine I wrote something to the effect of, “I would also like to acknowledge Dr. XYZ, without whom I would certainly not be in my current situation.”", "author": "wyseguy7", "created": 1631302580, "upvotes": 43}, "hcbcx2g": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcbcx2g/", "text": "Thought about it. I knew it would cause more trouble than it was worth", "author": "Ru-tris-bpy", "created": 1631283813, "upvotes": 13}, "hcbc529": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcbc529/", "text": "I re-did my acknowledgments and left my committee entirely out of them. 😂", "author": "ResponsibilityOk617", "created": 1631283478, "upvotes": 42}, "hcbaaat": {"link": "/r/GradSchool/comments/pllii0/anyone_been_tempted_to_put_the_diss_into/hcbaaat/", "text": "Not exactly sure what you mean. You want to put in the acknowledgements section that you say, didn’t like it? Or that certain people didn’t help you enough but others did maybe?\n\nI think humor in regards to “omg this so challenging and kind of was awful at times” but would avoid any impolite jabs, even if not directly towards a specific person or group, because this document will be around for the rest of your career. You never know how someone else will interpret something like that.", "author": "river_wave", "created": 1631282670, "upvotes": 16}}}