{
  "sid": "r1joug",
  "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/",
  "title:": "Is anyone else having a underwhelming grad school experience?",
  "text": "For example, my classes are online, so I have not been making much friends. I had this whole idea about grad school and honestly am underwhelmed tbh.",
  "author": "Available-Tough-2331",
  "created": 1637801091,
  "updated": 1638208017,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.88,
  "comments": {
    "hlz55eg": {
      "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/hlz55eg/",
      "text": "Yeah. It’s all in person but the teachers don’t seem to enjoy/aren’t good at teaching. It seems like most in my program are here for the clout that comes with the school name instead of holding out any hope on significantly deepening their knowledge/skill set. Heavily considering taking a year off if not dropping out completely.",
      "author": "Chiss_Navigator",
      "created": 1637802486,
      "upvotes": 7,
      "replies": {
        "hm0joi8": {
          "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/hm0joi8/",
          "text": "I really feel this. My PhD program has no graduate only based classes that arent just modified undergraduate courses (the modification being writing 1 extra paper or some crap while the undergrads only write one paper). It is like... what is the point if I am not gaining new skills? What really will I have to show for having this degree when I'm not learning anything new and no one cares about your qualifier exam, work performance, or thesis project and just wave you through because they can't be assed to even read your papers and give feedback.",
          "author": "Morganism00",
          "created": 1637830158,
          "upvotes": 3,
          "replies": {
            "hm1eh5h": {
              "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/hm1eh5h/",
              "text": "This is an aspect that also surprised me about my school application process! I only applied to two places. One is a big name university in general and the other is more niche and a big name in its specific industry. I ended up turning down the \"big name in general\" university in large part because I found out that, like your school, they didn't have separate grad classes. The entire grad curriculum was was basically sophomore-senior year of undergrad. Then when I spoke to current students, the majority were open about not being sure the program was worth it or were actively regretting their decision to go in the first place. Meanwhile in the school I ended up choosing, I learn more chatting with other grad students during lunch than I do from any of my teachers.",
              "author": "Chiss_Navigator",
              "created": 1637851612,
              "upvotes": 2,
              "replies": {}
            },
            "hm19czh": {
              "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/hm19czh/",
              "text": "oof. no graduate only? thats brutal",
              "author": "pastlife_copyright",
              "created": 1637848998,
              "upvotes": 1,
              "replies": {
                "hm3blm5": {
                  "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/hm3blm5/",
                  "text": "Yeah, I came to my university for graduate school out of location necessities, but I really don't know if I would do this if I could do it over again. I couldn't even take internships to better myself because I needed to stay home for my family.",
                  "author": "Morganism00",
                  "created": 1637882623,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlz377z": {
      "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/hlz377z/",
      "text": "Is it online because of COVID or because it’s an online degree?",
      "author": "Funkybeatzzz",
      "created": 1637801604,
      "upvotes": 2,
      "replies": {}
    },
    "hm198de": {
      "link": "/r/GradSchool/comments/r1joug/is_anyone_else_having_a_underwhelming_grad_school/hm198de/",
      "text": "Very underwhelming. Everything's online because of covid. Nearly impossible to make friends or academic connections. It feels lonely and like I'm not really accomplishing anything. On top of that, my program isn't exactly the perfect fit for my research project, so I'm feeling really self-directed and like the school has forgotten about me. I'm three quarters through my MA now and still have to write my thesis...honestly I don't feel like I've learned that much in the last year and half. At least I had something to do through the pandemic, I guess?",
      "author": "pastlife_copyright",
      "created": 1637848928,
      "upvotes": 1,
      "replies": {}
    }
  }
}