{"sid": "fc6tdi", "link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/", "title:": "PhD LPT: if your advisor's behavior depends completely on the outcome of your work (results/papers), it's a HUGE red flag.", "text": "Dr Jekyll/Mr Hyde depending on a good result/bad result day is a no-no. That's all.", "author": "miserablePhD", "created": 1583124289, "retrieved": 1632845881, "over_18": false, "upvotes": 371, "upvote_ratio": 0.99, "comments": {"fjcs7eo": {"link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fjcs7eo/", "text": "Fuck, can we pin this on the subs front page?", "author": "ducbo", "created": 1583234542, "upvotes": 2}, "fja4txz": {"link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fja4txz/", "text": "My advisor barely concealed the fact that she hated me for the first 2-3 years of my degree. I was totally untrained, put on a high pressure project, and many experiments failed at the beginning. (With a few years of industry experience under my belt now, I'm not sure how ANY experiments worked given how outdated and broken our equipment was.) She even brought on another professor to co-advise me because she didn't want to deal, and by that, I mean actually mentor me. I had a big breakdown around my QE, and I told her I wasn't sure I was cut out for a PhD. She said \"ok well let me know what you decide.\" \n\nOnce I switched to a new phase of my project, where we had brand new, functional equipment, things started going really well. I started getting good results. Suddenly she was friendly and started recommending me for awards. She even wanted me to stay on as a postdoc after graduation and aim for tenure track.\n\nScrew you bitch. Industry 4lyfe.", "author": "lionlament", "created": 1583166409, "upvotes": 8}, "fj9r49m": {"link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj9r49m/", "text": "Yess....I didn't realize this getting into my PhD. The lab got very toxic", "author": "citiusaltius", "created": 1583157453, "upvotes": 1}, "fj93m0t": {"link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj93m0t/", "text": "Completely agree! \n\nVolatile changes in mood/mentoring/resource availability/etc. depending on whether or not you were able to deliver something is very hard to deal with, and should very much be considered a big red flag.\n\nThat said, there's no 'tip' here in this Life Pro Tip, and I earnestly want to open some dialogue on this topic. How does one **actually** deal with this? Oftentimes this sort of Dr. Jekyll/Mr. Hyde behavior is well-hidden from prospective grad students until it's far too late. Grad student friends of mine across the world have told me that the existing grad students in their respective groups either hid/downplayed/outright lied about their PI's emotionally-abusive tendencies, and by the time it came out, or by the time they realized it was something they weren't willing to put up with, it was too late. This sort of thing is a *disease* that's rampant across the entire academic industry, and it's self-perpetuating.\n\nBut say you want to change advisors, or leave your program? It's **hard**, and it's easy to say that no amount of abusive PI is worth the years you'd spend doing a grad program, but following through with potentially burning all your bridges in the department; realizing that the PI you signed up with is the only one doing the thing you came to that school for and that changing to a different PI would set you back years; that you may lose your funding/visa/etc., is very much easier said than done.\n\nReporting it? At least in the USA, tenure means that unless your PI lied about working with China or outright assaulted someone, the department isn't going to care about grad students that, from the department's perspective anyway, are 'just crying about a stressful PI.' \n\nThe hard reality for a lot of my friends in programs with PIs like this is that they simply must endure, while looking for the light at the end of the tunnel. For them, graduating is their #1 priority - with any dreams they might've had about purity-of-research or high-impact-publications given up.\n\nHow do we change the culture of academia? How do we get PIs who act like this to... well, stop?", "author": "opalicfire", "created": 1583130870, "upvotes": 92}, "fj92j1q": {"link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj92j1q/", "text": "advisor? you have such a thing? i thought it was only a legend....", "author": "moffedillen", "created": 1583129727, "upvotes": 7}, "fj90e35": {"link": "/r/GradSchool/comments/fc6tdi/phd_lpt_if_your_advisors_behavior_depends/fj90e35/", "text": "100% true. The opposite is also true: if nothing you do effects anything your advisor does and they basically ignore what you do, they will get bored of you and not give you any of the support you need.", "author": "iammaxhailme", "created": 1583127619, "upvotes": 69}}}