{"sid": "mrazu7", "link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/", "title:": "Why some students are so entitled?", "text": "It's 2:00 am and I'm correcting a late assignment and this kid just really got under my skin. So I'm here to rant.\n\nI TA for a language class, and host discussion sessions for them to use and practice their oral skills, most of my students never miss one, but the kid never bothers to show up and literally asked me to make all the content up in ONE 15-minute session, or more like give her the credits associate with them. She also asked me to meet her to give her make-up quizzes at the hour of her choice when she knew it's not my work time. All these absurd wishes were granted because the professor told me that she is trying her best while fighting her mental health issues ( she doesn't know I have it too).\n\nAnd today, she literally sent a google translated speech draft to me and hoping that I'll edit it for her, so she can present the final product in a video to impress the professor. I'm 90 minutes into correcting it and still have two fat paragraphs to go. Her video is due by the end of today, so I have to edit it for her like NOW. She sent it about two hours ago. Seriously? She is two weeks past due for this draft writing assignment and expecting me to fix her draft overnight?\n\nI hate when students use their mental health issues as excuses. I suffer from the same condition and I was never late for any assignments. As TA,  I've also seen students contacting me asking for permission for late work or at least apologize for submitting late work. All these are fine with me and I don't even take out late assignment points because I know how hectic studying online can be. But this student did none of these, just kept demanding me because she is not supposed to be pressured. I had to get up before 5:30 am on Friday for her make-up quizzes because she needs to spend evenings with family (her boyfriend). So frustrated at this moment.\n\nAnyway, rant over! Thank you good people on Reddit! Have a good night:)\n\n\\-----------------I'm not sure if this is how to do it, but beblow are some updates-----------------\n\nThank you all for your comments! I learned a lot from your experience, suggestions, and criticisms. I appreciate them all! I've talked with my professor and she told me to cut her some slack because she is graduating and has a nice job lined up. Well, the final exam is next week, so I guess this is it. I'm also leaving this school for Ph.D. studies elsewhere, so I don't what to put much energy into this anymore. But I learned my lessons and I'll do better with my boundary issues when I TA at my new school!\n\nAbout doing student's work: The draft she handed in is indeed an assignment, I have to edit drafts for all students (grammar mistakes and beyond), that's what the professor assigned me to do. But the professor only sees the final video, so no matter how bad their \"first drafts\" are, the prof will not know.\n\nAbout comment on mental health issues used as excuses: mental health issues are real, many people struggle to survive, myself included, but that's exactly why I don't like people to use them as excuses. We live with these issues, we fight these issues, we do our best not to let them affect our study and work. Sometimes we succeed and sometimes we fail. But when people \"under stress\" start to use this as an excuse, what happens is these people gain special accommodations, and honest people with actual issues suffer the loss. They bring bad names to \"mental health issues\" and now some will just see them as an excuse.\n\nThank you all again, good people on Reddit. You are the best!!!\n\n\\---------------------------------update-------------------------------\n\nShe didn't show up to the 5:30 am appointment and emailed me around 5:40 to ask my availability for the rest of the daytime, I'm done with it.", "author": "LingAmelia", "created": 1618477795, "retrieved": 1632953903, "over_18": false, "upvotes": 372, "upvote_ratio": 0.92, "comments": {"guq2zq8": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/guq2zq8/", "text": "The student isn't entitled, you just made yourself into a walking doormat with poor boundaries. Also, speaking as someone who is in the mental health profession, your mental illness is not theirs and their mental illness is not yours. There are going to be days in which people cannot function as they \"should\" WHICH IS WHY ITS CALLED MENTAL ILLNESS. I seriously doubt you would treat someone with a physical disability like this, are you going to scream at them to walk upstairs just because you can? No, so stop it.", "author": "SensitiveAnalysis18", "created": 1618581145, "upvotes": 1}, "gupdtof": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gupdtof/", "text": "Wow so I am a disabilities student at my uni and now post grad and that would not be allowed at my uni at all. you're essentially doing most of her work for her. I've missed one quiz and my lecturer has said I might be able to make it up but has not replied to me about it since. I just have to deal with that. I miss a tutorial and too bad for me. I have to deal with not having that information. Shes being spoiled by you. when you go to your new school  definitely put stronger boundaries in place. She should still have to work for it.", "author": "rheetkd", "created": 1618564103, "upvotes": 2}, "guof0l6": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/guof0l6/", "text": "Talk to the professor.", "author": "rehrev", "created": 1618538636, "upvotes": 1}, "gunlv9c": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gunlv9c/", "text": "Mental health has become the modern genzers excuse for everything from victimizing themselves about how college is so hard (all the while pretending they're not privileged for just being able to attend college) to using it as an excuse to fantasize about how being a working class poor with a mond numbing job would be \"less stressful\" than college or grad school.\n\nJust remember that these privileged kids make up the majority of current graduate student population. You can smell the entitlement in many of these threads on r/gradschool. \n\nMeanwhile, those of us from past generation (im an older millenial) have been living with mental health, without resources or help, since birth.", "author": "BerserkFuryKitty", "created": 1618523754, "upvotes": -1}, "gunkliu": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gunkliu/", "text": "She should be taking an I for the class and completing the work when she is able to and not depending on you to do all this for her. That is pretty ridiculous tbh and the professor is out of line expecting all of this out of you. I don't understand what you are doing because it sounds like the professor told is having you do her work which would be an academic honesty violation", "author": "DuckChoke", "created": 1618523160, "upvotes": 2}, "gunh0uh": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gunh0uh/", "text": "This is actually just your fault for not being able to say no? Like really lol. Grow a back bone.", "author": "decadekbrah", "created": 1618521541, "upvotes": 1}, "guneudm": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/guneudm/", "text": "You shouldn’t be doing her work, it’s not helpful to either of you in the end. However, please don’t frame it as “I have a mental illness and I can do it, so of course everyone can”. Mental illness is not consistent and some people struggle more with certain things, or maybe she is simply having a really tough time at the moment. I think it’s fair that she cares about her grades, she just doesn’t know how to be professional about it and help herself. I would let her know I can’t give detailed editing, but I will read it and give general comments on how she can improve. Offer her an extension maybe, but don’t do the work for her. I feel bad for both of you, it’s not an easy situation to be in. Hope you can take some time off later on to recover!", "author": "Kari5142", "created": 1618520550, "upvotes": 1}, "gundkh0": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gundkh0/", "text": "Definitely talk to your advisor. You should not be working more hours than contracted for or working outside of normal hours (5am?!) as a TA. The professor should be setting ‘reasonable’ accommodations. Not ANY and ALL accommodations.  If they want to offer above and beyond they have the duty to help/do the associated work. \n\n\nAnd the student should be working with disability services and have the necessary accommodations outlined. Then those are what they should be granted. \n\n\nAlso. It’s not your job to do their work for them. I would provide high level comments. Like ‘your sentence structure needs work here’. Comments like that would completely fulfil your obligations to provide feedback. But doesn’t result in you doing the work for them. \n\n(Signed a PhD grad student who has been the ‘prof’ for 20+ courses at the university level - and learned some of these things the hard way)", "author": "ContractCrazy8955", "created": 1618519993, "upvotes": 2}, "gunai4l": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gunai4l/", "text": "Mental health excuses are starting to really piss me off. They’re so overused and you can’t doubt the legitimacy of one without getting canceled and attacked by the woke crowd. “I couldn’t complete the assignment cause I had really bad anxiety,” is becoming the worst version of “my grandma died right before my final.”", "author": "prodromal96", "created": 1618518670, "upvotes": 2}, "gun7p1x": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gun7p1x/", "text": "Sounds like you need to get yourself a backbone.", "author": "MC_A-ron", "created": 1618517469, "upvotes": 1}, "gun5v0o": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gun5v0o/", "text": "You need to set boundaries.\n\n1. You tell her you understand she's going through some difficulties, but realistically to be fair, you cannot give her the same credit for one, 15-minute session as entire discussion sections.\n2. She does not get to choose when to take her make-up quizzes. It's your office hours or nothing. If her mental health issues are so severe that she cannot commit to the small time slot required to take a quiz, then frankly she should be registered with your school's disability program and be making accommodations ahead of time, not on-the-fly requests at your expense.\n3. I'm confused why you are editing her speech draft. Is your professor pressuring you to do that? Is that part of your role, to do their work for them or edit every draft before final submission? It's unrealistic for anyone to expect you to be spending 90 minutes on every student who has a problem. You give a few general corrections, and when it's clear it's low effort on her part, you simply send it back and say there are several similar mistakes, go back and review it based on what we've already learned in class, with the few corrections you gave as guidelines.\n4. I appreciate that mental health has become somewhat more normal to talk about. But one of the huge downsides is normal people thinking they're experts in it, or straight-up abusing it, or intentionally or unintentionally exaggerating their own problems by labeling something they're not.  If she's able to commit to time with her boyfriend, she's able to commit to time for this class. She is literally telling you she is capable of committing time to someone else but not you. Spending time with your boyfriend is good self-care, but self-care is also getting your shit together in life. She is telling you she is mentally capable of taking a quiz only at certain times. It doesn't make any sense, unless she has something like anxiety so bad that she cannot leave her home reliably (like legitimate agoraphobia), which again, she should be registered for disability so a plan can be put in place.\n5. I have struggled with mental health issues my entire life. I do want to point out, that just because you've struggled with mental health issues and never had an issue with late assignments, doesn't mean other people with mental health issues should not. Severity levels differ, ability to cope differs. However, it does sound like this student is abusing \"mental health\" to gain immunity and act totally devoid of any responsibility.\n6. You should talk with your professor, the extent of the troubles this student is giving you. I appreciate your professor having empathy, but too much lenience is honestly doing the student more harm than good. It allows her to develop coping mechanisms based on taking advantage of others, rather than confronting her responsibilities herself. I discussed accommodations with my professors ahead of time. They gave me some buffer on certain assignments, gave me some credit back for missed classes, saw that I was trying hard when I was able to try, but ultimately I was still docked some points, and I thought that was totally fair.  It sounds like your professor is wanting to smother her with hands-off empathy and let her off scot-free. Or maybe your professor knows something you don't; either way, if your professor is willing to be so kind to this student, s/he should be willing to be kind to you too.", "author": "_welcome", "created": 1618516674, "upvotes": 4}, "gun5m6j": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gun5m6j/", "text": "You’re too nice. I do the bare minimum when I TA. Let them sink or swim, I say. It’s their education. I never had a TA go out of their way for me in any class....ever. I have taken many many classes.", "author": "sincere_eel", "created": 1618516570, "upvotes": 2}, "gumpoqj": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gumpoqj/", "text": "If the student is being unreasonable CC the accommodation office on the emails and they will be able to address if accommodation requested is unreasonable and if they say it is reasonable ask them to provide someone to cover the needed support. 99% of the time they will tell the student what they are asking for is unreasonable as accommodations need to be made at the beginning of the semester.", "author": "entropyStable", "created": 1618509645, "upvotes": 2}, "gump6aw": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gump6aw/", "text": "You need to assert your boundaries in front of your professor and this student. Your professor is essentially throwing you under the bus so you have to bend over backwards for this student. That’s wrong. And you need to speak up. \n\nWhen I was a TA I didn’t do any of these things. I never edited students work, I never got up early for students, if they emailed me with a list of questions longer than 3 sentences I would direct them to my office hours so I could explain in person and when I’m actually getting paid for my time. \n\nThis is actually completely out of your scope. Please assert your boundaries you’re being taken advantage of.", "author": "nooraani", "created": 1618509421, "upvotes": 4}, "gumoe9r": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gumoe9r/", "text": "You need to lay this all out for your professor including the sending of items two hours before the date it was due and that it was just Google Translated.\n\nIf something was submitted to me that late I would simply refuse to do it. I have at least a 3-day turn around for these kinds of things.\n\nIf the professor really wants to \"accommodate her\" he can extend her deadline himself.", "author": "peregrin5", "created": 1618509081, "upvotes": 2}, "gumlopc": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gumlopc/", "text": "Um what? No. Stop doing this.", "author": "mymatrix8", "created": 1618507919, "upvotes": 6}, "gumiyib": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gumiyib/", "text": "I had a student who sent me an email with a litany of personal problems a third of the way into the term, asking for extensions on *two* essays she hadn't submitted and make up assignments for missed discussion sections. I gave her open extensions on all of them. \n\nI don't hear from her for a month, then get an email asking me if I received the assignments. I said \"no\", and then never heard back. I finally send her an email saying I need the outstanding assignments by April 20, but honestly think she should drop the class given that she's missed so much content. She then accuses *me* of giving her a hard time, when I've given her more generous extensions than the prof wanted! \n\nStill have not received any submissions from her.", "author": "Amir616", "created": 1618506739, "upvotes": 2}, "gumfg62": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gumfg62/", "text": "This is completely unreasonable!", "author": "garulous", "created": 1618505231, "upvotes": 2}, "gumcv6o": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gumcv6o/", "text": "Do you correct other students' work entirely? That sounds really unusual. When I TA'd for a language class, it was just a weekly discussion hour and then a separate office hour for specific grammar questions. \n\nI would check in with the prof before sending edits back for her. If reviewing their text is expected, you should be able to set a last date to get TA reviews in. I would also straight up say no if they weren't available during my work hours.", "author": "mediocre-spice", "created": 1618504109, "upvotes": 2}, "gum2gza": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gum2gza/", "text": "you gotta stick up for yourself, I would give her a zero period.", "author": "jamesarmour", "created": 1618499610, "upvotes": -1}, "gum0ys9": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gum0ys9/", "text": "“I hate when students use their mental health issues as excuses”\n\nAre you fucking serious? \n\n“I suffer from the same condition”\n\nAre you sure that it’s the same degree? Are you a doctor? Did you diagnose her professionally? \n\nSome people are entitled, regardless of the status. But you are a fucking dick for undermining the seriousness of mental health.", "author": "OvulatingScrotum", "created": 1618498944, "upvotes": 4}, "gulz5vp": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulz5vp/", "text": "Are you contracted to work a certain number of hours as a TA a week? Track all of your hours, especially ones outside of your allocated work ones, and get it in writing that the professor is having you work extra time. If it starts adding up (it will), you have a good case for asking for more $- doesn't make it better but makes it hurt less, in my experience.\n\nThat said, I agree with a lot of the other commenters that just because you have a mental health condition doesn't mean everyone else's is invalid, or they should be able to do exactly what you're able to do.", "author": "Maiasaur", "created": 1618498141, "upvotes": 5}, "gulysnc": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulysnc/", "text": "What language is this for?", "author": "thelaughingmansghost", "created": 1618497977, "upvotes": 0}, "gulxv7q": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulxv7q/", "text": "This is absolutely unacceptable. She should be directed to the disability center where she can be appropriately accommodated. You shouldn't be going to this extent to accommodate plus it seems like you are liberating the work for her.\n\nAlso, its school, she is supposed to feel some sort of pressure but there should be resources in place where she learns how to deal with it in a healthy way.", "author": "stephoone", "created": 1618497552, "upvotes": 3}, "gulxsy3": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulxsy3/", "text": "So, firstly I wouldn’t compare your mental health issues to hers. You don’t know what’s going on. Secondly, you should suggest that the student looks into accommodations so she can get the extra time and resource for her to succeed on her own.", "author": "sailorveenus", "created": 1618497523, "upvotes": 12}, "gulw8om": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulw8om/", "text": "Honestly you need to set boundaries. you can’t really be mad if you are doing this for her last minute. You could have just as easily said no. a maybe the professor knows things you don’t but that doesn’t mean you have to adjust your schedule and do everything for her.", "author": "samscreen", "created": 1618496816, "upvotes": 13}, "guluros": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/guluros/", "text": "Why are you letting her walk all over you? Insist on some professional boundaries", "author": "blueb0g", "created": 1618496145, "upvotes": 26}, "gulu3ta": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulu3ta/", "text": "You need to set boundaries with your boss/ the professor.", "author": "RageA333", "created": 1618495835, "upvotes": 14}, "gulrq1q": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulrq1q/", "text": "I fully understand your frustration, but there is no point in getting upset and calling others entitled if you don't set your own boundaries and communicate clearly too. \n\nIf a student sends me something to proofread less than 2 days in advance for a due date, I'll grade it in my own time (usually a 3 day window) and tell them good luck if they don't meet the deadline. All my students have access to this piece of information as it is announced clearly on their syllabus, online, and in my emails to them. So its up to them to utilize that info wisely or not.\n\nUndergrads are often super young and immature (and yes, entitled). You're not going to be able to control that. Its up to you to control how you respond to it though and hope that you can help shape those folks. Complying with every demand that comes your way and then getting upset about it does nothing for you or anyone else.\n\nFrankly, the same goes for your professor. These are people you have to learn to set boundaries with as well, unfortunately.", "author": "freakybread", "created": 1618494694, "upvotes": 26}, "gulrhso": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulrhso/", "text": "Yeah, she’s asking for wayyyyy to much. I’ve been very lenient this year because of the pandemic, but sometimes I’m just like, FUCK THEM KIDS.", "author": null, "created": 1618494584, "upvotes": 5}, "gulplbt": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulplbt/", "text": "I would talk to your professor and tell them what scheduling has been like and the requests. If the student has a medical condition, they can seek accommodations officially. Otherwise, you need to play hardball and set limits on how and when she can get assistance from you. Students act entitled because they are used to being told yes. But they aren’t entitled to all your time or energy.", "author": "quixoticquail", "created": 1618493632, "upvotes": 5}, "gulpj6b": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulpj6b/", "text": "Why the fuck are you doing that??!? That is absurd,  the only reason the student is asking is because your are allowing it. Put your foot down.    I don’t even respond to student emails after 10 pm.", "author": "Dr-dumb", "created": 1618493602, "upvotes": 88}, "gulncnf": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulncnf/", "text": "Report professor and student", "author": "Anonymous2224-", "created": 1618492472, "upvotes": -2}, "gulnaso": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulnaso/", "text": "If this student doesn't have documentation with the university outlining a condition and the steps to deal with it, you can tell her to pound sand. If your professor gets pissed, so what? The professor doesn't sign your paycheck.", "author": "PancakesandMaggots", "created": 1618492445, "upvotes": 2}, "gullkaf": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gullkaf/", "text": "As a TA you have a cap on the number of hours you are on the hook for working. You don't have to work unreasonable hours. You need to enforce boundaries. You have office hours for a reason. Students are expected to attend them or find a time that works for the both of you. \n\nI had the same problems when I was a TA. If they google translated a document and it was riddled with errors, I'd send them to the department responsible for helping non-native English speakers write papers. Your school may have one. The folks there get paid to do what you are doing.", "author": "send_nudibranchia", "created": 1618491494, "upvotes": 29}, "guljujd": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/guljujd/", "text": "If someone has extenuating circumstances that effect their grade, they are supposed to go through the proper channels, and a fair agreement needs to be made about what support they need ahead of time. They shouldn't be asking for ad hoc assistance. It's not your place as a TA to make these decisions on a case by case basis (or be the one to say no when the student oversteps). I would complain if I were you.", "author": "l_lecrup", "created": 1618490503, "upvotes": 20}, "guljptw": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/guljptw/", "text": "Friend, you need to learn to say No. Everyone had some kind of mental health issues. You are being taken advantage of and need to draw the line.", "author": "Lord_Blackthorn", "created": 1618490424, "upvotes": 49}, "gulj1wb": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulj1wb/", "text": "TBH, you correcting her final project for grammar errors in a class that you TA sounds like academic misconduct to me. She could go to a tutoring center or get some help from the prof, but to present your work as her own is not okay in my book.", "author": "kitzdeathrow", "created": 1618490026, "upvotes": 149}, "gulhpy5": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulhpy5/", "text": "Man if they dont want to work cuz they are cray cray, just go get treated. These days everyone wants to claim \"mental stress\" to do minimal work. Your professor is a fucking pussy ass pushover.", "author": "articlesarestupid", "created": 1618489208, "upvotes": -30}, "gulgfpg": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulgfpg/", "text": "If I was actually correcting someone’s work for them to submit as their own, it’d be considered plagiarism. I’m not sure if I’m understanding the situation properly but this sounds very “not allowed” in most cases.", "author": "cm0011", "created": 1618488381, "upvotes": 173}, "gulfts0": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulfts0/", "text": "In my undergrad language courses, using a translating tool like that would've been an immediate referral to student conduct for plagiarism. This is wild.", "author": "greensleeves97", "created": 1618487974, "upvotes": 47}, "gulf38j": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulf38j/", "text": "Your university should have a disabilities accommodation office (that can work with students who have mental health issues) I think you should talk to your professor about this student.", "author": "SnooTomatoes3816", "created": 1618487469, "upvotes": 192}, "guldo8n": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/guldo8n/", "text": "Honestly?  Sounds like the professor is privy to need to know information.  Her mental health issues might cause these delays.  If you have issues that do affect your work (because they do...otherwise you would never have mentioned this), let the professor know.", "author": "volkmasterblood", "created": 1618486457, "upvotes": 21}, "gulcsgp": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gulcsgp/", "text": "I have never heard of a TA doing a student’s work before. This is a bit absurd. Sounds like the student needs to be registered with the disability resources dept. I was registered with mine for PTSD and through that I was granted flexible deadlines which was so helpful. This situation you are talking about sounds out of control and in need of some serious boundaries.", "author": "saintanja", "created": 1618485791, "upvotes": 584}, "gul7vbh": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gul7vbh/", "text": "Absolutely ridiculous. Mental issues or not, you need to set clear boundries. Or just not respond to her \"urgent\" e-mails outside your work hours.", "author": "fetchmeacupoftea", "created": 1618481412, "upvotes": 72}, "gul7l8l": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gul7l8l/", "text": ">  I had to get up before 5:30 am on Friday for her make-up quizzes because she needs to spend evenings with family (her boyfriend). \n\nThis is absolutely ridiculous. I can't imagine in what world it makes sense to ask you to get up at an unreasonable hour because this irresponsible student chose not to do her work on time. \n\nFolks like this are being set up for failure.", "author": "False-Guess", "created": 1618481139, "upvotes": 162}, "gul70ao": {"link": "/r/GradSchool/comments/mrazu7/why_some_students_are_so_entitled/gul70ao/", "text": "Ok, I sympathize with your overall point that entitled students suck and this particular one seems to be a nasty piece of work. But, this sentiment: \n\n>I hate when students use their mental health issues as excuses. I suffer from the same condition and I was never late for any assignments. \n\nis problematic as hell. You might have the same diagnosis, but that condition does not manifest in or affect every individual the same way.", "author": "aggressive-teaspoon", "created": 1618480565, "upvotes": 101}}}