{
  "sid": "ps3kma",
  "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/",
  "title:": "I feel like I shouldn't have been TA.",
  "text": "I am a first-year Ph.D. international student in the US. My field is mathematics. Today’s session with students were horrible.\n\nStudents asked me questions, but I couldn’t even understand what they were talking about. I’m having a hard time with the English language. I am pretty sure I got a fluke when I took TOEFL.\n\nEven if I could understand, I didn’t know how to answer them. The curriculum is vastly different from the one in my country. Even worse, I told one of them an incorrect answer. Fortunately, the prof followed up, so the mess I caused got cleaned. (In this case, I learned that I should have prepared more)\n\nSimilar things happened too many times ever since I started here a few weeks ago. I can see I'm losing their trust. When I go to students to answer questions, sometimes I will just be asked to get some other people who can actually answer questions.\n\nI'm trying to improve, but things don't seem to get better. It just makes me want to quit being TA, but my tuition relies on the TAship, so I just can't, or I have to quit everything.\n\nDoes it get better, or am I hopeless?",
  "author": "mao1756",
  "created": 1632171195,
  "over_18": false,
  "upvotes": 41,
  "upvote_ratio": 1.0,
  "comments": {
    "hdpthke": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdpthke/",
      "text": "You are being asked to do a job with less training than what a lot of schools provide. First, many grad programs don't expect graduate students to TA in their first semester. Just getting situated and taking classes is a lot. \n\nSecond, there should be a TA training program, usually offered as a first-year course, that teaches grad students the basics of being a TA. \n\nThird, good schools offer training in English for international teaching assistants. These are specifically for language skills that are important when TAing, and for grad students, who are really good at learning things and expect to be good at what they do. \n\nYou have not been provided with any of those things, so it will be harder to succeed this semester. Inquire about some of those support resources.",
      "author": "IkeRoberts",
      "created": 1632231795,
      "upvotes": 3,
      "replies": {}
    },
    "hdpmuvq": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdpmuvq/",
      "text": "I agree with all of the other comments here that this is just part of the process, and that it will get better. Language gets better when you use it; your written english is perfect so I'm sure the speaking and listening will get easier quickly. One short-term/practical suggestion is to see if your university has any resources for international TAs; they may be able to match you up with a mentor who has been through this and/or give you advice on managing the language difficulties!",
      "author": "lagartijo0O",
      "created": 1632228500,
      "upvotes": 2,
      "replies": {}
    },
    "hdpkopc": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdpkopc/",
      "text": "You will pick up English as you keep talking and putting yourself out there. If you can't answer a students question in session, see if you can send them a link or some sort of resource that can help answer their question.",
      "author": "Melon_Lord_13",
      "created": 1632227301,
      "upvotes": 2,
      "replies": {}
    },
    "hdpkh7h": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdpkh7h/",
      "text": "If you can approach the students with humor and empathy, they’ll like you. You can help them with math, and all of this interaction that you’re forced into will help you with English. If you can’t understand something they say, you can say something like, “Could you please repeat that for Mr. Foreigner over here?” It’s self-deprecating humor, but it could help them understand how to communicate more clearly. You should be confident in your skills— both English and math! You passed the TOEFL! It wasn’t a fluke. You’re working professionally in a second language. That’s really something to be proud of! It may be exhausting this semester, but it will get easier. Also, if you were taught a different way to approach a problem, why not show the students that way? They might be interested to learn an alternative approach.",
      "author": "panda00painter",
      "created": 1632227178,
      "upvotes": 3,
      "replies": {}
    },
    "hdoiqw5": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdoiqw5/",
      "text": "Can you attend some of the lectures or get the professor's notes? It would help you with the language and give you an idea what the students are learning and how. It's very hard to run a recitation section without a good bit of knowledge about what's going on in the lectures. I think you'll be fine. This week was rough but next week you may be the hero who helped clarify a tough topic.",
      "author": "eleveneels",
      "created": 1632197645,
      "upvotes": 6,
      "replies": {
        "hdojnzu": {
          "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdojnzu/",
          "text": "I was at the lecture at the time. It was like “solve this question and TAs will help you if you’re stuck” section.  Usually undergraduate TAs are in charge of those things but today some of them couldn’t show up so I had to fill in.\n\nThen I was completely unprepared and bam, the thing happened. Well at least I should have read lecture notes before the class.",
          "author": "mao1756",
          "created": 1632198202,
          "upvotes": 8,
          "replies": {
            "hdoqnl0": {
              "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdoqnl0/",
              "text": "Oh, well you learned what to do next time. There will be some bumps in the road while you're adjusting to a new role in a new environment. It doesn't mean you're not capable. It just means you're learning.",
              "author": "eleveneels",
              "created": 1632202848,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hdnwgp0": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdnwgp0/",
      "text": "You’ll be fine. Think of it as just another job to get paid. Neither you nor them need to like the job but you’ll still get paid. After all you’re an “assistant”, and ultimately it’s your profs ass that’s going up in flames before it’ll get to you.",
      "author": "GoofyMaximus",
      "created": 1632186582,
      "upvotes": 3,
      "replies": {}
    },
    "hdnn8c1": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdnn8c1/",
      "text": "Teaching is part of the learning process! You are learning.",
      "author": "fwafwa",
      "created": 1632182267,
      "upvotes": 3,
      "replies": {}
    },
    "hdn5bq4": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdn5bq4/",
      "text": ">... the mess I caused got cleaned.\n\nWelcome to the US! The mess was already here before you got here, so don't worry about that!\n\nUndergraduates can be pretty mean to TAs, especially when there is a language barrier. You should still be the TA. They need to learn to be patient with nonnative English speakers. They might not learn this lesson until long after your class. For now I suggest a lot of smiling and nodding.\n\nFor future semesters you should request to teach a class in a subject you enjoy. That way at least if the students give you grief you can focus on the material and get some satisfaction out of it.\n\nI'm also in math. I finished my degree a couple years ago. In a PhD program the teaching is really a small part of it. Focus on your studies. The professors will judge you on your math.",
      "author": "HerndonMath",
      "created": 1632173976,
      "upvotes": 17,
      "replies": {}
    },
    "hdn0tkd": {
      "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdn0tkd/",
      "text": "You sound like an average TA lol.  Most TAs are covering material outside of their expertise so there should be a lab manual you just follow.\n\nWorking as a TA sucks and the only people who like it only do it once a year… if that.\n\nYou’re fine.  Students will be fine.  Treat it like a job and if you have a union join it.",
      "author": "Trillbotanist",
      "created": 1632172022,
      "upvotes": 63,
      "replies": {
        "hdo2sf1": {
          "link": "/r/GradSchool/comments/ps3kma/i_feel_like_i_shouldnt_have_been_ta/hdo2sf1/",
          "text": "Yep, join your union if you have one. Nobody would or should do this for free, join in on making this shit a little easier on us all!",
          "author": "bigmeanjoegreen",
          "created": 1632189503,
          "upvotes": 14,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634065181
}