{"sid": "prz3kp", "link": "/r/GradSchool/comments/prz3kp/i_need_advice_in_relation_to_disappointing_my/", "title:": "I need advice in relation to disappointing my supervisor.", "text": "I hate to come out of the gate with an excuse but I've been incredibly busy with experiments for the past week and a half and have pulled several 12, 13, 14 hour days in the lab, so certain things have slipped my mind somewhat. Anyhow, I missed an abstract submission deadline for a local zoom-based event - I read the registration deadline a couple weeks back and mistakenly took that to mean the abstract submission deadline (they're 6 weeks apart and the abstract submission deadline was a few days ago). What makes me feel even stupider is I drafted an abstract that was ready to submit, I just thought I had time to mull it over for longer - I tend to overthink these things and re-read abstracts an unnecessary number of times. On the plus side, I've already submitted my work for two other events that I'm presenting at in the near future - I'm just embarrassed by my mistake. I'm really not sure how to break this to my advisor, this was such a dumb mistake to make and I'm disappointed in myself as well, as I was looking forward to presenting at this.", "author": "ElonMusksAdoptedSon", "created": 1632157576, "retrieved": 1632844118, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hdnn77r": {"link": "/r/GradSchool/comments/prz3kp/i_need_advice_in_relation_to_disappointing_my/hdnn77r/", "text": "Shit happens, nobody bats 1000 all of the time. I've been known to miss a mark or two if Ive been pulling long days in a row. \n\n\nI'm apparently so tired that I'm speaking in mixed metaphors, but you know what they say, a bird in hand flocks together!", "author": "Pr0gr3s", "created": 1632182252, "upvotes": 1}, "hdmfsk4": {"link": "/r/GradSchool/comments/prz3kp/i_need_advice_in_relation_to_disappointing_my/hdmfsk4/", "text": "First, submission deadlines are rarely totally set in stone. Consider submitting anyway, perhaps with a letter of apology. In the meantime, explain to your advisor. Do so professionally, without martyring yourself over the amount of work you've been doing or self-flagellation/performative apology. Explain the situation, ask for advice, and offer your working solution for making sure it doesn't happen again. Ultimately, everyone is going to disappoint their advisor at some point, but this affects you much more than them.", "author": "ThePeregrine_87", "created": 1632163391, "upvotes": 3}, "hdm69tg": {"link": "/r/GradSchool/comments/prz3kp/i_need_advice_in_relation_to_disappointing_my/hdm69tg/", "text": "[deleted]", "author": null, "created": 1632159474, "upvotes": 2}}}