{
  "sid": "qwwr3a",
  "link": "/r/GradSchool/comments/qwwr3a/mpp_at_northwestern/",
  "title:": "MPP at Northwestern",
  "text": "Hi! I am wondering if anyone has experience with the MPPA at Northwestern, any advice/ insight appreciated!",
  "author": "Sweet_Ad_8718",
  "created": 1637261687,
  "updated": 1637354715,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hl62oj6": {
      "link": "/r/GradSchool/comments/qwwr3a/mpp_at_northwestern/hl62oj6/",
      "text": "NU is typically good with publicizing data on outcomes and acceptance rates for their programs, but the MPPA is in the \"Professional Studies\" school, not the \"Graduate School,\" so this doesn't seem to be available.\n\nLooking at the MPPA website, I'm wary about the fact that they (a) don't publish anything on their graduate outcomes and (b) say little about program statistics. [The page on \"career options\"](https://sps.northwestern.edu/masters/public-policy/career-options.php) lists overall \"potential\" outcomes for someone with an MPPA, not what you could experience by getting the degree from NU specifically. I would highly recommend asking the program for this information:\n\n* How many students are employed by graduation time? \n\n* What is the average and median salary?\n\n* Where do students from the program tend to work afterwards?\n\nNU has an overall good reputation, but with any Masters degree you should see for yourself how it actually works out for the students of that specific program.",
      "author": "set_null",
      "created": 1637268908,
      "upvotes": 2,
      "replies": {
        "hl67kcv": {
          "link": "/r/GradSchool/comments/qwwr3a/mpp_at_northwestern/hl67kcv/",
          "text": "Ya to piggy back on this, I’d reach out to someone from the program — and admissions coordinator maybe — to ask them for these types of figures.",
          "author": "ThrowawayHistory20",
          "created": 1637270870,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}