{"sid": "9ljgmj", "link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/", "title:": "(UPDATE) Starting a PhD thousands of miles away from your ill parent...", "text": "A year and some months ago, I wrote here seeking advice. This is the original post: [https://www.reddit.com/r/GradSchool/comments/6fahhf/starting\\_a\\_phd\\_thousands\\_of\\_miles\\_away\\_from\\_your/](https://www.reddit.com/r/GradSchool/comments/6fahhf/starting_a_phd_thousands_of_miles_away_from_your/)\n\nIn case someone else is in the same situation I was, I will let you know how it turned out. \n\nOne day in July 2017 or so, I felt I couldn't handle it anymore and I emailed my advisor from the E.R. while I was waiting to see what was going to happen with my mom, whom we had had to rush to the hospital for complications with her symptoms. I had read all the rules and was pretty sure, as you can see in my comments on the original thread, that deferring was not an option. However, my advisor told me I was going to defer my admission, and dealt with the Department and almost everything else for me. The Graduate School was incredibly nice to me, and told me not to worry; they would just send me an official letter I had to sign, and in the next round of admissions they would send me a new admissions package. My mom was very upset I didn't go off to school, but I got to spend her last six months of life with her. She passed away in December 2017.\n\nThe University delivered, and I'm currently in my second month of my PhD program. I didn't even have problems when I applied for my brand new visa even though I had to have the previous one cancelled. \n\nI'm now in the process of getting a therapist to deal with my grief. I'm not going to lie, studying while mourning your mother in a place where you don't really know anyone (I'm single again, because life really likes to challenge you during the hardest times) isn't easy. Insomnia is way too common. It is difficult to focus, and I know I'm always behind in my readings. But I have hope it will get better. \n\nThank you everyone for your support a year ago, it really helped me. I hope my story helps someone else, too.", "author": "dahliazuli", "created": 1538716497, "retrieved": 1632953969, "over_18": false, "upvotes": 341, "upvote_ratio": 0.98, "comments": {"e78se5d": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78se5d/", "text": "I'm sorry for your loss and just how difficult things have been. It's very heartening to hear that your advisor was willing to fight for you so you could defer for a year.  \n\nI'm dealing with a similar decision...my mom is all I have left in my family. (I'm an only child and it's been a very very bad decade and my small family is now mostly deceased). She's already had cancer ten years ago, and now she's just getting older and needing more help since she's prone to falling...meanwhile, I'm now 35, killed my career by being a caregiver for the past decade, so that I now need to go back to school to retrain, and wanting to go away to school. But how can I do that when I'm all she has?? ", "author": "inverseofblanche", "created": 1538780028, "upvotes": 2}, "e78b7xm": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78b7xm/", "text": "I am sorry for your loss. I would do the same as you did. \n\n&#x200B;", "author": "LifeWeekend", "created": 1538765066, "upvotes": 2}, "e78a4rl": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e78a4rl/", "text": "I don't know your mom but I feel like she would be very proud of you", "author": "DrLexaloo", "created": 1538764154, "upvotes": 3}, "e7877at": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e7877at/", "text": ":'( I am so sad that such things happen, and I am very sorry you went through all that. I wish you all the strength and more. ", "author": "GreySkiesPinkShoes", "created": 1538761746, "upvotes": 2}, "e783jkk": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e783jkk/", "text": "[deleted]", "author": null, "created": 1538758784, "upvotes": 3}, "e783044": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e783044/", "text": "Sending lots of love! Do you like to workout or do yoga! I really developed a love for both of those practices during in grad school! It helps to move the body!", "author": "NaimahBeeema", "created": 1538758338, "upvotes": 3}, "e77xrwa": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77xrwa/", "text": "So sorry for your loss <3 my mother died this summer, between my 4th and 5th years of my PhD, and some days just getting out of bed feels like the biggest hurdle in the world, but we're gonna make it. Best of luck to you, and sending good thoughts your way.", "author": "Maiasaur", "created": 1538754052, "upvotes": 6}, "e77vyio": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77vyio/", "text": "What a great story! Keep on keepin' on and the universe will reward you! ", "author": "mamu5304", "created": 1538752557, "upvotes": 3}, "e77uqyc": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77uqyc/", "text": "I'm really sorry for your loss. My father died half way through my PhD, we were very close. It's hard working through the grief, and there were days where I'd just stare at my PC, and not achieve anything at all. Above all, you have to remember to be kind to yourself. It is possible to succeed, despite it all. Good luck.", "author": "mfra2", "created": 1538751546, "upvotes": 6}, "e77sgkb": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77sgkb/", "text": "So sorry for your loss! Wishing you all the best in your program. I'm so glad that your program and school were supportive to you last year and that you got to spend that precious time with your mom. I'm sure this year will be challenging for you in lots of ways, but it sounds like you've got your ducks in a row (hella supportive supervisor, therapy, etc.). Take care!", "author": "sexresearchiscool", "created": 1538749646, "upvotes": 4}, "e77pd21": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77pd21/", "text": "Sorry for your loss. You’re doing everything right. Congratulations with your new academic journey. Our loved ones are the ones on our minds those rough nights of writing, who make the work worthwhile. ", "author": "studyhardbree", "created": 1538746878, "upvotes": 6}, "e77omtc": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77omtc/", "text": "I'm so sorry for your loss but I bet she is immensely proud of you no matter what :-)\n\nCongratulations for getting through one of the roughest years of (any)one's life! I wish you the best of luck!", "author": "Ce-lavi", "created": 1538746171, "upvotes": 3}, "e77jp1v": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77jp1v/", "text": "I'm glad things worked out ok for you academically. Sorry for your loss.", "author": "unique0130", "created": 1538740395, "upvotes": 4}, "e77etp3": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77etp3/", "text": "I’m so sorry for your loss and wish you all the best in your PhD program. ", "author": "trivenefica", "created": 1538731427, "upvotes": 15}, "e77bhah": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e77bhah/", "text": "I'm so simultaneously happy for you that your advisor had your back and that the school worked with you to make it work, and that you got to be with your mom and then to go to your dream program AND so unbelievably sorry that you've lost your mother.  I can't imagine how difficult it must be to study and be alone in a new city while processing your grief.  I truly hope things start getting  little easier and life stops sending you so much insanity . Congratulations for getting to where you are now ", "author": "firinne83", "created": 1538724016, "upvotes": 41}, "e778a1c": {"link": "/r/GradSchool/comments/9ljgmj/update_starting_a_phd_thousands_of_miles_away/e778a1c/", "text": "Lots of affection and warmth for you. I hope this space becomes the meaningful place you need it to be.", "author": "chaitalis", "created": 1538718310, "upvotes": 71}}}