{
  "sid": "qv9ack",
  "link": "/r/GradSchool/comments/qv9ack/undergrad_bio_major_wondering_is_a_physics_minor/",
  "title:": "Undergrad bio major wondering... Is a physics minor relevant to biology?",
  "text": "I'm on the fence on taking a physics minor with my biology major in undergrad school. I have a chemistry minor, also. I plan on going to graduate school, and my interest is microbiology (but not medical microbiology). I haven't narrowed it down further than that, but is physics relevant to this field? How? Is physics relevant to other fields of biology also? \n\nThanks for sharing!",
  "author": "n_ugget_t",
  "created": 1637073753,
  "updated": 1637182666,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkv2ff4": {
      "link": "/r/GradSchool/comments/qv9ack/undergrad_bio_major_wondering_is_a_physics_minor/hkv2ff4/",
      "text": "Nothing is irrelevant to anything. Seemingly completely different majors may supplement one another. Further, physics and biology definitely have overlap. There's literally a field called biophysics. In my neck of the woods (in terms of research and research interests) it mostly looks at the physical mechanics of various receptors, particularly ion channels. A background in both bio and physics would definitely benefit you there, though you by no means have to do both to get into the field (many people studied biochemistry to get into that field, for example).",
      "author": "nickyfrags69",
      "created": 1637076494,
      "upvotes": 7,
      "replies": {}
    },
    "hkuy9az": {
      "link": "/r/GradSchool/comments/qv9ack/undergrad_bio_major_wondering_is_a_physics_minor/hkuy9az/",
      "text": "For getting into grad school, your time might be better spent taking more courses in biology. Or finding a research opportunity as an undergrad in biology.",
      "author": "raistlin65",
      "created": 1637074722,
      "upvotes": 4,
      "replies": {}
    },
    "hkw2ipc": {
      "link": "/r/GradSchool/comments/qv9ack/undergrad_bio_major_wondering_is_a_physics_minor/hkw2ipc/",
      "text": "More valuable would probably be research experience, but biophysics is certainly an active field of research. For example, the physics of photosynthesis and other processes in the cell.",
      "author": "KiwiTheKitty",
      "created": 1637090711,
      "upvotes": 1,
      "replies": {}
    },
    "hkwsp2n": {
      "link": "/r/GradSchool/comments/qv9ack/undergrad_bio_major_wondering_is_a_physics_minor/hkwsp2n/",
      "text": "It's a good minor to have regardless of field. It's an excellent demonstration of critical thinking skills. This is why the MCAT has a physics portion even though medical school isn't going to require any physics knowledge.",
      "author": "origional_esseven",
      "created": 1637101079,
      "upvotes": 1,
      "replies": {
        "hkx3klz": {
          "link": "/r/GradSchool/comments/qv9ack/undergrad_bio_major_wondering_is_a_physics_minor/hkx3klz/",
          "text": "Well physics is definitely used in in depth physiology courses. Although it’s more conceptual and less nitty gritty math. You still need to understand principles of physics to truly appreciate physiology.",
          "author": "QuantumTunneling010",
          "created": 1637105668,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}