{
  "sid": "q0slol",
  "link": "/r/GradSchool/comments/q0slol/how_do_you_make_friends_in_grad_school/",
  "title:": "How do you make friends in grad school?",
  "text": "I've recently moved to a different country for grad school. There aren't any clubs for grad students here and the existing clubs have an undergrads only policy, strange I know. \nEveryone in class either seems to already have a close group of friends or too busy to hang out. My roommates aren't really interested in socializing either. \nAny suggestions?",
  "author": "Adventurous_Yam9087",
  "created": 1633300951,
  "updated": 1634099948,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hfa9vfd": {
      "link": "/r/GradSchool/comments/q0slol/how_do_you_make_friends_in_grad_school/hfa9vfd/",
      "text": "All of my best friends from grad school are people who were in groups with me for different class assignments.  After a few weeks someone always suggested grabbing a drink or getting the group together for work plus dinner somewhere.  Stuff like that.  I’m pretty shy at first so I was glad to have the invitation, but now I think I’d initiate it willingly.",
      "author": "Champagne-and-Fries",
      "created": 1633301840,
      "upvotes": 8,
      "replies": {
        "hfaady1": {
          "link": "/r/GradSchool/comments/q0slol/how_do_you_make_friends_in_grad_school/hfaady1/",
          "text": "My current project group mates aren't really interested in hanging out either. All our discussions are on zoom and they're either busy or have other plans. I'm really starting to think I'm going to have a very depressing first semester.",
          "author": "Adventurous_Yam9087",
          "created": 1633302076,
          "upvotes": 6,
          "replies": {
            "hfaansi": {
              "link": "/r/GradSchool/comments/q0slol/how_do_you_make_friends_in_grad_school/hfaansi/",
              "text": "That’s a tough one.  I guess I’ll say my experience was pre-Covid.  So now that everyone’s on zoom and such it might be a bit trickier.",
              "author": "Champagne-and-Fries",
              "created": 1633302201,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfbd20q": {
      "link": "/r/GradSchool/comments/q0slol/how_do_you_make_friends_in_grad_school/hfbd20q/",
      "text": "Sounds like Japan. \n\nI went on a few dates. It's more me, but I tend to stay friends with exes and occasional friends with benefits so I expanded that way. Otherwise I met many of my friends through dorm. \n\nIf you guys have a student housing it might be good to apply to some.",
      "author": "__apples__oranges__",
      "created": 1633321717,
      "upvotes": 2,
      "replies": {
        "hfbdcju": {
          "link": "/r/GradSchool/comments/q0slol/how_do_you_make_friends_in_grad_school/hfbdcju/",
          "text": "Nah, I'm in the US. I'm a commuter student and my university doesn't have any student housing for grads. My initial plans were to join a club and make friends through club activities and stuff but turns out there aren't any for grad students here. Just a few committees that meet once a year.",
          "author": "Adventurous_Yam9087",
          "created": 1633321907,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}