{
  "sid": "q05l8h",
  "link": "/r/GradSchool/comments/q05l8h/not_taking_comp_exams_with_my_cohort/",
  "title:": "Not taking comp exams with my cohort",
  "text": "Hello! I had a bit of a rough start in my program. I switched fields and am not not taking comprehensive exams with my cohort. My committee is fully on board, understanding and supportive. I have felt judgment from people in my cohort and other grad students. How do people take the seemingly negative feedback from other grad students and move past it? Faculty have said be above it and ignore them but I feel stuck.",
  "author": "Civil_Junket_6826",
  "created": 1633216173,
  "updated": 1634099974,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hf5qvel": {
      "link": "/r/GradSchool/comments/q05l8h/not_taking_comp_exams_with_my_cohort/hf5qvel/",
      "text": "I’m about to take my comps 1 1/2 years late because of switching fields. Don’t panic. You are fine and I promise no one will lose respect for you. As for the nasty comments….don’t pressure yourself into NOT being hurt by them. It does feel bad. Just don’t let it affect your self worth. I always wondered how my profs could float above it all like solid Teflon, but it’s honestly just because they’ve been through it before and come out on the other side ok",
      "author": "LinneaBorealis",
      "created": 1633217753,
      "upvotes": 3,
      "replies": {}
    },
    "hf64l31": {
      "link": "/r/GradSchool/comments/q05l8h/not_taking_comp_exams_with_my_cohort/hf64l31/",
      "text": ">How do people take the seemingly negative feedback from other grad students and move past it? \n\nPolitely tell them to piss off and mind their own business once, then get progressively ruder about it until they get the hint. Your committee is on board and that's all that matters. Your cohort are not important people in the program, so their opinion is irrelevant. Also, if faculty are aware of mean and judgmental comments your cohort members are making then if they don't stop it might be worthwhile to consider escalating it because it sounds like it could be harassment/bullying. I honestly don't understand how they have the time to keep tabs on what you're doing. Maybe they are not busy enough.\n\nNo two people have the same degree experience and everyone has their own unique circumstances. If they had a smoothe and bump-free program so far, they should be thankful for it and focus on themselves. Not everyone has that same experience, and it's most of the time not a reflection on the student but rather circumstances beyond their control and, but for the grace of god (or one's committee) it could be them.",
      "author": "False-Guess",
      "created": 1633223978,
      "upvotes": 3,
      "replies": {}
    },
    "hfcjl3g": {
      "link": "/r/GradSchool/comments/q05l8h/not_taking_comp_exams_with_my_cohort/hfcjl3g/",
      "text": ">Faculty have said be above it and ignore them\n\nYeah this is it. If they can't be mature enough to recognize that different people have different paths, that's their problem. Don't waste your time worrying about that.",
      "author": "KiwiTheKitty",
      "created": 1633354045,
      "upvotes": 2,
      "replies": {}
    }
  }
}