{
  "sid": "qnha88",
  "link": "/r/GradSchool/comments/qnha88/tips_for_effective_coherent_class/",
  "title:": "Tips for effective, coherent class participation/speaking skills?",
  "text": "I’m currently enrolled in my first ever graduate seminar (studying part time). I didn’t major in the field of study but I have some background knowledge from having taken a few elective courses during undergrad.\n\nI’m also waiting to get assessed for ADHD (for a number of reasons I won’t get into) but that won’t happen before the end of the semester. Here’s my problem:\n\nA big chunk of our final grade is based on class participation, and my attempts at contributing anything meaningful have been horrible. I do all the readings and jot down ideas that I’d like to share in class, but when the class discussion gets going, I struggle to keep up. Then I end up stuttering and rambling in response to my classmates’ brilliant ideas and sound like I have no idea what I’m talking about. (I did have this problem while doing my undergrad, but it has gotten much worse.) The professor helps me reformulate my thoughts when he notices I’m struggling to convey them. It was particularly embarrassing last class when I noticed two classmates rolled their eyes with their webcams still on.\n\nHas anyone else struggled with this? Do you have any advice? I’m feeling discouraged and disappointed in myself, and can’t stop replaying in my mind the unimpressed looks on my classmates’ faces.",
  "author": "gemini_vegetarian",
  "created": 1636136545,
  "updated": 1637416047,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjgo5nr": {
      "link": "/r/GradSchool/comments/qnha88/tips_for_effective_coherent_class/hjgo5nr/",
      "text": "Do your best, you are meant to be here. You will improve because thats what you did to get to this point. Get you some",
      "author": "Indecs",
      "created": 1636144409,
      "upvotes": 7,
      "replies": {}
    },
    "hjh3j07": {
      "link": "/r/GradSchool/comments/qnha88/tips_for_effective_coherent_class/hjh3j07/",
      "text": "It sounds like your prof is trying to help. Let them know what's going on broadly without details (e.g. I am waiting on a diagnosis that would allow me to apply for reasonable accommodations, but am struggling to participate during class). You already jot down ideas to contribute. I would ask your prof if you could supplement in-class participation with those notes so that you are able to convey ideas clearly while continuing to practice contributing to discussion. \n\nI'm a prof. I would say yes to this request.",
      "author": "Courageous_Chameleon",
      "created": 1636150328,
      "upvotes": 3,
      "replies": {}
    },
    "hjgigwg": {
      "link": "/r/GradSchool/comments/qnha88/tips_for_effective_coherent_class/hjgigwg/",
      "text": "It sounds like you're trying your best in your classes and the professor has been helpful so far! I wonder if your school has an accessibility centre? At my school we have one and students can get accommodations for the classes. Most of these are getting technology to help with classes or a testing room for exams, but I wonder if there could be any accommodations for your class? Like your grade could have less emphasis on participation? If you feel comfortable, you could also tell your professor about your struggles and see if there is anything he would recommend? I find that when professors know more about the situation, they will often help and support students. It sounds like your professor may be able to help somehow based on your description of him!",
      "author": "lindaedith",
      "created": 1636142278,
      "upvotes": 1,
      "replies": {}
    },
    "hjm9hjw": {
      "link": "/r/GradSchool/comments/qnha88/tips_for_effective_coherent_class/hjm9hjw/",
      "text": "It's your first ever graduate seminar! Your feelings are normal. Especially when you're thrown in with people who may have more years of grad school under their belt, or more experience in the field, or what have you. It can be really intimidating, especially at first, but I promise it gets better with exposure and practice. I used to struggle with this too - was always afraid to speak up in class, couldn't always get my thoughts out well, would sweat and shake and feel my heart racing every time. Now that I've been in grad school for a few years, I've gotten the hang of it and feel pretty confident about the things I say in class. (Of course, now that I've reached this point I only have a few classes left to take, lol.) I sometimes get a little bit of a quicker heartbeat with my first comment of the class, especially if I've been in an imposter syndrome slump lately, but it goes away once I get my thoughts out. The thing that has helped me most is developing a belief in myself and my perspective, and actively letting go of the fucks I have to give about what other people think. And it's a process, a life long one, that gets easier over time. But it builds upon itself into a sturdier foundation of intellectual and general confidence, which in turns makes the thoughts I have to share better quality and better articulated. Trust yourself and your knowledge/thoughts! Sometimes it helps if you volunteer to kick off the discussion with one of your prepared thoughts/questions, or speak early on in the seminar. There are some people I'm in class with now who are just starting out who I can tell are nervous about contributing to class discussions, or having a hard time articulating themselves, and I honestly just send them lots of loving solidarity vibes because I've been there, I think most of us have felt or are currently feeling the same way you do! And remember, most people won't remember what you've said or care - most of them are thinking about themselves and their own lives, or their own comments in class. Or they may have heard something you said in class and felt like you were the brilliant one! You are your own worst critic usually.❤️",
      "author": "kasserolepoop",
      "created": 1636245567,
      "upvotes": 1,
      "replies": {}
    }
  }
}