{
  "sid": "qk3wvz",
  "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/",
  "title:": "Where to find Online Masters with Low Requirements",
  "text": "Hi everyone,\n\nTo give a little background, I graduated with a 2.3 GPA in Computer Science (BA) back in 2018. My college life was wrought with both physical and mental issues. Conflict with my family at home, along with my first real sense of independency resulted in quite a train wreck of a GPA.\n\nI have been independent now for about 4 years, working as a software engineer. I've got my own house, own car, and I'm honestly pretty set thanks to the honestly ridiculous salary that software engineers make. My mental issues stemming from my family have been alleviated, owing to many hours of therapy and finally being able to communicate my desires with my family. \n\nFor the past year or so, I have been heavily considering going back to school for a Masters degree. I know from experience that my ability to study and learn is of no issues, since I was able to achieve a great GPA my freshman year of college taking honor classes.I would love to say that my motivations are purely for knowledge, but honestly, it's a gnarly mix of \n\n* Wanting to learn more about topics like Machine Learning/Artificial Intelligence in preparation to advance my career even more.\n* A last \"fuck you\" to some of my family members that still brings up my train wreck back in college once in a while\n\n\nIt seems like most if not all of the good programs require a minimum 3.0 GPA.\n\nFrom what I understand, showing that I have completed another Masters program will greatly improve the look of my application. So my provisional plan is to complete a mediocre or worse online program to prove that I have shit together now, and then apply for something better afterwards. \n\nThe cost is no issue, as my employer has a program that foots most if not all of the bill. \n\nSo my question is, is there any online graduate programs I can apply to with very low GPA requirements? Or maybe my plan is flawed from the ground up?\n\nI am considering Computer Science, Software Engineering, Data Science, or even an MBA as all possible candidates. \n\nAny help would be greatly appreciated!",
  "author": "saltiestRamen",
  "created": 1635731872,
  "updated": 1635780424,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.81,
  "comments": {
    "hiufekl": {
      "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiufekl/",
      "text": "I would urge you not to rush into a program as a \"fuck you\". From your post it sounds like you are less interested in entering a program to learn and more interested in sending message to those around you. You even say yourself that you care very little about the quality or even the field of the program you go into. \n\nIf you are genuinely interested in pursuing further education, I would recommend taking the time to take more undergrad courses to repair your GPA to the point where you can get into a decent program. Look around and see if there is an institution that will allow you to take senior undergrad courses in the areas you are interested in. This will allow you to both get a better idea of the types of grad programs you may be interested in pursuing and to repair your GPA.",
      "author": "Laovvi",
      "created": 1635737160,
      "upvotes": 34,
      "replies": {
        "hiuggqw": {
          "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiuggqw/",
          "text": "Agreed. Any program will likely be difficult if you are not entering for the right reasons, regardless of intelligence or skill. \n\nAlso, I would suggest you get research experience (volunteer at lab/under a PI for a year, get publications/posters). Research experience is highly valued and with publications/explanation, they may accept you even with a lower GPA. It will be faster, demonstrate commitment to the field, and be more impressive (research under a good lab vs degree from non accredited or less than reputable school - many online masters with low requirements lack basics such as accreditation).",
          "author": "Dismal-Wallaby-2",
          "created": 1635737722,
          "upvotes": 4,
          "replies": {}
        },
        "hiugz91": {
          "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiugz91/",
          "text": "Thanks for the reply!\n\nI mentioned the \"fuck you\" as a motive, but it's definitely not the primary motive. My primary motive is still to learn, and progress my career.\n\nI considered taking undergrad courses to repair my GPA, but my employer will only pay for courses that go towards either a certification or a degree. \n\nTo clarify, I plan on taking 2 master's degrees. The first one with a low bar of entry that's related to computer science, so I can prove that I am \"ready for education\", and a second one where I will actually pick a particular program, relevant to the field I want advance towards. \n\nSo in reality, the first masters will only serve as a GPA boost. I figured that this is preferable to retaking several upper undergrad courses, especially if I need to pay out of pocket for the undergrad courses.\n\nAs for my varied selection of possible fields that I've listed, I figured that I might as well cast the net wide on the first masters, if the goal was just to get one to boost my GPA.\n\nI hope that make sense. I am definitely not rushing into a 2 year commitment out of spite or vindication. But as a means to boost my GPA, and to apply to a top tier program afterwards.",
          "author": "saltiestRamen",
          "created": 1635737990,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hiuh7lr": {
      "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiuh7lr/",
      "text": "My brother had a low GPA in undergrad computer sciences and decided he wanted to get a masters degree a few years after working in the industry. He cold called the comupter science admissions department at the closest university and ended up talking to the head of the department. They let him in conditional on getting good grades his first semester. It ended up as a really good fit and he was better off than a lot of his peers because of what he learned in the field. If you're really interested in a program, give them a call and see if you have options. Some programs don't care about GPA.",
      "author": "gobstoppable",
      "created": 1635738115,
      "upvotes": 10,
      "replies": {
        "hiuhh7a": {
          "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiuhh7a/",
          "text": "That's quite the uplifting news to hear.\n\nI will see if I can reach out to a department in a school nearby and see what they might say.\n\nThank you!",
          "author": "saltiestRamen",
          "created": 1635738261,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hiugs6a": {
      "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiugs6a/",
      "text": "My first suggestion follows u/Laovvi 's, but there are a couple of options there.  Figure out what your dream program is and why want to go to grad school.  While it may financially be covered, my experience is that it takes a huge investment of time and effort as well.  Grad school cost me some of my friendships and totally changed my lifestyle.  In the end, it was absolutely worth it to me, but something you should consider.  \n\nOnce you establish the program and school(s), see what their requirements are.  There is a chance (especially if it is a different discipline or has been a while) that you will need to take some levelling classes which will give you the opportunity to raise your GPA.  Even if that isn't the case, and you don't bring up your GPA, you should still apply.  In your application essay, address what went wrong.  Explain why your GPA was low, how the situation is changed, and give examples of your career successes despite the low GPA.  There is a chance that you could get accepted conditionally, where they expect you to make a certain GPA in your first year or in a certain number of hours.  \n\nIf that doesn't work and/or you still would prefer to do an \"other\" program, SMU has a decent online AI program, and SNHU has a decent comp sci program which you could probably get in to.",
      "author": "Feistyfifi",
      "created": 1635737886,
      "upvotes": 2,
      "replies": {}
    },
    "hiv5lac": {
      "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiv5lac/",
      "text": "Another pathway would be to study through articulation. Complete post grad certificate then diploma to finally articulate to masters.",
      "author": "Jason_SYD",
      "created": 1635758078,
      "upvotes": 2,
      "replies": {}
    },
    "hivr261": {
      "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hivr261/",
      "text": "I graduated college with a 2.9 GPA due to similar circumstances. I was basically told any future grad school aspirations were a pipe dream, and I wanted to go back for a totally different major based on my professional experiences. I took night classes and really sought to show I was a better student than my undergrad years. Not only did the night classes pay off, I got into my dream program as a result. You are not limited, and I urge prudence before any rash decisions.",
      "author": "WretchedHiveScum",
      "created": 1635773426,
      "upvotes": 1,
      "replies": {}
    },
    "hivzu2q": {
      "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hivzu2q/",
      "text": "Many colleges have non degree student options. Take a few classes, prove you can do it, then apply as a degree student. Good luck.",
      "author": "iloveregex",
      "created": 1635777634,
      "upvotes": 1,
      "replies": {}
    },
    "hiu7kwe": {
      "link": "/r/GradSchool/comments/qk3wvz/where_to_find_online_masters_with_low_requirements/hiu7kwe/",
      "text": "Following",
      "author": "kimmykimbo",
      "created": 1635733017,
      "upvotes": 0,
      "replies": {}
    }
  }
}