{
  "sid": "qw4i1e",
  "link": "/r/GradSchool/comments/qw4i1e/getting_tired_of_trying_to_stay_on_all_the_time/",
  "title:": "Getting tired of trying to stay “on” all the time— anyone relate?",
  "text": "This is mostly venting I guess. In addition to being a PhD student working on my thesis project, I’m also president of a campus organization and I am on 4 committees in my program or department. I’m fortunate to have roles where I can gain leadership experience but it’s starting to get really exhausting to stay on top of everything and trying to communicate with everyone and being the positive one in the group. I didn’t even want to be in these positions. But I was asked to take them mainly because nobody else would take them or do the work. I’m so tired of trying to get others to participate but I also don’t want to see any of these committees or the organization fail. I’ve gotten good at “turning on” the charismatic and positive leadership persona to try and keep pushing projects/our goals forward, but honestly I’ve been getting really depressed and overwhelmed lately and don’t know if I can keep this act up along with doing my own thesis research. I know I need to get better at saying No to people and time management, and trying to get a therapist (although getting mental health services at my school requires so much work). Not really looking for advice but can anyone relate?",
  "author": "forget-me-not12",
  "created": 1637170632,
  "updated": 1637182612,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hl0lrl1": {
      "link": "/r/GradSchool/comments/qw4i1e/getting_tired_of_trying_to_stay_on_all_the_time/hl0lrl1/",
      "text": ">I know I need to get better at saying No to people and time management,\n\nYes. At first in grad school, it can be exciting when people ask you to do things. But if you always say yes, at some point you're going to be overwhelmed. Because if you're any good, you're going to get more and more opportunities.\n\nIf you feel like you've taken on too much committee work, there's no shame in resigning from one of the committees and say you need to focus more on your research and coursework.",
      "author": "raistlin65",
      "created": 1637172840,
      "upvotes": 5,
      "replies": {}
    },
    "hl0nw0v": {
      "link": "/r/GradSchool/comments/qw4i1e/getting_tired_of_trying_to_stay_on_all_the_time/hl0nw0v/",
      "text": "i know you’re not looking for advice so I’ll try not to go there, but offer my personal experience. :p all I can say is that this was me for about 12 years straight, when I was a student/student-scholar and community organizer. At one point i was the youngest board member in a room full of retirees, trying to make a difference. it’s a very lonely and exhausting space, and I almost flunked out of college before an academic advisor intervened, had tenuous relationship with my partner at the time, and my parents. I burnt out. It’s the reason I’ve become more selective about where I invested my time as a MS, now PhD student. So I COULD relate, but I also just want to be real. There’s a reason why flight attendants ask you to put your mask on first before helping others, in case of emergencies. The “cause” can’t afford to lose well-meaning individuals who want to make a difference because they burn out. It’s a marathon, not a sprint.",
      "author": "AccioAddie",
      "created": 1637173670,
      "upvotes": 2,
      "replies": {}
    },
    "hl0tnx3": {
      "link": "/r/GradSchool/comments/qw4i1e/getting_tired_of_trying_to_stay_on_all_the_time/hl0tnx3/",
      "text": "Oh yeah I can relate. I was president of our professional Org's student chapter and on committees at the national level in the beginning of grad school. We're a small school, so I ran for president of the org unopposed and I was replacing a president who had been running the show for multiple years. We did good stuff, helped get students to conferences, even won a national award. But I absolutely knew I couldn't do multiple years of that or I would either burn out or be in grad school for like 4 extra years. The temptation was to do it for multiple years like the student before me. But I stepped out and someone else took over the club and I absolutely made the right decision.",
      "author": "AMostAverageMan",
      "created": 1637175923,
      "upvotes": 1,
      "replies": {}
    }
  }
}