{
  "sid": "qrz7n7",
  "link": "/r/GradSchool/comments/qrz7n7/which_one_of_these_options_seem_like_the_wisest/",
  "title:": "Which one of these options seem like the wisest choice?",
  "text": "I need some help in getting my thoughts straight and would love everyone’s opinions/ideas! \n\nLast year, I graduated with a BA in psychology. About halfway through it, I fell in love with creative writing (specially nonfiction), and took a buttload of writing courses. I even worked my way up to taking an MFA level memoir course. Even though my GPA for writing courses averaged out to a 3.8, I ended my psych degree with a cumulative GPA of 2.83. \n\nI applied to that same university’s MFA in Creative Writing program for nonfiction. Didn’t get in, and was informed by faculty that although my writing samples were strong, it was ultimately my low GPA that led to my rejection. \n\nSo now, I’m looking for masters programs that will accept GPA’s below a 3.0, so I can rewrite my undergraduate one entirely. I found two programs that spark my interest, but are in two different disciplines. This is what I’m conflicted on: \n\nDo I earn a MA in English, allowing me to teach the subject at the K-12 level, and pursue an MFA in creative writing after? \n\nOR \n\nDo I earn a MA in Creative Writing, allowing me to ‘prepare’ for an MFA later?\n\nBasically, all the MFA programs I desire require a 3.0 or higher, and the ones that don’t seem a little shitty. I need to rewrite my GPA somehow get into one I want. \n\nIt seems like the MA in English is safer job-wise, but the MA in Creative Writing sounds more interesting and fun. \n\nSorry this was long.. I’m curious to hear what option you would pick and why!",
  "author": "stolascreature",
  "created": 1636677334,
  "updated": 1636745980,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hka2o49": {
      "link": "/r/GradSchool/comments/qrz7n7/which_one_of_these_options_seem_like_the_wisest/hka2o49/",
      "text": "What did you want to do with the MFA? I think that makes a difference as to your decision.",
      "author": "raistlin65",
      "created": 1636682043,
      "upvotes": 1,
      "replies": {
        "hka3om8": {
          "link": "/r/GradSchool/comments/qrz7n7/which_one_of_these_options_seem_like_the_wisest/hka3om8/",
          "text": "Write a memoir! I have trouble sitting down and writing unless someone/something is holding me accountable, so I feel going to school is the only way to do it",
          "author": "stolascreature",
          "created": 1636682521,
          "upvotes": 1,
          "replies": {
            "hka431u": {
              "link": "/r/GradSchool/comments/qrz7n7/which_one_of_these_options_seem_like_the_wisest/hka431u/",
              "text": "I meant what do you want to do with the MFA once you have it? What's your career plan?\n\nPeople who get MFA's generally do it because they want to be writers as a lifelong career. Or some of them want to teach in academia.",
              "author": "raistlin65",
              "created": 1636682705,
              "upvotes": 1,
              "replies": {
                "hka48tq": {
                  "link": "/r/GradSchool/comments/qrz7n7/which_one_of_these_options_seem_like_the_wisest/hka48tq/",
                  "text": "I would like to teach in academia",
                  "author": "stolascreature",
                  "created": 1636682778,
                  "upvotes": 1,
                  "replies": {
                    "hka4w2s": {
                      "link": "/r/GradSchool/comments/qrz7n7/which_one_of_these_options_seem_like_the_wisest/hka4w2s/",
                      "text": "Then if you get the MA in creative writing, you would have the option of applying for an MFA program or PhD program in creative writing. And you don't have to figure out which of those two options are best to you now. You'll have a better idea once you've been in an MA program for a year.\n\nAnd once are in that MA in Creative writing, no one's going to care about your undergraduate GPA anymore.",
                      "author": "raistlin65",
                      "created": 1636683075,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}