{
  "sid": "qzb460",
  "link": "/r/GradSchool/comments/qzb460/seeking_an_advice/",
  "title:": "Seeking an advice",
  "text": "I need help. I have been doing pretty well in my grad program since I started. Held a solid 4.0 for the first 2 semesters. Had a family member pass away over the summer due to COVID, and I've not been ok since then. Scraped by with Cs over the summer, and I think I'm failing all 4 classes I'm taking this semester.\n\nI don't even want to put my professors in the awkward position of stopping by their office hours and explain how depressed I've been lately.\n\nI literally started this semester with all assignments and papers at 100%, and thought I was all good and done with the griefing process. Well, that didn't last long. It got so bad, that I stopped submitting anything. Just kept attending the lectures with minimal interaction with anyone in the class.\n\nI feel like I'm in a cycle that I can't break out of, and it's freaking me out how far out of control this goal of mine have spiraled.\n\n3 weeks until finals week. Not sure what to do and how to pick my weight back up. Please advise. Thank you.",
  "author": "NegNancyButCool",
  "created": 1637549138,
  "updated": 1637689796,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hllz5q9": {
      "link": "/r/GradSchool/comments/qzb460/seeking_an_advice/hllz5q9/",
      "text": "Please talk to your advisor and your professors. It is completely normal and okay to not be able to keep up with classes when you've suffered the loss of a loved one. Tell them what happened with your grades, maybe they can take that into account for your C's, but then consider taking time off from your program if you can. You need time to heal and get past your loss.",
      "author": "keeper4518",
      "created": 1637562002,
      "upvotes": 1,
      "replies": {}
    },
    "hln6iq5": {
      "link": "/r/GradSchool/comments/qzb460/seeking_an_advice/hln6iq5/",
      "text": "Well, you have a valid reason. Just tell them and request for a grade petition as well.",
      "author": "moonlighttengu",
      "created": 1637592718,
      "upvotes": 1,
      "replies": {}
    }
  }
}