{
  "sid": "qg9u98",
  "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/",
  "title:": "Do you consider literature review a form of research?",
  "text": "Context being I'm in one of those notoriously productive online debates and am arguing that calling reading papers on a topic is not under the same heading as research. From my perspective that's a definition that we tell high schoolers to make them feel better about their science class. While half asleep I decided to respond, admittedly unclearly, to a post lambasting the idea that we should discourage the idea that reading things on google is research. \n\nMy argument was essentially, no it's not research, but you could reasonably call it literature review. Ignoring the questionable quality of the vast majority of sources people who perform \"internet research\" use. \n\nSo I'm asking the community is a literature review a form of research under your personal definition. \n\nIf you say yes it is research, I'll concede defeat and that my personal definition is not used by the wider community. If you say no, I'll wave my flag and proudly proclaim I've won the internet. \n\n[View Poll](https://www.reddit.com/poll/qg9u98)",
  "author": "dmatkin",
  "created": 1635264702,
  "updated": 1636201723,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.6,
  "comments": {
    "hi4t0na": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4t0na/",
      "text": "Real literature review is more than just summarizing the concepts, it's noticing some trends and making predictions about directions in the future. Good literature review will give you more information that reading each of the cited papers. So yeah, that's research. It generates new ideas.",
      "author": "blueflovver",
      "created": 1635266413,
      "upvotes": 64,
      "replies": {
        "hi4tnj0": {
          "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4tnj0/",
          "text": "I like that, it's certainly the best argument I've seen in favor. I'd discount it cause I consider research generation of new knowledge.\n\n&#x200B;\n\nI am also admittedly biased to push the definition in such a way that googling shit can't be legitimately considered research. And without a really strict definition I can google mood lander hoaxes and generate new ideas, predicting future hoaxes. Making it technically able to be research. \n\nLiterature review is important and essential to research, but not the thing itself. At least the way I see it. It's like gassing up your car is essential to driving but it's not driving itself.",
          "author": "dmatkin",
          "created": 1635266663,
          "upvotes": 3,
          "replies": {
            "hi4uygf": {
              "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4uygf/",
              "text": "I don't know, I come from STEM so what you say makes sense to me but then there are humanities, are you arguing most people in humanities are not doing research? 🤭",
              "author": "blueflovver",
              "created": 1635267169,
              "upvotes": 14,
              "replies": {
                "hi4w162": {
                  "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4w162/",
                  "text": "I don't think I am, I certainly don't want to. I'm a EE PhD student so I share your stem background. But as far as I'm aware they do more than just literature review. Like I'd toy with \"Research is any activity which leads to the generation of new knowledge or ideas that benefit the collective they are associated with by contributing to the body of knowledge\". Although  I'd prefer to be less wordy.",
                  "author": "dmatkin",
                  "created": 1635267585,
                  "upvotes": 4,
                  "replies": {
                    "hi52ltj": {
                      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi52ltj/",
                      "text": "Sounds good to me 👍",
                      "author": "blueflovver",
                      "created": 1635270166,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hi6b4tq": {
          "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi6b4tq/",
          "text": "> Good literature review will give you more information that reading each of the cited papers\n\nBut 90% of the time the lit review authors will either lie by omission or bend the truth of what happened in the papers they're reviewing, so you should go ahead and read the cited papers anyways.",
          "author": "NoComfortable7128",
          "created": 1635287919,
          "upvotes": 1,
          "replies": {
            "hi6c18z": {
              "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi6c18z/",
              "text": "Yeah most of lit reviews are really bad, I usually like intros to dissertations more when I need basics of some topic, I find them more reliable (but at the same time not bringing anything more than what's in the papers).",
              "author": "blueflovver",
              "created": 1635288317,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4z89m": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4z89m/",
      "text": "Research means a systematic investigation, so I would consider a literature review (a real one, not a google search) to be research. Part of the point of a lit review is to systematically go through existing knowledge, analyzing and synthesizing it in order to find gaps in knowledge. It requires a fair bit of critical thinking and analytical skills, so a good literature review should not be undervalued. \n\nPersonally, I don't see the value in gatekeeping things like this and I don't really see what purpose this conversation serves. If anything, it seems like it's an excuse for people to feel superior about what they do because what they do is \"real\" research while what others do is of lesser quality. \n\nA google search can be research, but that doesn't mean it's the same quality as an academic literature review. A McDonalds Hamburger and one prepared by Jacques Pepin are both hamburgers, but presumably vastly different in quality. Trying to define what a hamburger is to exclude McDonalds hamburgers would be an extremely puzzling thing to do. Why not instead focus on what constitutes a good literature review and what constitutes a bad one?",
      "author": "False-Guess",
      "created": 1635268844,
      "upvotes": 21,
      "replies": {
        "hi51i9i": {
          "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi51i9i/",
          "text": "That is a very good point, but I think it denotes a gap in language for denoting degrees in quality. For example if Mcdonalds started offering fancy sounding meal like say \"Bourbon Pecan Chicken\" (I googled for fancy dishes and it looks lovely) and a person offered to take you out for it as a very special dinner, not specifying the restaurant. You might be justifiably peaved when you pull up to the golden arches. \n\nFor the same reason, I believe it is technically correct to say googling around is research. It lends an air of unearned credibility to research of lower quality. My personal definition which I'll concede turned out to not correspond to the one in most peoples heads attempts to create a split that removes unearned credibility. Such that it doesn't gate keep performing experiments, gathering data, and drawing conclusions to academics, but doesn't allow google searches to sound as credible as a degree in a topic.",
          "author": "dmatkin",
          "created": 1635269735,
          "upvotes": 0,
          "replies": {
            "hi5bvc2": {
              "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi5bvc2/",
              "text": "It's silly to have to redefine the word research for this issue imo. \n\nIf the issue is people trying to assume credibility by citing terrible research, well, best you can do is to make sure more people understand how to check their sources and see the difference between good and bad research. If not, at least they should know some basics like: research by an expert in the field is more valuable than a non-expert, and to check the hierarchy of evidence to see the differences between different study types.",
              "author": "Nighto_001",
              "created": 1635273825,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4zugy": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4zugy/",
      "text": "Reading and evaluating papers are research *skills*. Combined with some other research skills, you can produce novel research built primarily on literature review. \n\nBut, reading papers itself is not research, just as growing bacteria in a petri dish is not itself research. \"Doing research\" is about intent to produce new knowledge.",
      "author": "aggressive-teaspoon",
      "created": 1635269087,
      "upvotes": 5,
      "replies": {
        "hi55xms": {
          "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi55xms/",
          "text": ">\"Doing research\" is about intent to produce new knowledge.\n\nI think that is then the crux of the issue. \"Research is any action undertaken with the intent of producing new knowledge\"",
          "author": "dmatkin",
          "created": 1635271479,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hi4thzz": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4thzz/",
      "text": "A systemic or other-wise thorough of relevant peer-reviewed literature by a trained expert in the field is definitely research.   \n\n\nBut I dont think thats ultimately whats relevant here. Trained (relevant) expert reviewing scientific literature  =/= Amateur trying to read some papers =/= amateur reading secondary sources. Its tiered.",
      "author": "Collin_the_doodle",
      "created": 1635266603,
      "upvotes": 6,
      "replies": {
        "hi4txiw": {
          "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi4txiw/",
          "text": "True, and I'd like to include that in my definition. But I can't find a way to include it that doesn't end up making googling shit a legitimate form of research. Maybe I've spent too long around legal students but I want my definition to hold up under misuse. Which is why I only include the generation of new knowledge in my personal definition. I'm sure there's ways to abuse it but its the best I've been able to think of.",
          "author": "dmatkin",
          "created": 1635266771,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hi59361": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi59361/",
      "text": "Generating new knowledge is sth. you perform in your head using certain cognitive tools. One kind of tool might be performing experiments; another might be critically reading other researchers' papers. Of course, just googling papers would not count as research in the same way that gathering your reactants to make a reaction is not research either. That might be only the starting point of research, but not research in itself. That being said, most people overestimate the value of experimental work because it takes so long or it's such an effort or it's so expensive. But it is not necessarily better (from the cognitive point of view) than sitting and studying papers.",
      "author": "queenlorraine",
      "created": 1635272724,
      "upvotes": 2,
      "replies": {}
    },
    "hi5dg1k": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi5dg1k/",
      "text": "I guess it depends what you consider research. Broadly I’d assume it’s an “investigation” of anything, which would include both wet lab work and literature review. \n\nLiterature review is just as important of a component for my research at work (Chem in industry) as is the project itself. Can’t have one without the other, other wise every proposal would be more blind guess work rather than trying to apply a method.",
      "author": "kayabusa",
      "created": 1635274442,
      "upvotes": 1,
      "replies": {}
    },
    "hi6fauq": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi6fauq/",
      "text": "If it's billable hours, it's research.",
      "author": "TehDing",
      "created": 1635289772,
      "upvotes": 1,
      "replies": {}
    },
    "hi81vgz": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi81vgz/",
      "text": "literally just got hired to do literature review for a prof today this is freaky",
      "author": "jewishibs",
      "created": 1635322475,
      "upvotes": 2,
      "replies": {
        "hifi73w": {
          "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hifi73w/",
          "text": "damn this is a weird twist of fate!!!!\n\nyou wouldn't happen to be involved in any academic institutions or frequent any online academic websites to chat or seek academic work would you?\n\n&#x200B;\n\n:D",
          "author": "NeedEvolution",
          "created": 1635454846,
          "upvotes": 1,
          "replies": {
            "hifsndg": {
              "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hifsndg/",
              "text": "huh",
              "author": "jewishibs",
              "created": 1635459321,
              "upvotes": 1,
              "replies": {
                "hig4b45": {
                  "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hig4b45/",
                  "text": "You said it was freaky and I was speaking tongue in cheek. Because you are in an academic sub, where we talk about academia, and you are probably in academia, and sought out an academic job, meaning it isn't as freaky as you might think.",
                  "author": "NeedEvolution",
                  "created": 1635464686,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi7knsc": {
      "link": "/r/GradSchool/comments/qg9u98/do_you_consider_literature_review_a_form_of/hi7knsc/",
      "text": "Research doesn't refer to a single action of knowledge generation, it's a process.\n\nSystematic reviews, meta analysis, content analysis, thematic analysis, narrative analysis, etc. Are all approaches to research or steps of a research process that come from reading preexisting text. The first two explicitly refer to reviewing prior research.\n\nThere's a difference between reading to gain knowledge and reading to synthesize and organize that knowledge or its context in a systematic way that yields new information. Most laypeople probably aren't doing the latter. But yeah literature reviews are part of the research process, consist of more than just \"reading things on Google.\"",
      "author": "Bugsnatch",
      "created": 1635309523,
      "upvotes": 1,
      "replies": {}
    }
  }
}