{"sid": "ms1ui9", "link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/", "title:": "Professor sees my passivity as negligence and believes I should be panicking. Except I am, but it’s internal.", "text": "We seem to have a lot of these strange communication behaviour misunderstandings. \n\n\nThis is my thesis year, and although I’ve been struggling a lot, he sees my general demeanor as someone who doesn’t care, is lazy, and is wasting his time. \n\n\nIm tired of him waving all sorts of threats over my head. “You might not finish”; “why aren’t you struggling”; “you say you understand but you don’t”.\n\n\nI can’t help but feel that the best thing to do or happen would be for me to simply collapse on his lap, so that he can believe that I am indeed feeling the pressure. I’m in therapy once a week, deep mental issues going in my family, about to start acupuncture to work with my stress-related chronic pains, trying to get a part-time job to I can get some form of security. \n\n\nDeep inside, I know that he is also a human being, and knows my life doesn’t revolve around my research. I know he wants me to do more, but each time I do more, he tells me it’s meaningless because it’s not done in the right way. I’m stuck between not moving and making a move risking it being totally wrong and getting scolded for it.\n\n\nReddit, I looked him dead in the eye and considered telling him that I’d save him the time and simply drop out. I’m exhausted. \n\n\nThank you for reading.", "author": "duascoisas", "created": 1618575159, "retrieved": 1632845951, "over_18": false, "upvotes": 338, "upvote_ratio": 0.98, "comments": {"gv6mb5j": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gv6mb5j/", "text": "You all, thank you for the awards! I was just venting, but this community has been so kind to me! \n\n\nI’ve since communicated more with my professor, have been having a lot more meetings, and are taking things reeeeeally slowly. I’m also trying to sleep early, do yoga, breathing exercises etc so I can better regulate my emotions and be able to communicate under pressure. \n\n\nI’m really grateful for this community. Grad school is hard as fuck you all.", "author": "duascoisas", "created": 1618910935, "upvotes": 1}, "guwhhs4": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guwhhs4/", "text": "Talk to your PI. This whole thing is misunderstanding in both directions. Email them and say you want to schedule a meeting to talk about your work experience. In person or over a video chat. \n\nTell them you know they’ve been worrying about you. Cite specific incidents. Tell them how you’re feeling. I told my boss I go to weekly therapy sessions and it helps me focus because I unload those burdens.\n\nIf you’re feeling overwhelmed but just internalizing it, tell him that (and also work on getting it out productively). \n\nIn the best light, they want to see you succeed and you’ve admitted you have a lot going on emotionally that is complicating the situation. \n\nPart of it is process, part of it is results. If your PI disapproves of how you seem to be working, then I don’t really see that as a big deal. And tell them that. If you’re comfortable with how you’re working and making progress, tell them that. On the other hand if you agree that you’d like to make more progress but you’re struggling, tell them that! They could help you set attainable goals. \n\nIn the end, it’s about the results. If you’re making progress on your work, then your PI needs to see your process is working well enough. On the other hand, if you are struggling to meet reasonable expectations because of extenuating circumstances, I think your PI might be able to help. Or at least hear where you’re coming from.", "author": "frausting", "created": 1618694143, "upvotes": 1}, "guw9lq8": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guw9lq8/", "text": "I've never met a person who is lazy, I have met many people who are struggling with some internal difficulties, making it appear they are lazy. Do you have anyone to share with?", "author": "PeaceAndPrajna", "created": 1618690767, "upvotes": 1}, "gut9y0s": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gut9y0s/", "text": "Oof, you need to talk with your prof and set boundaries right now.", "author": "exmachinalibertas", "created": 1618639299, "upvotes": 1}, "guspmmm": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guspmmm/", "text": "Dear OP, my sympathies for the place you're in. It's awful having to share your struggles with anyone because sometimes it doesn't translate to words, but a professor such as this can worsen how you're already feeling. I've been there and I'm so enraged at the insensitivity you're having to contend with. Should you choose to share your struggles, please do so via an email so there is a record of you reaching out for help, because often times these profs get away with \"Oh, you could have just asked for help!\" after they  make themselves unavailable. All the best. I hope you get through this.", "author": "jroy_95", "created": 1618625927, "upvotes": 1}, "gusj61e": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusj61e/", "text": "I’m feeling the same way. I’m finishing my master degree in a few months and I’m feeling rather passive towards finishing it. I felt lots of pressure throughout the years and had a couple of anxiety attacks cause I thought I wouldn’t be able to produce good enough work. Now I’m just taking it easy and not letting stress take the best of me. I’m lucky to have an understanding supervisor though. Find someone in the faculty you can talk to, maybe someone within the department who can give you good advice on how to handle this situation. Hope things work out for you.", "author": "ninhny", "created": 1618622368, "upvotes": 3}, "gusds9f": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gusds9f/", "text": "Are you sure that's really how he sees you or is that your interpretation? It honestly sounds like he's trying to motivate you and to see that you're taking it seriously and doing the things you need to do to succeed. He doesn't want you to drop out he wants you to succeed and finish (as far as I can tell from reading this of course). If you are doing things the \"wrong way\" the solution isn't to be stagnant and afraid to fail, it's to take action and ask about how to do things better. You can do this! You've gotten this far, right?", "author": "Ceej640", "created": 1618619409, "upvotes": 0}, "gurr57b": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gurr57b/", "text": "The reality is — some people believe everyone has to work hard as they “thought” they did. But OP, things may come more naturally to you than they did to him — and it can a case of “downwards jealousy.” Even if you were lazy — is the work you’re doing incorrect or lacking in some theoretical/applied soundness? Is it just boring, or is it *just enough but not more*? \n\nOr it could also be that they feel like to be worthy of a PhD, maybe more so a “competitive” one representing as his mentee/pupil, he is expecting more?", "author": "StreetBug8523", "created": 1618607745, "upvotes": 4}, "gurd7d5": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gurd7d5/", "text": "Everyone panics. Your professor does too. Everyone does, even your professors. Everyone in life does. Take it one small step at a time and go from there. You got this.", "author": "Boydey", "created": 1618601423, "upvotes": 1}, "gur2wwp": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gur2wwp/", "text": "I panic giggle to similar effect. A bit like the kid on the simpsons. Had similar issues with teammates and supervisors-- eventually I became self aware enough to figure out what was going on and I started leting people know what was going on in my head when that happens. It helped...", "author": "wickzer", "created": 1618596777, "upvotes": 2}, "gur1dde": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gur1dde/", "text": "Sounds like an asshole to be honest", "author": "Extreme_Pomegranate", "created": 1618596098, "upvotes": 4}, "gur0vwa": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gur0vwa/", "text": "I went through the same feelings. I remember staring at my email app paralyzed because of fear and anxiety. I would bargain with myself to reach out at x time, then pussy out. The only advice I can give you is that the fear is worse than the act. Once I came to terms with that I was ok. Good luck man", "author": "Rascal_Ralts", "created": 1618595885, "upvotes": 1}, "guqzstc": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqzstc/", "text": "I can relate to this....I get the impression my supervisor thinks I'm being lazy and uninterested and as if I'm way over my head with completing on time....but the truth is I panicking on the inside but I have so many health problems that are stacking up lately and my supervisor is only making things worse and I just can't focus anymore. I don't understand this logic because its a lose lose....its similar to people in pain because if your whining too much your begging for sympathy or annoying and if you don't say anything people assume your faking it to get an easier treatment.", "author": "PSFREAK33", "created": 1618595412, "upvotes": 2}, "guqx8yg": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqx8yg/", "text": "> I’m stuck between not moving and making a move risking it being totally wrong and getting scolded for it.\n\nThis really shouldn't be much of a dilemma. Doing something wrong and getting scolded for it is nothing to be afraid of. In fact, it's a learning opportunity, which is the whole reason you're in grad school.\n\nDoing nothing, on the other hand, can only accomplish nothing.", "author": "yerfukkinbaws", "created": 1618594292, "upvotes": 1}, "guqtqrd": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqtqrd/", "text": "This sounds *remarkably* like my experience writing my masters' thesis, to the point where I'm having a hard time writing a civil comment and not just angry, incoherent rambling, lol. So, you're not alone! A few thoughts:\n\n1) his method of communicating, from what you're quoting here, is unhelpful *at best* and probably highly toxic (threatening you and criticizing what you do right after he tells you do more is not acceptable behaviour). So, I will say, as someone who's been in your position: It's not your fault. \n\n2) I don't think you collapsing in a heap of panic in front of him will help anything, and frankly (from my own experience) I'd be worried about him using that sort of vulnerability against you. What you could do is have a meeting with him, or ideally with him and your committee and/or the department grad chair, to nail down a timeline and specific goals and expectations that you both then stick to. Your other option is simply to keep your head down and push through, do what he tells you as best as you can, do what you think is best for the thesis, and try to get through.\n\nI'm not going to tell you not to drop out if things become too much, but please don't drop out just because of this guy. You're so close, you've made it this far which means you're plenty capable, and you deserve to get your degree despite someone's shitty communication style.", "author": "Mad_Cyclist", "created": 1618592770, "upvotes": 4}, "guqpu2v": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqpu2v/", "text": "First of all, Do not drop out! That is not the solution! And please do not bottle up all these emotions! You could end up exploding and saying things you might later regret! I think you should be honest with him and tell him exactly how you are feeling, mentioning every single thing you're doing to be able to finish your thesis. I would write and email him a letter telling him as professionally as possible how you feel. I say writing is best since you read over it and edit it as much as you want to. Do not be afraid to send it once you are comfortable with everything you expressed in it.\n\nI recently had my first-year annual review, and I wrote in my progress self-report how I am doing everything in my power to get through with this semester. I explained the multiple and never-ending issues I've had, and how much I want to be in this program. Two current professors and even my potential advisor contacted me to check on me and offer their help. I cannot thank them enough! \n\nI encourage you to be honest and hopefully this will get resolved. I wish you the best!", "author": "lebohardwitztyle", "created": 1618591098, "upvotes": 5}, "guqikyz": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqikyz/", "text": "I'm sorry you're not getting any affirmation from your advisor. Sounds like you're doing all you can, and your advisor just isn't a very good mentor tbh. He might legitimately think he's being motivational. \n\nMaybe this isn't great advice, but maybe meet with him less? Or take command of the conversation and don't let him guilt trip you. Idk.\n\nFor what it's worth, sometimes I wish my advisors would tell me if I should be panicking or not. I'm still convinced when they say \"you're making good progress!\" they're lying lmao.", "author": "wildernesspizza", "created": 1618588004, "upvotes": 3}, "guqa9mg": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guqa9mg/", "text": "I just wanted to say that I have been in the exact same position. \"You're not doing enough! You're not serious enough! You're not setting yourself up for success! You're not going to find a job! \" \n\nAt some point, my advisor and I hit a breaking point. It was over a dumb mistake. She told me I wasn't taking things seriously and I had ruined the relationship she worked so hard to cultivate with the department (which wasn't true). I low-key exploded and explained that I was taking things so seriously I hadn't slept in several nights and was having several panic attacks a day.  And I think that was pretty eye-opening for her. \n\nIt took a breaking point for me to have that conversation with her, but that was ultimately the only thing that helped. It hasn't solved the problem...just yesterday I got scolded for focusing on the wrong things and failing to produce enough \"key deliverables.\" But it did help. \n\nMaybe it's worth having a conversation. I think that the issues my advisor and I have are rooted in our VERY different personalities, which can only really be resolved through communication. Maybe your situation is similar. \n\nGood luck.", "author": "kewlkatakan", "created": 1618584410, "upvotes": 17}, "guq91ii": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq91ii/", "text": "Hello. As a professor and having been a PhD student once, I understand the pressure you're under and both sides of how this dynamic can play out. First of all, I want to say I am sorry you are going through so much and that you and your advisor seem to be having serious communication issues.  \n\nIt seems to me that it would be good for you to take a step back and reassess what the options look like in terms of taking care of yourself and getting your work-life balance and your PhD back on track. Can you take a break or leave of absense? If not, is it possible for you to break down your current research project(s) into small steps you can accomplish? Being paralyzed by the fear of being scolded or getting it wrong can lead to a vicious cycle; after all, we only learn by making mistakes, and it's important to take things one step at a time.  \n\nI don't know much about your advisor, but do remember whoever is your boss now or in the future is also a flawed human being, and they're probably trying to help out, guide you through the work and push you to complete it, even if they're doing so in a misguided and limited way. \n\nIt sounds to me like you are somewhat intimidated by your advisor and don't feel comfortable sharing your situation with them (I was there once, too). As much as possible, it is important that you sit down with him and tell them what is going on and how you feel. If you don't feel comfortable doing this one on one, maybe there's someone who can act as a mediator in this.  Overall, I think coming up with a way to navigate this with your advisor and coming up with a plan might help, but what do you think?", "author": "vanoroce14", "created": 1618583876, "upvotes": 35}, "guq240d": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/guq240d/", "text": "Fuck any PI who thinks there is bandwidth left for acute outwardly expressed panic.", "author": "MercuriousPhantasm", "created": 1618580729, "upvotes": 106}, "gupzvde": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupzvde/", "text": "“Deep inside, I know that he is also a human being, and knows my life doesn’t revolve around my research.”\n\nHunny, I regret to inform you that you are in academia. Faculty are obsidian soulless carnivorous beasts that feed off the soul of obsequious desperate anxious graduate students. They starve without you saying “oh yes, I will absolutely do this professor, my soupologius, I love u daddy ❤️.”", "author": "Thecatofirvine", "created": 1618579644, "upvotes": 70}, "gupykm1": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupykm1/", "text": "That sounds like a terrible experience. To me, it sounds like you two have very different communication styles that’s causing the mixed signals. If your advisor is a decent human being, I’d consider laying out the communication gap issue and come up with a solution together. If he’s not a nice person.... I’m sorry you’re in this bind. Take care of yourself the best you can.", "author": "BelgaerThinker", "created": 1618579008, "upvotes": 41}, "gupxkp2": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupxkp2/", "text": "If panic accomplished anything I'd be some kind of bajillionair blackbelt bikini model.\nPanic is not work, and its not progress.\nIt drains you mentally and physically. I don't think your professor is being realistic.", "author": "HeavyAssist", "created": 1618578490, "upvotes": 218}, "gupxcal": {"link": "/r/GradSchool/comments/ms1ui9/professor_sees_my_passivity_as_negligence_and/gupxcal/", "text": "Is it possible to have an open conversation about it? E.g., sending an email that you want to talk about it, set a date, and then share or ellaborate on your situation?", "author": "avigna", "created": 1618578367, "upvotes": 57}}}