{
  "sid": "qnbgk8",
  "link": "/r/GradSchool/comments/qnbgk8/90_credit_counseling_programs/",
  "title:": "90 Credit Counseling Programs?",
  "text": "I am in the process of transferring from a non-CACREP accredited program to a program that is accredited. I am applying to several programs throughout the country.\n\nI noticed that in Oregon (Portland State U)  and Washington state, their programs are 90 credits as opposed to 60. Does anyone know why this is? Does it take longer to complete, or are some classes  more than 3 credits? Are we expected to take 4+  courses at a time? \n\nWould be cool to hear others' experiences with these types of programs!",
  "author": "jimmyeatbuffet",
  "created": 1636119891,
  "updated": 1636199856,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjfq1pe": {
      "link": "/r/GradSchool/comments/qnbgk8/90_credit_counseling_programs/hjfq1pe/",
      "text": "Portland State counseling graduate programming offers 3 and 4 credit courses. It depends on what specialization you'd be interested in. For example, they offer clinical mental health counseling, rehabilitation counseling, and marriage and family counseling. They offer classes for full time and part time students. How many classes you take would determine how long it would take you to complete.\n\nEdit: I'm from Portland and went to PSU for my undergrad degree. I checked out their master's programs for counseling but decided to choose an online program through Texas Tech University (worked much better since I work full time). This program through Texas Tech is 60 credits, all 3 credit classes.",
      "author": "smpricepdx",
      "created": 1636131450,
      "upvotes": 2,
      "replies": {
        "hjgc165": {
          "link": "/r/GradSchool/comments/qnbgk8/90_credit_counseling_programs/hjgc165/",
          "text": "Thank you for your input. I am in a counseling psychology program counseling and looking into a similar clinical mental health counseling program.",
          "author": "jimmyeatbuffet",
          "created": 1636139865,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}