{"sid": "m6131q", "link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/", "title:": "School isn't giving us Spring Break. Mental Health going bad from burnout. So I'm giving myself a Spring Break next week. Always prioritize your well being over academia", "text": "Hey guys. Not sure if other schools have done this, but my school changed the schedule this semester to not include a proper Spring Break to discourage travel. Wouldn't be so bad if I had a nice winter break, but unfortunately I had to take an intensive 3 week January class during our break to avoid a costly and time consuming Fall 2021 semester.\n\nAnyway, like many of you here....I'm burned out beyond belief. It's literally been nonstop Academics since mid August for me. It's at the point where I dread to open my laptop everyday to begin school work. Zoom lectures have become unbearable, and i'm frankly at my wits end with online learning.\n\nSo you know what? Fuck this. I'm not going to let academia and its bullshit, unrealistic standards ruin my mental health. I'm giving myself a FULL week off next week. Tomorrow I plan to email my professors with a bullshit story and just live my life for a week without thinking about grad school. No assignments, No Zoom lectures, Nothing. I know professors will get upset and give me a 0's for the weekly assignments that I won't turn in. But I just don't care at this point. All I need is one week to recharge my soul enough to endure 8 more weeks of online hell. If they can't give it to me...oh well. I'm taking a stand and choosing my mental health as top priority.\n\nIf you guys are feeling Zoom Online Education Burnout I encourage you to do the same. Look at it this way...if you don't give yourself time to relax you risk going into Finals too burned out to function. That's a worst case scenario as finals are usually the biggest chunk of your grade. Reclaiming MY time allows me to gather enough willpower to crawl to finish line in May.\n\nGood luck guys. Do your best but always remember to put you're well being before your research!", "author": "Emergent_System", "created": 1615869408, "retrieved": 1632846482, "over_18": false, "upvotes": 264, "upvote_ratio": 0.97, "comments": {"gr5e8gr": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr5e8gr/", "text": "My school gave us a spring break, but two of my professors gave us 10+ page papers due the Monday after break. One of which didn’t give us the prompt/assignment until last week, so we only have two weeks to write it. Yeah there’s a “break” but it’s filled with even more homework.", "author": "Abozeezo98", "created": 1615918774, "upvotes": 1}, "gr5c9o9": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr5c9o9/", "text": "Hahahahahaha what a shit school lmao", "author": "grandpassacaglia", "created": 1615917895, "upvotes": 2}, "gr59bum": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr59bum/", "text": "Tulane did this too and it SUCKS!!!! I havent seen my family in over a year and now my parents are vaccinated and I really wanted to go spend what was going to be spring break seeing them for a few days of it but cant because Tulane cancelled it for everyone.....", "author": "Contagin85", "created": 1615916603, "upvotes": 1}, "gr58fwd": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr58fwd/", "text": "Make sure to set up an “out of the office” automatic response for your emails. It will reduce the number of emails you get and keep folks off your back a little. Have fun, you deserve it.", "author": "TastyInternet0", "created": 1615916216, "upvotes": 2}, "gr55tsw": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr55tsw/", "text": "When my school announced there would be no spring break (and in its place a bullshit one day \"academic holiday\") I sent a lengthy letter to administration pointing listing many concerns and complaints. The response I got: basically \"lol as if we care.\" As stressed as I am right now, I have half a mind to send out an email to my students for the class I teach later this week saying \"lol no class next week. If you have any complaints about missing valuable instruction time please forward them to our university president.\" Yeah, I'm sure if I had the balls to do this we'd find out the university just might care", "author": "ta-95", "created": 1615915068, "upvotes": 1}, "gr52pck": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr52pck/", "text": "I'm currently on my self-imposed \"spring break\"! I needed to return to my home state to get my car inspected, and it just so happened to coincide with some serious mental burnout. Plus my midterms start next week, so it seemed like a good time to recharge before things really pick up. My school got rid of all breaks except for two \"wellness Wednesdays\" during the semester, and I worked 13 hours during the first one lol.  I'm returning to school tomorrow (a six-hour drive), but I took a good four days to spend time with family and disconnect from grad school and it was 100% worth it.", "author": "_mockingjay_", "created": 1615913704, "upvotes": 2}, "gr523hh": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr523hh/", "text": "Only thing I would say is to be honest about taking your spring break to your profs and doing it for your mental health (rightfully so), hell maybe even cc the appropriate administration at your university. If I were a prof, I would get it. Also it would help sent a message that this isn't how the university should deal with the situation. People should not travel for March break this year, but it's really not the university's place to enforce that and take away the break from the students who weren't going to travel. It's up to people making the right choices and governments to implement reasonable restrictions.", "author": "ArnieAndTheWaves", "created": 1615913437, "upvotes": 7}, "gr50n6q": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr50n6q/", "text": "Good for you! My school also got rid of spring break, and I also didn’t get a great winter break because I spent the whole time studying for my comprehensive exams (which I passed, btw hehe). \n\nThis semester, I have no classes or meetings on Wednesdays so every Wednesday I have been taking off to relax, catch up on housework, etc. It has been so nice for me to have a break during the middle of the week and I think the only reason I haven’t gone mad. Keep doing you and taking care of yourself! You won’t regret it.", "author": "SylviaWrath69", "created": 1615912801, "upvotes": 2}, "gr4zwuf": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4zwuf/", "text": "My school split up our spring break as follows: The first two days were tacked on to our winter break, meaning we went back a whole two days later. The other three days were broken up into single “instructional breaks”, meaning professors don’t hold class and are also not supposed to assign work for that day or the day after (though I’ve heard reports that some do anyway). \n\nOnly one of these instructional break days is on a Friday or Monday. We’ve had two so far and I spent both of them playing video games anxiously while feeling guilty for not catching up on my work.", "author": "bwy97754", "created": 1615912477, "upvotes": 2}, "gr4z4td": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4z4td/", "text": "I took a three week class over the winter too. And that really has made such a difference in me burning out. No break and I started the spring semester exhausted. It’s been tough.\n\nGood for you for putting your health first!", "author": "cozyintherocket53", "created": 1615912135, "upvotes": 2}, "gr4ye75": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4ye75/", "text": "Hell yeah. Proud of you!", "author": "chilbur", "created": 1615911816, "upvotes": 1}, "gr4qiyy": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4qiyy/", "text": "My university also cancelled spring break, then offered a random thursday this week and wednesday in a couple of weeks as \"wellness days\" with no classes. Except that graduate programs get to decide whether or not to participate. So one of my classes gave me thursday off, but my other thursday class didn't and I still have lab work. \n\nLike, I get that spring break would probably cause a huge spike in COVID due to travel and whatnot, but I've never needed a break so badly.", "author": "doctor_monster", "created": 1615908299, "upvotes": 18}, "gr4ngcf": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4ngcf/", "text": "Sorry, universities usually give grad students spring break?!", "author": "TheScienceMothra", "created": 1615906893, "upvotes": 1}, "gr4i6n5": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4i6n5/", "text": "My university did this too, not that its stopping undergrads from just going on vacation anyway (wealthy private school problems..) and I need a break but unfortunately I teach and have responsibilities I can't just ignore.  \n\nGood for you for taking some time for yourself, we all need to remember that our health and wellbeing is more important than that one week of likely less than productive work.", "author": "PaperPhD", "created": 1615904439, "upvotes": 1}, "gr4gv3m": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4gv3m/", "text": "My university is doing this too! I was so miserable last semester with taking 16 credits and nonstop assignments and test. This semester a little better, but I'm struggling hard with the motivation to keep pushing. 7 more weeks left 😭", "author": "ananjaan", "created": 1615903802, "upvotes": 2}, "gr4dce3": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr4dce3/", "text": "My university in the midwest isn't giving us a break either, its weird because k-12 still has spring break and usually I'd just hang out with my kids for the week but now they're bored out of their minds while I'm trying to keep on top of my own stuff.", "author": "Littlefingersthroat", "created": 1615902055, "upvotes": 26}, "gr45s48": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr45s48/", "text": "And here I am with a whole April month free, but the entire year has been so congested with assignment after assignment. Why couldn't we just use a bit of that month? Why...", "author": "Sadrien6", "created": 1615897712, "upvotes": 3}, "gr421fc": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr421fc/", "text": "Good for you fam! I got lucky and my program is giving us a week off (but we still have homework and assignments surprise surprise). \n\nSo enjoy your week off and relax! Your brain and body will thank you! Hopefully, you'll get some nice weather in your area so you can get away from that computer and get outside for a bit. \n\nAll love and best of luck with the rest of your program op!", "author": "Big_tre23", "created": 1615895105, "upvotes": 4}, "gr3lhr4": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr3lhr4/", "text": "Texas A&M? Or are other schools doing this shit to their students too?", "author": "Americ-anfootball", "created": 1615878934, "upvotes": 19}, "gr3bz23": {"link": "/r/GradSchool/comments/m6131q/school_isnt_giving_us_spring_break_mental_health/gr3bz23/", "text": "*slow clap*\n\nYou, my friend, are a legend. Fuck the system, take care of yourself. Do me a favor: sleep enough for 3 and drink enough for 4 this week. You deserve it.", "author": "hithere1729", "created": 1615870472, "upvotes": 104}}}