{"sid": "gprlyu", "link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/", "title:": "Mastering out is NOT PhD failure. It's not. Don't ever let anyone make you think it is.", "text": "I remember having a friend a while back who was at the time a postdoc but is now a professor. He would talk about how people would master out and how it's PhD failure. At that time I was just a first-year PhD student, not really involved with research, not really knowing or caring. That being said, I also wasn't aware of just how much of a dumpster fire academia is.\n\nThat friend is also elitist and can be incredibly condescending. He's not a bad person, but he is incredibly toxic. You know, the kind of friend who regularly overtalks, interrupts, and is a poor listener. He also lucked out with a good PhD advisor, many years ago.\n\nNow that I'm three years into my PhD, have been thorough two advisors, and have a much better idea of how things work around this toxic environment, I can say with certainty that mastering out is actually a win, not a loss. Leaving a toxic environment is much better than trying to stick it out with something that absolutely does not work. There is absolutely nothing to be embarrassed about, but everything to be happy about. In fact, if it weren't for a friend of mine, I would've mastered out.\n\nMy first advisor is incredibly toxic. I was so ready to master out because I did not want to deal with him anymore; I would much rather have left and saved at least three years of my life than try to stick it out with him. My case is particularly rare, though; a friend of mine showed up at the right time to tell me to switch advisors--and I am so glad I did. My second (current) advisor is a true rare gem. Had my friend not shown up, I would've mastered out.\n\nIf you're in a position where you feel you have absolutely nowhere else to go and you have to master out, don't ever feel embarrassed. Your mental health is so much more important than you think. If you have a friend who's strongly considering mastering out, be there for them and support them. And if there is a good advisor in your institution, switch to them! Grad school doesn't have to be painful, and bad advisors can easily be replaced with those who will make your life so much easier.\n\nEdit I: thank you for the silver! :)\n\nEdit II: thank you for the wholesome! :)", "author": "Palerthanghosts", "created": 1590334291, "retrieved": 1632953234, "over_18": false, "upvotes": 734, "upvote_ratio": 0.94, "comments": {"frvz6a8": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frvz6a8/", "text": ">That friend is also elitist and can be incredibly condescending. He's not a bad person, but he is incredibly toxic. You know, the kind of friend who regularly overtalks, interrupts, and is a poor listener.\n\nJust FYI you are describing a bad person here. You don't have to, like, murder people to be a selfish waste of space.", "author": "KilalSentrists", "created": 1590512730, "upvotes": 2}, "frsq89m": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frsq89m/", "text": "I have been having a similar experience. I started my PhD program this last year. \n\nThere wasn't/isn't really a doubt in my mind that I want a PhD. I love learning, exploring, and creating, and to me, these are the reasons to pursue higher education. I have a real passion for my field and want to contribute to society in such a way. I know my views might be idealistic, but it gives the motivation I need to persevere. \n\nUnfortunately, my first adviser didn't share those same values. She seemed to be in academia for the prestige and money. I don't doubt she has a passion for what she does, but it was apparent she was a professor for the sake of research progression rather student progression. And in that is where I see a major flaw with many professors in academia.\n\nIn my opinion, the whole point of a school is to further education in young people as to hopefully progress society forward in future generations. That makes social/emotional intelligence probably the most important aspect to an adviser.\n\nI was on the verge of dropping out when under my first adviser because I felt like I wasn't being heard. I would state my needs and they were ignored. Mentally, I was extremely strained and I just wanted the anxiety to stop immediately.\n\nIf I hadn't reached out to my current adviser, and if he hadn't been so emotionally intelligent and available for me, I don't think I would've stayed in the program. The PhD wasn't worth working under my previous adviser and the amount of stress I felt. But it is worth it under the right conditions, which I feel I have now with my current adviser.\n\nUnfortunately, I feel like many people stop pursuing higher education simply because of the people they work for (and this is highly applicable in the workforce too). I think the main goal to achieve retention is to provide emotional/social training to professors since advising is a main part of their duties. I think there would be great benefits in the long term.\n\nI would also encourage students to push for the respect and dignity they deserve. I hear so many stories about students being anxious and depressed and the toxic behaviors in the lab being normalized. I think the quality and standard of being a grad student has dropped because nobody is pushing for accountability. The cycle will continue as long as you let it, but don't be scared to stand up for what you need.", "author": "Phoenix_Surgo", "created": 1590435517, "upvotes": 2}, "frqfk4b": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frqfk4b/", "text": "Can I ask is it “master out” as you leave your PHD with your masters as your highest qualification?\n\nCompletely agree with your statement, just curious to know if  “master out” is an intentional or accidental terminology.", "author": "88scarlet88", "created": 1590377013, "upvotes": 2}, "frq86fn": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frq86fn/", "text": "I'm mastering out in a few weeks (well, if my thesis and defense passes, that's it) and honestly, I feel like it might be the best thing that could've happened to me. My working (not personal, my PI is not a bad person or anything, just their teaching and my learning style don't match) relationship with my PI just hasn't worked out and I was feeling really burnt out. My PI suggested that master's degree might be a better path for me, and honestly, I think they were right. Yes, looking for a job in the middle of COVID-19 and trying to figure everything out with limited resources has been hell but things are looking up for me. I will take my masters (hopefully), will work as a lab manager for couple years, and then we'll see. One tip though: have a good answer ready for when they ask you why are you mastering out (because they will ask).", "author": "threelittlepossums", "created": 1590372211, "upvotes": 3}, "frq6l6u": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frq6l6u/", "text": "It means you got a Master's Degree for free/without paying tuition! 🥳 #beatthesystem", "author": "play150", "created": 1590371212, "upvotes": 3}, "frpzenh": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frpzenh/", "text": "I know someone who got forced out after 5.5 years because they failed the last exam out of the 4 they were supposed to take each year. He was already working on his thesis by then. Some time after he left, the school changed its rules so that people with decent grades would only have to take one exam before their second year.", "author": "geometer2015", "created": 1590366735, "upvotes": 2}, "frpu0l3": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frpu0l3/", "text": "This x1000. I chose to leave and Mastered out this year (end of year 3) and even my family took it as me \"quitting', and it was my second masters but in a different field.  It's miserable that people don't understand that's it is totally OK for you to master out if you realize finishing isn't for you (for whatever reason- for me it was mental health and general well being). You still earn that degree and should be proud.", "author": "mziff", "created": 1590363477, "upvotes": 2}, "frps4rq": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frps4rq/", "text": "I agree. It's about how much torture did you put yourself through. You're certainly well above a thesis MS student.", "author": "Anasoori", "created": 1590362360, "upvotes": 2}, "frpb1ma": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frpb1ma/", "text": "I only wanted a Masters to begin with; didn’t think I could handle another ~6 years of school after a tough undergraduate experience. I applied to a school with a special program that combined two different departments. Heard back from the department that they only really take PhD students (despite a MS being listed online), so I said okay, do whatever you need to my app, you are my top choice! Got in, moved 1000 miles, started classes, only to THEN be told “oh we are dissolving that dual department program, you’re really only a student in our department now.” I stuck around, struggled HARD the whole time, almost failed out, until after 5 years when my advisor says “what are you still doing here? You didn’t even want this in the first place. Let’s get you out of here with a Masters.” \n\nI was SO relieved. “Masters” had become a four letter word in our department and I felt like a failure for even considering that on my own, even though it was all I wanted to begin with!! I got out of there with an MS, got a job directly related to my area of study after several months, and ended up with a starting salary on par with some of the PhDs leaving my program. I ended up being at school for ~5.5 years and getting a degree that should have taken closer to ~3 if I had fought for what I wanted earlier!\n\nIt looks better for a department to graduate more PhDs over MSs, so of course they’ll want you to stick around. But don’t do it just to help them pad their numbers if it’s not what’s best for you individually!", "author": "SlightFigureOfSpeech", "created": 1590353467, "upvotes": 3}, "frp3pyb": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frp3pyb/", "text": "Out of a cohort of about 30, I think we had 8 or so masters out. I would argue they have the most interesting careers, and have a good head start on the rest of us. I’m glad I finished, but I was very close to leaving with a Master’s myself and at the time I saw it as a failure as well. But looking back, it’s a very valid alternative that is probably the best option for a healthy percentage of people.", "author": "Juggernaut1210", "created": 1590350255, "upvotes": 3}, "frp2632": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frp2632/", "text": "I have been thinking about switching advisors. I’m just finishing my first year and it’s been a guessing game as to what he expects and wants from me. When I ask him he just says “well that’s the difference between a PhD and a masters student, you have to figure these things out”.\n\nMy most recent meeting with him he berated me and swore at me because I’m not being productive enough while I’m working from home.\n\nI want to switch but I’m worried about retribution. He is pretty big in the field and has a lot of weight with people in the industry. I’m afraid he will make it impossible for me to find a job.", "author": null, "created": 1590349482, "upvotes": 6}, "froumjz": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/froumjz/", "text": "I entered a PhD program in the same university where I had been working as a research assistant for 4 years.  I was running projects on my own, and had already published three papers.  My boss was incredibly supportive of the move, fortunately.   I did all the courses, passed my prelim exams with great scores, and started work in my old bosses lab.  Six months later, I found out my wife and I were expecting a second child.  Not wanting to raise two kids on a postdocs salary,  I \"mastered out\" and managed to get my old job back.   Almost 25 years later, I can say things have been fine with \"just\" a master's, the pay has been consistently better,  and no one I know has ever considered it a cop out.  Sometimes you just have to make what your gut says is the right move.", "author": "Molbiodude", "created": 1590345667, "upvotes": 8}, "frosvvs": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frosvvs/", "text": "I had/am-having similar experiences with a professor. I'm just an undergrad about to graduate and for the last few years have been thinking of getting a masters and then a phD. But the horrible and 'toxic' experience I had in research makes me steer clear from it all. Rather just grow up in the industry.", "author": null, "created": 1590344830, "upvotes": 6}, "frook74": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frook74/", "text": "stop throwing the ‘toxic’ word around", "author": "MMSxyxy", "created": 1590342548, "upvotes": 7}, "froksyf": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/froksyf/", "text": "TOXIC TOXIC TOXIC", "author": null, "created": 1590340676, "upvotes": 6}, "frok6sw": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frok6sw/", "text": "I could almost have written your entire post. I applaud you for sticking through with it!!", "author": "ladypimo", "created": 1590340387, "upvotes": 3}, "froj5km": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/froj5km/", "text": "I did it and I don't consider it a failure (especially since like 75% of the reason I did it was beacuse my PI quit and nobody else was doing similar research) but I do think that honestly it won't help my career. A masters just doens't bring you over the barrier to entry for a lot of scientific jobs, both in industry and academia. Becuase I didn't finish my PhD I basically have to leave my field entirely, OR be capped off at maybe 15-20$/hour lab tech jobs, it seems. \n\nStill, I don't really mind leaving the field becuase during the course of my half-a-PhD, I realized how miserable, underpaid, and overworked most scientists are (certain sub-field exceptions apply) and how hard it is to get one of thsoe jobs even with a PhD.", "author": "iammaxhailme", "created": 1590339867, "upvotes": 3}, "frohtoq": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frohtoq/", "text": "I’m sorry for the generality of this but do you have any like....red flag indicators to look out for when it comes to advisors for a PhD’s Masters or just advising a senior thesis even?", "author": "anarcho-geologist", "created": 1590339202, "upvotes": 12}, "frogoel": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frogoel/", "text": "The most important thing is that you individually do what is best for yourself. Sometimes mastering out is the right move and a good. Sometimes, it's a failure and one should accept it as such. There have been people who I think should have mastered out because there's a wonderful future waiting out there for them, and some that should master out because of their lack of ability or willingness to grow.\n\nIt is what it is. Please don't make this whole sub a pity party.", "author": null, "created": 1590338633, "upvotes": 3}, "frogask": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frogask/", "text": "I don't understand this post at all. Could you please precisely state what you think it means to fail an objective?\n\nYesterday I planned to eat an apple for lunch and it turned out that I was unable to do so for reasons I won't get into, and I instead opted to eat a banana. Can you please tell me if I successful ate the apple, or if my plan failed?\n\nGetting a master's degree is a great achievement for sure. I was also very happy with my decision to eat the banana, though my enjoyment of the banana doesn't mean I successfully ate an apple.\n\nOn a more direct note: failing to do one thing we wanted to do isn't the same as failing as a human being. We fail and succeed constantly at all sorts of things big and small, and there's no point pretending we don't. It's the general direction of our failures and successes over time that carve our paths in life.", "author": "richard248", "created": 1590338444, "upvotes": 11}, "frofjdh": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frofjdh/", "text": "When you spend your entire adult life on a single track, it's hard to comprehend that there are other ways of being. A failure of imagination.", "author": "sonamata", "created": 1590338074, "upvotes": 164}, "frof6sw": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frof6sw/", "text": "It can also be a matter of realizing what your priorities are and that what you want to do in life is served by having a masters and the extra time to get a PhD would then quite literally be wasted. This is especially the case in fields like, say, statistics (my field), where a lot of the fun and highly-paying stuff can be done with a masters level of knowledge.", "author": "giziti", "created": 1590337904, "upvotes": 16}, "froer58": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/froer58/", "text": "Fantastic post thanks for sharing and for the absolutely correct view on \"Mastering out\". I mean, you have obtained a Masters degree... that is not common or in the least bit easy. If you did is as a PhD candidate in a STEM filed, that means you did it for free, kudos to you, really! \n  \nI went into my PhD program having no clue if it's what I should be doing, but it was actually *comforting* knowing that if I should find a PhD or a career in research not for me, I can still get paid to do a MS, which sounded pretty great to me. With a Masters in engineering that you would've had if you obtained your MS (from what I can tell from your flair), that is an incredibly employable person.... maybe more so than a PhD in some other STEM fields--depending.   \n    \nThis is the number one thing people forget when in academia... you should not compare yourself to your local environment... as much as its human nature to do so. Compare yourself to the general population, you have a Masters degree, you have reach an elite pinnacle of success that many don't even have the opportunity to do so. You had the opportunity and put in some really driven hard work to achieve a Masters degree: *BE PROUD!* A Career as a PhD is not for everyone, you also may not have a law degree or an MBA either... who cares! You did what you needed to do to enjoy the type of career that fits you, that's the **only** thing that's important.  \n    \nThanks for putting this out there PTH, well said!", "author": "Loupy_e", "created": 1590337688, "upvotes": 15}, "frodnno": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/frodnno/", "text": ">Leaving a toxic environment is much better than trying to stick it out with something that absolutely does not work.\n\nTrue in personal relationships, definitely true here. I feel like if more people saw it through that lens, they'd be more understanding of why an exit strategy is sometimes the absolutely right move. It's not a failure, and you're not quitting. You're seeing a fork in the road, and you're taking it.", "author": "stinkyhat", "created": 1590337142, "upvotes": 16}, "froa9ue": {"link": "/r/GradSchool/comments/gprlyu/mastering_out_is_not_phd_failure_its_not_dont/froa9ue/", "text": "Props to you for your persistence. What doesn't kill us makes us stronger. I hope you succeed!😁\n\n\nI do have a related thought: Only in the US would getting a Master's degree be seen as a failure instead of being celebrated. It's really baffling. \n\nPerhaps the US should try to adopt a similar approach to the EU/majority of the world where a Master's is more or less required to qualify for a PhD. It makes the student cognizant of the challenges of grad school, know how grad school PI-student relationships work, and whether a PhD is *really* what they want to do later.", "author": "ElochQuentis", "created": 1590335528, "upvotes": 143}}}