{
  "sid": "r4zavm",
  "link": "/r/GradSchool/comments/r4zavm/is_there_any_hope_of_the_ongoing_wage_strike/",
  "title:": "Is there any hope of the ongoing wage strike having an effect on grad students with stipends?",
  "text": "I've seen a few industries (service the most) hit by workers walking out due to bad conditions and low wages. Some wages are starting to rise, but I'm wondering if this will have any effect on graduate students in fields that provide a stipend.  What are your thoughts? Anyone in a student union or anything like that discussing this?",
  "author": "PoochMD",
  "created": 1638202700,
  "updated": 1638207928,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hmjou9f": {
      "link": "/r/GradSchool/comments/r4zavm/is_there_any_hope_of_the_ongoing_wage_strike/hmjou9f/",
      "text": ">but I'm wondering if this will have any effect on graduate students in fields that provide a stipend.\n\nVery doubtful, unless you're at an institution where the grad students are striking for higher pay.",
      "author": "raistlin65",
      "created": 1638203424,
      "upvotes": 10,
      "replies": {}
    },
    "hmjpmbs": {
      "link": "/r/GradSchool/comments/r4zavm/is_there_any_hope_of_the_ongoing_wage_strike/hmjpmbs/",
      "text": "Your university doesn't want to give you a better stipend. Your union needs to be ready to strike and fight for one.",
      "author": "public_health_nerd",
      "created": 1638203747,
      "upvotes": 9,
      "replies": {}
    },
    "hmjurkb": {
      "link": "/r/GradSchool/comments/r4zavm/is_there_any_hope_of_the_ongoing_wage_strike/hmjurkb/",
      "text": "My union is currently bargaining and they did have to strike, as well as have federal mediators, for the last contract about three years ago. Several grad student unions around the country are currently bargaining, striking or preparing to strike, or working to get recognized now, last I checked.\n\nFrom my observations working with my union, I think other things will be more important than walkouts in other industries. Especially if it comes to a strike, having the support of faculty, undergrads, and even staff is crucial. Public perception can also play a role, if the school administration realizes they look like the bad guys. Reputation relative to other schools can also be important and this is one reason (definitely not the only one!) you will see grad student unions hold up their fellow unions' successes. It can look bad for a school if they are paying way less to their own grad students than a school across town whose students face the same cost of living; or for a school to be paying way less than one with a similar student body and reputation. They're competing with those schools for admissions.\n\nI don't think higher wages for other workers will directly affect what grad students can get out of our institutions until there starts to be a credible threat of us leaving academia over the working conditions before we get our degrees, not after. Or of not enrolling at all. Upcoming cohorts are going to shrink regardless of economic conditions because of demographic change, and schools are well aware of that, but a lot of them seem to be hoping that current changes are just volatility from the pandemic and they'll be able to get a few more years of the exploitative status quo.",
      "author": "epieee",
      "created": 1638205832,
      "upvotes": 3,
      "replies": {}
    }
  }
}