{
  "sid": "qewl14",
  "link": "/r/GradSchool/comments/qewl14/academic_dishonesty_on_my_transcriptshould_i/",
  "title:": "Academic dishonesty on my transcript…should I bother applying?",
  "text": "My academic history is a little bit insane, but I will try to keep this as short as I can. \n\nI started off strong at one university (that I historically have done extremely well at), transferred to another university for 3 semesters (withdrew during the 4th) and thats where shit hit the fan. At the new university, I got addicted to xanax and overdosed mid semester. I got clean, and transferred back to my old university where I have been academically thriving. I have an overall GPA of 3.8, I am on the President's list for academic excellence and I am in two honors societies. As it seems, I have a 4.0 semester GPA, which means I will be graduating summa cum laude.\n\nRegardless, the university where I crashed and burned...oh my god. It's so bad. My overall GPA was a 2.8, I have a million W's, and finally...a Q. I received the Q because I took an exam when I was extremely high and I had my phone face up on my desk. It kept lighting up because I was receiving text messages and the proctor threw me out and put in a claim of academic dishonesty. I tried to fight it, but I overdosed literally the day after from stress and withdrew from the school entirely. \n\n\nNow, on that transcript from that university, I have a Q (indicating academic dishonesty). I have no idea what to do. Should I even bother applying? Should I put on my application what happened? Advice/experience?",
  "author": "lilenzz",
  "created": 1635095952,
  "updated": 1635185343,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.57,
  "comments": {
    "hhwe6r9": {
      "link": "/r/GradSchool/comments/qewl14/academic_dishonesty_on_my_transcriptshould_i/hhwe6r9/",
      "text": "I would be honest about it. I have a ding on my undergrad transcript for actually cheating on a final exam (I was a dumbass). \n\nI’m in grad school now and I explained the situation when I applied. I hadn’t slept in two days, my roommate sat next to me and let me see her answers, my professor caught me and etc etc. I was allowed to retake the final but there was a permanent mark on my transcript. \n\nI explained in my application how I had literally never cheated on anything in my life until then and explained that it wasn’t an accurate representation of me as both a person and student. It happened 7 years ago and I had grown from the moment. \n\nHonesty is always the best policy in situations like these, especially yours where you didn’t do anything wrong. Good luck!",
      "author": "umuziki",
      "created": 1635104425,
      "upvotes": 7,
      "replies": {}
    }
  }
}