{"sid": "mjne0n", "link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/", "title:": "Does anyone else experience days where they just can’t do anything school related?", "text": "Sometimes I get in these moods where I can’t do any work for 2-3 days at a time. I won’t even crack open a book, watch a lecture, or write a single line of code. It takes all the energy in the world for me to even respond to emails. I’m not always like this, I love programming. I love problem solving, algorithms...all of it. I even love going down a rabbit hole of stackoverflow searches trying to configure my environment for hours before I even start development. I seriously fucking love it. I literally get excited thinking about projects I’m working on.\n\n....but every once in a while I get in these moods where I can’t get in the right headspace to work on my projects. I’ll have so much anxiety, yet I keep procrastinating. I’ll go for walks, watch Netflix, work out, do my hair and makeup, literally ANYTHING. I keep telling myself “I’ll\nDo it this afternoon”, “I’ll get to it this evening”, “I’ll work late”, “might as well start tomorrow”.....\n\nIs this just a grad school thing? Or will I be like this at work? Sometimes the imposter syndrome is strong, and I feel like if I keep getting into these moods I’ll get fired. It usually happens after a big development effort is completed, right before I start the next project. Around every 2 weeks or so I’ll have a couple days of a lull. I just can’t be bothered. \n\nI feel like I’m a bad programmer because of this 😞\n\nEDIT: I just want to thank everyone for giving me the strength to get back to my studies. Reading all your comments motivated me to have a productive day today, and I hope to have a productive week as well. Thanks!", "author": "_bob_lawblah_", "created": 1617504466, "retrieved": 1632953758, "over_18": false, "upvotes": 462, "upvote_ratio": 0.99, "comments": {"gtf3vbk": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtf3vbk/", "text": "Yes.\n\n It’s called losing all of ✨ le mental health ✨", "author": "Thecatofirvine", "created": 1617595709, "upvotes": 1}, "gte9gd6": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gte9gd6/", "text": "Yeah unfortunately it's called being an animated meat sack Human. We weren't designed for half the nonsense we put ourselves through daily. We need lots of breaks and distracting alternative activities to compensate. \n\nThings like lack of motivation, inability to focus, etc., aren't moral failings, they're natural consequences of being a couple hundred pounds of electrified meat that has been forced to do critical thinking and perform calculus.", "author": "Alt4Hire", "created": 1617577830, "upvotes": 1}, "gtdxb52": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtdxb52/", "text": "I’m a 5th year PhD student and it’s at the point where some days I drive down to campus and am so physically repulsed by the thought of going into lab that I just turn around and go home.", "author": "cracklin_oats", "created": 1617571283, "upvotes": 2}, "gtdw4mg": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtdw4mg/", "text": "I feel the same way sometimes. Take it one day at a time.", "author": "Professional_Zeal", "created": 1617570664, "upvotes": 2}, "gtdnupm": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtdnupm/", "text": "I have days like this when I have to teach double labs. I get home and I'm so tired of presenting and troubleshooting why the undergrads can't get a nanodrop to work right that I flop on the couch, scroll through TikTok, and I can't even look at anything science-related all evening. Or I'll have worked on some research projects for so many days that I just need a night off to reddit or catch up on movies/shows/video games I've been putting off. This is nothing to feel guilty about, it's necessary time to recharge and it's better in the long run.", "author": "Midasonna", "created": 1617566331, "upvotes": 2}, "gtdhqj2": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtdhqj2/", "text": "Maybe you’re having some burnout?", "author": "Big_Lab_883", "created": 1617563144, "upvotes": 1}, "gtdgike": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtdgike/", "text": "I have the same thing! I’ve found that leaning in to not being able to do any school work and just doing other things instead instead of sitting there trying to work helps cut down 3 days into more like 1", "author": "Capitan_Dave", "created": 1617562505, "upvotes": 3}, "gtde44d": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtde44d/", "text": "Yes. Can’t do it. Working extra this semester. Grades are suffering a little bit but whatever.", "author": "kyokogodai", "created": 1617561259, "upvotes": 3}, "gtdc8cj": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtdc8cj/", "text": "Research (and knowledge work in general) is strange because you can exert a tremendous amount of effort without realizing it. ESPECIALLY, during a pandemic when many normal activities are no longer common. It's normal to take time off, especially after a crunch such as a project deadline. In our research lab, it is common to spend the post-deadline week doing non-research work such as learning a new skill.\n\nEveryone experiences different things when they become tired/anxious/overwhelmed. Learning what this looks like and figuring out the next step is as much a part of grad school as it is a part of discovering how to sustainably do high quality work. For myself, a telltale sign for exhaustion was leaving the key in my apartment door when I went home for the day. \n\nYou're probably going to crush it as a programmer or researcher for many years to come - in part because you're a smart and passionate individual. It's a worthwhile endeavor to figure out what the maintenance schedule looks like and what strategies work to make you feel better, both while doing work and otherwise.", "author": "coupz", "created": 1617560286, "upvotes": 5}, "gtdad7u": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtdad7u/", "text": "Something that helped me recently was changing my perspective. I was sooo overwhelmed with schoolwork (MSW), so stressed, so anxious, was not sleeping well. I was doing schoolwork all day it felt like but getting nothing done. I had to change something. So I just had to realize that none of my future supervisors or coworkers, and most importantly none of my future clients are going to give a fuck about what grade I got on this big essay, or how I did on this one quiz, or even my GPA at the end of grad school, as long as I pass. School is just a means to an end so I can help people. Helping people is the goal, not being perfect at school. It was hard to make that mental shift, but it kind of changed everything.", "author": "alliastronaut", "created": 1617559324, "upvotes": 7}, "gtd8vge": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtd8vge/", "text": "Holy shit yes. Yes all of that, i'm a CompSci Masters student. I keep putting off research work telling my supervisor I have too much coursework, but then I will spend multiple days trying to work on coding projects and doing nothing. Then comes time for our meetings and i'm like \"sorry I wasnt able to do anything\". I am starting to feel like i can't keep that up and that the jig will be up and i'll get canned. But I find it so difficult to work some days man.\n\nIts not like I don't enjoy programming, I do. When I get into \"coding mode\" I can go hours and hours and hours nonstop. But getting there is so difficult. Oh I need a snack, Oh i'll just watch a couple youtube videos, oh i'll play guitar for a bit etc etc. and next thing I know its 2am and i've done nothing.", "author": "Peter_See", "created": 1617558559, "upvotes": 5}, "gtd7u4a": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtd7u4a/", "text": "One of my professors had great advice which is to lean into your relaxation time. Don’t spend it trying to force yourself to do work. Just let yourself enjoy whatever recreational activity you’re doing. If you spend that time feeling guilty you’ll want to keep delaying doing work because you won’t feel like you got a true break but then you just keep feeling the guilt. Just let yourself enjoy the time you have and then when you’re ready just get back to it.", "author": "PurePreparation9263", "created": 1617558033, "upvotes": 7}, "gtd0t1h": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtd0t1h/", "text": "Most weeks, I have a time where I don't work for 1-2 days at a time. We call it the \"weekend.\"\n\nJokes aside, no one should be expected to work every day. I would be worried for someone's career and health if they *didn't* take (on average) 2-4 days off every 2 weeks!", "author": "i8i0", "created": 1617554458, "upvotes": 5}, "gtczna3": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtczna3/", "text": "First of all, you are not a bad programmer because of this! Things are especially difficult right now and it’s very hard to keep ourselves in prime condition all the time even when conditions are normal. I get the same anxiety about my work, especially starting it. I also know that I’m extremely prone to being distracted and following whatever thought comes into my mind whenever I’m trying to work. I’ve recently started seeing a therapist about this and have come up with a few things that help me. \n\nThe first is a strict imposed schedule that I make using my planner (I use Panda Planner and I think it’s great for someone like me). Without this I really have little direction during the day. The second is having a set of things I complete every day (I use Habitica to help with this). Mine includes things like shaving, meeting some minimal level of physical activity, mindfulness meditation, and working on research or coursework. This helps me with adding structure to my day as well.\n\nThe last one is the most important to me I think. When I sit down to work, I try extremely hard to eliminate distractions and agree to work for a specific length of time (e.g, 30 mins.) I use the Forest app to remove the temptation of using my phone, and I try to maintain a clean desk. Or during class I will leave my phone in a place I cannot reach it. Honestly I was shocked how often I found myself reaching for my phone, remembering it was somewhere else _for a reason_ and hopefully pulling myself back to the class. \n\nNothing is perfect, I still struggle with organization and focus, but I’m still working on it and these things have helped _me_ to make some improvements over the past few months. I hope you can find some things which will help you too! Remember even a tiny improvement is an improvement, and they add up over time! Remember also that you are not alone!", "author": "Alcool91", "created": 1617553872, "upvotes": 2}, "gtcwee9": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcwee9/", "text": "I actually went to counseling for this in my undergrad (rather that 2-3 days, weeks of doing nothing and failing anxiety and procrastination) which helped me figure out my priorities and ended me up in grad school.  Looks like if you don't want to do something, you physically can't make yourself do it, and you ignore that you're lying to yourself when you say you'll do it later.\n\nStrangely it's come back for me this semester, exactly as you describe it. I want to attribute a bit to covid-19, but I didn't have that issue last semester so I'm not sure why. \nI think for me it might be my classes aren't as interesting as last semester too, and one that's also too difficult (which often makes me delay assignments for that specific class). I really don't have the slightest idea otherwise.\n\nAnyways, I'd say do some introspection of why you're acting this way, even though you're in grad school and likely want (?) to be there for your goals. Make sure you're eating/sleeping right too.", "author": "Orthonormal_Bassist", "created": 1617552210, "upvotes": 3}, "gtcut4i": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcut4i/", "text": "[deleted]", "author": null, "created": 1617551391, "upvotes": 4}, "gtcu3f6": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcu3f6/", "text": "Yes absolutely. I hate being a student so much. I wish I could just focus on my research instead of doing homework or studying.", "author": "ProfZuhayr", "created": 1617551021, "upvotes": 3}, "gtcsg1a": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcsg1a/", "text": "Yep. I'm in one right now that is stretching longer than I can afford. Especially with COVID and isolation some days it just feels like I can't do the work at all.  You're not alone!", "author": "MonsterOfRavenna", "created": 1617550164, "upvotes": 3}, "gtcs5fq": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcs5fq/", "text": "I think this is more common that not. I experience it a lot.\n\nI was also worried about whether I'd be like this at work. While it's possible, there are a few reasons why work can be different based on my experience working during grad school and having these difficult times when doing schoolwork:\n\n- academic work can be really isolating, whereas I've found most workplaces are collaborative and you're allowed to work on things together/get people to help you\n\n- the academic tasks we work on are very long-term and not easily broken down into pieces, whereas I've found that even knowledge work in industry is shorter and quicker\n\n- we usually feel like our research has to be at a 100% level before showing anyone, while this is not compatible with most workplaces. This is actually a criticism of PhD folks in industry, if they can't let go of needing things to be perfect. In my work experiences, making a rough sketch or sharing a first draft is the goal, so there's less time sitting there trying to make the first version perfect\n\n- if you are writing, it's usually gonna be a lot shorter than what we're trying to write! And if it's a very long document, it's probably a collaborative effort (see above).\n\nBurnout and attention issues could be the issue here. But these demotivating moments can happen to anyone in any situation, even without burnout, and is also a product of the way our work is designed. I don't have either of those diagnoses/situations and I still get this.", "author": "0102030405", "created": 1617550011, "upvotes": 3}, "gtcksdq": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcksdq/", "text": "Rest is an important part of the grad school experience. 2-3 days rest is so important. Good writing comes from clarity and feeling well-rested. Pre-Covid, I did a 1 year insane run with my research. Very little rest. Guess what?\n\nI burnt out for 3 months. I went off to travel because I couldn't even look at my research without feeling like a huge imposter. I managed to pick myself up and wrapped it up well. Now that I'm going to do my PhD, I tell myself to take breaks and if I don't feel like doing anything, I'll just go out for a drive and do some shopping.", "author": "givemeyourdonut", "created": 1617546010, "upvotes": 12}, "gtckcby": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtckcby/", "text": "I'm seven months into my masters and I have rarely done any research on weekends.", "author": "Goobzo", "created": 1617545757, "upvotes": 12}, "gtchk2c": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtchk2c/", "text": "Everyone needs rest. You can't go at your 100% all the time.", "author": "dwarfedbylazyness", "created": 1617543993, "upvotes": 15}, "gtch1qj": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtch1qj/", "text": "I’m experiencing it right now! It’s my last (2) courses before graduation and I don’t want to do ANYTHING. I’m also off work for medical leave and that’s also contributing to me being lazy. \n\nI’m pushing myself to get a lot done today, so this coming week (surgery week) I won’t have much to do. I’ve hit burnout from school and I’m over it. The upside is that once these classes are over, I’ll be an I/O Psychologist and it hasn’t really hit me yet because I want out. Now. Haha.", "author": "merick107", "created": 1617543675, "upvotes": 12}, "gtcgoja": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcgoja/", "text": "Sounds like burnout (and possibly ADHD, as some people have mentioned). Many of my classmates and I felt this way when we were going through our program. Anecdotally, most people find it easier to balance work/life in industry, where you have greater external enforcement of working hours; without that structure in grad school, you subconsciously know you could always be studying or working on something and are thus more likely to burn out.\nIn the meantime, I have found that the following combination of preventative measures make it less likely for me to go down anxiety spirals or burn out after big projects/exams: \n\n * (1) **Exercising** (esp. cardio) for 30 min in the morning: I highly encourage cardio since it forces \nyou to take a break from worrying about things other than the need to keep moving until the end of the workout. The endorphin boost will also give you the energy to finish your administrative tasks and think more clearly.\n * (2) **Pomodoro** (25 min work, 5 min rest): Bonus if you can switch your tasks after 25 min. The key here is to ONLY do work for those 25 min, and ONLY rest for the 5. I'm often intimidated by the thought of having to work continuously for x number of hours, so establishing strict rest periods makes it easier to focus on the work.\n\nI've also found /r/getdisciplined helpful for productivity tips. From someone who has been there before, I hope you can find something that works for you!", "author": "persnickety_pea", "created": 1617543446, "upvotes": 11}, "gtcf61c": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcf61c/", "text": "Same. Especially whenever I feel like my research is going nowhere and anxiety kicks in.", "author": "randomnerd97", "created": 1617542474, "upvotes": 8}, "gtcehdn": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcehdn/", "text": "That was me yesterday and Friday! I just took those days slow. i hve always been doin work all the time, monday to sunday but it was just a question of pace. some days are slow (cuz i feel abit worn out), some days are productive. I feel its normal, wanting to take a few days off to do something completely unrelated to your research or studies. Take those days off and come back to it later. Dont feel bad about it , you're only human :)", "author": "vanhoutens", "created": 1617542021, "upvotes": 4}, "gtcd460": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcd460/", "text": "I think it's not just about work. I know someone will say \"working x days in a row, and you need a break\"\n\n\nBut I think a big part of the stress if from the expectation you'll work. Even on the day, you do most of your chores, you probably expect to put in 5-6 hours of school work.\n\n\nIt's not about whether you do 1 hour or 10. But just that emotional stress you put on yourself to hit goals and be productive is draining. Recently, I took a day and a half where I told myself I won't do anything productive. I'll read a book, I'll talk to friends, I'll watch TV. Just anything but school work.\n\nThat alone helped me recharge", "author": "Transit-Strike", "created": 1617541092, "upvotes": 40}, "gtcbjw3": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtcbjw3/", "text": "Wow reading this actually really made me feel better. My last few days were like this and I was feeling super anxious and guilty about it. So nice to read it's not just me.", "author": "Eloda9", "created": 1617539969, "upvotes": 20}, "gtc7fzr": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtc7fzr/", "text": "This was the case for both my degrees, but it was due to bipolar and later burn out", "author": "Hushex", "created": 1617536681, "upvotes": 5}, "gtc6rup": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtc6rup/", "text": "I feel the exact same! Everytime it happens, I also get so stressed thinking \"can I survive another school year like this?\"\n\nDuring undergrad, I could consistently do bits of work, but right now, I'm either productive for a bit, or I can't even think about research/coursework for a few days. I feel like I'm getting burned out having to do everything from the same room, and have everyday feel the exact same as the last.", "author": "lushkittehs", "created": 1617536096, "upvotes": 36}, "gtc216i": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtc216i/", "text": "Do you have ASD/ADHD? I read something a while back about “autistic burnout” and how it’s different from occupational burnout and clinical depression. The autistic burnout is when you still love the things you do, but are suddenly unable to function for a short period of time. Like, you still want to do all the things and love doing them, but “couldn’t carry your body” to do it.\n\nLove the username btw", "author": "dasisteinwug", "created": 1617531577, "upvotes": 12}, "gtbjeta": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtbjeta/", "text": "Person, I feel the exact same way. I, normally, have periods where I don't bother going in to the lab for a day or two. But, with the pandemic, it seems to happen far more often that I would like to admit (maybe even once every two weeks where I just won't do anything). \n\nI feel like its a pandemic thing for me because the work environment has become so weird and dead with COVID-19 :(", "author": "debt69", "created": 1617513548, "upvotes": 55}, "gtb9ud8": {"link": "/r/GradSchool/comments/mjne0n/does_anyone_else_experience_days_where_they_just/gtb9ud8/", "text": "You are not alone! \n\nI've been feeling this exact same way! I love what I do but sometimes I just don't have any energy when it comes to my school work or teaching duties. I think it's just that we've been going through this weird period with Covid for so long that we're burning out. \n\nHopefully it will get better once everyone gets their shots and the pandemic is eventually over.", "author": "morgazoz", "created": 1617506602, "upvotes": 97}}}