{"sid": "bm8a7z", "link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/", "title:": "My poor boyfriend just made a perfectly innocuous joke about me failing out of grad school and I burst into tears. Grad school has really done a number on me.", "text": "I've been working at a Starbucks all day while my boyfriend was at work, and we both went home for lunch together. When it was time to get back to work, I decided that I wanted to stay home to take a nap. My boyfriend said something like, \"well if you're okay with failing out of grad school...\" and I burst into tears. Even when it seems like I'm doing okay, I'm  seconds away from a break down.", "author": "tan-dara-dei", "created": 1557337340, "retrieved": 1632845915, "over_18": false, "upvotes": 358, "upvote_ratio": 0.97, "comments": {"etblgs7": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/etblgs7/", "text": "What was his reaction, did he console you at all?", "author": "SoC4LN3rd", "created": 1562651005, "upvotes": 1}, "en4mhbj": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/en4mhbj/", "text": "That’s the only difference btw being a grad student and being say a postdoc or, if you’re lucky enough to get a FTTT, a faculty position is the pay assuming all things being equal like COL. Same grind.", "author": "Dorothy_Day", "created": 1557590624, "upvotes": 1}, "emx2x0v": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emx2x0v/", "text": "I have a five week old son.\n\nI was warned how brutal the first few months are.\n\nI've been in grad school six years, hoping to defend this summer.\n\nI've had an advisor leave, had another that I left his lab before he got fired, and experienced a lot here.\n\nGrad school is on par with, and harder than a new kid at times.\n\nDon't beat yourself up.", "author": null, "created": 1557408598, "upvotes": 3}, "emw7u4f": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emw7u4f/", "text": "My defense is in 3 weeks and a day and I feel you. I have a week to get my thesis to my committee and I'm streeeesssed.", "author": "femalenerdish", "created": 1557376421, "upvotes": 3}, "emw7kgv": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emw7kgv/", "text": "If it’s any consolation, I had my last final exam today. And I fucking aced it. Legitimately the most prepared I have ever been for an exam, and I just *knew* the material. I left feeling great, got home, and then had the irrational thought “yeah, but it took you this long to get here, didn’t it? And look at that person who just got a grant!” And immediately felt bad about myself. It’s good to know other people are on a similar precipice. But I’m probably also a little over-tired today.", "author": "princess_myshkin", "created": 1557376184, "upvotes": 4}, "emw27v0": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emw27v0/", "text": "It’s visible, the gradual effect of grad school on a person. From the day they start to defense, an utterly different person. More tired, drawn, not particularly healthy-looking. But the life returns after they’re done", "author": "Dorothy_Day", "created": 1557371794, "upvotes": 6}, "emvzxxn": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvzxxn/", "text": "I cried through my entire candidacy exam today. I was lucky to have a very understanding committee and still managed to squeeze by with only a reservation", "author": "jdeyoungisokay", "created": 1557370054, "upvotes": 7}, "emvxcbf": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvxcbf/", "text": "Seek guidance if you need it!  Sooner is better than later OP!", "author": null, "created": 1557368281, "upvotes": 2}, "emvsd6w": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvsd6w/", "text": "Do anyone here want to take a year off of grad school because of drama-filled, bordering  on toxic classmates?", "author": "TellementContent", "created": 1557364762, "upvotes": 2}, "emvr9pw": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvr9pw/", "text": "I feel ya. I'm at a point in my studies where I just have to work through the breakdowns. Last week I was doing coding homework with tears streaming down my face (I'm an archaeology major and coding is not something I am very familiar or comfortable with)", "author": "94sHippie", "created": 1557363974, "upvotes": 6}, "emvqgw7": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvqgw7/", "text": "My deteriorating mental and physical health was basically the nail in the coffin of my already strained, semi long distance (~80 mi) relationship. I quit in August and tried taking time to recover but the damage was too much I guess. We broke up in December (I said the words, she didn’t complain). I miss her all the time even though I feel like I probably shouldn’t.", "author": "bcarson", "created": 1557363409, "upvotes": 2}, "emvoqos": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvoqos/", "text": "I find that sometimes I bottle things up and find reasons for it to come out. This may be the same thing and is just your mind letting you know to just have a good cry sometimes.", "author": "Aahhhanthony", "created": 1557362182, "upvotes": 2}, "emvny9b": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvny9b/", "text": "This is me all the time", "author": "brokegradstudent_93", "created": 1557361619, "upvotes": 2}, "emvklvw": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvklvw/", "text": "This happened to me too! Except my boyfriend is in the same grad program as me/was my grader/TA for this class....he knows not to joke too much about school now when I’m stressed lol.", "author": "nightshadeclipse521", "created": 1557359145, "upvotes": 2}, "emvjoor": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvjoor/", "text": ">I'm seconds away from a break down.\n\nThis pretty much sums up how I feel, with slightly over a year left in my Master's. I thought I was a pretty solid guy, emotionally. I thought I handled critique well and had good self-esteem. Now? I discovered anxiety, depression, and crippling self-doubt. Even now I feel moments away from a total collapse. God, I hope I can do this.", "author": "Seag5", "created": 1557358464, "upvotes": 14}, "emvhpwd": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvhpwd/", "text": "Dude I had a very similar experience a week ago. I'm on a committee working to address gender-based harassment in my program, and we kicked off one of our planning sessions by watching a fictional (but realistic) harassment scenario. The harasser, a male senior faculty member, at one point said to the victim, a female junior faculty member, \"Look at you playing at being a scientist.\" I haven't experienced anything like what was portrayed in that scenario, but for whatever reason, it *really* hit home, I guess cause there's a part of me that thinks I am just \"playing at being a scientist.\" \\*Solidarity hug\\* We can do this!", "author": "vespertine-spine", "created": 1557357026, "upvotes": 19}, "emvg3k4": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvg3k4/", "text": "I don't know your relationship (and as a grad student myself, I might not be very objective) but damn, that joke seemed a bit harsh.", "author": "squirrels33", "created": 1557355907, "upvotes": -3}, "emvcwyt": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvcwyt/", "text": "[deleted]", "author": null, "created": 1557353767, "upvotes": 36}, "emvbjim": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvbjim/", "text": "I understand this a lot. Not even half an hour ago, I was texting my family about something unrelated and they ask if I want to throw a party for getting my masters (which I only got by default when I left my PhD without completing it). I said I didn't want to celebrate failing to get the degree I entered for, and they basically attack me for \"being negative\" when that wasn't negative at all, it was just me having an opinion.", "author": "iammaxhailme", "created": 1557352906, "upvotes": 24}, "emvb3z1": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emvb3z1/", "text": "My partner told me in passing the other day that I don't *need* to finish my PhD and that I had nothing to prove to anyone.\n\nMy face went incredibly grave and I said in an intense voice that yes I *need* to finish my PhD and I have *so much to fucking prove*. \n\nThe hilarious thing is we met doing our master degrees and he remembers how emotionally taxing grad school is. He backed off once I started staring daggers into the air towards nothing.\n\nI hope you got your nap! Naps are the best part of grad school.", "author": null, "created": 1557352631, "upvotes": 103}, "emuyw0o": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emuyw0o/", "text": "Learning should be fun. Grad school looks like it kills the joy of learning because it enslaves students to Faculty and to an agenda.", "author": null, "created": 1557345859, "upvotes": 20}, "emuxzpy": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emuxzpy/", "text": "I completely understand. My fiance has made the mistake of saying things like that and immediately regretted it. I'm sure he didn't mean it seriously or to hurt you, but in the moment you really feel it.", "author": "TheRealMuffin37", "created": 1557345389, "upvotes": 30}, "emuqc46": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emuqc46/", "text": "I feel you. My partner and I make jokes about this too and sometimes it really upsets me and other times I'm laughing. I wouldn't be able to make through grad school without humor though. I tell myself its okay to cry. When I burst into tears like this, it's a sign I need to make some time for self-care and take some things off my plate.", "author": "458steps", "created": 1557340888, "upvotes": 121}, "emukz3k": {"link": "/r/GradSchool/comments/bm8a7z/my_poor_boyfriend_just_made_a_perfectly_innocuous/emukz3k/", "text": "Grad school is tough, but having someone say that, holy crap. I would definitely be upset, and rethink everything. No one should tell you stuff like that even in jest :( that just sucks. :(", "author": null, "created": 1557337558, "upvotes": -23}}}