{"sid": "pw2blg", "link": "/r/GradSchool/comments/pw2blg/i_intend_to_finish_grad_school_parttime_while/", "title:": "I intend to finish grad school part-time while working full-time. Should I mention on my resume that I'm in grad school?", "text": "I'm currently pursuing a PhD in color science, a field that's mostly unrelated to my bachelor's, which is computer science. I'd like to begin pursuing full-time work as a programmer while finishing up my PhD part-time (yes, I understand that this is a dangerous idea, and I won't be heartbroken if I wind up dropping out of grad school if it gets too intense).\n\nMy question: since my grad degree isn't directly related to the field I'm looking to work in, would it be detrimental to my job search to put grad school on my resume? My advisor heavily advised against putting it on, as it would sort of \"tell\" the employer that I don't intend to stay with them long-term, and also that they'd be daunted because I would want a raise once I have a PhD. I haven't been able to find much advice regarding this elsewhere.\n\nI got my Bachelor's in 2019, so there would be a gap in my resume where it looks like I haven't been doing anything, but also there's been COVID so I'm not sure many employers would bat an eye. Anyone have any insights?", "author": "AgentKiwi", "created": 1632690154, "retrieved": 1632952019, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"heft0ub": {"link": "/r/GradSchool/comments/pw2blg/i_intend_to_finish_grad_school_parttime_while/heft0ub/", "text": "I think putting this on your resume will probably hurt your chances of getting a full-time job. Many managers will be concerned that your part-time education will be a distraction from work and a drain on your time/energy.\n\nI also think it's very unlikely that you'll get a raise at a job for having an advanced degree that isn't directly related to the field you're working in.", "author": "ucscpsychgrad", "created": 1632719008, "upvotes": 1}, "hefqiug": {"link": "/r/GradSchool/comments/pw2blg/i_intend_to_finish_grad_school_parttime_while/hefqiug/", "text": ">I got my Bachelor's in 2019,\n\nIf you're working on a PhD, you still have many years ahead of you before you're done. So it's not like you're someone applying for a job that's planning on leaving in a year or two. \n\nIf you're doing your PhD part-time, it could be another six or seven years, right? And how frequently do people switch jobs in information technology?\n\nBy the way, I was unfamiliar with color science and just read up a little bit on it. Sounds fascinating. And you know, an employer might be impressed by the end of the other that you're studying that, too.", "author": "raistlin65", "created": 1632717302, "upvotes": 2}}}