{"sid": "fd1488", "link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/", "title:": "Dean of Sciences at UC Santa Cruz thinks there's \"no reasonable salary\" the school can offer it's students to not be rent burdened.", "text": "https://dev-pbsci-intranet.pantheonsite.io/2020/03/02/addressing-the-graduate-student-strike/\n\nDean Paul Koch sent an email to physical sciences bragging about low STEM TA participation in the strike (STEM students are very sympathetic to the strike but TA a lot less and are paid more).  He then claimed that offering a salary that doesn't rent burden students is not fair because the hourly rate for the part time work would be higher than other FTE employees, and re-hashed the usual line about tuition being a part of compensation.\n\nNot only is this email ignorant, it's a flat out lie. I was compensated perfectly well as a STEM grad student while at UCSC, easily at the level that is being asked for by strikers, and so were all other grads in my program. This is what university leadership actually thinks being a grad student is like.\n\nAvoid this place at all costs, the admin are woefully mismanaged from UCOP down.", "author": "willfightforbeer", "created": 1583268076, "retrieved": 1632845354, "over_18": false, "upvotes": 525, "upvote_ratio": 0.97, "comments": {"fjm00gg": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjm00gg/", "text": "Aren't STEM student stipends supplemented by the grants their advisors hold?  Typically you have some base stipend from the University that is going to be like $17k and then on top of that you get an extra like $15k from your fellowship, training grant, or PIs grants that isn't coming from the University.  So even if you get $32k a year the University is only paying $17k of that.\n\nI mean that is usually how it works...its not that the University pays STEM students more, its that STEM students stipends are supplemented by external grant funding.  As a STEM student you should know that right?", "author": "Grevious47", "created": 1583458437, "upvotes": 1}, "fjgstok": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjgstok/", "text": "As a non-native english speaker I hate double negativity", "author": "sasukevietnan", "created": 1583334764, "upvotes": 1}, "fjgfyoo": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjgfyoo/", "text": "Is he related to the Koch brothers??? Because that explains a FUCKING LOT of these ignorant and inhumane comments :)", "author": "minhquan3105", "created": 1583325411, "upvotes": 1}, "fjgbpm2": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjgbpm2/", "text": "And this is exactly why grad students should be considered employees and allowed to unionize properly. Without grad students, lab work will not be done, papers will not be published, grants will not be renewed. We are the success of our programs, not just our PIs. \n\nThe NLRB can't hold us hostage as 'students' when we work as labourers/employees.", "author": "LexicalFugue", "created": 1583320970, "upvotes": 6}, "fjg4cvg": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjg4cvg/", "text": "What does UC Santa Cruz have for graduate programs that no one else has? I would never ever go anywhere near California for graduate school lmao.", "author": null, "created": 1583310904, "upvotes": 1}, "fjg3ujg": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjg3ujg/", "text": "I was offered $44K at UCSC in a STEM discipline. My guess is it's discipline dependent. I'm a bit behind on who exactly is striking or leading the strike there", "author": "resorcinarene", "created": 1583310260, "upvotes": 2}, "fjg1j3v": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjg1j3v/", "text": "This question is rather general since I couldn't get information about the topic in asking but seems like it's really the place:\n\nDo grad students get paid in general? Is it common?", "author": "ResponsibleWill", "created": 1583307484, "upvotes": 1}, "fjfz997": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjfz997/", "text": "its\\*", "author": "deamagna", "created": 1583305025, "upvotes": -1}, "fjfx4c7": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjfx4c7/", "text": "I don’t get it, he was a grad student before.", "author": "Hankune", "created": 1583302944, "upvotes": 1}, "fjf5x07": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjf5x07/", "text": "With housemates, living in Santa Cruz is completely doable.  If you have children or you are *choosing* to live alone, then your rent burden will necessarily be higher and you should expect that.  They offered to put aside 7M/yr for a housing supplement for us.  This school has treated me very well, always with respect and care, and they've even come through with emergency cash for me when I needed it.  Maybe some people are too proud to utilize these programs, but I had no problem asking for help, and they were very caring with their responses.  \n\n&#x200B;\n\nThe PR that the strikers are putting out is full of flat out lies.  Feel free to ask me about any of them and I'll be happy to give an honest answer..", "author": "KerrigansRage", "created": 1583284989, "upvotes": -14}, "fjf3dzg": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjf3dzg/", "text": "Were these concerns of rent burden brought up during contract negotiations for UCSC with the union and the university? I wouldn’t suspect the extremely high cost of living problem occurring overnight... can someone catch me up to how/when/what gave the push for the strike in the fall?", "author": "smile-sunshine", "created": 1583283448, "upvotes": 3}, "fjf1k9t": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjf1k9t/", "text": "[deleted]", "author": null, "created": 1583282337, "upvotes": -7}, "fjezbmm": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjezbmm/", "text": "I actually considered applying for next round of admissions, (my year’s round), but now I’m definitely going to steer clear.", "author": "catfeinee", "created": 1583281030, "upvotes": 9}, "fjevm9n": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjevm9n/", "text": "OP: Can you elaborate on how this is a \"flat out lie\" ?\n\nAlso, the issue with compensation is much harder felt by non-STEM grads, so using your compensation as a former STEM grad to make the point that grads are now compensated less fairly doesn't make any sense. I'm a STEM grad at UCSC and I am compensated fairly. I support the strike because many non-STEM grads aren't compensated fairly but also think using rent burden as a metric to determine fair compensation isn't reasonable (I'll likely pay >30% of my pay towards housing after I graduate but wouldn't use that to negotiate my salary).", "author": "Old_Croc_or_Bust", "created": 1583279048, "upvotes": 5}, "fjet1a7": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjet1a7/", "text": "Show your work Dean Koch.", "author": "shindleria", "created": 1583277693, "upvotes": 8}, "fjeq5bc": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjeq5bc/", "text": "I am shocked absolutely shocked that a school administrator would be out of touch on an issue faced by students", "author": "lift_heavy64", "created": 1583276370, "upvotes": 61}, "fjelya4": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjelya4/", "text": "Even if this is true, then why have a graduate school in the first place?", "author": "anzara2Y5", "created": 1583274061, "upvotes": 17}, "fjelofc": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjelofc/", "text": "Its recruitment season. Makes me think the prospective students with options will certainly nope out this year (I see this as a positive pressure for striking students against the university).", "author": "CTR0", "created": 1583273954, "upvotes": 130}, "fjekqka": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjekqka/", "text": "Its like they're trying to turn them on eachother.", "author": "Snowpossum", "created": 1583273571, "upvotes": 10}, "fjek1kp": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjek1kp/", "text": "Tuition should not be considered part of compensation. Almost all graduate programs offer tuition remission, and any program that did away with that would not attract the highest quality graduate students. Tuition remission is a default, at this point. \n\nI'm curious how much tuition UC Santa Cruz wastes on its althetic program. Unless the athletics programs independently generate profit for the university, maybe it's time to bulldoze all the sports stadiums and build affordable housing for students.", "author": "False-Guess", "created": 1583273173, "upvotes": 68}, "fjeirpi": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjeirpi/", "text": "Why not have affordable housing specifically for graduate students the way other universities do like University of Florida or LSU?", "author": "Charles_Polished", "created": 1583272454, "upvotes": 142}, "fjehrat": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjehrat/", "text": "[deleted]", "author": null, "created": 1583271895, "upvotes": -21}, "fjehc1a": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjehc1a/", "text": "I was once a grad student so I understand how hard it is to live with that stipend. However, there is no one pointing a gun at your head to force you to do grad school. If you want higher pay, go get a job. Remember, your status is still student and you should be grateful that you are having a scholarship, no matter how much it is.", "author": "Chopino2019", "created": 1583271664, "upvotes": -23}, "fjeh8w2": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjeh8w2/", "text": "Wow what a convoluted way for the dean to say: \"we know you can't actually live on the salary we're paying you but oh well bummer for you\"", "author": "melonLord12", "created": 1583271617, "upvotes": 285}, "fjegwux": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjegwux/", "text": "Eh PhD wages seem to be low almost everywhere. Of course that’s no excuse for not paying livable wages. That being said I’m glad I dodged this bullet and went elsewhere for school. If one coin flip in my life had gone differently I could be one of those students right now.", "author": "OneMeterWonder", "created": 1583271438, "upvotes": 42}, "fjebmf3": {"link": "/r/GradSchool/comments/fd1488/dean_of_sciences_at_uc_santa_cruz_thinks_theres/fjebmf3/", "text": "How much of a raise are the students asking for? But, being from California I highly doubt that the state could afford to pay graduate students enough to afford to live there. When i was looking into grad school there was next to no chance i was going ever make the choice to stay in California because it would require going into debt, so i went to grad school where it is much more affordable. These students made the choice to stay in an unaffordable state and they want the universities, that are already having trouble paying for everything they need to pay for, subsidize their bad life choices. These grad students seem to be extremely self centered and ignorant", "author": "Bashere9", "created": 1583268822, "upvotes": -76}}}