{
  "sid": "qlba4f",
  "link": "/r/GradSchool/comments/qlba4f/drop_the_class_or_push_through/",
  "title:": "Drop the class or push through?",
  "text": "I am in my first semester of graduate school, and I am struggling in one of my classes. The class in question is a 3 credit, 900 level course with a mix of grad and undergrad students. After two assessments I have a 62% in the class, and I am debating dropping it. I feel like I have two choices, 1) I drop the class or 2) I push through and try to get a better grade with the support the professor has offered. If I were to drop, my concern is that I would have wasted some time and this would mean I'd need to extend my time here to cover the 3 credits I lost by dropping. I'm not afraid of a W on my transcript and I have till 11/26 to drop if I'd like. If I were to push through, my professor has offered to review my notes, look over assignment submissions early, and meet weekly to discuss the main points of the lecture. My concern with this is that I will be investing too much time if I do this. We have an assignment due 11/11, but I will need to turn it in this week in order to give him time to review and myself to revise. I seem to be the only student in the course who is having this level of difficulty, and I am beginning to wonder if my learning style just does not match with his teaching style because it's clearly working for others. He is an adjunct professor, and the way he delivers information is incredibly confusing to me, lacking any clear structure or outline. I have spoken with my program coordinator who suggested dropping, the professor of the course who offered support, and my graduate advisor who recommended staying on. What do I do?",
  "author": "recspecticular",
  "created": 1635879149,
  "updated": 1635891374,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hj1nv60": {
      "link": "/r/GradSchool/comments/qlba4f/drop_the_class_or_push_through/hj1nv60/",
      "text": "Given your situation is an outlier in the class, a W is better than a blow to your GPA, or worse, less than a B. I’m an older student who has struggled with similar situations in the past (ADHD induced); opportunities to explain less than pretty letters become hard to come by. My vote is take the W, and find an alternative route to the class (virtual, diff instructor if available, or audit and return next year). I’m sorry you’re in this situation :-(",
      "author": "leaderoftheband19",
      "created": 1635879427,
      "upvotes": 3,
      "replies": {}
    }
  }
}