{"sid": "pm0xvb", "link": "/r/GradSchool/comments/pm0xvb/why_are_so_many_departments_so_toxic/", "title:": "Why are so many departments so toxic?", "text": "In fairness, I find computer science and tech departments to be pretty non-toxic. But why is departmental toxicity such a common complaint? The awkwardness, the needless snark, and brooding resentment......is it that hard to just be nice to people like any other workplace?", "author": "astronomical_bark", "created": 1631335800, "retrieved": 1632844632, "over_18": false, "upvotes": 43, "upvote_ratio": 0.9, "comments": {"hcfeoas": {"link": "/r/GradSchool/comments/pm0xvb/why_are_so_many_departments_so_toxic/hcfeoas/", "text": "The awkwardness and resentment seem to come from\nhow long and how political it can be to rise to a level of security in a department. In terms of awkwardness, a lot of that seems to come from competing world views and below average social skills. \n\nI’ve been in work places from construction, to secondary education, to business management, and without a doubt my first graduate program was the most toxic workplace I’ve ever seen by a country mile", "author": "Stoic-Way", "created": 1631363094, "upvotes": 3}, "hcf9k8a": {"link": "/r/GradSchool/comments/pm0xvb/why_are_so_many_departments_so_toxic/hcf9k8a/", "text": "A combination of two things;\n\n1. Strict hierarchy.\n2. We ask too much of our professors. We want them to be highly technical specialists, but also empathic teachers, and also administratively competent, and also communication powerhouses. Very very few people check all those boxes. In the end universities primarily care for the communication (getting grants and attracting students) and technical expertise (getting published). The rest is just not as important.", "author": "cephalord", "created": 1631359682, "upvotes": 18}, "hcf54z6": {"link": "/r/GradSchool/comments/pm0xvb/why_are_so_many_departments_so_toxic/hcf54z6/", "text": "I think it comes from how academia functions.\n\nAn academic’s job is to do research and to review the research of others. The review process usually means *negative* feedback though. ~95% of all journal club discussions and presentation questions are focussed on finding flaws in the work, so are paper reviews and draft reviews. There are *always* limitations that can be pointed out. There are *always* flaws or mistakes that can be poked. Academia is constantly critical, and not usually in a constructive way. \n\nSo academics spend all of their time picking others’ work apart. \n\nIt takes a mindset shift to get away from that negativity and I don’t think most people can (or will) do that for their lunch break. You end up spending all day around people who are looking for negatives in everything.", "author": "officially_anxious", "created": 1631356271, "upvotes": 30}, "hcerwx9": {"link": "/r/GradSchool/comments/pm0xvb/why_are_so_many_departments_so_toxic/hcerwx9/", "text": "My department has big personalities, but is far from toxic so I feel lucky. Working with other folks in computer science and statistics at my university, those are the most toxic departments at my university where students are overworked and abused. There was a big scandal in, iirc, the engineering department with an abusive professor. \n\nI think the way graduate school is structured inherently invites toxic and abusive behavior. Grad students have no power, and faculty have all the power. If you are a project assistant, you are dependent on your supervisor for your income and tuition remission and there often aren't positions you can just move into if that relationship turns sour. There just aren't many good mechanisms for disciplining abusive faculty members that do not disproportionately impact grad students. For example, if a professor is fired, everyone who is funded by that person and advised by that person is going to be impacted, and many departments don't have the ability to deal with that situation without disrupting the students' education or finances. \n\nThen there's also the fact that, after you get your PhD, many positions *still* want letters of recommendation so that can be held over people's heads. Personally, I think letters of recommendation should have been done away with years ago. It might have made sense in the 1700s when it took half a year to get from New York to California, but the internet exists and people's work history is available online so letters of recommendation just seem like some ancient practice that people hold onto for no particular reason. Letters of recommendation also don't have any value imo because they're almost always good. Why would people ask for a letter of recommendation if they aren't confident they'll get a good one? It's no surprise everyone looks good on paper.", "author": "False-Guess", "created": 1631344487, "upvotes": 16}, "hcenueg": {"link": "/r/GradSchool/comments/pm0xvb/why_are_so_many_departments_so_toxic/hcenueg/", "text": "No job security + formal hierarchy = a bad time no matter what the industry. Academia is just too competitive right now for people to let their guards down. \n\nIn undergrad I was lucky(??) enough to witness a department where everyone involved was actually quite nice to each other but it was such a hivemind that it freaked me and several other students out anyways.", "author": null, "created": 1631341114, "upvotes": 10}, "hcekdo7": {"link": "/r/GradSchool/comments/pm0xvb/why_are_so_many_departments_so_toxic/hcekdo7/", "text": "Have you talked to anyone working in other workplaces? Lots of toxicity in corporate life. It's just how people get sometimes.", "author": "mediocre-spice", "created": 1631338412, "upvotes": 31}}}