{
  "sid": "q0oxlb",
  "link": "/r/GradSchool/comments/q0oxlb/staying_in_my_masters_in_data_science_vs_dropping/",
  "title:": "Staying in my Masters in Data Science vs. Dropping out to start MBB earlier",
  "text": "I just started a masters degree in data science, and I realize now that I really dislike the material and it’s not for me. I did my undergrad in Business, so everything in the masters is very new and stressful for me, and honestly my grades have not been that great. I already have a job secured at an MBB consulting firm, and they said that it is okay if I drop out and start working earlier. I want some opinions on whether it’s worth completing the degree or not.\n\nHere is some more background and some questions I am asking myself while making the decision. I do want to work in marketing in the future, whether that is consulting with a marketing focus or outside of MBB — working with data scientists is a part of marketing, but do I need a whole masters degree for that? If there are a couple specific skills I need I could always just learn them through online certifications or courses. Another consideration is, I do plan on pursuing an MBA later on, so will a poor GPA in my data science masters impact MBA admissions?",
  "author": "ruch4",
  "created": 1633289553,
  "updated": 1634099958,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {
    "hfazu80": {
      "link": "/r/GradSchool/comments/q0oxlb/staying_in_my_masters_in_data_science_vs_dropping/hfazu80/",
      "text": "(Partially deleted for anonymity.)\n\nYou absolutely don't need your master's in data science to do consulting. It's great that you are at a top consulting firm so things can definitely sail smoothly regardless. Yes, digital marketing in particular will have contact with data science and the skillset would be helpful. I'm not sure on the effect on your MBA.\n\nThat said, if you want to tough it out, let's chat about what is difficult for you. How many more semesters for your program? What are the titles of the hard courses? Are they heavy on statistics, programming, something else?",
      "author": "a-perpetual-novice",
      "created": 1633314544,
      "upvotes": 1,
      "replies": {}
    }
  }
}