{"sid": "po9x6t", "link": "/r/GradSchool/comments/po9x6t/difference_between_company_sponsored_phd_and/", "title:": "Difference between company sponsored Ph.D and advisor funding", "text": "First off, love you guys here, you've all given me advice in the past and I really appreciate the support group this subreddit is. \n\nI have been given the possible opportunity to drop my current grad program and go work for a company, who has offered to fund my Ph.D but at another school, a much much higher ranked one. The company will also offer me a salary if I work at the company every Friday. \n\nIt seems like a great deal, but, it feels too good to be true. My current advisor (who is slightly toxic), told me that it is going to be impossible to focus on work and on ph.d so I won't get the full ph.d experience. And I do want to keep my options open to go into academia if I decide to in the future. \n\nIs there a difference in doing a ph.d with a company vs. strictly with an advisor?", "author": "KingofSheepX", "created": 1631648273, "retrieved": 1632952621, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hcv2n1l": {"link": "/r/GradSchool/comments/po9x6t/difference_between_company_sponsored_phd_and/hcv2n1l/", "text": "Is the company position a research position? Will you be collaborating on projects with the company? That sounds way way better than your current situation regardless but those would be important questions to ask.\n\nI am funded externally from a company that I collaborate with and it's been an amazing experience, couldn't recommend it enough.  I'm technically working at the company during summers but since covid its basically been the same all throughout. \n\nMy thesis project isn't even the same as what I've been working on for the company and I've made time for it. \n\nI would leave regardless of whether or not you get the 'full phd experience', it sounds like your proff is just trying to get you to stay.", "author": "Beor_The_Old", "created": 1631650054, "upvotes": 5}}}