{"sid": "pwqhn6", "link": "/r/GradSchool/comments/pwqhn6/tips_on_giving_a_video_presentation_on_a_research/", "title:": "Tips on giving a video presentation on a research article?", "text": "I have an assignment where I have to record a 10-12 minute presentation with visuals describing a recent single peer-reviewed paper. I will not be talking about my publication, but someone else's publication in my field. I have to describe,\n\n* The context of the paper \\[What is the problem the paper is addressing?\\]\n* The key premise of the paper (usually encapsulated in the paper abstract)\n* The methodology used to reach the conclusions\n* The primary result of the paper\n* Figures to illustrate my summary\n\nI was wondering if you happen to have any tips for preparing this presentation? How should structure the layout of the presentation? I am also not savvy with video creation, so would it be okay for me to use Zoom to record my Powerpoint?", "author": "EpicGusher", "created": 1632776460, "retrieved": 1632951991, "over_18": false, "upvotes": 0, "upvote_ratio": 0.5, "comments": {"heis6cj": {"link": "/r/GradSchool/comments/pwqhn6/tips_on_giving_a_video_presentation_on_a_research/heis6cj/", "text": "First off, Powerpoint has an integrated presentation recorder so if you've created your powerpoint, there's no need to use Zoom. Go to Slide Show --> Record Slide Show. Pause for a second between each slide because it saves each slide as a separate video, so if you mess up on one slide you can re-record it if there's a little space. Also note you can make use of the pen and highlight tools to interact with your slides and there's a notes feature to read cards. Don't forget to export as some kind of movie file (.mp4 or something).\n\nAnyway... you have an outline for your presentation right there, I'd suggest working off of that. Paper presentations for class are pretty common in my field, and we generally focus on describing the figures in detail (because they usually highlight all of the components you mention in the outline) and presenting it in a similar order as you would write a paper (methods, results, discussion, implications). So I'd suggest reading the paper with the questions you have above in mind, and creating bullet points to each of those questions - those, in statement form, can become your slides.", "author": "Planetary_Piggy", "created": 1632779893, "upvotes": 1}}}