{
  "sid": "qyouva",
  "link": "/r/GradSchool/comments/qyouva/which_ta_position_to_choose/",
  "title:": "Which TA position to choose?",
  "text": "Dear All,\n\n   Thanks for taking the time to read this in advance. I'm stuck on a decision I have to make relatively soon regarding two TA positions to choose between. \n\n   For background, for Fall 2021 I was in a political science MA program, but my interests have switched to philosophy so I'm switching to a philosophy MA program at the same school for Spring 2022 and my classes will transfer as electives.\n\n   During Fall 2021, I was a TA for the political science department. I did my BA here as well in political science so they love and value me entirely. My professor said he would do anything to keep me on (even \"break his own arm,\" he said), even if I switch to philosophy, as long as I take one political science class for each semester I TA for, which is not a problem due to free funding (Hazlewood act) (I also plan on doing this anyways so I have 18 hours and can teach both philosophy and political science at the collegiate level). \n\n   However, the philosophy department also offered me a TA position in the Spring. I am much more interested in the content in philosophy, but political science values me incredibly and would do anything to keep me on board with them. My job in political science is relatively easy, and philosophy seems like I would do more work, but it seems like it would be work I actually would want to do. My coworkers in political science are amazing, and I don't know if philosophy has the same comradery that the political science department maintains. My boss in political science is a really great guy, we've known one another since my time in undergrad and he adores me. He said he would let me choose any position (regarding teachers) I wanted for political science, even offering up the opportunity to be his personal TA (which he has never done before). \n\n   Pros for switching to philosophy: More interesting content, more aligned with my future, new connections\n\n   Pros for staying in political science: deepen my connections, stay loyal, keep great coworkers\n\n   I'm stuck because I feel these are both great positions and opportunities. I'm afraid that if I stick with political science I may rob myself of the opportunities that might present themselves in philosophy, since that is ultimately the field I want to be in. \n\n   What do you all think? What would you all do in my situation? Thanks so much for taking the time to read this and I look forward to seeing what you all have to say!",
  "author": "Stone2kSWAG",
  "created": 1637475762,
  "updated": 1637689922,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlizf84": {
      "link": "/r/GradSchool/comments/qyouva/which_ta_position_to_choose/hlizf84/",
      "text": ">I'm stuck because I feel these are both great positions and opportunities. I'm afraid that if I stick with political science I may rob myself of the opportunities that might present themselves in philosophy, since that is ultimately the field I want to be in. \n\nBeing a TA is an opportunity to further build your knowledge in the discipline you want to be in. \n\nSo unless being a TA in political science would somehow further your career goals after your MA degree, seems better to teach in philosophy. Especially if you hope to get a PhD in philosophy, as this TA experience could make you more eligible to teach advanced philosophy classes.",
      "author": "raistlin65",
      "created": 1637513229,
      "upvotes": 2,
      "replies": {}
    },
    "hljqyq7": {
      "link": "/r/GradSchool/comments/qyouva/which_ta_position_to_choose/hljqyq7/",
      "text": "It sounds like either would be a great option! Will you still have the option to go back to being poli-sci TA if you're not one in the spring semester? If you will, I think I'd try the philosophy. If you're not or if you're expecting a very busy semester I'd personally stick to the less time consuming one. TAing is only one part of grad school and it sounds like you'll be taking quite a heavy course load. If you want to teach in both fields it'll probably be useful to have TA experience in both fields.",
      "author": "Puzzled_Season_1881",
      "created": 1637524197,
      "upvotes": 2,
      "replies": {}
    }
  }
}