{
  "sid": "qqhkq2",
  "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/",
  "title:": "Grad students, have you ever thought about taking your novel ideas the entrepreneur route?",
  "text": "I’m a research assistant who just graduated college and have been conflicted on the best route to build my ideas into fruition, specifically in healthcare technology. What are your your thoughts on the academia/research v entrepreneurship route. Have you guys ever been conflicted in the path to take your ideas?",
  "author": "falestinia",
  "created": 1636504304,
  "updated": 1636656533,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hk0f6op": {
      "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/hk0f6op/",
      "text": "I've certainly thought about it, the potential money aspect is certainly tempting. However, you have to actually care and like business to some degree i.e. put the work/ passion in to actually be successful and I'm not currently that person.",
      "author": "laziestindian",
      "created": 1636506994,
      "upvotes": 6,
      "replies": {
        "hk0fur3": {
          "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/hk0fur3/",
          "text": "^ This. Totally agree.\n\nAnd it also can cost a lot of money to develop an idea into a product, and figuring out how to get that money can be more difficult on your own.",
          "author": "raistlin65",
          "created": 1636507294,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hk0l510": {
      "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/hk0l510/",
      "text": "There’s a good chance that if you developed the idea at any point during your graduate program, the university gets IP rights to the product. Even if it’s not your research project, if you use university resources (computer, WiFi, etc) then the university wants some of the IP pie. It’s pretty discouraging.",
      "author": "NeuroticPhD",
      "created": 1636509686,
      "upvotes": 6,
      "replies": {
        "hk0m6hd": {
          "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/hk0m6hd/",
          "text": "Yikes! Great point!",
          "author": "falestinia",
          "created": 1636510154,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hk13lpt": {
      "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/hk13lpt/",
      "text": "Not me, but I’ve worked in a startup and know folks in the startup consulting industry. I helped build one from the ground up, and it’s tough. Taking the entrepreneurship route is more than just coming up with ideas. There’s a lot more business/management/actually running day to day operations-type of tasks involved. From my experience (my cousin was the ideas guy, I did operations), you’ll need to know a bit of everything, and you’ll need a solid team. Even then, not all startups end up becoming successful (you’d have to be like a unicorn). We dissolved ours after running out of steam.",
      "author": "AccioAddie",
      "created": 1636518496,
      "upvotes": 2,
      "replies": {}
    },
    "hk27kmk": {
      "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/hk27kmk/",
      "text": "I’ve had a bunch of great ideas, but after my PhD, I have no interest in working crazy hours and living my life around work. That’s what running a business is and I just don’t want that anymore. Maybe in the future, I’m not sure.",
      "author": "fserv11",
      "created": 1636548017,
      "upvotes": 1,
      "replies": {}
    },
    "hk2cbaq": {
      "link": "/r/GradSchool/comments/qqhkq2/grad_students_have_you_ever_thought_about_taking/hk2cbaq/",
      "text": "Unless someone actually pursues a PhD, they don’t actually know the technical aspects of developing and testing a hypothesis, let alone for real world applications.",
      "author": "animelover9595",
      "created": 1636550594,
      "upvotes": 1,
      "replies": {}
    }
  }
}