{"sid": "j3z95y", "link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/", "title:": "What are some strategies to combat the Zombie-like feeling that a lot of us are going through right now?", "text": "I'll start: \n\n1. When I can't concentrate on reading, I do 10 pushups and 10 burpees. It wakes me up moderately. \n2. I put together my old band instrument and start playing something. Even just scales. I remember how happy it used to make me to play, and it still does. \n3. Blue light glasses came in a few days ago. I wear them a lot and it's been helping me feel less fatigued when I'm online all day.", "author": "Prof_Eden", "created": 1601660804, "retrieved": 1632845996, "over_18": false, "upvotes": 329, "upvote_ratio": 0.98, "comments": {"g7lgaao": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7lgaao/", "text": "i feel zombie-like rn because my average sleep for the past two weeks tracked at 4 hours. i am not sure if push-ups and such can help with that =/\n\nedit - i will say, i really like these suggestions for other scenarios! i just really need sleep as my priority.", "author": "coffeejaunt", "created": 1601776119, "upvotes": 1}, "g7ja1j4": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7ja1j4/", "text": "For me it's just being kind and setting boundaries really. \n\nI categorically refuse grad school to invade my gym time, so I schedule my workout session with the same priority as my classes. \n\nI never give myself shit for not being as productive as I expected and I *always* take a few seconds to congratulate myself on the work I *did* manage to do. \n\nI set up numerous happy hours and coffee. \n\nI tried having one single day not dedicated to school, but it doesn't really work. So I try to set up some time every day (like I won't start school work until 1pm, I *always* have to get *at least* 6-7 hours of sleep etc.", "author": "Murderous_squirrel", "created": 1601748858, "upvotes": 1}, "g7ick6m": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7ick6m/", "text": "I got two apps- freedom which works on my laptop by blocking distracting websites and Forest for my phone which plants a tree when you're not on your phone for a while. With forest you can plant trees with friends which I think would help people stay accountable. If you want to be friends on Forest lemme know :D", "author": "salt_mermaid", "created": 1601726112, "upvotes": 1}, "g7hxhhp": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7hxhhp/", "text": "What are these blue light glasses you speak of.", "author": "Empire_Collapsing", "created": 1601714246, "upvotes": 1}, "g7htgke": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7htgke/", "text": "I'm not a student, but I use most of my free time to study or practice my instruments these days. My personal time economy is experiencing a recession of its own, which is forcing me to find new ways to manage my time and stay motivated. When weather permits, it really helps me to go outside and sit in the grass. I find myself combating  negative thought loops and imposter syndrome more than I normally do. Does anyone have suggestions for handling those kinds of thoughts?", "author": null, "created": 1601710655, "upvotes": 1}, "g7hqn4r": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7hqn4r/", "text": "Vary your routine.\n\nThe monotony of daily life really aggravated my zombie syndrome.\nSimply doing unexpected stuff, like going to the zoo, meeting with a few people in an outdoor park with sufficient distancing, etc., really broke up my mental fog.\n\nI forget really often how important it is to live a varied life, not just for general fullfilment, but also for mental performance.", "author": "Mephisto6", "created": 1601708106, "upvotes": 1}, "g7hcq7l": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7hcq7l/", "text": "Switch to some fast music and start dancing around. And clear some mess of a table or desk. Or I eat cake for lunch and tell myself \"this moment is mine\", but then I got do some big task for a few hours. Feel accomplished by dinner. Read something for an hour.  And go to bed by 9:30. Oh and it's about to be hot cocoa season so I'll save it till I've earned it.", "author": "spaghettiarnold", "created": 1601697035, "upvotes": 1}, "g7h80vm": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7h80vm/", "text": "wine", "author": "iammaxhailme", "created": 1601694158, "upvotes": 2}, "g7h46ay": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7h46ay/", "text": "1. 7 hours of sleep a night minimum\n2. Drink WAY more water than you think you need to \n3. Regular exercise\n\nIf I had taken this advice seriously when I was younger it could have saved me years of feeling like shit on a regular basis.", "author": "drmantist123", "created": 1601691947, "upvotes": 3}, "g7h2ur1": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7h2ur1/", "text": "Literally the same.  Take a walk, pull out those etudes, and blue light glasses from Amazon.  Also drinking a margarita rn, lol.", "author": "ReformedTomboy", "created": 1601691197, "upvotes": 2}, "g7h0q61": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7h0q61/", "text": "Get outside for sunlight a few times per day, most importantly in the morning (that spectrum of light may help us wake up more).\n\nHave a clear separation of work and you time; maybe work from 9am to 7pm, and then chill so you can get to sleep by midnight.\n\nDo hobbies to break up the monotony.", "author": "JerkJenkins", "created": 1601689885, "upvotes": 2}, "g7h0o4y": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7h0o4y/", "text": "Position your desk so that you see outside your window. Works wonders. Thank me later.", "author": "Pesticidko", "created": 1601689850, "upvotes": 2}, "g7gxtwm": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7gxtwm/", "text": "Can you link to the blue light glasses you bought?", "author": "throwaway_torpedo", "created": 1601688048, "upvotes": 2}, "g7gbvwz": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7gbvwz/", "text": "I've started working back in lab, but I had a couple of things when I was working from home all day. I took pretty long lunches and would go on a really long walk (like 3-4 miles) just to be outside when it was nice and pretty and to move my body. Then I would start back working around two or three and finish a little later than I normally would. Breaking my day into two pieces helped me work more on discreet tasks and getting them finished instead of juggling four or five and only making nominal progress on any of them.", "author": "bio-nerd", "created": 1601676064, "upvotes": 1}, "g7g4d8e": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7g4d8e/", "text": "Something for me that I really have to monitor his eating and water. With the busy stressful lives we live, it can be very easy to forget to eat or drink enough water most days. I can feel a noticeable difference between the days following eating and drinking enough and not eating or drinking enough. \n\nAlso, I've noticed getting sunlight. (insert biology about serotonin, melatonin, and circadian rhythm here) but I have noticed if I don't see sunlight all day, I get really sleepy. going for a 5-10 minute walk 2-3 times a day helps me quite a bit also.", "author": "Snowbizzy", "created": 1601673327, "upvotes": 5}, "g7g13cp": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7g13cp/", "text": "Be politically active. Helps you feel less useless. Even if it's pouring an hour a week into work that a local group needs, it matters.", "author": "PrajnabutterandJelly", "created": 1601672121, "upvotes": 2}, "g7fwrii": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fwrii/", "text": "You can use the flux plugin to do to your screen what blue light glasses do to your eyesight", "author": "isaac-get-the-golem", "created": 1601670542, "upvotes": 2}, "g7fwqr1": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fwqr1/", "text": "Cut your objectives into smaller pieces. Write one page, read one paper, whatever...", "author": "Lord_Blackthorn", "created": 1601670535, "upvotes": 2}, "g7fuxqw": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fuxqw/", "text": "When I start working I close everything currently open on my computer so there aren't any distractions beyond the task at hand. I think it also helps if you have something to tend to outside of grad school. I started playing guitar again during quarantine for the first time since middle school, and now I think I'm better than I ever was. I've been doing a lot of gardening on my patio this summer, and I have a few jars of my own flower I am curing. I'm also getting into buddhism.\n\nI think it's easy to fall into the zombie feeling if you allow your life to be too one dimensional. I certainly had that problem at the beginning of the quarantine. Now, when I describe myself, grad student is the last thing I identify with. I am a philosopher, a musician, an outdoorsman, and a gardener, who happens to be attending grad school.", "author": "bigvenusaurguy", "created": 1601669883, "upvotes": 1}, "g7ftoqs": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7ftoqs/", "text": "Laptop+treadmill.", "author": "DJGlennW", "created": 1601669428, "upvotes": 1}, "g7ft489": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7ft489/", "text": "Get a dog. I mean, I suggest this to everyone all the time but it's singlehandedly keeping me sane and grounded during grad school. There's a huge body of evidence to support the physical and mental benefits. Mine keep me on a schedule, keep me moving and exercising every day, I find I'm more organized/clean with the dogs around, and there's a decent bit of 'forced' downtime. Nothing like burying your face between their ears on a stressful day, either. \n\nI take the dogs on a walk with a podcast when I'm working at home and need the break. At school/in the lab, I try to take a walk outside. Moving my legs really helps reset me. Pre-COVID we had a 3 pm coffee hour every day on my floor that was very helpful. \n\nI like to cook or do something relatively simple that has a solid payoff, too. Something that occupies body and mind and has a positive outcome.", "author": "corgibutt19", "created": 1601669222, "upvotes": 13}, "g7fsabv": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fsabv/", "text": "If I can work for a half hour, I allow myself a chapter of reading (fun reading). Though I’m currently sitting through Citiprogram training for research/investigators and the Belmont Report has me wanting to drool and fall asleep.\n\nEdit: just rewarded finishing over 8 hours of training with cheesecake. I hope you find what works!", "author": "imasinger", "created": 1601668918, "upvotes": 1}, "g7fs5qj": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fs5qj/", "text": "Spend more time in nature. Ive taken up hiking and its done wonders for my mental health.", "author": "redditknees", "created": 1601668872, "upvotes": 6}, "g7fqxhs": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fqxhs/", "text": "Go for a walk outside. Try to get into open spaces. Take regular breaks. Use the promodoeo technique. Have conversations with random people. Drink ice water. Meditate. Lift. TURN OFF YOUR PHONE AND PLACE IT IN ANOTHER ROOM. Sign out of social media. Go for a run. Watch something that makes you laugh. Don't eat processed foods/simple carbs. Eat food that's low on the glycemic index. Avoid coffee, especially first thing in the morning when your cortisol levels are highest, drink some tea instead. Listen to music. Do something creative. Journal daily. \n\nAs someone working through ADHD and now in grad school, I've spent my life (most of it unknowingly) trying to accommodate for this deficiency.", "author": "wittystonecat", "created": 1601668432, "upvotes": 10}, "g7fpaw0": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fpaw0/", "text": "Walking really helps me combat the sort of fatigue I'm feeling during this time.\n\nI greatly limited social media and how much I pay attention to the news, and this has helped my overall mental state.", "author": "trashpandalikespizza", "created": 1601667848, "upvotes": 1}, "g7foqs0": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7foqs0/", "text": "This might sound dumb, but I went on a date with my girlfriend instead of staying at my desk half-working half-wasting time. We went to a bar and got dinner. We hadn't been out anywhere since March, and it felt really pretty normal aside from the dystopian aspects. I dunno, but I feel like that little shot of normalcy helped break through some funk. Take a day off and do something fun is my advice. Give yourself something in the evening to look forward to and get off the computer. That feels more important to me than any productivity life hack.", "author": "Semantix", "created": 1601667645, "upvotes": 18}, "g7fnvy6": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fnvy6/", "text": "* pomodoro/time boxing\n* weekly reviews/next actions \n* regular exercise\n* spatial separation of work and personal \n* frequent zoom happy hours with friends and colleagues\n* make external commitments (promise manuscripts to colleagues etc)\n\nPlease don’t ask how well I’m implementing these", "author": "ccots", "created": 1601667324, "upvotes": 39}, "g7fjy18": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fjy18/", "text": "I have a reward system! If I do homework for an hour then I get to play video games for half an hour. If I’m feeling frustrated then I’ll play Assassin’s Creed and kill some Templars to blow off some steam. If I want to chill out and create something, I’ll play Animal Crossing.", "author": "feminismandtravel", "created": 1601665888, "upvotes": 13}, "g7fip99": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fip99/", "text": "Try to practice present-mindedness while doing regular activities, like brushing your teeth.", "author": "curryisforGs", "created": 1601665391, "upvotes": 5}, "g7fi7u0": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fi7u0/", "text": "Take a nap", "author": "ElectricalIons", "created": 1601665182, "upvotes": 2}, "g7fhvdt": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fhvdt/", "text": "Take frequent walks and establish an exercise plan. \n\nJust forcing yourself to use your body and focus your eyes on distant objects can really help you stay functional and sane.", "author": "a_casual_sniff", "created": 1601665032, "upvotes": 10}, "g7fhd2c": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fhd2c/", "text": "Cold shower, super effective.", "author": "FanFareXV", "created": 1601664812, "upvotes": 10}, "g7ff6oi": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7ff6oi/", "text": "I've been really struggling this week and Googled around for some tips yesterday. I found out about the Pomodoro technique, where you do 25 minutes of focused work followed by a 5 minute break, then repeat. There are tons of tools online to help you stay on that schedule. I've only been doing it for a day and a half, but it has immediately improved my mood and productivity.", "author": "bandrus5", "created": 1601663878, "upvotes": 130}, "g7fed82": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fed82/", "text": "I absolutely have to stretch every day, even if it's just 5-10 minutes. Otherwise, I'm afraid my body will never unfold from computer-shape.", "author": "spacefurl", "created": 1601663535, "upvotes": 48}, "g7fcuxe": {"link": "/r/GradSchool/comments/j3z95y/what_are_some_strategies_to_combat_the_zombielike/g7fcuxe/", "text": "I started bringing my skateboard to the office. When I begin getting bored or losing focus, I go out to the parking lot and try to do every flat-ground trick I could do in my blissful youth.", "author": "crusty_coffee", "created": 1601662874, "upvotes": 51}}}