{
  "sid": "qi29nv",
  "link": "/r/GradSchool/comments/qi29nv/will_my_drafts_ever_be_perfect/",
  "title:": "Will my drafts ever be perfect",
  "text": "Last semester grad student here, studying art history. I've been sending my advisor drafts on my thesis chapters periodically, and I'm starting to get worried with just how many drafts we are ripping through. \n\nSome are version 3 (3rd draft), while others are on version 6... I have a deadline of the end of November and it seems like it will never be done at this rate. None of my 5 chapters are finalized. I have 2 more chapters to write still.\n\nI'm sure I'm making a mountain out of a molehill, but was curious how many drafts did you guys go through?",
  "author": "Expensive-Cup25",
  "created": 1635473305,
  "updated": 1635780486,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.87,
  "comments": {
    "hignk9t": {
      "link": "/r/GradSchool/comments/qi29nv/will_my_drafts_ever_be_perfect/hignk9t/",
      "text": "I would start by asking your PI. Many writers are used to editing up until the deadline even if some of the changes aren't major. Is your PI making major edits/comments? Does your PI think you  are in a good pace to reach the deadline?",
      "author": "Beor_The_Old",
      "created": 1635473592,
      "upvotes": 11,
      "replies": {
        "hikg8a8": {
          "link": "/r/GradSchool/comments/qi29nv/will_my_drafts_ever_be_perfect/hikg8a8/",
          "text": "This. In that vein, I'd complete your final two chapters before working on editing anything else. Then, ask your PI to differentiate between major, necessary revisions and lesser ones to work on once you've got a solid, complete draft.",
          "author": "Lucky-Reporter-6460",
          "created": 1635544037,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hihlfcl": {
      "link": "/r/GradSchool/comments/qi29nv/will_my_drafts_ever_be_perfect/hihlfcl/",
      "text": "One suggestion...can you send the latest draft to another person (a collaborator, colleague, another grad student, or mentor you trust) and get their feedback before you send it to your PI again? I figure, if this new person doesn't have any questions or edits, your draft is finished (or as good as).",
      "author": "JenAnnMad",
      "created": 1635495109,
      "upvotes": 2,
      "replies": {}
    },
    "hiigqw6": {
      "link": "/r/GradSchool/comments/qi29nv/will_my_drafts_ever_be_perfect/hiigqw6/",
      "text": "Sounds like your professor is just trying to teach you how to write better. That's not uncommon in the humanities.\n\nSo unless your professor has indicated major concern that your thesis will not be good enough to submit, I would view it as lucky that you have a thesis advisor who's really working with your text to help you improve it.",
      "author": "raistlin65",
      "created": 1635515562,
      "upvotes": 2,
      "replies": {}
    },
    "hil1oh0": {
      "link": "/r/GradSchool/comments/qi29nv/will_my_drafts_ever_be_perfect/hil1oh0/",
      "text": "No",
      "author": "rthomas10",
      "created": 1635553801,
      "upvotes": 1,
      "replies": {}
    }
  }
}