{"sid": "izecsv", "link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/", "title:": "Just something I would like to share here...", "text": "My boyfriend and I are grad students, and today he had anxiety attack because he had to present his results. This might sound trivial but his experiments haven't been working well for a while and it made him really nervous because he feels like he's disappointing his professor and the other members of his lab look down on him. When I came to see him at his place (his meeting were online), his breaths were short and he kept obsessing with the time, saying something like \"30 minutes more\". Close to the time the meeting should have started, he checked the email and his professor told him that the meeting is postponed from the morning to the afternoon.\n\nHe broke down crying.\n\nHe asked me why he couldn't function, why he's not able to do things like other people, why he's wired differently (referring to his anxiety).\n\nHearing all that broke my heart. He's one of the brightest and smartest person I've ever known. His knowledge are far and broad and he's always excited to share them, his eyes would light up whenever he has something new to share. The fact that grad school could make someone as bright and excited about knowledge as him to be a person who's questioning if he's smart enough to study is just so sad...\n\nIt may be a wishful thinking but I really hope this awful no-fail-whatsoever culture in academia would stop. Grad students are just, well students. We are learning and we will definitely fail a lot, some more than others. The failures might be our own doing but sometimes things just don't work even after we all do the right things and this will happen to anyone. I wish a lot more people would be more understanding to that.\n\nAnd to the others who are nervous about anything grad-school related and/or think you are good enough: I see you. The fact that you're in the program means that you ARE good enough. And please be kind to yourself and others", "author": "roseleaf8926", "created": 1601014427, "retrieved": 1632953830, "over_18": false, "upvotes": 412, "upvote_ratio": 0.98, "comments": {"g7rmnwx": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g7rmnwx/", "text": "As you said: you're learning and you will definitely have ups and downs in your research. It's just inevitable. But, it is important not to let our emotions rule our life. Why does your bf feel like he's disappointing his professor? Is it what he thinks? Did his professor tell him that he is disappointed?  It is important to differential these two scenarios. Often, our thoughts are not correct. We assume something and feel really bad about it, but it doesn't mean it corresponds to the reality. Maybe his professor is not disappointed since he knows that research is not straightforward. I would suggest that your bf talks to professor and explain his concerns and figure out a solution together. We usually can learn a lot from our failures, but we need to change our perspective. It is helpful to see what is not working and to understand why it is not working. It can give us idea what we can improve and how to make something working. That's how research works.  \n\n\nSometimes we need to take a short break, relax, do something else, and come back to the problem later. Often, we get to understand it better and come up with a solution easier. I am sure your bf is smart and good enough, he just got stuck and need to find his way out. It happens to most of researchers, sooner or later.", "author": "mm_ese", "created": 1601885089, "upvotes": 1}, "g6ydjm0": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6ydjm0/", "text": "I'm reading myself, I'm gonna cry.", "author": "wonnetz", "created": 1601303532, "upvotes": 1}, "g6klqms": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6klqms/", "text": "I think graduate students should share more about their failures! It helps others avoid making the same mistakes or needlessly repeating something and provides an opportunity for suggestions or tips from an outside perspective. Ideally, science is a collaborative venture, not people trying to make advances independently. It can be tough learning to ask others for input from fears of judgement (hello social anxiety), but at the end of the day, you have to remind yourself that you are reaching out to be better and fuck anyone that would judge you for that (chances are, they are not).", "author": "timidtriffid", "created": 1601067045, "upvotes": 1}, "g6kj9ak": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6kj9ak/", "text": "It’s posts like this that made me wish I had reached out to my support system (family and friends) earlier. I’ve lived alone and been single for the entirety of grad school and not having someone available to talk to when the anxiety/panic attacks hit is rough. I’m glad he has you there to support him during these times.", "author": "Essaroni", "created": 1601065701, "upvotes": 1}, "g6je3co": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6je3co/", "text": "My 4th year coworker student told me my favorite thing ever: you are not your science\nEssentially your science can fail and suck, but that doesn't reflect back on you as a person.", "author": "tuffaceous", "created": 1601044551, "upvotes": 10}, "g6jc0er": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6jc0er/", "text": "i’m so sorry your bf is going through this ); i hope the online counseling works out and i’m so glad he was at least able to talk to you about it and not hold it all in. \n\nand thanks for writing this. i also needed to hear it. i just started my master’s program and one of the first things covered on day one was grading. in my program, a B- grade is equivalent to a D and you will be reported to the graduate division and potentially asked to leave. so when i failed my first paper, i immediately doubted myself and became depressed. writing is my strong suit and i felt like if i couldn’t even write correctly, then how will i ever graduate this program?! and i’m not even doing research yet like your bf is. there’s definitely a lot of pressure and i can see how that would get to all of us at some point. \n\ni do believe and trust in the universe though and i think things will turn out okay for your bf. sending you both some positive vibes.", "author": "vanillaladiee", "created": 1601043453, "upvotes": 2}, "g6j4cos": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6j4cos/", "text": "\"Please be kind to yourself and others\"\n\nLol. Academia is a Lion's Den. Be ready to slay demons or get the hell out. Most people at the top are toxic assholes, you just have to do what you have to do.", "author": null, "created": 1601038996, "upvotes": -6}, "g6j49gu": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6j49gu/", "text": "I also wish that there was a better avenue for incoming students to get a feel for the culture of the department prior to joining, so that they might have an opportunity to join a department that puts as much weight on work/life balance as on scientific rigor.  I feel so blessed to be in such a department, and this sub makes me realize how \\*lucky\\* I am, because it certainly wasn't a purposeful decision when I joined.  I think as current students, if we are in bad situations we need to be really forthright with rotation students/etc if we expect the culture to change.", "author": "Emmarae9", "created": 1601038938, "upvotes": 3}, "g6j14zr": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6j14zr/", "text": "That's good your boyfriend is expressing feelings - it honestly helps.\n\nThis month has been hell for me, going into the lab at 9:30am and coming back home at 1am. My body is sore from working out and working in the lab. My no quit mentality has been driving me crazy to make up for the time I lost for the failed experiments.\n\nAs you said, it is very important to maintain balance but I'm not able to do that. I'm just addicted to this the same way people are addicted to substances. If I don't work, I have withdrawal symptoms.", "author": "sentinalprime567899", "created": 1601036818, "upvotes": 1}, "g6j0kd2": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6j0kd2/", "text": "Thank you. I’ve been breaking down and crying all week because I’m hurrying to finish my thesis but I feel like I don’t have enough. I do have enough and I am good enough. Thank yooooou", "author": null, "created": 1601036401, "upvotes": 16}, "g6iro95": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6iro95/", "text": "Tbh I was (maybe still am your boyfriend) took me 7 years to graduate with literally nothing but negative results for the first 3 years. My projects never worked until I switched projects and I can guarantee you in this long long time, the flame and eagerness for research has been put out significantly. Even worse, when I had projects I could make work I still got berated for spending too long doing certain tasks that no one in our lab did before. When I defended this July, I didn’t feel relieved, I didn’t feel happy, I just felt disappointed and horrified I’m looking down the gun barrel of applying to job after job for the great majority of them to ghost me. \n\n\nThe last 3 years of progress reports (every 2 weeks) I’ve spent literally shaking sometimes waiting for the next insult to come. The fact that now my appointment is finally over and I don’t have to see this advisor on a daily basis is the biggest relief of my life. That being said. It just kind of sucks everywhere. If you join an academic lab you stand the chance of having to work on something with minimal precedent that might not work. If you join an industrial lab maybe you’d be in a position where precedent and protocols exist otherwise the company wouldn’t exist in the first place but I think you’re under different stress or not getting kicked out and being homeless. It’s different. But it’s the same. And it bothers me that people in other types of jobs that have significantly less demands have more job security sometimes. I can’t tell you now at 30 why I chose this life.", "author": "chonkycatsbestcats", "created": 1601027836, "upvotes": 39}, "g6ipq1d": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6ipq1d/", "text": "I’m so sorry your boyfriend is going through this. Anxiety is no joke and it can convince you that the absolute worst things you think about yourself are true. I’m sure the academic culture makes it worse too. Based on my own experiences I would suggest counseling and considering an anxiety medication as well, maybe an SSRI if he feels comfortable doing that. Also, reading books about imposter syndrome can help too", "author": "kim448", "created": 1601025484, "upvotes": 8}, "g6inmzp": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6inmzp/", "text": "This is lovely. Thank you for sharing.", "author": "ohdaisydaisy", "created": 1601022997, "upvotes": 3}, "g6in2zk": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6in2zk/", "text": "I say this, as I'm mostly projecting, but perhaps it may also resonate with your bf and yourself. There's so much that's unfairly expected of us in academia. We joke around how normalized it is to overwork, being stressed all the time, and have incredibly unrealistic goals set for us, by ourselves or due to the academic environment we're in. \n\n\nHowever, the more senior you get in your degree, the more you realize that overworking and stressing over research and lab work does more damage than good, no matter how you look at it. Unfortunately, for some of us, the negative effects may have impacted us more than we'd like to talk about sometimes, mentally, emotionally, socially, and physically. \n\n\nIt's great to hear that he's getting some help and has a very understanding partner. No degree is worth sacrificing your health for. It's completely ok for your bf to tell his supervisor to reduce the workload, it's completely ok to take some time off, it's completely ok to put one's foot down and refuse additional work, it's completely ok to change supervisors.", "author": "haha_isjoke", "created": 1601022348, "upvotes": 25}, "g6ihreq": {"link": "/r/GradSchool/comments/izecsv/just_something_i_would_like_to_share_here/g6ihreq/", "text": "As much as the emotions are tough, it's good that he feels comfortable enough to share it with you. If he hasn't considered it, talking to a professional sounds like a decent idea.", "author": "theCmonster22", "created": 1601016908, "upvotes": 141}}}