{"sid": "ihsh6d", "link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/", "title:": "What even is dating during a PhD?", "text": "So I'm in my second year, just about to enter the third year (ahh) of my 3.5 year PhD program. \n\nI've never been in a relationship or have any experience, but as of this week I'm trying things with a dating app. It's a bit of a weird experience, but I think I'm using it well enough. Not really sure what the hell I'm doing, but okay.\n\nProblem is, I'll be done my program in 2 years and then have to move to go \"somewhere\" for work. Then after a Postdoc (or whatever) finishes, I move again. and again. How do you even try to build/start a relationship under those conditions? I'm almost 27, it does feel like life is passing me by, but I can't really shake the feeling. \n\nI don't think this would be an uncommon feeling for people in Grad School, does anyone have experience in this area?", "author": "BoomKidneyShot", "created": 1598558838, "retrieved": 1632953958, "over_18": false, "upvotes": 353, "upvote_ratio": 0.95, "comments": {"g95g1fp": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g95g1fp/", "text": "I was thinking, I do not have time to date during a busy project, so I will date afterwards. But then I always were busy, and now I am a 31 year old virgin :(", "author": "quackfrohlich", "created": 1602974755, "upvotes": 1}, "g34xlu4": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g34xlu4/", "text": "Go out and meet people, either in or out of your program, and just be honest with the people you want to try a relationship with. Let them know about your life and your plans but make sure they know that you want to go on a few dates with them and see where it goes. Some people might not want to go for it (I've had some girls flat out refuse to date any grad student), but you're not going to date them either way with your life/career trajectory. Communication is the bedrock of any good relationship. Start there and see what happens.", "author": "kitzdeathrow", "created": 1598624573, "upvotes": 1}, "g34uzp0": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g34uzp0/", "text": "This is anecdotal, but I think it is statistically rare to start a successful relationship during a PhD. The majority of the people I know from grad school (keep in mind this is organic chemistry) who are married now had SO's going into grad school and married them after completion of PhD. But hey, that's just my experience.", "author": "PM_ME_GRANT_PROPOSAL", "created": 1598623260, "upvotes": 1}, "g34mnrp": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g34mnrp/", "text": "Lots of great advice here! I’ll add my 2 cents though. 1) Chill out and meet people, don’t think about the future, just enjoy the company as you would a friend. Don’t get discouraged if it doesn’t work out, it didn’t work out for a reason and you learn a bit more about what you want.\n2) Let’s say you meet the love of your life and post doc comes up. If this person is the one/worth it, you two will find a compromise. Maybe they move, maybe you stay local. Either way, when you become a serious couple, it’s no longer about you, it’s about us.\n\nThe best advice I saw here was stop planning. That will let you live in the moment and enjoy your time. Dating is really fun when you don’t take it seriously. If someone really draws you in, relationships are fun in a different way.\n\nVacation wise - Dating is like backpacking to Machu Picchu: adventurous, tiring, fun, long, exciting!\nSerious relationships are like an all inclusive resort on a tropical or Mediterranean beach island: quiet, comfortable, relaxing, luxurious, safe, peaceful, rejuvenating.\n\nEnjoy life, let people in and let them out.", "author": "mkitty333", "created": 1598618279, "upvotes": 1}, "g341ms6": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g341ms6/", "text": "Lots of great advice here already, but I wanted to chime in to say pick the right dating app! My husband and I met on OkCupid! I liked it because it gave both of us a lot of prompts to write about ourselves and a series of questions to answer that helped match us. When I was using the app I specifically searched for prospective dates with match rates above 90% because I was tired of going out with people only to find we had major differences in values or beliefs. This obviously is a very different experience in online/app dating than tinder. I saw someone wrote to indicate in your profile that you might be moving around. That’s a great idea! Then dates know what to expect. You might meet someone who finds the idea of moving with you to be exciting and feel like an adventure. \nI want to mention that dating apps are a very different experience depending on gender. As a woman, I received a lot of interest (including some I didn’t appreciate) when I was doing online dating. My husband received much less. \nI’m just saying this because I don’t want you to get discouraged if you don’t immediately receive lots of interest or if you get lots of unsolicited messages that make you uncomfortable. My husband and I would both say it was a thousand percent worth it for the incredible relationship we have together.", "author": "tal003", "created": 1598598463, "upvotes": 2}, "g33xwpg": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g33xwpg/", "text": "Yes, it’s probably one of the hardest parts of grad school and careers in science \n\nAdvancing your career requires moving around, moving around practically precludes dating unless you get lucky \n\nThere’s not a good solution, unless you decide to focus on dating after you settle down and put down some roots", "author": "thisdude415", "created": 1598595161, "upvotes": 5}, "g33tty9": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g33tty9/", "text": "Happens all the time. I got married during my Ph.D. program...so did a lot of our friends. The majority are divorced now. I've seen fairly high rates of divorce among my academic colleagues/friends as well, and it's often due to conflicting careers, the two-body problem, or distance mandated by jobs that are far apart.  Those that survive *tend* to be couples in which one member has the sort of job that is portable and in demand (health care, tech, etc.) so they can follow the academic. The least likely to make it-- in my personal sample --are couples with two academics in the same general field, which makes it almost impossible for them both to have traditional academic careers without one or the other sacrificing opportunity if not entirely abandoning their aspirations so the other can take that once-in-a-lifetime TT job.\n\nOn the other hand, I've also seen a *lot* of faculty find love and get married in their 30s, 40s, or even 50s for the first time. I'm a minister and have even done some of those ceremonies myself. So there's nothing about your 20s that's magical or will expire when you turn 30.", "author": "SnowblindAlbino", "created": 1598591927, "upvotes": 3}, "g33rdx0": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g33rdx0/", "text": "Dating is about meeting people, getting to know yourself, understanding mature interpersonal communication and being happy. \n\nCommitment is a different question, one that will be doable in any circumstance if the person is right", "author": "TorturousOwl", "created": 1598590140, "upvotes": 2}, "g33l1dw": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g33l1dw/", "text": "I'm kind of surprised at the high ratio of advice-givers to empathizers. It's true, long-term relationships don't happen by convenience, and there's no reason to get down on yourself about a future problems years ahead of the present. \n\nBut, there's lots of people in your shoes. Another common thread I see are people in a relationship where both people are in grad school and one or both are relocating, and they ask for advice about breaking up or staying together or one person feeling more/less prioritized in their SO's life, etc. etc. it is a difficult reality to navigate for lots of grad students.\n\nA couple things to consider are, 1) how is your work-life balance? it's easy to think you're supposed to be on a 7 year grind with your whole life dedicated to your PhD, but try to see if you can advocate for more flexibility with your program and evaluate your personal schedule to see where you can make improvements. 2) do you absolutely have to move somewhere for each of those stages? it's easy to get caught up in academics and research and neglect the professional side of a PhD - try to see if you scout future companies/schools you'd be able to work at at each stage of your PhD to minimize unwanted life changes. reach out and make connections now! 3) just start dating. a PhD can feel burdensome, like a wall that blocks you from other things you want. while it's certainly a unique situation to be in, realistically everyone has a potential wall that blocks them from long-term relationships. past trauma, relationship baggage, depression, family problems, etc. which goes back to, no long-term relationships happen by convenience. you just have the meet someone who is at the same level of prioritizing a relationship as you are, and see if it keeps going. it takes some luck for sure, but you don't get lucky staying at home thinking it's not worth trying.\n\nlast side note - you say it feels like life is passing you by. what drove you to start a PhD? what joy or practical benefits does it bring you? any long-term goal risks some burnout, and everyone experiences a grass-is-greener feeling now and then with their life choices. but remember choosing a path and walking forward is better than walking in circles feeling unsure that any path is worth walking at all.", "author": "_welcome", "created": 1598585965, "upvotes": 1}, "g33apxl": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g33apxl/", "text": "Just have fun. Relationships aren't designed, they're discovered.", "author": "johnnydaggers", "created": 1598580054, "upvotes": 2}, "g339pso": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g339pso/", "text": "[deleted]", "author": null, "created": 1598579500, "upvotes": 1}, "g335ryi": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g335ryi/", "text": "Not someone who’s too fond of long term myself, but from what I’ve observed it can be a strange experience post-grad. I observe one of my friends getting passed up by men who feel too intimidated by a woman with a Ph.D. and that alone kinda worries me (but that’s women’s perspective). Meanwhile, I find myself in the same predicament. On top of other reasons, I might move, might not. I would like to go to another school 3 hours away for my Ph.D. if I can find a way to afford it, so this guy who’s into me, well, I don’t see it lasting but yet he keeps trying to do *everything* to make it work (which, that’s a whole other complaint I’m not going to get into here).\n\nPoint is, yeah it can get complicated, but as someone above stated, it’s not something that can really be planned per se. It happens when we least expect it, I don’t mean to sound corny saying that but it’s true.", "author": "TK-07", "created": 1598577335, "upvotes": 1}, "g3348ny": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g3348ny/", "text": "I got married during my PhD. And I was single when I started the program. \n\nStart dating. If it’s worth it, you’ll find a way to make it work when you’re done with your program.\n\nJust don’t date someone in your program. The two body problem is not an easy thing to deal with.", "author": "zarza_mora", "created": 1598576491, "upvotes": 8}, "g3332du": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g3332du/", "text": "Like some other comments have mentioned, don't think so far into the future.  You might meet someone who's willing to move with you, or you might decide to adjust your own career goals to make a relationship work.\n\nFor me personally, this is one of the reasons that I decided against a career in academia.  Moving around the country for a multiple postdocs and then moving again to fight for tenure would definitely strain my relationship, and to me it's not worth it.  Honestly, I'm pretty tired of the moving and constant uncertainty myself after living in different cities for undergrad, masters, and PhD.  You just need to think about what's really important to you - if you feel like life is passing you by, maybe you should re-evaluate your goals.", "author": "summerofgeorge_", "created": 1598575868, "upvotes": 2}, "g330hc6": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g330hc6/", "text": "Lots of people date in school.  Believe it or not lots of people date with all sorts of shit going on in their lives.  You’re over analyzing.", "author": "Texadoro", "created": 1598574504, "upvotes": 0}, "g32xgrj": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32xgrj/", "text": "I started dating my now husband when he had 2 years left in his PhD program. We both knew it was a long term thing by his graduation and shifted it to long distance after he accepted a post doc.\nIt definitely hasn’t been the easiest road (because academia) but I am certainly glad he decided to date during his last two years. \nAlso, you don’t need to find someone to marry. You can also have fun. I think regardless of what sort of relationship you want, the timeline creates a great opportunity for very open communication.", "author": "kiewib", "created": 1598572865, "upvotes": 2}, "g32uje6": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32uje6/", "text": "I’m starting my second year and moved to a city for my PhD. My first semester here I was just looking to have fun and meet new people. I happened to meet this cute girl in my cohort and we got a long well. Long story short, we dated for a few months and things just kind of ended and we didn’t talk much after (first piece of advice is don’t date within your cohort or even your department to an extent). I’m in a phase of my life where I feel like I want to be able to focus on my work, but not be tied down to something serious. Sometimes you also have to acknowledge that things will happen when they do. I’ve been using apps with absolutely no expectations and I’ve had some great conversations, but it can be super draining to keep up multiple conversations while working and studying. If someone comes along and wants something casual, I’m all for it. If the girl I previously dated wanted to get back, I’d consider it.  Figure out your priorities and think how much effort you’re willing to put into dating. That’s really all the advice I feel qualified to give cause I’m still figuring things out myself.", "author": "IndoorCloud25", "created": 1598571263, "upvotes": 2}, "g32u83o": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32u83o/", "text": "[deleted]", "author": null, "created": 1598571093, "upvotes": 7}, "g32r79t": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32r79t/", "text": "Yeah, I feel this. Honestly, it's what happened to me in undergrad. Both me and my girlfriend knew we sucked at long distance, so we stopped once we graduated. Shit was rough lol so I've kinda just decided to not really fall in love here? I want to go into the industry so hopefully I won't have *too* tumultuous of a career after a postdoc. \n\nBut, like some people have been saying, just go out and see what happens. Maybe you meet someone who's good at long distance and you don't mind it either. It could work out. Give it a shot", "author": "ctfogo", "created": 1598569459, "upvotes": 2}, "g32o52z": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32o52z/", "text": "I feel like you're having my exact experience. I hadn't really dated at all (except for a long distance internet relationship in my teens lol) until grad school. I was in the habit of going off and on dating apps, mainly for entertainment/distraction, and nothing had ever really come of it except momentary validation that I was still a cute person lol. But the summer after my 1st yr of PhD, I fell very quickly into a relationship with someone I met on a dating app and it's been just over 2 yrs with him now. \n\nThe beginning of the relationship felt literally traumatic. No one tells you that ending your relationship with long term singlehood can be genuinely painful even though you want to spend time with a person. It was hard adjusting to the reality of sharing space and time, making compromises, coming to terms with the reality of a human to replace my fantasy of a forever-love-of-my-life, and understanding that just because they don't tick your imaginary boxes doesn't mean you're being untrue to yourself. \n\nI thought I had to break up with him over and over again. Every doubt I had became \"should I just finish it? Am just in this because I can't face being alone again?\" The only thing that kept me from letting him go was the fact that the idea of it made me sadder than I thought it would, and it didn't seem to be for the wrong reasons. \n\nI'd constantly wonder what the future would be like if we went into this. I'm an international student and he's from the country of my university. One day, I would have to graduate and take next steps. I had to talk to a lot of my friends who have been in long term and short term relationships or just had more experience dating to understand that it's fine to not know. I had to understand that I can enjoy what I have now and wait to make decisions when it makes sense to think about them, when we know what's coming next. That it's better to have this than not have it, regardless of the future. \n\nI like to think of it as a phase of my life. I'm not sure if he will be coming with me into my next phase, but I will always have this phase. The experiences I take from this phase will never be a waste. No phase of life is a waste. Everything you fill it up with colors your experience of that phase, and if I can make this phase as good as I can, that's great. That doesn't mean that if I start the next phase with all new things - new location, new people, whatever - that that next phase will be somehow tarnished because I didn't carry something from this phase along with me. \n\nMaybe this means that I'm stopping something in my heart from making a solid connection with him now, but that also doesn't mean that if he DOES come with me into the next phase, that I can't strengthen and solidify that connection THEN. It's okay to defer commitment I think, and it doesn't feel like doing that has tarnished my current phase either. (It helps that he lives in the moment just as much - in fact, I've picked up a lot of this outlook from him!)\n\nLife is just a long ass journey, man. Every part of it is valuable and valid, and clinging to things and permanence can often be futile, when instead you could allow new things to come in and fill your life up every single phase of it you go through.", "author": "dantparie", "created": 1598567837, "upvotes": 17}, "g32krto": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32krto/", "text": "Don't over think it too much... just go out have fun. Don't put pressure on something to be long term either.", "author": "mishandle123", "created": 1598566133, "upvotes": 0}, "g32kef1": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32kef1/", "text": "I think one thing to note is that there are a variety of dating strategies and no one of them is the *right* strategy. \n\nBy strategy I don’t mean how you go about finding/attracting a partner, but the dynamic you choose when you’re in relationship(s). \n\nSo a large part of it is based on your own cultural norms and what makes you you. As such it’s not always a choice. \n\nBroadly I would say the two biggest features are how many people you date at once, the duration of your relationships, and whether they are local or long distance. Obviously the feasibility is an issue. By being on your track it pretty much eliminates the choice of long-term and local.\n\nFor example a common dating strategy is to be serially monogamous. Date one person at a time. If you choose short durations you can still date lots of people. There is an exploration/exploitation trade off with how many people you date (dating more people let’s you learn what you want and what’s available, but limits enjoying the relationships you do find). \n\nOr in the flip side you could date many people for long durations, or any sort of combinations you like. \n\nSo long as you are honest and upfront with the people you date about what you’re looking for, I think all dating strategies can be practiced ethically. It’s a process to figure out what works for you and what makes you happy. \n\nSometimes you have to compromise on what you want in terms of career or relationships. But there are often more options than we first think. Just because a choice isn’t right for someone else doesn’t mean it’s not the right choice for you. \n\nTL:DR an evolutionary game theory perspective on dating can be fruitful.", "author": "beeskness420", "created": 1598565947, "upvotes": 1}, "g32k9dd": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32k9dd/", "text": ">I'm trying things with a dating app.\n\nI have mixed feelings about dating apps, but it would be a good idea to specify what you are looking for relationship-wise in your profile, i.e., a hook-up, something short term, long term, possibility of marriage, etc.. Personally, I've had more success going through friends, members of my extended cohort as a means to find a partner.\n\n&#x200B;\n\n>How do you even try to build/start a relationship under those conditions?\n\nHere's the thing: your partner needs to know the requirements/demands of your program and \"life after the PhD\". This could mean, 60-80 hour work weeks, frequent travel, conferences, the possibility of relocating for work and the possibility of a meager salary. If you are upfront and honest about these matters from the get-go, you will be more successful in dating and finding a healthy relationship. Be realistic, but more importantly, be honest about your circumstances.\n\n&#x200B;\n\n>I'm almost 27, it does feel like life is passing me by...\n\nI'm 32 and I have only just begun the road to a PhD. I'm not married nor have a had a serious relationship in like 5 years. I live with my parents. I don't make a lot of money, I'm not particularly pretty and my eggs are dying by the minute. You'll have likely a PhD by the time you're my age. You are likely, out on your own and living fully functioning adult in the middle of a pandemic, before thirty. You are light years ahead of me and many, if that is any consolation. Remember that romance and partnership is not a race, that all good things take time to develop and hopefully, come to fruition with time.", "author": "beautifulcosmos", "created": 1598565879, "upvotes": 23}, "g32k2bu": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32k2bu/", "text": "> Problem is, I'll be done my program in 2 years and then have to move to go \"somewhere\" for work. Then after a Postdoc (or whatever) finishes, I move again. and again. How do you even try to build/start a relationship under those conditions?\n\nThis is one of the reasons I am leaving academia. Not the only one, but the overall uncertainty is something I am no longer willing to deal with.  \nThe uncertainty your describe never goes away, either you (and your partner) are willing to accept that or you get out. There is no magic solution to make that go away. And this isn't a problem with new relationships, even if you would have a partner for years you would have to discuss how to deal with all the moving. Do you go long distance? Is one person sacrificing their career to move around with the other one? Do you both make compromises that aren't ideal but at least allow you to stay in that same place? When do you want to have kids, pets, a house, whatever? When can you even afford that if you don't even know where you will work next year and under which conditions? And not having secured income for the next years comes with other problems, too, e.g. if you ever need to take out a load.  \nAnd not having a partner also does not make it easier, you still leave a lot behind, every time you move. Family, friends, communities... You constantly uproot your life to start over somewhere else, often without knowing for how long exactly and where your career leads you next or if maybe the next stop is your last one because you might ultimately fail to secure that rare tenured position. And until you have that, a long time will pass. For tenured professor, most people achieve that in their forties, so you still have more than 15 years of uncertainty ahead of you. If you get lucky, you might get another permanent position in academia somewhere but to be honest some of these are even rarer than professorships, although achievable earlier.\n\nSo yeah, I can't really give you advice, there really is no good solution to this problem. You just need to start dating and be honest about this problem with your partner from the start, so they can decide whether they want to deal with that or not. There will be people you really like that will see it as a deal-breaker and again, there is nothing you can do about that. If you want to be an academic you need a supportive partner that is willing to either move with you or go long-distance, no way around that. It makes dating a lot harder, obviously. It makes anything harder.\n\nAs said, I will leave academia soon and the moment I realized that now I can actually make plans what I want to do or have in the next years was great, because for the first time in my life (and I am 32 now), I actually have an idea where I will be in the next years.  \nSome of the professors I know had that with 45 or even 50 years, when they finally got a permanent position.", "author": "LittlePrimate", "created": 1598565784, "upvotes": 2}, "g32ird9": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32ird9/", "text": "You’re thinking way too hard about this. Just go meet people, see what happens and only plan as far as ahead as the next date until it’s clear that something more serious is going to happen.", "author": "Thunderstarter", "created": 1598565153, "upvotes": 3}, "g32i90g": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32i90g/", "text": "I am a second year and I just moved to a new city. I knew I wanted to meet people and experience what it was like to live here, but I also knew at first I wasn't really looking for a full on relationship. I was just seeing who I could meet and honestly just have fun.  Now, I am in a great relationship with someone who supports me no matter what. He is very understanding of the time a PhD requires and how little time I have, but also that moving is a possibility in the future. \n\nI would really just starting talking to people on the dating app and see how it goes! Don't be afraid to meet up and grab drinks or a coffee (maybe not now during the pandemic lol) and just talk to them. Worst case scenario, you guys don't click and you go about your life. Also, understand that rejection is common and try not to take it personally. I would focus more on just having fun/meeting people. There's that saying of \"the one will come when you are least expecting it\" and I fully think this is true.", "author": "Vividersplash26", "created": 1598564908, "upvotes": 1}, "g32i4zt": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32i4zt/", "text": "As someone who met two boyfriends in dating apps during grad school, here's a piece of advice. Have fun! I don't mean necessarily have sex, I mean, you can if you want, but when you start talking to someone, or go on a date (online or irl), don't worry about what it would be like to be in a relationship with that person. Honestly, you will probably meet a lot of people you just don't click after the first few dates. Instead of planning too much, just enjoy the moment. Talk about yourself, ask questions, have a good time! As someone mentioned, you can make it clear on your profile you will move in a few years, and that's ok! I did that, met my now bf two years ago, and in a month he's moving with me across the country because I got a job there! There are things in life that are out of your control, so just enjoy what you have atm!", "author": "Mother_of_Brains", "created": 1598564853, "upvotes": 6}, "g32hvxs": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32hvxs/", "text": "It’s the one body problem. There is a lot of talk about how hard it is for couples and families in academia but this is definitely an overlooked challenge. I totally get it and empathize with you as I’m a second year PhD student that is currently single. It makes cooking and household chores harder as well because there is nobody to split duties with.", "author": "JTernup", "created": 1598564731, "upvotes": 6}, "g32fv66": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32fv66/", "text": "It seems like most grad school relationships end up being students dating out of other students, as proximately plays a huge role. We don't have enough free time to develop a thriving social life outside of grad school, and the average person isn't going to understand the demands that a PhD takes.", "author": "crazyladyscientist", "created": 1598563760, "upvotes": 7}, "g32f0x2": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32f0x2/", "text": "One thing I learned recently is that *trying to do something* and *doing something* are totally different.\n\nWhen we try to do something, we want to control the process and outcome, but when we just do it, we're there for whatever comes up along the way.\n\nEspecially when it comes to dating, we can put ourselves in a position to meet people, butactively trying to find a partner with these criteria and immediately using that as a reason to qualify/disqualify people is probably not going to be fun or effective. Just check it out, see how things go, and enjoy yourself.\n\nAlso... please try not to judge yourself for how well you're using a dating app, or for not knowing what you're doing. It sounds like you might be pretty hard on yourself in general, or have a very high bar for what \"success\" means (if this is true, know that you're not alone, especially amongst grad students. currently working on unburying myself from that mindset). Dating is one of those things where you're going to find that some people jive with your personality, others don't, sometimes it's amazing and mutual, and sometimes it's one-sided and you might be a little disappointed or heartbroken from time to time. Learning that is valuable in itself, so don't get tripped up if something doesn't work out!", "author": "minniesnowtah", "created": 1598563353, "upvotes": 25}, "g32euxu": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32euxu/", "text": "I'm going to let you in on a secret. You don't have a relationship with someone long term because it's convenient.\n\nThat being said I met someone who worked right behind me we dated and got married.\n\nThe truth is if you want the relationship to work someone will have to give up something.\n\nCompromise is required.", "author": "Unturned1", "created": 1598563273, "upvotes": 138}, "g32eoiy": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32eoiy/", "text": "I mean, people start serious relationships in college knowing full well they have a set number of years in that particular town and may have to move again after. Moving is just a fact of life for a lot of careers/lifestyles. As someone else pointed out, you can't plan a relationship that hasn't started yet. Put yourself out there and meet people and don't think too much about what's going to happen post-PhD. \n\nIf you do click with someone and enter something serious, you can have conversations then about what you think you both want after your program ends.", "author": "Amandurrs", "created": 1598563189, "upvotes": 36}, "g32ehnv": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32ehnv/", "text": "Good luck brother. Dating is hard.", "author": "Dustin_Bromain", "created": 1598563096, "upvotes": 5}, "g32ea4q": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32ea4q/", "text": "Yeah these guys are on it about time - it’s highly unlikely your first relationship or your first several relationships are ‘the one’.  \n\nIf they are, one of you will be making some real decisions.  But you’re closing the door on that relationship if you don’t look.  Trust me, it’s worth it. \n\nDon’t worry about the long haul right now.", "author": "MsOctober", "created": 1598562992, "upvotes": 11}, "g32dy4c": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32dy4c/", "text": "You can make it clear in your profile that your life plan involves relocating. That way, you will screen out those who are looking for a long-term partner to settle down with in your current location. \n\nIt is also a good idea to identify what you are looking for. Are you hoping to find your life partner? Do you just want a (or a few) fun companion(s) to spend time with on weekends between now and graduation? Are you ready to sow your wild oats with a lot of casual sex? Knowing what you want will help you find potential partners who are interested in the same thing, which will make the whole experience less stressful. \n\nUltimately, you cannot eliminate the risk of getting your heart broken, or of breaking someone else's heart. A lot of relationships don't work out. It's a gamble--the uncertainty is part of the adventure.", "author": "inkylinguist", "created": 1598562817, "upvotes": 10}, "g32dlhy": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32dlhy/", "text": "If it is anyone like my life, it will be with a bunch of finicky people who show initial interest and then quickly dissipate because everyone is so busy with various things and it is hard to keep their attention or for them to understand that you're busy and can only allocate so much time responding to texts.\n\nThen there is COVID-19 which makes things even harder.", "author": "Mikazukinoyaiba", "created": 1598562644, "upvotes": 7}, "g32d9h1": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32d9h1/", "text": "I think your objective at this point might be to develop a level of comfort with the mechanics of socializing with people in this manner. I have no idea what it's like during the pandemic, but I did not have the social-skill foundation to court my now wife until I had resolved to date casually via an app. When I could have an enjoyable date with someone and it wouldn't be anything more than chatting and getting to know each other over drinks/dinner well enough to know we weren't interested in pursuing it, then I was ready to date someone I really cared about. \n\nTurn your attention to getting the social mechanics of dating down in a way that you can find fun, then worry about the relationship.", "author": "AlbanySteamedHams", "created": 1598562482, "upvotes": 38}, "g32bnz1": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g32bnz1/", "text": "I think I found the problem. You plan too much. Planning relationships that haven't even started is like planning your cat's daily sleep schedule. Good luck, but it's not really up to you. Just go out and meet people. And don't take anything too serious until it is", "author": "resorcinarene", "created": 1598561718, "upvotes": 687}, "g326a4l": {"link": "/r/GradSchool/comments/ihsh6d/what_even_is_dating_during_a_phd/g326a4l/", "text": "Mate, your first relationship probably won't last more than 4 months. Don't think so hard in advance because the people on dating apps aren't either. Just get experience so when the right person comes along you know what to do.", "author": "DianeSucks", "created": 1598559204, "upvotes": 184}}}