{
  "sid": "qr6hoe",
  "link": "/r/GradSchool/comments/qr6hoe/creative_writing_poetry_mfa_what_does_it_entail/",
  "title:": "Creative Writing - Poetry MFA. What does it entail?",
  "text": "I love writing songs and poetry, and have some questions for those of you in a Poetry MFA,\n\n1. How much creative freedom are you really given?\n2. Is rhyming heavily discouraged?\n3. Is the research component of the MFA sucky?",
  "author": "blabbedybloobla",
  "created": 1636584705,
  "updated": 1636656503,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk5r3g0": {
      "link": "/r/GradSchool/comments/qr6hoe/creative_writing_poetry_mfa_what_does_it_entail/hk5r3g0/",
      "text": "1. Depends on the program, but usually quite a lot of freedom.\n2. End rhyme usually feels forced in contemporary poetry but that's pretty poem dependent. I've seen rhyme work in workshops and I've seen it torn apart. \n3. This depends on the program. If you want to do research, look for programs with literature requirements. Either way, your thesis project will depend on your interests and it shouldn't be difficult to incorporate research components of you want that.",
      "author": "EugeenDabs",
      "created": 1636601696,
      "upvotes": 2,
      "replies": {
        "hk5s4m3": {
          "link": "/r/GradSchool/comments/qr6hoe/creative_writing_poetry_mfa_what_does_it_entail/hk5s4m3/",
          "text": "Thanks for all the insight! Also, sidenote, is your username based on Eugene Debs?",
          "author": "blabbedybloobla",
          "created": 1636602196,
          "upvotes": 2,
          "replies": {
            "hk66k85": {
              "link": "/r/GradSchool/comments/qr6hoe/creative_writing_poetry_mfa_what_does_it_entail/hk66k85/",
              "text": "It is! To your original question, the best thing you can do is find someone who knows your work and understands the MFA process. So much comes down to finding a program that will push your unique voice, and unfortunately that isn't a question online rankings are much help with.",
              "author": "EugeenDabs",
              "created": 1636610106,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7kea4": {
      "link": "/r/GradSchool/comments/qr6hoe/creative_writing_poetry_mfa_what_does_it_entail/hk7kea4/",
      "text": ">1. How much creative freedom are you really given?\n\nAs TS Eliot once said,\n\n“When forced to work within a strict framework the imagination is taxed to its utmost – and will produce its richest ideas. Given total freedom the work is likely to sprawl.\"\n\nSo some of your instructors will likely push you to work within limits, as that can help many people grow as a writer.",
      "author": "raistlin65",
      "created": 1636643505,
      "upvotes": 1,
      "replies": {}
    }
  }
}