{"sid": "pjqfji", "link": "/r/GradSchool/comments/pjqfji/template_for_resume_and_personal_websites_for/", "title:": "Template for Resume and Personal Websites for Grad Students", "text": "A personal website and a well-organized resume is extremely important especially for us, grad students. There are a number of templates available online but some either require coding or some consume bit too much time for setting up. There are a couple of no-code solutions available online but none of the offer the flexibility and aesthetics of Notion.\n\nMany times, professors and fellow grad students have appreciated the templates I use for my website and resume and it has really helped me in developing relevant connections. Therefore, I am releasing these templates in both free and paid versions. If you are looking for a no-code which offers flexibility and aesthetics, I believe this would surely help.\n\n**My own personal website using this template** \\- [https://ramandutt.super.site/](https://ramandutt.super.site/)\n\n  \n**Some of the features** \\- \n\n1. Notion elements like Tables, Gallery and Toggles make the website interactive and not just static.\n2. Publications are clearly visible and well-categorized.\n3. Explaining your research interests both in brief and detail.\n4. A section to highlight your recent events and news.\n5. A section to showcase your social media (like Twitter) which greatly facilitates networking.\n6. A dedicated section to write blogs and daily journals.\n\n**Website Templates can be found here** \\- [https://twitter.com/RamanDutt4/status/1434854330826436616](https://twitter.com/RamanDutt4/status/1434854330826436616)\n\n**Resume/ CV Templates can be found here** \\- [https://twitter.com/RamanDutt4/status/1434857215098228741](https://twitter.com/RamanDutt4/status/1434857215098228741)\n\nFor any more info or questions, I can be reached [here](https://twitter.com/RamanDutt4).", "author": "mnist07", "created": 1631031902, "retrieved": 1632844726, "over_18": false, "upvotes": 13, "upvote_ratio": 0.93, "comments": {"hbyi9ft": {"link": "/r/GradSchool/comments/pjqfji/template_for_resume_and_personal_websites_for/hbyi9ft/", "text": "I'm really curious what value you've found in having a personal website as a grad student. I can't really figure out what purpose it would serve that isn't covered by a ResearchGate profile, campus directory page, and social media.", "author": "ucscpsychgrad", "created": 1631037503, "upvotes": 1}}}