{"sid": "pxakf1", "link": "/r/GradSchool/comments/pxakf1/advice_for_reapplying_to_a_program_i_quit/", "title:": "Advice for reapplying to a program I quit", "text": "I quit my program within the past year because my mental health was suffering badly. Part of the problem was that I didn’t like lab work nearly as much as classes. I see it as a bit of a necessary evil sometimes. But a huge reason I didn’t like lab work was that it exhausted me and I had constant intrusive thoughts about ruining my experiments. \n\nBasically, I got diagnosed with inattentive ADHD. That explains a lot. I’m being treated now, and I feel like I could go back to school and succeed. Before I left, I had a 4.0 gpa, and all of the professors were disappointed and confused when I dropped out because I was at the top of my class. Not boasting, just trying to explain why I think they might take me back.\n\nObviously, it is anxiety-inducing to think about reapplying. I should have gone on leave, but I didn’t. How would you start? I know that going back would be humbling, as other students are going to treat me like I’m super weird. Everyone supports your mental health journey until you actually show symptoms.\n\nBut, logistically, would you first reach out to your old advisor? Or would you reach out to your references? Or would you start the formal online app again?\n\nHas anyone been through this? I would also appreciate it if anyone has any insight about my chance of being reaccepted.  \n\nThanks.", "author": "safeinheck", "created": 1632847863, "retrieved": 1632951953, "over_18": false, "upvotes": 6, "upvote_ratio": 0.87, "comments": {"hemerbq": {"link": "/r/GradSchool/comments/pxakf1/advice_for_reapplying_to_a_program_i_quit/hemerbq/", "text": "Did you fully withdraw from the program, or did you take a leave of absence? \n\nEither way I would speak to admissions, but the process for both of these incidents is likely very different.", "author": "nonconformistnugget", "created": 1632851752, "upvotes": 3}}}