{"sid": "b9rgs7", "link": "/r/GradSchool/comments/b9rgs7/fck_all_these_intl_organizations_that_are/", "title:": "F*ck all these int'l organizations that are entirely funded by government money, then go on to charge people exorbitant amounts to access their publications.", "text": "It pisses me off, whether it's FAO, IMF, WTO or many other organizations whose stated mission is to advance knowledge. Like why do you even exist as an NGO sucking money from more than 190 governments if you're just gonna act like a private firm and ask 300 euro for a report?\n\n&#x200B;", "author": "preposteroni", "created": 1554472347, "retrieved": 1632954084, "over_18": false, "upvotes": 332, "upvote_ratio": 0.98, "comments": {"ek6qy4l": {"link": "/r/GradSchool/comments/b9rgs7/fck_all_these_intl_organizations_that_are/ek6qy4l/", "text": "I mean, having worked for one of those, don't you think they'd like to make the data available? That's their whole purpose. But they're generally incredibly short on money and have to cut corners. The states determine their exact budgets, not the organisations. You have to take it up with your government instead. ", "author": "doornroosje", "created": 1554482674, "upvotes": 2}, "ek6nhlm": {"link": "/r/GradSchool/comments/b9rgs7/fck_all_these_intl_organizations_that_are/ek6nhlm/", "text": "At least at CERN we have a policy to publish everything as open access!\n\nhttp://library.cern/OpenAccess", "author": "kyrsjo", "created": 1554480304, "upvotes": 32}, "ek6h3ct": {"link": "/r/GradSchool/comments/b9rgs7/fck_all_these_intl_organizations_that_are/ek6h3ct/", "text": "Aren’t most of their reports publicly available? I’m working on documents generated from the WTO and WHO and my friend on the FAO and we didn’t run into any paywalls we couldn’t get through. ", "author": "goku_vegeta", "created": 1554475807, "upvotes": 4}, "ek6gbdd": {"link": "/r/GradSchool/comments/b9rgs7/fck_all_these_intl_organizations_that_are/ek6gbdd/", "text": "I know you’re just venting and didn’t actually want an answer, but I never actually get to talk about things like this outside of school. \n\nAs someone who studies nonprofits (American ones specifically, so some of this might not apply to foreign/international organizations),this is a bit like asking why public universities still charge tuition. The short answer is because they can, and also they kind of need to. Fees for services are a relatively small but still significant part of any NPO/NGO’s funding. They’re subject to the same market conditions as anyone else, and their mission “to advance knowledge” only compels them to do the research, not to give it away. This is a big difference between the specific term “charity” and the more general “nonprofit.” If we on Reddit wanted to create an organization that raised money to purchase the reports and distribute them for free, that would be a different story, while still probably falling under the 501(c)(3) categories of “advancement of science,” “advancement of education,” and maybe even “alleviation of poverty” among others depending on how we used that data. \n\nAnother thing to remember is that, just like in academia, government grants are among the most restrictive forms of funding available to nonprofits in terms of how that money can be used. It might cover the costs of studies, and even part of the salary for the people creating them, but they rarely deal in unrestricted, flexible assets. They have to pay administrators and buy office supplies too. ", "author": "rageface11", "created": 1554475245, "upvotes": 54}, "ek6cvxa": {"link": "/r/GradSchool/comments/b9rgs7/fck_all_these_intl_organizations_that_are/ek6cvxa/", "text": "Are they not on sci-hub.tw?", "author": "AnimaLepton", "created": 1554472616, "upvotes": 18}, "ek6csvk": {"link": "/r/GradSchool/comments/b9rgs7/fck_all_these_intl_organizations_that_are/ek6csvk/", "text": "I hope you don’t actually pay for publications... sci hub exists.", "author": "MrLegilimens", "created": 1554472543, "upvotes": 109}}}