{
  "sid": "plau0b",
  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/",
  "title:": "For people who are in grad school/PhD and have met someone/dated someone, how'd you find time to do that?",
  "text": "Genuinely asking because I feel I'm stretched thin already. Between all the hard parts of a PhD, working out/exercising, and keeping up with my friends, I don't have any time to date. The fact our stipends aren't that great and we aren't making amazing money during the PhD doesn't help either.  \n\n\nSo for those who were able to meet people, how'd you do it?",
  "author": "Astsai",
  "created": 1631236040,
  "over_18": false,
  "upvotes": 66,
  "upvote_ratio": 0.9,
  "comments": {
    "hcdl8jq": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcdl8jq/",
      "text": "I met my partner on a dating site and she is far removed from academia to try and give some normalcy to life. Making time is sometimes hard but you push through if it's worth it",
      "author": "unluckychemist",
      "created": 1631318622,
      "upvotes": 2,
      "replies": {}
    },
    "hcdfqnn": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcdfqnn/",
      "text": "You don’t find time. You *make* time. Do what you want to do.",
      "author": "gentleboys",
      "created": 1631315888,
      "upvotes": 2,
      "replies": {}
    },
    "hccudn7": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccudn7/",
      "text": "I met my fiancé in college but we weren't doing the same majors/minors and didn't start dating until years later. That said, he was very comprehensive when I was writing my thesis and had to take time off to do that. If you date a good person, they'll usually accommodate your academic needs (and also grad school doesn't last forever, thankfully). Also, imo it helps if your SO is not an academic or at least isn't in the same field as you. This gives room for more growth and interesting conversations about each others work!",
      "author": "chantillycan",
      "created": 1631306088,
      "upvotes": 2,
      "replies": {}
    },
    "hccjyid": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccjyid/",
      "text": "Dinner dates. I spend about an hour a week meal prepping dinner, and if someone wants to see me, they gotta go to a short dinner with me 🤪",
      "author": "aka_hopper",
      "created": 1631301652,
      "upvotes": 2,
      "replies": {
        "hccutbr": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccutbr/",
          "text": "That's a really good idea! I cook and meal prep all the time too. Perhaps a date can be that  I cook something for her and make it something with a bit more effort.",
          "author": "Astsai",
          "created": 1631306275,
          "upvotes": 2,
          "replies": {
            "hccvan1": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccvan1/",
              "text": "Exactly! Making dinner and eating is something you have to do anyways :) \n\nsomething that’s also similar, if they’re the right person for it: study somewhere nice with them. Lay down a blanket in the park. Even a coffee shop. They can read a book while you work if they have nothing to work on!",
              "author": "aka_hopper",
              "created": 1631306480,
              "upvotes": 2,
              "replies": {
                "hccw1we": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccw1we/",
                  "text": "That's also a really great idea! I used to do that with a friend when they would study, and I'd just hang around and give them company.  \n\n\nYeah tbh I always preferred being friends with someone and then progressing to something more. It's nothing against hookup culture, but it was just never for me. The study idea is a good way to just be around someone",
                  "author": "Astsai",
                  "created": 1631306804,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hccfzar": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccfzar/",
      "text": "[deleted]",
      "author": null,
      "created": 1631299933,
      "upvotes": 2,
      "replies": {
        "hcmgby2": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcmgby2/",
          "text": "I think you’re missing the point of the question. It’s not “how to ask someone on a date”, it’s “how the hell do you find time to date when you’re expected to work constantly”",
          "author": "Spooplegeist",
          "created": 1631487357,
          "upvotes": 1,
          "replies": {
            "hcmohft": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcmohft/",
              "text": "[deleted]",
              "author": null,
              "created": 1631491098,
              "upvotes": 1,
              "replies": {
                "hcmu3kw": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcmu3kw/",
                  "text": "Saying no for sure. Time management could very well not be an issue. From my experience, my time management is usually pretty good, but I commit to way too many things, so even with good time management you can get overwhelmed.",
                  "author": "Spooplegeist",
                  "created": 1631493803,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hcc79qi": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcc79qi/",
      "text": "I met my boyfriend the first day of undergrad and have kept him since then. Now that we’re both in grad school, if we didn’t live together we’d never actually see each other.",
      "author": "yinyang2000",
      "created": 1631296210,
      "upvotes": 2,
      "replies": {}
    },
    "hcc1wt9": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcc1wt9/",
      "text": "This question comes up all the time. My personal philosophy is that overall dating is difficult, but it becomes super easy when/if you meet the right person. Anecdotally I met my husband first semester first year on a dating app. Most people in my program are married or dating someone long term, so my general impression is that it's not unusual to be in a relationship during a PhD. Most of us are mid-late 20s  both male and female. Dating advice is very basic. Put yourself out there as much as you can, be respectful to people you end up being not that interested in, and you'll want to spend more time with the person who's right for you.",
      "author": "defnotaturtle",
      "created": 1631293954,
      "upvotes": 2,
      "replies": {}
    },
    "hcbx8w8": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbx8w8/",
      "text": "Yes I met my current gf using Hinge. Out in DC Tinder is an absolute nightmare so I couldn't use that. I used it casually and didn't pursue anyone until I for sure knew I could make time for them. I saw my current gf every weekend (unless I had important projects/paper) and now we just moved in together. It has made a lot of things so much easier. You just gotta see if you can make time and make the expectations of time clear when you start dating someone. It's not easy but not impossible.",
      "author": "Bababooey5000",
      "created": 1631292074,
      "upvotes": 2,
      "replies": {}
    },
    "hcbsbqk": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbsbqk/",
      "text": "Met her in the lab. We spent a lot of time together talking, having lunch togerher or working bench next to each other. Afterwards we just decided to go for a coffee or some food over weekend or after work.",
      "author": "SnooCakes1148",
      "created": 1631290110,
      "upvotes": 3,
      "replies": {}
    },
    "hcbn5yu": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbn5yu/",
      "text": "So I find a lot of other grad students used dating apps to meet people outside of grad school.  Dates are initially just affordable things like just getting ice cream or just going on a hike together.  If you already feel that you don't have enough time then maybe hold off on dating for a while\n\nHowever.  I got very lucky and I met my girlfriend (another PhD candidate) in another research group.  What works for you works for you, but I wasn't originally expecting to date within my program (the old \"don't date where you work\").  We originally started as friends.  Two years later, I guess one thing led to the other and we connected.",
      "author": "HalfEatenPie",
      "created": 1631288023,
      "upvotes": 6,
      "replies": {}
    },
    "hcbl0vf": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbl0vf/",
      "text": "Exercising and having many friends are not a part of my life right now, unfortunately.\n\nBut I do have a girlfriend of 6 years. We live together, so I don't know if that counts as dating.",
      "author": "Composer_Josh",
      "created": 1631287162,
      "upvotes": 2,
      "replies": {
        "hcbn182": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbn182/",
          "text": "Yeah it can be genuinely tough balancing everything, and it isn't as simple as making time. Depending on our program, location and prior finances it can be difficult to make a lot of things work. But I guess being creative is what allowed us to get into a PhD in the first place, so we can extend it to other parts of our lives(hopefully)",
          "author": "Astsai",
          "created": 1631287971,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hcb909d": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb909d/",
      "text": "Biomedical phd here.  I dated, got married, and subsequently divorced during my time in grad school!  \n\nIn the end, if you find someone you really like, you'll find the time to spend with them.",
      "author": "Midnight2012",
      "created": 1631282110,
      "upvotes": 6,
      "replies": {}
    },
    "hcb6yw0": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb6yw0/",
      "text": "By treating my PhD like a 9-5 job, never working on the weekends and extremely rarely on the evenings, and prioritizing my well-being.",
      "author": "riotous_jocundity",
      "created": 1631281199,
      "upvotes": 4,
      "replies": {}
    },
    "hcb3ilf": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb3ilf/",
      "text": "Tinder. Dating apps was a part time job tbh.\n\nYou gotta make time for it. I remember swiping a lot when bored during late night papers. \n\nBut it's hard",
      "author": "Asteroth555",
      "created": 1631279563,
      "upvotes": 2,
      "replies": {
        "hcb4u8q": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb4u8q/",
          "text": "Yeah it's definitely difficult. I think the structure of a PhD makes it hard because it's not just our research we're dealing with but also many other external life factors. One of my friends got a part time job at Target to make ends meet, and he's already stretched thin too.   \n\n\nHonestly if we did get paid more, that will make things easier and have a cumulative effect on other areas of our lives. But unfortunately that's not changing soon, so we just got to to make whatever we have work",
          "author": "Astsai",
          "created": 1631280206,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hcb37o5": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb37o5/",
      "text": "I've had some success just through online dating.  Online dating sucks and dosnt feel very organic but its efficient when you are working in the lab all the time. The option is just friends of friends and mutual interest.  I met my partner of the last 3 years on a hiking trip I went on with a mutual friend.",
      "author": "PYP_pilgrim",
      "created": 1631279415,
      "upvotes": 2,
      "replies": {}
    },
    "hcb2m4g": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb2m4g/",
      "text": "You make time. \n\nA PhD isnt school, its your career. You have to start establishing hard lines between work and your life. Yes, there will be times that work spills over into your life, but you have to control it. \n\nAs for money, yeaaaa, nature is awesome and free lol cant really give advice because its all location dependent.",
      "author": "CptSmarty",
      "created": 1631279122,
      "upvotes": 18,
      "replies": {}
    },
    "hcb0fxf": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb0fxf/",
      "text": "I think if I hadn’t met my partner before starting grad school, dating would be dead last on priorities. I also plan on marrying this man so I’m committed to making it work. He has also had crazy schedules in the past where I could basically only see him at night time like once a week, so we have that understanding that sometimes life gets busy and it’s harder to see each other. The money aspect is something that I’m currently struggling with right now because I did not do a good job of saving during the summer months. I feel like my partner has spent a lot of money on me and taking me out and it sucks that I can’t reciprocate as much as I want to at the moment. But I think he understands and it’s a temporary situation so to me it’s worth it.",
      "author": "friendlyfyre77",
      "created": 1631278011,
      "upvotes": 2,
      "replies": {}
    },
    "hcavsf7": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcavsf7/",
      "text": "Met my current bf when I was doing my masters, moved to a different country for my PhD, so now it's long distance. Covid helped, he, also a PhD student, can work from home (I can't, mol biologist) so in the past year he spent ~4 months at my house. Now we're trying to see each other every 3 weeks, for a weekend, or if he can, more. But we're trying to work out something else (he living with me half the time or 40%) if we can, because travelling is expensive and long distance is annoying.\nWould definitely be easier if we were living together; at the same time, I can also appreciate having weeks all by myself since we can't just casually go out for dinner or whatever. If we had been in the same city not living together, it would probably have been harder to find the time!\n\nI also have to say he was already a PhD student when we met, and he found the time to get to know and date me, mostly we'd meet for dinner or afterwards till the morning, and on weekends. And, as I read the other comments: he's in physics too 😂",
      "author": "Thr1w1w11",
      "created": 1631275450,
      "upvotes": 5,
      "replies": {
        "hcaxunf": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcaxunf/",
          "text": "That's something I've always considered. Trying long distance has always been on my mind, but it seems difficult to pull off. Would you say it was crucial you both met in person first or do you think it's possible to start online and then transition into real life?",
          "author": "Astsai",
          "created": 1631276619,
          "upvotes": 1,
          "replies": {
            "hcaz1dx": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcaz1dx/",
              "text": "It was crucial for one reason, which is when we met I wasn't looking for anything serious, I told him \"I'm leaving for my PhD in a few months\", as I planned to go to a different country; he told me ok, we casually dated a couple of months (I was head over heels for him but couldn't admit it, same for him); Covid hit, we ended up spending 2 months at his house in complete lockdown. We could only go out for groceries, alone. If it weren't for covid, I don't know if we'd still be together!\n\nMy previous relationship was also long distance, we briefly met in person and then I left for my bachelor. It didn't work out, also because we had no money to travel as much as now, but at the time it was really nice to have the free time to enjoy the uni life and we skyped every day. Then we got closer, about 3h away. It didn't work for various reasons, but also because we were probably incompatible in real life, I got tired of always having to leave my life to go to his place, and I didn't see a way to close the gap anytime soon.\n\nI think with the right mindset, and especially if you can see an end to the long-distance, it can be pretty nice if you're very busy!",
              "author": "Thr1w1w11",
              "created": 1631277263,
              "upvotes": 2,
              "replies": {
                "hcaz7wf": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcaz7wf/",
                  "text": "Awesome! I appreciate the perspective",
                  "author": "Astsai",
                  "created": 1631277360,
                  "upvotes": 1,
                  "replies": {
                    "hcazhvk": {
                      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcazhvk/",
                      "text": "You're welcome!",
                      "author": "Thr1w1w11",
                      "created": 1631277510,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hcarw5h": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcarw5h/",
      "text": "Block off time on your schedule reserved for dates.\n\nGo out for ice cream and a walk in the park.  You can afford $15 and your existing bus pas, big spender.\n\nMet my wife 2nd year, married 4th year, graduated in 6 years.  You can balance them if you want to balance them.",
      "author": "Weekly-Ad353",
      "created": 1631273070,
      "upvotes": 3,
      "replies": {
        "hcavkwr": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcavkwr/",
          "text": "Yes I'm quite aware of time works. I am a physicist after all.   \n\n\nHowever, time is complicated depending on levels of privilege. It's the same reason why people don't get into PhD programs. It isn't because of a lack of talent or ability, but some people are going through many external events that prevent them to allocating time. Likewise socioeconomic factors come into play.   \n\n\nWe went through a global pandemic, and although I didn't disclose details in OP there are still things I'm dealing with in the aftermath. But that's why I'm asking the question. A good quality of any researcher is to ask questions and parse through the information to get the best decision, which is what I believe I'm doing here",
          "author": "Astsai",
          "created": 1631275329,
          "upvotes": 4,
          "replies": {
            "hcawp11": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcawp11/",
              "text": "I’m not sure what you’re upset about.\n\nYou said you didn’t have money, I said dates don’t have to be expensive or impressive.  Ice cream is $15, talk is free, parks are free.\n\nYou said you don’t have time, I said you block it off.  I worked 80 hours a week, 6 days a week, and managed to figure it out well enough to meet someone and get married to them.\n\nIt can be done.  If you disagree, then that’s fine.  Being single for 6 years isn’t the worst thing ever.\n\nEither way, good luck!",
              "author": "Weekly-Ad353",
              "created": 1631275969,
              "upvotes": 1,
              "replies": {
                "hcawxoa": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcawxoa/",
                  "text": "> I worked 80 hours a week,\n\nNo you didn't. We're all PhDs here dude, there's no reason for you to exaggerate.   \n\n\nAnyway, it was the general condescending tone of your post is what I had an issue with, but it's clear you aren't aware of it so there's no point in continuing this conversation",
                  "author": "Astsai",
                  "created": 1631276108,
                  "upvotes": 0,
                  "replies": {
                    "hcaxgod": {
                      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcaxgod/",
                      "text": "And it’s clear you don’t actually want to solve your problem, you just want to bitch about your shitty dating life.\n\nThat’s ok too 🙂",
                      "author": "Weekly-Ad353",
                      "created": 1631276406,
                      "upvotes": 3,
                      "replies": {
                        "hcaxl0c": {
                          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcaxl0c/",
                          "text": "I thought you were leaving this conversation? But if you want to continue this conversation, I don't blame you. I'm quite an interesting person",
                          "author": "Astsai",
                          "created": 1631276472,
                          "upvotes": -4,
                          "replies": {
                            "hcayefp": {
                              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcayefp/",
                              "text": "Jesus, no wonder you’re having trouble dating.",
                              "author": "Weekly-Ad353",
                              "created": 1631276919,
                              "upvotes": 9,
                              "replies": {
                                "hcbcn6d": {
                                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbcn6d/",
                                  "text": "That's cool, anyway my overall point is that making time isn't as black and white you're making out to be. Different levels of privilege allow a person to do other things besides work. As I mentioned earlier it's the same reason people who can't get into PhDs or certain prestigious jobs don't necessarily lack talent, ability, or work ethic. There are socioeconomic factors affecting people and that's why there have been bigger pushes to encompass things like diversity and inclusion. Likewise it's the same reason people have been unionizing and protesting for better working conditions and pay.\n\nI'm not from a privileged background and there's many things I have to take care of along with my graduate education. I'm aware of that though and that's why I'm trying to figure a solution. I'm aware a stroll through the park is free, but if I never get to the park it's not a solution.",
                                  "author": "Astsai",
                                  "created": 1631283695,
                                  "upvotes": -4,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hcar7cd": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcar7cd/",
      "text": "I got in a relationship during my gap year before grad school.  We started living together before I started grad school so we can spend most evenings together. He works long days so I do my work while he does his.  If anything it motivates me to get stuff done in a timely fashion",
      "author": "Sriracha11235",
      "created": 1631272612,
      "upvotes": 2,
      "replies": {}
    },
    "hcahui1": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcahui1/",
      "text": "It only gets worse once you leave school and the only people you see are your coworkers (don’t want to date if you value your job). Working night shifts makes it even worse. The only places open when you are awake to meet people are bars and 24 hours gyms (if the people there will even stop their workout to socialize). Same for making friends.",
      "author": "UleeBunny",
      "created": 1631265104,
      "upvotes": 3,
      "replies": {}
    },
    "hcaefd5": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcaefd5/",
      "text": "I emailed my high school crush of 10 years and before I knew it we are doing long distance and are now married with a kid.\n\nI did dating apps during grad school.  In my experience, very few people want to date poor graduate students, and the people who do are hit or miss.",
      "author": "todeedee",
      "created": 1631262076,
      "upvotes": 5,
      "replies": {
        "hcay82q": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcay82q/",
          "text": "How long were you both long distance if you don't mind me asking?",
          "author": "Astsai",
          "created": 1631276823,
          "upvotes": 1,
          "replies": {
            "hcbd7zk": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbd7zk/",
              "text": "About a year and a half.",
              "author": "todeedee",
              "created": 1631283944,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hcae08l": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcae08l/",
      "text": "Sounds bad but we have a schedule . I block out one week night and Friday night/Saturday for him - back into the lab Sunday. We're discussing moving in together and I'm not going to lie it freaks me out. I work till midnight normally 2/3 nights a fortnight and am often up at 5am to prepare fior presentations. \n\nAs much as i love him he eats into my data processing time 😂😂",
      "author": "iamtryingmybest_ok",
      "created": 1631261690,
      "upvotes": 2,
      "replies": {
        "hcbaikq": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbaikq/",
          "text": "Does that schedule take a toll on you, or do you feel it's manageable overall? Do you need \"breaks\" from the schedule you have?",
          "author": "Astsai",
          "created": 1631282769,
          "upvotes": 1,
          "replies": {
            "hcd5j7l": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcd5j7l/",
              "text": "No I definitely need breaks. I am lucky that i can \"work from home\" and have a morning to myself. A lot of this is only manageable because it's lockdown here so no friends or pubs or restaurants or gym. I will say i am lucky that my boyfriend will work out and do chores with me as well. He's very understanding of my schedule and will happily tuck me in at 9pm.",
              "author": "iamtryingmybest_ok",
              "created": 1631310993,
              "upvotes": 2,
              "replies": {
                "hcdm1wa": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcdm1wa/",
                  "text": "That's really sweet\\^. Glad you both found something that works out well",
                  "author": "Astsai",
                  "created": 1631319023,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hca8nqr": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hca8nqr/",
      "text": "Friend circles, and casual conversations with acquaintances... I prefer widening my social circles over explicitly looking for someone.",
      "author": "eragram",
      "created": 1631257075,
      "upvotes": 3,
      "replies": {}
    },
    "hca7518": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hca7518/",
      "text": "You end up spending less time with your friends and more tine with your SO. So is life.",
      "author": "johnnydaggers",
      "created": 1631255900,
      "upvotes": 1,
      "replies": {}
    },
    "hca6oux": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hca6oux/",
      "text": "Friday bar night",
      "author": "memercopter",
      "created": 1631255565,
      "upvotes": 3,
      "replies": {}
    },
    "hca5lo9": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hca5lo9/",
      "text": "I met my partner through Bumble and then we didn't talk for two years lol reconnected in a class and it went off from there. We try to make activities into dates like working during the day together or exercising at night. I could not date someone who didn't understand my schedule.",
      "author": "dogdogloglog",
      "created": 1631254764,
      "upvotes": 2,
      "replies": {}
    },
    "hca3vwa": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hca3vwa/",
      "text": "My boyfriend was also a grad student when we met so he was just as busy as me. That way, he understood when I didn’t have time for him. Also helps that he’s an introvert, so he enjoys time to himself when I’m busy. So… find an introvert grad student to date???",
      "author": "the-tautologist",
      "created": 1631253524,
      "upvotes": 7,
      "replies": {}
    },
    "hca0euw": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hca0euw/",
      "text": "Dating app. Made it clear I was working on a PhD and only had so must free time. Met a girl who understood.",
      "author": "hdorsettcase",
      "created": 1631251111,
      "upvotes": 4,
      "replies": {}
    },
    "hc9w7e6": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9w7e6/",
      "text": "It depends - what's your priority? If your studies are the most important thing to you....that's going to be tricky. Your best bet would be someone who is also doing graduate studies, so that they understand the time/energy commitment required.\n\nUnfortunately the best solution is the impossible one - go into it with an established partnership. That way the stakes and investment are there from the get-go. But starting something new in grad school is going to be difficult. It's up to you to determine if it will be worth the effort.\n\nBackground: poly person with dedicated NP, pursued some other relationships within my cohort (experimental physics PhD).",
      "author": "ThePeregrine_87",
      "created": 1631248449,
      "upvotes": 2,
      "replies": {}
    },
    "hc9t03b": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9t03b/",
      "text": "I bought my bike from my bf, soon fiance. He's a bike mechanic. That was the first year of my MS, I am in year two rn.\nHow did I make time for it.... I prioritized it. If you want to date, prioritize. If its not super important to you, then.... you wont. Simple.",
      "author": "TypeOfPlant",
      "created": 1631246654,
      "upvotes": 4,
      "replies": {}
    },
    "hc9rvbn": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9rvbn/",
      "text": "I met my current partners at a kink party\n\n\nI met the person who invited me to the party through a Meetup group.\n\nI always tried to make sure I made time to socialize on Friday and Saturday nights, even if I spent weekend days studying.",
      "author": "prettyorganic",
      "created": 1631246071,
      "upvotes": 2,
      "replies": {}
    },
    "hc9qtvm": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9qtvm/",
      "text": "I’m not dating, I’m married but I do still have to manage my relationship and find time for it. My SO also works crazy overtime. He can be gone from 5 am to 10 pm easily. Our together time is scheduled. We make sure to eat dinner together as much as possible. We text throughout the day. We both make sure that we take at least one night a week (typically a Saturday) and give ourselves a date night. We are both tired and worn out so we’ve been finding some easy to do activities, we started a Hunt A Killer subscription so we have something show up and something that involves quality time and no screens. \n\nI get that it’s a lot harder to meet & get to know someone then already being married. But i do think it’s important to pencil in at least a little time a week for maintaining relationships. In some cases, it can help if your partner is as busy as you are and thus able to be more understanding.",
      "author": "smaugismyhomeboy",
      "created": 1631245542,
      "upvotes": 3,
      "replies": {}
    },
    "hc9p83g": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9p83g/",
      "text": "I met my boyfriend during my 2nd year. He was not in grad school nor really knew what a PhD program was like. I'm super lucky that he has always been super understanding that my hours are often ridiculous. Even little things like being in the same room while I'm working on a Saturday so we can spend time together even if it's just a few words here and there or during short breaks are a big deal. Literally during football season I'd work on Saturday while watching football and he'd sit right next to me playing a game and we'd talk back and forth and make jokes. I cherished those Saturdays so much.\n\nAt the same time, you have to prioritize time with them too. This would never have lasted if I didn't have boundaries for my work and couldn't say \"you know what today we need time for us even if I have things to do.\"\n\nOverall it's a lot of good time management and a lot of communication. It's definitely a lot of work and I do feel guilty sometimes when my PhD holds us back from doing things, but it's definitely manageable if it's something you both really want. Now it's a real team effort for us to finish and move on. 4 years in and we're finally almost free 🙌",
      "author": "Unlikely-Name-4555",
      "created": 1631244743,
      "upvotes": 33,
      "replies": {}
    },
    "hc9mp1m": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9mp1m/",
      "text": "I had a boyfriend before entering grad school. I was lucky. We had already been dating a few years before grad school started so we have a good foundation. We are now long distance as he started grad school (different program) at the same time I did. So I have too much free time probably.",
      "author": "A_Ball_Of_Stress13",
      "created": 1631243479,
      "upvotes": 2,
      "replies": {}
    },
    "hc9lslp": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9lslp/",
      "text": "My now-husband (who was in a chemistry PhD program) and I had many many study dates with takeout and taking turns spending time with the other during late nights in lab. We also went to gym together - didn't necessarily workout together the whole time but just having someone to keep you accountable. With a lot of flexibility, understanding, and a little effort, it works :) \nBest of luck!",
      "author": "Team_Cap",
      "created": 1631243046,
      "upvotes": 9,
      "replies": {}
    },
    "hc9jinf": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9jinf/",
      "text": "The pandemic helped a lot. I wasn't able to do any research which freed up a bunch of time to get to know my (now) fiance!",
      "author": "aaalexaaandraaa_",
      "created": 1631241978,
      "upvotes": 12,
      "replies": {}
    },
    "hc9gtze": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9gtze/",
      "text": "Physicist here too, and I gotta say, it's doable. You said you catch up with friends, I found my SO through my friends! Use their circles to expand yours, that'll increase your chances for sure!",
      "author": "dovaahkiin_snowwhite",
      "created": 1631240749,
      "upvotes": 15,
      "replies": {
        "hc9iojy": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9iojy/",
          "text": "I'll do that for sure! TBH I always preferred starting a friendship and having that develop into something more. Dating apps make it hard to do that",
          "author": "Astsai",
          "created": 1631241598,
          "upvotes": 5,
          "replies": {
            "hc9ulax": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9ulax/",
              "text": "Same for me, and worked perfectly while hanging out without any pressure to date or anything! Good luck! :D",
              "author": "dovaahkiin_snowwhite",
              "created": 1631247518,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hc9gavl": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9gavl/",
      "text": "i met my boyfriend in my program! it was nice bc we were both as busy and could study together and stuff haha",
      "author": "BlueTheo333",
      "created": 1631240504,
      "upvotes": 24,
      "replies": {
        "hc9imqa": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9imqa/",
          "text": "Same!",
          "author": "579red",
          "created": 1631241574,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hc9envi": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9envi/",
      "text": "I met my now fiancé in grad school via dating apps - honestly I kept the casual dating to a minimum during the academic year and worked harder on it during the summers.",
      "author": "Capt_McDinoWoman",
      "created": 1631239777,
      "upvotes": 50,
      "replies": {
        "hc9f141": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9f141/",
          "text": "That's a good move, and I'll try to do the same. It's a little bit unfortunate because I'm always feeling the best in the fall and spring...but things get so hectic during then",
          "author": "Astsai",
          "created": 1631239938,
          "upvotes": 4,
          "replies": {
            "hc9gf4y": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9gf4y/",
              "text": "I think if you’re feeling good you gotta make time, but maybe keep it to a minimum? I’m not saying I wasn’t swiping during incubations lol, but I wouldn’t offer or agree to a date during the year unless it seemed like a good match",
              "author": "Capt_McDinoWoman",
              "created": 1631240558,
              "upvotes": 9,
              "replies": {
                "hc9gn42": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9gn42/",
                  "text": "Oh yeah for sure! Yeah it's good to be responsible. I'm guessing my committee wouldn't be too happy about missing candidacy because I was on Tinder all day(or maybe they would who knows)",
                  "author": "Astsai",
                  "created": 1631240659,
                  "upvotes": 2,
                  "replies": {
                    "hc9gzat": {
                      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9gzat/",
                      "text": "yeah I have an iPhone and I kept it on a timer - I think there’s parental controls that limit app access to a certain time, I had it set to like an hour a day so I wasn’t just doomscrolling",
                      "author": "Capt_McDinoWoman",
                      "created": 1631240817,
                      "upvotes": 3,
                      "replies": {
                        "hcdwz5b": {
                          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcdwz5b/",
                          "text": "I just started doing this last week! I read something about setting reasonable rules/expectations/boundaries for yourself the way you might for a child you cared about, and I instituted some screen time boundaries. Time limit for Instagram and tiktok, and all social media turned off from 10pm-7am. It’s been so nice!",
                          "author": "errtffg",
                          "created": 1631324577,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hccgx1s": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccgx1s/",
                  "text": "What app did you use?",
                  "author": "Task876",
                  "created": 1631300340,
                  "upvotes": 1,
                  "replies": {
                    "hce6khf": {
                      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hce6khf/",
                      "text": "I met him on Tinder but was, uh, not using it with the intention of forming long-term commitments lmao. My friends who are still in the game say Bumble and Hinge are better now where we are - I think Hinge provides conversation prompts etc. so it’s not just endless “heyyyyy”s",
                      "author": "Capt_McDinoWoman",
                      "created": 1631329627,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hcatrd0": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcatrd0/",
          "text": "By this do you mean because you had no teaching workload? Or did you generally have a lower practical workload in the summer? (Though I recognise that you may be from the US, where you have courses that don't run in the summer)",
          "author": "Mashpole",
          "created": 1631274239,
          "upvotes": 1,
          "replies": {
            "hce6umd": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hce6umd/",
              "text": "I’m a geologist so mostly it is that all my distractions (other grad students) are out in the field during the summer so I get more work done during the workday as opposed to “getting coffee” every two hours. I’m also at a university on the semester system so there are way fewer classes that run in the summer and I’ve luckily been mostly RA funded during that time anyway, while I TA or teach during the semesters",
              "author": "Capt_McDinoWoman",
              "created": 1631329784,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hccjljv": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccjljv/",
          "text": "Yep, met my partner (also a PhD student) through Tinder",
          "author": "Interesting-Ad7086",
          "created": 1631301500,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hc9banv": {
      "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9banv/",
      "text": "Commenting because I want to know as well 😂",
      "author": "pumpkinator21",
      "created": 1631238288,
      "upvotes": 70,
      "replies": {
        "hc9c7bs": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9c7bs/",
          "text": "I'm also a physicist. Sometimes I wonder if our field purposely makes it hard for people date so we only do physics",
          "author": "Astsai",
          "created": 1631238677,
          "upvotes": 29,
          "replies": {
            "hc9fz0o": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9fz0o/",
              "text": "Not just physicists, biologists suffer the same fate lols.",
              "author": "Cookeina_92",
              "created": 1631240359,
              "upvotes": 24,
              "replies": {
                "hcbnpfj": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcbnpfj/",
                  "text": "I think that Physics/biology departmental mixers would be very fruitful.   Opposite gender ratios, both STEM, both grad student.\n\n(I’m in an all-male physics friend group and hang  out sometimes with an all-female bio group, and they both keep complaining about how hard it is to find someone to date.)",
                  "author": "Ocelot843",
                  "created": 1631288238,
                  "upvotes": 4,
                  "replies": {}
                },
                "hc9nf4v": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hc9nf4v/",
                  "text": "It's true, am evidence :,(",
                  "author": "NintendoNoNo",
                  "created": 1631243830,
                  "upvotes": 1,
                  "replies": {}
                },
                "hcent7r": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcent7r/",
                  "text": "So glad me (biologist) and my fiance (physicist) met in undergrad because we live together and barely have time to spend together",
                  "author": "NanoRiff",
                  "created": 1631341088,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hcaq2zs": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcaq2zs/",
              "text": "I’m a physicist and started dating someone in my 2nd year (out of 3, UK). We’ve just moved into an apartment together yesterday!\n\nWe met after being assigned as flatmates for my college’s accommodation, so that made it very easy to spend casual time together. \n\nWe do go out on dates maybe once a week (when possible) though. It’s not really my preference to go out a lot since I’m very “introverted” and have autism, so I enjoy quiet time alone, but going out occasionally isn’t too much of a compromise.\n\nMy partner is also a physicist with a very active social life and works out quite often with the gym and rugby. Those aren’t negatives to me, it just gives me more alone time to decompress.\n\nI think the most important thing is to find someone complementary to you. If you’re quite busy then you need someone who’s okay with that and who doesn’t need or want constant attention from you.\n\nBut pro-tip: leave work at work. I finish at 5 if my partner is home that evening. Make your work day end time absolute and you’ll probably get more done.",
              "author": "officially_anxious",
              "created": 1631271827,
              "upvotes": 10,
              "replies": {}
            },
            "hccnwwd": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccnwwd/",
              "text": "I’m a social scientist. Some of my research literally looks at how romantic partners interact with one another. I still have literally no idea what I’m doing in terms of dating lol",
              "author": "discoverysol",
              "created": 1631303337,
              "upvotes": 7,
              "replies": {
                "hccuyjg": {
                  "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccuyjg/",
                  "text": "Glad to know that even the experts have no idea what to do sometimes. Makes the dating world a little less scary",
                  "author": "Astsai",
                  "created": 1631306337,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "hca10h6": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hca10h6/",
              "text": "*cries in Mechanical engineering.",
              "author": "foucowl",
              "created": 1631251513,
              "upvotes": 6,
              "replies": {}
            },
            "hcb6n1f": {
              "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hcb6n1f/",
              "text": "Yes",
              "author": "murfmurf123",
              "created": 1631281051,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hccod56": {
          "link": "/r/GradSchool/comments/plau0b/for_people_who_are_in_grad_schoolphd_and_have_met/hccod56/",
          "text": "commenting the comment bc I want to know as well, also physics phd student lol",
          "author": "coffee24",
          "created": 1631303527,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066780
}