{
  "sid": "ma8tmb",
  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/",
  "title:": "Gentle reminder to make sure you have a backup of your computer and research files.",
  "text": "This is coming from someone who essentially just lost 3 years of data after their work computer crashed. \n\nAbout a week ago the power was shut off in my lab building and when the power was turned back on my computer wasn’t turning on properly. Our IT department took the computer to reboot it. Our computers are supposed to have automatic backups but I told them to back the computer again b/c I am paranoid that the backup wasn’t up to date. \nGot the computer back on Friday and nothing was backed up. Apparently backup that was set up on my computer was just backing up install files IT set up and the person in charge of backing up my computer was some part-time/intern who didn’t back everything up before wiping my computer. Going to talk to IT on Monday but they already warned me that its 99% certain everything is gone. \nI have already have had super low motivation to do anything and this is just another major setback that has me really questioning if I should even stay in school.",
  "author": "Idontevenknow5555",
  "created": 1616368466,
  "over_18": false,
  "upvotes": 655,
  "upvote_ratio": 0.99,
  "comments": {
    "gru1rbi": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/gru1rbi/",
      "text": "I was so paranoid back in grad school, that I backed up my work to 2 different USBs daily, and always took one home with me.",
      "author": "Schedonnardus",
      "created": 1616434703,
      "upvotes": 1,
      "replies": {}
    },
    "grtyqml": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grtyqml/",
      "text": "there is a form to sign before IT do anything on any computer in my school, it is legal binding document saying that the owner has to backup everything and anything that is loss during the inspection or repair, the repair department is exempt from any legal consequences.",
      "author": "yinshiyi",
      "created": 1616433385,
      "upvotes": 1,
      "replies": {}
    },
    "grtu4ho": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grtu4ho/",
      "text": "This happened to me last week. I’m wishing this post came sooner.",
      "author": "Fist0fGuthix",
      "created": 1616431372,
      "upvotes": 1,
      "replies": {}
    },
    "grthtkn": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grthtkn/",
      "text": "sync your computer to an online drive.  Its easier that way.",
      "author": "IWantToDoEmbedded",
      "created": 1616426091,
      "upvotes": 1,
      "replies": {}
    },
    "grtd3is": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grtd3is/",
      "text": "I am so very sorry this happened to you. I also learned the hard way....bought a brand new Macbook pro in 2018 and my hard drive crashed after just 6 months. Luckily only lost a year's worth of data analysis that I had to re-do anyway but I immediately purchased a $300 SSD and religiously back up all my shit now on a physical drive and iCloud.",
      "author": "thati0wagirl",
      "created": 1616423997,
      "upvotes": 1,
      "replies": {}
    },
    "grsufpe": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsufpe/",
      "text": "I agree with others who are skeptical of your IT department. I had an old Dell several years ago, and it straight up died and I don't know what was wrong with it. I ended up having a date with this guy who was super into computers and just made an offhand comment about my computer and he told me he could take a look. Long story short, he was able to take out the hard drive and transfer everything to an external hard drive. I didn't really have anything backed up, it was just saved on the hard drive. \n\nI would definitely get it looked at elsewhere. If someone else was able to fix it, I'd probably contact the IT department to let them know, because it's something they'd need to be aware of so they don't end up misinforming other people. \n\nIn a comment, you mentioned that the computer is university property and IT folks are the only ones allowed to look at it. I agree with others' suggestions to go over their head and keep asking to speak to a supervisor until you get the very last person in the chain if need be (I'd also loop in your supervisor and/or department chair since this is a broader issue and may impact others). In the meantime, is there really any harm in getting a *consultation* from elsewhere? Your IT folks told you there was a \"99%\" chance the data is not recoverable (which, btw, I tend to interpret figures like that more along the lines of 'I don't know how' or 'I could, but I'm too lazy'), but if there was someone else who told you it was a 40% chance the data could be recovered, maybe it's worthwhile to have a discussion and let them know what the IT people did/said.",
      "author": "False-Guess",
      "created": 1616413569,
      "upvotes": 2,
      "replies": {}
    },
    "grsnyda": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsnyda/",
      "text": "Yeah everything is backed up through a school-provided cloud drive, lab provided server, my personal cloud service account, and on external hard drive where I occasionally save my back up files....am I missing anything?",
      "author": "geometer2015",
      "created": 1616408119,
      "upvotes": 1,
      "replies": {}
    },
    "grsfjz3": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsfjz3/",
      "text": "thats devastating..... have you considered checking the computers hooked up to the measuring equipment for the raw data? not sure what type of experiments you were doing or if this applies",
      "author": "moffedillen",
      "created": 1616399513,
      "upvotes": 1,
      "replies": {}
    },
    "grrzbep": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrzbep/",
      "text": "Once you get through this, I recommend use the cloud back up, I understand you thought that was happening. Also recommend you invest in a 50 dollar USB SSD drive and back to that as well.",
      "author": "lefty_tn",
      "created": 1616385505,
      "upvotes": 1,
      "replies": {}
    },
    "grrqxqu": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrqxqu/",
      "text": "Not sure if your in CS, but that's where github comes in",
      "author": "dsli",
      "created": 1616380409,
      "upvotes": -1,
      "replies": {
        "grrvom4": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrvom4/",
          "text": "Version control more generally. GitHub, a departmental/institutional git server, bitbucket, GitLab, self hosted, etc. are all options for at least one remote.  And ideally, you keep a backup of that also.",
          "author": "sierrawhiskeyfoxtrot",
          "created": 1616383159,
          "upvotes": 3,
          "replies": {}
        },
        "grs7xd7": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grs7xd7/",
          "text": "That's for small files, not large ones.\n\nBackup and version control are very different things. What OP needs is a redundancy solution. Most common redundancy solution is to keep a copy elsewhere (e.g., sync to cloud storage or make cold backups).",
          "author": "diamondketo",
          "created": 1616392182,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "grrom0u": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrom0u/",
      "text": "3-2-1 rule, 3 backups - 2 remote and 1 physical\n\nalso look into setup that automatically sync your folders, I use pCloud for this",
      "author": "Farconion",
      "created": 1616379149,
      "upvotes": 19,
      "replies": {
        "grtee5e": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grtee5e/",
          "text": "I’ve always heard 3 copies, 2 different media, 1 remote.",
          "author": "ouemt",
          "created": 1616424586,
          "upvotes": 3,
          "replies": {}
        },
        "grsersk": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsersk/",
          "text": "Yep!! This is spot on -  If it doesn't exist in three places it doesn't exist.",
          "author": "dreadedbugqueen",
          "created": 1616398709,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grrokem": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrokem/",
      "text": "GitHub. Perfect for backup and for version control.",
      "author": "Protean_Protein",
      "created": 1616379124,
      "upvotes": 2,
      "replies": {}
    },
    "grro5tq": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grro5tq/",
      "text": "True, especially if you need a writing  sample for an internship with a think tank",
      "author": "alan5031",
      "created": 1616378908,
      "upvotes": 1,
      "replies": {}
    },
    "grrnvf6": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrnvf6/",
      "text": "Three years of data... gone would have been heartbreaking. My grad school advisor was very adamant about having two back-up sources (one external hard drive and the other something like Dropbox).",
      "author": "trashman253",
      "created": 1616378752,
      "upvotes": 5,
      "replies": {}
    },
    "grrlt47": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrlt47/",
      "text": "I just dropped $400 on a 4-bay NAS because my PhD laptop died back in February. I backed up monthly, but it was still terrible to lose a month's worth of work.\n\nA couple hundred now will save you far more than that in the future. Academics are nothing without their data.",
      "author": "ValleyForge",
      "created": 1616377678,
      "upvotes": 3,
      "replies": {}
    },
    "grrlovh": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrlovh/",
      "text": "When I was in grad school --1990s --folks kept backup floppies in their freezers at home. The idea, as I was told, was that if there was a fire they'd be more likely to survive. (Apparently grads couldn't afford fire safes.)\n\nI've had a few undergrads lose theses-in-progress over the years. On day one in our research seminars we talk about redundant, off site backups of critical data and drafts. It's a vital lesson. All of my work is backed up in the cloud, on an external drive in my office, and on my home server as well as being on my laptop.\n\nAnother issue some colleagues at public institutions have encountered: subpoenas! It may be a good idea to keep a set up backups independent of any system your institution controls.",
      "author": "SnowblindAlbino",
      "created": 1616377616,
      "upvotes": 12,
      "replies": {}
    },
    "grrl2p8": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrl2p8/",
      "text": "This is an excellent point, while I'm very sorry you post so much, Google Drive file stream is an excellent way to sync your data, i used it after I lost my first 2 years of data. There are probably other solutions, too, like dropbox, I suppose you will have to trust cloud data compromise in the case of hacks and whatnot, but hopefully academic research is obscure enough to not be the target of a hack",
      "author": "incompressible_flows",
      "created": 1616377306,
      "upvotes": 6,
      "replies": {
        "grrlgnm": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrlgnm/",
          "text": "My university uses OneDrive and also provides us free extended GoogleDrive. it’s just that it wasn’t discovered til Friday that after three years my CrashPlan wasn’t backing up my computer and also my OneDrive was not syncing any of my data 🙃",
          "author": "Idontevenknow5555",
          "created": 1616377502,
          "upvotes": 10,
          "replies": {
            "grrlnrc": {
              "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrlnrc/",
              "text": "🥲🥲🥲 So sorry, i really hope you find a solution, I'm rooting for you!",
              "author": "incompressible_flows",
              "created": 1616377600,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "grrityh": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrityh/",
      "text": "This happened to me with an external HD... the one time I forgot to eject the drive properly (and also from an older computer). Over 3 years of PHD research corrupted. Sent it to a data recovery service who was able to recover almost everything (with the exception of some image files I think).. I had everything I really needed. Cost somewhere between $1500 and $1800... which was either at or around my monthly income as a grad student at the time. Still worth every penny. I'm so sorry this happened to you. I hope you can find a way to recover the work. Best of luck internet friend",
      "author": "ivorybiscuit",
      "created": 1616376159,
      "upvotes": 16,
      "replies": {
        "grrolwl": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrolwl/",
          "text": "that expensive? damn! i'd pay it too though if i had to haha",
          "author": "cascaderade",
          "created": 1616379147,
          "upvotes": 5,
          "replies": {
            "grs6qtf": {
              "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grs6qtf/",
              "text": "make IT pay...",
              "author": "fintechmatcha",
              "created": 1616391144,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "grszyys": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grszyys/",
          "text": "No one should be paying for data recovery themselves. The department or the would-be corresponding author on the contained research should pay for it out of official money.\n\n(I mean, if I had to then I agree it's worth it, but I can't imagine that being necessary even somewhere like the USA)",
          "author": "i8i0",
          "created": 1616417262,
          "upvotes": 3,
          "replies": {
            "grt2pcr": {
              "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grt2pcr/",
              "text": "OP shouldn't have to pay for recovery, for sure.  That was IT messing up royally. My advisor (i.e. corresponding author on the research) was not one to pay for anything \"extra\" especially if the blame for anything related to it could be placed on the student. They were not one to take or even share responsibility for things. So, in my case, I could have had it backed up to the cloud on Google drive and Dropbox as well but those locations were both a year or two behind, and I was sponsible for uploading stuff to those locations.  OPs situation is different, and having some IT part time intern wipe your data to me means that IT should pay for recovery by a third party service.",
              "author": "ivorybiscuit",
              "created": 1616418845,
              "upvotes": 2,
              "replies": {
                "grt2s7i": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grt2s7i/",
                  "text": "ETA I was in the USA for grad school. Some advisors are not understanding of mistakes.",
                  "author": "ivorybiscuit",
                  "created": 1616418887,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "grrikyj": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrikyj/",
      "text": "oh god, my heart sank for you. that’s terrible >.< i’m so sorry",
      "author": "vanillaladiee",
      "created": 1616376032,
      "upvotes": 2,
      "replies": {}
    },
    "grrfwk1": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrfwk1/",
      "text": "Fuuuuuck. I am so sorry. Paying $10 a month for dropbox was so worth it in grad school. It saved me many times after crashes/spills. And I trust it more than some IT department.",
      "author": "baller_unicorn",
      "created": 1616374679,
      "upvotes": 49,
      "replies": {
        "grrgau3": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrgau3/",
          "text": "I was stupid to never backup the computer personally and also never question what the computer was backing up.",
          "author": "Idontevenknow5555",
          "created": 1616374873,
          "upvotes": 19,
          "replies": {
            "grsp0hi": {
              "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsp0hi/",
              "text": "Honestly: If you are being told by the IT department that regular backups are indeed made, I wouldn't baseline mistrust these people to be unable to do their jobs, either.",
              "author": "EL___POLLO___DiABLO",
              "created": 1616409120,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "grsayat": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsayat/",
          "text": "I use the faculty's free owncloud service to store all my research data. It automatically syncs when I work on it, so I always have a current backup. And it's hosted by university servers, so ethically safe.",
          "author": "WeirdLime",
          "created": 1616394964,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grrcqa7": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrcqa7/",
      "text": "You already found out that your IT departments are idiots, dont listen to them and dont hand over your laptops again. Even if they wiped and formatted your pc, depending on how they did it there might be a chance for a data recovery expert to get it back! You can talk to them an e.g. send in the laptop if they think there is a chance to recover the data.",
      "author": "j0n_",
      "created": 1616373113,
      "upvotes": 133,
      "replies": {
        "grrectj": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrectj/",
          "text": "I agree. Don't bring the computer back to their IT department.\n\nSeek a data recovery service and pay what it costs to recover the data.",
          "author": "marioo1182",
          "created": 1616373923,
          "upvotes": 64,
          "replies": {
            "grrfheo": {
              "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrfheo/",
              "text": "Computer is university property so our IT department is the only people allowed to look at it.",
              "author": "Idontevenknow5555",
              "created": 1616374480,
              "upvotes": 43,
              "replies": {
                "grrgyw2": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrgyw2/",
                  "text": "Tell your IT how important the files are, and their negligence is impacting your education. Demand that if they cannot access the data with their backup, that you need a data recovery service. Do not be complaisant with their carelessness. \n\nAt a minimum, they should be willing to co-ordinate with you to seek data recovery.\n\n/edit Also stop using that computer immediately if you are thinking about data recovery. As you use it there is a probability that it could write to hard drive space containing your data.",
                  "author": "marioo1182",
                  "created": 1616375211,
                  "upvotes": 89,
                  "replies": {}
                },
                "grsa31i": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsa31i/",
                  "text": "Honestly. If the data is THAT important, which it clearly sounds like, then immediately go over the IT departments head and speak with either the director of the IT department AND (AAANNNDDD) the head of your department/lab.\n\nFight for this because, at the end of the day, you’re the only one that’s going to get screwed if it’s truly gone.\n\nTips...\n\nA) write down the situation, like you did here, but much more robust. This will help to consolidate your thoughts and make your discussion with the Heads more persuasive (this is doubly important if you’re emotionally frazzled b/c that will impact your thinking during the discussion).\n\nB) clearly state the reasons why the IT department shouldn’t deal with it (e.g. their clearly demonstrated negligence so far). This, combined with (A) is why you should have *profession* services look at it.\n\nC) the IT head will, almost assuredly, not allow you to take the computer to professional services, so what we’ve done is clearly demonstrated liability on IT for your personal loss. If this is a clear mistake on their part and it directly impacts your graduation, time in grad school, potential damages to your research progress / reputation, then this is a very clear case for a lawsuit (or, at least, compensation by the university for personal damages). This will allow you to basically hold them accountable because now they have had the argument for professional services presented, the reasoning for not doing it in-house, and the potential personal impact explicitly stated. That means that if they screw it up in-house, it was a conscious choice that led to it; ergo, they are now at fault for damages to you. Whether this goes anywhere or not is unknown, but it’s definitely a good setup for getting everyone to take it seriously and try their best to get your data back.\n\nI’m really not kidding. 3 years of data going away due to someone else’s negligence against written protocol and impacting your degree, job prospects, research reputation, etc. is the entire reason why lawsuits exist and is what defines personal damages.\n\nIdk what kind of person you are, but this isn’t a small thing, so, seriously, fight for it.\n\nYou got it bro!\n\nGood luck!!!",
                  "author": "idcydwlsnsmplmnds",
                  "created": 1616394141,
                  "upvotes": 37,
                  "replies": {}
                },
                "grrg7zj": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrg7zj/",
                  "text": "Your choice but they acted quite careless already, they will do more damage than good. If you send it to a recovery service that wilö not be traceble afterwards so  if i were you, i would just go that route, even though University might disagree...",
                  "author": "j0n_",
                  "created": 1616374833,
                  "upvotes": 34,
                  "replies": {
                    "grs9lyf": {
                      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grs9lyf/",
                      "text": "I agree you should just send it, your whole degree is at stake",
                      "author": "Useful_Bread_4496",
                      "created": 1616393702,
                      "upvotes": 15,
                      "replies": {}
                    }
                  }
                },
                "grsqvw1": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsqvw1/",
                  "text": "So what? If I were you, I’d still take it to a third party because your school’s IT screwed you.",
                  "author": "Crusader63",
                  "created": 1616410781,
                  "upvotes": 3,
                  "replies": {}
                },
                "grszhjw": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grszhjw/",
                  "text": "For any computer I've owned since 2016, a data recovery service would require the firmware password to the laptop to get at the harddrive. This is certainly the case if it's Apple. If the university owns the computer, I cannot imagine they would share that password with the user. \n\nDo not just send the computer without figuring this out first.",
                  "author": "i8i0",
                  "created": 1616416964,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "grsz1bc": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsz1bc/",
          "text": "University IT departments are always full of idiots. 4 universities and I've never had one fix my problem and they always make it worse. I try to avoid them as much as possible now.",
          "author": "Average650",
          "created": 1616416682,
          "upvotes": 6,
          "replies": {}
        },
        "grsowcz": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsowcz/",
          "text": "I recently accidentally deleted the partition on my computer which held a lot of data, and my major takeaway from the process was: As long as you don't actively overwrite the data on the drive, you don't loose any data at all. Worst case: You loose the file structure.\n\nI was able to restore everything. Bring your laptop to a professional data recovery service.",
          "author": "EL___POLLO___DiABLO",
          "created": 1616409014,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grrcm9m": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrcm9m/",
      "text": "You should seek a data recovery service. It will cost you some money, but very likely they will be able to get your files back for you.",
      "author": "marioo1182",
      "created": 1616373058,
      "upvotes": 62,
      "replies": {
        "grrgx68": {
          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrgx68/",
          "text": "How does it work for SSDs?",
          "author": "pssiraj",
          "created": 1616375187,
          "upvotes": 15,
          "replies": {
            "grs9ogl": {
              "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grs9ogl/",
              "text": "Same as other drives. All modern filesystems use journaling, which means they keep an index of files and their location on disk at the front. This way they can quickly access them without scanning the drive looking for them all the time. When a file is deleted, all that happens is the entry in the index is removed, to indicate that it's unused space that can be written over. But if you haven't written over it, the actual data is still on the disk and can be recovered. So if you ever accidentally deleted something you really need back, pull the power cord -- don't go though the shutdown process, actually just yank the power cord from the wall to immediately kill the system and give you the best chance at data recovery. The operating system is constantly making small writes for logs and other stuff, so if you shutdown normally or just leave it running, the chances of recovery go down. Therefore, yank the power cable, and bring the disk to a data recovery service.",
              "author": "exmachinalibertas",
              "created": 1616393768,
              "upvotes": 5,
              "replies": {
                "grsb7u4": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsb7u4/",
                  "text": "Good to know, thank you. In regard to your other comment, is that cache part of why write amplification and flash wear was such a big deal maybe 10 years ago with some SSDs?",
                  "author": "pssiraj",
                  "created": 1616395223,
                  "upvotes": 1,
                  "replies": {
                    "grsbt5m": {
                      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsbt5m/",
                      "text": "I don't know honestly. I really haven't looked into them that much. That said, I'm reasonably sure the methods for creating flash memory for SSDs were just way worse a decade ago and that's the primary reason for more recent improvements. I don't think there's just massively more caching going on. (Although, like I said, I actually don't know for sure...)\n\nSo, to answer your question, I have no idea.",
                      "author": "exmachinalibertas",
                      "created": 1616395803,
                      "upvotes": 1,
                      "replies": {
                        "grsc2ip": {
                          "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsc2ip/",
                          "text": "I think the approach to SSD controllers might have been worse, since we'd been making flash memory for a good while before SSDs came along.",
                          "author": "pssiraj",
                          "created": 1616396059,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "grrh65o": {
              "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrh65o/",
              "text": "I am not an expert, but they can still recover it. Usually involves rebuilding sectors of the drive somehow, or reading the memory chips on the ssd directly bypassing the sata interface.",
              "author": "marioo1182",
              "created": 1616375314,
              "upvotes": 12,
              "replies": {
                "grrh9hj": {
                  "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grrh9hj/",
                  "text": "Oh okay. So harder but possible.",
                  "author": "pssiraj",
                  "created": 1616375359,
                  "upvotes": 3,
                  "replies": {
                    "grsa9uk": {
                      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grsa9uk/",
                      "text": "Yeah ssd's actually lie to your computer about how much space they have and where things are located. They say they have for example 100G of space, but they actually have say 101G and an onboard controller that maps the incoming data address to the actual physical location. That extra G copies frequently accessed data so that if the main sector holding it dies or wears out, it can use the copy. This allows the disk to appear to last longer than it actually physically is, because the computer knows nothing about this. It's actual firmware in the disk itself doing this. So ssd's can be more of a pain to recover data from.",
                      "author": "exmachinalibertas",
                      "created": 1616394315,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "grris01": {
                      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grris01/",
                      "text": "Exactly",
                      "author": "marioo1182",
                      "created": 1616376132,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "grr5xoj": {
      "link": "/r/GradSchool/comments/ma8tmb/gentle_reminder_to_make_sure_you_have_a_backup_of/grr5xoj/",
      "text": "Oh my god im so sorry :( this happened to me with a big paper in undergrad but nowhere near 3 years worth of hard work. i can't imagine how you feel. sending you strength.... and thanks for the reminder, will set reminders on my phone to do regular back ups and checks. ❤️",
      "author": "WarningAfraid1274",
      "created": 1616369583,
      "upvotes": 6,
      "replies": {}
    }
  },
  "updated": 1634065748
}