{"sid": "cijpy5", "link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/", "title:": "I can't put into words how thankful I am for my advisor.", "text": "My mom was diagnosed with brain cancer just last week. She was given a month. I'm in my 4th year of a PhD program 800 miles away (home now). My advisor said to take off whatever time I need, no matter how many months, and he will continue to pay my stipend and tuition so I don't need to worry about it. Because of him, I'm able to take care of my mom in hospice at home, and spend her last few weeks with her. I wish I could put into words what this means to me, but the words just fall short...", "author": "DishsoapOnASponge", "created": 1564245776, "retrieved": 1632845323, "over_18": false, "upvotes": 557, "upvote_ratio": 0.99, "comments": {"ev950vd": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev950vd/", "text": "I had a very similar experience with my dad back in April, when he was approaching his last days (GBM). My PI and program were so supportive, and I'm glad you are having a similar experience ❤️. I'm finishing up my 5th year, and it is a really hard time to lose a family member to terminal illness with grad school on top -- but you are strong, and you will make it! Please reach out if you ever want to talk.", "author": "AnZenAnge", "created": 1564306458, "upvotes": 1}, "ev8w78u": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev8w78u/", "text": "I was in a similar situation-- unfortunately, my mom just passed away today.  \nTaking many months off to take care of her this past year was something my advisor supported, never questioning when I needed to extend my time away for many months or rushing to fly back on a day's notice.\n\nWe are truly blessed to have advisors who know that a graduate students aren't just tools, but humans with deep emotional needs.\n\nI wish you and your mother the best-- being there for her will definitely help her emotionally and even physically. Stay strong during these days and fill her last days with happy memories. Feel free to message me if you need someone to talk to.", "author": "jjjjjelly", "created": 1564294052, "upvotes": 2}, "ev8uuno": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev8uuno/", "text": "I'm so sorry.\n\nSupport sometimes needs to be in forms other than words; your advisor is acting in a way that you need. I'm so glad you're getting support in this way!", "author": "gobucks314", "created": 1564292446, "upvotes": 1}, "ev8tird": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev8tird/", "text": "bless your mom. your advisor is amazing. best of luck.", "author": "clippy300", "created": 1564290974, "upvotes": 2}, "ev8o8y5": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev8o8y5/", "text": "I'm so sorry to hear that. My mom passed away from breast cancer during my masters so I understand how it is. Your advisor is amazing, I'm so glad you have the support. If you need someone to talk to please feel free to message me.", "author": "BlueManatee21", "created": 1564285738, "upvotes": 2}, "ev8ijyx": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev8ijyx/", "text": "Take care of your mom. Family comes first.", "author": "theAlChemist233", "created": 1564280647, "upvotes": 3}, "ev889l5": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev889l5/", "text": "I just went through a very similar situation myself (2nd year PhD student in NZ), my dad was diagnosed with brain cancer at the end of May and passed two weeks ago. There's no way to express the gratitude for my supervisors letting me immediately drop everything and move back to the other side of the country where my parents live. Best of luck to you both, there's a tough road ahead, but I hope you can cherish every moment with your mom.", "author": "saxxandviolins", "created": 1564272038, "upvotes": 19}, "ev7l9o3": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev7l9o3/", "text": "Dealing with health issues is no joke. I'm really sorry to hear about your mom and hope you can take time to practice selfcare while you're going through this. You're advisor sounds like a good person.", "author": "theCovertoit", "created": 1564261140, "upvotes": 7}, "ev72jxu": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev72jxu/", "text": "That's really awesome of your advisor, and of you. Good luck with everything, truly.", "author": "ForrestGnump", "created": 1564254429, "upvotes": 15}, "ev71lwd": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev71lwd/", "text": "This is great! I’m really happy to hear that your advisor is so supportive. \n\nI do have to ask the other commenters: are you sure OP is female?", "author": "doubleb13", "created": 1564254074, "upvotes": 25}, "ev6w8w9": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev6w8w9/", "text": "That is definitely an amazing gesture and shows he has a lot of compassion.  And like was said, you're definitely an amazing daughter.  Take care of your mother and yourself.  Good vibes your way!", "author": "kreuzensolo", "created": 1564252146, "upvotes": 56}, "ev6jhll": {"link": "/r/GradSchool/comments/cijpy5/i_cant_put_into_words_how_thankful_i_am_for_my/ev6jhll/", "text": "You have a great advisor, but you're an **amazing** daughter. (((hugs)))", "author": "FeminineEnergy01", "created": 1564247492, "upvotes": 194}}}