{"sid": "pvdyjv", "link": "/r/GradSchool/comments/pvdyjv/nsfgrfp_questions/", "title:": "NSF-GRFP Question(s)", "text": "For those familiar with the NSF-GRFP system:\n\n1. I double-majored in college (chemistry and biochemistry). Do I need to input two academic institutions to list my two majors?  \n\n2. Each \"Field of Study\" in the drop-down menu has a specific area (Chemical Synthesis, AI, Environmental Chem)...but I just earned a general B.S in chemistry and general B.S. in biochemistry. Does this matter?  \n\n3. I just started graduate school (Aug 2021), but the \"current institution\" menu asks for a GPA...which I won't have until December. The application requires a GPA, so what should I put?\n\nAny and all help would be *greatly* appreciated. Thanks!", "author": "chem_swimguy", "created": 1632598722, "retrieved": 1632952038, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"heedeku": {"link": "/r/GradSchool/comments/pvdyjv/nsfgrfp_questions/heedeku/", "text": "I really appreciate the responses! Regarding the decision to apply as a G1 or G2:  My PI and I talked about this. Most first year grad students don't choose a lab until October/November, but I already know which lab I'll be joining. My PI has a project that she wants me to write about, and will read through/edit as needed. So, I'll certainly have the support I need to write a compelling proposal, and a strong letter from her (in addition to folks from undergrad/internships).\n\nThanks again to anyone who contributed. I realize the GRFP is a bit of a crapshoot to begin with, but I think my undergrad background and experience in proposal writing (Goldwater scholar) makes me highly-competitive as a G1 student.", "author": "chem_swimguy", "created": 1632692776, "upvotes": 2}, "heak671": {"link": "/r/GradSchool/comments/pvdyjv/nsfgrfp_questions/heak671/", "text": "1. I'm not sure, because I didn't double-major, but you could choose \"Other\" under Chemistry to list both and indicate in parentheses that this was a double major. \n2. You need to list the area of your grad program and intended work for your Field of Study. \n3. You may list 4.0---This is what my program director told me to do, and I got funded so clearly no one was outraged over this.", "author": "aggressive-teaspoon", "created": 1632620466, "upvotes": 1}, "he9p8bo": {"link": "/r/GradSchool/comments/pvdyjv/nsfgrfp_questions/he9p8bo/", "text": "Hello. I was awarded the GRFP in 2019 in CS. To answer your questions:\n\n1. You don't have to explicitly list your double major. Just put your most relevant major and mention both in your statements.\n2. The GRFP is such a large program that they require us to identify our proposals with a specific sub-field within our larger field. This is mostly so your proposal is read by experts in your sub-field. You should choose the sub-field that most aligns with your proposal. \n3. Not sure what to do about the GPA. You may want to email your school's grad school grant/fellowship office or the NSF GRFP program itself. \n\nMy unsolicited advice follows /u/h8a who also commented. You may want to wait a year to submit your proposal. In the old days, you could apply to the GRFP twice in grad school, but now you can only apply once. Waiting a year will give you more time to craft a research agenda that you can distill into a proposal. If you think you have a solid idea for a proposal now, make sure you ask your advisor to review it. The proposal is ultimately your work, but a review from your advisor will certainly help.", "author": "005c", "created": 1632605647, "upvotes": 2}, "he9cgje": {"link": "/r/GradSchool/comments/pvdyjv/nsfgrfp_questions/he9cgje/", "text": "As unsolicited advice (feel free to ignore), you may want to look into waiting a year to apply (I believe this is possible, but you should double check the eligibility on your own). You're only able to apply once during grad school, so the additional year will give you a chance to established as a grad student. Specifically, you'll likely be able to get better letters from faculty at your own institution and write a more focused/relevant research statement.\n\nAs for the questions:\n\n1. I just put my \"main\"/\"most relevant\" one. Your transcript will show the other.\n2. I'm pretty sure the field of study is for your grad school studies. See the [program solicitation](https://www.nsf.gov/pubs/2020/nsf20587/nsf20587.htm) for details\n3. can you put X or something? Otherwise I'd just put 0. The reviewers will understand that is not your actual GPA.", "author": "h8a", "created": 1632599882, "upvotes": 8}}}