{"sid": "f6yxb8", "link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/", "title:": "I just got accepted into a Master's program for chemistry!!!", "text": "Hi all! I just found out this week I was accepted into a Master's program for Chemistry along with an assistantship (TA)!!! I can't even begin to describe how happy I am. Its truly a dream come true. The person I spoke to said it's very easy to transition into the PhD program after a year, so I'm hoping for that. Anyways, I'm looking for advice on how to prepare. What should I brush up on? What are somethings I should master before I start grad school? Any and all advice is welcomed. I don't want to fuck this up.", "author": "lilblep", "created": 1582229585, "retrieved": 1632845997, "over_18": false, "upvotes": 324, "upvote_ratio": 0.95, "comments": {"fi946cn": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi946cn/", "text": "Congrats!", "author": null, "created": 1582255148, "upvotes": 2}, "fi8o8fm": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8o8fm/", "text": "Time to renew the acceptance megathread", "author": "Mikazukinoyaiba", "created": 1582244618, "upvotes": 5}, "fi8kumx": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8kumx/", "text": "Congrats! Make sure you get a good planner/calendar. I'm doing my Chem PhD (four years in), and the hardest part my first two years was just time management. It's tough to TA and take classes and do research. I'd try to get a good routine down and make sure to schedule in some down time. Being highly scheduled keeps me productive!", "author": "ItsJOVANI", "created": 1582242526, "upvotes": 3}, "fi8jxyp": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8jxyp/", "text": "Woohoo! I'm in a chemistry PhD program, but just starting so no advice beyond read your mentors research. It's what you'll be doing after all. Congrats!", "author": "rockymtnluke", "created": 1582241962, "upvotes": 5}, "fi8ids5": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8ids5/", "text": "Congratulations! This is an achievement work being proud of. From my experience, the transition isn't difficult, especially if you have done undergraduate research. As far as preparation, I would try to work out logistical things (housing, getting to/from lab) as early as possible so that you don't have to worry about while taking classes, teaching, etc.\n\nAdditionally, if you aren't an organized person or used to following a routine, start working on that. Time is a crucial resource in graduate school and managing it well sets you up to be successful. Make sure you schedule time for hobbies and activities outside of grad school so that you can recharge your batteries.\n\nStart reading primary literature. Try to keep up to date on the things happening in your field and that are related to your research. I usually schedule about an hour everyday to reading a paper or two. As you become more practiced, you'll pick up the pace and be able to get the  main idea of a paper by skimming through it.\n\nFinally (and this one might sound odd at first), start looking at job ads. Your goal at the end of graduate school is to get a job, and while there is plenty of time before you start applying, knowing what companies and/or universities are looking for can inform some of the decisions that you make during grad school. For example, if most of the postings that interest you emphasis knowing how to use a certain piece of equipment, try to gain familiarity with that piece of equipment.", "author": "kiwijohn340", "created": 1582241014, "upvotes": 4}, "fi8i5rg": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8i5rg/", "text": "I have a masters in chem. I'd highly suggest you put a lot of thought into what you want to specialize in, as chemistry kind of has a bad job market for non-PhDs, as I know all too well (it's location dependant, though). Chemical engineers, material scientists, and people who work in medicine/pharma seem to be doing well. Analytical chem, physical chemists, and synthethists seem to be having a rough time.", "author": "iammaxhailme", "created": 1582240880, "upvotes": 13}, "fi8gb38": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8gb38/", "text": "That's amazing!! Congrats!!! I second another comment's advice, read your mentor's publications. Also with TAing, my advice is to be as strict as you need to be from day one. Are you teaching a lab? Do the students need to adhere to a specific dress code? You are now the safety czar. Because if you don't, you may get in trouble. \n\nIt's much more difficult to start out too timid and need to become strict part way though (learned from experience).", "author": "Everybodyslonely", "created": 1582239780, "upvotes": 10}, "fi8e5lq": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8e5lq/", "text": "CONGRATULATIONS!! I can't offer advice specific to chem (I'm in Religious Studies) but in general try to develop good study habits now. Take this time to get yourself into the habit of reading, writing, and planning your work schedule regularly. Having a plan for when I'm going to do my reading, writing, etc. and how each step ladders up to a larger goal within the program has saved me from so much unnecessary stress. Good luck!!", "author": "nacho_fries", "created": 1582238561, "upvotes": 2}, "fi8bghi": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi8bghi/", "text": "No advices but congratulations! Good luck!", "author": "Rrlgs", "created": 1582237036, "upvotes": 3}, "fi83gci": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi83gci/", "text": "Whats the program?", "author": null, "created": 1582232728, "upvotes": 3}, "fi82p1v": {"link": "/r/GradSchool/comments/f6yxb8/i_just_got_accepted_into_a_masters_program_for/fi82p1v/", "text": "Find all of your mentor’s publications and read them. Even if they’re not you’re specific interest, it’ll give you some background on one of the more important people in your life. It’ll also help you figure out what you can do while working in their lab.\n\nA masters isn’t as self crafted as a PhD. It’s normal to do projects as they’re assigned to you. Don’t feel like you have to make your mark at this stage. Even PhD’s aren’t autonomous in that respect.", "author": "Topopotomopolot", "created": 1582232321, "upvotes": 40}}}