{"sid": "pxwu3a", "link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/", "title:": "What is your benchmark for quitting?", "text": "I wanted to get some ideas since I've seen a lot of posts about quitting or not enjoying graduate school. At what point is it not worth it to you to continue?\n\nFrom my perspective, I'm just about to enter my third month of graduate school and my mental and physical health are not doing very well; I already had underlying issues and now they've been brought to the fore. I'm curious, what sort of things would cause you to leave a program. Hospitalization? Nervous breakdown?\n\nUpdate: Currently sitting in the ER, didn't trust myself to just sit in my room with some of the stuff I have in there. Not making any decisions about my program, just trying to get through today and tomorrow.", "author": "rowantreewitch", "created": 1632926635, "retrieved": 1632951814, "over_18": false, "upvotes": 28, "upvote_ratio": 0.93, "comments": {"herpn98": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/herpn98/", "text": "I just started my 4th year and I am in the process of requesting leave of absence and considering not coming back from that. The best advice I have gotten: \"your mental health comes first\". Maybe leaving is not the \"right\" decision for my career. Maybe at a different point in my life it would be a perfect position. But for months it has been making me unhappy and I feel like I'm finally putting myself first.", "author": "froglandloveman", "created": 1632948565, "upvotes": 1}, "herp255": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/herp255/", "text": "My mental health tanked in my third year after advancing to candidacy.  At some point during the summer between second and third year, communication broke down between my PI and I spiraled into a depressive episode that lasted until the following spring. During that time, I had been working on a project while completely misunderstanding some of the fundamental ideas.  I figured it out while we were addressing reviewer comments, causing my PI to flip out. She ended up trying to convince me I wasn’t passionate about the field and force me out of the program entirely, but some part of me knew that she was wrong. So, I went on compassionate leave to 1) get my shit together and 2) take any decisions about my future out of her hands. I came back nine months later, mastered out of her group, and joined a new one where I’ve been thriving. I’m on track to defend comfortably within the next three years, probably within two.", "author": "ErwinHeisenberg", "created": 1632948328, "upvotes": 1}, "heqyel2": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/heqyel2/", "text": "I quit after four weeks because I felt that I was bait and switched by my department. I also have underlying health issues and they were exacerbated by the stress. I know that grad school is harder than undergrad but this program in particular offered quite literally zero support- when I asked my advisor for additional resources such as tutoring she said they had none. At that point I was over working on my PART TIME program for 40+ hours when I WORK FULL TIME. I said fuck this noise… and it was the best choice I could have made for myself. Other individuals felt the same but decided to tough it out, I’ve kept in contact with them and they regret their choice.", "author": "Mysterious_Donut_750", "created": 1632937434, "upvotes": 1}, "heqk6e3": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/heqk6e3/", "text": "Well I'm very close to finishing the phd now (after way too many years), so virtually nothing would make me quit at this point.  But if I had realized a few things back around year 2-4, I would've quit 100%.  \n\n&#x200B;\n\nThe big thing I think that's become obvious is just that, if you don't like it in year 1.5+, you're not randomly going to like it in year 3, or 4, or whenever.  In fact, I've found the opposite to be true - it gets more difficult as time goes on, which can make the enjoyment tank even worse.  \n\n&#x200B;\n\nSome people find that they start to enjoy the research more as they understand more, but honestly, I'm skeptical that this is the case for most grad students.  In my opinion, if you're really miserable early on in a phd, you should get out ASAP, because it's going to get a hundred times harder to justify quitting the longer you're there.", "author": "nctweg", "created": 1632931738, "upvotes": 6}, "heqjbxo": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/heqjbxo/", "text": "I'm sorry you're experiencing this. Mental health stuff is rough even before you add in the stress of grad school.\n\n\nEveryone is different, so my answer may not be yours. I expected my mental health to get worse, and it *definitely* has lol. So I'm left with several questions for myself. Can ongoing treatment keep me *safe?* Do I have support here? Will I see improvement once I get over the bump of that first semester? Am I still in touch -- or if not, can I get *back* in touch -- with what I'm doing here, and how this gets me to that goal? \n\n\nI've been thinking on that a lot, since my mental health is pretty bad and we had someone drop my program. There's a level of \"this is awful\" I can tolerate if the environment is one where I can work through those feelings. If it becomes isolated, toxic, or it's clearly not going to get better, it's time to talk it through with a therapist and someone in my program, separately.", "author": "torgoboi", "created": 1632931394, "upvotes": 1}, "heqgl18": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/heqgl18/", "text": "For me, the breaking point was: 0 support = suffocating suffering. \n\nAn email of “how’s it going?” every four months or so from a now-retired-from-the-University dissertation chair, & nothing else, became totally insufficient. I know the process is isolating, hard, taxing, *meant* to be a challenge, yet I have come to realize also that anything *meant* to be a challenge is made challenging in ways that hamper progress, & for reasons that defy logic. As an educator, I try so hard, (which lately, given that I just withdrew from my PhD program, admittedly isn’t working all that well) to support my students as a means of supporting the work they need to do to succeed in the course. I have not experienced this as a student at the graduate level. As an educator, I use community as a course theme, as a means of introducing students to its often undervalued importance, & to help ensure we’re fostering one in our class. There is no such effort at the graduate level. \n\nTo have support during challenging times, when engaging difficult tasks, often equates to taking some of the weight off of those working to confront challenges. To intentionally withhold support, or act in ways that suggest someone has failed to realize it’s needed, is to make the weight carried that much heavier. Eventually, I just started suffocating under the weight of it all. Since no one on my committee, in my department, in my college, in official roles at the university, had done anything to suggest there was an importance in the project, I came to accept that finishing it wasn’t important after all. \n\nAnother thing that helped me finally confront this issue was asking myself to honestly answer some questions, such as: Considering my own observations & experiences of higher levels of higher education, did I really need or want to become part of that? If I can teach with a masters degree, & since I don’t want to ever risk replicating the shit-show I had to trudge through for *years*, must I keep suffering through this? Do I really have to suffer, just to be? The answer on all counts is no.", "author": "Mists_of_Analysis", "created": 1632930308, "upvotes": 9}, "heqekff": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/heqekff/", "text": "I asked myself this question a little while ago, and it came down to a few things. For reference, I'm mastering out of a PhD program in my 3rd year. \n\nFor one, I also had underlying health and mental health issues that got exacerbated by the stress of my program. It got pretty bad, and I did get to a point where I was pushing through, hanging by a thread, and then having a breakdown at the end of every other Zoom meeting. That was when I took a medical leave of absence (best decision ever) to focus on mental and physical health, and it made me realize my life is not worth this degree. I didn't love my work, and my goals changed. I no longer wanted to work in academia, so the PhD wouldn't have been a means to an end. I couldn't justify subjecting myself to the struggle again and saying \"it'll get better in a few years\" because I knew it wouldn't be for anything concrete at the end. So do you absolutely need this degree to pursue what you want? Is there a way to return if you decide to leave now? \n\nI don't mean to influence your decision in any way. It's just a lot of big questions to ask yourself, and I recommend speaking to a therapist if you can. I hope you figure out what's best for you in your program!", "author": "cat_astrophical_ly", "created": 1632929498, "upvotes": 10}, "heqe1r6": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/heqe1r6/", "text": "I really relate to this post, I'm trying to decide if I should stick with my MSc or drop out now (a year in) to cut my losses. My physical and mental health have never been worse than now, but everyone is telling me that I should stick it out because it will be worth it in the end", "author": "keh2143", "created": 1632929289, "upvotes": 3}, "heqbelj": {"link": "/r/GradSchool/comments/pxwu3a/what_is_your_benchmark_for_quitting/heqbelj/", "text": "I quit this summer after 4 years in a MS program (yes, you read that right). It was years of being strung along without the ability to complete my project, lack of direction and guidance, then a pandemic. I finally realized that I didn't even know how this would benefit me in the future as I no longer wanted to stay in that field. I was tired of feeling like I was accomplishing nothing while being anxious and stressed about school all the time. I had constant stomach problems. It was the best decision for my mental and physical health to leave. You should consider what your long-term goals are and the conditions you are currently in. Do the ends justify the means? Is this really what you want long-term? Where do you see this degree taking you? I think if you are already struggling to justify it, it's best to get out.", "author": "LowerAuthor", "created": 1632928206, "upvotes": 20}}}