{"sid": "php6e3", "link": "/r/GradSchool/comments/php6e3/love_the_research_hate_the_program_advice/", "title:": "Love the research, hate the program. Advice?", "text": "Hi All,\n\nSorry for the long post, but I am really looking for some advice. I graduated my bachelor's in 2020 and was planning to take a year off to travel (which turned into covid), but after last minute funding, I had the opportunity to start graduate school in the fall. I have done research since high school and I always knew I wanted to get my PhD, so I thought why not start now. Because of this last minute funding, I had 2 weeks to find a school; however, I am pretty easy going with change, I liked the PI, and loved school, so I thought why the hell not.\n\n8 months into the program (+4 courses later, an entire proposal written, and 1 of 3 years of funding used up), my PI tells me they have no funding for my research and that it is my problem to figure out (even though they suggest a pricey -omics project). After calling old mentors for advice, they suggested I move to a different lab (in a different program) which was the best thing to happen to me. By this point though, I was really burnt out. The courses were not nearly as good as my undergraduate education, everything was online, my PI was telling other PIs I left their lab because I was \"stressed\", and the department told me it would be my fault if the funding was lost due to my move to a different program. Even though it had been my dream for years, I seriously considered dropping out of graduate school.\n\nAnyway, after switching labs and doing research all summer, I really fell back in love with science. My PI is a much better match for me and the topics suit my strengths much more. The downside of this move is I have to start from the beginning and the pre-reqs are completely different from the previous program. There is no flexibility and none of the courses are relevant to our labs work at all. Additionally, it cuts into my time to work in the lab. (I work with time sensitive animals, so I can only set up experiments on the weekends). The program's comprehensive exams are not focused on the student research, but of the broad field (again, not relevant to my work). I used to LOVE school, but now I am miserable. The courses are dry (even the students who study these subjects are suffering), the professors don't seem to care, and I am truly not interested in the material at all. I tried to go in with an open mind, but I think I am just warn out from the last year of hating my courses as well. I do not believe I can handle 4 more semesters of courses and this program.\n\nI am really really torn. I love my PI and my work so much, but the program is killing me. The thought of having to know this material well enough for an oral comprehensive exam is making me sick to my stomach. I dread class and I can't start anything meaningful until the weekends in the lab. If I masters out, I have to take the same courses, but at least I don't have to take the comprehensive exam. I don't think I can handle another transfer. \n\nFor those of you who pushed through a total of 6 semesters of shitty courses, how did you do it?  \n\nTl;dr I love my research, hate my program, and feel worn out by my graduate school experience.", "author": "wormpartybus", "created": 1630751708, "retrieved": 1632844796, "over_18": false, "upvotes": 6, "upvote_ratio": 0.88, "comments": {"hblaa51": {"link": "/r/GradSchool/comments/php6e3/love_the_research_hate_the_program_advice/hblaa51/", "text": "Omg I’m somewhat in the same boat. I’m supposed to have fieldwork this summer but it wasn’t approved because they weren’t satisfied with my deliverable. I can’t improve my deliverable as it’s the best it can get. I’m starting my last school year in a few days but I’m considering dropping out as I don’t know what would I put in my thesis, not having the fieldwork component. I hope you’ll able to decide what is best for you.", "author": "Daebak49", "created": 1630776758, "upvotes": 1}, "hbktmb8": {"link": "/r/GradSchool/comments/php6e3/love_the_research_hate_the_program_advice/hbktmb8/", "text": "god i feel the same, i actually really want to drop out and pursue library science after getting a part time job in a library but im in my second to last semester of my current program and it feels too late to quit. the thought of the comprehensive exams makes me want to throw up whenever i think about them.", "author": "ohbigboisad", "created": 1630769419, "upvotes": 2}}}