{
  "sid": "pp4933",
  "link": "/r/GradSchool/comments/pp4933/navigating_dating_another_phd_student/",
  "title:": "Navigating dating another PhD Student",
  "text": "I’m a first year PhD who wasn’t planning on finding a romantic partner before I began my degree but began seeing another PhD student at my institution right before the semester began. Life works is mysterious ways I guess. \n\nI really enjoy this person whoever it’s been challenging navigating the academics, teaching, research, and getting settled in a new environment all while trying to spend time with friends and each other. We’ve tried studying together on one or two occasions but ultimately that has become unsuccessful as we work for a bit and then get caught up talking. Given the amount of time we spend on academics / grading right now (both STEM) I would like to be able to do that together as it’s a huge chunk of my time. \n\n\nI really want to make this work and I’m worried as we start lab work next week that things are only going to get more busy. Does anyone have general advice on dating generally or other PhD students over the course of their degree? I’m aware this will be challenging but I’m willing to put in the work. I just want to make sure the time we are spending together is constructive and doesn’t take away from either of our academic successes.",
  "author": "nikkichew27",
  "created": 1631758230,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.8,
  "comments": {
    "hd1mgfq": {
      "link": "/r/GradSchool/comments/pp4933/navigating_dating_another_phd_student/hd1mgfq/",
      "text": "My advice is to not shit where you eat in the first place, but failing that, I agree with top comment.",
      "author": "ErwinHeisenberg",
      "created": 1631769064,
      "upvotes": 9,
      "replies": {
        "hdd4k0f": {
          "link": "/r/GradSchool/comments/pp4933/navigating_dating_another_phd_student/hdd4k0f/",
          "text": "I appreciate it. Luckily we’re at the same institution but in different programs so that’s not a concern of mine!",
          "author": "nikkichew27",
          "created": 1631991354,
          "upvotes": 2,
          "replies": {
            "hdd4n5w": {
              "link": "/r/GradSchool/comments/pp4933/navigating_dating_another_phd_student/hdd4n5w/",
              "text": "Good!",
              "author": "ErwinHeisenberg",
              "created": 1631991391,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hd14jyv": {
      "link": "/r/GradSchool/comments/pp4933/navigating_dating_another_phd_student/hd14jyv/",
      "text": "You’re newly dating.\n\nTime you spend together isn’t going to be productive.  Stop trying to force it- you’re just going to distract each other and have to work longer hours.\n\nWork while you work.  Hang out while you hang out.  Set clear times to see each other and stick with them, but realize they’re mostly going to be at night or weekends.\n\nThe rest of the time you work.",
      "author": "Weekly-Ad353",
      "created": 1631759018,
      "upvotes": 22,
      "replies": {
        "hd1brpk": {
          "link": "/r/GradSchool/comments/pp4933/navigating_dating_another_phd_student/hd1brpk/",
          "text": "As a grad student that just fucked a relationship with a dr in fellowship ^\n\n\nThis is it.\n\nThis is -all- you have to do\n\nGood luck OP",
          "author": "bitetheboxer",
          "created": 1631762661,
          "upvotes": 4,
          "replies": {}
        },
        "hdd4mxx": {
          "link": "/r/GradSchool/comments/pp4933/navigating_dating_another_phd_student/hdd4mxx/",
          "text": "Thank you - honestly I think this is the route I need to take. I appreciate the advice!!!",
          "author": "nikkichew27",
          "created": 1631991388,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066855
}