{
  "sid": "q9kozd",
  "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/",
  "title:": "I am starting to feel like too much is being asked of me as a TA",
  "text": " I don’t intent to complain, but I am writing this just to see if anyone has been in the same boat or understands the frustration I’ve been having. \n\nAs some background, I am in a MA program for Spanish lit and second language pedagogy (teaching). Everyone in my program works as a TA in the department, either as an individual instructor who teaches his or her own class MTWF or acts as an actual TA for a professor and teaches multiple sections once a week. These are the 100 level grammar courses. We submit lesson plans in advance once a week to have a few people look at it. First, the professor(s) for whom you teach if you do not have your own section or the program coordinator for that particular level if you do, and the Spanish TA observer, who oversees all the TAs. \n\nOur new TA observer just joined this year, and he wants to change the way we teach our lessons so that they can be more communicative. He is implementing a new rubric used to observe us that is different from the one that has been used in previous semesters. Sounds great in theory, I know. However, it is adding stress because I am already spreading myself thin with keeping a balance of TA instructor work and my actual classes that I take, on top of the added stress of taking a comprehension exam for pedagogy in a month. \n\nLet’s go back to my role as a TA. I teach once a week to 4 sections of 20-25 students. For only going in once a week, this is a lot of teaching to a lot of students. I don’t know them well, and it kills me because I just want to have their names memorized at this point in the semester (which honestly gets really stressful in class when I need to call on someone lol). Seeing so many once a week makes individualizing their learning experience very challenging. I teach two classes for two instructors each, one is a veteran and has been there for years and another is in her first year teaching after graduating my program (close to my age). Just to make a long story short, it is going to be very hard coordinating my lesson plans between what the TA observer wants and what my instructors want. The veteran instructor is very by-the-book and follows a more instruction based classroom with some interaction, and my observer wants me to plan a completely communicative, interaction-based lesson. He also wants us to reframe the book activities in a way that is student lead and interactive. This is all great stuff, except I have to make sure I get through all the material for the day and that my lessons still follow the syllabus. I am also teaching the entry level I-have-never-taken-Spanish-before course so to even get the students to do the activities in a communicative way, I will have to do a lot of modeling and explaining, which they want to be in Spanish and is not very realistic. Some of them also have very limited language abilities because of the level. Also, only seeing students once a week makes doing all of this even harder because we won't make the new type of instruction a daily habit, and sometimes it’s hard to get them to listen to me. I have had instructions presented on the board in English, and students have done something totally different. Also, teaching only once a week doesn’t give me much practice either with facilitating these types of lessons.\n\nI don’t wanna worry too much and just focus more on what my instructor wants, but the TA observer will be observing me at some point in the semester. Between what my observer wants, what my instructor wants, and making sure my students actually pay attention, I feel like I am being pulled in all sorts of directions and no one considers how hard it is to meet the demands of so many people. \n\nOn a final note, I would like to add that in one of the emails we have received about the changes in lesson planning and observation rubric, the final like read something like, “We intent to return to the original rubric in future semesters.” \n\nI’m so done lol",
  "author": "spanglish_",
  "created": 1634418627,
  "updated": 1634602063,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgwrsfr": {
      "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hgwrsfr/",
      "text": "What happens if you don’t do well according to the new rubric? Maybe you can mostly ignore the new instructions, since they conflict some with what the instructors want.",
      "author": "LadyOfNumbers",
      "created": 1634421112,
      "upvotes": 2,
      "replies": {
        "hgws4j0": {
          "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hgws4j0/",
          "text": "Yeah, it's not like I'll get fired or anything. That right now is kinda my plan. I just don't want a crappy report when I get observed.",
          "author": "spanglish_",
          "created": 1634421263,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgzppd9": {
      "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hgzppd9/",
      "text": "It sounds like this observer and your instructor need to be on the same page, and once they are then you can start to think about it. Whoever is in charge of the course should take the main responsibility in planning any changes. If this Spanish observer is not the instructor of record, then they really need to be getting permission from the course instructor first before introducing or even talking about introducing any changes to the class structure because it can be confusing. You shouldn't have to coordinate between this observer and the instructor at all. You should be told what the structure is for the course, how students are evaluated, etc from one single person rather than trying to act as a middleman. \n\nIt all sounds super confusing to me, and I would probably be as stressed and confused as you are if I had to deal with what sounds like a real mess and lack of coordination and clear communication. \n\nAlso, it's weird to me that they would be planning changes with the intent to completely disregard them in future semesters. If there are to be changes made to a course, it seems best to do so after the current semester ends and have those changes take place in the following semester. If you're confused, your poor students are probably even more confused.",
      "author": "False-Guess",
      "created": 1634483290,
      "upvotes": 5,
      "replies": {
        "hgzrdzu": {
          "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hgzrdzu/",
          "text": "Thanks. It will all be okay, I know. Right now just has been particularly stressful. I went to undergrad for Spanish education. There’s no way I suck.",
          "author": "spanglish_",
          "created": 1634484050,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgzpx4x": {
      "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hgzpx4x/",
      "text": "> I don’t know them well, and it kills me because I just want to have their names memorized at this point in the semester (which honestly gets really stressful in class when I need to call on someone lol).\n\nCheck both blackboard and your university grading/registration system. It may have a course roster with student photos.\n\nIf so, then look at it for a couple minutes before class to refresh your memory on student names. And you can keep it at the podium for reference.",
      "author": "raistlin65",
      "created": 1634483388,
      "upvotes": 2,
      "replies": {
        "hh60qm6": {
          "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hh60qm6/",
          "text": "Would not changing things part way into the course and “experimenting” with a new way of doing it be unfair to the students? What if this experiment doesn’t work and the students learning experience and grades suffer. I imagine they are paying with the expectation that they will be taught effectively and not be guinea pigs.",
          "author": "UleeBunny",
          "created": 1634598158,
          "upvotes": 1,
          "replies": {
            "hh64gmb": {
              "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hh64gmb/",
              "text": "Finding ways to better learn student names is an \"experiment???\"\n\nI think you don't have much teaching experience.",
              "author": "raistlin65",
              "created": 1634599941,
              "upvotes": 1,
              "replies": {
                "hh67y3c": {
                  "link": "/r/GradSchool/comments/q9kozd/i_am_starting_to_feel_like_too_much_is_being/hh67y3c/",
                  "text": "No I meant the trying a new technique to teach the course! I didn’t realize until after I posted that my reply was connected to the post about learning names. Write those across their foreheads with a black Sharpie ;).",
                  "author": "UleeBunny",
                  "created": 1634601632,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}