{
  "sid": "ql9arb",
  "link": "/r/GradSchool/comments/ql9arb/how_to_discuss_poor_grade_in_committee_meeting/",
  "title:": "How To Discuss Poor Grade In Committee Meeting",
  "text": "Hi. So I've done three courses in grad school, one A+, one B, and one C-. A+ was a gimme course, B was my wheelhouse, and C- happened after a really rough month (severe depression, burnout, and dealing with some harassment and some rough interactions with my supervisor). \n\nMy question is: how I should explain the C- and B to my committee... should I be super honest, or should I hold back the excuses as much as possible? Obviously it's a balance, but in your all experience, what kind of details are acceptable? Are there any phrases that you've seen have a good track record? Any advice much appreciated. Thanks.'\n\nBonus paragraph:\n\nFor reference, after this terrible month (August), I finally started exercising, medicating, and seeing a therapist regularly, and I've made some really promising progress in my personal life. I \\*think\\* things with my research are returning back to the pace and quality it was at before. I've got 2 months until the meeting to get my stuff together.",
  "author": "Schattenmonch",
  "created": 1635873807,
  "updated": 1635891358,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hj1p2dj": {
      "link": "/r/GradSchool/comments/ql9arb/how_to_discuss_poor_grade_in_committee_meeting/hj1p2dj/",
      "text": "I would be honest. They are people. They get it. Though, I might exercise some caution regarding \"some rough interactions with my supervisor\", particularly if they are still your supervisor. Also remember that grades mean very little in grad school.",
      "author": "rox_et_al",
      "created": 1635879883,
      "upvotes": 24,
      "replies": {}
    },
    "hj1p957": {
      "link": "/r/GradSchool/comments/ql9arb/how_to_discuss_poor_grade_in_committee_meeting/hj1p957/",
      "text": "Brutal honesty, always. \n\nThe steps you have taken to improve your chances of success going forward (therapy, exercise, etc.) are all evidence of your ability to recognize a problem and address it in a professional, positive manner. In my experience, it’s not that you stumbled, but the tangible initiative you show to improve your landscape going forward that matters more in grad school. We’re prepping for the real world here :-) If your committee cares about you, they will respect your maturity and positive outlook. You’ve got this, chin up! \n(Open to DM’s if you want to talk further)",
      "author": "leaderoftheband19",
      "created": 1635879955,
      "upvotes": 4,
      "replies": {}
    },
    "hj2f3i6": {
      "link": "/r/GradSchool/comments/ql9arb/how_to_discuss_poor_grade_in_committee_meeting/hj2f3i6/",
      "text": "I'm also curious to gather more input around this topic, since I've had a few bad experiences with this during both undergrad and master's.\n\nMy \"rule\" was to never bother or burden professors with specifics about my life, especially a few years ago when talking about mental health was more of a taboo.\n\nI had a very difficult time during my semester abroad in undergrad and got a bad grade in one of my classes. When I got back, my advisor asked about it and I said I got overwhelmed with the class. Their answer was very much rude (in the likes of Legally Blonde's \"like, is it hard?\"). It stung.\n\nIf you do know about someone in your department or program who's been in a similar position to yours (grade-wise), maybe try to find out how their experience with the committee was. There are people willing to talk about it, I guess.",
      "author": "docindeleite",
      "created": 1635889885,
      "upvotes": 2,
      "replies": {}
    }
  }
}