{"sid": "prsn5p", "link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/", "title:": "Severe email anxiety", "text": "Hi,\nDoes anyone know how to overcome this?\nIt is distressing me very much. I can't bring myself to open my emails and see what's in my inbox.\n\nMy biggest fear is that my professors are angry at me and fail me. I am so worried. Due to depression and anxiety, I avoided communicating for months.\n\nEdit- Thank you so much everyone for your help.  I checked the most recent important email. I'm still anxious to check the others. I wouldn't have been able to do it at all if it wasn't for your advice. \nI am upset because I found out through that email that my supervisor has retired. I feel like a bad person for not communicating with her. I really hope I didn't leave a bad impression on her. I honestly wanted to reach out for help and speak to her but I just couldn't.😞", "author": "Eyez19", "created": 1632136253, "retrieved": 1632844099, "over_18": false, "upvotes": 179, "upvote_ratio": 0.97, "comments": {"hdp9qtd": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdp9qtd/", "text": "Any chance you have a trusted family member you could ask to sort through the emails first - if there are any that are likely to be “bad” they can set them aside so you can mentally prepare before dealing with those, and know there will be nothing to worry about before dealing with the others? This may help you tackle this issue until you have time for a therapist to help you deal with the underlying cause (unfortunately therapy has no quick fixes).", "author": "UleeBunny", "created": 1632219800, "upvotes": 1}, "hdosw9x": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdosw9x/", "text": "Have a drink then open", "author": "Flashy-Pea8474", "created": 1632204492, "upvotes": 2}, "hdopouy": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdopouy/", "text": "Breathe.\n\nOpen one.\n\nRead it.\n\nBreathe.\n\nRepeat.", "author": "DJGlennW", "created": 1632202167, "upvotes": 1}, "hdnv8e8": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdnv8e8/", "text": "I don’t have any advice, but I’m the same way", "author": "wizardkelly_", "created": 1632186023, "upvotes": 1}, "hdn2rx9": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdn2rx9/", "text": "I have the same thing. When i was finishing up my MS i would always fear of an email from my advisor. My advisor was cool but i just felt anxious. I also get anxious writing emails. Takes me a while to respond. I usually try to avoid emails and talk to people through meetings. Just walk into their office or track them down", "author": "cmon12345", "created": 1632172863, "upvotes": 1}, "hdmrb76": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdmrb76/", "text": "Hi Friend. I've just had a look at your post history (apologies!). I can see you're in a really bad place - but things can get better, much better. But for now, you need to do two things. 1. Contact a doctor. A GP, visit local walk-in centre. Call 111. Something. You need support, 100% top priority. They can help with poor mental health, and refer you onwards if needed. 2. Contact your university. Tell them you have severe debilitating depression, and are trying to get medical help, but need assistance because it has severely affected your studies. Universities can apply \"extenuating circumstances\". I had severe anxiety in my second year, I asked for help, saw a university counsellor, and they were able to wipe off some of my bad grades for affected coursework and let me retake them without a cap on my retake mark. Universities can be very understanding. Find support at your university too - is there a student support service you can contact?\n\nThis is not the end of the world. You can get overcome all of this. Take a deep breath, take a walk, and remember: you can do this, and there are people who can and want to help.", "author": "Simsimius", "created": 1632168100, "upvotes": 1}, "hdm08pn": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdm08pn/", "text": "I cannot help you, but know you are not alone. \n\nThe podcast Reply All has an episode about the holiday they created called E-mail Debt Forgiveness Day (which is conveniently on September 30th). Listening to this episode was the first time I realized email anxiety was very common, and it made me feel better knowing that I wasn’t alone! In fact, I bet several of the people you have been ignoring have been in your position. Makes it much easier to just face the music and get it done once I realized it was a universal issue", "author": "timberjacked", "created": 1632157009, "upvotes": 3}, "hdlr02o": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdlr02o/", "text": "It is important to not beat yourself up on this. Breath and take it easy. We are all just monkeys on this floating rock trying to do our best. It takes a lot of energy to respond to emails and thats okay. I also suffer from email anxiety but stopped shaming myself on not responding on time (or at all) because that worsens the problem. Instead, what worked best is to trick my brain into drafting and sending a response:\n\n- Open any text editor and copy and paste the email contents\n- At first, your goal is to write any response without the intention of actually sending it right now or at all.\n- Write down bullet points on each subject that has to be addressed.\n- Complete each point with sentences and there you have a draft of your response.\n- You can imagine you are writing the response to your mom or friend to make it easier.\n- After you are done, recheck typos, formalism etc. Don't over think it.\n- Save the document then take a walk or get coffee.\n- When you are feeling comfortable return to the text editor and send it \n\n70% of the time I actually end up sending it right away (without the intial intention), otherwise I always send it after returning from a walk. The point is just to reduce the friction and anxiety from overthinking.", "author": "NeverCoconut", "created": 1632153278, "upvotes": 5}, "hdlqh13": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdlqh13/", "text": "I totally agree with people saying take care of yourself first. Manage depression and anxiety first. That's your priority. \n\nI just wanted to chime in and say that if you do end up starting to address these emails, your responses don't have to be perfect or even good. Whatever you say it will be ok", "author": "froglandloveman", "created": 1632153059, "upvotes": 8}, "hdlqdvq": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdlqdvq/", "text": "I treat emails as hellfire missiles ... fire and forget.", "author": "botNot8282", "created": 1632153023, "upvotes": 4}, "hdlnjsw": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdlnjsw/", "text": "I tend to have this problem too, especially if I'm awaiting feedback, criticism or if the email could contain rejection. I'm not sure what's the exact problem for you but I'll just write a bit about my experience.\n\nIf I apply to something and get a mail back that could contain the rejection, there is no way I can open and read it myself. Any rejection feels like a punch in the guts and sends me to the hell of depression for at least three days. The last time I just gave it to my sister who then told me the result.\n\nFor smaller things I also need to mentally prepare. Funny enough, one or two time I just couldn't open an email on my phone or on my PC because it felt too intense, but I managed to read it on my tablet (super dumb I know). Sometimes it helps to drink coffee, because it can make me lose up a little bit and make me more energetic so that I get into this 'just do it' mindset.\n\nAnother important point is however how you react when you read your emails. What I do is that since I have low confidence, I tend to read and perceive the email in a negative tone. So, the writer might have written the text in a completely neutral and respectful tone, but my brain will read it as if they're annoyed with me and rude, because that's what I'm expecting people to treat me (bc low confidence). That's actually the core issue in my case. I'm afraid of getting hurt, but because I have this negative mindset that I read anything in an annoyed tone, I am guaranteed to get hurt. So the key is to keep telling yourself that this negative perception is just shit that your brains makes up. In most cases the other person won't have any problem with you and won't mind writing to you. I mean, most times it's their damn job to answer emails. Try to consciously read the email in a way that you are not making up negative stuff but instead give the other person the benefit of doubt that they actually mean well. And if a person does write in a not that friendly manner, it's much more probable that they are stressed or have a bad day than that it is because of you. It's not your responsibility to keep everyone happy anyways, so just concentrate on your job, which is writing those emails, and not what other people might think about your emails. That's their job.\n\nAnd the more often you do it, the easier it gets, ideally. Because you will make good experiences of people treating you well, so if someone doesn't, you can confidently know it's because of them, not because of you.\n\nI have no idea if this helps but yeah. Good luck, you can do it!", "author": "annarasum", "created": 1632151850, "upvotes": 5}, "hdlfu1l": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdlfu1l/", "text": "I check email at 8am every single day, and again at 3pm. I also have anxiety around email, but it has been mitigated quite a bit by setting up folders for various categories of things I need to keep track of (but not reply to) and clearing out anything I need to reply to right away. It's an item on my daily to-do list so even if I don't get anything else done that day, at least I can cross that one thing off!", "author": "Weaselpanties", "created": 1632148590, "upvotes": 6}, "hdld34m": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdld34m/", "text": "Don't just leave a thousand emails in a single inbox, and don't just randomly pick at them. Create some structure to empower yourself. Before you start responding, start by just skimming them and sorting them into folders, e.g. \"urgent\", \"not urgent\", \"get around to it someday\", \"waiting for something else to happen before action is required\", \"save for future reference\", or simply no action required (archive/trash). After that you can start working on the urgent folder alone, and the task will be a lot less intimidating - a source of anxiety - but you'll know you're not neglecting anything else in the pile that's equally urgent and your time is being well spent - also a source of anxiety.", "author": "Epistaxis", "created": 1632147384, "upvotes": 7}, "hdl6xsp": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdl6xsp/", "text": "On the flip side, if you experience anxiety sending emails- delay the send 10-15mins so you can move on to another task and not sit there overthinking the content of the email.", "author": "NotSoTeenageDirtbag", "created": 1632144540, "upvotes": 4}, "hdl6cpb": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdl6cpb/", "text": "I don't think the emails are important here, this is:\n\n>Due to depression and anxiety, I avoided communicating for months.\n\nYou have to treat the depression and anxiety first, otherwise this is not going to go well. If you can't handle the anxiety of responding to old emails, how will you handle the anxiety (and stress) of all the critical things you neglected in those months because you missed those emails? \n\n*(edit: It seems from your other posts that you have not been attending class, submitting work, or communicating with anyone on anything for some months. At this point you really can't just read some emails and slid back into your Masters/PhD acting like nothing ever happened. You are way beyond being able to do that. You have failed to hand in critical assessments. You have probably failed those courses. You don't have a supervisor. Are you even still enrolled? Your emails are very low priority compared to these problems, and reading all of your emails won't solve them.)*\n\nRight now, you need to go into emergency recovery mode, and that extends much further than just *reading* your emails. First things first: talk to your supervisor. Tell them why you have been absent. If you are now cured of depression and anxiety (or have it in effective remission) then tell them the problem has been resolved and continue on as you are. Triage your emails in terms of most important to least important, and ignore the least important ones.\n\n**But** if these issues haven't been addressed — and I think it's pretty obvious that you're still struggling — you need to negotiate time off (intermission or a holiday) or a reduction in your duties. You don't just get back up and start running a marathon when you've broken both legs. You need to treat your depression and anxiety **first** and you need to rope your department in on that so they can support you. If they know why you've been absent, they can help you prioritise your return tasks. But they need to know first.", "author": "officially_anxious", "created": 1632144258, "upvotes": 56}, "hdl0bpy": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdl0bpy/", "text": "I find it that it helps me to have a schedule and put stuff I don’t want to do/ dread doing first. \nSay you’ll book 9-11 to look through emails AND reply them. \n\nDon’t let you anxiety become a self fulfilling prophecy that will lead to you being fired.\n\nAnd also, consider finding yourself a therapist. Universities often have some therapy available. Don’t be scared of calling and saying you need help NOW and saying it is an emergency.", "author": "mmthelamp", "created": 1632141133, "upvotes": 4}, "hdkwshm": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdkwshm/", "text": "I have this sometimes. If you have someone in your life who's willing to help (parent, good friend, significant other), try talking about your condition and forwarding them them the email. Ask them to recap the email for you. At least for me it's easier to deal with news coming from a loved one. I've gotten over the majority of my fear this way. Hell, I'll do this for you, DM me.\n\nAnother thing I do, is open the email and change tabs immediately. Reading it is the scary part. But opening it makes it just a little bit easier to work yourself up to it. Set your self a time limit (say 10 minutes), and browse Reddit or something in the meantime. When your time is up, swap back but close your eyes. Give yourself a pep talk, and go for it. Once you've read the email, absorb the fact it wasn't that bad.\n\nFinally, remind yourself that grad school is a job, but not your life. I used to obsess and dread writing and reading emails, but reading and sending emails is part of the job. Any criticism is a reflection of your work, but not necessarily you. You still have a chance to work through things, but it starts with opening emails.\n\nLol, I also hate voicemail- but I have a service that will text me the contents of voice mail- which is a amazing.", "author": "TehDing", "created": 1632139031, "upvotes": 19}, "hdktl6z": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdktl6z/", "text": "What exactly is it about emails that is causing you such anxiety? I think that's important information to be able to understand where this anxiety comes from and how one might help to deal with it. \n\nI used to have a bit of anxiety when I saw unread emails in my Outlook because, at one point, I was working with someone who was being very difficult and who was emailing at all hours of the day marking everything as URGENT regardless whether it was urgent or not. For me, it was like \"what kind of hellscape am I going to wake up to today?\", so removing myself from that environment helped a lot. \n\nIf you're in grad school then email is unfortunately just something you have to deal with, so it might be helpful to schedule a routine for when you check emails. If you try to keep a \"typical\" 9-5 schedule, then you can check your emails at 9am, 11, 1, 3 and 4:45pm, for example, but then choose not to look at them after 5pm or before 9am. I have a similar schedule and it helps because I don't feel pressured to respond every time a notification pops up--as long as I respond regularly, those I work with won't feel like I am ignoring their emails. Also, if you have your emails linked to your phone and have notifications turned on, turn them off. There's no reason for email notifications to be on one's phone, imo.", "author": "False-Guess", "created": 1632136911, "upvotes": 11}, "hdkt8is": {"link": "/r/GradSchool/comments/prsn5p/severe_email_anxiety/hdkt8is/", "text": "Take a deep breath and open your inbox. Scroll down and see how many emails you HAVE TO reply to. Declare bankruptcy on the others.\n\nSort the emails by priority, from most important to least important. Copy the contents of all the emails into a .txt file. Open Cold Turkey Writer (a program that locks your computer for everything else other than a simple text processor) and open the .txt file you previously saved. Set the timer to 25 minutes and off you go!\n\nThe only way to get rid of the anxiety you are feeling right now is to reply to those emails. There's no way around that, so the sooner you get this over with, the better. Good luck!", "author": "Naffster", "created": 1632136663, "upvotes": 101}}}