{"sid": "pi9ssi", "link": "/r/GradSchool/comments/pi9ssi/data_visualization_research/", "title:": "Data Visualization Research", "text": "Do you believe it's worth it to do a Ph.D. in data visualization? I have a background in data science/machine learning but I also want to learn graphics . Data visualization would be a great way to combine these two. \n[Example companies](https://www.nvidia.com/pt-br/ai-accelerated-analytics2/partners/)", "author": "georgegeorge97", "created": 1630833030, "retrieved": 1632953106, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"hbrtzvy": {"link": "/r/GradSchool/comments/pi9ssi/data_visualization_research/hbrtzvy/", "text": "Hey, I'm an ML student who took a little detour into visualization (a short paper in the conference VIS). A phd in this field is pretty good since all interesting data is high-dimensional i.e. you'll be working in data science, so your ML experience is great and an industry career is no problem. If you're more interested in the graphics side (shaders and whatnot), I can't really comment there. I think there is certainly room to design interesting interactions with complex data using graphics. Also, do you like working with users? The problem of \"how do I represent my data in a novel/understandable way\" requires user studies since, well, how else can you evaluate the quality of your new visualization?\n\nVis phds do take a while though, compared to ML. I've heard one vis lab taking 8 years on average, whereas ML is 6.", "author": "goldemerald", "created": 1630902837, "upvotes": 3}, "hbom8d0": {"link": "/r/GradSchool/comments/pi9ssi/data_visualization_research/hbom8d0/", "text": "It depends on what you want to do. If you want to go into industry, for most jobs you'll just need a bachelors or masters and the right skill set. A big chunk of the PhD is research, which doesn't provide any practical skills needed for most jobs. I'd suggest getting the PhD only if you plan to go into academia. Of course, you may have other reasons like personal fulfillment that would make it worth doing.", "author": "eleveneels", "created": 1630847831, "upvotes": 3}, "hboj4kk": {"link": "/r/GradSchool/comments/pi9ssi/data_visualization_research/hboj4kk/", "text": "Personally, I wouldn’t say a PhD in Data Visualization is worth it. But also in my opinion, I believe that PhDs are an excellent way to greatly expand upon your current knowledge and bring something new into the world; PhDs do not always have to have a practical use (i.e you don’t need to spend years working on a PhD just to be good at data visualization). If you value the enhanced knowledge and specialization that a PhD provides, I say it is an excellent choice!", "author": "PasswordLogger", "created": 1630846027, "upvotes": 4}}}