{"sid": "phljuz", "link": "/r/GradSchool/comments/phljuz/not_sure_social_work_is_for_me/", "title:": "Not sure Social Work is for me?", "text": "I graduated from school, but now I want another career; how do I get a Law degree?\n\nI graduated college with a Bachelor of Art in Social work and have found that I do not really enjoy the efforts of this degree. I love the concepts that Social Work presents, but it definitely needs a backbone. I believe that backbone for me is Law, and currently, I am looking at the Children's court to be an Investigator Clerk as I want to seek justice for children who do not have a voice. As of right now, I've never had an interest in Law until a couple of hours ago as all I have been thinking about is what do I want to do with my life, and then it stunned me about what I seek as passion. I believe it's something personal as well. \n\nWhat I'd like to know is where I can start to get a degree in Law? I was looking at the previous community college that I attended and felt there was nothing concrete. I did see a certificate to achieve legal assistant, which I am more than likely going to take and apply at this point.\n\nThe one thing I am curious about is that when I graduated with my BASW, my GPA wasn't great, which was a 2.8, so I am curious if that will affect me in any way and if I can change this? Also, my communication skills are poor which I will be taking communication classes as well. The amount of time will not matter, of course, because I plan to make a difference from here on out.\n\nThanks! Only positive feedback! No negative comments! But willing to take positive criticism.", "author": "Brave-Ad-4856", "created": 1630732930, "retrieved": 1632844923, "over_18": false, "upvotes": 0, "upvote_ratio": 0.5, "comments": {"hbq4otf": {"link": "/r/GradSchool/comments/phljuz/not_sure_social_work_is_for_me/hbq4otf/", "text": "Unfortunately, your GPA is low for law school admissions and there is no way to raise it by taking additional classes or getting another degree. You're going to have to go through the process with a 2.8. The good news is that you can get into many schools with a 2.8 *if* you do well on the LSAT. Law schools place a lot of emphasis on your undergrad GPA and your LSAT score because those two numbers are the biggest factors in their US News ranking, so it's crucial that you do well on the LSAT to offset your low GPA.\n\nHead over to r/LSAT to read up on how to get started. Don't waste your money on an in-person class, there are so many books and online resources available that are far better than a Kaplan course or whatever. The PowerScore Bibles and the 7Sage curriculum are very popular on r/LSAT. \n\nTo learn about the whole process, there is a lot of info available on r/lawschooladmissions. I would recommend reading the posts linked in the sidebar rather than just posting a generic \"how does this work post?\" because there is a ton of good information available.", "author": "workingonmyroar", "created": 1630872512, "upvotes": 2}}}