{"sid": "lmn8d3", "link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/", "title:": "Vent: Instructor for the course I am TA for refuses to allow extensions", "text": "A student in the class for which I am a teaching assistant emailed the professor and me asking for extension on the homework due this week as he is stuck in Texas. For people who are OOTL, Texas is facing massive blackouts and people are scrambling for basic needs. Not to mention, we are in the middle of a pandemic and working from home as it is, is challenging.The professor replied telling that they will offer no extension on any account as it just encourages others to seek it in the future. I am baffled! Where is equity in this?\n\nEdit: Thanks to everyone for the reply and affirming how shitty this situation is. Unfortunately, my funding for the rest of PhD will involve teaching and probably with the same professor(not my PI) as my other funding was pulled. So that's the first reason why I do not want to go over him, which will include letting the student know their option. I encouraged them to reach out to me even over cellular text so I can help them with the assignment as this is the least I could do. I didn't think about granting the extension myself, maybe I will do it from the next time.  \n", "author": "EngineeringDoctor", "created": 1613656338, "retrieved": 1632845934, "over_18": false, "upvotes": 349, "upvote_ratio": 0.99, "comments": {"gnzimib": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnzimib/", "text": "Is this an assignment only you grade? I just direct my students to only email me about extensions on anything I’m grading and grant them. The professor never knows, nor do they need to.", "author": "elosohormiguero", "created": 1613722088, "upvotes": 1}, "gnykn58": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnykn58/", "text": "I’m also in Texas and also in grad school. At the very start of this I had a professor that had the same tone. Within 24 hours of saying no change to the syllabus, extensions, etc she sent out an email back peddling. I imagine someone complained or she herself lost power and realized she was unrealistic. Texas is insane right now, I’ve been here most of my life and I’ve never seen it so crazy. Def should go higher up.", "author": "merder101", "created": 1613700273, "upvotes": 3}, "gny3a7b": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gny3a7b/", "text": "I don't agree with the pandemic logic honestly. It's been almost a year, and by definition, everyone is experiencing a pandemic. Any extension due to pandemic should be one applied to every student, which hopefully means it was already considered in establishing the original due date. Maybe wishful thinking considering the response here but...\n\nBut an extension due to a power outage that literally nobody else is experiencing and may actually be preventing them from doing work for multiple days should be granted.", "author": "m1ss1ontomars2k4", "created": 1613691403, "upvotes": 2}, "gnxy6j4": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnxy6j4/", "text": "If I were in your shoes, I would reach out to the professor and kindly/calmly explain the circumstances of what's happening in Texas and suggest that we offer an extension for this difficult situation. \n\nIf they declined, I would email the student and explain the steps for escalating this past the professor-- first, the department head (who is Dr. Whatever and whose email address is X), then the ombudsman (who is Name and whose email address is X). \n\nIn my opinion, this is unacceptable behavior from a professor. Perhaps they are misinformed or feel some ambivalence and can be persuaded to be more reasonable. But, if not, it seems completely fair to me to let the student know next steps in escalating. \n\nYMMV, of course.", "author": "intangiblemango", "created": 1613688927, "upvotes": 2}, "gnxvb6o": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnxvb6o/", "text": "This person is a raging asshole, and I bet they ask for and receive extensions for their own work. Tell the student to go over their head.", "author": "Felixir-the-Cat", "created": 1613687581, "upvotes": 1}, "gnxlk5o": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnxlk5o/", "text": "I'm sure so many other commenters will write the same thing I'm writing. Texas is having major disasters happen all at once. FEMA level problems. There is documented evidence of how this impacts the student's ability to hand in work on time, so this should not even be a point of contention for the prof. I hope you advised the student to email the dean or whoever can provide the professor with a refresher on how to accommodate students", "author": "SantismaMuerte", "created": 1613683334, "upvotes": 1}, "gnxgohs": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnxgohs/", "text": "Lmao shit like this is why I am slowly coming to despise universities and academia in general", "author": "Gerardo1917", "created": 1613681246, "upvotes": 2}, "gnxc1b3": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnxc1b3/", "text": "This needs to escalated up whatever chain of command there is for universities.", "author": "RadioactiveMermaid", "created": 1613679223, "upvotes": 2}, "gnxb6wn": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnxb6wn/", "text": "If I were grading, I would give him an extension with a 0.0000001 penalty in case someone complains.", "author": "RageA333", "created": 1613678869, "upvotes": 2}, "gnxa5bh": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnxa5bh/", "text": "First: definitely tell your students to document everything and send this documentation up to Prof's super when prof kicks their emails back to them saying they won't budge. \n\n&#x200B;\n\nSecond: *yikes*. These comments are bringing back bad memories of when I thought the classes I was TAing were so important, and the profs felt that way too. At the end of the day, this homework is just not important at all. My priorities were out of line and I regret that. Watching that play out here sucks. I feel so bad for all the students (undergrad, grad, everybody) and teachers, especially right now and especially those in Texas. *Yikes.*", "author": "EpinephrineKick", "created": 1613678420, "upvotes": 5}, "gnx1e3g": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnx1e3g/", "text": "Hit reply-all to that email and, like u/anintellectuwoof said, tell them to take this to the Dean.\n\nA natural disaster in the middle of a pandemic doesn't deserve an extension? The professor needs a reminder to get their head stuck out of their ass.\n\n&#x200B;\n\nEdit: Okay maybe don't hit reply-all, I'm just confrontational when it comes to that shit now. I have no tolerance for professors acting cruel in dire circumstances.", "author": "excelnotfionado", "created": 1613674768, "upvotes": 6}, "gnwyvtj": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwyvtj/", "text": "To simply put it this way: it makes history if it snows once in a year in South Texas. It has now snowed twice in one week. 2020 was the year from hell. 2021, hell froze over here. Hopefully something can be done for the student and I appreciate your frustration on their behalf.", "author": "ArmyBrat2SouthnBelle", "created": 1613673767, "upvotes": 4}, "gnwt45f": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwt45f/", "text": "Unpopular opinion: I wouldn’t let this be the hill I die on. I’m all for advocating for students, but I know my place as a TA and would just take the professor’s word as final. I wouldn’t push back or defy the professor over one student for one homework assignment (maybe the lowest grade even drops) who might be lying. The pandemic excuse is a little played out now that we’re almost a year in. Students will need to learn how the bureaucracy works because no one at the DMV or post office will be risking their necks for them.", "author": "DianeSucks", "created": 1613671479, "upvotes": -7}, "gnwqrbe": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwqrbe/", "text": "Continue to advocate for your student as best you can (and it's really great to see you doing this already). I wouldn't have the student contact the chair of the dept as others suggested as that will likely go unnoticed. Have them contact the chair of education in the department and you're more likely to receive a response. And have them email the chair of undergraduate affairs. You're absolutely right that there is no equity here. I'm fortunate that the instructors I work with allow us to make our own decisions regarding assignments we grade.", "author": "chlcwelc", "created": 1613670507, "upvotes": 2}, "gnwnzwr": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwnzwr/", "text": "As a TA you should have slightly greater sway over your professor. Reach out to them, maybe see if they just don't realize what's happening in Texas, and let them know you think it might be important to give this student the extension they need.", "author": "boringhistoryfan", "created": 1613669384, "upvotes": 4}, "gnwnlnm": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwnlnm/", "text": "If I were you, I would just secretly grant that student an extension. That is probably easier for the student during this time than taking it to the dean/ombudsperson. Also I’d make sure to stay away from that professor in the future because they seem to be an a-hole. I swear some professors think their classes are the single most important thing in people’s lives smfh", "author": "randomnerd97", "created": 1613669234, "upvotes": 7}, "gnwmx8r": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwmx8r/", "text": "Federal funding agencies are extending due dates for proposals and reports nationwide due to the ongoing events in TX. I feel like an Engineering 101 prof could at least do the same.", "author": "racinreaver", "created": 1613668973, "upvotes": 6}, "gnwijij": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwijij/", "text": "Have you tried explaining the situation to the professor privately?", "author": "mleok", "created": 1613667201, "upvotes": 2}, "gnwg3zl": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwg3zl/", "text": "That is absolutely heartless to say the least. Although we're in NY, at my university we're granting extensions left and right because we know we're in the middle of the pandemic and things are difficult right now. I can't even imagine what the people in Texas are going through right now. It's unacceptable your professor/boss isn't being accomodating to student's needs!", "author": "fueledbykass1", "created": 1613666176, "upvotes": 4}, "gnwe866": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwe866/", "text": "As a TA do you have access to the gradebook? Maybe you could have the student email you the assignment (on a \"one-time only\" basis) and fill in the grade afterward?", "author": "CotesiaFanclub", "created": 1613665365, "upvotes": 0}, "gnwaf6g": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwaf6g/", "text": "I’m in Houston and I have not had regular access to power (in and out since Sunday night) or running water (completely gone since Tuesday morning).\n\nIf I were the student, I would take it up with the dean of the college/department chair. Please make sure that they know they have options! A class is not a fiefdom.\n\nMy university is in Chicago, and luckily my professors have been tremendously supportive and understanding. If they weren’t, I was prepared to go over their heads.", "author": "sewfartogo", "created": 1613663696, "upvotes": 6}, "gnwa19x": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnwa19x/", "text": "Lots of good comments already. I'm a professor and wouldn't make the same choice as yours - at all. \n\nI'd just add that I tell TAs that being a TA means learning how to teach, both what you think is effective as well as what you think is ineffective - ineffective actually doesn't go far enough to characterize your professor's decision here.", "author": "rosmarinaus", "created": 1613663527, "upvotes": 6}, "gnw9xd0": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw9xd0/", "text": "I don't don't think the professor has ever experienced a power outage longer than a few hours.", "author": "MadScientist312", "created": 1613663480, "upvotes": 6}, "gnw6ygj": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw6ygj/", "text": "The fucking entitlement of profs. Like people are dying in Texas and the prof thinks the students should, somehow, prioritize their course??", "author": "frankie_prince164", "created": 1613662153, "upvotes": 7}, "gnw64hp": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw64hp/", "text": "That sucks. Even if the student isn’t from Texas and was just passing through. I’m in Texas right now. Rolling blackouts, being asked to conserve energy where you can. My friends came in town on Friday to celebrate my birthday with me and now they’re stuck until tomorrow at the earliest to leave. Their teachers are all giving them extensions. I don’t understand professors who wouldn’t. Garbage.", "author": "Pikalover10", "created": 1613661774, "upvotes": 5}, "gnw5ivq": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw5ivq/", "text": "[deleted]", "author": null, "created": 1613661497, "upvotes": 22}, "gnw52vs": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw52vs/", "text": "Does this prof also happen to be the former mayor of Colorado City?\n\nhttps://www.cbsnews.com/news/tim-boyd-texas-mayor-colorado-city-resigns-power-outages/", "author": "Schedonnardus", "created": 1613661293, "upvotes": 0}, "gnw4nro": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw4nro/", "text": "As a TA, there were a few occasions that the professor and I disagreed on whether to grant an extension or not. However, I was the only one of the two of us who dealt with grading or the grade book. He never knew if I entered a grade in or accepted a late assignment, so I chose to do it anyway a few times over my years in grad school TA'ing.", "author": "Schmidty102", "created": 1613661097, "upvotes": 71}, "gnw3mma": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw3mma/", "text": "The student should contact the department chair. If I were the TA, I would suggest this to the student but ask them not to reveal that they got the idea from me.", "author": "ArcanaNoir", "created": 1613660615, "upvotes": 8}, "gnw26sr": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw26sr/", "text": "I'm guessing your professor is probably imagining that students will lie about being in Texas rn the same way it's assumed they lie about other dire straits to secure extensions. This is what happens when people decide that preventing \"cheating,\" \"fraud,\" and similar unfair advantages is more important than equity or aiding the unfortunate. It's a pernicious attitude that is rampant in academia, of course, but it's also typical of public administration at all levels in the U.S. (e.g., means testing to prevent \"waste, fraud and abuse\"). All in the name of \"fairness.\"", "author": "toberrmorry", "created": 1613659926, "upvotes": 16}, "gnw1sww": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw1sww/", "text": "The student should first contact the department head. Next is the student advocate like an ombudsman or dean of students.", "author": "Hazelstone37", "created": 1613659741, "upvotes": 175}, "gnw1akd": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw1akd/", "text": "I'm in Texas. Apartment hasn't had power since Monday and no water almost anywhere. Almost out of food. That student should ABSOLUTELY take this to the dean, we are literally in the middle of a natural disaster.\n\nETA: Even the people I know who have been fortunate to have power, water, and/or food have been scrambling to help their neighbors because our state government can't be bothered to do it for us. It's literally only through the help of generous neighbors that me and my dog are not freezing, starving, and dehydrated right now, and that's not an exaggeration.", "author": "anintellectuwoof", "created": 1613659495, "upvotes": 302}, "gnw11gz": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnw11gz/", "text": "I would reach out to the professor and explain the situation is not a normal one and to reconsider. If he/she does not reconsider, talk to someone above him/her. I understand some professors not extending a deadline, BUT they usually extend for valid reasons. This is one of them.", "author": "pvt9t", "created": 1613659372, "upvotes": 37}, "gnvybrj": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnvybrj/", "text": "do you actually have to listen to him?", "author": "murdermeformysins", "created": 1613657998, "upvotes": 13}, "gnvybdy": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnvybdy/", "text": "I would quietly provide the student omsbundman info to your Texas student. That is unacceptable and completely out of the students control.", "author": "calmhike", "created": 1613657993, "upvotes": 40}, "gnvy1y9": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnvy1y9/", "text": "I really have nothing but expletives for that like... I get not giving people extensions for 'no reason' but being in Texas this week is a legit excuse. Like what, they're supposed to use willpower instead of electricity?\n\nThat student should escalate to head of department/dean/etc.", "author": "lithobius1814", "created": 1613657856, "upvotes": 27}, "gnvxugf": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnvxugf/", "text": "This MFer. In addition to the hardship of being in Texas right now we are all under an energy conservation order. Basically to help get more people basic power to heat their homes we are only supposed to use the bare minimum. \n\nI for example am sitting in the dark, with my heat set at 64 degrees. We are doing this because I have friends who haven’t had power since Monday. People are suffering, so we have to do our part.", "author": "Onepopcornman", "created": 1613657745, "upvotes": 48}, "gnvxa70": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnvxa70/", "text": "You're right, it's baffling and there is no equity in that approach. If I were the student, that professor would get roasted in the evals at the very least. I may complain to the dean if I was that student. I have family in Texas and they have had power on and off for the last few days and are currently dealing with burst pipes, so even if I was that student and I started the assignment over the weekend, there's no guarantee I'd have power when I go to submit it. \n\nDepending on what the assignment is, if it were me, I would tell the student to do what they can using Microsoft office online/Dropbox and then they could email me a link to the assignment if they are unable to access Canvas since they could probably use the internet on their phone via WiFi. Going to the library is not necessarily an option because, well, the library probably doesn't have power either. \n\nIt sounds like your professor doesn't actually know anything about the situation in Texas or how bad it is. Luckily it will be in the upper 50's - 60's by Saturday so relief is on the way, but that doesn't mean everyone will have power then either.", "author": "False-Guess", "created": 1613657442, "upvotes": 52}, "gnvx5lc": {"link": "/r/GradSchool/comments/lmn8d3/vent_instructor_for_the_course_i_am_ta_for/gnvx5lc/", "text": "There is none. That's insane.", "author": "Various-Grapefruit12", "created": 1613657372, "upvotes": 59}}}