{
  "sid": "qnfa26",
  "link": "/r/GradSchool/comments/qnfa26/masters_advice_after_impractical_bachelors/",
  "title:": "Masters advice after impractical Bachelors",
  "text": "Hello, I graduated this June with a BSc in Astronomy/Astrophysics in Canada. I really liked the material which is why I chose the degree, but now it's obvious there are not really any decent jobs in this field. I've had 3 summers of research experience in computational (astro)physics and data analysis, and I'm currently working as a data analysis technician at a university as well, and this job's contract ends in December. I'm most experienced in Python but I am familiar with other languages as well.\n\nI thought about pursuing a Masters in CS since I'm experienced in coding but I probably don't fulfill the requirements of the good programs. So I was thinking about Masters of Data Science which I thought could apply to a variety of fields, such as finance, CS, etc. but my brother suggests I do something engineering-related. I believe I can do good in either: programming or engineering; I just care about better pay. So my question is the following: what programs can I look into that have good job prospects in industry with good pay? My research experience is all in academia which I don't want to continue in. Is a Masters in DS worth it in the long run? If there's any other advice or suggestions you guys can give, that would be greatly appreciated as I'm clueless right now and a bit worried. I would like to mention that I got a few (<5) interviews for a data engineer role and junior dev positions, but none of them worked out.",
  "author": "rdhill13",
  "created": 1636130916,
  "updated": 1636201658,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjfs2vo": {
      "link": "/r/GradSchool/comments/qnfa26/masters_advice_after_impractical_bachelors/hjfs2vo/",
      "text": "An Engineering masters sounds more practical than CS if you don't care about academia.",
      "author": "Superduperbals",
      "created": 1636132239,
      "upvotes": 3,
      "replies": {}
    },
    "hjg03tz": {
      "link": "/r/GradSchool/comments/qnfa26/masters_advice_after_impractical_bachelors/hjg03tz/",
      "text": "If you just want good pay just go into an analytics or data science program.",
      "author": "exurl",
      "created": 1636135350,
      "upvotes": 1,
      "replies": {}
    },
    "hjgxpfp": {
      "link": "/r/GradSchool/comments/qnfa26/masters_advice_after_impractical_bachelors/hjgxpfp/",
      "text": ">So I was thinking about Masters of Data Science which I thought could apply to a variety of fields, such as finance, CS, etc.\n\nData Science is a great choice. If you're drawn to that, I'd say go for it.",
      "author": "raistlin65",
      "created": 1636148045,
      "upvotes": 1,
      "replies": {
        "hjgy81a": {
          "link": "/r/GradSchool/comments/qnfa26/masters_advice_after_impractical_bachelors/hjgy81a/",
          "text": "Good money and chance for career advancement?",
          "author": "rdhill13",
          "created": 1636148243,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}