{"sid": "psrhxr", "link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/", "title:": "How do you feel about the location you are forced to live in for grad school", "text": "Does anyone else feel like they saw themselves living somewhere else other than where they ended up going to grad school? I have considered taking a break just because I worry I will be unhappy living in the place where my grad school is located for the majority of my young adult life. Just wondering if this is an issue for anyone else.", "author": "gentleboys", "created": 1632256749, "retrieved": 1632952128, "over_18": false, "upvotes": 38, "upvote_ratio": 0.9, "comments": {"heeue1h": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/heeue1h/", "text": "When I was applying to and then deciding on programs I was repeatedly told to choose the program and the advisor, not the location, so that's what I did. I kinda regret it. I just started my masters in Oklahoma and I'm from a northern state and it's actually just really really different and I don't love it. The majority here is conservative and religious and I'm neither of those things so it's been weird feeling in the minority in that way for the first time in my life. I don't love the heat and it's basically just a big football town. I absolutely love the city my undergrad was in, my sister and two of my best friends also just moved there before I left which made leaving way more shitty too. I plan on trying to move back right after I graduate. I didn't realize how much I loved my old city until I left. There is some truth in that I'm somewhat more productive because there's not much to do but I don't think it's worth it. I'm just really really hoping I can stick it out for 4 semesters to just get out fast. Realistically it's not long so I think I can do it. I couldn't do a PhD though, I'd suffer too much haha.", "author": "electrictorches1", "created": 1632700772, "upvotes": 1}, "hdwyx93": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdwyx93/", "text": "Oh absolutely, I cried when I found out I was moving to Texas. I still occasionally cry because I have to live in this dystopian hellscape of a state. But you learn to find things you love, and if you have good support system and friends, location stops to matter quite as much", "author": "IncompletePenetrance", "created": 1632362858, "upvotes": 1}, "hdvk1t4": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdvk1t4/", "text": "My dream program ended up being 15 minutes from where my parents live / I grew up (and where I currently lived at the time). I loved it because I’m not a big fan of change. I love travelling, but I don’t think I would ever be able to move somewhere else. Plus, if I didn’t stay here I would never have met my boyfriend/love of my life (together over 3 years now). So absolutely 0 regrets. Plus, this was an incredible program. Such a humble culture and everyone is extremely friendly. I honestly had very little stress during grad school because the culture and environment was so awesome.", "author": "Gryffindor1994", "created": 1632335903, "upvotes": 1}, "hdv1fv7": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdv1fv7/", "text": "I’m originally from this area but moved away as a kid. I hate it here. It’s too urban, too much crime, too expensive, too much driving to get anywhere at all-nowhere to even walk safely unless I drive there. It took me 6+ months to find even sub-par housing. Also my family is too close lol. I did not expect to be this miserable.", "author": "sylphrena83", "created": 1632328378, "upvotes": 1}, "hduwupr": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hduwupr/", "text": "I filtered strongly for location when applying to grad school and only applied to programs in two metro areas: my hometown (which I adore) and a very similar city in terms of size and overall vibe. I wasn't the happiest with the town where I did undergrad, which was also really sucky for travel options, so I knew it would be really important to find the right location for graduate studies.", "author": "aggressive-teaspoon", "created": 1632326513, "upvotes": 1}, "hdubrwu": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdubrwu/", "text": "Yeah. I’m living in a very hot climate (which is meh), but in a fun city. However, housing rates within my city have been rising astronomically, so even with a competitive stipend I live in a very unsafe area. I’m talking multiple murders, robberies, carjackings, sexual assaults, you name it. I can’t walk outside alone. \n\nSo while I can deal with the climate and being 1,000 miles away from home, the crime rate is a problem I’m having difficulty with.", "author": "BiologyPhDHopeful", "created": 1632317522, "upvotes": 1}, "hduad53": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hduad53/", "text": "Switched countries, so apart from the culture shock and homesicknesses it is awesome.", "author": "TacitDetermination", "created": 1632316842, "upvotes": 1}, "hdu03bm": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdu03bm/", "text": "Montreal? Not bad. I’m loving it. Probably the favorite place out of every places I’ve lived. I might have ended up in Baltimore, but I’m glad I’m here now.", "author": "OvulatingScrotum", "created": 1632311167, "upvotes": 1}, "hdtsezs": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdtsezs/", "text": "I’m ok with we’re I am for my MSc, but I did a year long internship in Columbia Missouri, the “get me the hell out of here state”. I was missing the appropriate equipment to fit into the “Good ole boy’s club” there. I did have fun spelunking in the Devil’s Icebox and would have actually travelled back just to do that again except access to the caving system  was closed due to concerns about people brining in the fungal disease killing bag populations.", "author": "UleeBunny", "created": 1632305431, "upvotes": 1}, "hdts6mm": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdts6mm/", "text": "I didn't apply to any PhD position in a place I wouldn't want to live (aka outside the EU so my boyfriend wouldn't have been able to come along)", "author": "doornroosje", "created": 1632305224, "upvotes": 1}, "hdtoor9": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdtoor9/", "text": "I certainly wasn't expecting the amount of slumlords in my area. I tried really hard to get into graduate student housing on campus, but that is also really expensive for what my stipend was my first year. Luckily the city has a low crime rate and there aren't really any \"bad\" parts of town, its just that many of the old houses have been converted into rental unites decades ago and the landlords are either absentee or incredibly cheap. My current apartment, for example, I'm pretty sure was converted from a warehouse in the 1970's because the oven is older than I am and there's a heat lamp in the bathroom. My dad told me those things used to be common in the 70's. It's better than where I used to live, however. \n\nI wasn't expecting to live in luxury, of course, but I had a one bedroom apartment back home that had all the basic amenities, including the ability to \"rent\" a washer and dryer for a small monthly fee, and I was paying about what I pay for a studio apartment here with none of that. \n\nI had an honest talk with my adviser about post-degree plans and I made it clear that I won't apply for jobs in small towns. I'm gay, so location is very important to me and I don't want to live in an area where I don't feel safe or am more likely to be discriminated against. I would rather leave academia for industry than be in academia in a horrible place.", "author": "False-Guess", "created": 1632301969, "upvotes": 5}, "hdti2c8": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdti2c8/", "text": "My god it's grad school, not prison.\n\nTreat it like a low paying high stress job. Would you move there for that? If so, then go. If not, then don't.", "author": "cephalord", "created": 1632295703, "upvotes": -2}, "hdtg7dp": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdtg7dp/", "text": "I only applied to programs in my city 😅", "author": "isaac-get-the-golem", "created": 1632294055, "upvotes": 1}, "hdtfbgt": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdtfbgt/", "text": "There's not much to do, it rains all the time and once winter comes around, I get depressed. So yes, I don't like it here and I wanna leave. I'm glad I only have 7 months left in this city. Next stop is Osaka, which is definitely more exciting.", "author": "Blutorangensaft", "created": 1632293316, "upvotes": 2}, "hdtc6ae": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdtc6ae/", "text": "I feel mixed about it. On one hand, it's close to family. On the other hand, we have a lot of homeless people in our city and that makes it a bit dangerous to walk around. I'll hopefully stay in the bay area for a postdoc/industry work though so it's all about the perspective.", "author": "childoflilith", "created": 1632290792, "upvotes": 1}, "hdt4snc": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdt4snc/", "text": "Location was one of the major things I considered when looking at schools to apply to, I think it’s very worthwhile to pick somewhere you’ll enjoy for the 4-5 year commitment of a PhD. So I’m very happy with where I chose because it was very important to me from the beginning.", "author": "calabunga_21", "created": 1632285609, "upvotes": 3}, "hdt1y9a": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdt1y9a/", "text": "Masters degree. I fucking hate it.\n\nIt’s in the middle of no where and there’s about three things to do. Once you’ve done those, congrats, you’ve done everything the town has to offer.\n\nIt’s minimum 2.5 hours from any town of consequence so any trip is an all day affair. I just fucking hate it. \n\nThe seclusion, lack of things to do, and slow pace of my thesis (2.5 years) have me ready to quit.", "author": "AngriestManinWestTX", "created": 1632283830, "upvotes": 1}, "hdsz72v": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdsz72v/", "text": "Yessssss. I've been thinking about this a lot. I'm in my master's program, so I only have one more year and then I'm done, but once I graduate I'm moving into a big city. I'm in a smallish college town right now and it's just so catered toward undergrad students (who I teach) that I don't feel like I belong in the town. I studied abroad in Amsterdam for a semester, and that was one of the happiest semesters I had, so I've decided that moving to a city with a similar population in my state would make me happier. Until I graduate though, I'm stuck here and trying to make the best of it. When I apply for PhD programs next, I'm def basing it off of program and location (not applying at a school with less than 100,000 people).", "author": "em_em_em_em", "created": 1632282211, "upvotes": 1}, "hdste3t": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdste3t/", "text": "Really really disliked where I ended up.  Ended up switching degree plans to MS just to get out of here asap! I am typically the type of person to find the good in places, but it just wasn't a good fit for me. Perhaps covid had something to do with it?  I started fall 2020, so right in the middle of the pandemic.", "author": "CyclingCivilEngineer", "created": 1632279076, "upvotes": 3}, "hdsf0hb": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdsf0hb/", "text": "I lived in a smaller city for my PhD (still in the program). I hated it to be honest. It's a place to start a family but there was nothing there for me. Using tinder was also terrible as it was just a small selection of people who grew up and lived in the city their entire lives if late 20s or older. I finally couldn't take it anymore and moved and am much happier.   \n\n\nI actually had a really good job offer back in my old city and my friend told me I should seriously consider it. I said no way in hell. I was unhappy living there before and will just be unhappy living there again.", "author": "doublefault88", "created": 1632272100, "upvotes": 4}, "hdsdjip": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdsdjip/", "text": "I got to move somewhere I always thought it would be cool to live so no complaints here. I went a place I didn't think I'd like for college though and ended up loving it, so I wouldn't preemptively decide you'll be unhappy where your school is.", "author": "mediocre-spice", "created": 1632271401, "upvotes": 1}, "hdsdd8r": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdsdd8r/", "text": "I legit hated where I lived during my PhD... tiny rural college town in the south, the weather was SO hot, people SO conservative, the only culture in the town was football. \n\nSo after 4 years, I applied for a fellowship and spent 6 months in Zurich, then came back just to finish writing and defend. Look for opportunities to be in residence somewhere else, and do what you can to make it happen. I was also honest with my PhD advisor that I really couldn't stand living where I was, so he helped me put the funding together and helped me work out the logistics with our collaborator.", "author": "boilerlashes", "created": 1632271316, "upvotes": 26}, "hds7gd1": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hds7gd1/", "text": "I got accepted several places with a good offer, but my partner was only willing to move to one of them, and I agreed. Most of them were college towns with no added allure - that would have driven us both insane, no matter how good the program. The way we saw it, relocating for 5+ years was no joke: it's a good chunk of life. Post-graduation, we'll decide based on location first, academia second.", "author": "odesauria", "created": 1632268465, "upvotes": 4}, "hds6bqo": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hds6bqo/", "text": "Every place has good and bad things about it. If you’re anything like me, you’ll be too busy with grad school to really notice where you are.", "author": "HouseNegative9428", "created": 1632267934, "upvotes": 3}, "hds5w6d": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hds5w6d/", "text": "I didn’t envision being in this city for this long, I’m in the same place I did my undergrad and teched. It’s a big city but I imagined I’d have gone somewhere else by now, and am planning to do so when I do a postdoc.", "author": "jlpulice", "created": 1632267729, "upvotes": 1}, "hds3m0x": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hds3m0x/", "text": "I love where I am now. I hated where I was for my MA, but this little college town I’m in now is absolutely perfect for me.", "author": "HistoryCat42", "created": 1632266661, "upvotes": 2}, "hdrvokt": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdrvokt/", "text": "I'm lucky. My program is online, designed for people already working in the field. I am SO grateful because I also work full-time.", "author": "CupcakeRiot", "created": 1632262950, "upvotes": 5}, "hdruiqu": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdruiqu/", "text": "I live in a small town. \n\nI'd love to live in the closest major city, literally in the downtown areas, but that's not happening.\n\nIt kinda sucks initially but I've started recognizing (and appreciating) the local area some more.  I enjoy the nature aspect of it.  How close the trails are.  How easily I have access to the local rivers, while also having some great local breweries here.  Yeah there's no night clubs here nor big stars coming to throw on a concert, but it has it's own charm.\n\nI think the best way is to look at the opportunities it offers instead of what's missing.  I wish there was a cubano place nearby but instead I get a pretty great Texas-style BBQ place.  I'd love a place to go for Ethiopian food, but I'll settle for a great Banh-mi place.", "author": "HalfEatenPie", "created": 1632262420, "upvotes": 11}, "hdru630": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdru630/", "text": "I’m in a city that I thought I would love, but turns out it’s not really my vibe. So I think it’s hard to know how you’ll feel about a place unless you’ve already spent time there. I’m okay with it because there are things to enjoy in most places and there’s no guarantee I’d be happier in the other programs that accepted me.", "author": "lkr01", "created": 1632262260, "upvotes": 26}, "hdru3ik": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdru3ik/", "text": "Indiana, fairly boring. But hey, it keeps me focused on what I need to.", "author": "Dismal-Wallaby-2", "created": 1632262227, "upvotes": 34}, "hdronpw": {"link": "/r/GradSchool/comments/psrhxr/how_do_you_feel_about_the_location_you_are_forced/hdronpw/", "text": "I live in Alberta and it fuckin sucks. Im surrounded by a bunch of conservative truck driving assholes.", "author": "redditknees", "created": 1632259801, "upvotes": 16}}}