{
  "sid": "pkgsr5",
  "link": "/r/GradSchool/comments/pkgsr5/recently_became_selffunded_feeling_resentful/",
  "title:": "Recently became self-funded. Feeling resentful because I am not receiving funding from supervisor but I am still responsible for supervising/ teaching undergraduate students in our lab. Thoughts?",
  "text": "I recently acquired a large amount of funding to finish my PhD. Normally, I receive funding from the department (GAA), my supervisor (GRA), and through teaching assistantships (GSTA). Since receiving the scholarship, both my supervisor and department stopped allocating me GRA and GAA funding. I make no more than I did prior to the scholarship but I do benefit from not having to worry about forms getting signed and missing a pay. Lately, I've been feeling a bit resentful and wanted to see what people's thoughts were on this current issue. Maybe someone can make me think of things a little differently.\n\nOur research group generally takes on 4-5 undergrads per year and the graduate students in our lab are in charge of supervising, helping with reactions, and teaching them lab techniques. A handful of graduate students in our group just graduated so there is currently only 2 graduate students (including myself) in charge of supervising 5 undergraduates - so its quite a bit of work. I used to have no issue with this since my supervisor was contributing to my funding, but now that my supervisor has cut off my funding, I feel like I am working for free when I could be finishing up my own research. \n\nAm I in the wrong for feeling like this? Should I bring this to my supervisors attention? Or am I just looking for trouble?",
  "author": "fabledpreon",
  "created": 1631127418,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hc3y42w": {
      "link": "/r/GradSchool/comments/pkgsr5/recently_became_selffunded_feeling_resentful/hc3y42w/",
      "text": "I disagree with the other commenters here, depending on where this money is coming from. First, it doesn't sound like you're self-funded (from a personal connection, charity, or your own pocket), but if you were, then you should be able to negotiate a different setup.\n\nBut rather, it sounds like you're funded from a scholarship paid to the university (if not, who's paying your tuition? who pays for your equipment?). Is that scholarship from the university? Or from a foundation? From a federal agency? If it's from any of these, they're paying to the university to fund you for a Ph.D. under an advisor's guidance.\n\nSo you get to choose the advisor/lab for your Ph.D., and it sounds like mentoring is part of this lab/advisor, so you'd have to choose a different lab where that's not part of the setup, if you don't want to do that.",
      "author": "dr-dead-inside",
      "created": 1631137395,
      "upvotes": 4,
      "replies": {
        "hc42p8y": {
          "link": "/r/GradSchool/comments/pkgsr5/recently_became_selffunded_feeling_resentful/hc42p8y/",
          "text": "Perhaps saying “self-funded” was incorrect. To clarify, I applied and received a federal scholarship. I had the option to take it anywhere but stayed at the institution I was already enrolled at.\n\nMy tuition is deducted from my funding/ scholarship. Equipment and materials are paid for by my supervisor/ university - which I understand is a *healthy* amount of money.. \n\nMy supervisor does tend to take on a lot of undergraduates and it is generally the responsibility of the graduate students to mentor. However, my supervisor pays them (as he/she did me prior to the scholarship) X amount of dollars a semester to help pay tuition etc.",
          "author": "fabledpreon",
          "created": 1631139551,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hc3ss5b": {
      "link": "/r/GradSchool/comments/pkgsr5/recently_became_selffunded_feeling_resentful/hc3ss5b/",
      "text": "> Should I bring this to my supervisors attention?\n\nYour choice on whether or not it’s worth it. Your advisor/supervisor/whatever usually has a lot of (way too fucking much, actually) power over when you’re able to defend and finish up.\n\nAre you right to resent it? Yes. You are working for free. However, you’re basically doing that anyway as a grad student since being “self funded” or funded by a professor or whatever is the equivalent of the university taking a gigantic chunk out of the pay you’re supposed to get while you do all the work that they get to extract credit from all so you can get a piece of paper at the end of it, so the entire financial situation of grad school is one of resentment for me.\n\nBut if you’re willing to risk it becoming an issue affecting your graduation date then go on and tell your advisor.",
      "author": "happily_masculine",
      "created": 1631134875,
      "upvotes": 3,
      "replies": {
        "hc40hva": {
          "link": "/r/GradSchool/comments/pkgsr5/recently_became_selffunded_feeling_resentful/hc40hva/",
          "text": "Oof. You are likely right, it may be more trouble than it is worth. I hate feeling like my hands are tied behind my back and having to just roll with the “grad school” punches. I’d love to speak up but there’s the lingering fear of being chastised for it.",
          "author": "fabledpreon",
          "created": 1631138504,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hc3kocx": {
      "link": "/r/GradSchool/comments/pkgsr5/recently_became_selffunded_feeling_resentful/hc3kocx/",
      "text": "No you are not wrong for resenting having to do a ton of work without compensation lol. Your supervisor will probably not be a huge fan of you having an issue with this, but how consequential will it be to you finishing your degree? \n\nYou should consider talking to your supervisor as an initial (if potentially futile) option, and then explore what your options are to contest or escalate above them.",
      "author": "SteamingHotChocolate",
      "created": 1631130931,
      "upvotes": 3,
      "replies": {
        "hc43xcd": {
          "link": "/r/GradSchool/comments/pkgsr5/recently_became_selffunded_feeling_resentful/hc43xcd/",
          "text": "Yeah, I can’t see it going over super well with my supervisor. It would be a hard conversation.. I hate how bringing up a concern/ opinion (whether right or wrong) may have a detrimental effect on my degree timeline.",
          "author": "fabledpreon",
          "created": 1631140138,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064935
}