{"sid": "n3za29", "link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/", "title:": "Remember to take time to reflect on how far you’ve come :)", "text": "The past year has been difficult for many reasons and we are still very much in a pandemic but what helps me is taking a few moments to reflect how far I’ve come over the past few years.  \nRight now I’m in the 4th year of my PhD and I can see the light at the end of the tunnel even though it’s still a bit distant but I am amazed by how much I have learned throughout this process.  \nIt doesn’t matter if you are finishing up undergrad, in a Masters program, or doing a PhD you have been working for years toward your goal and making small progress each week that will compound into something much greater. \nHang in there and don’t be too hard on yourself. You can only do so much each day and a little everyday is all you need anyways. \n\nHope everybody has a great week and finds a moment for rest and reflection!", "author": "Apprehensive_Crow500", "created": 1620056491, "retrieved": 1632953873, "over_18": false, "upvotes": 390, "upvote_ratio": 0.99, "comments": {"gwwmdgk": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwwmdgk/", "text": "Thank-you for this. Sometimes I like to go through old emails from years ago or old to-do lists just to remind myself of what I’ve accomplished and that some day the things I’m struggling with now will be a distant memory.", "author": "Emotional-Apricot289", "created": 1620135926, "upvotes": 2}, "gwvrbp6": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwvrbp6/", "text": "How far I've come is precisely my problem!!!!!", "author": "Scorpionfigbter", "created": 1620113839, "upvotes": 3}, "gwv3wsd": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwv3wsd/", "text": "This was nice to read as I am so currently a 4th year. I catch myself proud of all I’ve accomplished and feel a sense of dread at the end of my phd years arriving in 2 years with no clear plan after. This was very up lifting and helped me snap out of this spiral. Thank you.", "author": "taki_sensei", "created": 1620097189, "upvotes": 2}, "gwuvgw4": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwuvgw4/", "text": "I just had the worst day of finals ever and I think I failed an essential class, putting my undergrad graduation back AGAIN (meaning this go-back-to-school-at-25 degree will take 6 years plus). This was the most encouraging thing I could read. Thank you, friend.", "author": "brrsocold", "created": 1620092873, "upvotes": 2}, "gwurzhy": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwurzhy/", "text": "I've been waitlisted to a master's program that I really wanted to get into. I was bummed out and still kind of am but I thought my application was absolute dog shit so I'm not too far off the mark I think. So I'll take this as a win.", "author": "LeeroyDankinZ", "created": 1620091186, "upvotes": 2}, "gwuqe8g": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwuqe8g/", "text": "I've had a freaking TIME of it in this PhD, but over the past year I've competed 4 draft chapters and secured a final year of funding. \n\nIt's been easy to feel obliterated by the terrible year we've all endured, but when I compare myself now to where I was at this point a year ago, I'm strangely uplifted.\n\nFinal push! I'm so burned out lol", "author": "Jack-ums", "created": 1620090410, "upvotes": 2}, "gwu6fzi": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwu6fzi/", "text": "Thank you this was definitely what I needed to hear. I turned in my last assignments for my masters today so I am officially done!! I’ve had the WORST grad school experience and didn’t accomplish any of my goals. While it may not seem like I accomplished anything I have to remind myself that I made it and I’m gonna get that diploma!!!", "author": "foodgeek19", "created": 1620080869, "upvotes": 2}, "gwu2uaq": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwu2uaq/", "text": "Right now I am literally in my last quarter and I am about to take my masters comprehensive exam this month. Tbh I am surprised that I have made it this.", "author": "digitad3", "created": 1620079171, "upvotes": 2}, "gwttajn": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwttajn/", "text": "Congrats on your Ph.D.! I am finally done with Grad school ( two masters ), and after all of the things and sleepless nights I went through/had, I always ask people to reconsider whether grad school is really for them or not.  😭😅", "author": null, "created": 1620074946, "upvotes": 2}, "gwtqb6y": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwtqb6y/", "text": "I needed this. Thank you. Between my fourth and (current) fifth years I put together a committee, got my proposal approved, and did my written comps, and I still have the oral exam left to go (this Friday! \\*gulp\\*) before I can say I'm a PhD ABD. (assuming I pass orals)   \n\n\nI've been so overwhelmed doing all these exams while teaching and looking for funding and arranging my spouse's immigration and helping with my sister's wedding that I guess I haven't had time to reflect on how far I've come since a year and a half ago, especially during the pandemic. I need to take that time and I think I will Friday afternoon when my oral exam is over (for better or for worse). Thanks for reminding me to stop and smell the roses.", "author": "CarrotGratin", "created": 1620073635, "upvotes": 4}, "gwte3o0": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwte3o0/", "text": "Thank you for this!! I'm finishing my Master's now and it did not go at all how I expected or hoped in some ways, but I am so proud of what I've done and the momentum I've accumulated as I go onwards. This is such a nice post to see on a Monday morning, thank you!!", "author": null, "created": 1620068335, "upvotes": 16}, "gwtct33": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwtct33/", "text": "Funny enough, I was filling out my program's year in review paperwork this morning. I didn't wrap up all the things I wanted to (or much at all, honestly), but I still accomplished a lot, especially considering what has been going on.", "author": "gibs95", "created": 1620067788, "upvotes": 6}, "gwt5wh1": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwt5wh1/", "text": "Was just thinking about this earlier today, in the upcoming Fall term I’ll be half way done with my Masters 🙂", "author": "Jaso1n1", "created": 1620064901, "upvotes": 24}, "gwsxoay": {"link": "/r/GradSchool/comments/n3za29/remember_to_take_time_to_reflect_on_how_far_youve/gwsxoay/", "text": "Great uplifting note :)", "author": "EnvironmentalCar4959", "created": 1620061480, "upvotes": 11}}}