{
  "sid": "jsqpcb",
  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/",
  "title:": "The cult of relationships",
  "text": "I’m currently in my 3rd year of grad school, working towards the PhD, and I don’t know if anyone else feels this but I have to vent about the cult of relationships. Never in my life have I felt so down and out about being single because almost everyone in my program has a long term partner or is married. I also feel that being in a grad program makes dating seem impossible and if it even is possible then you can’t seem to find someone to fit that right motion of your life/your wants/your schedule/your plans. All of the married grads I know constantly say things like, “oh I worked all day and then X made my favorite dinner, it was so great!” Yeah I know relationships can be difficult but that’s not the vibes I get from these people. On top of this they get family housing with the university while us singles get shafted after 2 years. And now with the pandemic it has been completely impossible to meet anyone/even dream about the possibility. Am I alone in this?",
  "author": "onetwoxyou",
  "created": 1605167343,
  "over_18": false,
  "upvotes": 288,
  "upvote_ratio": 0.93,
  "comments": {
    "gc95bj8": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc95bj8/",
      "text": "I'm pretty sure this thread is a sausage fest.",
      "author": "STEM--Celibate",
      "created": 1605363426,
      "upvotes": 1,
      "replies": {
        "gc95sqc": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc95sqc/",
          "text": "I’m pretty sure this is irrelevant.",
          "author": "onetwoxyou",
          "created": 1605363764,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gc4fb41": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4fb41/",
      "text": "I feel the same (2nd year Phd student). It's hard to start a relationship when we have *so much stuff* to do. And then half of it doesn't even make sense to people outside of academia so trying to explain it feels impossible. At the same time you want to meet someone because like, everyone else has someone. It's a frustrating place to be. I feel you.",
      "author": "macearoni",
      "created": 1605241089,
      "upvotes": 2,
      "replies": {
        "gc4qzpb": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4qzpb/",
          "text": "Thank you for the solidarity. To some a single life seems like a perfect place to be, but having been here for many years, the grass does look greener on the other side.",
          "author": "onetwoxyou",
          "created": 1605249920,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc43crp": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc43crp/",
      "text": "In my graduate school class of 28 people, I was one of two single people. Everyone else was married or had a long term partner, like you said. To be honest, I didn't hate it. The vibe I got from my classmates wasn't the vibe you're getting. I felt like their lives revolved around their partners. I would ask someone to get a drink after class or meet up last minute on a weekend to study and their response constantly revolved around \"asking\" their partner, etc. I was actually super turned off that the majority of us were only in our mid twenties and had already lost our sense of spontaneity and to me, they felt \"settled.\" Don't get me wrong- there is nothing wrong with feeling comfortable and settled... but in my twenties, that did NOT appeal to me. I spent long weekends traveling or backpacking with other friends outside of the program, while they were at home taking care of newborns and sleep deprived (again- nothing wrong with this, just not what I wanted at the time, ESPECIALLY in an intense grad program). Now that I am more domesticated living with my partner (4 years out of school), I am even more happy that I spent that decade of my life being selfish and focusing on myself and doing whatever I wanted. My point is- it's not always rosey and nice on the other side.\n\nThe pandemic adds an interesting twist though- I am sure it feels incredibly isolating to even be meeting people right now just seeking friendship. It's always good to try and discover hobbies that aren't as affected by COVID! :) That's helped me a ton these past seven months.",
      "author": "artichokefan",
      "created": 1605234151,
      "upvotes": 3,
      "replies": {}
    },
    "gc424ms": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc424ms/",
      "text": "No you're not alone. I was actually coming to this subreddit to ask how grad students go about dating.\n\nI'm 25yo, who started a master's program this year, and I fully intend on getting a PhD. I never dated before and feel lonely, and would really like to get into it. But, for the first few months, it felt like a huge adjustment to my assistantship. Next year, I'll have to do practicum, and I don't know how I'll juggle classes, practicum, and the same assistantship again.",
      "author": "bgmathi5170",
      "created": 1605233467,
      "upvotes": 1,
      "replies": {
        "gc4qu9j": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4qu9j/",
          "text": "I wish I had some advice to give but obviously I’m in the same boat. I finished my MA recently as well and found no solution to this either, so in solidarity with you there.",
          "author": "onetwoxyou",
          "created": 1605249784,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc3kl6b": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3kl6b/",
      "text": "I'm the only single one in my cohort, the youngest, and the only one that lives alone. I feel you, OP. \n\nI'm trying to make the most of it. No kids? No husband? Work your ass off in any way you please! As much as you please! The time will come for us. We don't stop growing and chasing that degree just because no one is on the journey with us. We'll be better off when we do meet them!",
      "author": null,
      "created": 1605223390,
      "upvotes": 3,
      "replies": {
        "gc4qqvj": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4qqvj/",
          "text": "Thank you for being so positive. Sending lots of positive thoughts your way.",
          "author": "onetwoxyou",
          "created": 1605249703,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc39tpx": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc39tpx/",
      "text": ">almost everyone in my program has a long term partner or is married\n\nSame here, it's pretty depressing especially when they go on about how tough they have it and yet they get to go home to a loving partner while I just sit in the fucking dark.",
      "author": "Matthew94",
      "created": 1605217821,
      "upvotes": 2,
      "replies": {
        "gc45zd1": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc45zd1/",
          "text": "Exactly. I understand that relationships can be difficult and hard to maintain but at the end of the day you have someone to lean on, so I have no pity for those who say it’s difficult.",
          "author": "onetwoxyou",
          "created": 1605235648,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gc2xyl8": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2xyl8/",
      "text": "I’m in my second year of my program and I definitely see what you mean. Every girl I talk to is in a relationship, but honestly it doesn’t bother me because of my old coworker. He got into a relationship during his time as a master’s student, and then was married with children halfway through getting his PhD. He told me one time how having kids added years to his time as a student, and he still thinks that he could’ve accomplished so much more if he waited to have kids. He’s the one who convinced me not to get married before I’m finished being a student. If you have a goal you should be doing everything you can to accomplish that, everything else can wait.",
      "author": "MrDelaware17",
      "created": 1605212096,
      "upvotes": 1,
      "replies": {}
    },
    "gc2wn8l": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2wn8l/",
      "text": "I bet a lot of that is sugarcoated.  Ain’t all of their relationships happy and jolly! Somebody’s lying.",
      "author": "apl2291",
      "created": 1605211472,
      "upvotes": 1,
      "replies": {}
    },
    "gc2r06s": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2r06s/",
      "text": "What they don’t talk about are the arguments people have with their SO. They only share (or even make up) the nice stuff. Don’t believe this crap! Also join a social group on campus if there is one.",
      "author": "mstalltree",
      "created": 1605208791,
      "upvotes": 3,
      "replies": {}
    },
    "gc2mpig": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2mpig/",
      "text": "Try not to be too hung up on it!\n\nI think grad school can be great as single. It is a great time to find yourself, engage in your interest in your field. Try to make the most of the place in life that you are in now\n\nWhen I started doing my PhD, I was single and not even dating - by the end of it I was engaged and we had a baby! Things can happen fast... \n\nnow I think back to the time when I could endulge myself in analysis or reading for whole days and nights. I sometimes miss those days bad - grad school is different for everyone, but try to see where you are, how you can spend the time to develop the most - your future self will thank you!",
      "author": "LionDoctor123",
      "created": 1605206809,
      "upvotes": 2,
      "replies": {}
    },
    "gc2ld95": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ld95/",
      "text": "I feel you, I’ve been in grad school 3 years now...  I am single mom and have had to work full time for the first 1.5 years and part time for the last 1.5 years...I haven’t even had time to think about dating since 2016. I’m just completely exhausted at the end of the day and have nothing to give to another person. I’ve just been thinking of it as another season of life for me- first comes taking care of my son, then working and going to school 🤷‍♀️ I just know it’ll all be worth it someday, and I’ll be in a better space, mentally and financially, and have time to give to someone else one day, but I just can’t right now. Its possible to do it alone, but also ok to miss the relationship aspect. I tell myself all the time, ‘it won’t be busy like this forever’ even though it can feel like that at times. You got this!",
      "author": "ck-dearie",
      "created": 1605206294,
      "upvotes": 2,
      "replies": {
        "gc38dlw": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc38dlw/",
          "text": "Thank you for this. You’re doing such hard and challenging work just living life so major kudos to you. I also wanted to thank you for essentially stating that it’s okay to miss having someone there to lean on, as I feel some of these replies have undermined that.",
          "author": "onetwoxyou",
          "created": 1605217108,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gc2ia11": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ia11/",
      "text": "[deleted]",
      "author": null,
      "created": 1605205094,
      "upvotes": 5,
      "replies": {
        "gc386vg": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc386vg/",
          "text": "I agree, some people on here saying “just go on a few dates!” seem to really underestimate the difficulty of finding someone you’re interested, whose interested in you, and then to actually be okay with going out into a covid world to meet a rando person. My state isn’t doing so hot and I’m immunocompromised so that is zero help to simplify such a difficult and challenging process.",
          "author": "onetwoxyou",
          "created": 1605217017,
          "upvotes": 2,
          "replies": {
            "gc3gc5m": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3gc5m/",
              "text": "I have never understood the \"just go on a date\" mentality at all.  For all the reasons you stated, finding a potential partner is really effing difficult.  Being a grad student on top of that doesn't help - you're in a different place in life by pursuing higher education.   \n Being a grad student in a relationship is also really difficult - the types of time commitments required of you are hard to manage while juggling someone else in your life (unless they're somehow, miraculously, also a grad student like you, but honestly even then).  \n\nI can agree with the people arguing how much freedom you have as a single grad student - there's no worry about having to decide between or juggle meeting a deadline and spending time with your SO because you haven't seen them in a few days....or arguing over it.  BUT it also means a lack of a close, personal support to keep you sane.  The others go home to their SOs and/or their kids, and you feel like the one person who has no one to go home to or unwind with or just talk deeply to, and it absolutely sucks.  \n\nI'm rambling unhelpfully at this point, but my point is that you're definitely not alone \\[especially in this COVID world\\].  Find some way to build up a support network for yourself.  Reach out to your classmates and friends - at least to fight the mind-numbing feeling of loneliness \\[honestly, even the married ones might be more than a little sick of being around their spouse and kids 24/7 and might welcome a hangout or online movie night or something\\].  And despite what I said earlier, it's definitely possible to meet someone while in grad school.  Sure, COVID kinda makes things difficult, but it's not impossible.  Does your school or department offer any kinds of online events or more casual discussion groups (e.g. through grad student organizations or the like)?",
              "author": "apdsqueaky",
              "created": 1605221143,
              "upvotes": 4,
              "replies": {
                "gc3jpu7": {
                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3jpu7/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1605222936,
                  "upvotes": 1,
                  "replies": {
                    "gc3mke2": {
                      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3mke2/",
                      "text": "True, a large percentage of grad students are foreign, at least from the 2 schools I've been at for grad programs.  I did appreciate the opportunity to learn about other cultures, though, and I tried to make some effort to talk to them after class, so I was able to make some friends with the foreign students anyway.  Often times they tend to be clique-y because they're feeling just as ostracized by a foreign culture.  I don't think the size of the city makes a huge difference - I was in a major city and still experienced the same thing.\nI admittedly gave up on the relationship aspect - I had too much baggage from a previous relationship, and masters programs are too short anyway, after which everyone scatters.  I was just looking for camaraderie and support.  I don't think you can really have a relationship if you can't take care of the first part first, anyhow.",
                      "author": "apdsqueaky",
                      "created": 1605224464,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gc2hm75": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2hm75/",
      "text": "I know others may disagree and COVID is an awful thing, but you still need to find some degree of responsible happiness. If that means dating then date, go on a date every 2 weeks if you have the time (sort of quarantine between dates period). My therapist has told me multiple times you didn't do anything wrong so don't treat yourself like you're a prisoner. Don't let you get in your own way of happiness, you still are able to go out and meet people, you just have to tone down the frequency (which sucks) but this doesn't mean make it zero!",
      "author": "crystal_math1",
      "created": 1605204838,
      "upvotes": 2,
      "replies": {
        "gc2wxxs": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2wxxs/",
          "text": "Please smash with a mask on!",
          "author": "apl2291",
          "created": 1605211616,
          "upvotes": 6,
          "replies": {
            "gcjstvq": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gcjstvq/",
              "text": "Also this, do this too. It'll feel normal at this point I'm sure",
              "author": "crystal_math1",
              "created": 1605567458,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gc2gteq": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2gteq/",
      "text": "No one wants to talk about the bad times with their SOs, especially if you aren't close with the other person you are talking to.\n\nJust like social media, you only see the positives of people's lives",
      "author": "Imyouronlyhope",
      "created": 1605204529,
      "upvotes": 4,
      "replies": {
        "gc3aapt": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3aapt/",
          "text": "If relationships weren't a net positive then people wouldn't be in them.",
          "author": "Matthew94",
          "created": 1605218052,
          "upvotes": 3,
          "replies": {
            "gc3dp2t": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3dp2t/",
              "text": "I'd argue that there are exceptions for abusive relationships and plenty of married couples staying together for the kids. Otherwise yes",
              "author": "Imyouronlyhope",
              "created": 1605219768,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gc2e43s": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2e43s/",
      "text": "I 100% agree with this! As someone doing grad school online full time while also working full time I definitely feel like dating is impossible. I don't know if anyone else has experienced this but, whenever I try to vent about having no free time/how frustrating it is when I make free time for a date or friend I get responses like oh, well I did x, y, z to get where I am so you can't complain.",
      "author": "Material_Molasses720",
      "created": 1605203440,
      "upvotes": 3,
      "replies": {
        "gc4r33p": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4r33p/",
          "text": "Yes I agree. Some of the responses here seem to undermine the feeling of loneliness like it’s a weakness or something to be ashamed about. We’re human, aren’t we????",
          "author": "onetwoxyou",
          "created": 1605250004,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc2c53h": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2c53h/",
      "text": "Maybe I’m missing your point here but it sounds like you are lonely and bitter and jealous of people’s relationships so you are calling it a cult because those people dare to talk about their relationships around single people? I just can’t believe how much people who are unhappy hate seeing other people happy. You’re bitching that people dare talk about their personal lives around you and it bothers you that they have the love and support of their partners while you don’t? I understand feeling lonely, believe me I’ve been there for most of my program, but I have NEVER in my life looked at my peers being happy as somehow an attack on me.",
      "author": "fvckyoudad",
      "created": 1605202509,
      "upvotes": 1,
      "replies": {
        "gc4r5aq": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4r5aq/",
          "text": "You’re right, you are missing my point.",
          "author": "onetwoxyou",
          "created": 1605250059,
          "upvotes": 3,
          "replies": {}
        },
        "gc2ovgy": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ovgy/",
          "text": "For those who are reporting replies to the mod, for chrissake, don't do that just because you disagree with what someone said.",
          "author": "frugaldutchman",
          "created": 1605207778,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gc2c4tc": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2c4tc/",
      "text": "I live in a smaller town very far away from bigger cities and it seems everyone is married here! And dating is impossible right now. I share your pain.",
      "author": "quejueguelamusica",
      "created": 1605202505,
      "upvotes": 2,
      "replies": {}
    },
    "gc255jb": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc255jb/",
      "text": "God, so true. And to take your vent in a slightly different direction, I find that people respect your time a lot more when you're in a relationship. Being single + having a \"flexible\" grad student schedule = everyone thinks they can pencil you in wherever, because you never have any \"real\" plans, either with another person (relationship) or in terms of work (because you can set your own hours).",
      "author": "girlscout-cookies",
      "created": 1605199234,
      "upvotes": 12,
      "replies": {
        "gc4ra5y": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4ra5y/",
          "text": "Agree. It gets very frustrating having to constantly explain how a grad school schedule works.",
          "author": "onetwoxyou",
          "created": 1605250177,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc24c8g": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc24c8g/",
      "text": "Not to mention that if you date someone outside of academia, they are unlikely to understand why you make so much less than them",
      "author": "hellokoalaa",
      "created": 1605198833,
      "upvotes": 21,
      "replies": {
        "gc2b6kd": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2b6kd/",
          "text": "Well to be frank, it's because we've all made terrible life decisions lmao.",
          "author": "RagePoop",
          "created": 1605202061,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "gc234h4": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc234h4/",
      "text": "We are both in PhD programs in different programs at schools in near by cities.",
      "author": null,
      "created": 1605198260,
      "upvotes": 1,
      "replies": {}
    },
    "gc22xgj": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc22xgj/",
      "text": "[deleted]",
      "author": null,
      "created": 1605198167,
      "upvotes": 10,
      "replies": {
        "gc26q2g": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc26q2g/",
          "text": "No one in my program wants to socialise. My cohort ignores all my attempts to try to initiate game nights, hikes, virtual hangouts, etc. I feel like I'm back in high school when I was the loner loser. It's depressing.",
          "author": null,
          "created": 1605199982,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "gc220vb": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc220vb/",
      "text": ">  And now with the pandemic it has been completely impossible to meet anyone/even dream about the possibility. Am I alone in this? \n\nYou are not alone friend. I've been trying to use the pandemic to focus on myself but I'm about ready to get back out there.",
      "author": "balderdash9",
      "created": 1605197733,
      "upvotes": 4,
      "replies": {}
    },
    "gc1yk97": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1yk97/",
      "text": "I am currently in masters program and I am married. I spend most of my day 8-12 hours on campus doing reading and writing for my program. This has been arguably the hardest thing I’ve done for my marriage. My wife is upset because she never sees me. I always take one day off every week to spend it with her but still she’s is always annoyed with me. I also try to make dinner every night and do the dishes either every couple of days. So I guess what I’m saying is it’s not all great being in a relationship during graduate school. There are benefits but right now it’s just been hard as hell for our relationship.",
      "author": "xsamx435",
      "created": 1605196057,
      "upvotes": 8,
      "replies": {}
    },
    "gc1wxqt": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1wxqt/",
      "text": "I'm more than willing to give my time and energy to someone else but it figures that the people I'm attracted to are actually in love with themselves and their own work. It's easy to grow self-absorbed in grad school if you don't already have relationships to maintain. Trying to date non-academics is also painful cause they never seem to understand. \n\nAnyway I've given up and I have no interest in knowing how my cohort is doing with their long-term relationships either. Let them do their thing. What's awful is that the self-esteem hit has creeped into all aspects of my life and I don't even have the energy for professional networking anymore either :(",
      "author": "LiquidEther",
      "created": 1605195266,
      "upvotes": 8,
      "replies": {
        "gc4rmec": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4rmec/",
          "text": "I very much share the self-esteem hit. We’re all human, we’re not perfect and anyone who doesn’t understand that is very narrow minded IMO.",
          "author": "onetwoxyou",
          "created": 1605250476,
          "upvotes": 2,
          "replies": {
            "gc5ih20": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc5ih20/",
              "text": "Thank you.",
              "author": "LiquidEther",
              "created": 1605276309,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gc1qu02": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1qu02/",
      "text": "I feel this because most people in my program have significant others that followed them to the program and people I know who are single are way better at finding relationships than I am. However, I'm the happiest being single that I've ever been! I don't have time or emotional energy to devote to a dude right now and I'm good at spending time with myself. It kind of sucks to be the odd wheel when hanging out with people, but I think it's weird when people can't go anywhere without their SO.\n\nProbably the biggest thing for me is I don't fit in well with the culture of my city. I live in a small city in the Northeast that's super outdoorsy and a little crunchy and while I enjoy it alright, I've pledged to myself to never live in a city with less than a million people in the metro area again. But the thing is, most people out of college here want to *stay* here and will get super defensive even if I'm trying to be nice about it, like \"yeah this city isn't really my style.\" I'm also tired of being asked to go on hikes for first, second, third, etc dates. That's great for some girl but that girl isn't me. \n\nPlus, looking back at my relationships before, it's never really been worth it when I've forced it. All the times I've looked for love, I ended up unhappy and I've gotten to the point where I'm like it'll happen when it happens and I just don't care right now. I have bigger goals in life.",
      "author": "KiwiTheKitty",
      "created": 1605192077,
      "upvotes": 15,
      "replies": {
        "gc1wkyu": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1wkyu/",
          "text": "when people cant spend time without their SO i just feel like 'damn, aren't you an adult?'",
          "author": "Bonzwazzle",
          "created": 1605195089,
          "upvotes": 10,
          "replies": {
            "gc26fqf": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc26fqf/",
              "text": "I'm in a relationship and I feel the same. We love being with each other but we're also very independent. We need to be able to do our own thing. I'm glad that he isn't constantly glued to me.",
              "author": null,
              "created": 1605199847,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gc1lk7x": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1lk7x/",
      "text": "Give it 10 years and most married people you know will be miserable.",
      "author": "DianeSucks",
      "created": 1605189025,
      "upvotes": -26,
      "replies": {}
    },
    "gc1l9pf": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1l9pf/",
      "text": "It's funny because I feel the complete opposite.  I'm recently engaged and I feel like iy Ph.D. would be easier if I was single.  Sure I would have to cook all the dinners instead of 50\\~%, but I feel like I would have more time to be productive and feel like single students in the program get ahead that way.  Additionally, I know almost no one in my cohort. They're all single and seem to stick together in that manner.  The pandemic has made it impossible for me to make other friends with more mutual interests outside of academia.\n\nI don't think you're wrong, I just think both sides have their own issues.  The housing thing just sucks though, they all love to shaft grad students on housing don't they",
      "author": "idk_witty_username",
      "created": 1605188843,
      "upvotes": 4,
      "replies": {
        "gc4rs6j": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4rs6j/",
          "text": "I do think both sides have their merits, the grass is always greener over there isn’t it?\nAnd 100% yes on the housing.",
          "author": "onetwoxyou",
          "created": 1605250621,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc1d80h": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1d80h/",
      "text": "It's funny how, on these subs, we always find someone else who has had the exact same experience as you. It's comforting in a way. I'm in my 4th year and I've been feeling the same from last year. During the first two years of coursework I could somehow accommodate some casual relationships in my schedule,but have been mostly single and quite happily. But 3rd year onwards, I've had to actively avoid relationships as many of them were from other programs who couldn't understand my schedule. On the other hand, a large number of people in the Doctoral programme are already in various kinds of long term relationships. This feeling of loneliness has slowly crept up on me and now with the pandemic, any possibility of meeting new people is extinguished. It does make me feel a bit hopeless from time to time.",
      "author": "requiem050410",
      "created": 1605182890,
      "upvotes": 33,
      "replies": {
        "gc23e9m": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc23e9m/",
          "text": "I feel the same. I try to remind myself that this is temporary. It doesn't make me feel less lonely, but it motivates me to stick it out.",
          "author": "balderdash9",
          "created": 1605198387,
          "upvotes": 3,
          "replies": {
            "gc2rwj6": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2rwj6/",
              "text": "It's funny that this too shall pass is such old advice and still applicable today. \n\nAnd while it's still good advice it definitely hits differently depending on where you're at in your journey. Sometimes it's the last thing I want to hear but other times it's a comfort.",
              "author": "johonnamarie",
              "created": 1605209220,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gc4ry0s": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc4ry0s/",
          "text": "It definitely is comforting to hear that others are having similar experiences. My department is quite small so it’s nice to hear from others. I think the pandemic has heightened a lot of feelings for myself and it seems others, loneliness heavily included.",
          "author": "onetwoxyou",
          "created": 1605250766,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc194ra": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc194ra/",
      "text": "[deleted]",
      "author": null,
      "created": 1605178835,
      "upvotes": 64,
      "replies": {
        "gc1nlzu": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1nlzu/",
          "text": ">The most obvious thing is that you really like this person and enjoy spending time with them, which can easily cut into your “work” time, especially when we’re all working from home.\n\nI'm going to gently push back on this. Grad school, and academia, is notorious for creeping in and taking over your every waking moment. This is actually a terrible and unhealthy thing and the expectation creep it facilitates both within individual labs and within academia in general is absolutely awful.\n\nA relationship SHOULD help you to set limits on what academia can ask of you and SHOULD motivate you to defend your time. That is healthy both for you as an individual and for academia in general.",
          "author": "tchomptchomp",
          "created": 1605190260,
          "upvotes": 58,
          "replies": {
            "gc1t6h7": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1t6h7/",
              "text": "Partially, but also the nice thing about grad school is having work flexibility. I used to be most productive from 8am-12pm would do chores and errands in the afternoon and work from 7-10pm. However, since my husband has a job with 9-5 hours, if I want to spend time with him, I basically also am forced to work those hours.",
              "author": "sugarbebe23",
              "created": 1605193340,
              "upvotes": 2,
              "replies": {}
            },
            "gc2gacx": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2gacx/",
              "text": "very much in agreement on this. I started seeing someone the same week I started my PhD and both of us are slow, deliberate daters who abhor co-dependence. Blocking one night off a week for a date really helped structure my time and now that's it's more like 1-2 nights and mornings a week I am happy to skim a chapter or two of reading I would otherwise have noted extensively and hold off on extra-curriculars til first year courses are done. the time with her is way, way better for my morale. and it gives me something to think/talk about with friends other than work, for which everyone in my life is supremely grateful lol",
              "author": "greynecessities",
              "created": 1605204322,
              "upvotes": 4,
              "replies": {
                "gc3ij8k": {
                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3ij8k/",
                  "text": "Yes, I think part of our problem is that we live together and so went through the honeymoon phase in the same house. Hard to set one date night or specific times when you see each other all the time no matter what and share a fridge.",
                  "author": null,
                  "created": 1605222313,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gc1cvjn": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1cvjn/",
          "text": "I feel you on that part of dating someone not in grad school. If they've never done it, it been be hard to appreciate your schedule, how it can change last minute, and why it's important even if you essentially set it - it's not made up.\n\nThat said, I met my partner six years ago while I was doing my PhD and she was working and in school in a professional program. We got married a couple weeks ago so based on my sample size it can work out.",
          "author": "1piperpiping",
          "created": 1605182577,
          "upvotes": 13,
          "replies": {
            "gc1kf93": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1kf93/",
              "text": "To your first paragraph, I don't think this is even solely constrained to dating someone. It took some time for my parents to accept that I can't chat for an hour every day on the phone. Admittedly, I could probably spare a bit more time for them, but not as much as they'd like. Eventually, they learned that ok, yeah, Asalanlir is busy. Unfortunately, my vovo has not learned this, and given her age, I don't think she'll ever truly understand what grad school is like, especially given her college experience in portugal all that time ago.",
              "author": "Asalanlir",
              "created": 1605188305,
              "upvotes": 11,
              "replies": {
                "gc1r4sf": {
                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1r4sf/",
                  "text": "Ooh yeah, pretty much anyone in my life who hadn't been in grad school had some trouble understanding that being able to make your own schedule (to a large extent) isn't the same as \"is free all the time\".",
                  "author": "1piperpiping",
                  "created": 1605192241,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "gc1nqsw": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1nqsw/",
          "text": "I think it really is a case of the grass being greener, sometimes. Its nice to have someone to lean on when school gets hard, but when you're in a long term relationship with someone who is doing their PhD, it can be an extremely isolating experience. When my husband was in grad school, we moved to a new country, no friends, no kids, no support system. He's outgoing so he made friends in school very quickly, but no such luck for me. He worked a lot (as is the case for all PhD students), so I was home by myself (no job too!) all day with not very much to do. We actually know a few couples who ended up getting a divorce because of the pressures of grad school. Its hard when you're expected to put in 100% at work and have nothing left in the tank when you get home, where you're also expected to put in something.",
          "author": "CalmPea6",
          "created": 1605190337,
          "upvotes": 13,
          "replies": {
            "gc25wyo": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc25wyo/",
              "text": "My boyfriend is in a similar boat that you were in. He uprooted his life to follow me to a new state so I could do my PhD. He doesn't know anyone out here and has no support system. I at least have a built in social network through classes. I feel bad for him that he's so alone and his only social interaction is me, and I'm working 16 hour days. He's slowly finding people and making friends, so it will be alright, but it's hard.",
              "author": null,
              "created": 1605199596,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gc25imc": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc25imc/",
          "text": "I'm in a relationship but my boyfriend works a manual labor job and neither of us make much money. I really like the point you added in the edit. If he were a stay at home \"house husband\" and we had lots of money, life would be a dream. But he comes home absolutely exhausted, covered in sewer shit, after a 12 hour day. He tries to support me but I'm the one who cooks dinner each night because he's so exhausted that if it were up to him we'd either not eat or we'd be having frozen pizza each night. He's getting a better job soon, but it's still manual labor. I'm grateful for his emotional support and I'm glad I'm with him through this, but this isn't some easy mode dream where he does everything for me. We're both working our asses off 12 hours a day on average for scraps. It's hard. But it's nice to have someone to suffer alongside.",
          "author": null,
          "created": 1605199405,
          "upvotes": 8,
          "replies": {
            "gc2utc9": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2utc9/",
              "text": "Wow I could have wrote this. I'm in my first semester of grad school and my boyfriend also does manual labor, so he's tired when he gets home and I'm tired from intellectual labor and sitting in front of the computer all day (his words haha, he says I have a right to be tired from working my brain all day). We end up sharing the responsibilities, but I do cook and clean a bit more often just due to working from home and the convenience of it all being right there. I don't know what it's going to be like when things get back to normal and I will be at the lab all day. It will be another tough transition.",
              "author": "chi-han",
              "created": 1605210594,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gc22h45": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc22h45/",
          "text": "Yes agreed. Having a significant other is great, but it’s a huge distraction. I always feel guilty for not being able to spend enough time with them, or for not having the energy to go out and do things or do my share of the housework. Sometimes I wish I could just hole up in a studio apartment and get it done.",
          "author": null,
          "created": 1605197951,
          "upvotes": 6,
          "replies": {}
        },
        "gc23m61": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc23m61/",
          "text": "Damn that edit was spot on.",
          "author": "balderdash9",
          "created": 1605198490,
          "upvotes": 2,
          "replies": {}
        },
        "gc2ckfo": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ckfo/",
          "text": "You could even extend this to dating grad students in other programs. While it sounds great on paper, sometimes your programs differ tremendously and your partner can't understand why you're so busy and they're not, despite \"both of us in grad school.\"",
          "author": "noface_18",
          "created": 1605202711,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc194fq": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc194fq/",
      "text": "I feel the same, and it's even more challenging being LGBT when you live in a smaller city. The likelihood of finding another LGBT graduate student is statistically low, and there are more undergrads than people your age who actually live in the city. I've dated guys younger than me because that's mostly what there is here, but people still look at me strangely even though I make sure we don't overlap at all in terms of degree programs or classes. I'd love to date a fellow PhD student, but I also hate when straight folks try to set me up with another grad student and the only thing they know is that we're both gay. I even once had someone give a stranger my Facebook info because she thought we'd \"hit it off\" but he was not AT ALL my type. \n\nEven more awkward is matching with someone on a dating app, meeting up in person, then going to campus the next day only to have them introduced to you as a visiting professor from another university and having to pretend like you have no idea who they are. Oops.",
      "author": "False-Guess",
      "created": 1605178825,
      "upvotes": 117,
      "replies": {
        "gc1kdmf": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1kdmf/",
          "text": "> Even more awkward is matching with someone on a dating app, meeting up in person, then going to campus the next day only to have them introduced to you as a visiting professor from another university and having to pretend like you have no idea who they are. Oops.\n\nA friend of mine once hooked up with a girl from bar. It was your standard anonymous \"we're not going to see each other after tonight\" kind of thing. They do what people in their 20's in college cities do best and part ways in the morning.\n\nAbout a week or so later, he starts TA'ing a lab. Guess who walks through the door and sits down at a desk?",
          "author": "Jealous_Illustrator",
          "created": 1605188276,
          "upvotes": 68,
          "replies": {
            "gc2683o": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2683o/",
              "text": "I had a friend with a similar story. She was abroad doing fieldwork and after their stint in the jungle was done they hung out in the city for a few days. She goes to a club and really *hits it off* with a local girl, said it was amazing but great they'd never have to meet again. \n\n2 months after she comes back to Canada, she begins her graduate studies at our uni, and the second she walks in the department door she is greeted by a *very familiar* face, 11,000km away from the previous rendezvous point.\n\nUnfortunately no it didn't turn into a lovely gay romance but they are good pals now",
              "author": "JesseHawkshow",
              "created": 1605199746,
              "upvotes": 25,
              "replies": {}
            },
            "gc3ihtb": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc3ihtb/",
              "text": "I'd die lol At least in my case, we were not working together at all. He was doing research with another professor in the department, and I was a RA for a project in a different department altogether. We just happened to have offices not too far from each other. It was kind of funny when, after he left, one of the folks from my department thanked me for making him feel welcome. It was the least I could do. He spent a lot of money on dinner.",
              "author": "False-Guess",
              "created": 1605222292,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gc0x7m1": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc0x7m1/",
      "text": "It can be tough being single in any social circle where there are primarily couples. That being said, grad school can be tough for everybody as we all carry different challenges too. Putting energy into maintaining a relationship is also time consuming (though not something you'd normally advertise about). Covid certainly has not helped this one bit.\n\nI say that to say, no I don't think you're alone in all of this. There are many lonely graduate students, and the fact that we're studying and working hard in ways that many in society don't fully comprehend doesn't help. \n\nThe good news is that finding people that can come along in our journey is the same a being a partner in theirs. It can be difficult to find the right fit, but it'll work out. Keep your head up!",
      "author": "Yueclow",
      "created": 1605168988,
      "upvotes": 113,
      "replies": {
        "gc24paj": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc24paj/",
          "text": "It's really hard to maintain a relationship while in grad school. Before coming here I was working full time so I had all evening and all weekend free to be with my boyfriend. Now I'm working on weekdays from 9 am to 11 pm straight, I try to take Saturdays off, and am working Sundays from 10 am to 10 pm straight. I make sure we eat dinner together every night but constantly working definitely puts a strain on things and I miss having weeknights free for us time. I'm in my first semester so classes are hell right now, but once I'm through classes and am just doing research I can make it more of a 9 to 5 job. It's just really hard right now.",
          "author": null,
          "created": 1605199013,
          "upvotes": 24,
          "replies": {
            "gc2kbo1": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2kbo1/",
              "text": "I concur that it is hard but at the same time relationships formed 8n grad school can become very strong due to shared trauma and support. If your trying to find a partner in grad school it helps to find someone who is happy to spend time with you not doing the same thing, so you can still hang out and get your readings done. I always tried to set one day aside to take a break from studying to do things with my partner, but they also understood that around final paper time I might elect to stay at school to finish papers rather than spend time with them.",
              "author": "94sHippie",
              "created": 1605205890,
              "upvotes": 6,
              "replies": {}
            },
            "gc2ggsb": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ggsb/",
              "text": "I don’t know what grad school you’re in but those are like finance hours and you’re getting paid nothing for it. You really don’t need to be working those insane hours. There’s gotta be something you can change",
              "author": "scienceislice",
              "created": 1605204392,
              "upvotes": 10,
              "replies": {
                "gc2gn4v": {
                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2gn4v/",
                  "text": "I'm in first semester classes right now for a physics PhD while doing a TA assignment. I'm having a really hard time in classes. Most of that time is spent doing homework. Other than not being stupid I don't know what to change, but I can't not be stupid.\n\nNo one in my cohort wants to work in groups, so I'm on my own and I'm not smart enough to do this on my own. Honestly I'm about to cry just saying this. All I want to do is reaserch. I know I'm good at research. But I'm not smart enough for classes so I'll never get to prove my worth.",
                  "author": null,
                  "created": 1605204460,
                  "upvotes": 14,
                  "replies": {
                    "gc2l57x": {
                      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2l57x/",
                      "text": "I really struggled in my classes too and scraped my way to a B average. You can do it!! Just focus on getting the B, don’t worry about getting As. Maybe you can try getting a group together again or reach out to older grad students? I just know from experience that if you’re studying for 8 hours a day or more you need help in how you approach the problems or classes, because you will burnout very quickly. Spending an excessive amount of time studying can lead to just banging your head against a wall.",
                      "author": "scienceislice",
                      "created": 1605206210,
                      "upvotes": 9,
                      "replies": {
                        "gc2lggb": {
                          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2lggb/",
                          "text": "I'm going to start going to the open Women in Physics study hall my department offers. I'm the only girl in my cohort and the guys don't want to work with me, or when they do they just take over and talk over me. It would be nice to work with other girls at least.\n\nI'm just not smart enough to get this done quickly, especially alone. I want to. I know this is bad. But no matter how hard I try I end up spending 8 hours trying to do a problem and not even finishing it. I'm just too stupid.\n\nLately, some mornings I wake up and just start crying because I know how stupid I'm going to feel if I even try that day.",
                          "author": null,
                          "created": 1605206328,
                          "upvotes": 9,
                          "replies": {
                            "gc2mq1j": {
                              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2mq1j/",
                              "text": "That’s a good idea to join that group! Those men suck you don’t need them. You are absolutely smart enough you wouldn’t have gotten in otherwise. Spend some time looking up effective study habits - if you spend more than an hour on a problem ans can’t figure it out then get up ans take a break, go for a walk or a jog, cook some food and come back to it later. Your brain processes problems when your not doing other things. Spending 8 hours on one problem is not a productive use of time and it’s making you feel worse. \n\nThe smartest people I know are in physics and they can’t solve the problems without group work. are there older female students in your program that can help you? Or maybe a mentoring program set up with your PhD program? You could also try to find a female admin to go to for advice - it’s really shitty that the men refuse to work with you properly. For the men who talked over you - were they enthusiastic about working with you? If they were otherwise friendly you could try it again and be more assertive with them. You are going to have to get used to people talking over you or challenging you, it happens all the time in academia regardless of gender.",
                              "author": "scienceislice",
                              "created": 1605206814,
                              "upvotes": 8,
                              "replies": {
                                "gc2n7uq": {
                                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2n7uq/",
                                  "text": "I really hope the women in physics group will help. The number one advice I got going into this is to find a study group and I have tried so hard to initiate study groups within my cohorts, and the guys just refuse. They're too smart for it I guess. So I'm floundering all alone despite trying so hard to do the right thing.\n\nThis week we have our hardest homeworks yet in both classes. Every single day I have tried to initiate a study group and zero people even bother to reply. I hate this.",
                                  "author": null,
                                  "created": 1605207006,
                                  "upvotes": 5,
                                  "replies": {
                                    "gc2nqad": {
                                      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2nqad/",
                                      "text": "Can you also access some therapy? You seem to be suffering from imposter syndrome and feelings of insecurity - therapy would help you with the anxiety/ stress you’re feeling and help you develop better study habits. It sure as hell helped me. Banging your head against the wall for 8 hours on a single problem is not helping you one bit. \n\nCan you try again with some of the men who were nicer? Or reach out to older students? Maybe someone would be willing to tutor you.",
                                      "author": "scienceislice",
                                      "created": 1605207239,
                                      "upvotes": 3,
                                      "replies": {
                                        "gc2nwzj": {
                                          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2nwzj/",
                                          "text": "I see a therapist every two weeks. I've been with her over a year now. It sucks so hard that I am trying to do everything right and I'm still not good enough.\n\nI'm trying to reach out the the older students. I'm finding more success with them but they're so busy they can't help me usually. But they're nice at least and they help me when they can.",
                                          "author": null,
                                          "created": 1605207325,
                                          "upvotes": 4,
                                          "replies": {
                                            "gc2ocnz": {
                                              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ocnz/",
                                              "text": "That’s good! Just getting some support will help. \n\nI highly recommend reaching out to others in your classes again ans bringing up the study struggles with your therapist. My therapist helped me change my study habits to be more effective (no more spending 8 hours on one problem, which times of the day work best for different activities, etc)",
                                              "author": "scienceislice",
                                              "created": 1605207529,
                                              "upvotes": 4,
                                              "replies": {
                                                "gc2ogsn": {
                                                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ogsn/",
                                                  "text": "Yeah, I hope so. I'm just so discouraged that I am fighting to do everything right and I'm just not good enough.",
                                                  "author": null,
                                                  "created": 1605207582,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "gc2rhmf": {
                                                      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2rhmf/",
                                                      "text": "Thought patterns like that are destructive and will tear you down rather than build you up! Hopefully therapy targeted at this will help you.",
                                                      "author": "scienceislice",
                                                      "created": 1605209021,
                                                      "upvotes": 4,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "gc2n0xs": {
                              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2n0xs/",
                              "text": "I am sorry you're feeling this way. This is unsolicited but you ARE smart enough. You ARE in this program. And you ARE hard-working. It's gonna be ok\\`11",
                              "author": "UnderstandingNo3673",
                              "created": 1605206931,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gc2ipmx": {
                      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2ipmx/",
                      "text": "I’m in a similar boat. I’ve been telling myself it’s just growing pains from switching from a normal job to being a grad student. Just need to get through classes, just need to get through classes. \n\nAlso, I’m like 90% sure the rest of your cohort might be feeling the same way. You’re not alone. You’re doing your best and be nice to yourself. You got this far!!",
                      "author": "chilisisgr8",
                      "created": 1605205264,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gc265h3": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc265h3/",
          "text": "This!! I am in a semi LDR and sometimes I daydream about how much more free time I would have if I didn’t have to dedicate so much time to commuting plus maintaining my relationship through quality time and dates. I also think it’s a little different for me because I started my relationship a little before I started my program. \n\nI really do appreciate my partner though and wouldn’t have it any other way. But I feel guilty sometimes for how much I am NOT doing work because I am spending it with my partner.",
          "author": "raeee_0710",
          "created": 1605199711,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gc0vnl4": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc0vnl4/",
      "text": "my cousin is doing her PhD and is married with a mostly stay at home husband.  he takes care of the cooking, cleaning, and laundry.  i have half joked that she is doing her PhD on easy mode.",
      "author": "EP_EvilPenguin",
      "created": 1605167912,
      "upvotes": 128,
      "replies": {
        "gc1jzau": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1jzau/",
          "text": "I think, if anything, that's probably the easiest a phd can get. Though in no way does it make it easy. At the end of the day, it's still a phd.\n\nIt's not just about having someone else to take care of the daily chores or tasks. I actually find those a good way to distract me from work when I need a break. Rather, it's about having a strong support system. And from the minimal information gleaned from your post, it would seem that support system is not just from her husband.",
          "author": "Asalanlir",
          "created": 1605188015,
          "upvotes": 88,
          "replies": {
            "gc1w9nl": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc1w9nl/",
              "text": "A faculty member I know once said that she doesn’t think she could have finished her PhD without her mother bringing her coffee every morning to wake her up.",
              "author": "Gaseousitsover",
              "created": 1605194933,
              "upvotes": 39,
              "replies": {
                "gc26rea": {
                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc26rea/",
                  "text": "regular gifts of caffeine are probably the best thing you could ever give a grad student.",
                  "author": "EP_EvilPenguin",
                  "created": 1605199999,
                  "upvotes": 23,
                  "replies": {}
                }
              }
            },
            "gc26orp": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc26orp/",
              "text": "in my first year having someone to handle the domestic side of things would have been an awesome support.  for example, coming home late from the lab knowing dinner was waiting, as opposed to having to cook, would have resulted in a bunch of saved money and avoided gaining weight from the number of times it was just easier to hit up a fast food place on the way home.  \n\noverall though i agree that the emotional support is by far and wide the most important.",
              "author": "EP_EvilPenguin",
              "created": 1605199965,
              "upvotes": 12,
              "replies": {
                "gc26y76": {
                  "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc26y76/",
                  "text": "It's partially a personal thing. I love cooking, so putting on an audio book while making dinner was my way of escaping from the world for an hour or two.",
                  "author": "Asalanlir",
                  "created": 1605200087,
                  "upvotes": 3,
                  "replies": {
                    "gc27cru": {
                      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc27cru/",
                      "text": "i enjoy cooking too.  the problem is dishes.  i need to find a woman who finds doing dishes relaxing =)",
                      "author": "EP_EvilPenguin",
                      "created": 1605200274,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gc241hu": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc241hu/",
          "text": "Last night I broke down while doing my homework and it was really nice to be able to cry into my boyfriend's chest while he held me instead of crying alone. It's really nice to always have someone there to tell me I'm smart when I feel stupid.\n\nI'm grateful to be with someone healthy and kind. I was with a really abusive person in undergrad, and that made life hell. So just a reminder that not all relationships are \"easy mode\". Some relationships are hell mode. I know you didn't mean that, but if anyone is in an abusive relationship reading this I just want them to know I see them and recognize their struggle.",
          "author": null,
          "created": 1605198691,
          "upvotes": 25,
          "replies": {}
        },
        "gc2andw": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2andw/",
          "text": "[deleted]",
          "author": null,
          "created": 1605201815,
          "upvotes": 9,
          "replies": {
            "gc2bs63": {
              "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc2bs63/",
              "text": "I find the same, except my city went on lockdown again so now my place has never been cleaner!",
              "author": "noface_18",
              "created": 1605202341,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gc20h15": {
          "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc20h15/",
          "text": "I said the same exact thing about my MA. My husband worked *hard* to head off at the pass any and all home life stressors before they could even reach me in addition to the approximately 8,000 other ways he helped, like always taking my side and being there when I was upset/needed to vent and believing in me even when I didn’t. It was a serious blessing and I truly couldn’t have done it without him. I have genuine empathy and respect for anyone doing it solo.",
          "author": "oakaye",
          "created": 1605196988,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gc0vfw2": {
      "link": "/r/GradSchool/comments/jsqpcb/the_cult_of_relationships/gc0vfw2/",
      "text": "Although I’ve never really thought about it, you’re so right. Working towards a PhD is already a lonely process which seems much more lonelier when you notice colleagues have support systems with their partners at home. I’m not jealous or look at them differently because of it, it’s just something I’ve began to notice over the past few weeks. COVID-19 has already placed immense pressure in regards to our teaching and research and really in our ability to find support systems —",
      "author": "Jisal97",
      "created": 1605167749,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634066262
}