{"sid": "6qrqs5", "link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/", "title:": "As I enter my last year, I just want to share a few thoughts with incoming students:", "text": "1) Impostor Syndrome is 100% real and will affect you (yes, even you). It's okay, though. You can overcome it. You just have to build up enough knowledge & experience that you start thinking, \"hey, maybe I do know what I'm talking about\". It takes time.\n\n2) Related to #1, regardless of how much you know about your topic, there is *much more* that you do *not* know. Cultivate humility, learn from others, and don't be afraid to admit you don't know something. Real learning will not happen until you accomplish these things. Plus, you're not fooling anyone; I wouldn't even attempt it.\n\n3) Try as much as possible not to compete with your cohort. Don't undermine them, don't put them down, don't be upset when they succeed. Foster a support network, based on care and trust. Help them and they will help you. They will be your colleagues, now and forever.\n\n4) Seek out mental health resources, early and often! Can't stress this enough.\n\n5) Show up to your advisory meetings with a clear agenda, starting with things that are most time-sensitive. Your advisors are busy and may not have the time to be as involved as they want to be in your life. Make it easy for them.\n\n6) The second you start writing the 3rd paragraph of an email, stop. Delete the whole thing. Schedule a meeting instead.\n\n7) Get 8 hours of sleep a night. Non-negotiable.\n\n8) And lastly, honest to god, *very few people are working as hard as they claim they are*. There is this weird culture in graduate school centered around complaining about how much you have to work. I'm not saying you won't have to work hard or that others *don't* work hard, but take what you hear from other people with a grain of salt; I see a lot of self-reported work inflation around me. Given that there's so much flexibility in how to get work done, there are many ways to get it done. Someone else's method may not work for you. Don't let it get to you.\n", "author": "RadioMars", "created": 1501537904, "retrieved": 1632953804, "over_18": false, "upvotes": 430, "upvote_ratio": 0.99, "comments": {"dszq0vu": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dszq0vu/", "text": "Thanks, I really needed to hear the part about the work inflation. My cohort always brags about how hard they’re working and it makes me feel like a bad grad student. How can you tell when someone’s lying about how hard they’re working? I’ve seen grad students talking about being in lab until 10pm but when they present their work at the end of the semester it doesn’t seem like 13 hours/day worth of work to me?? Maybe I’m being judgy or ignorant but I’m entirely capable of getting a decent amount of work done doing mostly 8 hour days?? I mean sometimes I have a longer day but most of the time I keep pretty reasonable hours?? And my PI doesn’t seem to think I’m underperforming?? I’m just so confused am I lazy or something??", "author": null, "created": 1516498554, "upvotes": 1}, "dl1r9hg": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl1r9hg/", "text": "Re: 3) I think this is really important. It's important not to compete with them, but don't compare yourselves and your progress either. We are all on our own paths to our PhDs, and the way we get there is going to be different. Some of us have year long data collection trips to actually gather data, others can get to work on their data pretty much immediately. So if someone's knocked out a quant paper and you're still at data entry from stuff you've spent ages collecting... don't let the panic set in and make you feel like you're 'behind'. You're on your path and they're on theirs- support them, cheer their accomplishments, and keep plugging away at your work. You'll get there too.\n\nObligatory, 'Social science, YMMV'", "author": "readmethings", "created": 1501651952, "upvotes": 2}, "dl15s7i": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl15s7i/", "text": "All good points. I honestly never realized 8) was the case until I read this post. But I think it is definitely a thing. ", "author": "Sir_freecandy", "created": 1501623343, "upvotes": 1}, "dl12f69": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl12f69/", "text": "Maybe someone can shine some light on #7 for me... I just feel like it's the only thing I can control to get my work in. I was in the Navy before school and am used to very little sleep but I feel it won't cut it here. Do you stop everything, even if you still feel behind, and just say I'm going to bed? I did something along these lines but it was for my workout. I'm very dedicated to bodybuilding, it's a hobby that keeps me sane. When I started grad school I started skipping workouts and it just added to the depression. I had an exam today and I had so much to cover last night but I said screw it, I don't need to be top of the class, I just need to survive. I wanted to refocus on myself to stay sane and I went and got a workout in.\n\nBut sleep? I'm not sure how I can manage anything over 6 hours tops. I squeezed my workouts down to under an hour and I'm still trying to figure out how to get in all the required studying in without sacrificing sleep. ", "author": "MilkMoney111", "created": 1501619675, "upvotes": 1}, "dl0x867": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl0x867/", "text": "Make some friends outside your program. If you sit around with the same people complaining about the same classes, the same professors, the same deadlines all the time you can get trapped in a misery feedback loop. The perspective of outsiders can really help you to not get as overwhelmed. Of course, make friends with people in your program  too.", "author": "pecamash", "created": 1501614329, "upvotes": 16}, "dl0siq7": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl0siq7/", "text": "lol i'm a sophomore in undergrad and I feel the imposter syndrome. I can't imagine it ever going away. ", "author": null, "created": 1501609545, "upvotes": 2}, "dl0qjwr": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl0qjwr/", "text": "Shhhh!!!!   As a PhD student entering his (fingers crossed) final year, I really wish you would erase number eight.  I need that \"myth\" perpetuated!  Part of \"how incredibly busy I am,\" is built in mental health downtime.  It might look like I'm not working, and I'm absolutely not \"working\" but I'm only not working so I can take time to find the energy/focus to return to what actually looks like I'm working (which is sitting and staring at a screen until my eyes just about start to hemorrhage).  Watching tv (or gaming, if that's your thing) *is* part of working for me.  I *need* those hours of downtime where I appear to be doing nothing and am thinking about literally anything other than the dissertation just so I can have one good productive hour of working on it.  Actually, it's more like I need 2-3 solid days of relaxation to get one good productive day of work done.  Sorry this was so long.  I probably should've scheduled that meeting.", "author": "funknjam", "created": 1501607586, "upvotes": 3}, "dl0nmio": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl0nmio/", "text": "I respectfully disagree with 6. Having things in writing has saved my butt a few times.", "author": "flipflopped_plans", "created": 1501604587, "upvotes": 4}, "dl0k2eh": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl0k2eh/", "text": "Also: keep in mind everybody has a different experience. What you are witnessing more often than not on boards such as this is a selection problem. People who have bad or negative experiences are more likely the ones to share them, not the people having neutral to positive experiences. Grad school is not terrible for everyone! On average, I think it's a great job. I'm much happier than I was in any of the previous 3 full-time jobs I had. Don't set yourself up to be miserable because you are expecting to be miserable.", "author": "esotericish", "created": 1501600796, "upvotes": 5}, "dl0ijfx": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl0ijfx/", "text": ">very few people are working as hard as they claim they are.\n\nI think this is really field-dependent.  My field is full of hyper-motivated international students (who tend to be more fired up than domestics in every country, for obvious reasons) who work 23/7.  My officemates were always WORKING while I was messing around on reddit or ordering shoes from Gilt or whatever.", "author": null, "created": 1501599104, "upvotes": 1}, "dl05zfd": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl05zfd/", "text": "[deleted]", "author": null, "created": 1501576187, "upvotes": 20}, "dl03mod": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl03mod/", "text": "Research and grad school are a marathon. Studying for courses either undergrad/grad school you can treat like a sprint around exam time or a few deadlines.\n\nDon't do that for your thesis/research, you'll burn out and end up hating it all. Build up something steady, take moments to look back and reflect on what you've done, sometimes with the slower pace it's hard to feel like there's any meaningful progress.\n\nWriting sucks (for most of us), hardest part is that first paragraph, second hardest is those last few paragraphs before you're done.\n\nLastly, have something/someone to be accountable to... if it's your advisor great, a lab partner, a friend anyone.\n\nThis is all speaking from experience of someone who did the analysis and write up for a sandwich thesis in a hellish week and a half. Don't do that.", "author": "failuretomisfire", "created": 1501570193, "upvotes": 5}, "dl01zas": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dl01zas/", "text": "Preach. Good solid advice here. I agree 100%. ", "author": "1s2_2s2_2p2", "created": 1501566606, "upvotes": 2}, "dkzz7w2": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzz7w2/", "text": "Tell us how much fat those checks are. That is what motivates me foward. Challenger RT, Japan, House. Also, I knew I was destined to excell so I never felt so, Leaders help others succeed. ", "author": "drummmergeorge", "created": 1501561604, "upvotes": -8}, "dkzvfqq": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzvfqq/", "text": "Thank you for this. I'm an incoming first-year and my courses start soon, though I'm already feeling guilty for not getting a start on reading literature and such. I just want to relax and be lazy for a little while longer, since I know the marathon is about to start.", "author": "holton86", "created": 1501555888, "upvotes": 9}, "dkzv6xm": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzv6xm/", "text": "All true but #8 is truest. Grad students complain more than is typical. Academia attracts complainers with chips on shoulder (hey, I'm sure I'm one of them). It's a good idea to remember that when you feel like you're not cut out for it. ", "author": "MetalAF383", "created": 1501555557, "upvotes": 10}, "dkztduq": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkztduq/", "text": "Wear a rubber.  ", "author": "1wrx2subarus", "created": 1501553137, "upvotes": 12}, "dkzt9ar": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzt9ar/", "text": "God I need to start doing #6", "author": "Arsonade", "created": 1501552972, "upvotes": 1}, "dkzrc6u": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzrc6u/", "text": "Thank you for sharing this! I'm saving this post to refer to when I start grad school in September. ", "author": "la-lapine5", "created": 1501550586, "upvotes": 5}, "dkzr24f": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzr24f/", "text": "Good advice, I would add to or amend #3 and #8.\n\n>\\#3: It's not *just* your peers that you help. You should also seek to help the younger graduate students as much as possible. Success requires collaboration in the real world, and if you learn to help your juniors, then you will be able to seek their help as well. \n\n>\\#8: Breaks are great, but use them well. That is, don't feel guilty about taking a break if it actually helps because then you're just wasting your break with the unearned burden of guilt! And, if possible, procrastinate by working side projects that may help your future.. I did a great job of this early on, but I got a bit sidetracked away from this \"productive\" procrastination in recent years. \n\nAnd, finally, I would add a zeroth and very repetitive tip. \n\n>\\#0: It's okay to leave. If you don't allow yourself this possibility, you're going to build up a lot of pressure that will make you very ineffective in general. You are only here by your own choice. Re-evaluate whether or not you even want to be here once in a while. It will make you stronger and more sure of yourself just by OKing this possibility. \n\n\nedit:\n\nI'd like to add that my real work hours are something like 3~7, then on/off from 10/11~2/3. Computational work allows for some great freedom when constrained by idiot meetings. :) Unfortunately, I haven't been able to get back on track today so.. will try again in a few hours apparently. Politics/reality TV is quite addicting. ", "author": null, "created": 1501550238, "upvotes": 13}, "dkzosn9": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzosn9/", "text": "re: 4) Get into counseling now, not when you start getting stressed. Now.\n\nre: 8) In the spirit of this post, I'll be honest. I work 6 hours a day on grad school stuff MAX. (I'm in liberal arts so I don't have any lab shit to deal with). After 6 hours, my brain is fried. ", "author": null, "created": 1501547405, "upvotes": 41}, "dkznziz": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkznziz/", "text": "Love this! I will definitely share this with our incoming students!", "author": "imthekuni", "created": 1501546409, "upvotes": 5}, "dkzn9xz": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzn9xz/", "text": "as someone coming back to academia after a long break (read: family, life obligations besides school, etc) these are amazing.\nalso appreciate # 3 from /u/Eigengrad\nThank you, thank you!", "author": "miepp", "created": 1501545520, "upvotes": 8}, "dkzmkmd": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzmkmd/", "text": "Agree with all of this!\n\nAnother piece of advice as a 4th year: have something outside of grad school that you're invested in. A hobby, physical activity, training your dog, relationships with people outside of academia, etc. This will make you a more well-rounded person as well as provide necessary stability when nothing in grad school seems to be going right", "author": "tasteofglycerine", "created": 1501544626, "upvotes": 21}, "dkzmd1h": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzmd1h/", "text": "Upvote for #6 definitely!", "author": "tah_infity_n_beyarnd", "created": 1501544357, "upvotes": 5}, "dkzjgkh": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzjgkh/", "text": "All very solid advice. Building on and echoing the above, my top 4 pieces of advice are this:\n\n1: This isn't undergrad. Don't approach it with the same priorities. Courses can have varying importance, but research is king.\n\n2: Build a support network. In or out of school, the friends and colleagues you have supporting you will make or break your academic career.\n\n3: Your life matters. Don't sacrifice important things (health, relationships, sanity) for your degree.\n\n4: Coming from 3, remember grad school isn't a marathon to push through. It's a building block for the rest of your academic career. Things get harder after rather than easier, so learning how to keep your work and life in a sustainable balance during grad school is really important.", "author": "Eigengrad", "created": 1501540732, "upvotes": 135}, "dkziq16": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkziq16/", "text": "Thank you thank you thank you! I'm headed off to graduate school in a few weeks, I'm feeling the imposter syndrome badly.", "author": "ChipotleNapkin_", "created": 1501539822, "upvotes": 42}, "dkzipxh": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkzipxh/", "text": "I know you said you were writing this as advice for incoming first-years, but as a rising third-year, I just wanted to thank you for putting this list together. I agree 100% with everything you wrote here, and it felt good to read that someone else had/is having the same grad school experience that I have been having. Thank you.", "author": "DoctorLindyLove", "created": 1501539819, "upvotes": 27}, "dkziiva": {"link": "/r/GradSchool/comments/6qrqs5/as_i_enter_my_last_year_i_just_want_to_share_a/dkziiva/", "text": "This is all good advice. ", "author": "Topoltergeist", "created": 1501539579, "upvotes": 6}}}