{
  "sid": "qvslkj",
  "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/",
  "title:": "Experiences with living with an undergrad",
  "text": "I am a 26M grad student. My 27F roommate (also grad student) is leaving for the Spring and Summer semesters and wants to sublet her room, but the only person she has gotten is a sophomore (19F). She seems nice when I spoke to her, but I really have my reservations with living with a sophomore, 7 years younger than me. Has anyone here had experiences with living with younger undergrads when you’re a grad student?",
  "author": "skrlwrld",
  "created": 1637129056,
  "updated": 1637414984,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.89,
  "comments": {
    "hkypwrw": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkypwrw/",
      "text": "My first roommate was a sophomore. I was skeptical at first, also because I was moving to a different state, but she turned out to be very responsible, clean, organized, mature, and considerate. I wouldn't say we became friends, but we were definitely friendly and worked things out like adults. Because I was moving out of state, we talked for a bit before I signed the lease about what our expectations were so I was at least a little reassured. \n\nUnfortunately she moved a year later, and my next roommate was a \"working professional\" who was a total slob, a pot head, and lazy despite being 7 years older than her. \n\nAt the same time, I also think I got pretty lucky finding someone who actually wanted to concentrate on their studies and wasn't a big partier, so I don't know that my experience is typical.",
      "author": "False-Guess",
      "created": 1637135847,
      "upvotes": 33,
      "replies": {}
    },
    "hkzdqh8": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkzdqh8/",
      "text": "I currently live with a first year undergrad student. She's pretty great - we barely ever see each other. I'm in the lab all day, and when I come home at night she's in her room studying. I had my worries at first, that she would be a partier, or annoying, but it's been good. Definitely interview your new roommate if you can. You'll get a feel of what she's like and then you can decide from there. But it can definitely go both ways - reading some of the other comments here, it seems like I got pretty lucky.",
      "author": "happygoluckylala",
      "created": 1637153965,
      "upvotes": 17,
      "replies": {}
    },
    "hkyhnva": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkyhnva/",
      "text": "I have lived with undergrads during my masters and during my PhD. Both times ended horribly, one ended up involving lawyers and small claims court after my roommate threw a party and trashed the house, leaving us with thousands of dollars in damages. The other time was less bad, but my roommate was just super immature and irresponsible. I would absolutely never live with an undergrad again. Avoid it if you can.",
      "author": "mas63520",
      "created": 1637129817,
      "upvotes": 36,
      "replies": {}
    },
    "hkyjzao": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkyjzao/",
      "text": "I had a roommate who was an undergrad drop-out (I didn't know). She had no clue how to take care of herself or the house. Was the filthiest person I have ever met and couldn't do any \"Adult\" things (pay bills, handwash dishes, vote, order food, calculate tax, use a washing machine/dryer, use a tape measurer, drive, cook, use a vacuum or drill, etc.). I basically had to become like her mother and nag her. When she finally moved out, her room stank for months after. Never again.\n\nThat being said, when I was an undergrad, I had all of the skills that I have now and was an awesome roommate. I was clean, never partied, quiet, and courteous to my roommate and shared spaces. So I really think it depends on the person.\n\nIf she is really the only person that can take over the lease, perhaps you can write up a roommate agreement and meet her again to go over it and expectations?",
      "author": "JenAnnMad",
      "created": 1637131384,
      "upvotes": 18,
      "replies": {
        "hl33s97": {
          "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hl33s97/",
          "text": "By simple conversation, would it be possible to tell if the person is a mature undergrad?",
          "author": "electropop999",
          "created": 1637212523,
          "upvotes": 1,
          "replies": {
            "hl34ftw": {
              "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hl34ftw/",
              "text": "I doubt it. I wrote up a roommate agreement and met with the above-mentioned roommate three times and saw no immediate red flags. She turned out to be the worst roommate I've ever had. \n\nBut if this person is really the ONLY person who responded to the lease take over, what other choice is there?",
              "author": "JenAnnMad",
              "created": 1637212902,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkyq2ft": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkyq2ft/",
      "text": "my freshmen roommates are huffing aerosol cans and drinking; one of them vomited under his bed and didn't bother cleaning it until i got the dorm supervisors involved. fuck undergrads. never again.",
      "author": "HLA-AIRE-VIT1",
      "created": 1637135974,
      "upvotes": 5,
      "replies": {}
    },
    "hkzdl2r": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkzdl2r/",
      "text": "Avoid if you can. I’m a bit older and currently live with some ~20 year old undergrads and their currently non-working friends. The discipline is poor to say the least.",
      "author": "ForeverRising-",
      "created": 1637153879,
      "upvotes": 6,
      "replies": {}
    },
    "hkzrhiu": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkzrhiu/",
      "text": "I lived with undergrads most of my time in grad school. I was usually a last minute addition because someone dropped out of the lease. Never had an issue besides one guy playing COD too loudly.",
      "author": "chrisn3",
      "created": 1637160739,
      "upvotes": 4,
      "replies": {}
    },
    "hkzy339": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkzy339/",
      "text": "Depends on the undergrad. I’d say they’re no more likely to be awful than a rando off the street.\n\nThat said, graduate school selects for a certain kind of person and grad students are probably much less likely to trash your place.",
      "author": "greens_giga_chad",
      "created": 1637163523,
      "upvotes": 5,
      "replies": {}
    },
    "hkyialc": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hkyialc/",
      "text": "Definitely avoid if possible. I've had a bad experience living with undergrads in the past.",
      "author": "fillmywaterbottle",
      "created": 1637130231,
      "upvotes": 10,
      "replies": {}
    },
    "hl04vre": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hl04vre/",
      "text": "I had a 19 year old undergrad move in with me when I was 26 and working on my master's. He stayed for 2+ years and we never had any problems. \n\nThe dynamic was a little different because I owned the house and he was just renting a room, so I could make the rules and enforce them if needed... But that was never really an issue as he was respectful of the house and other roommates.",
      "author": "RockyMtnGrl",
      "created": 1637166258,
      "upvotes": 3,
      "replies": {}
    },
    "hl05ofy": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hl05ofy/",
      "text": "I have an undergrad roommate as a PhD student, though she's a senior. Quiet, studious, and a volunteer in our lab! We cook together often. I have no issues with it, and I've never actually had a bad roommate, even in undergrad.",
      "author": "Kimanaio",
      "created": 1637166573,
      "upvotes": 3,
      "replies": {}
    },
    "hl05gdg": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hl05gdg/",
      "text": "boss her around. You're a senior. lol don't sweat it.",
      "author": "Brightboi2000",
      "created": 1637166484,
      "upvotes": 2,
      "replies": {}
    },
    "hl1bodu": {
      "link": "/r/GradSchool/comments/qvslkj/experiences_with_living_with_an_undergrad/hl1bodu/",
      "text": "She might sue if she’s under 21, if you get nasty",
      "author": "throwawylde",
      "created": 1637183159,
      "upvotes": -1,
      "replies": {}
    }
  }
}