{"sid": "p6nxgw", "link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/", "title:": "Anybody else feeling tired with no motivation?", "text": "I’ve entered a “quiet” period on my PhD and my daily workload has been quite light the last few weeks aside from some code editing and minor admin tasks. \n\nI’ve had conversations with my supervision team but my main supervisor is on annual leave for another week so there really isn’t much for me to do bar reading literature and carrying on with my numerical work. I can’t start the theoretical work until my main supervisor reviews the numerical calculations so I’m kind of floating if that makes sense?\n\nI feel as if I’m wasting my days but I’m still doing things, like I feel I should be packing things in if that makes sense? I’m kind of losing my motivation as a consequence.", "author": "Nuclear_Fermion", "created": 1629279895, "retrieved": 1632846400, "over_18": false, "upvotes": 292, "upvote_ratio": 0.99, "comments": {"h9h9joj": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9h9joj/", "text": "Omg I felt this today. I'm not in a PhD (yet) but I felt lethargic and weird/tired all day today.\n\n\nI'm sure your case is worse given that I'm jobless and done with school, but you're not alone.\n\nTake a vacation, get some exercise, do your thing.", "author": "SnooTomatoes1513", "created": 1629336289, "upvotes": 1}, "h9h6v0v": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9h6v0v/", "text": "This might be not at all what you're looking for but... Can you just take this time to chill? It sounds like you're sort of on hold due to other people and that, to me, means doing the work you can and otherwise doing life stuff - chores, hiking, art projects, catching up on TV, whatever. Also looking through relevant job boards or postdoc opportunities or professorships or info about getting an industry job post grad, all that kind of stuff. If you don't know what you're gonna do when you graduate, spend some real time considering your options. Sounds to me like this free time and you ought to take advantage of it!\n\nRest, reset, and hopefully you can rekindle some excitement in the next few weeks to get you through. Best of luck!", "author": "Lucky-Reporter-6460", "created": 1629335026, "upvotes": 1}, "h9h2vcd": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9h2vcd/", "text": "Same here, and it’s orientation week for me", "author": "burakbenxd", "created": 1629333165, "upvotes": 1}, "h9fthtl": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9fthtl/", "text": "Bro everybody's entire phd is like that\n\nSource: defensed PhD in june.", "author": "Arminius2436", "created": 1629312315, "upvotes": 5}, "h9excvp": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9excvp/", "text": "If you know generally what your topic is and dont want to take another week off while your PI is out, you can spend this week putting together at the very least an outline for your literature review chapter for your dissertation. Starting the writing early is what I wished I had done early in my MS and ultimately getting everything done is up to you, not your supervisor. Even if some of the writing changes, at least you have something done and can edit instead of having to write the whole thing later.", "author": "GayMedic69", "created": 1629297986, "upvotes": 4}, "h9ewome": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9ewome/", "text": "Yes, but I'm also writing my thesis and finished helping my labmate with PhD defense (which he passed) since he collected data and I processed it.", "author": "suckuma", "created": 1629297672, "upvotes": 1}, "h9ev0az": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9ev0az/", "text": "Yep. I'm in my final year of funding, with a lot of rewrites I need to be working on, and another chapter I need to be developing. I'm just really burned out and tired. \n\nThe idea that I am on track to finish this time next year is great!... but that just feels forever away. \"Miles to go before I sleep...\"", "author": "Jack-ums", "created": 1629296886, "upvotes": 2}, "h9euw4x": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9euw4x/", "text": "You absolutely need a vacation.  It turns out, everyone needs them.  Even highly driven budding researchers.\n\nOne of the best things I did during graduate school was unplug and decompress for a month, before my final push.  I had saved up some (admittedly not much) money, and booked a round-trip ticket to Scotland with a friend.  We backpacked around, staying in student hostels and having extremely picturesque adventures.  I completely unplugged from the work and responsibility.  My only \"concession\" to the lab was to visit a gorgeous red phone booth on a spit of land in Lochranza (Isle of Arran) and, surrounded by the orange-and-purple sunset and next to the ruins of a castle, to call my labmates back at the synchrotron and describe the trip to them.  It was a call they did not particularly appreciate, of course, but I sure did.\n\nComing back, I had new vim and excitement, and some new insights that wouldn't have been accessible before.  I also had the energy to push through for another 12.5 months and get my dissertation done.", "author": "drzowie", "created": 1629296830, "upvotes": 5}, "h9epg37": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9epg37/", "text": "I feel you, bro/sis.\n\nI am feeling extremely exhausted right at this moment. My advisor is not here for the whole academic year, and as a matter of fact, I have never met him in person. All I got was a \"keyword\" to search on and a vauge question to think about when I first enter the group. I spent one whole year just reading and reading and getting nowhere closer to answering that question I was being asked. Everytime I try to email my advisor to report what I am thinking/doing/reading I would basically just get back an \"OK\". But when I try to ask more specific questions to get suggestions on how to continue, I will not get a reply. Don't know if he didn't see my message or just didn't want to answer. I feel like I am doing shit that nobody cares and getting nowhere closer to graduation. I am doing a two-year research-based Master's. And at this point I just want to graduate and finish this intermediate stage of my career and no longer that care about the science.\n\nOn the other hand, I have been working with one of my undergrad professor to finish up a project I have started long ago. Even though my undergrad prof thinks that project is good enough to be used as a Master's thesis, but he has already left the university and so I can't switch my advisor to be him. I am still working hard to finish this project, but I can't help to think wtf am I doing, because even after getting this done I am still stuck in my current position. I honestly have no idea wtf am I doing and am so tired of thinking how to continue.", "author": "astrok0_0", "created": 1629294203, "upvotes": 16}, "h9eja2p": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9eja2p/", "text": "Unfortunately I am in a anger phase where everything my boss does annoys me. As others have suggested, take some time off and relax a bit", "author": "unluckychemist", "created": 1629290917, "upvotes": 45}, "h9e9gij": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9e9gij/", "text": "It sounds as if you have not yet taken primary responsibility for your degree. You need to be setting the goals, finding the resources and demanding progress of yourself. As long as you depend on your supervisor for these things, you have not really matured as a PhD student.", "author": "IkeRoberts", "created": 1629284246, "upvotes": -9}, "h9e9dw4": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9e9dw4/", "text": "I’m going through something similar. I’m waiting on comments on my manuscript from my PI. I had a really light workload too because I had just finished a big four year project and I moved on to a much smaller project. I was barely doing anything for about two months, then I started a side project that I was interested in. It’s kept me going and I’m feeling motivated again.", "author": "fserv11", "created": 1629284187, "upvotes": 8}, "h9e674b": {"link": "/r/GradSchool/comments/p6nxgw/anybody_else_feeling_tired_with_no_motivation/h9e674b/", "text": "Sounds like you need a vacation dude. When I was in grad school, everyone took a vacation when the PI took a vacation. It was expected not because the work came to a halt but because there were no meetings to attend, or data to go over", "author": "resorcinarene", "created": 1629281461, "upvotes": 121}}}