{"sid": "koi7z0", "link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/", "title:": "If you are a college student who is seriously struggling with the costs of books and class materials, tell your professor.", "text": "I'm a professor. If you're a student of mine who is truly struggling under the weight of class books and materials, there is a fund available at our school to help you. But we're not supposed to announce that to our class, or else the small office in charge of those funds will be overwhelmed by rich cheapskates as well as genuinely needy students. Please take the initiative to let me know early in the semester if this is a serious problem for you, and I can refer you to that office. In addition to the special fund, I can also see if the publisher will provide you with a free copy of the textbook, which they've been known to do - particularly if our school is a good customer of theirs. Or I may have an old copy of the textbook that I can lend or possibly even give you. No guarantees that I can help, but it can't hurt to ask.\n\nP.S. I use free open source books and readings instead of expensive textbooks and materials whenever I can. But I don't always design the courses I teach, and sometimes the choice of books and materials is out of my control", "author": "Defiant-Engineer", "created": 1609532352, "retrieved": 1632947124, "over_18": false, "upvotes": 1764, "upvote_ratio": 0.99, "comments": {"gi73pvg": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/gi73pvg/", "text": "Prohibitive costs to access to information is immoral in my opinion - though there are gray areas when lack of funding puts continuation of creation at risk. Ideally it could be perfectly calculated just how much should or could be paid, and by whom to keep production but it's complicated and takes the subtlety of the human brain but superhuman speed, memory and processing to calculate these things very well (AI will get there).\n\nI usually prefer physical books with nice delicious paper. I love that lots of Computing related books are offered online for free. Leave purchasing to the people who can afford the extra luxury of real paper - I just hope it's enough to keep the author going, if not, then next best thing is make it as cheap as possible. I couldn't possibly afford all the books I need in print - but occasionally someone does get my money. If I had to pay, I wouldn't necessarily be able to contribute more - I would just have less. FUCK THAT!!!  \n\nAnyway instead of pirating what I can't afford, I pirate whatever I need, then look at my budget for \"rewarding creators\" (which I am happy to make as generous as I can - I feel really good about paying people for their contributions) and think of what the most efficient/fairest way to distribute the money would be - thinking of human progress and happiness or peacefulness (whatever you wanna call it) as a whole.  If a creator is struggling to keep things running, I certainly feel very compelled to prioritize them. When I cannot contribute/pay them back fairly in $$$, I do the next best thing... I give (what I think is) useful feedback, write reviews in the manner and avenues I imagine would be most helpful to them, recommend them to people who CAN spare the money, etc...\n\nMaybe I'm kidding myself, but when I ~~daydream~~  consider what I would want to do if I ever had lots of money, I see myself rolling around in a mud-mobile around throwing $ at, and thanking, all the people who's work I used or enjoyed for free.", "author": "philosopher_nymph", "created": 1609866567, "upvotes": 1}, "gi1a9ni": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/gi1a9ni/", "text": "I would also check on sites such as [www.PageLess.us](https://www.PageLess.us) to help you find your books for much cheaper than the bookstore. These sites search the internet to show you the cheapest place to purchase your books.  \n\nSome other recommendations would be to check out books at the libraries. Often they will have copies for students to study with. Also, in many cases, if you search 1 edition back from the edition you are assigned, you can save a TONS. Just make sure that it will work for your class.", "author": "bdsherman", "created": 1609734143, "upvotes": 1}, "gi18dtw": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/gi18dtw/", "text": "If you can’t find a PDF you can borrow a copy from a friend or the library and scan it on the library scanners - you will not only get yourself a copy but you can also share with other people in the class", "author": "gayvoter97", "created": 1609733138, "upvotes": 1}, "ghv7bpa": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghv7bpa/", "text": "Good thing rich cheapskates don't exist on reddit", "author": "gttm2019", "created": 1609623981, "upvotes": 1}, "ghuhfa6": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghuhfa6/", "text": "I tried telling my professor this and he replied “absolutely not. You are to purchase the book from my bundle and I expect your work to be completely on time. This matter is closed” - I had told him I did not have the budget for his “bundle” and if there was anyway for me to just purchase one of the five books so that I could receive a grade for the assignment... which was the only assignment that actually required that ONE book in the entire course. \n\nI’m still pissed", "author": "seailoveit", "created": 1609610674, "upvotes": 1}, "ghtsa18": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghtsa18/", "text": "Only had one book this year thankfully. It was discounted through lecturer so 20 euros. Everything else was available through some Google search", "author": "astonaidan", "created": 1609596302, "upvotes": 1}, "ghtrubb": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghtrubb/", "text": ">We’re not supposed to announce that to our class\n\nSo let’s announce it to the entirety of Reddit.", "author": "flipthescriptttt", "created": 1609595977, "upvotes": 1}, "ghtnrl5": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghtnrl5/", "text": "I do it every quarter for one or two professors. About 40% of the time they give me the book or tell me it's not actually necessary. The rest of the time the conversation goes something like:\n\n>Dear Dr. [Name], I have no money and struggle with affording food and rent, and I definitely can't buy this book. Any chance you know where I can find it for free?\n\nResponse A:\n\n>I don't know, ask your classmates and maybe someone can help.\n\nResponse B:\n\n>Check the library\n\nWhich I proceed to do only to find that all the permanent copies are checked out and all the temporary loan ones are taken almost all the time. Or, the book is too obscure for anything except interlibrary loans which blocks requesting assigned books.\n\nResponse C:\n\n>I'm sorry, I don't know how to help you. Maybe Google around, if not, I would either buy it if you can or consider retaking the class at a later point when you can afford the course material.\n\nEntirely unhelpful for a senior a quarter away from graduation who has never had a quarter where I could afford the books.\n\nDefinitely students should communicate with their professors but it  really often doesn't work unfortunately.", "author": "SnowedInByEdward", "created": 1609592683, "upvotes": 8}, "ghth5a7": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghth5a7/", "text": "hmmm", "author": "number7infamilyof6", "created": 1609586024, "upvotes": 1}, "ght9ps3": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ght9ps3/", "text": "That's cool. I wish there was a button to hit that helped you with Grant's though. I met all the requirements for MULTIPLE grants... But, for some odd reason, I \"dont qualify.\"\n\nThey sure thought my pasty behind could afford to pull out a $13,000 loan making 25k a year though 🙄 \n\nYou know, not married, under 30k a year, $1,100 a month for rent, on top of that, car and renters insurance, internet, phone, water, electricity, groceries. Denied for unemployment when I've been laid off since sept, denied for SNAP and every other government funded assistance program known to man kind...\n\nThe government is a joke.", "author": "SlappinThigh", "created": 1609577976, "upvotes": 1}, "ght1eyz": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ght1eyz/", "text": "Great advice, another option is PDF textbooks. I did go through nursing school (and 2 years of science prereqs) by spending less than $200 on books total. Sometimes it was the older edition, and sometimes I had to pay for stupid access to the quizes or whatever other garbage they were trying to make you buy separately, but overall not going through the book store  saved me thousands of $.", "author": "TheVoidWithout", "created": 1609570045, "upvotes": 1}, "ght0uml": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ght0uml/", "text": "Id be surprised if the company themselves didn’t help out for the school. They are selling overpriced Laminated cardboard and paper, they’d profit regardless how much they give away.", "author": "Musical_Offering", "created": 1609569587, "upvotes": 1}, "ghsyik1": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghsyik1/", "text": "Thank you for being a kind and caring Professor. I always say that we should act in a way where at the end of the day we can face our own conscience, our own reflection. But too many people just don’t care. \n\nStrive to be better is the only way forward!", "author": "DedeRN", "created": 1609567737, "upvotes": 1}, "ghsx6em": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghsx6em/", "text": "Not all professors care if you are struggling or whatnot. They just expect you to \"deal with it\" whatever circumstances that is bothering you.", "author": "MelissaArt94", "created": 1609566740, "upvotes": 2}, "ghsq8f3": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghsq8f3/", "text": "You’re AMAZING. I can tell you, as a student who just had an EXCELLENT learning experience with my literature prof, I so appreciate instructors who CARE about their students. We never forget profs like you 🙏🏽", "author": "adventurethyme_", "created": 1609562187, "upvotes": 3}, "ghsihou": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghsihou/", "text": "I really hate when it’s a book written by the professor and they charge $100+", "author": "lil_layne", "created": 1609557772, "upvotes": 18}, "ghsbrzw": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghsbrzw/", "text": "My professor made us get 2 books and asked us questions on 1 tests from the books \n\nWhen we told him the price if the books he responded \"Not my problem!\" He had copies of the book but couldn't lend them out to everyone in the class.\n\nOf course we had one person get the book from the publisher. It was a construction equipment book and we couldn't find it anywhere online.", "author": "nickthatknack", "created": 1609554124, "upvotes": 7}, "ghs8el0": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghs8el0/", "text": "I remember a student early this year in my class interrupting class because he was so upset that the several required books were too costly. I'm not even sure the professor was able to help. In an English class, not even STEM!", "author": "krustomer", "created": 1609552265, "upvotes": 4}, "ghs6ab1": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghs6ab1/", "text": "Seconding this! I teach a large assortment of students from various walks of life. No matter what I will always do what I can to help them. And you should always tell your professor — even if they seem rude about it — it’s better to let them know your situation and show that you want to do the work, but you can’t get the texts right then. \n\nEveryone deserves to be able to participate with the necessary materials regardless of personal circumstances.", "author": "falsecompare_", "created": 1609551095, "upvotes": 8}, "ghs4t15": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghs4t15/", "text": "also, head to the library and check out those books (if they are available). Some schools will even have interlibrary loans between other universities. That's how I survived grad school.", "author": "sirziggy", "created": 1609550267, "upvotes": 6}, "ghs2aku": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghs2aku/", "text": "In non-plague times, I try to always put a copy of the textbook for each of my courses on reserve in the library, so check the library, too!", "author": "TheKwongdzu", "created": 1609548834, "upvotes": 16}, "ghs060v": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghs060v/", "text": "The professor of my bio class was the author. The book was mandatory and needed for the class. I couldnt afford it and she gave me the entire set with a online book code as well for extra resources. She lost profit to help a student in need.", "author": "biogirl787", "created": 1609547627, "upvotes": 139}, "ghrym3x": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghrym3x/", "text": "Professors in the mathematics department at my university often try to use open-source textbooks as to not give money to the authors that release editions upon editions of textbooks just to make slight, often unnecessary, corrections. After all, who doesn't like free and open-source? You're a great professor, thank you.", "author": "OminousRai", "created": 1609546762, "upvotes": 243}, "ghrxy33": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghrxy33/", "text": "[deleted]", "author": null, "created": 1609546390, "upvotes": 35}, "ghrubl3": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghrubl3/", "text": "you are truly amazing. thank you for being a kind and caring professor. we need more professors like you during these troubling times.", "author": "_deathitself", "created": 1609544371, "upvotes": 23}, "ghrfrej": {"link": "/r/college/comments/koi7z0/if_you_are_a_college_student_who_is_seriously/ghrfrej/", "text": "thank you for taking the time to post this, I'm sure it will be very helpful to many people :)", "author": "LindseyNicolexo", "created": 1609536521, "upvotes": 136}}}