{
  "sid": "q4xd20",
  "link": "/r/college/comments/q4xd20/am_i_being_entitled_or_something_for_wanting/",
  "title:": "Am I being entitled or something for wanting there to be some sort of commentary under my grades?",
  "text": "So, I'm in a completely asynchronous class right now and the basic structure is 1 discussion post, 1 quiz per week, with a midterm of the first 6 and discussion posts, and then a final with the later 6, and a few sporadic essays. Right now, I've received my quiz back with a low B, and my discussion posts with a few points knocked off but no comments. I have no clue what questions I missed nor do I know what I did wrong in the discussion posts that earned me points knocked off. Right now I'm at an 85% which isn't bad (though I will be honest considering the amount of studying and notes I took I thought I would have an A because I felt like I Understood everything) but I'm more worried about the future when I have no clue what I'm doing wrong/did wrong, especially with the discussion posts. Is it too much to expect that the prof will at least say what we did wrong on the discussion posts or at least release the questions that were answered wrong? I'm pretty sure Canvas, which is what we use, has an option to release the wrong answers even without releasing what the correct answer was, but my prof has that turned off. I'm just a little frustrated because the rest of the assignments are identical formatting until the end of the term and if the prof doesn't tell me what I did wrong then I feel like I'm going to keep making the same mistake. Thoughts?",
  "author": "bittersweet_teaa",
  "created": 1633825038,
  "updated": 1634083118,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hg1n7e9": {
      "link": "/r/college/comments/q4xd20/am_i_being_entitled_or_something_for_wanting/hg1n7e9/",
      "text": "Have you tried contacting him to ask for feedback?",
      "author": "PhDapper",
      "created": 1633825448,
      "upvotes": 4,
      "replies": {
        "hg1pf1m": {
          "link": "/r/college/comments/q4xd20/am_i_being_entitled_or_something_for_wanting/hg1pf1m/",
          "text": "I think I'm going to. I wanted to give it some time to see if maybe he'd end up doing it later so I wasn't being pushy for no reason but he hasn't so I might talk to him or one of the GEs during office hours",
          "author": "bittersweet_teaa",
          "created": 1633826549,
          "upvotes": 2,
          "replies": {
            "hg1utnf": {
              "link": "/r/college/comments/q4xd20/am_i_being_entitled_or_something_for_wanting/hg1utnf/",
              "text": "Always ask for feedback if you feel it would be helpful and they aren’t providing it on their own accord.\n\nOne question though? Does your discussion posts have a requirement where the initial post itself is due before a certain day? I use Canvas as well, and at my school you get points deducted if the initial post is not posted by Thursday. I don’t know how other schools have it, but maybe this could be a possible explanation if you weren’t aware?",
              "author": "kizeltine",
              "created": 1633829236,
              "upvotes": 2,
              "replies": {
                "hg21vu0": {
                  "link": "/r/college/comments/q4xd20/am_i_being_entitled_or_something_for_wanting/hg21vu0/",
                  "text": "I don't think so but I can double check. The due date is always Sunday nights but I'll make sure I'm not confusing it for the deadline. Thanks for letting me know about that",
                  "author": "bittersweet_teaa",
                  "created": 1633832788,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg28kze": {
      "link": "/r/college/comments/q4xd20/am_i_being_entitled_or_something_for_wanting/hg28kze/",
      "text": "Ask to set up a meeting. That's what office hours are for as well.",
      "author": "DontFeartheTeacher",
      "created": 1633836311,
      "upvotes": 2,
      "replies": {}
    }
  }
}