{
  "sid": "qlgy0q",
  "link": "/r/college/comments/qlgy0q/i_can_only_study_at_the_library_but_i_can_barely/",
  "title:": "I can only study at the library, but I can barely bring myself to go",
  "text": "I guess the hard thing for me is having to get up and go somewhere else to study. I really like to study in the library. I’ll tell myself I’ll go at 11, but I’ll procrastinate and only leave my dorm at 1. Then I’ll get to the library and suddenly my hair is the most fascinating thing ever. Then I put on my classical music and start looking at classes I want to take next semester, etc etc\n\nI really don’t get how people can study for hours at a time, I don’t think I can do it. Does anyone have any tips for me?\n\nAlso, how would someone go about studying for a history class?",
  "author": "Repulsive-Aioli-6671",
  "created": 1635894857,
  "updated": 1636137575,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj2tpm0": {
      "link": "/r/college/comments/qlgy0q/i_can_only_study_at_the_library_but_i_can_barely/hj2tpm0/",
      "text": "Do you have ADHD? I’m not diagnosing you, because I’m not remotely qualified, but a lot of what you described lines up with a lot of what people with ADHD experience. I would suggest getting evaluated if you can, and if you’re diagnosed, finding treatment. \n\nEven if you don’t have ADHD, you might find it helpful to adopt the techniques that people with ADHD use. Stick to a routine, give yourself more time, set timers, break up your tasks into smaller tasks and check them off as you get them done, develop a caffeine addiction, etc. If your hair gets in the way, try to get it out of your way so it’s easier to ignore. If you find yourself looking at classes, set aside time to look, then when the time’s up for that, move in to something else. It’s not easy but it gets better with practice. Good luck!",
      "author": "to_walk_upon_a_dream",
      "created": 1635895811,
      "upvotes": 2,
      "replies": {}
    },
    "hj2ydbs": {
      "link": "/r/college/comments/qlgy0q/i_can_only_study_at_the_library_but_i_can_barely/hj2ydbs/",
      "text": "literally just force yourself, put ur phone on DND and stare at ur work and force urself to do it",
      "author": "SnooChickens3108",
      "created": 1635897749,
      "upvotes": 1,
      "replies": {}
    }
  }
}