{"sid": "oyhfsl", "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/", "title:": "You don't have to drink or party if you don't want to", "text": "Since school is starting back up again I just wanted to make this post to help and warn people. \n\nIf you're not a drinker or partier don't feel like you have to go out and do those things because \"everyone else is doing it and it's part of the experience\". Not everyone is doing it, plenty of people don't drink or go out partying and they still have fun, they still make friends and they still have great memories. \n\nDon't feel obligated to do stuff you wouldn't normally do because your roommate or friends are doing it. It's okay to tell them no!", "author": "elyse-on-reddit", "created": 1628169752, "retrieved": 1632801934, "over_18": false, "upvotes": 1680, "upvote_ratio": 0.98, "comments": {"hd64mmf": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/hd64mmf/", "text": "This!!! I don't drink or do drugs or anything like that. Not because of religious reasons or anything of that nature, just because it's just not my cup of tea. I prefer to just stay in and veg out on the couch and watch YouTube videos. I'm also an introvert so that probably explains it.\n\nI really hate the idea that society pushes on us that you have to get blackout drunk every night to be \"cool.\" (I know I'm exaggerating lol, but I do that when I rant) What, so not drinking until I lose consciousness and puke or whatnot makes me a loser???? Like I'm going to fail at life just because I'd rather watch videos than get higher than Mount Everest???? Am I going to be a social outcast for the rest of my life because I don't torture my lungs by smoking a pack of cigarettes a day???? No, I won't. That's BS.\n\nI don't have a problem with people doing that stuff if that's what they're into, as long as it doesn't affect my life (shoutout to one of my suitemates last year who would smoke in our connected bathroom, making the suite smell like pot and forcing me to leave the room just to chill on YouTube at midnight because I couldn't deal with the smell) but 1) don't be like my suitemate and 2) don't try to push your lifestyle on other people. Not everyone is into pregaming 24/7.\n\nSorry for the rant, and thanks for coming to my TED talk lol :)", "author": "DanielaThePialinist", "created": 1631852523, "upvotes": 1}, "hb3xnlb": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/hb3xnlb/", "text": "I didnt drink at all in college. From mg experience this is what ill say (im not saying my experience is the knlg experience):\n\nI agree on everything said in the post. I think your experience will  depend alot on who your friends are. I was the ionly one of my friends who didnt drink. Nobody really pressured me to drink but i was asked on a routine basis about drinking, especially when people around me were drinking and i wasnt. Even though saying no once got people to stop asking, hearing it asked by 10 different people every night did get draining and having to answer why i dont drink. Again, nobody pressured me but i sometimes thought about drinking just to avoid getting asked. I never did though.\n\nI did want to hang out and party but because i didnt drink many people never kept me in the loop on a parties especially the friends i was closest to. I called them out on it once and they told me “we thought partying wasnt your thing”. Which i felt is an excuse they told themselves to not invite me. My friends did try after that and i appreciate they did but i could defientely tell i was always the 3rd wheel of the groupI\n. I never felt like i had a close bond with them and i think because i never drank with them we never created that close bond people create when they can get drunk together. I had a good time in colege but i wouldnt say i had all the fun i couldve had. Im slightly introverted so i also didnt do as much to find things to do outside mg friend group. I think the experience i had with my friends made me self conscience about not drinking in college.\n\nIm saying this to say: make sure you get friends who if they do drink, dont mind keeping you involved and if they dont, dont be afraid to be by yourself while you find new friends.", "author": "ea0995", "created": 1630445611, "upvotes": 1}, "hana8ci": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/hana8ci/", "text": "I go to a commuter school and there's very little \"college experience\" at it so it's always crazy to see posts like these", "author": "LUnacy45", "created": 1630124967, "upvotes": 0}, "haf2vpe": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/haf2vpe/", "text": "People act like this is the only way to make friends. Does anyone actually make real friends at parties?", "author": "OhHiMarki3", "created": 1629982492, "upvotes": 1}, "h9mgx1w": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h9mgx1w/", "text": "Get wasted and if you don’t, you have the rest of your life to party and have fun", "author": "LizardKing50000", "created": 1629433340, "upvotes": 1}, "h7yxvvo": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7yxvvo/", "text": "in my uni, party is obligated for freshman student (the non alcohol party, but some of them still drinking it). the party is almost every week for a whole first semester and it's organized by the student association in my faculty. the purpose is to get to know each other with other students (but i think its more like time for the seniors to show off) and there is attendance check that we can't missed it more than twice. This is very serious rules. If we break it, we can't take our Bachelor's Certificates  from uni or we have to do it over in the next year with the new freshman. it's very depressing actually", "author": "notreadytobe20", "created": 1628277402, "upvotes": 5}, "h7yio9f": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7yio9f/", "text": "Agree, I’m now a junior and wished people wouldn’t have talked me into drinking hard liquor. Alcoholism runs in my family and it hasn’t been an easy ride. Take care of yourselves people", "author": "jonray_", "created": 1628270911, "upvotes": 2}, "h7wzjlh": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wzjlh/", "text": "If you dont drink, dont be that one sober person that’s too cool for the party. Alcohol makes it easier to do the lame shit like say “Aye” and bounce to songs that you don’t listen to. If you aren’t gonna drink, don’t be that person in the area acting too cool, making fun of the music shit like that just be chill if you not gonna drink", "author": "wooski29", "created": 1628241849, "upvotes": 3}, "h7wtlnr": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wtlnr/", "text": "I made a lot of my early college friends through local clubs and orgs. Those are the people i prefer to have a drink with. Any random party I've been to or was invited too was boring as hell and honestly depressing no matter how fun people seem to be having.\n\nIn my experience, make friends first, then party with these people. Not the other way around.", "author": "ctjfd", "created": 1628236705, "upvotes": 1}, "h7wpdsm": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wpdsm/", "text": "Speaking as a middle aged guy who didn't like to drink and party in college, I have always regretted not partying and socialising more back in college. Take that how you will.", "author": "z1lard", "created": 1628233171, "upvotes": 5}, "h7wmudd": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wmudd/", "text": "Don’t tell people what to do. Fascist", "author": "jmg850", "created": 1628231154, "upvotes": -2}, "h7wlaj3": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wlaj3/", "text": "When my friends urge me to drink more and I don't want to, I firmly say I'm good. I strongly encourage others to do the same.\n\nObviously you should have fun, network, and be social. But remember, you are always in charge of your own consumption and productivity.", "author": "MissionCattle", "created": 1628229971, "upvotes": 3}, "h7wgxdy": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wgxdy/", "text": "It’s also okay to try things new. Still be responsible but this is the time to try new things and see what you like or don’t like to do", "author": "joc307", "created": 1628226835, "upvotes": 1}, "h7wbqv2": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wbqv2/", "text": "I just graduated college without partying or drinking once. I had so much fucking fun with my favorite people going to dinner, movies, parks, road trips, getting snacks and take out, etc. I’d do it all again. Just do what you want with the people you want to. :)", "author": "dreamer0303", "created": 1628223519, "upvotes": 6}, "h7w927y": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w927y/", "text": "My co worker could not wrap his head around the fact that I don’t drink and I’m in college. When I told him he replied in all seriousness “I guess there are other things to do”", "author": "emo_goth_vegan", "created": 1628221992, "upvotes": 1}, "h7w8y0y": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w8y0y/", "text": "Do you. Think for yourself.", "author": "Kono_da_Dio", "created": 1628221930, "upvotes": 0}, "h7w46nn": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w46nn/", "text": "Thank You! I do not drink and I am totally not a partying type. I have fun just by making friends, talking to people and maybe playing video games together. People including my parents are telling me to get involved in so many \"activities\" so I am a sociable person. Thanks for posting this, I now feel like there are more people like me and that I do not need to do things I am uncomfortable with.", "author": "SaintJay41202", "created": 1628219452, "upvotes": 7}, "h7vvbxo": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vvbxo/", "text": "How do you find friends who want to be chill and boring though 😥", "author": "afunnywold", "created": 1628215078, "upvotes": 0}, "h7vttla": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vttla/", "text": "i’m going to a school that’s really conservative with that stuff (we’re not allowed to drink AT ALL). i don’t have the right to complain because i knew the rules going into it, but it’s still a little intimidating. how am i ever gonna get to experience that stuff?", "author": "Empathetic-Pear", "created": 1628214343, "upvotes": 1}, "h7vq35k": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vq35k/", "text": "DONT get plastered your first week of college. You won’t be a pussy or anything people call you for taking it easy. Figure out your limit and what you’re comfortable with. People who enjoy drinking know their limits and only drink with those that they are comfortable drinking with.", "author": "jz20rok", "created": 1628212536, "upvotes": 5}, "h7vkh68": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vkh68/", "text": "Actually there’s a rule and you absolutely have to and they’ll kick you out if you don’t", "author": "clever_cow", "created": 1628209766, "upvotes": -1}, "h7va0au": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7va0au/", "text": "True story from Wayback in the ancient days. I grew up during the Nancy Reagan “just say no“ era, and at my very first college party, some guy offered me some weed. My head was racing about peer pressure and just saying no, and I said “no thanks.” And he said “cool.”\n\nBe safe, and don’t do anything you don’t want to do.", "author": "CreatrixAnima", "created": 1628204632, "upvotes": 8}, "h7v88tt": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v88tt/", "text": "The real question is, how do I get invited to a party in the first place", "author": "ZestyLemon289", "created": 1628203804, "upvotes": 7}, "h7v4kpd": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v4kpd/", "text": "Im a college junior. It took me two years to find people that still wanted to hang out with me even though I don’t drink/party. Don’t do something you don’t want to do or will regret just to make people like you because they aren’t your friends anyways.", "author": "ChemistryxCat", "created": 1628202127, "upvotes": 7}, "h7v45p2": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v45p2/", "text": "u/elyse-on-reddit I am a junior in college and am not big on partying hard, but i do enjoy a beer or two or cocktail at the end of the day. My roommate, who is super cool, is a member of the PKT (Phi Kappa Tau) fraternity. I have always told my roommate that if he is ever in a situation where he has been drinking and needs help getting back to our dorm room, that he calls me or has a trustworthy friend call me so that i can help him make it back safely.", "author": "DConMont505", "created": 1628201941, "upvotes": 3}, "h7v0tjp": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v0tjp/", "text": "Just do it. You'll regret it later. If you're not a drinker, find your limits and don't act a fool. Just be safe and have fun. College is useless otherwise.", "author": "CosmicMegaDonkeys", "created": 1628200457, "upvotes": -4}, "h7u8ehm": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u8ehm/", "text": "Back in my old university it was very hard to make friends. I’m an international and it was a state school so everyone knew each other, and they weren’t keen on accepting internationals to their friend group. On top of that, if you didn’t drink or party a lot of people would exclude you because most of the unvifsoty was the type of people that cared only for booze.", "author": "ElBarro69", "created": 1628188622, "upvotes": 4}, "h7u0nnx": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u0nnx/", "text": "If you do choose to party make sure you get a pair of shit shoes,  I mean a pair of shoes that look nice but you don't care if they get ruined because they will get ruined. There's a lot of spilled beer vomit and other things on various basement floors And you will be walking through it. on a side note Do yourself a favor if you want to wear heels wear boots with closed toes,  Just trust me on this more than one of my female friends has gotten unpleasant things on their feet because they wore heels to a party.. If you are going clubbing and not to frat party  You might be OK with the heels but just have a pair of flat shoes that that you think are cute but you don't give a crap about to wear to parties and that sort of thing because trust me by the end of your 2nd quarter there will be a great deal of destruction associated with o'shoes and they will be in bad condition you're probably just going to want to toss them at the end of the year and get a new pair for the following year if you choose to drink and party", "author": "pygmypuffonacid", "created": 1628185514, "upvotes": 27}, "h7tyyxm": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tyyxm/", "text": "But if you do decide to drink full send it", "author": "ORCA_OF_WALLST", "created": 1628184822, "upvotes": -2}, "h7txvqx": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7txvqx/", "text": "This is a good reminder. You can still go out and meet people, but just hold the same cup all night long or drink water or the chaser. People should not feel pressured to do more than they feel comfortable.\n\nI went to a \"party school\", where just about everyone partied. But most people knew how to turn off the switch at the right time to get stuff done. Find your own pace and don't forget why you're at school in the first place.", "author": "Roxybird", "created": 1628184378, "upvotes": 21}, "h7txnq3": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7txnq3/", "text": "Can I add - if you DO become interested in drinking, learn some alcohol safety first. Learn how many drinks would get you tipsy then drunk based on your weight. Learn what signs are for alcohol poisoning and how to handle that kind of emergency (call 911). Drink your first time around people you trust, and just try to observe how you feel after a drink or two. Don't drink more just because you're feeling good, at a certain point drinking more doesn't increase the good, fun part of drinking, you just make yourself more at risk of getting sick or blacking out. Eat food and hydrate before you drink, drink water while you drink. Don't drink in college without friends around, it's really important to be able to look out for one another, especially at larger parties. Always keep an eye on your drink. Don't drink to cope with mental illness, instead seek out healthy coping mechanisms, therapy, etc. Never drink and drive, and never ride with someone who's had alcohol or is under the influence of any other substances. \n\nThose are just some basic tips. Good luck, and yes, you do not have to drink at all if you don't want to. Good friends won't care and will respect your choices. If you don't like being around when they drink, if they're good friends, they'll be cool with trying to do things other than party / incorporate some hangouts that aren't centered around drinking. (But if they're just having a drink or two, it really won't make much of a difference when hanging out with them. There is a difference in a casual drink and \"drinking\" as the main reason for the hangout)", "author": "dontcry2022", "created": 1628184287, "upvotes": 118}, "h7tvwt2": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tvwt2/", "text": "Last year I told my roommates (who I’ve never met before moving in) that I’ve never drank before and they were so shocked. I didn’t know it was such a big deal to have never drank before and because of religious and personal reasons I don’t ever plan to.", "author": "sunshinexxxo16", "created": 1628183566, "upvotes": 12}, "h7trx7r": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7trx7r/", "text": "[deleted]", "author": null, "created": 1628181921, "upvotes": -2}, "h7tqwqq": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tqwqq/", "text": "Never feel peer pressured to drink, smoke, so drugs, or anything that makes you uncomfortable is the real message", "author": "Lifedeather", "created": 1628181506, "upvotes": 11}, "h7tl4iy": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tl4iy/", "text": "This is the basic scenario that happens all the time:\n\n“Hey we are packing a bowl outside wanna smoke?”\n\n“Nah I don’t smoke”\n\n“That’s fine man you still wanna chill with us?”\n\n“Yah 🙂”", "author": "nhaire123", "created": 1628179128, "upvotes": 217}, "h7tiznc": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tiznc/", "text": "I disagree with this advice. You'll have a bad social life if you do this. Even people who aren't hard partiers will think you're weird.", "author": "deepad9", "created": 1628178240, "upvotes": -25}, "h7tidaq": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tidaq/", "text": "but but i want to feel included :(", "author": "charlvs", "created": 1628177976, "upvotes": 33}, "h7tgref": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tgref/", "text": "Maybe it's more of an american thing but kids don't really do that shit where I live. No one organizes college parties here in my town, I've never heard of it, I only see these things in movies. And tbh, I've never felt obligated to do any of it. I've never felt the desire to drink or party, especially with my awful introversion and anxiety and I don't feel like I'm missing out on anything. I honestly don't understand the entire concept of partying in college.", "author": "ana9997", "created": 1628177295, "upvotes": 13}, "h7tescs": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tescs/", "text": "Recently graduated senior here (that still feels so weird to say…)\n\nDuring my four years, I was never pressured to drink or smoke when I didn’t feel like it, nor did I receive any shit from anyone for turning it down. \n\nObviously my experience isn’t the be all end all, but if you find yourself around people who are genuinely pressuring you or giving you a hard time over it, they aren’t worth it. \n\nIf you do party, drink, or try any substances during your time college, do so under your own free will. And above all else, be safe!", "author": "bakedpotatowcheezpls", "created": 1628176456, "upvotes": 73}, "h7tchli": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tchli/", "text": "And realize the friends made partying are not always the best", "author": "pkelsey93", "created": 1628175455, "upvotes": 64}, "h7tc8ym": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tc8ym/", "text": "you shouldn't be partying or gathering pretty much at all until your college knows what's going on with the Delta Variant of COVID-19, in my humble opinion", "author": "ConnorCarbon", "created": 1628175348, "upvotes": 8}, "h7t6f4i": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7t6f4i/", "text": "And if you are going to party/drink, go to house parties of people you know. If you have to search for an invite it is not worth it.", "author": "kripplemk", "created": 1628173342, "upvotes": 623}, "h7t12tp": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7t12tp/", "text": "yes. I'm glad someone said it. you don't have to drink or party. actually most people who are successful in college don't.", "author": "aguafreska", "created": 1628171992, "upvotes": 15}, "h7sxukp": {"link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7sxukp/", "text": "Take it this way: Yes, you do have to drink.  You don't have to drink alcohol, but just having a glass in your hand will make everybody feel better.", "author": "toolnotes", "created": 1628170492, "upvotes": 206}}}