{"sid": "js8wb0", "link": "/r/college/comments/js8wb0/a_letter_to_professors/", "title:": "A letter to professors", "text": " \n\nDear college professors,             \n\n*We are doing our best*\n\nI know it may seem like we are slacking and not participating, but these last few months have been tough for all of us. Our school years were cut short, trips were cancelled, and we were *forced* inside all summer. As college students have all faced some sort of hardships during this time that need to be understood—and possibly given some compassion in how you deal with us.\n\nI am now a freshman in college, and it honestly does not feel like it. I sit at home all day, losing the motivation to do anything—especially school. I sit behind a camera and listen to...\n\n**Lecture after**\n\n**Lecture after**\n\n**Lecture...**\n\nIt is getting Exhausting\n\nIn high school, I was never one to procrastinate, but ***now*** it’s normal for me because home was always a place for relaxing, and limited learning. Online classes make me feel like I have all the time in the world to finish assignments, but then I get assigned even more homework in another class. At that point, I get stressed with all the work I have to do that *could* have been finished at an earlier time.\n\nThere are many distractions surrounding us at home and it is hard to block them out. Whether it be our family talking, our pets making noise, or just our minds wandering. It is not easy to keep one’s mind focused on a screen for a whole class period, the mind does start to wander.\n\nThere have been times where I am in a class and **BOOM** I completely blank and I start to think about other things and miss something important that the teacher was talking about. Yes, I had this problem in person-to-person classes too, but *never* as bad as I do now. Teachers are not there to get you back on track, so it is up to you to keep yourself engaged, which is hard when you are on a screen for most of your day and have little to no interaction with fellow classmates or teachers. \n\nTo help us stay engaged small group discussions often can help. This gives us time to talk to our peers we usually don’t get to and hearing other people’s comments can really help to understand a subject.\n\nThis little to no interaction with teachers and fellow classmates is difficult, but it is also hard because I was looking forward to making new friends during college, and now, it seems almost impossible. There’s no time for us to get to know each other, other than when we get put in a breakout room for no more than 20 minutes. Even then, I feel isolated. \n\nWhen you cannot make new friends due to not having the time to get to know each other, life becomes lonely. And loneliness has had a huge effect on my school year, forcing me to shut down at times because I do not know where to go for help when I need it, and I do not want to disturb my friends when they are going through the same things.\n\nWithout the interaction I’m used to, I find it hard to wake up in the morning knowing that I will have to stare at a screen for how many hours of homework I happen to get that night. I feel like my whole life is school now and there is no time for me. I know I am not the only one feeling this way. \n\nMy friends and I have talked about our experiences with online college and most of the opinions were *not* positive. Our lives have become the same routine everyday.\n\n# Wake up, get online, do homework. \n\n#                            Wake up, get online, do homework. \n\n#                                                     Wake up, get online, do homework. \n\nWith all of the screen time everyday that students have, you could give us breaks throughout the lecture and give us time to take a step back and breathe. Time away from the screen is important. \n\nFor me, school is easier to get through when you have friends that are there to help you. Since the start of the fall semester, I have not talked to many of my friends that I used to talk to everyday. \n\nPhysically being at school was *so* much easier because we knew that it was a place to focus and get work done. Now after a long school day, we just close our laptops and *pray* we make it through the semester.\n\nThis is a new experience for all of us. Most students were going to school in person before the pandemic started and now everything is different. It is hard to go through change so fast and sudden. We never expected a pandemic to derail our lives, but it has. \n\nTake the time to think of the way we are feeling and understand that many of us would rather be in person, just like you would.\n\nSincerely,\n\nA Stressed Student", "author": "ILoveCats924", "created": 1605104290, "retrieved": 1632946876, "over_18": false, "upvotes": 1923, "upvote_ratio": 0.96, "comments": {"gclz2ks": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gclz2ks/", "text": "I feel related here. Couldn't agree more.", "author": "RY_Charis", "created": 1605621802, "upvotes": 1}, "gc3n37q": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc3n37q/", "text": "Honestly, I think it is hard on both sides. I've had professors break down in class and have seen my class mates struggle. I did online community college through out most of high school but this seems to be a different monster. None of my teachers are trained in online learning and end up making it closer to onsite learning through zoom. This isn't healthy for either side so the current format is not the best. Some students don't have an appropriate place to turn their camera on in class and then the professors complain about us being lazy. Most of my classmates have never had to deal with online school before so it is a challenge. The professors aren't used to this  format and end up making waaaay harder than it needs to be. We need to understand each other more in this hard time and be more compassionate on both sides. I see this comment section becoming into an age war when it isn't. We all miss our friends and we are all anxious to go back on campus. Just don't start pointing fingers at each other on who's to blame and who's harder to deal with. I do agree that the homework needs to be a little easier for those who have not been online but I also agree that the students need to give their professors grace. Most of us have lost a family member to this pandemic and we are all grieving.  Just go easy on both sides and things will run more smoothly.", "author": null, "created": 1605224769, "upvotes": 1}, "gc166f4": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc166f4/", "text": "my school got rid of spring break but i just found out fall sem ends next week and spring sem doesnt start until february! thats so long! however its going to make spring sem seem stupid and unimportant and ill just be lounging around so like. probably gonna drop out. anyways yeah having to plod along really sucks and ive taken to helping homeschool my sisters just to interact with other people", "author": "Chrysomaline", "created": 1605175687, "upvotes": 2}, "gc0tyod": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0tyod/", "text": "As an instructor it always makes me really sad to hear things from my students like this.\n\nHonestly, it's a huge puzzle. What I'd be interested in would be your concrete suggestions for how to be better.\n\nHere's the puzzle:\n\nImagine you are instructing an 800-person intro to sociology lecture. \n\nYou have to give everyone a grade based on their mastery of the material. All of your policies have to be fair and will be used by try-hard students, students who are trying to game the system, depressed students, students who are working, students who have families and full time jobs. So you better make them fair. \n\nAlso, you have to manage 8 TAs, who have weekly sections.\n\nHow do you make people show up for section and actually interact with each other (and turn on their cameras)? \n\nHow do you have the TAs grade them? Based on participation? Do you force students to turn on their cameras? Do you make them do unsupervised breakout rooms? Do you have them all in a big conference call? One way to help them participate is to force them to turn on their cameras. That is considered cruel by many. Another way is to give them a pre-section assignment so they all show up prepared. But that's extra work (busywork)--the price for a better discussion. The payoff is that students get to talk to each other. \n\nHow do you do lectures? Live lectures are incredibly awkward. You're talking to an empty room of 800 squares. And if you mess up in some way you could be recorded and distributed on the internet as a meme. Plus managing the chat is difficult.\n\n Asynchronous lectures are boring for students and unmotivating to watch.\n\n... Do you upload slides? Well, if you upload slides with every word, they won't watch the lectures. They'll just use the search function when they need to, thus not learning the material.\n\nHow do you do exams? You can't stop cheating. Students create massive group chats and share answers. Do you make them open note? Now you have to write a tricky exam for students that's hard enough, easy to grade 800 of, and not easy to cheat on. Good luck.\n\nYour best bet in many cases is to just give more individual, un-cheatable assignments... But it's more work. And not just for the students--for you too, grading. And with extensions.\n\nPlus, how do you deal with it when a student misses an exam because of internet issues? Or because their family member dies? Or because they have to work? How strict are you?  If you're not strict at all/have no rules, you're making it demotivating to do the work. \n\n(And also, it's a royal pain to give extensions in a class over 20 people--you have to keep track of them, and remember them and enter them correctly. Good luck with your 800-person lecture). \n\nAnd if you're kind/lenient, what happens when it becomes a pattern? If a student misses 6/10 sections, do you grade them the same as other students who didn't? If a student doesn't do half their assignments because they're depressed, what grade do they deserve? (Which is to quantify their learning of the material). \n\nAlso, as others have mentioned, teaching isn't fun right now. I'm getting so many emails all the time, and they're all bad news. They have some issue with the class, or they need an extension with something. Almost all of my interactions with students are time consuming, and neutral or mildly unpleasant.\n\nPlus, we are dealing with the isolation too.  We all live in our rooms also. Many of the students have moved home. You are living with your families, near your friends. A lot of instructors are graduate students, or professors who aren't from here. They often have very few friends, and no family nearby. Plus, we are supporting ourselves. Many have children too. Grad students are instructors, students, AND research slaves. \n\nAnd... it's a lot of work to plan a class, and make the above decisions. Plus, to write tests. Plus, to be familiar with the material well enough to teach. Teaching a class (especially for the first few times) is about the same amount of work as taking 2-3 classes. You are responsible for all the deadlines and assignments (you have to do them to design/explain/grade them). You have to answer to a lot more people.\n\nBut the hardest part is the emotional labor to show up, and deal with students. Not only do we have to make these decisions, but we are expected to make material that's so engaging that it can compete with other things on your computer--that you'll want to do it over Netflix, or video games, or other content put out by massive corporations with huge budgets, huge teams, or at least (like tik tok) no educational material to bake into their entertainment.\n\nIt's not that teachers don't care. (Well, sometimes they dgaf, but that's not a coronavirus thing, that's a problem with the incentive structure for tenure... They're graded on their research, and their teaching is like small homework assignments).  \n\nIt's more that it's a truly difficult task, and we don't know how to deal with it better. But real suggestions are helpful.", "author": "fiftycamelsworth", "created": 1605166637, "upvotes": 3}, "gc0spou": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0spou/", "text": "It sounds like you’re having a harder time adjusting to college than to online school.\n\nWhat exactly gave me this impression is you saying that you procrastinate, then get assigned more work in a separate class and then wonder why your professors do not give you an extension on the initial work.\n\nUltimately it is not on your professors to motivate you, it is on you. Either do the work or don’t but it isn’t your professors job to pass you just because you prefer in person to online.", "author": null, "created": 1605165710, "upvotes": 2}, "gc0l26v": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0l26v/", "text": "As a college freshman, living the same way , I feel exactly the way you do :( solidarity", "author": "xwintercandyapplex", "created": 1605160760, "upvotes": 2}, "gc07t9q": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07t9q/", "text": "im sure they know this. also, how are you lonely but then say your friends are going through the same things but refuse to get closer with them? if you're all lonely that would be a good step to feeling a tad bit better", "author": "zarnonymous", "created": 1605152708, "upvotes": 1}, "gc07f7q": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07f7q/", "text": "As a senior, the burnout is absolutely real. I don’t even want to do a spring semester because I know I’ll have no motivation to finish it out.", "author": "NaranjaEclipse", "created": 1605152472, "upvotes": 2}, "gc04xap": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc04xap/", "text": "This is my last semester of college. I've worked full time for the last two years while in college full time. I've never really had free time but before things went online, I felt more motivated to do my homework. I was able to push myself to work on homework and study from the minute I got home to the minute I went to bed. \n\nI haven't been able to do that since everything went online. I'm struggling to force myself to work on assignments. I understand senioritis is a thing, but it feels like there's no point right now because we're alone and overwhelmed.", "author": "Cat_Panda_Canda", "created": 1605150981, "upvotes": 1}, "gc03tlb": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc03tlb/", "text": "When I was 19, I was at war. Zero Pity from me.", "author": "CrazyHorse_CFH", "created": 1605150336, "upvotes": -1}, "gc02uj1": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc02uj1/", "text": "My school announced that there will be no spring break this year to “discourage” traveling. Not all college students are 18-20ish. My kids still get their thanksgiving break and I would like to actually spend time with them, even if it’s at home 😭", "author": "meowdeline420", "created": 1605149778, "upvotes": 5}, "gc02fkw": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc02fkw/", "text": "A lot of us have work still also so it’s like more time to study, more lectures, then working. Honestly there isn’t really a day that I just feel okay. It’s like constantly feeling behind or discontent.", "author": "ThatWhiteBoah", "created": 1605149537, "upvotes": 3}, "gc02fkd": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc02fkd/", "text": "Same situation with professors. We don’t write open letters. Let me elaborate and give you a real life scenario.\n\nWaking up to kids unexpectedly crying, or maybe parents who need medical attention, have to drive to pharmacies to pick up meds. Kids getting sick/needing shots/ etc.\n\nOk, you ran and handled kids needs, but now you have to skip breakfast, ok just coffee, fuck coffee no time, prepare mic and laptop ASAP, lecture, answer emails, grade homework, write/revise research proposals, online office h, update lecture materials, answer colleagues emails, zoom meeting with student, zoom meeting with department head or admin, zoom meeting with program officer, screen applicants, zoom meeting with undergrad committee A B C D, international zoom meeting with collaborators, zoom meeting with conference organizers. Review grants, review peer-reviewed papers.\n\nLearn this new online platform that the department proposes to use, learn how to use another platform that your colleague prefers to use. Switch from Microsoft to Google to Apple accounts and whatever the fuck the Univ decided to use within several min. Meanwhile got emails from impatient students “did you get my email my dear servant professor?” “I’m submitting a regrade request because I deserve partial credit and I know how to grade my exam better than you do”\n\nAs you make the plan to Write and revise academic papers, handle student complaints, ... then it hits you.\n\nOh, spouse is washing the dishes and changing the diapers, at least I have to cook lunch, and dinner, and kids want to play with you. Wait we are out of milk... pick up your phone, and got a text from dept head. Oh one student got corona, now you have to switch assignment and make it “not too stressful”. Oh one colleague also caught it, and potentially others, another zoom meeting to discuss worst case scenario. \nOh now conference can’t go but it’ll switch to online.\nHey new online platform to learn.\n\nThen as you tried to wind down, catch a quick rest, spouse said “I think I will have to quit my job/ our company is doing massive layoffs”\n\nAnd you sighed .. you also remembered that you haven’t showered or... (did I skip brushing my teeth? Did I shower yesterday? Do we still have enough toilet papers?).\n\nAnd you get an email. Your best friend/colleague, a non citizen, told you that his parents have passed away but he cannot go to visit because our case is the highest. By the time he finishes his quarantine his parents would have been buried. You are wondering .. how do I console him..saying nothing is the best perhaps but.. you can’t be there with him because he is in a state with the highest outbreak rate!!\n\nYou think students life is tough?? Are you that self-centered?? Sorry to say this, fuck your motivation. Just imagine that we are in the midst of another World War. People back then don’t think about losing motivation. We just need to think about how to SURVIVE this stupidity.\n\nDon’t get me wrong I understand but EVERYONE is suffering, greatly. And professor is not at the worst situation, doctors, nurses, grocery store workers, funeral workers are at a much worse situation. At least you don’t hear in the news that one professor is dying after another.\n\nEveryone is greatly suffering here because the leaders of this country have been grossly incompetent, and approx. half of the America wanted another 4 years of this.\n\nAnd to boldly said “liberate state X Y Z !!” , “open the country” “I think the science doesn’t know.” “We have to take back the country from doctors”.\n“Don’t let COVID dominate your life”\n\nHa? Like what Dave Chappelle said, with that mf getting on a chopper and receiving VIP treatments, it’s like you drive down to a homeless neighborhood, eating a juicy burger walking around and saying to homeless people “don’t let hunger dominates your life my people, nom nom nom”\n\nSorry for the long rant, but fuck this open letter, fuck the anti intellectual movements and please wake up.", "author": "chulala168", "created": 1605149537, "upvotes": 2}, "gc00rr6": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gc00rr6/", "text": "It feels like I'm on my laptop all day every day, seven days a week with 16 units. I take some breaks, but the only times I've left my home since the quarter began were to get groceries and to go to the dentist, I've gone on a walk twice. I just want to cry all the time. Right now I'm just laying in bed with my laptop and homework next to me, taking a quick break. All I want to do is sleep.\n\nI was just now assigned a paper in one of my classes too, due Thanksgiving week.\n\nI'm also a new transfer, this is my first quarter at a new college and I just feel so alone. I get emails for random zoom events but I have no motivation to attend them because they're just more things to worry about.\n\nAn edit an hour later: I'm just mentally exhausted, my homework is tomorrow me's problem lol. 😔", "author": "Sunnyroses", "created": 1605148587, "upvotes": 12}, "gbzwg5h": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzwg5h/", "text": "This. This is exactly what I’ve been feeling and you put it to words, thank you so much.  I hope this moves some professors to a different type of action.", "author": "-MythicKnight-", "created": 1605146121, "upvotes": 1}, "gbzvqyw": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzvqyw/", "text": "I don't even do homework. At this point, I just wake up, go to class, play games, take a break to do some homework, and then play more games, rinse and repeat", "author": "Daxmvarg", "created": 1605145732, "upvotes": 1}, "gbzqgoq": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzqgoq/", "text": "It especially hasn’t been better after I got Covid. I went from being forced to sit in a lightless room to being back at home since my parents didn’t want me to stay. I’ve spent some of the past few days just crying or barely able to get out of bed as the work from weeks before pile up . I’m trying my hardest but it still doesn’t feel like enough.", "author": "Wringl_-_-_", "created": 1605143169, "upvotes": 1}, "gbznqeg": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbznqeg/", "text": "Well I’m depressed and shit and have anxiety out the ass so I guess I am slacking but it’s not because I don’t care", "author": "KING_COVID", "created": 1605141792, "upvotes": 0}, "gbzg9yc": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzg9yc/", "text": "I am not crying your crying", "author": "That_Type_Of_Guy399", "created": 1605137772, "upvotes": 1}, "gbza6v4": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbza6v4/", "text": "I was hospitalized for poor mental health and my professors were NOT understanding or helpful", "author": "ka-it-", "created": 1605134501, "upvotes": 6}, "gbz3uu0": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz3uu0/", "text": "I have a stupid research paper to write and we literally need scholarly sources which which aren’t free. When told to go to the library, I told my English professor “you do know the library is shut down right?” Because our school is back on lockdown after over 500 on campus cases.", "author": "RogueApollo01", "created": 1605131125, "upvotes": -4}, "gbz3h4d": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz3h4d/", "text": "I’m a senior next semester and worked 60+ hours a week as a freshman and 40+ as a sophomore and half of my junior year. I don’t remember being this exhausted doing it then. It’s really bad being stuck on campus in your dorm, wake up, shower, sit at your desk next to your bed and go through lectures, homework, maybe get dinner if you aren’t too tired, bed and repeat. I’m a history major and rec and park admin minor so it’s really weird not being able to go to the library or having in person classes.", "author": "KaiserThrawn", "created": 1605130900, "upvotes": 1}, "gbyvj58": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyvj58/", "text": "[removed]", "author": null, "created": 1605125484, "upvotes": 10}, "gbyrhck": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyrhck/", "text": "Noted!", "author": "Marky_Marky_Mark", "created": 1605123481, "upvotes": 2}, "gbyp4ro": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyp4ro/", "text": "Slightly unrelated, but you mentioned how you struggle to wake up because you know you’ll just sit in front of a screen. I’m a senior in high school taking mostly community college course, and over the last two years I have done everything I can to immerse myself in a virtual work environment - digital notes, calendars, todo lists, lecture recordings etc. I even went and spent a summer’s worth of savings on an iPad Pro, and a custom PC a year later, just to improve my setup. Now that I’m being forced to use technology 100% of the time, I feel so sick and tired of school, and I’ve gone back to taking notes on paper and spending a little extra to rent a physical copy of a textbook, rather than buying the ebook version. \n\nI absolutely hate that professors are assigning so much more work this semester because were at home and they feel like it’ll make it easier, because now I’m so sick of everything I do. I stopped watching shows on my computer, I stopped playing video games, hell I even stopped writing music, because I’m already spending so much time on zoom that I just can’t stand it. I really wish professors were a little more understanding and compassionate.", "author": "Kachi3", "created": 1605122320, "upvotes": 12}, "gbyofy9": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyofy9/", "text": "I'm still on campus but we have NO breaks this semester. I got incredibly burnt out for a few weeks and ended up doing only 4-5hrs of work per day on average for 1-2 weeks. Last week was midterms and next week is finals. I've been doing 8-10hrs of actual work (excluding breaks and being unproductive) per day for the past 1.5 weeks. I'm tired. I'm stressed. Yesterday I only had one meal and a snack. Last week I went maybe 3-4 days without showering cuz I was so busy. I couldn't sleep from stress", "author": "Isekai_Trash_uwu", "created": 1605121971, "upvotes": -1}, "gbykjeq": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbykjeq/", "text": "I just wish some Professors didn't have a double standard this semester - We keep on getting assigned more work, but they're at least a month behind on grading. I understand that they're just as busy as us, but I honestly have no idea how they can expect something to be due on a certain date when they're not gonna look at it for at least a week. Some of my Professors are understanding in that way and have allowed extensions for basically any reason, but it's just a crap situation.", "author": "spencefunk", "created": 1605120037, "upvotes": 104}, "gbyiesp": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyiesp/", "text": "I just feel like college is a waste of time at this point in general. None of us are getting paid to stress over a petty assignment for hours at a time. Education is not experience and education dosent matter if you dont have experience in the thing your studying because apparently spending 4 years or more of your life equates to barely training.", "author": "ShalidorsSecret", "created": 1605118981, "upvotes": 6}, "gbyfohp": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyfohp/", "text": "How do you think us professors feel? I could write almost the exact same letter as above but address it to students. The day-in-day-out creation of online lectures is soul-crushing. Students don't turn on their cameras or even let me know they are participating. I lecture each day to an empty room. \n\nThe only time I hear from students are the last minute e-mails before a major assignment comes due begging for mercy. Students expect unlimited slack and sympathy over COVID-related matters, while I have to triage more complaints about my lectures and course material than ever before.\n\nOften, the same students that demand compassion from me are merciless in their reviews. We, too, are just doing our best in a radically altered teaching environment without adequate resources. And yet, we receive no sympathy or leniency. \n\nI am willing to listen to students and adapt, but you have to meet me half-way. If students want me to alter my expectations, I'm going demand the same of my students.", "author": null, "created": 1605117620, "upvotes": 106}, "gby8ieb": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gby8ieb/", "text": "I’d award this if I could. It describes my experience—all of our experiences, really—perfectly.\n\nIn addition, my school decided to break this fall semester into two 7.5 week periods so that we would only have to take at max 2-3 classes versus 5-6 at a time. In some ways it’s helped, but in others it just causes more stress.\n\nMy professors haven’t condensed the material they’d normally teach under normal circumstances. They’ve just accelerated the rate at which we cover things. We skim over topics that would justify a deep dive for the sake of time. I retain next to nothing from Zoom classes and have to find ways to regurgitate as much of it as I can into assignments to receive passing grades. For the first time in my career as a student, I’m solely concerned about my grades and grades alone rather than my comprehension of the actual material.\n\nAdditionally, because we’re compressing 15 weeks of material into 7.5 week chunks, my school has elected to hold classes on days we’d normally have off. Labor Day, Columbus/Indigenous People’s Day, Veterans Day, etc. In addition to being a student, I also work a part time job 5-6 days a week to help my family make ends meet. I haven’t had a day where I didn’t have school, work, or both since the end of August. Even weekends are spent either catching up on assignments and studying, or working at my job. \n\nI know I’m fortunate to be able to receive an education and working during these times, but honestly, I’m so stressed. I haven’t had a day to myself. A day to sleep in. A day to binge-watch Netflix. A day to play video games. A day to read a non-school related book. A day to spend quality time with my family and friends. A day to go on a walk my dog.\n\nI’m spread thinner than I’ve ever been as a student, and am just hoping I finish this semester with my head above water.", "author": "bakedpotatowcheezpls", "created": 1605114103, "upvotes": 3}, "gby8d2q": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gby8d2q/", "text": "[removed]", "author": null, "created": 1605114032, "upvotes": -20}, "gby742e": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gby742e/", "text": "Honestly, One of my professors is terrible. She does the same thing, So many of her students fail that class and she doesn't change anything about it. She makes the exams so hard and each problem takes 25 minutes to do correctly. That is how long she takes to do a certain problem. Her average class GPA is a 2.5.", "author": "ZiOnIsNeXtLeBrOn", "created": 1605113429, "upvotes": 24}, "gby6pma": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gby6pma/", "text": "I’m a student who is struggling with this as well but you need to remember that professors are dealing with the same exact thing as you. They were *forced* inside all summer. They had their trips canceled. They hate using the technology that you hate for them to use. They sit behind a camera and deliver...\nLecture\nLecture\nLecture\n\nThey have to wake up, lecture, lecture, go to meetings, grade papers, sleep. And they’re in the same exact quarantine as you and I. \n\nI agree that some professors don’t take student concerns seriously enough, because I’ve had some of these professors. But what you’re going through isn’t that different than what they’re going through.", "author": "xFaro", "created": 1605113232, "upvotes": 142}, "gby5eh2": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gby5eh2/", "text": "I graduated a few years ago and let me tell you I feel for you guys. I get paid to work from home now and I beat myself up mentally because I am not motivated at home. I never have been. I’m not even that social, but the routine of going to the classroom or going to work and having a scheduled day is actually really important to my mental health. \n\nYou guys not only aren’t getting paid, but you’re actually paying for this disaster. Don’t get me wrong some people are thriving doing online school/work, but there’s a lot of us that aren’t. Humans aren’t built to live in isolation. It’s unnatural to us and that shows in our reaction to it. So don’t beat yourself up over it. You’re totally normal and not alone. Give yourself days where you don’t do any work and other days actually write out a realistic schedule and follow it. Make time for exercise even if it’s just putting on music or a podcast and doing some stretching for 10 mins. \n\nAlso, don’t do anything super dangerous, but you should still be visiting with friends/family. Outdoor coffee shop, backyard, Skype, whatever. Depression for a young person is very serious, and much more serious than Corona in my opinion for young people. Just take reasonable precautions.", "author": "nailpolishlover12", "created": 1605112583, "upvotes": 70}, "gby24g3": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gby24g3/", "text": "Ever since this semester started (this is my 2nd year in college going for electrical engineering) and all my classes have made a discord group chat, it has helped everyone incredibly and it makes the class go by smoother and better, you make good friends and just talk about things other than class and homework, I recommend everyone doing this, because you can't do everything on your own. \n\nHaving a discord for every class is so much helpful because if you're stuck on homework or whatever the case may be, you can hop into the group chat and someone will most likely be up and help out, when the prof isn't able to help at 2am. Hell if and when we get back to physical classes still make a discord chat or whatever you like to use for the class because it is helpful.", "author": "edlightenme", "created": 1605110938, "upvotes": 169}, "gby0za1": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gby0za1/", "text": "I don’t get why professors don’t realize that we’re stressed out", "author": "RandomRedditor44", "created": 1605110354, "upvotes": 77}, "gbxyv00": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbxyv00/", "text": "I’m sorry but even with in-person learning, in college, home is no longer a place for limited learning. Sorry to disappoint you.", "author": "maustinv", "created": 1605109269, "upvotes": 32}, "gbxwg9o": {"link": "/r/college/comments/js8wb0/a_letter_to_professors/gbxwg9o/", "text": "I feel like a big part of the problem is department heads so detached from reality they don’t realize the course requirements are literally grinding their students to the bone. Hang in there brother", "author": "pilotdude7", "created": 1605108017, "upvotes": 740}}}