{"sid": "m7s0n9", "link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/", "title:": "Pro tip incoming freshman, leave your gen eds/ colaterals for the end.", "text": "Graduating this semestar and my best piece advice if you can take your core classes and pre-reqs first. My last two semesters only took one core class and allowed me have easy load, search for job,intern during school, and generally more freedom last year. \nDo the hard work at the start and relax at the end. From an engineering major.\n\n\nSidenote:capstone/senior design you can normally take if you meet pre-req took my junior year instead senior.\n\n\nEdit:Like many others mentioned only do this if you know what you want to do before going in. I do suggest though at minimum if you can try make your last two semesters as easy as possible , upper level electives, senior design projects, plus the stress of job search kills everyone most people struggle manage senior year. (Especially learned this my junior year, hardest year basically taking all my tough classes on top of covid intern job search). This advice vary person to person just wanted give different perspective as for me the amount of time opened up senior year to pursue personal endeavors and work ethic skills developed from the hard workload helped me to achieve my college and career goals.", "author": "MangoDouble3259", "created": 1616077747, "retrieved": 1632802404, "over_18": false, "upvotes": 889, "upvote_ratio": 0.88, "comments": {"grizn81": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grizn81/", "text": "I completely agree with you. I saved the majority of my gen eds until the end, and now i'm able to complete my last year completely online. I will be able to focus on my senior thesis, and i'm actually getting to do a semester long fully-funded field research component to it that I normally wouldn't have been able to do.", "author": "blackkitteycat", "created": 1616190058, "upvotes": 1}, "gri9vc4": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gri9vc4/", "text": "Thats what I did but my advisor keeps telling me to follow the study plan. The thing is I can't afford full load so it was a wiser choice to opt for the pre-req courses first. I am an engineering major as well.", "author": "MajesticPumpkin7", "created": 1616177944, "upvotes": 1}, "grgw2g2": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grgw2g2/", "text": "I would also spread out the Gen Ed but from experience, people can also burn out from doing the cores all at once, and it’s also better to do this if you can knock out as much maths before instead of starting at a lower level. \n\nGen Ed is always something that some, (especially STEM), think are a waste of time or blow-off classes, but do try to find Gen Ed that interests you. Bigger universities are great at this and a class that interests you is always easier than one you are bored to death in, no matter how easy it is supposed to be.", "author": "il_vincitore", "created": 1616153189, "upvotes": 1}, "grgngvt": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grgngvt/", "text": "!RemindMe 6 months", "author": "ambitiousvanilla_", "created": 1616145029, "upvotes": 1}, "grgg9vg": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grgg9vg/", "text": "I'm a nursing major, took all my prereqs in the last two years, now about to start the process to get into the program hopefully next spring. Wish me luck!", "author": "swollemolle", "created": 1616137840, "upvotes": 1}, "grge0qy": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grge0qy/", "text": "No offense but I think this is bad advice. I’m in community college rn and from the get go was planning on transferring. Because I took my major classes first(double major and a minor)I’m struggling to get all my general Ed classes finished. My final transcript needs to be finalized in July but I still need to take two more in the summer. If you are 100% sure on what your major is DO GENERAL ED FIRST ESPECIALLY IF YOU WANT TO TRANSFER FROM A COMMUNITY TO A UNIVERSITY. By the time I transfer I’ll be considered a junior after being in school for just a year.", "author": "5ftUnderManaged", "created": 1616135801, "upvotes": 1}, "grgdq25": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grgdq25/", "text": "I did the opposite and I was able to knock out GEs. Only take required major classes and work. Currently I'm only taking senior project and working full time", "author": "nickthatknack", "created": 1616135539, "upvotes": 1}, "grgc0ot": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grgc0ot/", "text": "I took this route as well, and it was a very good one for me. I was a journalism major, and our college allowed great flexibility in terms of the order of taking classes. When you're searching for jobs during the final semester, you have some easier classes to take (and maybe even a lighter load in hours). It makes for a stress-free, enjoyable college exit.", "author": "Violet_Atlas", "created": 1616134059, "upvotes": 1}, "grgaga4": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grgaga4/", "text": "Ehhhh....depends on your major and your interests  as a whole. I personally really enjoy my major and HATE that I still have an elective to finish in my last semester or two. I have really been enjoying the upper level courses of my major, gives me this whole ~immersed~ feeling, being involved in discussions and comfortably writing analysis, critical thinking, etc.\n\n Then there's my electives... the material is not what I want to be in school for, it is not what I want to do in life, I feel out of place, and it feels more like busy work because i wouldnt be there if it wasn't required for graduation.\n\n I end up getting annoyed that I am taking time away from the classes I actually want to be involved in. I actually took more electives towards the start of my major because I was always signing up late and that's what was open. I used to think what you're suggesting, that it's going to suck when I have all core/technical classes senior year. But I was wrong, it worked out, I love being with people mostly only my major, similar mindsets, just adds to the immersion.\n\n Im dreading the one elective I put off because the last elective I took I felt out of place. Electives make me feel of place because either (a) they consist of lower classmen that still treat college as an extension of highschool. Or (b) if it is upper level, I am likely the odd one out, because most people are of the major that the class is meant for, so things don't come as easy to me as the rest of the class and im not used to the learning style/professors that most people in the major have adapted to\n\nBut again, this can def depend on your major. I am in a  \"soft\" science. I could imagine that maybe for something super math or science based, the upper level courses may become very grueling if they're all piled on at the end... so maybe... assess based on your major and skillet? 🤷🏻‍♀️... I see you kind of made this point in your edit, just figured I'd add in an example of how the reverse can be preferable to certain situations", "author": null, "created": 1616132747, "upvotes": 1}, "grg6e3k": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grg6e3k/", "text": "I’m a wild case where I’ll be wrapping up my gen eds by next semester & I’ll be taking all core classes for my major & minor by next spring. I didn’t plan on speed running college, but man I’m thrilled to be focusing on the work I want to do put my full time into", "author": "Ackasi", "created": 1616129611, "upvotes": 1}, "grg4spn": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grg4spn/", "text": "Aren't gen eds what you should be doing first?", "author": "zarnonymous", "created": 1616128515, "upvotes": 1}, "grft46y": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grft46y/", "text": "I’d disagree, when it comes to applying to internships that will lead to a better resume it’s better to take as much Gen Ed’s as you can while taking your core classes at the beginning so that your gpa can be higher and more desirable to employers. Not only this but having a higher GPA your first 2 or so years is important so that you can have a nice cushion for when your courses get harder your junior and senior year.", "author": "nyeetreborn", "created": 1616121528, "upvotes": 1}, "grfscat": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grfscat/", "text": "Seriously!!! I'm an idiot and I burnt myself out taking 12 hours every semester of classes I liked instead of the ones I knew I wouldnt and now my senior year is all math and physics :(", "author": "BlueDeadBear32", "created": 1616121102, "upvotes": 1}, "grfid26": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grfid26/", "text": "I'm a math major, so I've had some tough classes. I'm in my last semester and it's so nice to only have one math class (I've had two every other semester). I am also in Art History 1020 right now and its so easy and fun compared to everything else I am used to!", "author": "gob17", "created": 1616115739, "upvotes": 3}, "grfdoon": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grfdoon/", "text": "I think this is and above not to mention that so many majors and colleges won’t even let you do this. I know for my major I had to have all pre req and half of my gen ed required in order to just APPLY for my program. but also why would someone fresh out of high school want to take extremely hard classes 2 years in a row? The intention behind this advice is there because yeah it’s be awesome to have a chill senior year but that’s just not realistic for a lot of people", "author": "whatwhatchickenbutt_", "created": 1616113331, "upvotes": 2}, "grf3jgq": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grf3jgq/", "text": "I did this but between my capstone project and my research workload my senior year ended up being the busiest by far. Instead of waiting to take all the gen Ed’s at once I recommend taking one a semester and trying to find ones that actually interest you. Another drawback to waiting to take them at once is that often only certain classes are available each semester.", "author": "BeeBellBop", "created": 1616108259, "upvotes": 2}, "grf3j2d": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grf3j2d/", "text": "This is absolutely dogshit advice. Your gen eds and prereq courses prepare you for the rigor of classes that actually pertain to your major. Also, you don't want to put yourself in a situation where you overload on electives and run out of time to complete a class that's required for graduation and take on an extra term or year. Typically that doesn't happen, but if you have a lackadaisical advisor, there's definitely a chance.", "author": "teyefighter", "created": 1616108253, "upvotes": 4}, "greskqh": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/greskqh/", "text": "This is normally a good idea for an engineering major. In your senior year, you really just want to take your capstone course and a bunch of history/english/etc. gen eds. It'll give you more time to concentrate not just on your capstone but also your next step - there's a ton of stuff you want to be doing your senior year related to future employment.\n\nHowever, this situation is the opposite for many majors. If you're an English major, you want to knock out those math/science gen eds as quickly as possible because you don't want to be stuck taking those courses your senior year.", "author": "ViskerRatio", "created": 1616103044, "upvotes": 3}, "gres3jc": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gres3jc/", "text": "Wait... what’s a core class and pre req? Why didn’t anyone tell me this ;—;", "author": "chicityhopper", "created": 1616102825, "upvotes": 1}, "grerecg": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grerecg/", "text": "Interesting. Did your advisor allow this? I go to a small uni and my advisor is pushy. My first semester schedule was picked for me by him and my second semester I got a little more leeway. I doubt he’d allow me to do this.", "author": null, "created": 1616102498, "upvotes": 2}, "grep09i": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grep09i/", "text": "Disagree. Load your first semesters up with all that easy shit. Learn to balance multiple easy classes. You want less classes when the classes get really tough and time consuming. You don't want stupid classes you won't take seriously.\n\nIm looking at you Chem 1 and The Understanding of a music", "author": "M1A1Death", "created": 1616101397, "upvotes": 3}, "gren0gn": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gren0gn/", "text": "I disagree with this. College is especially hard for freshman. They don’t need to start off with the hardest possible load. That could seriously impact their mental health & even possibly the rest of their education. This doesn’t even include those who don’t know what they want to do, which gen eds are there to help them figure out. And, community college students who should always take as many general Ed’s as they can because they transfer the best, and gets them out of the way for wherever they transfer to.", "author": "sparklingsnow46", "created": 1616100494, "upvotes": 3}, "gremv0v": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gremv0v/", "text": "One other thing to consider is that the expectations for a paper for an upper level class are much higher than for a general education class. You don’t want to learn a very painful lesson that way. \n\nAnother advantage is that many general education classes have grad students who help tutor and provide assistance with the entry level classes. Even if you’re doing well, may as well use their help and lock down A’s in those classes rather than an A- or B+ (depending on your grading system)", "author": "dalej42", "created": 1616100427, "upvotes": 2}, "gremun3": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gremun3/", "text": "Yea this is dumb. Why would you want to be in a class with all freshmen as a senior? That’s just dumb imo", "author": "charlesdickinsideme", "created": 1616100422, "upvotes": 2}, "grem7zq": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grem7zq/", "text": "Pro tip: Take all your gen-eds during your first two years at community college and transfer to university for half the price.", "author": "MaxMonsterGaming", "created": 1616100142, "upvotes": 8}, "grel86h": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grel86h/", "text": "I think this is very school dependent. A lot of classes that fulfill gen Ed requirements at my school are reserved for freshman and sophomores either entirely or have so many seats reserved to a point that getting in them is just as hard as getting in an upper level class everyone need for a major. To get gen eds towards the end I took upper/mid level classes because they were all I could get into. The lower level ones are the ones they reserve", "author": "puterjess", "created": 1616099697, "upvotes": 3}, "greke60": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/greke60/", "text": "hahahahahahahhahahahahahahahahahahahahhaahahahah YES\n\n\\*cries in 5 engineering classes this semester\\*", "author": "youonkazoo53", "created": 1616099331, "upvotes": 1}, "grefg9j": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grefg9j/", "text": "Wow you're so cool. You just say the opposite of what most people recommend.", "author": "Frosty-Ad-3853", "created": 1616096980, "upvotes": 2}, "greaafb": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/greaafb/", "text": "I actually like to take a couple Gen Ed's with my major courses so that I have a balance of easy and hard", "author": "SnapdragonPBlack", "created": 1616094532, "upvotes": 4}, "gre8ece": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gre8ece/", "text": "I agree, I’m also in engineering. Did the opposite and took electives first (since I didn’t have all my pre reqs done) and now I’m in my last semester taking core classes and don’t have enough time to find jobs :,)", "author": "sweetcheeks920", "created": 1616093715, "upvotes": 1}, "gre899f": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gre899f/", "text": "This is awful advice.\n\nThe GEs are there for you to explore during your early years to see if you want to change your major/career path. Also, if it's your first time in college, why would you start by burning yourself out with the harder classes?? Why would I take microbio without taking my intro science GE?? \n\nThis only works if you know exactly what you want to do after college, your pre-reqs won't be changing, and you don't mind starting college with the harder classes.", "author": "joyleaf", "created": 1616093654, "upvotes": 3}, "gre79dx": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gre79dx/", "text": "I don’t think this is good advice at all for many college students since a lot of freshman aren’t really set on their major when entering college. Many freshman think they are confident they want to study something but then later realize it isn’t for them and switch majors. If you do what OP said and this happens to you, it will probably take you longer than 4 years to graduate.", "author": "lil_layne", "created": 1616093221, "upvotes": 3}, "gre6pjm": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gre6pjm/", "text": "Another vote here for a \"breadth first\" approach -- I didn't take my favorite course in all of college (intro programming & problem solving) until the very end of my final year, in part because I thought I knew what I wanted to build a career in and jumped right in to the major classes.", "author": "--MCMC--", "created": 1616092981, "upvotes": 1}, "gre5flc": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gre5flc/", "text": "The best piece of advice is to not do that  as a freshman lol. The point of college is to learn and grow. You should have a good balance of classes you find fun or curious about, and classes that are pre reqs/required. I recommend taking at least 1-2 required classes for your major, and then the other 2 are like general fun classes. Your mental health matters! Focusing on all the boring hard classes  first will only make you lose your motivation and miss out on the things you could’ve done.", "author": "Way_Easy", "created": 1616092421, "upvotes": 3}, "gre1ebf": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gre1ebf/", "text": "In addition to the folks saying not to do this due to difficulty, many gen eds are not easy courses. They are outside of what you get used to in major-specific courses and doing this may work for some, but will likely be extremely difficult for others.\n\nAnother note is that you will be 1-2 years out of practice when applying to jobs and internships. That can really hurt your transition.\n\nI wouldn't recommend separating gen eds and major courses at all. Take a mix (as long as you have committed to a major) as this will help you relate each class to others outside your field (this is how the liberal arts education model works after all).\n\nAs one last point, a lot of schools won't even allow this to happen. Many programs require a certain threshold to be met before officially declaring a major, and gen eds are included in these requirements. This is done to prevent dropouts due to lack of interest, it is better to spread out courses to prevent burnout than to power through. Just putting it out there, the current educational model is in place for a reason. As my advisor put it \"There is extremely good reason that the peer review and defense processes only uses 3 reviewers, this has been refined over 200+ years of observation\". The same is true of the university model, except it has been over the past 1000.", "author": "the_Q_spice", "created": 1616090626, "upvotes": 10}, "gre0wox": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/gre0wox/", "text": "The core classes tend to be pretty time consuming. It’s hard to take 15 credits that all require a high amount of time put into the homeworks. For me it was nice to have at least one class I knew I would do well in that I only had to put an hour or two of work into a week. Although as an above commenter said take Summer classes if you can. Taking 12 credits a semester and doing the six you missed during the year over the Summer is optimal if you have a Summer job that allows you to put time towards classes. Contact your financial aid office to see if aid can be applied towards Summer classes.", "author": "anonymous_gam", "created": 1616090411, "upvotes": 3}, "grdznuk": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdznuk/", "text": "This but unironically", "author": "Hackerwithalacker", "created": 1616089874, "upvotes": 1}, "grdzk5n": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdzk5n/", "text": "I graduated last year, and my advice would be to mix it up and take a few of each every semester. Keeps the workload more manageable rather than killing yourself at any one point", "author": "SkiMonkey98", "created": 1616089831, "upvotes": 3}, "grdxy7i": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdxy7i/", "text": "I took all of my gen eds first, and honestly glad I did. The whole time I must've changed my mind on what major I wanted to pursue at least 7 times before settling. If you're going to community college, I even wouldn't RECOMMEND taking more than 4 major electives. No way anyone should be spending University tuition on gen ed credits.", "author": "MissionCattle", "created": 1616089155, "upvotes": 3}, "grdwt7g": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdwt7g/", "text": "Yeah I done goofed and did all my gen Ed's in the first two years. Now I'm stuck with five 500 level engineering courses and I wanna die.", "author": "DjSzymek", "created": 1616088658, "upvotes": 1}, "grdwqci": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdwqci/", "text": "How can you take senior design early? What prereq?", "author": "matttech88", "created": 1616088624, "upvotes": 2}, "grdrbob": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdrbob/", "text": "You should actually double check with your general advisors about this. At my university, if you didn’t take upper division classes the last semester/year you couldn’t graduate. They didn’t want you to save all of the ‘easier’ gen ed classes for the end. I say easier because at my campus gen ed classes were usually categorized as 1000-2000s courses and were not considered senior level. \nIt would really suck to have to take a senior level English class, which you don’t have the prerequisites for, if... let’s say you’re a science major and have no other choice.", "author": "T_Kovac", "created": 1616086313, "upvotes": 6}, "grdqe6s": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdqe6s/", "text": "I decided to take all my general credits at community college and then transfer to University. I have 1 more semester of gen ed classes. You are saying that gen ed classes are more involved/difficult than the actual material of the major?", "author": "4DSense", "created": 1616085912, "upvotes": 1}, "grdqc2e": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdqc2e/", "text": "[removed]", "author": null, "created": 1616085887, "upvotes": 1}, "grdq1y3": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdq1y3/", "text": "I would do gen eds earlier in college but save electives for senior year. I’m going into my senior year able to take whatever courses I want in my majors since I got all the requirements out of the way", "author": "Notaclarinet", "created": 1616085768, "upvotes": 3}, "grdmf4f": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdmf4f/", "text": "nah im in my second semester and most of my gen eds are done \n\nso for the 3rd and 4th years i can now go part time and get an internship or add another major/grad courses", "author": "daddycakes101", "created": 1616084417, "upvotes": 4}, "grdmbd4": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdmbd4/", "text": "I took most of my gen eds in dual enrollment while in high school, so I've been having an easier load throughout my time currently at university.", "author": "taa20002", "created": 1616084377, "upvotes": 1}, "grdlmgt": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdlmgt/", "text": "Or if you take too many difficult courses together early on, you could cause burn out.\n\nIt's not a \"pro tip\", it's just your opinion, and it's not necessarily the best strategy for others.", "author": "lupineblue2600", "created": 1616084114, "upvotes": 10}, "grdkmfv": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdkmfv/", "text": "Nah, Im about to graduate too and my best advice is good luck. No one knows what the fuck is going on or what to do. \n\nJust dont be the fucking child that brings his gaming laptop to play fortnite through a lecture. Yes, Ive seen it. In almost every class. No one says anything, but everyone, including the professors, think that kid is a total joke", "author": "goob42-0", "created": 1616083744, "upvotes": -1}, "grdkbqw": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdkbqw/", "text": "Your advice makes, no sense lol which do I take first?", "author": "StardustNyako", "created": 1616083634, "upvotes": 2}, "grdk83u": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdk83u/", "text": "No offense, but this is bad advice. \n\nA lot of schools won’t even let you do this. Not to mention upper level courses can sometimes be legitimately challenging. Why would you leave super boring classes last and be surrounded by a bunch of freshmen?", "author": "noexqses", "created": 1616083601, "upvotes": 157}, "grdk5wn": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdk5wn/", "text": "Get your math out of the way asap.. i stayed in Community college for two extra years because I didn’t realize how much math i was going to need.", "author": "notstevensegal", "created": 1616083580, "upvotes": 12}, "grdhff7": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdhff7/", "text": "I wholeheartedly disagree.  My freshman year was last year and since then I've been switching my minor up almost every semester and I'm now considering changing my major.  The only reason thats even feasible is that I knocked out all of my gen ed classes in the beginning, so now I'm able to switch programs relatively smoothly.  Tons of engineering and math majors drop after their second year, and if you have no gen ed courses done by then, youre looking at staying an extra year or two to make up for it, which is just not an option for many people like me.", "author": "Don_Macaroons", "created": 1616082586, "upvotes": 24}, "grdgcj4": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdgcj4/", "text": "I took my GEs first and I think that was infinitely better. I loaded up on classes in the beginning while I was taking easier classes. My physics major doesn’t really allow you to take most of your core classes before your junior and senior year due to how often they offer them and prerequisites. You take less major classes when fulfilling prerequisites and it is easier to just get the GE out of the way then too.", "author": "Splashcloud", "created": 1616082196, "upvotes": 8}, "grdg637": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdg637/", "text": "I disagree. Space out the gen eds and the core requirements. Do not frontload one over the other. Be smart and take classes at the right time so you don't miss it because some classes are only offered once a year (fall or spring). Also some classes prereqs are designed so that there is almost no way you can take them that early and finish in two years (unless you came on with tons of in major credit). Besides when applying for jobs you rather the core stuff to be fresh in your head instead of not.", "author": "heat202", "created": 1616082145, "upvotes": 49}, "grdf27o": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdf27o/", "text": "I'm knocking out my gen eds as I go. There are a few I don't think I'll be able to take until senior year just bc I keep getting pushed out by seniority, but I don't want to leave any obscure graduation RQs to the last minute. I go to a small university that keeps accepting more students than they can fit into classes, and most gen eds conflict with specialized classes the farther along you go. I've met too many upper classmen end up in language, philsophy, ethics, etc course that they don't want to be in bc the gen ed they wanted to take conflicted with their specialized courses.", "author": "discerningpotato", "created": 1616081826, "upvotes": 1}, "grdexue": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdexue/", "text": "nevermind", "author": "TheColorOfYou", "created": 1616081790, "upvotes": 1}, "grde3d4": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grde3d4/", "text": "NO! Freshmen please dont do this. One of my only regrets of college wouldn't be had I taken one of the gen Ed's I took much earlier.   \n  \nGen Ed's help you explore different areas of interest and if you wait too long you might not know about it until it's too late *like me*  \n  \nFor example if I took my philosophy class earlier than I did I would have dual majored with that as my 2nd. If you tunnel vision yourself into one thing too early you wont be able to pivot later", "author": "shehaujk", "created": 1616081527, "upvotes": 184}, "grddpo9": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grddpo9/", "text": "Yeah, you have time to really decide what you want to do if you haven't already and you get a gpa boost in those easier/more general classes at the start.", "author": "jsimercer", "created": 1616081408, "upvotes": 1}, "grdd4i9": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdd4i9/", "text": "I’d say do this is you already know and are 100% set on your major. If not do gen reqs FIRST so you don’t lose a bunch of credits when you change majors lol. Source: I changed my major 3 times. Still graduated early tho!", "author": "Meydez", "created": 1616081220, "upvotes": 28}, "grdcgif": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdcgif/", "text": "And use CLEPs!", "author": "sunlightbender", "created": 1616081003, "upvotes": 15}, "grdc5id": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdc5id/", "text": "I agree but I think it depends on your major. I am a stem major so there are lot of major prerequisites but I was able to squeeze in 1-2 gen eds each year. Unless I wanted to kill myself, there was no way to get my preqs done any faster. I will have all my gen eds completed by fall of junior year though. However, my senior year will still be hard because I switched to a new major my sophomore year so I will have to finish my major requirements right at the very end.", "author": "denver_rose", "created": 1616080905, "upvotes": 21}, "grdbixd": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdbixd/", "text": "Can confirm. This also allows you to easily fit a major internship into your schedule towards the end.", "author": "cazzhmir", "created": 1616080676, "upvotes": 0}, "grdaxrn": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grdaxrn/", "text": "100% agree with this advice but to me gen eds are boring so I’d space them out after freshman year, but do as many prereqs as you can freshman year so you can move on", "author": "ekaplun", "created": 1616080482, "upvotes": 7}, "grd8yxu": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grd8yxu/", "text": "I think this is more for if you know what you want to do. I had no idea what I wanted to do as a freshman and gen eds allowed me to explore and gave me time to think about what I wanted to do. Though it may not have been the best play, I needed the time and space.", "author": "SheaCookieVillan", "created": 1616079838, "upvotes": 619}, "grd8yip": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grd8yip/", "text": "[deleted]", "author": null, "created": 1616079835, "upvotes": 297}, "grd7v3w": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grd7v3w/", "text": "What I did was that I took classes in my major and mixed it with my gen ed classes. But I took colleges classes in high school and tested out of a class and took summer classes. It depends on what the student accomplished outside of fall and spring semester", "author": "TheRapidTrailblazer", "created": 1616079475, "upvotes": 4}, "grd6gm7": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grd6gm7/", "text": "This is basically what I did. I loaded up my first three years (including some gen ed that I just wanted to get out of the way). Then my senior year was a mix of a few random major electives and general ed, at 12 units each quarter so I wasn't even taking many at once. A lot of my friends were freaking out about their last required major classes while I was coasting along for the last year. We didn't have any kind of capstone project.\n\nAnd I had registration priority to get general ed that I actually was interested in at times that I liked, instead of whatever I could get that met requirements and fit in my schedule. For example, I had the flexibility to switch to another general ed class when I realized one of the ones I was interested in would have an 8am Saturday final. Nah, I'll take the one with the 1pm Thursday final instead.", "author": "HeyFiddleFiddle", "created": 1616079022, "upvotes": 13}, "grd3lbe": {"link": "/r/college/comments/m7s0n9/pro_tip_incoming_freshman_leave_your_gen_eds/grd3lbe/", "text": "Also take advantage of summer sessions if you can afford them. I almost always find it to be a waste of time taking a gen ed during a fall or spring semester", "author": "Acrocane", "created": 1616077959, "upvotes": 285}}}