{
  "sid": "r4hdd3",
  "link": "/r/college/comments/r4hdd3/did_i_mess_up_my_career_life/",
  "title:": "Did I Mess Up My Career Life?",
  "text": "Hey all, I am a double major in Strategic Communications (marketing/PR) and TV/Film. I have no idea what I want to do when I graduate. I’m a great writer and speaker, and i’ve joined a few clubs but none of them speak to me for a job. I could see myself working as a pr communications person in a company, or talking on radio/tv, or even doing legal work. I truly am struggling here. Law school or a masters degree sound like good ideas, but i’m going to a private school now so i will already have hella student debt. I am a junior now btw. How the hell do i pick a career????",
  "author": "FileFew4558",
  "created": 1638141813,
  "updated": 1638206748,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hmgphcn": {
      "link": "/r/college/comments/r4hdd3/did_i_mess_up_my_career_life/hmgphcn/",
      "text": "If you want to attend law school or want to have the option, you need to start studying for the LSAT now. \n\nYou could also get a job working PR directly after college to start making a dent in your student loans while you decide. \n\nWhatever you pick doesn’t have to be the career you are in for the rest of your life. My math prof was an engineer for 15 years and then went back to school to become a math professor. My old therapist worked at a marketing firm for 20 years before realizing she wanted to be a therapist. \n\nNothing in your life has to be permanent unless you want it to be. Don’t worry about it all right now.",
      "author": "rynpickles",
      "created": 1638142589,
      "upvotes": 2,
      "replies": {
        "hmgqm2a": {
          "link": "/r/college/comments/r4hdd3/did_i_mess_up_my_career_life/hmgqm2a/",
          "text": "this was helpful to read, i appreciate it. i suppose i’ve sort of relied on my academics as a form of escapism, but now that the real world is rapidly approaching i am reminded that i need to have a life soon.",
          "author": "FileFew4558",
          "created": 1638143071,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmh1ppn": {
      "link": "/r/college/comments/r4hdd3/did_i_mess_up_my_career_life/hmh1ppn/",
      "text": "You need for a company to pick you, as well.\n\nSo the real question is how do you get companies that you would be interested in, interested in you.",
      "author": "GenXtreme1976",
      "created": 1638147950,
      "upvotes": 1,
      "replies": {}
    },
    "hmh6ri9": {
      "link": "/r/college/comments/r4hdd3/did_i_mess_up_my_career_life/hmh6ri9/",
      "text": "Follow your heart",
      "author": "Anthonytechman",
      "created": 1638150270,
      "upvotes": 1,
      "replies": {}
    }
  }
}