{
  "sid": "qeky98",
  "link": "/r/college/comments/qeky98/college_is_hard/",
  "title:": "College is hard",
  "text": "I'm currently a junior in high school and a running start student, and it's the 5th week of college (online school). I'm always stressed and just had my first real breakdown and cried so much. Recently, I've been having suicidal thoughts after not having them for a couple months.\n\nIn high school, I didn't have to put much effort and study. But now, with college, I'm suddenly hit with massive amounts of assignments, things to study, and difficult & confusing material to go over. I got a really bad score on my midterm exam for chemistry and am likely to fail this class if I keep getting bad scores on my assignments and exams.\n\nI had a chemistry class two days ago and had to do redo my pre-lab because it wasn't specific enough, apparently. If you don't do the pre-lab correctly, you can't do the lab. My professor kept being very vague on what to do exactly, and I was stuck on it for two hours. I feel overwhelmingly stupid and still haven't gotten it. Not to mention, I still have enormous amounts of assignments I still have to do.\n\nMy chemistry professor scrutinizes assignments closely and takes off points for the smallest mistakes and at this point I'm already failing. If I fail, I'm afraid I'll be seen as a disappointment and looked down upon. I feel so tired that I want to sleep, but if I sleep, I'll just wake up to find myself with less time to do homework and then stress out again and want to cry myself to sleep again.\n\nI feel like just wanting to end it all to stop the suffering. Whenever something bad happens to me, I always question myself and my existence. I constantly ask myself, \"What's the point of living if I'm so useless?\" I take a look around myself and see my classmates are so much smarter than me even though I study and stay up longer to do my work. It seems like all my efforts are useless and futile no matter what I do.\n\nNow, I tend to procrastinate to get away from all this mess which makes it even worse. I find myself forcing myself to do assignments and study. I want to resort to pulling all-nighters but my frail body can't seem to take it and falls asleep. I don't even have time to do my favorite hobbies anymore, which is playing video games and reading novels & manga.\n\nI just don't know what to do anymore and I feel like I'm in a dark cave, curled up into a ball, shivering with teeth clattering.",
  "author": "SerpentBlaze",
  "created": 1635049946,
  "updated": 1635184587,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhty4e0": {
      "link": "/r/college/comments/qeky98/college_is_hard/hhty4e0/",
      "text": "I don't know who your classmates are, but you sound like you're doing pretty good if you're enrolled in college courses while you are still in high school. I don't think it is healthy to compare yourself to others, (although I know it is hard not to) so if you are feeling stressed about being dual enrolled in both high school and college courses then I'd recommend just focusing on high school. Is it possible for you to drop this Chemistry course and take it again later? Make sure you communicate with the Chemistry professor to see if it is possible for you to get caught up on assignments and pass the course, otherwise I'd just drop it and try again later.\n\n&#x200B;\n\nI also hope you are talking to a counselor or something if you are struggling with suicidal thoughts due to your stress and mental health. Stay safe.",
      "author": "noagnst",
      "created": 1635054839,
      "upvotes": 2,
      "replies": {}
    },
    "hhviq83": {
      "link": "/r/college/comments/qeky98/college_is_hard/hhviq83/",
      "text": "I'm in dual enrollment right now as a senior in high-school. I'm taking a college calculus class on top of my full high-school course load. It's hard, but worth it, and the value you get out of dual enrollment is super beneficial once you actually become a full time college student! Remember, it's okay to struggle in a class, especially if it's a hard class, it's not the end of the world. Just make sure you are utilizing your resources. As far as the mental health aspect goes, I started seeing a psychiatrist when I started dual enrollment in my junior year to help me with some procrastination and personal issues. I know help is not always accessible but many schools do have councelors of some sort that are often there to help with procrastination and other issues. \n\nAlso, make sure you take advantage of any and all free tutoring services you can find, either through your school/college or outside. I wish I had gone to tutoring for math/science based classes years ago but only started going this past semester. My grades in science/math courses have gone up from Cs and Bs to B+s and As.",
      "author": "_MrGullible",
      "created": 1635091815,
      "upvotes": 1,
      "replies": {}
    }
  }
}