{"sid": "bhae9u", "link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/", "title:": "Am I wrong for not wanting my roommate to have his boyfriend over the room during finals week?", "text": "Just for background, my roommate went through a rough breakup over the summer, and it truly brought out the worst in him. He skipped class in order to sleep in all day. He self-harmed. He became desperate for companionship and tried to pursue relationships not only with borderline strangers, but also members of our close-knit friend group. All in all, it was a very uncomfortable thing to witness all year.\n\n&#x200B;\n\nRecently, he's met a guy on Tinder from the next state over, and things have been moving fast for them. They're planning on meeting up, barring the difficulties that come from the fact that neither of them have cars never mind their licenses. Overall, I'm happy for him, if not for one thing; numerous times when they call, my roommate has repeatedly said that they're guaranteed to have the room to themselves whenever they want, and that he has no issue kicking me out. \n\n&#x200B;\n\nIf it were at any other point in the semester, I really wouldn't mind and I would happily give them their privacy. But this upcoming Monday marks the first day of finals week. I don't so much mind giving them a couple of hours to themselves as I could just go to the library, but I'm not keen on sleeping at a friend's room the night before a final.\n\n&#x200B;\n\nAny advice on how to talk to my roommate about it? I basically want to affirm that I am genuinely happy that he found someone new, but I'm not about to place his relationship before my final grades.", "author": "bakedpotatowcheezpls", "created": 1556208333, "retrieved": 1632947988, "over_18": false, "upvotes": 605, "upvote_ratio": 0.98, "comments": {"enobnea": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/enobnea/", "text": "The room? As in the only room?", "author": "wordsworths_bitch", "created": 1557957279, "upvotes": 1}, "elteip8": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elteip8/", "text": "If they have company,  they can get a cheap motel...", "author": "Patrol720", "created": 1556265509, "upvotes": 1}, "eltaill": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/eltaill/", "text": "Ur roommate dumb as fuck", "author": "John_m33", "created": 1556260219, "upvotes": 3}, "elswcov": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elswcov/", "text": "i think you have to stand up for yourself. it’s not that you’re against him, it’s just that you have to do right by yourself. i don’t even think you should have to affirm that you’re genuinely happy for him although i suppose it wouldn’t hurt but it’s not about that, it’s about your right to have a say about what goes on in the room. just be honest with him about how this affects you.", "author": "josski32", "created": 1556246775, "upvotes": 2}, "elswagw": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elswagw/", "text": "Look, this is something where you have to talk to him, not anonymous people on the internet. Part of college is growing up and standing your ground or you'll be a push over.", "author": "untetheredbachelor", "created": 1556246736, "upvotes": 1}, "elsuk3e": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elsuk3e/", "text": "In addition to the suggestions already given, you might want to check with the rules of your dorm. (You live in a form, right?)\n\nEvery college/university that I know (for over 20 years I've worked in the student affairs division which includes residence life) has very strict rules in the dorms during finals week. The main two are: addition of quiet hours and no overnight visitors are allowed.\n\nIt this is the case at your school, then you won't look like the bad guy. I'm hoping that you live in the dorms.", "author": "idonotlikemyusername", "created": 1556245654, "upvotes": 1}, "elsnwpo": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elsnwpo/", "text": "Wow that sounds terrible. My roommate, who I wasn’t even great friends with, would never kick me out for the night when his gf would come over. He asked me to leave about twice out of maybe 8 times she came over, but it was only for 30-60 minutes. But he made it very clear that it’s my room too and I shouldn’t have to feel like I need to leave. \n\nEven when it’s not finals week, I think it’s inappropriate to ask your roommate to sleep somewhere else for the night, unless you’re very close and it’s a very good reason. It’s your room, you pay for it, and you deserve your own space.", "author": "mysuperusername7689", "created": 1556241553, "upvotes": 5}, "elsj7t4": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elsj7t4/", "text": "He kicks you out of a place you’re paying for?\n\nGrow a spine and don’t let him walk on you.", "author": "Evariste-Lovelace", "created": 1556238745, "upvotes": 5}, "els1sik": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/els1sik/", "text": "Nobody gets to kick you out of a shared dorm room.  Finals week or not but especially then.  Just say no.\n\nWhatever happened to him to make him have a rough time doesn't make it ok for him to be so inconsiderate.", "author": "PersephoneIsNotHome", "created": 1556227014, "upvotes": 24}, "els01l4": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/els01l4/", "text": "you can set boundaries. the boyfriend could always stay over (without hooking up if you’re in the room obviously!) if you’re okay with sleepovers. it’s finals week so your sleep is super important & i’m sure your roommate can work with that. be firm with what you need from him & what’s definitely not okay (ie staying up and being loud past x time, kicking you out between these hours, having him over these nights)", "author": "robitrobot", "created": 1556225928, "upvotes": 6}, "elrztiv": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrztiv/", "text": "You could pretty much read this post out loud to the roommate. You sound respectful, here.", "author": "MythicalWhistle", "created": 1556225791, "upvotes": 9}, "elrylyp": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrylyp/", "text": "Not at all. It's your room and if he has a problem with it, he can bring it up with the RA (I assume by the wording you live in a dorm).", "author": "arlomilano", "created": 1556225070, "upvotes": 5}, "elrvjia": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrvjia/", "text": "[removed]", "author": null, "created": 1556223235, "upvotes": -1}, "elrqh2e": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrqh2e/", "text": "If he asks you to leave the room while you're studying assert your dominance by looking him in the eye and firmly saying no. If he tries to \"kick you out\" then get your RA involved.", "author": "ellagraceful", "created": 1556220119, "upvotes": 9}, "elrq5oa": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrq5oa/", "text": "I'm so glad I'm a commuter and don't have to deal with shit like this", "author": "Jakeremix", "created": 1556219926, "upvotes": 29}, "elro0hj": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elro0hj/", "text": "Having him over and letting them have some time? That’s fine \n\nForcing you to leave your room for the night? Not okay unless you’re in agreement \n\nI never ask my roommate to leave the room for more than half an hour because it feels really inconsiderate, it’s your room too. Giving them an hour is the right thing to do but overnight is too much, put your foot down.", "author": "username1615", "created": 1556218611, "upvotes": 57}, "elrnkfl": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrnkfl/", "text": "I think that you two should compromise at least. Young love is amazing and I understand it's finals week and he is being a little arrogant but that's why you two can compromise", "author": "jeremy1051", "created": 1556218349, "upvotes": 3}, "elrk1wh": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrk1wh/", "text": "It’s ok for you to give them the room for a little but Idk why it’s assumed you’ll sleep out. Me and my roommate would have never kicked the other out for the entire night. Just tell him you’ll leave for a time but not the whole night and be firm with it", "author": "Sugardaddyxoxo6", "created": 1556216217, "upvotes": 8}, "elrildb": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrildb/", "text": "[removed]", "author": null, "created": 1556215306, "upvotes": -5}, "elrfhcf": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elrfhcf/", "text": "I think you're completely in the right. It's really inconsiderate of him to plan for this at a time like that", "author": null, "created": 1556213394, "upvotes": 52}, "elra3vp": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elra3vp/", "text": "[deleted]", "author": null, "created": 1556210054, "upvotes": -3}, "elr9ou0": {"link": "/r/college/comments/bhae9u/am_i_wrong_for_not_wanting_my_roommate_to_have/elr9ou0/", "text": "You're coming into adulthood, its a great thing but comes with its cons. It sounds like this dude is trying to walk all over you. You need to voice yourself and be gentle but direct. This isn't going to be the last time you find yourself in an uncomfortable situation, you might as well practice now. \n\nGet ahead of this and have the talk asap. \"Hey I've heard your bf is coming over, I'm happy for you but I have finals and Im planning on sleeping in my own bed, how can we work this out so that you get your time in with your bf and I can sleep/ do some studying in my room?\"\n\nBe direct, provide a solution and stand your ground if the conversation deteriorates. \n\nDon't let his shenanigans effect your life when its pretty obvious he's not concerned about you. If you need to get your RA involved then do so. If he cant chill out for a week and let you get past finals then he doesn't give a shit about you so nor should you for him.", "author": "YouMcFuckedup", "created": 1556209792, "upvotes": 449}}}