{
  "sid": "q8yi4m",
  "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/",
  "title:": "I feel really guilty",
  "text": "I moved to college a couple of weeks ago and it hasn’t been going great. I’ve really been struggling to settle in and make friends, however I don’t want my parents to worry so I’ve been lying to them. They think I’m really happy and I’ve been settling in great. Today I got a card from my mum saying how happy and excited she was that I’ve settled in and made friends and it made me feel so much worse. I don’t know what to do anymore.",
  "author": "anonymous236789",
  "created": 1634335161,
  "updated": 1634423781,
  "over_18": false,
  "upvotes": 77,
  "upvote_ratio": 1.0,
  "comments": {
    "hgsjdxa": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgsjdxa/",
      "text": "It sounds like you’re parents love you an care about you.  Why dont you talk to them and maybe they can help you? \n\nAlso see the mental health counseling service on campus",
      "author": "PersephoneIsNotHome",
      "created": 1634335579,
      "upvotes": 63,
      "replies": {}
    },
    "hgszfi8": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgszfi8/",
      "text": "I would be honest with them. It sounds like you and your parents are close and they’d understand why you lied.. because you didn’t want them to worry (and that is out of love). It will make you feel a whole lot better.\n\nIf the adjustment is hard, you could try getting more involved with clubs or use BumbleBFF to help with making friends to those close by.",
      "author": "coolchickstar",
      "created": 1634343582,
      "upvotes": 22,
      "replies": {}
    },
    "hgt6sib": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgt6sib/",
      "text": "Please have an honest discussion with your parents. As a mom, it would hurt me even more if my child wasn’t telling me the truth, that they were suffering on their own. \n\nAlso, many of my friends have children that just started college this year. They all say their kids are struggling, adjusting to being away, making new friendships, etc.",
      "author": "inflewants",
      "created": 1634347488,
      "upvotes": 10,
      "replies": {}
    },
    "hgtbhhi": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgtbhhi/",
      "text": "please be honest with your parents. after almost failing a semester my parents sat me down, i thought they were going to eat me alive but they let me know it’s completely ok to struggle and they’re always here to help me. your relationship with your parents WILL CHANGE in this stage of your life, it’s hard to adjust to, but they are there to listen to you and help you adjust however they can. my advice to you is to lean on your parents, they probably will have some good advice and make u feel better. you shouldn’t feel like it took to long to tell them too, they might have an idea... parents aren’t dumb. and what you’re going through is sooo normal. it sucks, but you’re gonna figure it out, best of luck homie <3",
      "author": "spagettifrog",
      "created": 1634350006,
      "upvotes": 6,
      "replies": {}
    },
    "hgt4ys8": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgt4ys8/",
      "text": "It might be good to check out the counseling services at your school. For many schools, it is included as part of student fees, so it doesn't cost extra. They helped me a lot when I started school.",
      "author": "Coloradical27",
      "created": 1634346490,
      "upvotes": 3,
      "replies": {}
    },
    "hgtgboa": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgtgboa/",
      "text": "You don’t have to tell them it’s all good or all bad. Hardly anything is ever black and white.\n\nI would be honest. You can preface it by saying that school is ramping up and its harder than you thought. And that the friends were fleeting. Don’t put pressure on yourself to be too positive when you’re not feeling it. But maybe it would help to keep a gratitude journal and relay some of the things you find enjoyable to them to help brighten both of your spirits. That way you can tell them good and bad things without having to lie.\n\nIt’s hardest when you don’t want to feel like you’re letting them down, but they would want to be able to be there for you. They would be happy to hear both the good and the bad because it means you trust them to confide in them. Parents will worry regardless. The only thing you can really do to help ease their minds is to check in with them and let them know what’s happening. Your parents have your back!",
      "author": "milk1tea",
      "created": 1634352668,
      "upvotes": 2,
      "replies": {}
    },
    "hgu1551": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgu1551/",
      "text": "I feel the same way as you. Im in my 4th year right now and it's been really hard to continue lately but that's a story for another time. Yet, my parents are there to support me. \n\nThe first thing that I can tell you, judging by what you say, is that you must be honest with them. They are keeping in contact with you because they care and love you. The least you can do is be honest and open with them. Come clean. Don't be afraid. Worst that can happen is that they give you some tips on how to improve.\n\nIf you need some from around, I'll give you a quick tip:\nFocus on yourself. You'll make friends along the way as you go places and start to share with likeminded people like in card shops or group projects. Don't stress. Just focus on your studies.",
      "author": "SgtGhost57",
      "created": 1634366530,
      "upvotes": 2,
      "replies": {}
    },
    "hgu39qt": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgu39qt/",
      "text": "Sometimes colleges can be clique-y and make you feel ashamed for being alone. I didn't make too many friends at college, just a few close ones, and over time I started to feel more comfortable doing stuff on my own. Let me tell you a secret--all these friends people are making are still superficial. They won't last! And almost everyone feels like they are struggling to adjust and make friends. It will take time, but friends will find you (or you'll find them)! \n\nMy now best friend from college messaged me randomly one day and asked if I wanted to get tea. I said yes! At this point I hadn't spoken much to her, but she lived next door. We just drank tea in the dining hall and talked.\n\nHere's my tips!\n1) Since everyone is struggling to make friends and adjust, just text someone who interests you and ask if they want to get lunch or coffee!\n2) Like others have said, join clubs.\n3) Talk to the person next to you in class.\n4) Talk to professors and custodians and cafeteria workers. I've made great friends this way! College students get annoying sometimes lol.\n5) Community service is a great way to connect with kind people, and to get to know the community you've just moved to.\n6) Keep in touch with your friends from high school, and your family. They are important lifelines and care very much about you.",
      "author": "incoherentkazoo",
      "created": 1634368289,
      "upvotes": 2,
      "replies": {}
    },
    "hgsyske": {
      "link": "/r/college/comments/q8yi4m/i_feel_really_guilty/hgsyske/",
      "text": "how come you haven't tried making friends? get involved. better yet, use [thefriendme.com](https://thefriendme.com) that helps u find like-minded people near you to talk with!",
      "author": "mezway",
      "created": 1634343253,
      "upvotes": 0,
      "replies": {}
    }
  }
}