{"sid": "pus8ut", "link": "/r/college/comments/pus8ut/my_school_has_made_me_regret_my_time_here/", "title:": "My school has made me regret my time here", "text": "So I’m in my last semester of school before graduating, but I feel so upset by my experience here. I’m a biology major at a pretty small school. I began my major with a good group of like-minded friends. I’m leaving with all of those friends having failed out of our major except me. I feel very alone and like I don’t belong here…\n\nRight from the start, the professors have been downright disrespectful. I’m actually not sure I’ve ever met a more mean spirited group of people. They spend all their time in their labs doing research while the students have difficulty getting even the slightest bit of attention. I remember back to my freshman year where one belittled me to another student. I had heard this after I went to see if they were available to help me with my schedule. They were completely ignoring any messages and scheduling was coming up. So I went to find them. I looked in at their office and was asked to wait five minutes as he talked to a graduate student. This was perfectly fine until he decided to say how he hated people that looked at his office and that you should never do this. I then spent the next five minutes crying as he made fun of me to this random girl. The same Professor would make snide remarks about me, even saying “oh go crawl back into your hole” when he saw me walking to class. I’m guessing I wasn’t meant to hear this but I did. He has gone on to yell and scream at other students and even lesser professors for the most ridiculous things. \n\nRecently, I have taken to helping some of the other students in my major. One of whom is a transfer student. She had told me how she has had some difficulty getting in contact with this professor to talk about a class she needed. He had told her he wanted to add her to a class(one that he just added and wasn’t one she could add herself), but he hadn’t contacted her again after she asked where and when this class would take place, or even if he had added her. She tried contacting him over the next few days and he still didn’t answer her. Even going to his office(even though he HATES this)where he ignored her. She emailed her advisor to see if she could help. This got him to finally open his door and allow her in. This is where he decided he was going to talk to her like she was a moron and ask her what part of the class she didn’t understand…like WHAT? Why is he doing this? She just wanted to know simple info about the class as it HAD ALREADY STARTED. I don’t get how he could make someone feel so stupid for his own mistake. It’s like he’s incapable of apologizing or feeling shame.\n\nI’m just so sick of this constant state of ignoring students and making them feel alone and unworthy of being here. They made this guy chair of our program btw so apparently his attitude is a small issue to them. And it’s not just this professor but others too. I wish I would’ve gone somewhere else where I could’ve made better relationships with my professors and had an overall better experience…", "author": "WickedPuffin", "created": 1632516452, "retrieved": 1632946058, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"he5d3en": {"link": "/r/college/comments/pus8ut/my_school_has_made_me_regret_my_time_here/he5d3en/", "text": "I wish it was easier for applicants to schools to get an \"inside scoop\" on the departments they'd be taking classes in. Most students choose schools based on rank and cost (which to be fair are reasonable metrics) but being in a department run by decent people is *very* important!", "author": "HumanDrinkingTea", "created": 1632522865, "upvotes": 2}}}