{"sid": "pvp5e3", "link": "/r/college/comments/pvp5e3/has_anyone_had_to_break_a_lease_before/", "title:": "Has anyone had to break a lease before?", "text": "Hello, I’m currently considering leaving my current university but have a 8 month lease signed. Do I need to continue living here even if I can’t really afford the rent? Or is there a way to break a lease early and what are the consequences?\n\nThanks", "author": "CrispyMulch", "created": 1632641535, "retrieved": 1632945956, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"hef2a89": {"link": "/r/college/comments/pvp5e3/has_anyone_had_to_break_a_lease_before/hef2a89/", "text": "I’m currently in the same boat, I’m trying to transfer to a different uni but I’m stuck in a lease. I’ll have to pay the lease break fee and surrender my security deposit to get out of it.", "author": "ExoticTiger1", "created": 1632704562, "upvotes": 1}, "hecp0ui": {"link": "/r/college/comments/pvp5e3/has_anyone_had_to_break_a_lease_before/hecp0ui/", "text": "It depends on what your lease says.\n\nIf it is month to month (in the US) or if there is a stipulation about notice you may have to give certain amount of notice.\n\nIf you have a year contract, you are on the hook for that, technically.\n\nYour landlord may or may not be willing to work with you", "author": "TheRightSideOfDumb", "created": 1632667881, "upvotes": 1}, "heclnlq": {"link": "/r/college/comments/pvp5e3/has_anyone_had_to_break_a_lease_before/heclnlq/", "text": "Info: is it on campus or off campus? On campus is associated with the university so it would be more likely that out can break it. Off campus is when it is privately owned and not technically an entity of the University.\n\n\n if it is a binding lease you might be stuck paying it unless you relet (transfer the lease from your name officially) or subletter. (Lease the apartment under your name to a person who is renting from you).\n\nIf it is a month to month basis lease you could request and let the landlord  know you are leaving.\n\nTbh OP, a lot of off-campus housing were super predatory during the pandemic and made students pay when they left college when everything shut down. I've been in a binding lease and it sucked so much. Hopefully this is not the case for you.", "author": "Fiery_Tigress", "created": 1632666374, "upvotes": 2}, "hec8uwz": {"link": "/r/college/comments/pvp5e3/has_anyone_had_to_break_a_lease_before/hec8uwz/", "text": "Depends on the lease and the terms. Different landlords have different rules. Some will let you pay an early termination fee (most commonly 2 months rent and you lose security deposit). Some let you find a subleaser and all is good. Some will try to fill the apartment early and charge a small fee to you. Some will say no way and that’s that. Your lease should have a clause on early termination", "author": "Concerned-23", "created": 1632660016, "upvotes": 3}, "heblavo": {"link": "/r/college/comments/pvp5e3/has_anyone_had_to_break_a_lease_before/heblavo/", "text": "You will lose a deposit that I'm guessing you had to pay on initial move in.\n\nAlso, not sure what country you are in, but it may show up on future rental applications which might force you to pay an even larger deposit on future rentals or even be rejected.", "author": "youarebette", "created": 1632642015, "upvotes": 5}}}