{
  "sid": "qzv18q",
  "link": "/r/college/comments/qzv18q/canvas_is_terrible_and_gets_in_my_way_on_a_daily/",
  "title:": "Canvas is terrible and gets in my way on a daily basis",
  "text": "For a platform that is used all over the country by thousands of schools, I really would expect better. It has so many inconsistencies and poorly implemented features that it significantly hampers my ability to take my courses.\n\nEvery semester it takes a few weeks to get the hang of every course’s page. There are literally so many things I would rather spend my energy on. The amount of unguided customization available in making these pages is insane. Not every teacher is a web developer. I just want a simple list of my assignments and their due dates. There are way too many features that every individual professor has the freedom to use, and Canvas does nothing to consolidate what I need to find from them. Do I need to look in messages, announcements, or modules? Is it tucked away in a discussion post edit somewhere? I can't even describe how quickly it drains my motivation trying to look for something.\n\nHere's a short list of the problems I've had with Canvas:\n\n* The Zoom integration-\n\n1. Some professors don't even have the Zoom meetings set up as an item on our dashboard. This makes the dashboard and calendar incomplete and therefore completely useless.\n2. Every time a professor edits the Zoom schedule my email and messages are buried in notifications.\n3. The transcript and chat timestamps in the recordings don't line up with the video at all.\n\n* Clicking on an assignment from the Grades page is different from clicking on it from the Assignments page, and you won't be able to see the description or due date for it.\n* Assigned peer reviews aren't their own assignment, just an add-on to the assignment to be reviewed. Unfortunately, an assignment being reviewed is most likely past due and therefore doesn't show up on the dashboard anymore.\n* Multiple choice questions will allow duplicate answer choices for some reason\n* Discussion posts and announcements should not be editable. Professors, this is far from the best way to convey information.\n\nGenerally, my issues are found in the lack of standardization across classes. Professors are building a house out of Canvas building blocks, and it needs to be more like Canvas provides the house, and they get to paint the walls, put up some lights, etc. I just can't stand how bloated some pages are and there's nothing we can do about it.",
  "author": "FreeMyDawgzzz",
  "created": 1637613119,
  "updated": 1637689011,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.75,
  "comments": {
    "hlpb1p6": {
      "link": "/r/college/comments/qzv18q/canvas_is_terrible_and_gets_in_my_way_on_a_daily/hlpb1p6/",
      "text": "? i found Canvas to be very easy & efficient to use. I've been using it since junior year of high school, which took a little use too. but my 2nd year of college, it was really easy. it fits me bc its very organized & color-coordinated",
      "author": "vibinggrass",
      "created": 1637624225,
      "upvotes": 17,
      "replies": {}
    },
    "hlonxiy": {
      "link": "/r/college/comments/qzv18q/canvas_is_terrible_and_gets_in_my_way_on_a_daily/hlonxiy/",
      "text": "The only thing I love and loathe is the What If? grade predictor. It’s both a source of anxiety and comfort.\n\nI’ve honestly given up engaging with Canvas. I just check my discussion posts, jot down due dates, and click on announcements as need be. The LMS is a mess.",
      "author": "kizeltine",
      "created": 1637614413,
      "upvotes": 5,
      "replies": {}
    },
    "hlp5tfy": {
      "link": "/r/college/comments/qzv18q/canvas_is_terrible_and_gets_in_my_way_on_a_daily/hlp5tfy/",
      "text": "the absolute worst is when you have assignments, but they never show up on the to-do list. that has done a number on me at least once.",
      "author": "datsruffbuddy",
      "created": 1637621887,
      "upvotes": 2,
      "replies": {}
    },
    "hlpy7mf": {
      "link": "/r/college/comments/qzv18q/canvas_is_terrible_and_gets_in_my_way_on_a_daily/hlpy7mf/",
      "text": "I completely understand where you're coming from, but at the end of the day, the responsibility falls on us to make sure we get everything we need out of the course since we're paying for it. Of course, the professors should aid in that process, but we should do everything on our part to make it manageable for ourselves. I also feel a bit out of my depth at the start of the semester using Canvas, but you just have to spend some time navigating each section within each course and familiarise yourself to it.\n\nOne thing I've found that has helped me is using the Canvas assignment calendar as a secondary option, not a primary. I use my own calendar and enter in any assignments I have, and tick them off there when I do it. Because if you rely on Canvas, sometimes the professor might forget to assign the due date, so it won't show up and you'll miss it. \n\nAs for the Zoom thing, if you keep your own calendar/assignment tracking system (I use YouTuber Janice Studies' Notion template for organising all of this), if you keep the link pasted in your own space, you can just access it there and won't have to dig through emails to find it. Update it immediately whenever it changes.\n\nFor multiple choice Qs with duplicate answers, email the professor about it immediately to let them know - they will usually give you the point if you had the correct answer but the system marked it wrong, and it will also help others who face the same situation.\n\nI know it can be frustrating and inconvenient to navigate your way around everything, but we have to guide our own learning to make sure we get what we're paying for. In life, we'll come across lots of people who may or may not care about our success. Our professors should be the ones who do, but not everyone keeps on top of everything and thinks about how the system may look for the end user. We have to find ways to work around the issues and make it work for us.",
      "author": "NoDryHands",
      "created": 1637635090,
      "upvotes": 1,
      "replies": {}
    },
    "hlqa9ss": {
      "link": "/r/college/comments/qzv18q/canvas_is_terrible_and_gets_in_my_way_on_a_daily/hlqa9ss/",
      "text": "If you think Canvas is bad, try using Blackboard.",
      "author": "classycapricorn",
      "created": 1637641010,
      "upvotes": 1,
      "replies": {}
    }
  }
}