{
  "sid": "q9h4h3",
  "link": "/r/college/comments/q9h4h3/am_i_just_overthinking_this/",
  "title:": "Am I just overthinking this?",
  "text": "I have been wanting to go back to school for years. However every time I have to take in-person classes I freak out and don't want to go. I'm fine with online classes but classes like lab and clinicals obviously have to be taken in person. It's through a community college not university so they are the sizes of a typical high school class. I'm just worried that I'm going to get bullied or something. I absolutely hated high school and still hate and traumatized by those \"people.\" I hate to admit it but I hope karma bites their asses and they are living miserable lives.",
  "author": "imeltinthishurricane",
  "created": 1634407261,
  "updated": 1634586972,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgw5jss": {
      "link": "/r/college/comments/q9h4h3/am_i_just_overthinking_this/hgw5jss/",
      "text": "Not sure what the atmosphere at your CC is like but at my CC idek the name of any of my classmates in most of my classes. I don’t think I’ve ever seen anyone get bullied like I did in high school, and I’ve been here since pre-COVID times too.",
      "author": "ThisIsntRealWakeUp",
      "created": 1634411389,
      "upvotes": 3,
      "replies": {}
    },
    "hgwfyxf": {
      "link": "/r/college/comments/q9h4h3/am_i_just_overthinking_this/hgwfyxf/",
      "text": "You're not going to get bullied. College isn't high school. I'm sorry about what you went through then. You should talk to a therapist to try dealing with the anxiety that's holding you back, if you aren't already.",
      "author": "wetbogman2",
      "created": 1634415885,
      "upvotes": 3,
      "replies": {}
    },
    "hgvwt6c": {
      "link": "/r/college/comments/q9h4h3/am_i_just_overthinking_this/hgvwt6c/",
      "text": "Hate is a rock that only weighs you down.\n\nDr. Grandpa",
      "author": "FreeThinkingGrandpa",
      "created": 1634407666,
      "upvotes": 2,
      "replies": {}
    },
    "hgw7txj": {
      "link": "/r/college/comments/q9h4h3/am_i_just_overthinking_this/hgw7txj/",
      "text": "at my CC it seems like nobody really even communicates with each other. youll probably be fine. worst case scenario is that some jerks talk behind your back (in which you’ll probably never know)",
      "author": "throwaway_of_a_biguy",
      "created": 1634412359,
      "upvotes": 2,
      "replies": {}
    },
    "hgwyx7r": {
      "link": "/r/college/comments/q9h4h3/am_i_just_overthinking_this/hgwyx7r/",
      "text": "College is really different from high school in the sense that you won't typically know your classmates, and there will be different people in each course, so you won't be interacting with the same cohort over and over again. \n\nYou can make friends with people in your classes, but you don't have to engage socially if you don't want to. You'll interact with some classmates if there's a group work or lab work to be completed with a partner, but most people treat group mates like coworkers, and aren't going to ask about your personal life or interests. Bullying generally isn't a thing to worry about.",
      "author": "clearwaterrev",
      "created": 1634424366,
      "upvotes": 1,
      "replies": {}
    },
    "hgxn93d": {
      "link": "/r/college/comments/q9h4h3/am_i_just_overthinking_this/hgxn93d/",
      "text": "I’ve never seen a single bully type person at college. The only people at community college are those trying to better their lives- they don’t act anything like high schoolers",
      "author": "Official_Taiwan",
      "created": 1634435895,
      "upvotes": 1,
      "replies": {}
    }
  }
}