{"sid": "kzbl9x", "link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/", "title:": "If you have to do a reading, do you read the whole thing and then take notes from the highlighted parts or take notes simultaneously?", "text": "Or something else altogether?", "author": "gamergirl12305", "created": 1610907362, "retrieved": 1632802719, "over_18": false, "upvotes": 641, "upvote_ratio": 1.0, "comments": {"gjrlpqd": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjrlpqd/", "text": "I take notes concept to concept. Usually the book will clearly have them as headings for paragraphs. Something that really helps me remember new information is to pause and reflect on the idea I just read and how it relates to the previous concept (what i read before) and where it might take me (guess where the information is leading to logically). Then I think about how it relates to the course as a whole. Finally i write down my note. It takes a little longer but this ensures I no longer have to refer to the textbook for that idea.\n\nAlso I don't fully understand certain ideas sometimes so I make a note about it and move on. That's something I can just take to office hours, etc.", "author": "aapalla", "created": 1611009106, "upvotes": 1}, "gjq6dbz": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjq6dbz/", "text": "No highlights, just jot down the main points and then condense everything I wrote into my own words while keeping the main things to take away", "author": "shawnglade", "created": 1610983644, "upvotes": 1}, "gjq0b35": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjq0b35/", "text": "Most of my classes was a quick skim for the main points since the exams were more lecture heavy. When reading research studies, I pull out the highlighter to highlight the important methods, results, tables... anything I might need to look back on or cite. I read it a bit weird though - abstract first, breeze through intro, heavy focus in methods and results, breeze through the analysis and conclusions... and then go back and highlight.", "author": "Abatonfan", "created": 1610980144, "upvotes": 1}, "gjp4y3o": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjp4y3o/", "text": "I’ll read something about three times 1st just to read it 2nd to write down anything I feel that’s more important/have trouble understanding 3rd read it again with my notes usually it sticks by then", "author": null, "created": 1610952688, "upvotes": 1}, "gjozg0v": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjozg0v/", "text": "Read through once, maybe... if I remember. Notes???????? What is that??", "author": "Neversexsit", "created": 1610948611, "upvotes": 1}, "gjoyxnc": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjoyxnc/", "text": "People have been taking notes during these online classes??", "author": "NotKhoa", "created": 1610948256, "upvotes": 1}, "gjowdw8": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjowdw8/", "text": "I read the whole thing and highlight information that seems important or information that professor tells could pop up on a exam.", "author": "BaKonlover225", "created": 1610946519, "upvotes": 1}, "gjon1r5": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjon1r5/", "text": "Sq3r, skim the chapter for all the key  terms and write them down then look at the questions at the end of the chapter then read it. You can take notes or do a mind map while you read. Then rewrite/ type your notes in whatever format you want.", "author": "whathaveyoudoneson", "created": 1610940671, "upvotes": 1}, "gjol6sd": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjol6sd/", "text": "What works for me is to read first the outline or summary of the chapter to have an overarching overview of the lesson material. Next is to read the textbook while annotating in my own words to guarantee comprehension on my end. Since I have now the skeletal framework or overarching overview of the material, the reading with annotations will be more integrated and cohesive on my end.", "author": "mxrian1998", "created": 1610939592, "upvotes": 2}, "gjoj4oc": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjoj4oc/", "text": "No here’s the deal. Read the abstract and introduction then read the first line of every paragraph. If you see something you need more info on or is pertinent to a question you have to answer read more. Then read the whole conclusion. Reading every single word is a waste of time", "author": "uglybutterfly025", "created": 1610938468, "upvotes": 4}, "gjoiepc": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjoiepc/", "text": "I skim and look for important information and highlight + make notes.", "author": null, "created": 1610938105, "upvotes": 1}, "gjodbbp": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjodbbp/", "text": "I tend to take notes by paragraph. I use a dash for the main point, and the. Add bullet points and further subsections if there are any details", "author": "pokemonareugly", "created": 1610935461, "upvotes": 1}, "gjoazoc": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjoazoc/", "text": "I read in sections (sometimes skim if I'm on a time crunch), then take notes as I re-read. Typically, when I read a chapter(s) of a textbook or a novel, I read first and make sure I somewhat understand the text or passage assigned. Then, I usually take notes as I re-read to get the main points and the supporting claims. If I'm reading a novel, I'll take annotations in the book or on a separate piece of paper to highlight the important quotes or themes in the assignment. For me, this makes writing a lot easier as well as studying for tests/quizzes. Personally, when I take notes, I write page numbers, keywords, and especially questions about the assignment for the next class/lecture, so if I have any confusion with a topic I can ask the professor about it. Hope this helps!!!", "author": "Gumydenrures", "created": 1610934225, "upvotes": 4}, "gjoavay": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjoavay/", "text": "Simultaneously", "author": "sparklingsnow46", "created": 1610934160, "upvotes": 2}, "gjo8h9r": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjo8h9r/", "text": "I read the whole thing-- very slowly if its history or something that I have to retain lots of information for-- and then I read it again while taking notes, or looking over my professor's chapter or topic index and taking notes of the subjects listed.", "author": "Design4real-777", "created": 1610932864, "upvotes": 0}, "gjo7cob": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjo7cob/", "text": "I take notes simultaneously. My way is longer, but it gives me the opportunity to think through the ideas of the books critically and originally as they unfold themselves. It gives me a distinct advantage - and as my friend said when I complained that this method took a lot of time, “well, at some point, you’re going to have to think about it, so why not do it then?”\n\nMy problem is that I love every book I read with my major. I absolutely, wholly am in love with my work and studies, so I don’t want to do the grad student style of “read foreword, conclusion, and relevant chapters” because it’s as much recreation as it is work. \n\nHowever, if you are looking for advice in how to study better, I would go to r/gradschool and ask. They will have much better advice.", "author": "al_the_time", "created": 1610932270, "upvotes": 0}, "gjo10pr": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjo10pr/", "text": "i like to go heading by heading. take down important details and vocab, highlighting that in my notes. i dont mark in the actual textbook, and i don't type my notes. i don't know how effective this method is but it hasn't failed me yet :)", "author": "mformelina", "created": 1610928978, "upvotes": 0}, "gjnycat": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnycat/", "text": "I take notes simultaneously. It takes me more time but it is worth it in the end to me.", "author": "Samuelrua", "created": 1610927574, "upvotes": 0}, "gjnwzfu": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnwzfu/", "text": "Wait, you guys are doing the readings?", "author": "get_N_or_get_out", "created": 1610926866, "upvotes": 144}, "gjnvzdy": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnvzdy/", "text": "Trick question, I turn everything important into an Anki card", "author": "ItsReallyVega", "created": 1610926340, "upvotes": 3}, "gjnu7iz": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnu7iz/", "text": "i find that for assigned readings annotating while reading, and taking notes on a piece of paper helps me retain the most info! also handwriting not digital notes if that’s possible. I often print out readings if it is an article or pdf.", "author": "calm_beforethestorm", "created": 1610925427, "upvotes": 0}, "gjnqas0": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnqas0/", "text": "I take notes simultaneously", "author": "Cerenya", "created": 1610923588, "upvotes": 0}, "gjno6a8": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjno6a8/", "text": "I do both", "author": "sweetcheeks920", "created": 1610922640, "upvotes": 0}, "gjnm395": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnm395/", "text": "Simultaneously", "author": "Dabadadada", "created": 1610921731, "upvotes": 2}, "gjnm0qb": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnm0qb/", "text": "I read a text completely, no notes or highlights just markers to look stuff up, and then read again and take notes and highlight while reading. Sometimes I need to structure it afterwards but usually I am fine that way", "author": "plants_lady", "created": 1610921697, "upvotes": 0}, "gjnh830": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnh830/", "text": "I am in nursing school and our readings are several hundred pages for each class. Instead of reading the whole thing word for word, I write down the bolded key terms and their definitions and find key points at the end of most of our chapters to take note of. I then use these notes as an outline for my class notes.", "author": "icantplaytheviolin", "created": 1610919609, "upvotes": 4}, "gjng9zt": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjng9zt/", "text": "Take notes as I read or I’d forget the details.", "author": null, "created": 1610919191, "upvotes": 5}, "gjnds7g": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnds7g/", "text": "[wiki re Cornell Notetaking](https://en.m.wikipedia.org/wiki/Cornell_Notes)", "author": "vrabormoran", "created": 1610918094, "upvotes": 1}, "gjnbw9x": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnbw9x/", "text": "depending on how much time and effort im willing to put in, i found the best method is to make an outline as i read; i will read a section then make notes on the main points, definitions or other things i feel are important. i had to do this for a class as an assignment once and found its a great way to take notes that actually make sense when you study them. super time consuming tho", "author": "carminehk", "created": 1610917228, "upvotes": 0}, "gjnboyw": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnboyw/", "text": "I skim and remove the trash, then (if I'm really in the mood) write down the ACTUAL important stuff from each page. Sounds kinda obvious but there's sometimes too much filler which is never on the tests.", "author": "Fuba301", "created": 1610917136, "upvotes": 0}, "gjnb3xn": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnb3xn/", "text": "For me it depends on what I’m reading. I took a public speaking class where the reading literally only mattered for class and the quiz right after it, but everything was super common sense so I just skimmed and didn’t take notes and everything was fine. \n\nIn my media course, the only thing that mattered was definitions because the big stuff was also common sense, so I skimmed and wrote definitions but that was it. \n\nIn my music history class, literally everything was important. The point of the class is to be able to recognize styles of music from different time periods, but the textbook is written in a really obnoxious way where they never specifically stated characteristics of the music besides the obvious overarching ones, and instead focused on compositional practices (which doesn’t help much when we have to listen to a piece and determine the style when they all sound similar), so we had to infer a lot of things, if that makes sense. When I took notes, I read a paragraph and then went back and wrote notes on it again (because most of my notes were paraphrasing exactly what was written), and then I’d continue that way. \n\nI think it’s smart to have different ways of taking notes. When you decide what to do, consider what you need to know for the assignments. Is this a definition based class, is it process based, or is it about identifying changing characteristics of a topic? Each of those calls for different levels of note taking", "author": "divine_trash_4", "created": 1610916868, "upvotes": 14}, "gjnaz2h": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjnaz2h/", "text": "I read then take notes by section, generally by reading first my notes are more relevant and reflect the true points of a reading. I find if I take notes as I go it feels longer and I take notes on things that end up being unimportant or irrelevant the assignment/exam/learning goals.", "author": "DiazugmaCaesar", "created": 1610916807, "upvotes": 1}, "gjn9fap": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjn9fap/", "text": "I take notes as I read, Usually I would have ideas that pop up as I am reading. In order to not lose those thoughts I just write them down.", "author": "GodOfThunder101", "created": 1610916097, "upvotes": 8}, "gjn7bmv": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjn7bmv/", "text": "I'm a take notes as you go person. I also don't highlight the text, I write my notes by hand in my notebook so I can tailor the notes to make them stick better in my mind. It also keeps the book in good condition so that if I decide to sell it after the term I'll get a better price for it.", "author": "umlautpronouncer", "created": 1610915067, "upvotes": 39}, "gjn5jjy": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjn5jjy/", "text": "Skim first then I read and take down only the important things (1-2 sentences max per paragraph) after I am done I read through my notes to make sure I can understand it and it encompasses the text, then from that I condense the notes and make them 'look pretty' so that it is easy for my brain to read and I want to read them, then one final read though to make sure the final product encompasses all the important main parts.", "author": null, "created": 1610914186, "upvotes": 30}, "gjmqwyq": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjmqwyq/", "text": "My best test scores resulted after skimming a section first, and then taking notes while re reading that section. I don't like highlighting. I understand and remember the main points better if I put it in my own words on paper.", "author": "Defrost_ThenStir", "created": 1610908340, "upvotes": 153}, "gjmof8x": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjmof8x/", "text": "I used to do 1 600lvl a month and this method seemed to work the best with textbooks. I would skim a chapter for main points, then go back and read in order to attach context to main points. The notes then would be ordered main point then sub ideas that support main point. \n\nThis also made it easier if I had to write a paper later. The notes would have all the points in it with supporting claims attached.", "author": "InsertNovelAnswer", "created": 1610907711, "upvotes": 458}, "gjmni2g": {"link": "/r/college/comments/kzbl9x/if_you_have_to_do_a_reading_do_you_read_the_whole/gjmni2g/", "text": "I tend to break it down by sections. I'll read those sections and then go back to the beginning of that section and then do notes. When I'm in a time crunch I'll take notes as I'm reading. But I tend to take better notes with the first method because I'm able to pick out the most important stuff more efficiently after I've already read it.", "author": null, "created": 1610907482, "upvotes": 85}}}