{
  "sid": "r0g70n",
  "link": "/r/college/comments/r0g70n/made_a_mistake_in_registering_for_classes/",
  "title:": "Made a mistake in registering for classes!",
  "text": "I’m currently planning on being a psych major and the beginning of the year(first year in) was confusing for me so I tried my best in finding classes that I thought would give me prerequisites for psychology. Now nearing the end of the semester, I’ve realized ONE of my classes are not required at all and it points out more as an elective? I think? I was planning to graduate in 4 years but will this one mistake change that? I’m really anxious about this because I wanted to be sure that I graduate on time for private reasons and I don’t want to change that.\n\nEdit: yes I did come to realize that I had an assigned advisor but I didn’t realize it would’ve been helpful back then. I would email them but I want to hear from your experience if you’ve faced something like this and to give advice. Thank you!",
  "author": "potatopua",
  "created": 1637682670,
  "updated": 1637688976,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hls42py": {
      "link": "/r/college/comments/r0g70n/made_a_mistake_in_registering_for_classes/hls42py/",
      "text": "The way that it affects when you graduate will depend on how many classes you’re required to take. Many colleges have this information available online, could you try looking for that? Searching “[college] psychology major” will probably bring it up. And don’t forget about general graduation requirements that your college has for every student regardless of major. \n\nFor me, I found what I need to take for my major online and wrote it all down, including the prerequisites for each class. I also wrote down my school’s general graduation requirements. Using this information, I mapped out a POTENTIAL 4-year plan for my classes, and then just started following the plan. Things have come up that have altered the plan, but each time that’s happen, I’ve just adjusted the plan. \n\nIf all the info you need is online, you won’t even need to talk to an advisor (although it’s probably a good idea).",
      "author": "when-words-fail",
      "created": 1637683252,
      "upvotes": 1,
      "replies": {
        "hls4o6y": {
          "link": "/r/college/comments/r0g70n/made_a_mistake_in_registering_for_classes/hls4o6y/",
          "text": "My mistake was looking at a chart on what I thought would be classes that I’d need to take :/  yes I will be taking my GED next semester after I complete my placement tests but I’m still so nervous on this one mistake I’ll take up your idea on mapping out all the classes I’d need to take including prerequisites. Thank you for that",
          "author": "potatopua",
          "created": 1637683498,
          "upvotes": 1,
          "replies": {}
        },
        "hls5q91": {
          "link": "/r/college/comments/r0g70n/made_a_mistake_in_registering_for_classes/hls5q91/",
          "text": "Oh I just realized something after rereading your first sentence. My college requires around 40 credits for psychology(partly the reason why I took it, little classes required XD) and it’s 120? Or 124 to graduate. Thank you once again. Nerves have been calmed and will certainly talk to my advisor again just to be sure",
          "author": "potatopua",
          "created": 1637683930,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}