{
  "sid": "qrqiqs",
  "link": "/r/college/comments/qrqiqs/please_help_me_this_teacher_is_a_really_big/",
  "title:": "Please help me, this teacher is a really big problem.",
  "text": "Hey everyone. I’m doing my work for this class and I’m realizing that mostly everything I’ve done is considered late to her. Let me tell you why.\n\nSo the main issue is she has all her assignments due every Monday. Now that’s fine but the problem is when reading the fine print of the assignments, they’re all due the day before (Sunday) in the very bottom of the page and not on the assignment itself. You have to go into a folder where that little due date is hidden away. Then she has the replies for the work due the day after the due date. This is really bothering me because I go off my calendar and I plan based off my school calendar. She doesn’t have the due dates anywhere else but hidden away in these folders and not even mention it on the assignments so now all my assignments are considered late due to that. (Thankfully only two but still a big issue that she does that.)\n\n\nThe other big issue is she gives us assignments that are due on our breaks. I actually have an assignment due today that I wasn’t made aware that this was our off day for classes.\n\nIs this a problem or am I making it more than it’s supposed to be?",
  "author": "bluesolur",
  "created": 1636652346,
  "updated": 1636654738,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk88x4w": {
      "link": "/r/college/comments/qrqiqs/please_help_me_this_teacher_is_a_really_big/hk88x4w/",
      "text": "Do you have a syllabus? All due dates should be listed there and if any changes are made, it should be updated by her with ample notice.",
      "author": "DHgirl_",
      "created": 1636653487,
      "upvotes": 1,
      "replies": {
        "hk8a7xe": {
          "link": "/r/college/comments/qrqiqs/please_help_me_this_teacher_is_a_really_big/hk8a7xe/",
          "text": "I checked it over and I made another discovery.\n\nShe didn’t touch it at all or change it. It just says “week 1-16” there are no due dates on the syllabus.\n\nThis course is an 8 week course.",
          "author": "bluesolur",
          "created": 1636653997,
          "upvotes": 1,
          "replies": {
            "hk8bgd5": {
              "link": "/r/college/comments/qrqiqs/please_help_me_this_teacher_is_a_really_big/hk8bgd5/",
              "text": "That’s odd… the syllabus is like a contract. All expectations for the course should be listed, if not there’s a problem. I would definitely email and inquire about that. Simply mention that you noticed the due dates for the assignments are not listed and you would like clarification on when she would like them submitted by so that you can make sure to submit them in a timely manner moving forward.",
              "author": "DHgirl_",
              "created": 1636654491,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}