{
  "sid": "l18z4l",
  "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/",
  "title:": "Is it common to feel \"empty\" at the start of the semester?",
  "text": "One of my classes has the menial bullshit \"submit a video introducing yourself\" assignment and in the moment I saw it I thought about dropping college altogether. Not in a \"fuck this\" sense, just extreme apathy. I get bored and distracted with reading syllabuses or filling out my calendar. I'm attending synchronous meetings but doing the bare minimum to look presentable or be engaged.\n\nI haven't felt like this before- not overly anxious about everything. I get a little mad reading about future group projects and stuff, but not exactly worried whether I'll succeed this semester. It's a blessing and a curse. I'm actually more anxious right now that I'm not more stressed, because this isn't normal for me, and being stressed is and has been the only reason I can get through school. \n\nMaybe it's just residual longing for a bigger break, maybe my brain just can't take the dreariness of covid college anymore. Whatever it is, if you're experiencing something similar, it would reassure me to know I'm not alone.",
  "author": "RedditSucksDuckDik",
  "created": 1611148621,
  "over_18": false,
  "upvotes": 735,
  "upvote_ratio": 0.99,
  "comments": {
    "gk1qz8s": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk1qz8s/",
      "text": "I think it has to do with Covid I noticed that with myself I really felt like what’s the point because it seems like all this online school doesn’t give you a since of accomplishment that going to class and meeting people would I also think it’s the people around not really understanding that I’m actually in college because I mostly work on assignments at 2am like they know but I never say look at this I’m doing you know this is just a really tough time to be in college",
      "author": "Cantfrickingthink",
      "created": 1611224704,
      "upvotes": 2,
      "replies": {}
    },
    "gk1d2w3": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk1d2w3/",
      "text": "Definitely feel you on the apathy side. Not gonna lie though, this is how I felt since my college career started 4 and a half years ago. It's always felt quite dreary to me so the only real difference is less movement commuting to school which may have impacted my general mindset.\n\nOn a slight side note, I adopted the mentality of optimistic nihilism shortly out of high school. Feels more fitting in the current times actually. Everything is fucked so why not try and make the best out of it if you can.",
      "author": "DjSzymek",
      "created": 1611211303,
      "upvotes": 1,
      "replies": {}
    },
    "gk16b5w": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk16b5w/",
      "text": "The COVID crisis ,  online classes, loans and debt are all contributing factors. Shit, it's damn depressing",
      "author": "DenimJacket666",
      "created": 1611206289,
      "upvotes": 1,
      "replies": {}
    },
    "gk13kuu": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk13kuu/",
      "text": "Same here. It’s so hard to keep motivated when there’s no real contact with any of it",
      "author": "Wanker169",
      "created": 1611204556,
      "upvotes": 1,
      "replies": {}
    },
    "gk0xt20": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0xt20/",
      "text": "I can’t do online learning, but I got the opportunity to attend my local community college at no cost from my side. All courses and textbooks will be paid by the college I attend. I just can’t do online learning, I get distracted so easily. I’m in a little sticky situation right now. I was paying attention in Calc 1 up until 3/4 of the semester. The last chapter was the most important and I decided to blow it off. Well, that wasn’t very smart. I’m taking Calc 2 now and I have no idea what I’m fucking doing.",
      "author": "ramiroab",
      "created": 1611201215,
      "upvotes": 1,
      "replies": {}
    },
    "gk0suy5": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0suy5/",
      "text": "If I had any career paths that would satisfy me without going to the college I’d take em. I hate school, always did. Much prefer being in a real work environment. But at the end of the day you should think about the best alternative. What are you gonna do with your life if you drop out?",
      "author": "MaleficentDistrict22",
      "created": 1611198600,
      "upvotes": 1,
      "replies": {}
    },
    "gk0sltl": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0sltl/",
      "text": "You're not alone. I've often deviated between mildly social person and social recluse, but man is the pandemic fucking with us. It was nice when people would come by and say, \"hey, man, come on, let's go do -insert activity-\". \"no, no, come on, you have to get out of the house.\"\n\nNow you get your uninterrupted alone time, but it's crickets. And I wait for that voice to say, \"Hey, man, let's...\"",
      "author": null,
      "created": 1611198472,
      "upvotes": 1,
      "replies": {}
    },
    "gk0ar98": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0ar98/",
      "text": "Yup, especially now. School starts on the 25th for me and I've been feeling very \"fuck this\" lately. I believe that the pandemic blues has finally gotten to me.",
      "author": "BattleAutomaBree88",
      "created": 1611189433,
      "upvotes": 2,
      "replies": {}
    },
    "gk07tau": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk07tau/",
      "text": "Felt it dude I’m sitting in a class rn and I just can’t",
      "author": "smeseal99",
      "created": 1611187920,
      "upvotes": 1,
      "replies": {}
    },
    "gk06ntq": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk06ntq/",
      "text": "once the semester starts, i feel a little bit *floaty* for a week or two until assignments start to get graded. That then gives me the feeling as to whether the class will be relaxed and easy, or stressful and difficult.",
      "author": "WWalker17",
      "created": 1611187324,
      "upvotes": 1,
      "replies": {}
    },
    "gk02dav": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk02dav/",
      "text": "I have undiagnosed mental illnesses...so",
      "author": "cassiusthetic",
      "created": 1611185146,
      "upvotes": 2,
      "replies": {}
    },
    "gk02b55": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk02b55/",
      "text": "Yea I totally get this, also doesn't help when a professor doesn't take the time to read over the syllabus on the first day and talk about the class, they just jump right into the material.\n\nLike god damn this class is so intensive that you couldnt take one day out of the many days in the entire semester to explain the basics before we start everything.",
      "author": "IronGemini",
      "created": 1611185115,
      "upvotes": 1,
      "replies": {}
    },
    "gjzva28": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzva28/",
      "text": "I feel like that after the end of Semesters, the recent holidays have been anything but recreational and looking forward to those felt kinda terrifying...",
      "author": "themo98",
      "created": 1611181666,
      "upvotes": 1,
      "replies": {}
    },
    "gjzv5pa": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzv5pa/",
      "text": "It's hard to be cheerful when it feels like the world is crumbling around you. I often think \"What is the fucking point in these introductions? I will never see these people again so who cares?\" \n\nALL my classes start with this assignment or discussion thread that is mandatory and it gets old really fast. \n\nSave your introductions for future classes because it's free points to your grade and you are pretty much repeating yourself.",
      "author": "PleasantRub",
      "created": 1611181607,
      "upvotes": 9,
      "replies": {
        "gk0wfk8": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0wfk8/",
          "text": "theyre completley pointless im here for the class not for you",
          "author": "theaura1",
          "created": 1611200472,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gjztcfr": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjztcfr/",
      "text": "I'm doing online classes because of covid. It feels gloomy and annoying. But its my last semester. I have push through.",
      "author": "GIGACharlyZar",
      "created": 1611180766,
      "upvotes": 2,
      "replies": {}
    },
    "gjzt9gs": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzt9gs/",
      "text": "Normally, no. But this semester, yeah. One of my teachers brought it up yesterday, how normally over break everyone goes home, recharges, and comes back happy and ready and whatever. This semester, we went from the couch, to the couch, but with a professor on a laptop. Everyone is still tired from last semester, and there wasn't even really a break, even though it's been a month. That really hit the nail on the head for me. I'm tired of my classes, and they haven't even started.",
      "author": "TrekkiMonstr",
      "created": 1611180727,
      "upvotes": 17,
      "replies": {
        "gk1413l": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk1413l/",
          "text": ">  Everyone is still tired from last semester, and there wasn't even really a break, even though it's been a month. That really hit the nail on the head for me. I'm tired of my classes, and they haven't even started.\n\nYep. I'm tired of them as well, and my semester hasn't even started yet.",
          "author": "Quant_Liz_Lemon",
          "created": 1611204837,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gjzqje7": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzqje7/",
      "text": "this is my fist time attending college and yesterday was my first day I felt the same way empty even today i have more classes same feeling i wonder when it will leave",
      "author": "redditwanderer_",
      "created": 1611179484,
      "upvotes": 1,
      "replies": {}
    },
    "gjzphao": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzphao/",
      "text": "Yes, especially now. I’ve struggled with this all day.",
      "author": "noexqses",
      "created": 1611179003,
      "upvotes": 1,
      "replies": {}
    },
    "gjznxjw": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjznxjw/",
      "text": "This school year has definitely been difficult for me, being so isolated, so I get where you’re coming from. I would do the assignment anyways and maybe mention your feelings privately to your instructor. Honesty and candidness really helps these days.",
      "author": "FreezingDemon",
      "created": 1611178312,
      "upvotes": 2,
      "replies": {}
    },
    "gjzmbq8": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzmbq8/",
      "text": "I felt nothing. I feel nothing. Not even a boost when I submit an assignment.",
      "author": "Adhdicted2dopamine",
      "created": 1611177595,
      "upvotes": 11,
      "replies": {}
    },
    "gjzltdr": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzltdr/",
      "text": "I remember my first semester of college lmao. Was a huge wake up call",
      "author": "G_cheezy",
      "created": 1611177367,
      "upvotes": 4,
      "replies": {}
    },
    "gjzljws": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzljws/",
      "text": "Felt that my entire college career. Congrats, turns out you're normal!",
      "author": "GennaroIsGod",
      "created": 1611177250,
      "upvotes": 4,
      "replies": {}
    },
    "gjzjp9i": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzjp9i/",
      "text": "You need something to look forward to, whatever that may be. Without some sense of purpose, either personal or shared, apathy or depression can takeover.",
      "author": "BenjaminTW1",
      "created": 1611176422,
      "upvotes": 5,
      "replies": {}
    },
    "gjzj0q6": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzj0q6/",
      "text": "I've never had that Assignment. THANK GOD",
      "author": "3718237182Kg",
      "created": 1611176123,
      "upvotes": 3,
      "replies": {}
    },
    "gjzg7xv": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzg7xv/",
      "text": "i am feeling so apathetic towards school as well. my father passed away about three weeks before i started classes, and before then all i could think about was taking a gap semester or leaving altogether. i don't think there are any words of encouragement that are helpful other than college is not always the answer and sometimes what feels like anxiety or intrusive thoughts about school may actually be your intuition saying something needs to change. i've decided to stay in school and i'm just looking forward to getting it over with. sending you luck on your journey",
      "author": "missmasterchefjunior",
      "created": 1611174903,
      "upvotes": 59,
      "replies": {
        "gjzgyw8": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzgyw8/",
          "text": "im so sorry for your loss and im sending you my best wishes for the rest of your school journey!",
          "author": "ashyashhh",
          "created": 1611175228,
          "upvotes": 15,
          "replies": {}
        },
        "gjzjx7d": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzjx7d/",
          "text": "My condolences to your family🙏🏽. I hope you have a great rest of your year!",
          "author": "_cheesepizza",
          "created": 1611176520,
          "upvotes": 7,
          "replies": {}
        },
        "gjzmm2q": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzmm2q/",
          "text": "Congrats on deciding to stay in school. We all have multiple paths laid out ahead of us, and college is definitely not the \"easiest\" one to take, but it *is* right of passage. It is easy to get derailed when something tragic happens like the death of a parent, but in the long run, you don't want that to be the reason you dropped out.",
          "author": "BIG_IDEA",
          "created": 1611177723,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gjzdk2t": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzdk2t/",
      "text": "I think you should see a therapist. I went through similar feelings and it went downhill really fast. I almost lost my academic scholarship, I had no friends, and my family relationship also started to fail. Nothing seemed worth it. I was in a state of apathy. Seeing a therapist helped me through all of this. \n\nIf not a therapist, might I make some recommendations that will help you? These at least helped me. \n\nClean your living spaces: these are the places you want to go home and relax in, so make sure they are decluttered. An exterior reflects an interior. \n\nWrite out your feelings: sometimes it’s hard to talk to people and that’s okay, but don’t bottle things up. It’s also a good way of congratulating yourself on the little things in a private manner. Cause sometimes we want to be appreciated for the work we’ve done, and perhaps that’s why you feel the way you feel.\n\nFind a hobby: it helps with those feelings of apathy. Like I said previously, what you’re feeling may result from feelings of underachievement or the inability to see your own accomplishments. Doing a hobby will force you to see your own accomplishments as when you finish a project, you have to see all of the work you’ve done. \n\nCry. I know it’s tough but it’s okay. You can cry. I do have to warn you. Once you start it’ll be hard to stop. And that’s okay. You many not feel like you need to cry, as you’ve expressed apathy, but trust me. You need it. You deserve it. Because it will be a hard push into feeling the feelings that you’ve been suppressing. Make sure you have plenty of water on hand, though, because crying will dehydrate you. \n\nYou will be okay.",
      "author": "QueenZeon101",
      "created": 1611173747,
      "upvotes": 37,
      "replies": {}
    },
    "gjzby80": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzby80/",
      "text": "I have til Feb 8th but yeah. Feeling empty. My last spring semester, and it's... this.",
      "author": "neverfakemaplesyrup",
      "created": 1611173037,
      "upvotes": 7,
      "replies": {
        "gjznnct": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjznnct/",
          "text": "If nothing else, the light at the end of the tunnel is nigh. \n\nThere are a few more months of the grind, and then your new chapter starts.",
          "author": "lobotomyzer",
          "created": 1611178183,
          "upvotes": 6,
          "replies": {
            "gjzo5t7": {
              "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzo5t7/",
              "text": "Yep. Unfortunately lol I will be graduating in fall. All my major/minor reqs will be done, but there is a mandatory +8 credits- can be in any major/minor, just has to be upper level.\n\nSo close and so mixed about it. At least I stuck with it. Thank you for the optimism!!",
              "author": "neverfakemaplesyrup",
              "created": 1611178417,
              "upvotes": 3,
              "replies": {
                "gk11lke": {
                  "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk11lke/",
                  "text": "So it's, very possibly, downhill after this semester. Keep up your hard work. It's hard, but most hard things are worth doing.",
                  "author": "lobotomyzer",
                  "created": 1611203366,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gjyrxh9": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjyrxh9/",
      "text": "Don't worry some assignments will fill that void right up!",
      "author": "Givemethatnow",
      "created": 1611164392,
      "upvotes": 20,
      "replies": {}
    },
    "gjyqpff": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjyqpff/",
      "text": "Honestly I just felt anger today more than anything. The teacher glazed over key math concepts in like 5 seconds leaving me feeling like a fucking moron when I didn't grasp it. Actually considered quitting is well. But in a \"fuck this\" kind of way. \n\nI can't though. In order to become a successful little wage slave I *need* this over priced piece of paper. If I quit now, loans won't go through next semester and I won't be able to add to my catastrophic debt.",
      "author": null,
      "created": 1611163873,
      "upvotes": 167,
      "replies": {
        "gjzogb7": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzogb7/",
          "text": "Hit this on the head",
          "author": "gmtguy96",
          "created": 1611178550,
          "upvotes": 23,
          "replies": {}
        },
        "gjzxrqa": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzxrqa/",
          "text": "[deleted]",
          "author": null,
          "created": 1611182863,
          "upvotes": 12,
          "replies": {
            "gk0ugi4": {
              "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0ugi4/",
              "text": "In my opinion, it feels like they're eager to get off of zoom. Today this lady was was actually blowing through to the next question before I got the equation down. I'm not a slow writer, she was just going fast. Over half of my class is also enrolled in esol, which is like for transfer students with broken english. I can only imagine what they're thinking and most likely too intimidated to speak up, I should probably say something to her honestly",
              "author": null,
              "created": 1611199426,
              "upvotes": 3,
              "replies": {}
            },
            "gk13sp0": {
              "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk13sp0/",
              "text": ">  Professors going through concepts that they themselves have probably taught over and over again so it’s a piece of cake to them\n\nProfessor here. A lot of us are struggling as well. I'm teaching new courses this semester. Zoom college sucks for everybody.",
              "author": "Quant_Liz_Lemon",
              "created": 1611204694,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gk2s4yq": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk2s4yq/",
          "text": "At this point I am literally teaching myself everything in key math or science classes. It seems only the lower level classes are the ones that can actually 'teach' you anything. Imagine paying so much money to only teach yourself at the end!",
          "author": "siimchahal",
          "created": 1611247789,
          "upvotes": 3,
          "replies": {
            "gk2z98o": {
              "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk2z98o/",
              "text": "Exactly. Yesterday I was on YouTube and khan academy teaching myself the course work. Someone made a groupme for the class and it turns out a bunch of people got swept as well. It's sucks because, while I'm no math wiz, math is still really interesting to me and I want to enjoy learning it with a qualified instructor, like I'm paying for. But instead I'm on a free internet video, all the while just as broke.",
              "author": null,
              "created": 1611250878,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gk0sx13": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0sx13/",
          "text": "mind if I ask what your definition of \"catastrophic debt\" is? I used to to carry the same sentiment but when you look at the bigger picture, it's not so bad depending on what you're studying. if you're in-state for most or all of your degree and you're a STEM major and you end up with $30-40k debt... you'll be fine. if you're a theatre major with one year out-of-state and you end up with $80k debt... you might be doomed.",
          "author": null,
          "created": 1611198629,
          "upvotes": 5,
          "replies": {
            "gk0tu6p": {
              "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0tu6p/",
              "text": "[deleted]",
              "author": null,
              "created": 1611199104,
              "upvotes": 2,
              "replies": {
                "gk0wqs6": {
                  "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0wqs6/",
                  "text": "I'm in the same boat.. trio student here. what are you studying if you don't mind me asking? what would you study if money wasn't an issue?",
                  "author": null,
                  "created": 1611200634,
                  "upvotes": 1,
                  "replies": {
                    "gk15nsf": {
                      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk15nsf/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1611205866,
                      "upvotes": 2,
                      "replies": {
                        "gk1e77f": {
                          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk1e77f/",
                          "text": "I'd also be begging for change without this opportunity haha. Good luck with your studies.",
                          "author": null,
                          "created": 1611212249,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "gk3fm3r": {
                          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk3fm3r/",
                          "text": "Yep. I put off college for a while because I was really scared of the debt. Now I'm like \"a bit of debt is just an almost inevitable trade off for the more likely chance of having a job that doesn't make me wanna die or is even enjoyable.\" It's just one of those bittersweet facts of modern society.",
                          "author": "KansaiKanpai",
                          "created": 1611258221,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gk3ckko": {
                  "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk3ckko/",
                  "text": "Bruh let me tell you right now, do NOT take on more than 30k in debt. You are making a huge mistake. Idk why you're accruing this much debt. Are you out-of-state?",
                  "author": null,
                  "created": 1611256856,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gjypavs": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjypavs/",
      "text": "One of my asynchronous classes wants us to \"check-in three times a week or more\". This class would be maximum of two classes a week if it were in person. \n\nFor all the professors that keep it most like it would be if we were attending class, I appreciate them. For the ones that think I need more attentiveness because I don't arrive in person, please just let me do my work. If I put in 65 hours a week, it's a light week for me. \"Checking-in\" that much is just a distraction from actually doing course work.",
      "author": "Bodidiva",
      "created": 1611163294,
      "upvotes": 44,
      "replies": {
        "gjzout7": {
          "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzout7/",
          "text": "One of my asynchronous classes this semester would have been 1 hour 15 minutes twice a week, or 2.5 hours a week in person. But instead, my professor is using this asynchronous opportunity to record 35 to 40 minutes video lectures for each module, which equates to about 5-6 hours of video a week which is all testable. She says things like, \"thank God we don't have to worry about time limits on this anymore, I can give you all of the information.\"",
          "author": "BIG_IDEA",
          "created": 1611178732,
          "upvotes": 14,
          "replies": {
            "gjzrv4n": {
              "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjzrv4n/",
              "text": "I noticed last semester, with online classes, professor's were expecting more work from students.",
              "author": "BissySitch",
              "created": 1611180082,
              "upvotes": 11,
              "replies": {}
            },
            "gk0bjzz": {
              "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gk0bjzz/",
              "text": "That wouldn't fly at my school. If it's lecture time, it can only be the time allotted to the class. Homework of course is different, but if those videos are lecture, then I can't see that as \"homework.\" Our professors have to make available all their class lectures and end class no more than a few minutes after the scheduled time. They stay after to help some, but tell the others they can go.",
              "author": "Bodidiva",
              "created": 1611189837,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gjxyo7b": {
      "link": "/r/college/comments/l18z4l/is_it_common_to_feel_empty_at_the_start_of_the/gjxyo7b/",
      "text": "Yeah, I started today and was just overwhelmed by complete apathy. It's probably my depression taking over the void of online education. I know the subject and I know I can do it, but there's just this lusterless wave drowning me here.",
      "author": "CptCarpelan",
      "created": 1611150283,
      "upvotes": 194,
      "replies": {}
    }
  },
  "updated": 1634056641
}