{
  "sid": "qqchsd",
  "link": "/r/college/comments/qqchsd/i_failed_an_exam_for_the_first_time_any_advice_on/",
  "title:": "I failed an exam for the first time, any advice on not feeling like a failure?",
  "text": "The title pretty much says It all. I failed a very important midterm worth 50% of our grade, despite the fact  that I had studied very, very hard, which makes It even more painful. The subject is microeconomics, It's well known at my university as a subject that most people will fail since the classes don't really cover the exam's material for whatever reason. I have a chance to redeem myself in june, if I fail again I have to retake the class which wouldn't be covered by my scholarship. So yeah, I feel pretty terrible at the moment, especially because of the fact that I tried so hard but still failed. Any wise words on the matter?",
  "author": "Ok-Put3685",
  "created": 1636489669,
  "updated": 1636655210,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hk059bd": {
      "link": "/r/college/comments/qqchsd/i_failed_an_exam_for_the_first_time_any_advice_on/hk059bd/",
      "text": "You aren't a failure. You said it yourself - for some reason the exam doesn't cover what you went over in class, and a lot of people don't do well for that reason. Guess what? You tried very hard, and that's more than a lot of people can say. \n\nAll you can do now is try to learn from your mistakes and improve. For example, was the test mostly based on the reading? If it was, focus on the reading. Try to meet with the professor to discuss why you performed the way you did. If the professor refuses to meet with you, contact the econ department chair. If your professor did not properly teach you the material, and refuses to help you, then that's a problem that a higher up needs to deal with. If you can get tutoring go for that. Tutoring now could really help you, even if you plan on retaking this class. \n\nI'm surprised that a midterm is worth 50% of your grade. In most schools, it would be between 20-30%. That's very bizarre. What else are you graded on?",
      "author": "Paesana",
      "created": 1636502554,
      "upvotes": 1,
      "replies": {}
    },
    "hk123h9": {
      "link": "/r/college/comments/qqchsd/i_failed_an_exam_for_the_first_time_any_advice_on/hk123h9/",
      "text": "Talk to the professor. Go to peer tutoring if they have that. Form a study group, since it sounds like there may be others in the same boat as you. If you studied a lot and failed, it may mean that you need to try a different studying method.\n\nFailing feels awful I know :( but you'll want to make sure to talk about it with the professor so you know if you can still pass the class and with what grade.",
      "author": "Pangolin007",
      "created": 1636517667,
      "upvotes": 1,
      "replies": {}
    },
    "hk1xf1c": {
      "link": "/r/college/comments/qqchsd/i_failed_an_exam_for_the_first_time_any_advice_on/hk1xf1c/",
      "text": "Some people fail at marriage and still go on to bigger and brighter marriages! /humor",
      "author": "Optimus_Prime83",
      "created": 1636540944,
      "upvotes": 1,
      "replies": {}
    }
  }
}