{
  "sid": "qeng2l",
  "link": "/r/college/comments/qeng2l/im_failing_a_class_but_im_strangely_not_bothered/",
  "title:": "I'm failing a class but I'm strangely not bothered by it.",
  "text": "I'm in Film/TV and Animation major and this quarter I am taking Intro to Geology, Math for Elementary Teachers, and Intro to Meteorology as a GE requirement. Recently, I just had my big mid term and I passed two out of the three. The one I totally bombed is the Geology class but I'm weirdly not bothered by it? Is this normal? The past three years I have been passing all my classes with a B or higher but this is my first F (so far). I kept asking myself \"why should I care about some rocks?\" or \"this isn't my field of focus\". Has this thinking grown some type of apathetic attitude towards something not related to my field? \n\nThe thing is, this Geology professor has a really weird way of teaching which I have not seen ever in my life: assigning pages and pages of reading which takes hours to finish, a lab, and pre-recorded lectures which he goes on and on about the chapter without really showing off much of the definition of the vocabulary, he just shows the word on the screen but never really go over it or make it obvious. Assignments, readings, etc contains numerous spelling errors and punctuation errors that I would have to figure out what it meant so I sent him multiple emails about the mistakes but I never heard back (waiting 5+ days now).\n\nAm I apathetic because of how terribly the class is being taught? At this point, I don't even care if I fail this one class in particular. I'll just move on and that's that but at least I'm passing two out of the three classes.\n\nEdit: Yes, I have checked all of my folders in my email and made sure I'm on the right email account since I have multiple for work, school, and personal use.\n\nEdit 2: No, I don't mind the reading assignments, I love reading. The main core of the major tests and quizzes isn't really focused in this class for some reason.",
  "author": "Additional-Sample727",
  "created": 1635061121,
  "updated": 1635184540,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "hhu6qr1": {
      "link": "/r/college/comments/qeng2l/im_failing_a_class_but_im_strangely_not_bothered/hhu6qr1/",
      "text": "It's hard to say how people come to feel a certain way about things. But, I do see the mindset that \"if it's not related directly to my major, it doesn't matter all that much\" quite often. I think that's because it doesn't necessarily put your whole degree into question. General education requirements are very much so just a phase and usually don't define what one should or shouldn't pursue as a major. It seems like you're the type of student to just take their losses and roll with it because they accept that there isn't much they can do at some point, which works out for some people and doesn't work out for others.",
      "author": "yourangleoryuordevil",
      "created": 1635061674,
      "upvotes": 5,
      "replies": {
        "hhu79l3": {
          "link": "/r/college/comments/qeng2l/im_failing_a_class_but_im_strangely_not_bothered/hhu79l3/",
          "text": "Huh, I've never view it like that. Interesting. It's so bizarre, you know? Failing on a rare occasion felt more like a slap to the face but I just shrug it off or being insulted and my response is just \"ok\".\n\nI obviously do still care about my grades but not this one.",
          "author": "Additional-Sample727",
          "created": 1635062116,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}