{"sid": "l2jm3k", "link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/", "title:": "I actually like online classes?", "text": "This is kinda weird y'all. But i actually love them. No going to class, no getting dressed. Talking about the material we learned. It's not bad. I feel like I still have a connection with the teacher.\n\nI'm a nursing major and our school is doing the hybrid thing where they do half of the lectures in person and the rest on zoom( we still have to go to labs and clinical in person). I'm like i feel like it's more better if they do it all on zoom. But apparently alot of people like going to the lectures???? Im just not understanding.\n\nI don't know how learning online is unmotivating. I guess it's just me. \n\nFor my next major, I'm doing it online. I'm gonna become an art major. It's just more comfortable to learn from your own space.", "author": "OpenedPandoraBox", "created": 1611304869, "retrieved": 1632802714, "over_18": false, "upvotes": 651, "upvote_ratio": 0.94, "comments": {"glizhro": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/glizhro/", "text": "I have one class from 5:30-7:30 on tuesdays only. If they offer this in the summer I’m gonna take a full load or more and move out of town and do online school while I live somewhere else for a few months. I love it I honestly hope they continue to offer online until they correct this COVID situation. I can work and not be stressed I hate sitting through lectures of shit I already knew. I read the text book thoroughly the beginning of the semester and just show up to take tests.", "author": "Kirkthewebsurfer", "created": 1612131368, "upvotes": 1}, "gkqfhe2": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gkqfhe2/", "text": "I prefer online classes and I'm actually getting a little anxious about the eventual return to in-person because of the commute. Most of the pre-engineering courses are only offered at a campus an hour away, in an area with some of the worst drivers in the state, whereas my local campus doesn't offer any courses further than Calc 2 and Chem I.  Right now I can take these classes at my leisure, the move to online hasn't affected my learning in the slightest, but probably starting Fall 2021  I'll have to be crisscrossing the city for several hours a week on top of working full time and I don't think I can manage.", "author": "Zache7", "created": 1611598839, "upvotes": 1}, "gkh37yf": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gkh37yf/", "text": "For me, learning with an online school hasn't felt any different from being homeschooled all these years. As a result, my view of it is much different. It's familiar to me, it's comfortable, and it spares me the stress of being away from home and dealing with circumstances I don't want to deal with.\n\nStill, it has its drawbacks. Professors and classmates don't respond to emails or hold conversations like they would in person. Other than that, I don't really feel like I'm missing much, because I was dreading college anyway.", "author": "rtren_570", "created": 1611449800, "upvotes": 1}, "gkgddf1": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gkgddf1/", "text": "Marry me. 😍 lol", "author": "SuperiorT", "created": 1611439643, "upvotes": 1}, "gkfhua2": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gkfhua2/", "text": "Currently taking a traditional online class with no video lectures or meetings or anything. Just complete the work on time. I love this shit, no wasting time going to class. No listening to stupid questions from other students interrupting class.", "author": "whathaveyoudoneson", "created": 1611429846, "upvotes": 1}, "gkee3at": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gkee3at/", "text": "I think the same as you. Might be selfish thought but my college is a bit far away from my home(4hr round trip) so i can save transportation fee as well as the dormitory expense thanks to online classes.", "author": null, "created": 1611419207, "upvotes": 1}, "gk8t88r": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk8t88r/", "text": "I'm not too excited about the whole online classes thing. Art major here. I started off college being online and it's been hard to make friends and be active on campus. My classes are mostly on Microsoft Teams where nobody turns on their camera, nobody really talks, and some of the professors STILL don't know how technology works. The material is hard to learn when people are expected to learn things more independent (when they weren't without COVID) and we can't get into the makers lab for projects. \n\nI guess it would be different if I had lectures instead of studio classes where I could see the benefit of online classes, but that''s not my schedule.", "author": "WillowStellar", "created": 1611351591, "upvotes": 1}, "gk8dddr": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk8dddr/", "text": "I feel like a lot of it has to do with what you’re trying to get out of the course. I can see nursing being the sort of thing where rote memorization is more important than like, deep discussion. My field, you can definitely just rote memorize some stuff and get an A, but I don’t think you understand it as much unless you dig into it and get down the the why. And frankly a lot of the instructors at my school are really phoning it in and not bothering to lecture at all, so I’m not getting that part of it and it feels like a rip off. Luckily we just got a 50% tuition waiver so I’m much less salty about it.", "author": "DoristhePorous", "created": 1611346165, "upvotes": 1}, "gk8ccz5": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk8ccz5/", "text": "I really am full of this online classes, I don’t have motivation to go, I just lay in bed or watch Netflix... before I had a routine, getting up, bathing, breakfast, bus, subway and getting to uni, and then the day was fun, and I went to classes, studied a bit there and then come home and just relax, it was a really fun life (not even metioning parties or just hanging out with friends). I’m zero productive with this system\n\nI just want this to be over ...", "author": "HedaLexa4Ever", "created": 1611345853, "upvotes": 1}, "gk8a7fp": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk8a7fp/", "text": "You're crazy.", "author": "skeptical_moderate", "created": 1611345163, "upvotes": -1}, "gk87b4d": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk87b4d/", "text": "I have a love/hate relationship with online schooling. I’m not a social person so in person wasn’t my thing. But I find I like the option to make friends if I want and in person is easier. However, being online has made my life schedule flexible. I only have school 3 days this semester so I can work and make money to pay off school. And I feel like it’s easier to have a mental day which is both good and bad for me. I just close the laptop, out of sight out of mind and then next thing you know my grade is a B-", "author": "astrology_goddess_23", "created": 1611344234, "upvotes": 1}, "gk86r9p": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk86r9p/", "text": "Honestly, online classes are the future. I think classes being fully online for non-STEM majors makes sense and would lower the cost of college.", "author": null, "created": 1611344062, "upvotes": 1}, "gk84gff": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk84gff/", "text": "I don't like online classes, but it has to do with technology having issues. I had a conference over Zoom last semester and my WiFi cut out and I couldn't get back in, which has also happened in normal class. Unlike people in cities those in rural communities have bad internet, which hurts students at rural universities.", "author": "MNRanger007", "created": 1611343347, "upvotes": 1}, "gk81j16": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk81j16/", "text": "As someone whos very hands on, online classes have really fucked me. Being home and taking online classes is just really distracting too.", "author": "taeoh666", "created": 1611342462, "upvotes": 1}, "gk812tr": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk812tr/", "text": "I’m a graphic design major getting an associates from a community college. It’s honestly really awful having to be online and I don’t understand why people like it so much. Being autistic and having this happen has been so distressing. My entire routine basically got uplifted and everything shut down, I struggle to do work at home which wasn’t a problem considering I made art in the studio at school and rarely or never had homework.", "author": "clementinemae", "created": 1611342327, "upvotes": 2}, "gk80afi": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk80afi/", "text": "I totally agree, online classes actually boost my motivation to do school. I don’t have to worry as much about my transportation to and from school—that a was a huge issue for me in the past because I would never feel like leaving the house. I can work a more flexible schedule because I don’t have staggered classes throughout the week. and I can do my assignments at my own pace and just make sure they’re turned in at the due date. I’m pretty extroverted, so I thought I would hate it, but from a getting things done perspective I like it a lot more, because I’m not as worried about what other people in class are doing or getting distracted by wanting to make friends. It puts a healthy amount of pressure on my tendency to procrastinate, imo.", "author": "s_ingramsm", "created": 1611342088, "upvotes": 5}, "gk80297": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk80297/", "text": "From a physical health standpoint, I can agree. However, those who suffer mental health issues are completely left to their fates. No support, no friends; everything just becomes a task. From a financial perspective you are also being diddled.", "author": "Hang_onSloopy", "created": 1611342024, "upvotes": 0}, "gk7zd1l": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7zd1l/", "text": "Same here. I was almost going to defer my grad school acceptance when I learned it would be online and I'm SO glad I didn't because I actually prefer it this way. That being said, in my last quarter of undergrad one of my lectures was prerecorded and I thought that was complete garbage. Might as well watch a Youtube video.  \n\nI think for a lot of people the hardest part is having face-to-face social interactions missing. It'd be particularly hard if you're single or don't live with people you like.", "author": "Auditor0fReality", "created": 1611341821, "upvotes": 2}, "gk7v6pr": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7v6pr/", "text": "I just don't understand how people can hate it. I love not having to wake up earlier than I would like and then walking across campus or, for commuters, driving all the way to school. I feel great staying home and not having to worry about getting lost. I mean, all my stuff can be found from one website.\n\nI mean, I hate interacting with people and was so against staying at the dorms I had multiple panic attacks in the 2 weeks I was there, so I guess I'm the weird one.", "author": "MemeSage14", "created": 1611340507, "upvotes": 2}, "gk7tyj3": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7tyj3/", "text": "I don't thing that's a weird thing to say at all. I totally agree with you. I really like doing online school and generally staying at home. Firstly I'm a little bit a loner, I like to spend the days reading and watching Netflix. But the most important thing, which I'm grateful for, is that I am a good self learner, I often rather teach myself something (maybe watching videolessons on YouTube) using my own pace, instead of following a track that could be too slow or too fast for myself. Since I started online lessons my grades went up, but that's not just it. I feel like I'm learning a lot more than ever, I'm assimilating things instead of justing memorizing them for the test. And to put the cherry on the cake I'm enjoying learning more than ever before.  \nAlthough I find myself in a very good situation I can understand that most people have often a hard time fitting the online education system. But I consider myself and people like you more mature than those people.", "author": "Davixt18193", "created": 1611340147, "upvotes": 1}, "gk7tl75": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7tl75/", "text": "I agree. My transport time to and from school is 2 hours each so being at home saves me a lot of time. And more time means more studying or procrastination :\\^)", "author": "ubaldejason", "created": 1611340039, "upvotes": 2}, "gk7qovl": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7qovl/", "text": "I'm curious on how many students dislike/like online classes. I personally like a small portion of them being online (English/writing for me) but I understand why others like all of them this way. I see it as people only saying something if they have a strong dislike for it. Human beings love to complain, it's what we do. I'm sure there's a bigger group than we think of people who like online classes.", "author": "llamaintheroom", "created": 1611339219, "upvotes": 2}, "gk7qnji": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7qnji/", "text": "I agree. I had a 4.0 last semester because of online classes", "author": "wolfy321", "created": 1611339209, "upvotes": 3}, "gk7p3jx": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7p3jx/", "text": "I absolutely love online classes too! It forces instructors to make the lessons a bit more interactive or at the very least less talking at you based learning. I honestly wish I had done my entire undergrad online. I'm seriously considering going back to grad school and doing grad school online.", "author": "squirrel8296", "created": 1611338767, "upvotes": 1}, "gk7he0g": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7he0g/", "text": "Yeah online can be hard but I have gotten used to it now", "author": "futuredoctor2123", "created": 1611336561, "upvotes": 1}, "gk7h1tn": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7h1tn/", "text": "My biggest issue with online classes is the fact that every college student is being hosed right now. We are paying full price for half-ass education. We shouldn’t be going into student loan debt for lack of instruction, no campus amenities, and disorganization from the professors. Hosed, I tell ya.", "author": "Peaceful_Petunia", "created": 1611336465, "upvotes": 1}, "gk7frvx": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7frvx/", "text": "It's a toss up for me.  I'm a film student so I want to be able to collaborate and what not on campus.  However I do like the option of having zoom because of how it is where I live off campus and have to drive to get to school.  If I only have one class that day I sure as hell want to just attend it through zoom because I can't do anything else after if I go to campus. \n\nIf campus was open I guess it would be a different story because I'd want to use my parking as an excuse to walk around campus and get lunch and all that.  I used to live on campus at a college that was downtown in a major city and it was a wonderful experience, I would love to go back to classes like that but I probably won't until like maybe graduate school. \n\nAlso congrats on changing to an art major.  Especially from a STEM like nursing.  My partner and I were both biology majors before switching to fine arts and film respectively.  We feel much happier now so do what you feel makes you happy.", "author": "SatanicSlugrifice", "created": 1611336100, "upvotes": 1}, "gk7fnx1": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7fnx1/", "text": "I almost prefer it. Like you mentioned, minimal effort", "author": "shawnglade", "created": 1611336068, "upvotes": 2}, "gk7dl5q": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7dl5q/", "text": "As a 2nd year nursing major I respectfully disagree, I do all online but clinical as well \nI’m not saying I enjoy waking up all the time and figuring out what to wear and all that but it’s much better when u can actually go see other people in the same class with you and actually interact with them.\n\nIn add. Studying, examinations and all that had become so much harder than on campus, I had to double my studying hours and study nclex questions ever since 2nd sem as a freshman the amount of work I had to do since we switched to hybrid is unbelievable but st least I got to keep my honors gpa so ig it was worth it", "author": "aptxsherlock", "created": 1611335477, "upvotes": 1}, "gk7ckv4": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7ckv4/", "text": "Probably because of ADHD but I absolutely cannot stand online classes. I lament every single aspect about them. I just can't make online classes work for me. Focusing on some mundane lecture through a screen is almost impossible even with medication. Not to mention the 7 different websites to keep track of for homework is a nightmare. \n\nI respect the fact that everyone learns differently but for me online classes just don't work.", "author": "xxplantjaysonxx", "created": 1611335183, "upvotes": 10}, "gk7c9h3": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7c9h3/", "text": "I agree, it just makes life so much easier. As a senior I’m doing a lot of group projects and being able to work at home like I would for work is amazing. There’s tons of collaborative applications we use which makes sending documents and designs super easy and honestly way more efficient than being in person. Some classes definitely are better in person, like your math and science classes, but I ultimately love online classes.", "author": "NRevenge", "created": 1611335090, "upvotes": 2}, "gk7964j": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7964j/", "text": "If I could pay attention as much as I do in a normal class and not forget/procrastinate about things I have to do, I'd agree with you.", "author": "Lfaruqui", "created": 1611334208, "upvotes": 4}, "gk795xg": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk795xg/", "text": "I'm with you 100%. One of my favorite things is not having to commute 1 hour each way.", "author": "orangeblackteal", "created": 1611334206, "upvotes": 2}, "gk78soe": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk78soe/", "text": "I like it.... but not a lot. \n\nI like it because I can work full time and do school with minor stress. I also like that I can just pick up my computer and be in class. No need to worry about traffic or weather. Plus zoom gives it that “face to face” feel which I like ALOT more than my past experience with online classes. \n\nI dislike it mostly because not everyone is good/understands tech. For example. My teacher didn’t let half the class into the teams call because she didn’t realize she had to accept the request. \nAnother example:  the older people in my class who keep interrupting to zoom call 200000 times to ask a tech question. (Which is valid, just annoying) \n\nplus staring at screens for so long hurts my eyes. \nI’m also more worried about missing an assignment because I couldn’t find it and forgot. Bright space makes me want to put my head through a wall because each teacher changes it.\n \nAnd I was hoping to have some sort of normal college experience. Our orientation was just stupid classes over zoom (mindful bread making, making glitter bags)", "author": "Jayfields01", "created": 1611334090, "upvotes": 2}, "gk777lv": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk777lv/", "text": "I feel the same way. I enjoy online learning more than in person to be honest.", "author": "willowpopstar", "created": 1611333577, "upvotes": 1}, "gk760ng": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk760ng/", "text": "Me as well, personally i feel like I'm the type of person who would've liked being homeschooled because my school experience from 3-12 grade was crappy as hell, and I have a severe distaste for group-learning environments, obligatory attendance and having to explain why you just wanted a day off (now i can have that while still doing classes), and not stressing about several things that come with daily outside interaction. 😭", "author": "riiyoreo", "created": 1611333229, "upvotes": 1}, "gk74i69": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk74i69/", "text": "I used to dread online classes cos before the pandemic, I was already bad with managing time and getting distracted on homework. But now I'm.. kind of used to it and prefer it over in-person classes now. Took a lot of time though but I prefer staying in and learning at my own pace for sure.", "author": "beaux-restes", "created": 1611332782, "upvotes": 3}, "gk73gz3": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk73gz3/", "text": "I would personally prefer in person, but I’m enjoying my online classes this semester a lot more than I am from last semester. Last semester, my online classes didn’t have any recorded lectures, didn’t do any meetings, hell I didn’t even know what one of my teachers looked like, so I felt like I wasn’t even getting an education. I’m glad this semester my classes are doing online meetings", "author": "Dragonscar27", "created": 1611332483, "upvotes": 2}, "gk7314m": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk7314m/", "text": "My biggest gripe is that for me online usually means asynchronous. Of course I like in person better for most of the reasons mentioned here, but if it's a zoom meeting instead of actual meeting I can deal. What I can't deal with is having multiple classes with zero interaction and engagement. Sitting around just watching lectures (if they even have them) and reading links is so tedious and I learn nothing.", "author": "dontlikemangoes", "created": 1611332356, "upvotes": 7}, "gk71lr1": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk71lr1/", "text": "You’re not weird. There are plenty of us out there. I love online classes because I enjoy having a life. I enjoy not having to go to class and waste hours and hours of my day doing nothing. Online class is great, if you can afford to put minimal effort into actually learning your classes.", "author": "ethancknight", "created": 1611331946, "upvotes": 3}, "gk70sd1": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk70sd1/", "text": "I’ve honestly been feeling the same way so far! I even held off on a semester because I was so worried about having classes online. But yeah, the luxury is just rolling out of bed and plopping down in my study is great!", "author": "Littlek1dluvr", "created": 1611331706, "upvotes": 1}, "gk70c4q": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk70c4q/", "text": "Same here, it's way easier for me to stay organized when everything's online.", "author": "zabba7", "created": 1611331571, "upvotes": 2}, "gk708oa": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk708oa/", "text": "I love online classes. It’s easier too.", "author": "FaeryMaiden982", "created": 1611331542, "upvotes": 2}, "gk701e9": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk701e9/", "text": "The best thing about online classes is that I don't have to borrow loans to live near my campus, which is 2 hours away from my house, plus, I'm actually getting financial aid back for once. I'm an art major, so practically all of my classes depended on being in the studio classes, but now all of them are virtual, so there are some cons where you don't see live demonstrations because seeing art on a computer screen has a different effect than seeing it in person. I'm moving towards animation, so that's less of a problem, but there are still some studio classes I'm taken as well. Honestly, I have social anxiety, and it's a blessing, where I'm less stressed out having to live with random people in dorms. I used to panic a lot, and stayed trapped in my room, to the point where I was afraid to come out if my suitemates invited their friends over, or I cried a lot, so I'm thankful there isn't stress coming from that aspect. Although, at the same time, it's a con, because I have less exposure to other people, meaning I have less practice with my social skills so there's that. But, overall I really like online classes, mostly due to financial reasons.", "author": "fluffyball63", "created": 1611331482, "upvotes": 2}, "gk6zm03": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6zm03/", "text": "I have a love hate relationship. I love not having to wake up until five minutes before class, I love not having to walk 20 minutes to class in the freezing cold. I love being in the comfort of my apartment. And some classes have been super organized and even have little work which makes it nice and simple. I love not worrying about getting sick.\n\nBut, there are some classes that are so disorganized and have so much work I just lose track of what I have to do still. Those classes I absolutely despise and wish it was in person. They stress me out to no end.\n\nIf every class was organized, I wouldn’t hate it at all\n\nAlso, if it weren’t for classes being online last semester I would have failed my one and only math class I need for my major. But thanks to being online I passed with a B+!", "author": "pennypupper", "created": 1611331352, "upvotes": 5}, "gk6xta5": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6xta5/", "text": "I'm a film and video major, and that's a lot of hands-on work. I won't know how to operate a camera or lighting if things continue. I'm learning, yes, but I'm not doing, and that's the whole reason I went to college.", "author": "TheGrindson", "created": 1611330825, "upvotes": 3}, "gk6vjya": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6vjya/", "text": "I’m a film student and not going to lie it’s been a pain. Would rather be on campus with other student working on projects", "author": "Anexcelworksheet", "created": 1611330114, "upvotes": 22}, "gk6tktj": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6tktj/", "text": "I only really dislike labs and clubs being online. Lectures I 100% agree with.", "author": null, "created": 1611329520, "upvotes": 1}, "gk6rphy": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6rphy/", "text": "While there are some drawbacks for my course, I don't mind being online.", "author": "Bodidiva", "created": 1611328943, "upvotes": 4}, "gk6q864": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6q864/", "text": "Yeah I'm in engineering and kinda like it, I did a lot of travel everyday for school so that makes things easier now. But it's kinda nice tbh, different and maybe not better perse but I've grown to like it but won't admit it to my friends lol", "author": "jsimercer", "created": 1611328493, "upvotes": 9}, "gk6p0fb": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6p0fb/", "text": "I’m in the same boat. While I can definitely see how online learning can be difficult for those who have never done it, I personally don’t mind it. It requires a lot of discipline and dedication, but it’s really not that bad to me. Lucky for me, I had been taking about half of my credits online before covid hit, so the adjustment wasn’t bad at all. It’s my last semester, so it does kind of suck that I won’t get the experience of an in-person class (I love sitting and listening to a nice lecture). Nonetheless, the love for my major and prior experience has lessened the burden of online learning, but I do feel for those who struggle with it.", "author": "pdowney2", "created": 1611328126, "upvotes": 1}, "gk6my2d": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6my2d/", "text": "[deleted]", "author": null, "created": 1611327481, "upvotes": 7}, "gk6dutd": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk6dutd/", "text": "The only downside to online classes for me is that if I have a morning class I won’t get out of bed and I WILL fall asleep. I also miss getting dressed because it makes me feel productive so all of this is just a big love-hate relationship 😂", "author": "malakashaught", "created": 1611324571, "upvotes": 16}, "gk690ig": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk690ig/", "text": "[deleted]", "author": null, "created": 1611322258, "upvotes": 93}, "gk65yon": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk65yon/", "text": "I resent online education I had enough of it for a lifetime and I want in-person to be a thing again. But that's not necessarily because of online classes, more like the consequences of them (and the whole situation).\n\nIn theory, yes, studying from your own space is more comfortable, but my uni does full online with live classes. And with my workload that means I've been sitting here in this 3m\\^3 of space for two semesters now and I'm sick of it. My days were get up early, stare at the screen for classes until afternoon then start working on assignments on the same screens until past midnight then sleep. Rinse repeat because time has no meaning and all structure is gone from your life other than the grind.\n\nAnd this is the same space where I - theoretically - go to relax and unwind. That means all my personal projects and crafting and tinkering is here. Things that by week 4 I'm infinitely more interested in than my streamed lectures which just further erodes my focus. There is a reason most of my uni work is separate on my laptop and my home pc is mostly dedicated to gaming/free time stuff. \n\nIn-person classes meant that I had to move around all day and I had a clearly defined me space where I could relax. Especially since I did most of my studying camping in my friends' dorm rooms. \n\nI'm not an extremely outgoing person. But I need the social interaction. I live in the capital, my university is in the capital an hour of public transport away. Most of my uni friends do not live in the capital. So from home online classes also means that I effectively didn't meet any of them for months now.", "author": "TheKBMV", "created": 1611320268, "upvotes": 200}, "gk650ar": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk650ar/", "text": "I’m online right now so I have more time to work as well as be in school, it’s not just due to Covid. I must say... not a fan. I find it harder to keep track of assignments and due dates.  Not being able to meet with peers in person is a bummer.  For certain material I feel it’s easier to understand in person bc you have peers to talk to or go over notes right then and there.", "author": null, "created": 1611319581, "upvotes": 33}, "gk620x9": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk620x9/", "text": "The perks of online classes are the exams.", "author": "Eddie_078", "created": 1611317247, "upvotes": 66}, "gk5ti0q": {"link": "/r/college/comments/l2jm3k/i_actually_like_online_classes/gk5ti0q/", "text": "[deleted]", "author": null, "created": 1611309032, "upvotes": 34}}}