{"sid": "puquuu", "link": "/r/college/comments/puquuu/will_my_professor_fail_my_exam/", "title:": "Will my professor fail my exam?", "text": "Yesterday I had a exam for one of my classes that was set to open up at 7pm and due exactly in a hour (so I had one hour to attempt the exam) and in the middle of taking it my prof sent out an email saying that because of some issues with the proctoring service he \"extended the time until 10pm\" and allowed access to the exam multiple times (so you can attempt it more than once) and when the change was added to the exam the time remaining on my canvas exam went up by like two hours so I used most of the two hours to take the exam and when I was done I submitted the exam. The problem that I have now is when I submitted the exam it said \"late\" and I bet that could be because of a Canvas error because I did turn it in before the required time but when I was taking the exam, my time remaining went up but on Canvas it still says there is a \"60 minute time limit\" to submit the exam but I devoured more than 60 minutes given for the exam because Canvas said I had more than 60 minutes to finish the exam and I was even concerned about this in the middle of the exam that I talked to a live chat representative of the proctoring service and they said the exam time is extended for everyone.", "author": "rando666666", "created": 1632511897, "retrieved": 1632946042, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"he4sxa7": {"link": "/r/college/comments/puquuu/will_my_professor_fail_my_exam/he4sxa7/", "text": "Don't worry about. Im sure your professor knows what happened and isn't going to fail you.", "author": "Orkney_", "created": 1632514254, "upvotes": 2}, "he4rt7e": {"link": "/r/college/comments/puquuu/will_my_professor_fail_my_exam/he4rt7e/", "text": "you're good, dude. canvas just sucks at reflecting what profs put in and changes that are put in last minute. if you're still worried just ask your prof about it next time you see them", "author": "Mnmix", "created": 1632513792, "upvotes": 9}}}