{
  "sid": "qmrpg9",
  "link": "/r/college/comments/qmrpg9/bachelor_in_5_years/",
  "title:": "Bachelor in 5 years",
  "text": "How bad of an idea is this? I am a first year student currently and first semester I only took 14 credits. My grades are not as good as they could be and it is a lot for me to balance work and school and free time with this. Would it be a bad idea do a bachelors in 5 years instead?",
  "author": "businessbub",
  "created": 1636052102,
  "updated": 1636137367,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hjbgfm5": {
      "link": "/r/college/comments/qmrpg9/bachelor_in_5_years/hjbgfm5/",
      "text": "Not a bad idea! Do what you can, as long as you’re getting it done. Earning a Bachelor’s in 4 years means taking 5 courses a semester, that’s a lot especially if you’re juggling work. You got this! don’t get discouraged, just show up!!! 🎓✨",
      "author": "queendabliss",
      "created": 1636052458,
      "upvotes": 3,
      "replies": {}
    },
    "hjbge64": {
      "link": "/r/college/comments/qmrpg9/bachelor_in_5_years/hjbge64/",
      "text": "If it works for you then there's nothing really bad with it, universities have a 4 - 6 year window that they use to count for their graduation rate. When you graduate you don't have to say the timeframe that you went to college either for your resume, just matters that you got the Bachelors.",
      "author": "Sermos5",
      "created": 1636052443,
      "upvotes": 2,
      "replies": {}
    },
    "hjbgeuf": {
      "link": "/r/college/comments/qmrpg9/bachelor_in_5_years/hjbgeuf/",
      "text": "pretty common actually!!",
      "author": "rynpickles",
      "created": 1636052450,
      "upvotes": 1,
      "replies": {}
    },
    "hjbid6y": {
      "link": "/r/college/comments/qmrpg9/bachelor_in_5_years/hjbid6y/",
      "text": "I did that, and I think I turned out ok. It’s really hard to average 17 credit hours in 4 years to get an EE degree at my college’s original program (they changed it a bit).  Good luck!",
      "author": "vicemagnet",
      "created": 1636053222,
      "upvotes": 1,
      "replies": {}
    },
    "hjc1ocv": {
      "link": "/r/college/comments/qmrpg9/bachelor_in_5_years/hjc1ocv/",
      "text": "Not an issue. I did my bachelors in 5 years. Maintaining balance and good mental health is crucial. Do what works for you. The important thing is to make use of networking opportunities, co-op programs, teaching or research assistantships during your degree. Your grades and degree completion time don’t dominate your future. You should demonstrate personal development and improvement.",
      "author": "irisy211",
      "created": 1636060803,
      "upvotes": 1,
      "replies": {}
    },
    "hjd4sro": {
      "link": "/r/college/comments/qmrpg9/bachelor_in_5_years/hjd4sro/",
      "text": "I'm going to have a nine year bachelor's! Lol your fine.",
      "author": "Victorian_Era2",
      "created": 1636077544,
      "upvotes": 1,
      "replies": {}
    }
  }
}