{
  "sid": "q93jix",
  "link": "/r/college/comments/q93jix/sos_staying_healthy_in_college/",
  "title:": "SOS Staying Healthy in College",
  "text": "Background information: I’m a 20F in my second year of college. I’m majoring in Elementary Education and getting a minor in Special Education. I’m taking 18 credits while spending 10 hours a week in an elementary school. I work part time and I’m also play an important role in two organizations on campus. \n\nI need help staying healthy. In high school, I had no problem staying healthy. I was fit and had a good looking body. Now in college, I’ve gained some weight and I do not feel good inside. I’m very self conscious and gaining weight makes me feel even worse mentally. I walk everywhere and I use the stairs and in every building. I eat as healthy as I can in a college budget. I have access to a gym, but I just have zero time to go. I barely have time to shower every day. Any tips or advice y’all could give me on how I can stay healthy would be much appreciated!",
  "author": "TemporaryBonus1078",
  "created": 1634353272,
  "updated": 1634423827,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgtif2p": {
      "link": "/r/college/comments/q93jix/sos_staying_healthy_in_college/hgtif2p/",
      "text": "I would suggest you need to drop something. 18 credit hours is an extremely high class load, and I've always been under the impression most places require special approval for that. Take a summer session if you're in a hurry to graduate instead.",
      "author": "SouthernRhubarb",
      "created": 1634353865,
      "upvotes": 2,
      "replies": {
        "hgtii2q": {
          "link": "/r/college/comments/q93jix/sos_staying_healthy_in_college/hgtii2q/",
          "text": "18 is the max before you need special permission.",
          "author": "TemporaryBonus1078",
          "created": 1634353915,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgtjci9": {
      "link": "/r/college/comments/q93jix/sos_staying_healthy_in_college/hgtjci9/",
      "text": "Well walking everywhere and taking the steps instead of the elevator or driving is great. Try eating more whole foods if at all possible. And try to make sure you’re getting in a good balance of proteins, fats, and carbohydrates. But it seems like you generally are doing the best you can to stay healthy.\n\nIf weight loss is what you really mean, you’d need to be in a calorie deficit for that.",
      "author": "kizeltine",
      "created": 1634354410,
      "upvotes": 3,
      "replies": {}
    },
    "hgtm3cx": {
      "link": "/r/college/comments/q93jix/sos_staying_healthy_in_college/hgtm3cx/",
      "text": "To “lose weight” isn’t always the same as staying in shape! But small things you can do is to set a timer for when you study for every hour and when you take a break when the timer goes off, do 10 reps of 2 sets of crunches, jumping jacks, push ups. If you’re studying for 6 hours, that’s 120 crunches. Obviously adapt it to the environment if you’re in between classes try to sit and do a wall sit somewhere or do lunges while walking to the bathroom. Small things add up! This gets pretty “prison workout” ish but you can use your backpack as a weight to squat and lift. \n\nFor shaping (like in your lower abs if you’re growing a lil belly) it’s all about the foods you’re eating. You want a balanced diet. Try to cut sugars like soda and desserts and choose grilled over fried, white meat over red meat (white fish is good such as cod) etc. There are a lot of filling meals that are healthy and on the cheaper side. Dr Mike has some healthy snack foods in a video on youtube. If you snack a lot or just often, it can really impact your weight gain and portion sizes can get out of hand too at times. Try to “meal prep” by sorting out portion sizes before hand if possible. There might be a nutritionist at your campus too.",
      "author": "milk1tea",
      "created": 1634356018,
      "upvotes": 2,
      "replies": {}
    },
    "hgvhjvb": {
      "link": "/r/college/comments/q93jix/sos_staying_healthy_in_college/hgvhjvb/",
      "text": "If some sort of exercise routine is a new priority for you, you need to negotiate your current obligations in order for you to have room to do it. And if you’re saying that you can’t do that, then perhaps it was never a priority to begin with.",
      "author": "issaajoy",
      "created": 1634401061,
      "upvotes": 1,
      "replies": {}
    }
  }
}