{
  "sid": "q5lx1w",
  "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/",
  "title:": "What keeps you/kept you in college during rough times?",
  "text": "What kept/keeps you going? I want to hear all the little things or the big things. What gets you out of bed and to class. Hand ‘em over. :)",
  "author": "dazaibaby",
  "created": 1633918095,
  "updated": 1634082972,
  "over_18": false,
  "upvotes": 52,
  "upvote_ratio": 0.99,
  "comments": {
    "hg6irsr": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg6irsr/",
      "text": "The fact that I’m here on someone’s dime and I couldn’t live with myself knowing I’m wasting my time doing something other than classes (unless it’s necessary of course)",
      "author": "harry01772",
      "created": 1633918457,
      "upvotes": 61,
      "replies": {}
    },
    "hg7286t": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg7286t/",
      "text": "Pure spite",
      "author": "airbear13",
      "created": 1633929190,
      "upvotes": 56,
      "replies": {
        "hg74k61": {
          "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg74k61/",
          "text": "God I felt this one",
          "author": "dazaibaby",
          "created": 1633930805,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hg6my4o": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg6my4o/",
      "text": "the fact that I’ve already paid sm money. might as well get the hell on and get my degree even if it kills me 😌👌",
      "author": "801002",
      "created": 1633920572,
      "upvotes": 39,
      "replies": {}
    },
    "hg6xvwn": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg6xvwn/",
      "text": "I work full time at a shitty job and this is the only way out",
      "author": "Urban_II",
      "created": 1633926519,
      "upvotes": 19,
      "replies": {
        "hg8nzlf": {
          "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg8nzlf/",
          "text": "Yes. This and caffeine.",
          "author": "Animasylvania",
          "created": 1633967284,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg7346i": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg7346i/",
      "text": "my parents",
      "author": "AffectionateDoctor93",
      "created": 1633929790,
      "upvotes": 17,
      "replies": {}
    },
    "hg74mda": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg74mda/",
      "text": "The fact that I paid thousands of dollars per semester gets me out of bed 🤣 \n\nMusic, self affirmation on youtube, meditation, gym, and food helps me cope with stress when I don’t feel like talking to my friends. \n\nWhat gets me out of bed aside from the thought that I invested a lot on myself to get a degree is the hopeful thought that I am capable of making it through the rough times because I am the solution. The thought that I am going to improve. The thought that if I continue to fight through whatever I’m dealing with, that my situation is going to get better. Telling myself that these rough times are all part of the process to getting to my goal.",
      "author": "Oniko_2009",
      "created": 1633930848,
      "upvotes": 16,
      "replies": {}
    },
    "hg7a7gg": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg7a7gg/",
      "text": "Aside from money, the routine. Having a full-time job involves a routine too, of course, but there’s something about my college routine that adds a lot of much-needed structure to my life. I also really enjoy what I’m studying, so there’s that.",
      "author": "morose_bug",
      "created": 1633935067,
      "upvotes": 9,
      "replies": {}
    },
    "hg6xzvj": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg6xzvj/",
      "text": "Alcohol",
      "author": "Gaiu3Octavius",
      "created": 1633926576,
      "upvotes": 9,
      "replies": {}
    },
    "hg811zv": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg811zv/",
      "text": "10 years working jobs that don't require a college degree. I think it's understated how horrible those jobs are. I was in woodworking. Go to r/woodworking, read it for about 20 minutes, and throw all that away. It is nothing like that whatsoever.\n\nThe hours were ALWAYS 10 hours a day. Seasonally you would have no work in the winter and all summer would be overtime. None of these places are air conditioned so you tote a fucking fan around to dry the sweat. From the time you get there, you've got saw dust in the crevices of your arms and neck. \n\nNot only that, the labor part of it is insane. Making thousands of cabinets for a hospital means that somebody is lifting each one of those cabinets and all the sheet goods to make them. I'd be lifting parts from the CNC and putting them on a pallet on the ground for 10 hours straight. \n\nThe people I worked with had a 50% chance to be absolute scum. I've worked with prisoners, drug addicts, child molesters and racists. I've watched 3 men go into a single restroom together to do cocaine at work. I've found more than one roach/joint on the bathroom floor. The finisher did either acid or mushrooms at work one day, and he talked to me while I was standing with the vice president of the company. The finisher would smoke pot outside during breaks and everyone knew but nobody did anything. He'd drive the forklift around while all sorts of fucked up. \n\nThe owner of the company was the worst narcissist I've ever encountered. No matter what you would say about something, he'd immediately say no then tell you what he thought. 9 times out of 10 it'd be what you said. Everything was about him. It was insane. He was untrustworthy. He forged the paperwork to keep the illegal immigrants on payroll when their social security numbers didn't match their names. He's using illegal work to undercut the market and put strain on the guys who do it right. \n\nOur turn over rate was 1 person a month. Within a year of when I started, a guy who'd been working there for 8 years walked out one day. He went from 70k to 45k. The business would hire people and micromanage the shit out of everything they did until they got tired and left. It was a load of horse shit. \n\nLastly, I've been in shops that just don't care about your well being. One shop's finish room wasn't properly vented and the finisher would roll freshly finished pieces out of the booth for them to cure. This would ultimately flood the cabinet shop where I worked with VOCs. This is enough to give you a headache in 20 minutes and it lasts all day. They wouldn't do anything about it. So here I am making 16.50 an hour killing myself in the name of cabinets. Add the fine dust of MDF and particle board and you're on the fast track to some sort of lung disease. \n\nStanding on concrete for 10 hours straight is the absolute worst. There are no shoes capable of keeping your feet from absolutely throbbing by hour 8. All of these shops prohibit sitting. You do not sit in wood working EVER. I assure you that whatever you thought was a good idea to sit and do, isn't. \n\nThey need mindless people who love to work hard and fuck themselves up. Believe it or not, there are plenty of people that exist like that. They don't think, they just work hard and smoke cigarettes. They are usually terribly unhealthy people and they don't mind working their body into their grave. They are inundated with back problems, joint problems, fucked up hands from table saws, teeth falling out and so on. Those people are good for those jobs, not me. \n\nThat's it. That's what keeps me in school. I've already suffered back injuries that I'll keep forever. All for 16.50 an hour and being so mentally broken down from micromanagement and narcissism that as a grown man, I often found myself hiding in the bathroom trying to reason with myself. I remember driving to work and not being able to stop myself from screaming at my steering wheel and pounding it with my fists. A few times I was within 5 minutes of work and called in sick. \n\nGet a fucking education.",
      "author": "Awkward_Mail_2786",
      "created": 1633956570,
      "upvotes": 8,
      "replies": {}
    },
    "hg7fwyc": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg7fwyc/",
      "text": "u/dazaibaby i am gonna approach your question from a different angle than the normal “going to college on my parents’ dime” answer. \n\nWhile it may be true that my parents are paying a large sum of money for me to go to college, i am also paying a chunk of money for tuition and housing, so i have a personal investment in myself and want to get a return on that investment. I am in my last semester of junior year of college and i will be a senior next year.\n\ni have struggled with learning disabilities my whole life and have dealt anxiety, panic attacks, and occasional but intense bouts of depression for a good chunk of my life as well.\n\nSince I transferred to the University of Arizona in the Fall of 2019, I have had a learning specialist/ counselor/ case worker who i meet with once a week and she helps me stay on top of my academics and checks in with me to make sure learning disabilities and mental health challenges don’t go unchecked/ unnoticed. I also have a support network of educators who make sure that i get my learning accommodations.\n\nSo, part of what keeps me going is showing my learning specialist/ counselor and my support network that i can take what they have taught me and use those tools/ coping mechanisms to be successful.\n\nMaybe one day, i can pay it forward by working with students who have similar challenges to those that i have and show them the way and provide them with the same learning techniques and tools and mental health resources that i have been provided with.",
      "author": "DConMont505",
      "created": 1633939964,
      "upvotes": 5,
      "replies": {}
    },
    "hg74okj": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg74okj/",
      "text": "Money lost and knowing theres light at the end of the tunnel…",
      "author": "X-iomania077",
      "created": 1633930892,
      "upvotes": 5,
      "replies": {}
    },
    "hg6ykib": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg6ykib/",
      "text": "I don't have to pay for it. Also, I went into college right after high school in fall 2020. If I didn't go I would have to get a job and I don't want to do that.",
      "author": "thesunisexpanding",
      "created": 1633926906,
      "upvotes": 4,
      "replies": {}
    },
    "hg7baio": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg7baio/",
      "text": "I already have enough debt so if I drop out now then I won’t get a job that really would pay decent enough. It’s not nice but it keeps me in school",
      "author": "ThicccPanta",
      "created": 1633935938,
      "upvotes": 4,
      "replies": {}
    },
    "hg7zw3q": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg7zw3q/",
      "text": "not wanting to be broke my entire life",
      "author": "RainbowChocolate_",
      "created": 1633955900,
      "upvotes": 5,
      "replies": {}
    },
    "hg82qi9": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg82qi9/",
      "text": "Out of spite. Fuck everyone, ill win.",
      "author": "guy_with-thumbs",
      "created": 1633957501,
      "upvotes": 4,
      "replies": {
        "hg8duuz": {
          "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg8duuz/",
          "text": "Yeah, that’s the spirit!!!",
          "author": "dazaibaby",
          "created": 1633962930,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg868kc": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg868kc/",
      "text": "3 things:\n\n1) to do the job I want, I need a degree and I cannot accept anything less than my dreams\n\n2) My little brother (3 years younger) is watching me and I need to show him it is possible bc I would be the first to do it\n\n3) I want a more comfortable life for my future family; my parents worked hard to give me better and now I want to work hard to give my future family better as well",
      "author": "Mushy-froug",
      "created": 1633959343,
      "upvotes": 4,
      "replies": {}
    },
    "hg8l59p": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg8l59p/",
      "text": "Paying for college 100% on my own and first gen college student. Also so I can say I have a STEM degree, lol. Plus financial security.",
      "author": "LenoraNoble",
      "created": 1633966101,
      "upvotes": 5,
      "replies": {}
    },
    "hg6tdek": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg6tdek/",
      "text": "this is all necessary for my dream job plus im paying 11k a year plus loans so i cant afford to just say fuck it",
      "author": "EdelwoodOil",
      "created": 1633924027,
      "upvotes": 3,
      "replies": {}
    },
    "hg7o15b": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg7o15b/",
      "text": "Student loans",
      "author": "CarouselAmbra81",
      "created": 1633947329,
      "upvotes": 3,
      "replies": {}
    },
    "hg80gh7": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg80gh7/",
      "text": "If can't even figure this shit out. How am I going to achieve the things that I wanted to do in life.👑",
      "author": "Musashi-13",
      "created": 1633956233,
      "upvotes": 3,
      "replies": {}
    },
    "hg87md9": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg87md9/",
      "text": "I don't think about school in its entirety when I'm overwhelmed.  I have an app that I used to countdown to the last day of the semester.  I look at how many weeks are left in the semester when I feel overwhelmed.  I can't explain why exactly it helps, but it does.  It reminds me that the semester will end in the near future and I only have to hold on for a little longer.",
      "author": "Traditional_Self_658",
      "created": 1633960025,
      "upvotes": 3,
      "replies": {
        "hg8kg5l": {
          "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg8kg5l/",
          "text": "You eat an elephant one bite at a time!",
          "author": "unusualwife",
          "created": 1633965808,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg8cm8j": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg8cm8j/",
      "text": "sunk cost fallacy",
      "author": "hahawut999",
      "created": 1633962379,
      "upvotes": 3,
      "replies": {}
    },
    "hg8kc3n": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg8kc3n/",
      "text": "The hope that I can make a difference in the world with my acquired knowledge.",
      "author": "unusualwife",
      "created": 1633965759,
      "upvotes": 3,
      "replies": {}
    },
    "hg839dq": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg839dq/",
      "text": "The hope of getting salary one day",
      "author": "angi_totik",
      "created": 1633957783,
      "upvotes": 2,
      "replies": {}
    },
    "hg8sgod": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg8sgod/",
      "text": "Spite and the money the state paid me cuz I'm a lower-income-1parent-does-not-pays-child-support student. But it was financial reasons mostly, I knew that if I dropped now I could never afford even 1 semester",
      "author": "Charming_Mood9953",
      "created": 1633969163,
      "upvotes": 2,
      "replies": {}
    },
    "hg9435r": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg9435r/",
      "text": "waking up early and walking to get coffee. \n\nknowing if i dropped out my parents would make fun of me and never let me forget it. i don’t want to give them the upper hand on me.",
      "author": "4eggy",
      "created": 1633973906,
      "upvotes": 2,
      "replies": {}
    },
    "hg94n2v": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg94n2v/",
      "text": "Knowing that I put thousands into college out of my own money. And I'm not gettin that ish back.",
      "author": "OneOfScottsTots4",
      "created": 1633974128,
      "upvotes": 2,
      "replies": {}
    },
    "hg9l0j7": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg9l0j7/",
      "text": "Spite, caffeine, the fact that it's paid for already and not from my money, money I will make in the future, making a difference, interesting subjects.",
      "author": "siren_nymph",
      "created": 1633981063,
      "upvotes": 2,
      "replies": {}
    },
    "hg9sajm": {
      "link": "/r/college/comments/q5lx1w/what_keeps_youkept_you_in_college_during_rough/hg9sajm/",
      "text": "The impending thought that if I dont get a degree that I wont be be capable of matching the level of the rest of my family, that I wont be able to afford a comfortable life, that I am less capable than those with a degree, spite against all the things that stress me out. Just to name a few",
      "author": "Chamal44",
      "created": 1633984268,
      "upvotes": 2,
      "replies": {}
    }
  }
}