{"sid": "p8hwkf", "link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/", "title:": "My dad fully funds me while I’m in school and people seem to have a major problem with it", "text": "Hey guys, I want to know everyone’s opinion on this. Please no rude comments either, I just want your genuine opinion/advice. So, currently I am a 24 year old graduate student studying engineering. I live at home, and my father pays for all of my things- tuition, car, trips, food, bills, and everything else. I worked a little bit in my undergrad but then quit my job to focus on school instead. I’ve never payed a bill, and according to him, I shouldn’t worry about it because school is number one. He claims that he will fund me until I am on my feet working as an engineer. However, after talking to some people, I’m starting to have some doubts. I have had people/friends legit get mad, telling me I am not independent, I will struggle in life, I need to be a real adult and work while doing school like everyone else, ect. My friend told me I should take out loans like her instead of my dad paying for my tuition, because that’s what a real adult does. Personally, I like living at home and not working while doing school but I’m starting to feel really bad and judged over it.\n\nTl;dr some of my peers disapprove that my dad fully funds me while I’m in school, saying that I am too old to be doing this\n\nDo you guys think I am letting people’s comments get to me too much and that I am doing the right thing? Or do you think me and my dad’s mindset is bad? How did all of you deal with finances during school?", "author": "bluenails4444", "created": 1629507585, "retrieved": 1632802160, "over_18": false, "upvotes": 993, "upvote_ratio": 0.95, "comments": {"hc6uoet": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/hc6uoet/", "text": "I know it's an old post, but the truth is your friends are absolutely jealous.", "author": "AkwardlyAlive", "created": 1631200577, "upvotes": 2}, "hbrvnu9": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/hbrvnu9/", "text": "Idk bro, people will have different opinions on maybe why they think it’s bad. I agree, have the most fun with the experience before you become an adult because being an adult sucks ass. At 18, I had to start transitioning into that phase to pay for college, worry when payments were due and etc. My buddy had it worse, having to deal with legal problems when it came to his apartment. So it’s just up to you, don’t rush into adulthood, you’ll never get to be a kid again, but at a time, we all need to start making our way towards our own lives or else we (a majority) won’t function properly. You can’t be thrown into the adult world in an instance, with everything, baby steps helps us transition :)", "author": "TadpoleJunior4075", "created": 1630903859, "upvotes": 2}, "hbnsd9g": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/hbnsd9g/", "text": "If any of them were offered this deal you have, they would take it in a heartbeat. This kind of support is a massive blessing as long as you take school seriously and constantly work to become independent when you graduate or sooner if possible, but on your own terms.", "author": "Jasek1_Art", "created": 1630824067, "upvotes": 2}, "hakjyqx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/hakjyqx/", "text": "Don’t listen to other people, and don’t tell other people your business either. My parents also fully support me while I attend the university so don’t feel guilty about anything. Focus on school.", "author": "BathAffectionate9498", "created": 1630079863, "upvotes": 1}, "haf8nah": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/haf8nah/", "text": "I would just keep it to yourself. That’s really cool because it shows your father cares about you and he wants you to further your education. Especially in America there is a big emphasis on becoming your own person and living on your own and supporting yourself. It’s quite the norm for kids to live with their parents while in school in other countries.", "author": "Somelier1234", "created": 1629985229, "upvotes": 1}, "ha9mpxs": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/ha9mpxs/", "text": "Ima just say your dad didn’t work hard just for you to take student loans. It’s okay to make use of your privilege. But on the other hand, you do have to be more independent. Just making sure you know how bills are paid off, knowing how to file taxes, cook, clean, and other stuff is essential to being independent. Don’t feel bad for your dad finding you as long  as you’re not taking advantage of him or bragging to others.", "author": "AlphaNavy05", "created": 1629877744, "upvotes": 2}, "h9z8y7m": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9z8y7m/", "text": "Most parents pay for their kids undergrad, thats normal. What u describe seems sort of normal to me", "author": "Mapleleaf27", "created": 1629681182, "upvotes": 2}, "h9yl70r": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9yl70r/", "text": "If your dad is financially stable enough to be able to support you in furthering your education (and he obviously wants to), there is no reason why people should care. It’s not their business, people just like to make unnecessary comments about the way other people choose to live their life. Keep doing what works for y’all, and just make sure your dad knows how grateful you are and how much his help is appreciated. If other people’s comments bother you that much, just don’t tell others about how your financials are held. While there’s nothing inherently wrong with your dad paying for you through college, a lot of people who are not able to be in the same position will probably make snide comments out of jealousy. Just either ignore them or don’t bring it up at all if you can avoid the subject.", "author": "gingereIIa", "created": 1629669722, "upvotes": 2}, "h9wtnqx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9wtnqx/", "text": "Fuck whoever has a problem with that. That’s your business. My husband and I talked about it and the kids can live with us if they decide to go to school and we will help them financially however we can.\nI’m 27 years old I have 3 kids and I’m a full time student/mom. It’s REALLY REALLY HARD to do when you’re older and have a house and kids. I’ve had classmates that have quit their jobs cause it’s too much with school and kids. If it were to help my kids go through school to support them financially we absolutely will. Rather than having them wait ten years to go to school.", "author": "Coffeeislife1119", "created": 1629641833, "upvotes": 2}, "h9vnhym": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9vnhym/", "text": "I'm in a semi-similar position, although I have thousands of dollars in savings from chapter 35 due to my father's disabilities. And I have to say, your finances and how you live should be none of anyone's business unless you choose to share it. Who cares what someone has to say about how you live your life? A lot of people get help from others in various different ways, nobody ever seems to talk about the advantages middle class students have over lower class students. I've seen students driving Porsches, Audi RS models, Maseratis and blowing their allowances on luxury goods and I'm like who gives a damn as long as they're a good student and not cheating their way through college?\n\nPeople are bitter and you're just going to have to ignore them. People have this idea that you have to struggle financially to know how good you have it and to mature in life and get through college, but that's kind of bullshit. It's like everyone learns that shit from TV shows and movies and assumes that anyone privileged is an entitled, spoiled brat. And, sad but true, it wasn't too long ago that most of the people going to college were already well-off.\n\n> My friend told me I should take out loans like her instead of my dad paying for my tuition, because that’s what a real adult does.\n\nThis made me laugh. That's what a clueless and desperate student does. Lots of people have to because they have no other choice. I took some out because I'm not gonna burden my parents with that shit. But if you have the means, why should you do that? Put yourself into thousands of dollars of debt for years so you can be bitter, living from paycheck to paycheck because you think it builds character? Give me a break.", "author": "JojiTX", "created": 1629610931, "upvotes": 2}, "h9vluwq": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9vluwq/", "text": "Damn you’re literally blessed 🥲 please don’t tell people your business because some people can be jealous or so negative they’re not in your position. Continue to do well and make your Dad proud !!!", "author": "shesgr8", "created": 1629609821, "upvotes": 2}, "h9uvg9d": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9uvg9d/", "text": "like others have said its best not to speak on finances with others. your friends are just mad that dont have a parent that will do what yours is doing for you. I somewhat went through this in college where because my parents didnt earn enough I got alot of financial aid but I had friends who'd get mad because they felt like they're parents were geting screwed over for succeeding. I learned to just not mention how much I got in financial aid.\n\nI promise you if your friends had a parent that was willing to pay for everything until you stood on your own they wouldnt be taking out loans. Do not ever take out loans you dont need. Just make sure when the day comes when you graduate and have a job, start paying for your own stuff. Right now it makes sense because you are focusing on school but once you have a job, paying for your own stuff helps you mature financially and not take money for granted.", "author": "ea0995", "created": 1629595618, "upvotes": 2}, "h9uuwwl": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9uuwwl/", "text": "I usually chalk stuff like this up to \"theyre just envious\" because that's the thing that makes the most sense, since why else would they care? They don't know your dad so obviously they have no vested interest in how he's paying for it, and you have a good reason to not work (school is a very good one its why while you're in highschool many states make it illegal to have you work past certain times and past certain amounts of time per week while school is going on) so the only logical reason left is that on some level they're envious that you have someone who can and is willing to support you through school, so don't let them get to you and just keep it on the down low and keep up the good work!", "author": "thedialupgamer", "created": 1629595356, "upvotes": 1}, "h9utcqg": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9utcqg/", "text": "\"take out loans because that's what an adult does\" says a totally financially literate adult...", "author": "donjogn", "created": 1629594576, "upvotes": 2}, "h9usmsy": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9usmsy/", "text": "They resent you for getting the equivalent of a $150 000 graduation gift.", "author": "AmDuck_quack", "created": 1629594219, "upvotes": 2}, "h9upprz": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9upprz/", "text": "They are just jealous lmao. Save every penny you can if your dad is legit cool with it.", "author": "Fuba301", "created": 1629592774, "upvotes": 2}, "h9um9cq": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9um9cq/", "text": "As a parent (of a toddler), we have started a college fund for him and plan on helping him as much as we can. There is no shame in having the opportunity to have family support. My folks love me but couldn’t financially help out with college and really didn’t understand how (my husband and I are both first generation). You being able to focus on your studies and not have to have the added stress of money is great. No shame, embrace it, be grateful and when possible pay it forward.", "author": "She_Walrus", "created": 1629591052, "upvotes": 2}, "h9uifhi": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9uifhi/", "text": "The reaction is out of jealousy. You are very lucky to have someone able to do this for you, it's pretty out of the norm. If he is not being financially burdened, I think you're fine, and taking out loans when you do not have to is frankly a stupid decision. However, I think you do owe your dad a big one after this. You are getting a leg up in life because of him.", "author": "armybratbaby", "created": 1629589161, "upvotes": 1}, "h9ui9xu": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ui9xu/", "text": "I mean it can be annoying because that’s simply not an option for most people. I have friends in your same situation and I try not to judge but it can be tough. Like if school was my only responsibility I could easily have a 4.0. But that’s not reality for most of us, we have to work and support ourselves and it gets really difficult. \n\nBut that being said, if someone is offering to pay for you, you’d be crazy to turn them down.", "author": "MBKM13", "created": 1629589083, "upvotes": 2}, "h9uezd5": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9uezd5/", "text": "Who cares what people think? You’re blessed your father is helping you out. My parents helped me out with costs by covering what scholarships didn’t cover. \n\nYou’ll be graduating debt free, something many people wish they could do.", "author": "Chowder1054", "created": 1629587460, "upvotes": 2}, "h9udcn2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9udcn2/", "text": "I think the people that are judging you over this are the same people that wanna do the same thing but their parents are too broke to afford it or don’t want to afford it in the first place. Working while your dad has the money to do it is just counterproductive. Keep doing what you think is right, king.", "author": "idavxx", "created": 1629586642, "upvotes": 2}, "h9uaf6q": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9uaf6q/", "text": "The economy is shit for trying to make it on your own as a young adult in this generation.  You're lucky to have access to this and those who don't probably get mad because they envy you.  I'm in roughly half the boat as you, my parents pay for some stuff but rent, groceries, etc I pay for myself with a job as I am on my senior year.  Without that financial help I'd be fucked and probably live at home or something instead.", "author": "Jeffotato", "created": 1629585205, "upvotes": 1}, "h9u9x46": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u9x46/", "text": "Personally I wouldn’t mention it much. Also don’t feel bad, most of the time people like this are just jealous and try to disguise it as being caring. It allows them to give you the silent middle finger and think they are better than you. In reality it doesn’t matter if you are working already, it could be good if you do, but focusing on school is 100% valid, after all that is your career you are building. People that knock the school hustle are ridiculous in my opinion.", "author": "mathathon1234", "created": 1629584960, "upvotes": 1}, "h9u9sgj": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u9sgj/", "text": "I agree with all previous comments saying you shouldn’t go around telling people this as they’ll probably definitely envy you. \n\nBut that being said you shouldn’t feel guilty about this either. You’re not forcing your dad to do this, you’re not holding a weapon to him or anything like that. So don’t let other people’s anger or jealousy make you feel guilty. This is an awesome blessing not many people have so I’d make sure to let your dad know you’re appreciative of his support. \n\nIt’s important your dad know you love and appreciate him, but peoples opinions on your situation are not.", "author": "darth__baeder", "created": 1629584896, "upvotes": 2}, "h9u8wbq": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u8wbq/", "text": "I'm not going to lie. You're really just blessed. People can judge all they want, but if I was in that same situation, I wouldn't mind the hate. Think about it, you'll graduate college debt free and you'll be able to start \"real life\" with a clean slate. People are just mad that you have that financial brace I am your father. I'm glad that you're fully capable of focusing on school while not worrying about money. That's exactly how my mom taught me to approach school and I fully appreciate it.\n\nAnyways, don't feel bad.\nPeople can be REALLY judgemental so keep that under wraps if it's becoming too big a problem.\nAnd I hope you find future success!", "author": "Relative-Hamster-166", "created": 1629584469, "upvotes": 2}, "h9u8edy": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u8edy/", "text": "I am literally quite jealous, your lucky and this is just human behavior. They are jealous. They can’t afford the luxury you have", "author": "Bigjony11", "created": 1629584232, "upvotes": 2}, "h9u88rx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u88rx/", "text": "Did you get an internship, start first job yet? \nYes, that is weird if ur 24 yo and your dad still pays all bills. However, not working part time during college is normal, i have to work my ass out so i just wish my parents have enough money to fund me so i dont stress out about it, having money always make thing go easier. \nAnd yet, it is resonable when people judged you about your IDENPENDECE. 24 is not young any more, and the overprotection-funding of your dad might make you unexperiece and you will have more troubles solving thing later in life.", "author": "HaMay25", "created": 1629584158, "upvotes": 1}, "h9u7uc3": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u7uc3/", "text": "As someone who will be working themselves through college eventually, I got no problem with you haha. You’re no less independent than anyone else. If you’re flexing it to people (which i doubt you are) than yeah I could see why, but otherwise they’re just assholes.", "author": "dustedbunn93", "created": 1629583965, "upvotes": 2}, "h9u6te4": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u6te4/", "text": "try prefacing with “I’m so thankful/fortunate/blessed that I can live at home while in school…..” etc.  \n  \npeople will ask questions, you can’t get out of it. I was in a similar spot. Ive found I don’t get shit from people if I acknowledge my privilege", "author": "cheetcorn", "created": 1629583473, "upvotes": 2}, "h9u6ioa": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u6ioa/", "text": "You only have yourself to blame for this bud. You obviously were telling your peers about your dad paying for your stuff. I say, keep your mouth shut cause your parents seem to be well off and only want the best for you. Just continue working on your education and if any new people ask about how you're paying for school, just lie to them cause nowadays people will judge you if you're well off. So in the future, just don't say much about your financial situation. 👍 Being independent doesn't mean take out loans and be in enormous amounts of debt, being independent means having your own job and paying your own bills, not having to rely on someone.. BUT.. this is after college btw, not during cause that'd be stupid. I had financial aid cover my 2 yrs at my CC so I graduated with $0 debt and I enjoyed the experience. So because financial aid paid for my classes/tuition, does that mean I'm not independent?? NO, no it doesn't lol 😅 you're fine, just keep on living & learning!", "author": "SuperiorT", "created": 1629583332, "upvotes": 2}, "h9u6dsy": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u6dsy/", "text": "You're very lucky to be supported by your dad but you shouldn't feel bad about it", "author": "bugs-are-cute", "created": 1629583268, "upvotes": 2}, "h9u5rhr": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9u5rhr/", "text": "Its actually pretty common for parents to agree to fund their child's college funds where I live (Im from asia). My parents are helping me fund my entire bachleors. Theres nothing wrong with it, you're lucky your dad is willing to put that investment into you. You shouldn't feel guilty about it at all, just make sure its worth it. People are probably just jealous.", "author": null, "created": 1629582974, "upvotes": 1}, "h9tx6a3": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tx6a3/", "text": "I am fully funded by my parents as an undergrad, it's completely fine tbh", "author": "i--dont--like--this", "created": 1629578979, "upvotes": 1}, "h9tu6ez": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tu6ez/", "text": "Everyone wants to hustle, grind, and save up money to give their kids a good or even better life than they had. Everyone also hates seeing the previous generation’s hustle, grind, and generational wealth in action.\n\nWe can literally talk endlessly about the causes of certain societal disparities and other bullshit. What matters in your case is the reality of the situation.\n\nDon’t use the opportunities you have just because others don’t have them. Are you a good person for donating time or money to a homeless shelter? Of course. But that doesn’t mean you forfeit your own house because someone else doesn’t have one.\n\nThe people you’ve talked to in the past are envious, plain and simple. Like everyone else is saying, enjoy the free ride while it lasts; **just be prepared for it to stop sooner or later.** For your own sake that means preparing yourself for the inevitability of personal, social, and financial independence once you’re on your feet as your father promised.\n\nOne last caveat as my own personal opinion: please do this for your own kids too. A friend of mine is extremely resentful toward his own father who is extremely well off because *his* college was paid for, meanwhile he insists his son pay for it on his lonesome out of a lame “character building” excuse. And I’m telling you, my friend doesn’t see a dime sans when his parents house him when he goes back home for breaks and such.", "author": "DoorHingeDeliveries", "created": 1629577599, "upvotes": 1}, "h9tu0i5": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tu0i5/", "text": "Have a Chinese friend whose parents are crazy rich yet he’s super cheap. Will get back to this.\n\nWhen we talked about how we were financed in college he said his parents always told him there’s no “your money” or “my money”, “its all family money”. That’s pretty crazy, but he claimed there were downsides to it like family being ruined by a do nothing who blows their savings. Also said his childhood kinda sucked and his parents constantly expect him to have a Chinese girlfriend or otherwise disappoint them. \n\nHe kinda agreed with the need to be independent argument. His parents paid for his stuff but he was very frugal and thought of it as an interest free loan. He says he’s somehow going to pay them back with interest down the road (he should at least do pretty well so I can believe it, but doubt it will happen until he’s like 40 at which point why would his parents even care their life is rounding out)\n\nBut generally speaking, don’t gaf about what others think. Pay for your own shit, let your parents pay for your shit, whatever. You should be the person who plans on making it big and believe that handouts or not nothing could possibly stop you.", "author": "RussetRooster", "created": 1629577522, "upvotes": 1}, "h9tu03f": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tu03f/", "text": "Jealousy is what it sounds like to me, but maybe for some it’s just American culture? In my culture, you’re still considered a teen at 18. In American culture or some parts of the US(?) it seems once you’re 18, it’s expected for you to move out and support yourself.\nIn mine, you’re still a teen at 18 who is figuring out life so you have to get your crap together - but while you’re doing that, you’ll get food and a roof over your head. The logic is that, if you don’t have to worry about these, then your full focus can be on completing school. Of course a lot of my people make below American minimum wage so they qualify for financial aid. The kids get their classes fully paid while getting free room and board at home and food. For those with money and don’t qualify, their parents pay for their tuition until the young adult  is able to work. \nYou just work hard and do your best for you and your dad. When you feel like quitting or not giving your best, just think of your dad’s sacrifice for you and keep tugging along. As some have already said here, keep that info to yourself since some folks can be jerks about it and for those who pry then judge you after, ignore their opinions. Makes no sense for you to rack up student loans and debt before you’re even out the door.", "author": "wawabubbzies", "created": 1629577517, "upvotes": 1}, "h9tqcmi": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tqcmi/", "text": "They're jealous, milk it. You won the lottery of dads.", "author": "Greyskies405", "created": 1629575829, "upvotes": 2}, "h9tplng": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tplng/", "text": "I agree with all the other comments of not discussing your finances. I'm in the same boat as you and I'm naturally a quiet and private person, so I was able to see how people talk about those who are fully or mostly supported. A lot of stuff like you said comes out and I'm only in undergrad. There are some who are like \"must be nice\" or will lower any issues you're having. Definitely do not discuss and if it's mentioned, tread lightly and don't say anymore than needed.", "author": "Foreverdiva", "created": 1629575477, "upvotes": 2}, "h9to2bn": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9to2bn/", "text": "Sounds like you have a supportive family.  Enjoy it and work hard.  Fuck what everyone else thinks.  But maybe keep your cards close to your chest when it comes to that sort of thing too.  People suck sometimes.", "author": null, "created": 1629574770, "upvotes": 1}, "h9tnxg4": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tnxg4/", "text": "I think you’re really lucky your dad is willing to do that. You’re gonna have a lot more chances at succeeding because of him. Just be grateful, keep your head down, and study your a** off until you can stand on your own two feet. Once you’re successful you’ll be able to support him financially so don’t worry about it.", "author": "ekaplun", "created": 1629574707, "upvotes": 1}, "h9tn88g": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tn88g/", "text": "They’re only reacting like this is because they wish they had the privilege to just focus on school. Working through college is exhausting and your grades suffer. Your dad is trying to help you excel in life, please be so grateful that he wants to see you succeed but you don’t have to tell people (it’s none of their business anyway).", "author": "mikalobultra", "created": 1629574384, "upvotes": 2}, "h9tmyj4": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tmyj4/", "text": "People are just jealous, the less they know about your life the better", "author": "spunkmonk1776", "created": 1629574256, "upvotes": 1}, "h9tlu8g": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tlu8g/", "text": "I was the same way, my parents were fortunate enough to be able to financially support me through college and until I could save up for a house. I didn’t talk about it very much, but people for sure gave me shit for it. Personally I don’t see the issue, and plan on doing the same for my children", "author": "Professional-Tiger46", "created": 1629573734, "upvotes": 2}, "h9tl490": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tl490/", "text": "For context, I’m a white American. Both my parents went to college and I’m currently in undergrad. \n\nMy situation is very different. My parents don’t pay a dime. They offered to let me live at home, but I’m still responsible for financially contributing in addition to my tuition, books, transportation, clothes, etc. \n\nI find it hard to make friends with people who don’t work. My weekends are always booked with work, I’m working after and before classes. I just feel that I’ve had to mature in ways that people who are totally supported didnt. I’m so sick of hearing “I’m an adult, I do what I want,” from students who quite literally have never had any responsibility in their life. \n\nMaybe I’m jealous, but I find that the rift in the difference of your experience vs mine would make it hard for me to want to spend a lot of time with you. Additionally, I think it’s hard to get a job with literally no work experience. Maybe retail won’t make you a good engineer, but the soft skills of being an employee and a part of the team is worth sometime. Part of the reason people are so awful to service employees because they never had to be one. (My friends who work in service jobs aren’t rude to waiters and cashiers). \n\nI think it’s worth something to work, even part time for personal spending money. I’m of the opinion that students should pay something for college. If college is an adult decision, act like an adult and pay a few bucks here and there. I also appreciate things I paid for more. \n\nBut I’m with everyone else. Financial situations shouldn’t really be discussed openly with people you  don’t know real well.", "author": "quantum_complexities", "created": 1629573394, "upvotes": 1}, "h9tkusz": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tkusz/", "text": "That sounds tough, have you tried crying to your daddy?", "author": "VerbalAk47Spray", "created": 1629573271, "upvotes": 1}, "h9tid7r": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tid7r/", "text": "If your Dad can support you financially without loans,  what’s the point of taking out one! Doesn’t make any sense. There are many other ways that can help you learn to be more responsible/mature. Not saying you aren’t already.\n\nYou’ve probably heard this a million times, but from my personal POV, financial matters should be kept private unless you already know the person well enough to kind of figure out how they will react. \n\nYou’re doing fine and just let the haters hate. You’re Dad is awesome for being willing to support you, and you’re beyond blessed he’s in a position to be able to do so.", "author": "paulluosg", "created": 1629572112, "upvotes": 1}, "h9ti2eq": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ti2eq/", "text": "It might be strange in your white community but this is the norm in eastern cultures. Your dad is doing thing a right. By living off your parents in your 20s you can focus on education and gain new skills.", "author": "sherry2000", "created": 1629571972, "upvotes": 1}, "h9thnri": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9thnri/", "text": "My parents bought me a freaking house so I didn’t have to pay room and board, and I haven’t paid for a single thing. I’m 22 and about to graduate. Do I feel bad? Yes I fucking do. I think it’s only normal to feel at least a little bad. Relatives remind me all the time how grateful I should be, as if I’m not already grateful. But my parents wanted it for me cause they could afford to do it. I don’t talk about it with other people cause it’s none of their business. They can be mad/jealous all they want. But like you, I’ve never paid a bill. They want me to focus on school so I can do well and get a good job after. \n\nOh and drop your ‘friends’ and go find some others. My friends knew my situation and didn’t give two shits. As long as you aren’t throwing it in their faces, I don’t see why they should involve themselves.", "author": "WickedPuffin", "created": 1629571785, "upvotes": 2}, "h9tf9ug": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tf9ug/", "text": "Don’t worry about what others think and be grateful for what you have! You’re lucky I n enough to be in the position you’re in so take advantage of it :)", "author": "dmorrison666", "created": 1629570689, "upvotes": 1}, "h9tefff": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tefff/", "text": "This kind of support is quite normal in India but I understand why some people might find it strange.\nMy suggestion: If you are serious about your studies and about supporting your dad when he gets old, then you are doing the right thing and need not feel guilty :)", "author": "Satyam7166", "created": 1629570302, "upvotes": 1}, "h9tc6qi": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tc6qi/", "text": "I think a lot of that judgment comes from jealousy because you don’t have to work as hard to be where you at and I do think you should be able to talk about it. Just don’t brag or complain about your situation as there are others have it worse and have to work 3x as much where you are. Just be grateful and humble. I hope to help my kids like this someday too. Parents (should) try to help unburden their children as much as possible imo.", "author": "dungendermaster", "created": 1629569283, "upvotes": 1}, "h9tc42o": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tc42o/", "text": "OP I’m 24 years old still in undergrad (finally got back in school after my way too long of break) and I hope me going to school will help me be successful in the future so I can do what you’re dad is doing with my own kids in the future. My parents help me here and there with bills but I try to pay them back eventually, sometimes they don’t accept my money though. At the end of the day everyone in school wishes their parents would pay for everything so they can focus on school. Idc what anyone says, working pt/ft and going to school ft is *tough*", "author": "soykenito", "created": 1629569250, "upvotes": 1}, "h9tbuzs": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tbuzs/", "text": "At 24, even if in school, you should have a part time job to learn about the real world.  You should also have some expenses so that you learn more about budgeting, etc.  There is nothing wrong with living at home until you finish, but I do hope you have internships and projects at school because an Engineering degree alone will not get you the future work you might think it will.", "author": "GreyMatter399", "created": 1629569138, "upvotes": 1}, "h9tayrc": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9tayrc/", "text": "* First of all never discuss personal finances with friends and family. Be it tuition or salary. People might say otherwise but I have learnt this the hard way early on.\n* I think as humans one of the reasons we want to be successful in life is so that we can take care of our family. Seems your Dad has made sure of that which is great on his part and there is nothing wrong in funding your child's studies for as long as you can\n* Not everyone has the same privileges and you should absolutely use your families privileges to further yourself. It would be bad if you couldn't do the same for your kid or not become more successful than your Dad because you had greater privileges to get a head start\n* We all stand on the shoulder of giants maybe some more than others which is not a bad thing at all but then you should just expect more out of yourself", "author": "honeybadger_1996", "created": 1629568740, "upvotes": 1}, "h9ta6m7": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ta6m7/", "text": "Your Dad sounds absolutely amazing. I wouldn't worry in the slightest about others and their opinions. I would love to do this for my son one day. My husband is doing this for me very soon and I'll be able to quit my job to concentrate on my schooling as well. Go you!", "author": "sechsgotdemar", "created": 1629568392, "upvotes": 2}, "h9ta0yh": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ta0yh/", "text": "People are jelaous.\n\nIf you have the opportunity, use it.", "author": "faultierin", "created": 1629568322, "upvotes": 2}, "h9t7enm": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t7enm/", "text": "I mean first off you don't tell anyone your finances and that stuff that's a first. Second i mean you should be dependent on yourself by now at 24. I'm not being mean or so i'm just saying. Because personally myself i couldn't imagine putting that stress on my parents of paying my college bills etc. Which is why when i was 18 i started working a job, took out loans for college. Even when i was in college i was still working. After i graduated i started paying them off and soon enough i payed it off fully. \n\nI could've asked from my parents. My parents are quite wealthy and they wouldn't have an issue paying. But for me personally it's just a bad look to make my parents pay for all my rent, food, expenses etc. It's just a strong no. Cause i wouldn't feel good knowing i'm spending my parents money. \n\nWhatever i have since i was 18 it was all from my own money.", "author": "Tempintern23", "created": 1629567150, "upvotes": 1}, "h9t5ix2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t5ix2/", "text": "Bs just enjoy it and f em", "author": "YourIceCreamBoy", "created": 1629566296, "upvotes": 2}, "h9t50ol": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t50ol/", "text": "DONT TAKE OUT LOANS LET YOUR DAD PAY FOR YOUR COLLEGE! YOU WILL (EMPHASIZE THAT WILL) REGRET TAKING OUT LOANS!", "author": "bald_butte", "created": 1629566071, "upvotes": 2}, "h9t47di": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t47di/", "text": "I don't see anything wrong with is as I am here living in asia and it's pretty normal here. It would be sheer toxic trait to downgrade you just because you are not taking loan like everyone else. You won't have to worry about bulky loans as you graduate and your finances won't be deciding your job. You won't have to do the job you hate just to pay off your debt. Isn't it a beautiful thing? If anyone is financially independent during their college days, Great! but This 'real adult' shit shouldn't be imposed on anyone. \n\n  \nPS. I recommend you getting your hands dirty with internships in your field.", "author": "ppllmmm", "created": 1629565704, "upvotes": 2}, "h9t3w4z": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t3w4z/", "text": "Here's my take on the situation. Learning to balance multiple important things in life is something that takes practice and is a very valuable skill. So I would consider working while studying so you learn to balance multiple things at once. It is also very important to learn the value of money. My brothers ex girlfriend is in almost the exact same situation and once she moved out on her own and was forced to start paying for things her life started to crumble around her because she had 1) no coping skills because she was handed everything her whole life and 2) no understanding of how expensive life is. She is now under extreme mental duress because of these things. \n\nMost people would kill to be in the situation you are in so talking about it comes off somewhat condescending and a little bit inappropriate in context to most college students situation. Knowing that you don't pay for anything can bring up feelings of jealousy because why should one person have to deal with loans well into their adult life when you don't ever have to deal with that. It is very much a privilege not to deal with student loans and acting like it's a casual thing is kind of insensitive.\n\nLastly if I was in your shoes I would feel massive pressure from myself to put my degree to use especially if that degree came from someone else's pocket. I would consider getting a job and paying for as much as you can because if for some reason you don't end up in a field where you use your degree you will likely feel massivly guilty because someone spent a very large amount of money on something you arnt even using.", "author": "MariMunchkin", "created": 1629565562, "upvotes": 2}, "h9t3rh2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t3rh2/", "text": "It’s obviously projection. They’re jealous of how your father can fund everything for you while you focus on school. Just like everyone else said just keep it on the low, people really like to wish on your down fall when you tell them anything that makes them envious.", "author": "Dm0ney1115", "created": 1629565504, "upvotes": 2}, "h9t1irc": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t1irc/", "text": "I think the people who are angry at you are jealous. I'm 22 and fortunate enough to have parents who support me in school.  I'm in my last year of undergrad and plan on going to grad school, but my parents tell me that school should be my number 1 priority. They supported my sister through her educational career and they'll also do it for my younger brother when that time comes. I think it's great when parents can provide for their kids even after the legal obligation of being 18 comes around. I know that if I can do that for my future kids, I will.\n\nAs far as how people react, I've dealt with the stigma too but as we all know the world isn't fair and others have more advantages. they can't judge you for what your father is choosing to do for you. and if they do then that's just a sour attitude.", "author": null, "created": 1629564507, "upvotes": 2}, "h9t0vib": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t0vib/", "text": "Do you live in San Diego by any chance?", "author": "Hellenic_91", "created": 1629564220, "upvotes": 1}, "h9t0p4j": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t0p4j/", "text": "People tear their hair out, flunk classes, resort to drugs and alcoholism from the financial burden of paying for college and everything else. One of my go to methods of realizing that I will never ever like a person is to hear people bragging about daddies money. I don't have a problem with taking advantage of your situation, but shut the fuck up about it", "author": "HoneybadgerAl3x", "created": 1629564143, "upvotes": 1}, "h9t0nhu": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t0nhu/", "text": "You are extremely lucky and I'll admit that I'm jealous. You're letting it get to you too much though. Just realize how truly lucky you are - it is a huge struggle for some of us to attend university because we're supporting ourselves. \n\nMy funding comes through the Chapter 35 DEA benefits - I get a bit of money every month I'm enrolled because my dad passed away when I was 18 as a result of military service. Using that and my boyfriend's job, we are able to make it, but barely. We live together and must engage every situation frugally. With my dad being gone, and my mom not making enough to help, it is up to me to make it through. Without the military benefits, I would not be able to go to university. I'd rather my dad was alive, but I'm thankful for the opportunity. \n\nThank your dad and succeed when you graduate! Do well for yourself and those around you. Always be grateful.", "author": "ListenToRush", "created": 1629564123, "upvotes": 1}, "h9t0d52": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9t0d52/", "text": "People are jealous.  Thats it.  There isnt anything else to it.  School is important.  No one gets to decide when your parents have to stop supporting you except you or your parents.  As a parent myself, I have great respect for your parents.  Study hard and do well in life, thats how you will repay your parents.", "author": "Canral", "created": 1629563996, "upvotes": 2}, "h9szthz": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9szthz/", "text": "Some people can't hold their jelousy in. Your peers need to learn some self-control. In the future, I hope everyone's education is subsidized, but in the meantime, there is not a damn thing wrong with allowing you parents to take care of your finances for college.", "author": "somethinsomethinmeme", "created": 1629563753, "upvotes": 2}, "h9sz8lq": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sz8lq/", "text": "It sounds like the friend that told you to take out loans like her is just jealous she’s going to be in debt and you’re not. Not everyone has the same privilege you do, but don’t feel bad for having it. Just use it for good when you get where you want to be.", "author": "maryf67", "created": 1629563493, "upvotes": 2}, "h9sywma": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sywma/", "text": "You are privileged. It is not your fault, but it’s going to attract a lot of jealousy and envy.", "author": "idkthoughso", "created": 1629563343, "upvotes": 2}, "h9syu76": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9syu76/", "text": "People who got mad because they simply didn’t have the privilege. I’m not judging you or anything because I’m in a similar situation, but they usually gets mad at you because they have to work their asses of to pay for tuition and bills, or taking a student loan out to be able go afford school. I wouldn’t be bummed out when stuff like this happen or when they get mad at me. Hell, I’d be pretty damn proud of what I’m able to have and focus on studying. So don’t fret. Ignore them and keep doing what you’re doing", "author": "zen1706", "created": 1629563313, "upvotes": 2}, "h9syu38": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9syu38/", "text": "i think part of them are kinda jealous. as long as you’re educated on money, budgeting, bill etc. then why not choose to not be in debt?", "author": "catluver429", "created": 1629563311, "upvotes": 2}, "h9syosx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9syosx/", "text": "I wish my old man could afford to fund me while I’m school. I mean having to work 20hrs plus a full time school workload is exhausting, I wouldn’t do it if I didn’t have to, and it’s easy for people like me to resent people like you, but I’d be doing the same thing if the tables were reversed. Better to let your old man help you out while in school than become a debt slave.", "author": null, "created": 1629563246, "upvotes": 2}, "h9syakn": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9syakn/", "text": "My dad paid for my college too, no worries. People get insecure and feel jealous that’s the reason they lash out. Just tell your dad you love him and don’t openly share with others that he pays for everything. I always told people I had loans and scholarships.", "author": "buttmunchman", "created": 1629563070, "upvotes": 2}, "h9sxvxx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sxvxx/", "text": "Well, to me personally i wish my family would provide for my studies.\n you are blessed for that and a blessing is to take not to refuse .\nThis is what i think , the person who told you to get into debt probably feels burdened by it and wants to include you in his burden that's all , jealousy probably? Idk \nYou shouldnt be telling people everything because they ruin everything especially the good stuff you tell them.\nFocus on your studies keep going at it , if your dad is okey with it then there is no problem because parents would do anything for their kids and he wants your to get your feet as a capable engineer not a barely graduated one.\nDo your thing and if you feel bad about it , you can maybe give back to your parents after you graduate and that is the best solution i guess ? \nDo your thing and dont ever listen to those people who discourage you from doing what suits you.", "author": "Decent-Ad-4226", "created": 1629562885, "upvotes": 2}, "h9sxbmt": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sxbmt/", "text": "LOL “real adults take loans”. Nah your chilling, as someone who has to take loans I would definitely take the opportunity to dodge it if I could. It would be stupid for you to take a loan when your family has the ability to cover the expenses.", "author": "FinisherReZ", "created": 1629562633, "upvotes": 2}, "h9swnlj": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9swnlj/", "text": "It's kinda fucked that you can do that and not see anything wrong with it when millions of people don't even have that option. My parents helped me when I was in school with necessary payments like when my car broke down. Anything I wanted to do or get that wasn't necessary like going out to dinner or buying new clothes I had to do on my own though, and I even feel guilty about that. Most people have to do it all themselves and I'm extremely lucky to have had help. \n\nI don't think you'll struggle in life though. In fact, I don't think you ever will struggle with anything because it's all being handed to you. By the time dad stops paying your bills, you'll have enough money to pay someone to do anything you haven't learned how to do for you. You'll probably end up with a warped view of how the world works and vote accordingly, all while claiming that you got to where you are with nothing but hard work and your own sweat, when in reality, you couldn't have done it without daddy's money.\n\nHaving said that, I don't think anyone would turn down the help and free money if it was available to them either. Others are bitter that you had the opportunity to get that kind of support when they didn't.", "author": "herr_leutnant", "created": 1629562331, "upvotes": 1}, "h9swbdo": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9swbdo/", "text": "I was in a similar situation in college. I felt bad for my peers who had to struggle more, but I appreciated essentially having a \"full ride\" through college from my parents. People can be envious of your situation, and they try to make it seem as though they're \"better\" for having had struggled more financially. Your father is working hard to pay for your college because he cares about your future. Don't let your peers turn this into a negative thing. Appreciate it, but don't flaunt it either. The friends from college I still have are the ones who are/were financially struggling but didn't give me shit either when they heard my college was being paid for. Instead, they fought the (understandable) urge to be resentful about it and instead told me how lucky I was to have parents who would do that for me. The people who can recognize everyone gets dealt a different hand in life and just accept it for what it is.", "author": "uhhMelvinDoo", "created": 1629562177, "upvotes": 1}, "h9svsnl": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9svsnl/", "text": " My father paid for like 75% of my school and expenses, and because of this I was able to graduate at 21 and start working immediately, and save and invest money early in my twenties which has honestly been life changing.  I am very grateful.  But I didn't waste time fucking around, chilling at the old-man's house for a decade, playing video games 20 hours a week, and treating school as a part time occupation.  I'm not saying this is what you are doing , I'm just saying that most of the time I see students who are getting full rides, they are 27 still getting their bachelor's degree, and are not super diligent.  I think many people, students included, notice this behavior as more common than not.\n\n I don't know why people know or are asking about this stuff to you though.  I might consider that you might be giving off a 'vibe' about something, which is why people are inspired to ask.  Also, as with most twenties people these days, way too much over sharing.  Stop talking so much, start filtering what you say.  Not saying 100% you are this way, but it's an educated guess based on what I observe culturally as a someone who is now a professor and deals with students all the time.", "author": "capital_idea_sir", "created": 1629561943, "upvotes": 1}, "h9sveed": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sveed/", "text": "Stop listening to your jealous haters. Your dad is doing what he is supposed to be doing as a parent who is able to help you get your career goals. He obviously wants you to succeed and have good mental health not having to stress out about money. That’s a good parent. \n\nLet your dad help you while he’s still alive and able to do so. Not everybody is as lucky as you and you should have gratitude for your dad. But also be aware that there are going to be sanctimonious people out there jealous of you. Focus on your studies, your mental health and your physical health: your dad obviously has empathy of providing a good environment for you because he wants you to do your best. Be choosy about what kind of people are in your social circles and avoid those who are jealous of you and might try to sabotage you somehow. I’ve seen some jealous people do some heinous stuff that I went no contact on them: you and most normal people trying to focus on your degree or whatever we have going on in life do not need toxic people dragging us down to make their jealousy feel better. Your dad is not the problem, your toxic acquaintances trying to sabotage you are the problem. \n\nYou focus on school and let your dad take care of you financially because he wants you to get that great degree that’s going to help you get jobs to help you be financially independent. Your college degree is your parents’ financial obligation. Don’t let jealous haters sabotage you.", "author": "NotReallyTaylorSwift", "created": 1629561769, "upvotes": 1}, "h9susr5": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9susr5/", "text": "If you’re lucky enough to have this support available to you, you should take it. But also understand what an advantage you’ve been given, and how it may read to others if you’re talking about it all the time. Having a job during grad school takes away a ton of time and energy from coursework and research. Some of your classmates who are upset with you may be stressed that they won’t get good jobs after grad school because they always have to take time away from their academic work to make money; they may be resentful of the advantage you have in this regard because of your dad’s generosity.\n\nSo you haven’t done anything wrong — and the person telling you to take out loans unnecessarily is being silly — but if you’re talking very openly about your dad funding you, you may benefit from being a little more circumspect about the leg up you’ve been given.", "author": "secondpriceauctions", "created": 1629561501, "upvotes": 2}, "h9stujb": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9stujb/", "text": "stop hanging with broke assholes", "author": "PM_Tits_69", "created": 1629561067, "upvotes": 4}, "h9stszm": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9stszm/", "text": "they’re just envious", "author": "PM_Tits_69", "created": 1629561048, "upvotes": 1}, "h9sssx4": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sssx4/", "text": "You are extremely lucky, and I think you should take advantage of that fact. I am in undergrad, and I also live with my parents and do not have to worry about paying any bills (except for fun stuff, like sports clubs). I think people are mad because they are jealous. It’s not like you’re going to be financially dependent on your dad forever. You are currently in school, pursuing a degree that will allow you to get a job and become fully independent. It would be another thing if you were not in school and planned on living with your dad forever.", "author": "JupiterRocket", "created": 1629560598, "upvotes": 2}, "h9ssmvf": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ssmvf/", "text": "I was in a similar situation. My parents paid my rent, utilities, textbooks, food, and I worked for fun money. It’s really none of anyone else’s business. It’s a general rule of don’t ask don’t tell about money and stuff. Plus you and me are the odd man out in this, most people have heaps of loans and no parental help. You don’t wanna be the outspoken minority on that", "author": "uglybutterfly025", "created": 1629560523, "upvotes": 2}, "h9srme3": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9srme3/", "text": "Absolutely not a problem and don't let people convince you it is. That's not to say it couldn't be a problem, or that it isn't already as I don't know your exact situation but the concept itself isn't the problem it's what you do with it. Since the dawn of man parents have utilized their established positions to benefit their children to increase their opportunities. Its not morally wrong nor is it all that rare, as long as you aren't lazy, ungrateful, or misuse it then there is nothing to feel ashamed of.   \n\n\nI'm in the same boat as you with my parents paying for my college and such but I know I'm working my ass off in school and part of why I'm able to do so well is because of their aid and support. Fulfill your end of the bargain and remember to pay it forward down the line, that's all your parents want.", "author": "BrownieZombie1999", "created": 1629560069, "upvotes": 1}, "h9sqi5s": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sqi5s/", "text": "I understand what you’re going through. All through undergrad, my parents supported me. When I went home some weekends, I’d help by working at their restaurant. Now in grad school, I have an assistantship, but the stipend doesn’t pay like a full time job, obviously. What my stipend doesn’t pay for, in terms of my bills, apartment, daily expenses, and fun things (concerts, going out to eat, traveling, etc) then my parents cover it. I live comfortably and have never felt like I couldn’t do fun things because of my financial situation. And I am very lucky for that.\n\nSo while it’s not exactly the same situation, I kind of get what you mean. I understand and appreciate the privilege of having my parents as my security blanket. And, like you, other than my assistantship job, my only real responsibility is school. When I go home, I work my ass off at my parents’ restaurant, the restaurant I grew up in. My parents don’t pay me, not that I would ever accept. I think you’re letting other people’s comments get to you. \n\nFor my situation, it’s very common and natural for Asian parents to support the child until they’re into their career. I held 3 part time jobs at one time before COVID, just little odd jobs, because I wanted to and some of the jobs sounded fun so I wanted to give it a try. It was never out of necessity. \n\nIn situations like this, I think it’s best to just appreciate what you have, but with the personal questions, don’t try to humble brag. Recognize that you’re in a blessed position and you deeply appreciate what things are just given to you when others have to work very hard for. \n\nAlso, DO NOT take out loans if you don’t have to. I think that was spoken out of jealousy. Due to scholarships and assistantships through college and grad school, many people are surprised and in awe that I’ve never had to take out loans. This is a good thing. Do not let that person tell you otherwise.", "author": "nuniinunii", "created": 1629559562, "upvotes": 1}, "h9sonre": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sonre/", "text": "Personal opinion….if you’re living at home AND he’s paying for everything I think it’s overboard because lifestyle transition from whenever you are done with school to adulthood….working a job, paying for bills, etc. is a HUGE adjustment that I am still working towards getting used to. I could understand if you lived in an apartment and needed help while getting through school, but if you’re at home I think you could stand to pay for something even if it’s minuscule to get used to it. It’s not to say you don’t have responsibility, but in time once school is done I’m assuming he’ll hand things back to you and it’ll be like a 0-100 move. But that’s just my two cents because I too live with a roommate who’s father pays for virtually everything yet she still finds things to complain about whereas I pay for everything and work full time and just do not get how she can find time to complain when she legit has nothing to worry about.", "author": "pr1298", "created": 1629558705, "upvotes": 1}, "h9sn0zm": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sn0zm/", "text": "For real don’t tell anyone shit about your situation a lot of people would be envious/ jealous. OP you do you and focus on finishing school !", "author": "High_Tech_L0wlife", "created": 1629557943, "upvotes": 2}, "h9smnn6": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9smnn6/", "text": "It's just envy, paying for college without parental support I soooo hard. It requires a ton of work and is a constant stress that you live with. Then you finish school and have massive loans that feel impossible to pay off. So hearing that there are people that can totally skip that struggle can be really hard to process. \n\nYou are so lucky that your family can pay for your school. FULLY use this resource explore your options, focus on school. You have a real ability to skip on the crush of student debt, enjoy it. \n\nDon't tell a lot of people about it. Student debt is a painful subject for a lot of students. \n\nBest of luck!", "author": "moogula1992", "created": 1629557768, "upvotes": 1}, "h9smi6v": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9smi6v/", "text": "They are just jealous and trying to drag you down with them. No one wants to take out loans. Not everyone can afford to focus on school and not have a job. They see you doing that and are secretly jealous. I got news for you, regardless of what you're doing now, you're already an adult. It sounds like you are doing a good job or else your dad wouldn't be supporting you still. Doesn't seem like you're fucking around. Honestly, fuck those haters. Graduate with zero debt and then start your life. Even after that, your peers will still be pissed that you don't have any college debt.", "author": "IamGeorgeNoory", "created": 1629557699, "upvotes": 3}, "h9sm0xu": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sm0xu/", "text": "My wife and I struggled when we were in school - She took out loans, I got a scholarship and did all kinds of odd and dirty jobs to buy extras for school. We've worked hard to have our children have a better life and I hope I'm in a position to do for my kids what your dad is doing now.\n\nIt's not everyone, its one or two people so don't take it to heart. The only thing I would say is don't listen to people and don't take a few people's opinions to mean that everyone feels that way.", "author": "reggeabwoy", "created": 1629557475, "upvotes": 1}, "h9slvtu": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9slvtu/", "text": "If it’s not a super financial burden on your dad it’s not a problem, especially since you’re planning on getting a job and then doing your own thing.", "author": "TheRealBigTim1", "created": 1629557409, "upvotes": 2}, "h9slci2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9slci2/", "text": "My parents are fully supportive financially as well. I have never had a proper job and get an allowance. I’m extremely grateful for it as i know it’s not the case for many people, and it’s not something i go around telling everyone as it causes jealousy/mean comments. I am grateful for what i have and know I’m lucky, doesn’t mean you are entitled or overly spoiled.", "author": "izzypy71c", "created": 1629557161, "upvotes": 1}, "h9skz1q": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9skz1q/", "text": "I think it is completely fine. My dad does the same except for tuition, which I get loans for. He pays for my car (it’s a lease) and phone. I just have to make sure that I have money for gas. If I want to buy anything on my own like video games, clothes, whatever, it’s on me. I currently have a job, and I put away saving and use the rest as pocket money. My dad only has this rule since I’m going to college. My brothers chose to go straight into the workforce, so they pay everything on their own.", "author": "alyvalley123", "created": 1629556986, "upvotes": 1}, "h9skwl1": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9skwl1/", "text": "Hey, my best advice to you is to keep that information to yourself because people will easily write you off or shun you due to your financial situation. I wouldn’t tell anyone because jealously and envy is a hideous thing that can hide in anyone. Your father is a great man for supporting you throughout your undergrad and graduate but not everyone has that support.", "author": "Nameless_Bunny", "created": 1629556953, "upvotes": 2}, "h9skj19": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9skj19/", "text": "School is the most important thing, and some side job to pay the bills is not going to do much for a career as an engineer. Engineering is not an easy major.\n\nIf you and your dad are ok with this, then it doesn’t matter what any one else thinks.\n\nPersonally I’m 27 and I just recently quit my job to focus on my degree. But I spent many years of working and investing and saving in order to have enough cash on hand to fund me for the rest of the year until I get my degree.", "author": "JonathanL73", "created": 1629556778, "upvotes": 2}, "h9sjwst": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sjwst/", "text": "You’re in a great position and some people will be resentful of that. Because of your situation you will adjust to being financially independent a bit later than your peers - you might mess up a little and look around thinking everyone has it down pat. Don’t worry it’s normal and you’re fine. It’s unlikely that there will be any long lasting negative effects from your (very good) situation :)", "author": "dionysuskitty", "created": 1629556486, "upvotes": 2}, "h9siv6t": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9siv6t/", "text": "I’ve heard of parents helping their kids who are in law school so it’s not bad. I think eventually you’ll take care of them like they take care of you. It sounds like you have bitter people around you. Working while in school is hard and stressful so it’s better to focus on school rather than work and start failing.", "author": "a_sofia", "created": 1629555991, "upvotes": 2}, "h9si9qp": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9si9qp/", "text": "I was in a similar boat as you during my undergrad. Parents paid for my bills and paid 75% of my tuition. I was fortunate enough to get married to someone in that time and he was able to cover my bills 100%. I also didn't have to work during any of that time. I feel quite blessed to have had that opportunity to focus solely on my studies. If I ever become a parent and am able, I would like to extend the sake possibility to my children because I think they shouldn't have to stress about things like that when they are studying for their career degree.\n\n The downside to having that luxury is that I feel that I was unbelievably unprepared for reality once I got divorced (for unrelated reasons). I had no useful work history and scrambled to find a job that paid minimum wage. I got lucky because Covid came around and I qualified for the pandemic unemployment, but without that I would have been struggling at the time. I ended up scoring a decently paying job that pretty much only hired me because they were desperate and I had a degree. I had no working knowledge of how to be an adult other than eat and work. I still don't know how taxes work and I have no clue how to budget. Now that I'm in my masters program, I have no clue how to balance school and work. If I could go back I'd definitely educate myself on the reality of finances and the such, as well as get a part time job so that I under that work-school-life balance better.\n\nStarted rambling a bit there. I empathize with your situation, but definitely educate yourself on how the real world works before you're just suddenly out there without a clue like me.", "author": "delalilama", "created": 1629555706, "upvotes": 1}, "h9si655": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9si655/", "text": "I would at least try to build your credit if you haven’t started already. Many people have parents that support them like this, so don’t stress.", "author": "N_Fogg", "created": 1629555658, "upvotes": 1}, "h9sh38z": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sh38z/", "text": "Dude, I'm 24yo. I live and study abroad. Totally opposite to u. I've taken out huge study loans and since 19 I haven't taken a single penny from dad. I work part-time jobs to support myself. I like being independent but there's a big catch to my side of the story. I love my parents more than anything in the world but lately I've been growing more and more distant away from family and I think that is because I have a valid reason that I'm independent. \nMy ego comes into play and I think highly of myself. I wish I could come under protection of my dad again. I don't want to keep on walking alone. \nThey are your family, you don't owe them any money. Your dad sponsors you because he loves to. He doesn't have anyone else to spend his money on. Please understand that family is everything.  Cherish the time you spend with them. I wish I could go and live with my parents again. \nIf it makes them happy to support you, don't take that sentiment away from them.", "author": "icebreakerincovid19", "created": 1629555138, "upvotes": 2}, "h9sgfgj": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sgfgj/", "text": "Many people don't have the option to where everything is paid for them and I'm one of them. If you're getting that chance, it's great! But also know how to adult I know so many people who struggle with simplicit things  like not knowing how to buy a car rent an apartment and how the bills work and stuff. You should still have knowledge about that.", "author": "pani_puri_", "created": 1629554812, "upvotes": 1}, "h9sf9ry": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sf9ry/", "text": "People are jealous. Straight up. Your dad is just trying to ensure that you're successful and there's absolutely nothing wrong with that. I guarantee that anybody who has said anything negative about it to you would switch places with you in an instant if given the chance", "author": "unholymanserpent", "created": 1629554225, "upvotes": 3}, "h9setm6": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9setm6/", "text": "Your friends sound like jealous kids. I'm working full time and taking out loans to pay for college. If I could have a parent support me I 100% would. Don't feel bad because your father is able to do more for you. \n\nTake what blessing you can in life. Just try to never be ungrateful. I wish you the best of luck and to find friends that aren't so juvenile in how they handle their feelings.", "author": "aradol", "created": 1629553991, "upvotes": 1}, "h9se6v7": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9se6v7/", "text": "They’re just salty that you’ll have a leg up on them without any debt to pay when you finish school. I wish I could be in that position.\n\nPersonally I avoid talking about money with people. Avoids the drama.", "author": "purplemonkey55", "created": 1629553664, "upvotes": 1}, "h9se48w": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9se48w/", "text": "People get jealous, you’ll be fine because you’ll learn to deal with money when you’re an engineer. Just don’t mention it to people. It’s none of their business", "author": "k8itus", "created": 1629553626, "upvotes": 1}, "h9sdgq2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sdgq2/", "text": "I think people are angry because some of them probably struggle and don’t have parents who would do what your father does for them. When I was in college my family didn’t pay for my apartment/expenses so I had to work. Just learn to keep your financial information to yourself, many people struggle and will see you saying that as you bragging. Also imo it’s kind of good to pay for your own things - you feel like you’re an independent adult, you learn how the world works.", "author": "FullGrownHip", "created": 1629553286, "upvotes": 1}, "h9sd5if": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sd5if/", "text": "Honestly I think they’re all talking out of their ass due to being jealous, hell I won’t even lie to you - I’M jealous of you! As long as your dad/parents aren’t using this to manipulate and control you then there’s absolutely nothing wrong. He’s doing what a parent SHOULD be doing! \n\nIf you have the means to not only provide your child with comfort, stress free finances, 0 student loan debt, head start on their financial future and the ability to focus solely on school (thus making college life less stressful) why the hell wouldn’t you??!???!  [The only thing I’d say is even though you wouldn’t be paying it, it would probably be a good idea to have your dad put your name on some of the bills (while he pays it) just to have payment history, help improve credit score and all that jazz)]\n\nYour friends grew up in the struggle and that’s unfortunate, been there (still there), but I wouldn’t wish that on anyone. I wouldn’t wish for anyone to have to be stressed about loans! Messing up your credit score! Crying because you have a crappy part time schedule that barely pays rent and having to cram for finals and probably not knowing where/how you’ll get money for food or car payments. \n\n\n\nSo long as you aren’t out here flaunting this in people’s faces I say Fuck your friends, get better ones. They’re supposed to want to see you elevate and not drag you down.", "author": "strudels24", "created": 1629553122, "upvotes": 1}, "h9scf2v": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9scf2v/", "text": "I come from a very poor family but my dad is the same. He says school is the only job I have until I graduate and to let him worry about everything else.\n\nYou aren’t less of an adult for letting your dad take care of you. If others want or need to take out loans that’s fine but it’s weird that your peers are pressuring you into taking loans. If you don’t need loans, then don’t get them.", "author": "Cinnamode", "created": 1629552737, "upvotes": 1}, "h9scevn": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9scevn/", "text": "I think that it’s wonderful that your dad is so supportive of your studies. On the other hand, paying for your own school teaches you how to budget your money, learn the value of saving, and ultimately makes you a lot more independent. Take it from someone who lived at home, and worked simply to pay for her own school (no debt!) \n\nTruthfully, I believe it makes people grow and become money conscientious when they have to pay for something. Maybe, choose to pay for the water bill. Or even better, get an internship in your degree now! And if it’s a paid internship, which it should be, offer to pay a phone bill or anything like that. That way you’re still focusing on your studies, but also contributing and helping out your dad", "author": "oreoo8", "created": 1629552734, "upvotes": 1}, "h9sc00v": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sc00v/", "text": "I wish my parents would fund my living like that while in grad school. They're just jealous, live your best life homie", "author": "Lphozzy22", "created": 1629552512, "upvotes": 2}, "h9sbohe": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sbohe/", "text": "Theyre probably a little jealous. Obviosly you are lucky to have such financial support that many others dont. I would keep taking advantage of it though.", "author": "jacobsawyer69", "created": 1629552340, "upvotes": 2}, "h9sbocy": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sbocy/", "text": "Wealth is a thing, if you're not flaunting it and not being a dick I don't see a reason to care.\n\nAlso don't take out unnecessary loans. Terrible idea", "author": "ElementalNerd", "created": 1629552338, "upvotes": 2}, "h9sacvg": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9sacvg/", "text": "That’s you and your dads business. My mom struggled during school. She had two outfits. Wear one, wash one. One bowl of rice and fish for the entire day. School all day, housecleaning in the evening. Study while she worked. For those reasons, helping me through college was her promise because she didn’t want me to worry about tuition or food. If your family is anything like mine, you will take care of your dad as he gets older. My promise to her.", "author": "M_Alch3m1st", "created": 1629551629, "upvotes": 2}, "h9s9vik": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s9vik/", "text": "Dude, fuck hustle culture. You have a great thing going and Your dad sounds like a great guy. You seem to really appreciate it. \n\nThere's no point in wasting your time on work that doesn't bring value to your life if you don't have to.", "author": "Albyyy555", "created": 1629551364, "upvotes": 2}, "h9s94o9": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s94o9/", "text": "Dude, parents should support their children if they can. Society should support its people. In the absence of both, people take out student loans. Keep this info under your hat, people who are struggling are not ready to hear this without judging you. \n\nYou however should do the best you can in living up to the trust your father has placed in you by doing as well as you can in school. Neither your dad nor you have done anything wrong here.\n\nWhat kind of horrible conditions has it come to where we can't tell \"independence\" from a lack of family and social support?", "author": "wetapotatoworkshop", "created": 1629550951, "upvotes": 2}, "h9s937z": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s937z/", "text": "I envy your situation however as others have mentioned it does make you dependent. \n\nMaybe you can have the best of both world. Instead of your dad straight up paying for everything why not give you a monthly \"allowance\". This way you can still focus on school however you'll also be able to dip your toes into what's to come once you have to rely on yourself for bills and what not.", "author": "drgon59", "created": 1629550928, "upvotes": 1}, "h9s90hv": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s90hv/", "text": "“Nobody does anything without help, Will. People open doors for me and I open doors for you, Will. It doesn’t make you any less of a man if you walk through them.” -Uncle Phil", "author": "noradoralora", "created": 1629550886, "upvotes": 2}, "h9s8amm": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s8amm/", "text": "As many others have said, just avoid sharing the information with other students - even if they ask. The way to do this is to learn some boundary phrases - \"Oh, don't really like going into detail about my finances and such. Anyway, *redirect to new topic*\". If it's known you live at home, you can mention you're fortunate to be able to, but you don't have to give info about your family dynamic or how that relates to your finances at all. \n\nMost students should know those details aren't really their business. I'm a senior in undergrad and even after 2-3 years I know better than to ask my closest friends how much financial aid they get, how in debt they're gonna be, if their parents are paying, etc. I've picked up on some of the info over the years, but still just have a vague understanding of their situations. And that's okay because it's literally none of my business. \n\nAs for the independent/dependent conversation. Maybe just always be open to doing chores, helping with errands, etc. \n\nYou are avoiding the cost of renting, so be appreciative. Acknowledge that others may have more difficult financial situations, and consider paying it forward in the future if you can in some way. Celebrate now your good fortune and make the most of it.", "author": "dontcry2022", "created": 1629550471, "upvotes": 1}, "h9s8811": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s8811/", "text": "As a person who is paying for their college almost entirely  on their own, I definitely envy you. I think what your parents are doing is amazing. As long as you have financial literacy and have the tools to be responsible with money, which I am sure your father teaches you, I don't see a problem.\n\nI hope this is something I have the means to do some day with my own children.", "author": "RagingLesbian11", "created": 1629550426, "upvotes": 1}, "h9s868h": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s868h/", "text": "I had a similar experience with an old friend from college, but I was on the other end of things: I was taking out loans and she was being funded by her family. It was never really an issue between us, until she started kind of bragging about and flaunting her situation. My advice would be to just be grateful for your situation and respectful of others. From what I can tell, you’re a very respectful person, so don’t worry about the haters.\n\nCongrats on the engineering btw! That was my path as well, so I know how difficult it is😊👏", "author": "rapidpower11", "created": 1629550397, "upvotes": 2}, "h9s83qj": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s83qj/", "text": "Fuck them! It’s great you have a supportive parent college is hard period. The Fact that he is supporting you is fantastic.", "author": "sugarbbymadi", "created": 1629550356, "upvotes": 1}, "h9s7haj": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s7haj/", "text": "Don't let it get to you. A lot of people have family support in grad school. Cost of living can be so much more than your stipend (if you are teaching and in the U.S.). My grandma gave me as much money as she could tax-free while I was doing my PhD, which allowed me to have no loans. My husband just had his stipend ($13,000 per year back then--not sure it's much better now) and ended up with student loans, which we're set to pay off around his 45th birthday. We also lived in a shitbox apartment, shared an old beat-up car, and spent frugally, but we went to Berkeley and cost of living was crazy. I was super jealous of a woman I knew who was completely bankrolled by rich parents. She was able to travel to archives and such and ended up being really successful in the career. Take the hand up you're given in life with gratitude, but don't feel bad about it. Your dad really is helping you.", "author": "raspberry-squirrel", "created": 1629549987, "upvotes": 1}, "h9s7fna": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s7fna/", "text": "Don't listen to those people being upset that they don't have the same support system, your father sees that you have a good head on your shoulders studying a great major and getting onwards to a great career. Focus on graduating with awesome grades and landing that first great job, good luck!", "author": "itreeksofsin", "created": 1629549961, "upvotes": 2}, "h9s729y": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s729y/", "text": "DO not let those people shame you for having a father who can afford to support you while you are in school. It’s a gift. No you do not need to be in debt. That doesn’t make a person special.  Our goal is for our kids to have zero school debt. \n\nThey come across as judgmental because of jealousy. They also really need to mind they own damn business. \n\nNow with all that said.. why do they all this? Do you talk about it? You should stop.", "author": "brazentory", "created": 1629549736, "upvotes": 1}, "h9s63ej": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s63ej/", "text": "People are just jealous. When I was in uni I was dirt poor. I had like 25$ a week after tuition and bills. My roommate was getting help from her family, I wasn't getting help from anyone. Took her 2ish years to pay off what loans she did have. It took me 7, living like I was on minimum wage with a middle class job. I was jealous. \n\nBut now I realize that's having ridiculous loans isn't adulting, rather it's a problem with society. Like, how is making 17/18 year old make huge financial decisions, which causes them to grovel at the feet of their bank accounts for 10 odd years, adulting? Fuck that noise. Divert some of the money from politicians (who should not be receiving upper class income to make policies for middle and lower class families), and from big corporation tax breaks, and make higher education free.", "author": "Alibabada", "created": 1629549144, "upvotes": 2}, "h9s5zv2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s5zv2/", "text": "I don’t think the tuition or living at home is bad but if he’s paying for all the things life costs you that might be a little much but it’s not my place to judge", "author": "Jenna_gross12", "created": 1629549084, "upvotes": 1}, "h9s5w1j": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s5w1j/", "text": "You are lucky your dad can afford this, so why not start life without any dept? I see no problem with this. People get mad but if their parents would be able to do this they would do the same. I’m an international student so I can’t get a job yet, and my parents are fully funding me too. When you get a job, you can show your dad how grateful you are and treat him to something nice. As long as you know how lucky you are and you appreciate him, I see no problem with this.", "author": "Dry-Razzmatazz8352", "created": 1629549021, "upvotes": 1}, "h9s59oa": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s59oa/", "text": "Don't listen to your friends. Your dad can afford what their parents can't and there is no shame in that either way. Most people *need* to get loans so don't tell them you have it easy because they know you're not going to be in debt after. Your friends are probably jealous and some of them may actually think you're not independent enough but that's non of their business. \n\nI tend to agree with your dad, concentrate in your education and make sure you'll find a job after graduation (that's what he worked hard for after all, no?) You can get a part time job if you want but don't put yourself in financial strain just because your friends told you that's what adults do. I'm sure people do judge you but people need to respect each other and not to make each other feel bad because of their financial situation no matter how rich or poor they are. If your friends can't do that then don't talk about each other's finances. \n\nNot being in debt and not being away from home doesn't mean you're not going to succeed in life. Living at home makes sense especially if your college is in your hometown.", "author": "GiveMeTheYums", "created": 1629548636, "upvotes": 1}, "h9s56aa": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s56aa/", "text": "If you have the want, need, and drive to be independent you'll be fine.\n\nThey're mad they have to work and do school and pick and choose what to spend money on. It sucks, I wish everyone had the opportunity you had, but just have to let it go and if your want is to be an engineer just bust through it and find a job, and become independent. \n\nI was fully dependent on family, and my wife's family till I was essentially 22... I got under table jobs and such but I turned out fine, at 26 I have a full career, a house, the things I need etc, fully independent.", "author": "StarsandMaple", "created": 1629548577, "upvotes": 2}, "h9s47u5": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s47u5/", "text": "Nah fuck them. They're just jealous their parents wouldn't help them pay for college. There is nothing wrong with your dad paying your bills until your on your feet. You're studying something and doing well, so it's not like you have no career goals and are just trying to mooch off your parents.\n\nDon't worry about what these people say, nothing wrong with having your dad pay your bills while your in school.", "author": "Scooby-Doo_69", "created": 1629547974, "upvotes": 2}, "h9s3ue9": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s3ue9/", "text": "I don't know if this would work for you, but my father paid for graduate school and co-owned a condo with me that I lived in, roommate and I paid him rent, then he gifted me back my and my roommate's rent when I married and it was time to buy a house -- enough to cover the down-payment. I've thanked him many, many times, and his response was always the same: \"You'd get the money anyway when I die, why shouldn't I give it to you now when not having enough money can really set someone back? And I get to enjoying seeing you make good use of it.\" You might respond to criticism similarly. \n\nAs a father myself, I can't imagine how pissed I'd be if I had good money, offered to pay for worthwhile things like graduate school, but got told by him he'd rather take out loans, that\"it's what you do when you're an adult.\"\n\nAs for living at home, your critics are dummies about that as well. There was a small window in history that it was widely reasonable to live on one's own in early adulthood. It's now less so, both on the front end (it's harder to save money today) and on the back end (it's more common for parents to move in with their children).", "author": "dcgrey", "created": 1629547734, "upvotes": 1}, "h9s3otl": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s3otl/", "text": "Hi. I'm 30. I work two jobs (one full-time and one part-time) and I'm in college. It sounds like you understand the value of money. Say thank you for the support and use it!", "author": "Radish_3xp3rim3nt", "created": 1629547630, "upvotes": 1}, "h9s3irx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s3irx/", "text": "Meh. Most are probably just jealous, it’s a pretty sweet gig you’ve got going on. I wouldn’t bring it up unless it’s necessary though, clearly makes people insecure. \n\nYou’re fine. Might have a tough time adjusting to independent living but you’ll get it.", "author": "temsik1587againtwo", "created": 1629547519, "upvotes": 2}, "h9s33jk": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s33jk/", "text": "Dont see why you would get into debt when it isent neccesarry", "author": "humu-_-", "created": 1629547241, "upvotes": 1}, "h9s2cf3": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s2cf3/", "text": "You are in a far better situation than most of your peers and they are jealous. Obviously, your father paying your expenses is far better than taking out loans. \n\nYou might have to practice being a bit more modest so you don't risk losing friends or cause others to be jealous.", "author": "Bravely-Redditting", "created": 1629546726, "upvotes": 2}, "h9s28v0": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s28v0/", "text": "Americans are weird. Where I'm from it's normal for your parents to pay for your stuff until you're done with studying.", "author": "Ok_Progress_7120", "created": 1629546658, "upvotes": 2}, "h9s1y65": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s1y65/", "text": "Pretty sure they are jealous of you. I'm the \"poor\" kid who has to work a student job to pay for alot of things. I have some friends who's parents pay everything for them too. Man i WISH. It is obviously much better because school is a full time job in my opinion, so as long as you're not taking advantage from it, you're good and you shouldn't let your jealous friends guilt trip you in taking a student loan and being in debt for years to come", "author": "churchisforbrunettes", "created": 1629546455, "upvotes": 2}, "h9s1xru": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s1xru/", "text": "Don’t let other people’s insecurities and jealousy bother you. It’s really nice that your dad is doing that for you, and there’s nothing wrong with a parent taking care of their child.", "author": "ohheyitslaila", "created": 1629546446, "upvotes": 2}, "h9s1fgb": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s1fgb/", "text": "That seems the norm with my friends, my parents can’t support me so it’s just the nature of things. I don’t even get FAFSA", "author": "TheSeemefly", "created": 1629546076, "upvotes": 1}, "h9s0fqo": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9s0fqo/", "text": "They can shut the heck up. My parents used to find me, I couldn’t legally get a job for the first years of college. By the time my junior year rolled around, I changed my visa, now I work like 29 hours a week, so I can help with Finances.", "author": "ZiOnIsNeXtLeBrOn", "created": 1629545330, "upvotes": 2}, "h9rypp7": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rypp7/", "text": "Taking out loans instead of your dad paying is a stupid idea.  It comes from people being frustrated with the system and thinking that if they have to suffer so should you.  Not having debt will be freeing as an adult, and we should be trying to find a way to help more people do that.  My parents paid for my tuition and I never needed to take out a loan.  Some of my friends have expressed jealousy over that fact, but none of them blame me for taking it. \n\nBut, there are benefits to having work experience even if it isn’t related to your chosen field.  It helps you shake the dust off and learn how to act professionally in an employee/employer relationship.  Maybe you got enough of that while an undergrad, and you’ve got some specialized skills now.  I’d grab a summer internship if you find one that’s a decent fit. \n\nI will say that I’ve known people who never held a job until after graduating.  They struggled to find work at all.  Not because they didn’t have skills, but because the whole employment process was so new they didn’t know how to navigate it.", "author": "Crayshack", "created": 1629543988, "upvotes": 1}, "h9ry9qm": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ry9qm/", "text": "Keep your mouth shut. Don't tell people things they don't need to know. \n\nThey are jealous.", "author": "ObjectiveAnalysis643", "created": 1629543635, "upvotes": 2}, "h9rxdjp": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rxdjp/", "text": "Don't mind retarded or jealous people, just do what you think is best for you", "author": "Kiseijuu_366", "created": 1629542893, "upvotes": 1}, "h9rx35w": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rx35w/", "text": "Stand proud- a parent who loves you is a VERY good thing. debt free is just as nice- who really cares what they say.", "author": "Blosom2021", "created": 1629542653, "upvotes": 2}, "h9rww4f": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rww4f/", "text": "Its literally free money thanks to your dad being in a good spot. Why would you throw it away just to take out loans? Your friend is jealous since obviously they didn’t get such an opportunity. I would keep quieter about that as well.", "author": "siegure9", "created": 1629542486, "upvotes": 2}, "h9rvuj8": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rvuj8/", "text": "Taking out student loans when you don't have to is utterly ridiculous.", "author": null, "created": 1629541592, "upvotes": 2}, "h9rvk8y": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rvk8y/", "text": "It's envy. Most people aren't as fortunate as you are and wealth disparity and inequity stings. Money rules their lives. It doesn't for you.\n\nI would keep your financial situation to yourself as best you can. You've done nothing wrong though.", "author": "Elastichedgehog", "created": 1629541340, "upvotes": 2}, "h9ru4w9": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ru4w9/", "text": "They're just jealous you're getting the full ride for free. I wouldn't worry about it, though in future you should probably keep it to yourself to maintain the status quo. I highly doubt it will affect your future in a negative light.", "author": "VivaLaVita555", "created": 1629540073, "upvotes": 1}, "h9rszge": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rszge/", "text": "They sound jealous", "author": "smoothedolphin", "created": 1629539070, "upvotes": 1}, "h9rs0cl": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rs0cl/", "text": "Your friends are being ridiculous. I hate the misconception that you need to struggle in order to be successful. Technically because you’re being fully funded, you’re not independent but that’s fine as long as you have a plan for when you lose that dependence. My mom completely supported me through undergrad and now she’s supporting me through grad school. There’s no problem with it whatsoever and I feel like if you’re lucky enough to be able to focus on school without worrying about bills, then you should take that opportunity.", "author": "officiallytimothy", "created": 1629538192, "upvotes": 9}, "h9rrzwx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rrzwx/", "text": "Why even worry man. God bless your dad for putting you in a situation where you can succeed. Focus on your school and make sure to finish it! Every father wants to be able to take care of their children and put them to college if they wish to do so! If people ask, just tell them my dad helps me out. That’s it man, you don’t need to let ANYONE know anyhting.", "author": "dropdeaddaddy69", "created": 1629538181, "upvotes": 3}, "h9rr14b": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rr14b/", "text": "There is no merit to what they're saying whatsoever. They say these things because they're upset they don't have the luxury themselves. I assure you, if they could they would.", "author": "DankBlunderwood", "created": 1629537317, "upvotes": 1}, "h9rpnnu": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rpnnu/", "text": "They're jealous of you, but it's not their fault, to be honest.", "author": "TTbulaski", "created": 1629536080, "upvotes": 5}, "h9rpnh0": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rpnh0/", "text": "Keep that shit to yourself.", "author": "WesternAd9077", "created": 1629536075, "upvotes": 1}, "h9rosxn": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rosxn/", "text": "People are just jealous. I think we all wish our fathers and mothers could fund us all the way. I think being overly dependent on your father is the only thing that will get you in trouble. You need to be your own person and that means even if you try to pay a bit your own so you can learn the burden of responsibility but I would definitely not allow it to chew you up or over think about it. I think your just need work experiences personally because every field asks you to have experience already. So while your dad supports you in everything, try doing volunteer work so you have hands on field. Don’t worry about what everyone else has to say. Screw them. I wish I never taken loans out but we gotta do what we gotta do to survive. So stay loan free!", "author": "Brave-Ad-4856", "created": 1629535314, "upvotes": 4}, "h9ro24r": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9ro24r/", "text": "graduate students shouldn't pay tuition", "author": "fnybny", "created": 1629534657, "upvotes": 1}, "h9rn9i3": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rn9i3/", "text": "If you have a really really GPA… then it’s valid lol", "author": "Exact-Coach1264", "created": 1629533949, "upvotes": 1}, "h9rn5gs": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rn5gs/", "text": "They should go eff themselves honestly. My dad puts education before anything and though he wants my brother to work he wants that for work experience and pocket money not to pay for any of his necessities and stuff. If it ever came in the way of his education my dad will tell him to quit. My point is he is your father and he's doing what he thinks is best for you and if that means focusing on your education then ignore the haters and focus on your education. It's his money and his choice what he does with it, he chooses to spend that money on you.", "author": "Vivian_E", "created": 1629533853, "upvotes": 4}, "h9rn4wi": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rn4wi/", "text": "I wish I could be like that. I mean at least for under grad. I do think not having a job within the field of study when you are a grad student is definitely asking for some trouble later on but hey to each their own. If you can have your shit paid for why not?", "author": "KingBlackthorn1", "created": 1629533838, "upvotes": 1}, "h9rmfom": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rmfom/", "text": "I have a very similar situation as well.  I'm starting my 5th year in my engineering undergraduate program.  A couple of my friends always kinda make fun of me for \"living off of daddy's money\", while they fully support themselves financially.  I am by no means living extravagantly, and pay for anything extra (fun things like theme park tickets, new laptop, PC parts, etc) with my own money from previous part time jobs/internships.  I always tell people that make fun of me that this is my dad's decision, and always has been.  My dad has been able to build up a college fund for me since I was very young, and wanted me to not stress about finances while I was in college.  At first I felt guilty about this, but I've come to realize there is nothing wrong with it.\n\nBasically, if your dad is doing this willingly, there is zero problem with it.  There is nothing wrong with being financially dependent on parents until you graduate and get a full time job.  Enjoy grad school, enjoy life, and enjoy not having the stress of paying for things!  \n\nBest wishes!\n\nEdit: Also, I'm sure you already are grateful, but don't forget to thank your dad!  I can never say thank you enough to my dad!", "author": "RCEHP", "created": 1629533225, "upvotes": 5}, "h9rkkgb": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rkkgb/", "text": "Yo OP,   \nThis is my first comment on the subreddit. So please bear with me.\n\nI kind of feel a bit sad about how they define what is to be an \"adult\". Like, get a loan, to fund your education. Come on that's not so smart, like after finishing education you got a liability to pay for at least a couple of years (well depending on the terms though) that for me is not financially smart. Your Dad is ok my dude, he knows that he still has a responsibility to assist you to be on the right path. Yes, you might feel a bit embarrassed about it, but that's how he expresses his love for you as their child. So my advice for you, make sure you get that degree and the best job position. For you to show how thankful for an awesome parent you have.  \n\n\nBut maybe a little advice is maybe to get smart in terms of financial topics if you have the spare time. Just to be a bit more ready when you start out in life out of education.", "author": "Weebist", "created": 1629531607, "upvotes": 4}, "h9rjtwr": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rjtwr/", "text": "I'm curious what country you're from. Is this in the US?\n\nI'm a father of two and I actually just got my undergrad a few years ago. My kids are very young but I've been financially investing in their future. Graduating and finding a good job in my field has allowed me to do so comfortably. I had to take out loans to make it work but I'm fine with that. If I can have my daughters avoid taking on massive debt to get her education, why wouldn't I want to do that?  \n\nThe reactions you're getting seem childish and derived from jealousy. When I went back to college several years ago I was surrounded by kids who were fully supported by their parents. Nobody gave a shit.", "author": "JustSomeGoon_", "created": 1629530984, "upvotes": 7}, "h9rivkl": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rivkl/", "text": "They're jealous, that's all. Living on your own is hard at first, but everyone has to do it at some point, and there's no reason you won't manage either.", "author": "Apprehensive_Low_190", "created": 1629530194, "upvotes": 10}, "h9rih5x": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rih5x/", "text": "I guess people just want to shove into your face that they are more adult like, independent and struggling etc. probably due to the stress they are feeling. try not to reveal your financial situation and think too much about it! all the best with your studies!", "author": "btslovespurple", "created": 1629529862, "upvotes": 4}, "h9rhjv8": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rhjv8/", "text": "Here's the deal. Yes you shouldn't tell everyone. No you shouldn't be ashamed.\n\nYou should however try to get some financial independence, even if small, so you are prepared to do things on your own. Maybe cover a phone bill or get a small job that doesn't occupy too much of your time. Establish an emergency savings account. Just because you are fully funded and dependent doesn't mean you are set. For example, your health insurance will be separate/null after you are 26.", "author": "AzrielK", "created": 1629529118, "upvotes": 1}, "h9rhcdn": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rhcdn/", "text": "Sounds dope, wish I could've done that. Maybe just keep it to yourself, and be consistently aware of how hard others are struggling without that advantage.", "author": "4x49ers", "created": 1629528952, "upvotes": 3}, "h9rgxv6": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rgxv6/", "text": "Reading some of your other comments it definitely seems like you would be unprepared if you suddenly had to live alone and fully support yourself, uni/college is usually when most people learn how to do this with somewhat of a safety net\n\nYou need to organise your own finances, the fact that you have access to your dad's credit card without even knowing how much you spend is very worrying, also investing is an 'extra -' it's useless if you can't even support your basic needs alone\n\nYou should start setting yourself a realistic monthly budget and try actually sticking to it as if you were actually living alone, I'm not saying you have to use your own money since your dad is being so generous but you need to prepare yourself otherwise you risk landing in debt in the future due to spending above your means \n\n\nAlso, just a side note your friends comment about unnecessarily taking out loans and basically forcing yourself into debt is weird, you just need to aim for a middle ground lol", "author": "ILive4Banans", "created": 1629528633, "upvotes": 3}, "h9rgrjh": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rgrjh/", "text": "Whoever told you taking out loans is “what a real adult does” is a dummy. Just sounds like your friend is envious of your position. I would recommend not broadcasting any of your finances, but getting a part-time job and paying for some of you living expenses would probably be a smart move. Otherwise you run the risk of not knowing what you’re doing when you do have to start paying bills.", "author": "jschneid63", "created": 1629528497, "upvotes": 6}, "h9rgpbf": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rgpbf/", "text": "Your friends are wrong. \n\nSociety teaches us if we aren't earning, we have no value. But you have value all by yourself and you don't *need* to work at some shitty job your don't really want anyway. Leave that job for the student who needs to pay rent or single father getting a night gig...", "author": "inclinedtothelie", "created": 1629528450, "upvotes": 5}, "h9rg48y": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rg48y/", "text": "It's a amazing thing and I am happy for you. Many dad's like mine wouldn't do this even though his father did for him. Do the best that you can man", "author": "diego_g1129", "created": 1629527988, "upvotes": 1}, "h9rg2la": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rg2la/", "text": "They’re jealous. If they could do the same, they would. I would too, of course, who wouldn’t? \n\nJust don’t tell people that. It won’t earn any friends essentially bragging that you have it better.", "author": "Major_Banana", "created": 1629527952, "upvotes": 3}, "h9rfx6e": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rfx6e/", "text": "I do suggest you start working though because a 25 year old with an engineering degree who has 0 experience is still not going to be super easy. There are dozens of highly qualified foreign engineers, and maybe a dozen highly qualified engineers who have work experience applying for the same job. Working builds character, helps you work with people you’d likely otherwise hate, and teaches you responsibility. And sure he can continue to help pay for stuff but you could start saving money.\n\nAnd honestly, I wouldn’t do what your dad is doing. I could be rich and I’d support my kid through school, but not literally fund every penny. I do agree, as shitty as it is, that suffering builds character. And judging by this post and the fact that this is getting to you, you don’t seem to have much.", "author": "Energy4Kaiser", "created": 1629527833, "upvotes": 1}, "h9rf3zp": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rf3zp/", "text": "Your living situation isn't weird, it is just uncommon because the majority of people in college cant be fully supported by their parents. \n\nIn short, they're bitter that they weren't fortunate enough to be in the same situation. \n\nI went and worked while going to school to support myself to help my parents. Ended up going back to school for a different degree but now my parents' financial situation is different and my dad pays for my whole life so that I can finish my degree within two years and not the probably 3-4 it would take me to do on my own while working. He supports me because he wants to and it is his money to do whatever with. I don't spend his money frivolously. He is investing in me so that I can be fine in the future and then he won't have to worry about my living situation anymore. \n\nIt is okay to not be independent at 24. I'm 25 so you and I can keep doing what we're doing and ignoring the haters. \n\nDon't let other people make you feel bad about not having it as hard as someone else. It's not like you're going around bragging about how you're life is funded by daddy. They asked and didn't like the answer, which is that life isn't fair.", "author": "Cerenya", "created": 1629527211, "upvotes": 4}, "h9retqw": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9retqw/", "text": "A lot of people do not have the luxury of having a parent emotionally support them through higher education, let alone a parent willing to financially support them in every aspect of their educational journey.\n\nWhile their recommendations like going into debt is a bit silly, it comes more of a place of disbelief about the utter privilege's you have compared to large student population. Though I do hope you are 'working' (unpaid internships I guess) during graduate school as you need experience to be a viable candidate for job selection.\n\nWhile this isn't a personal attack, it does seem a bit dense you even have to ask this and try to get an interpretation. You are thinking too much into it. People just feel tired of having to do so much to get by that when they see someone just skating through it makes them feel bitter. Just keep yourself in check, and keep doing what your doing to the best of your ability.", "author": "safespace999", "created": 1629526990, "upvotes": 1}, "h9renxo": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9renxo/", "text": "I’m 20 years old and in the same boat. Besides things like art supplies and non-necessities, my parents pay for everything, citing that my education is much more important than work right now. \n\nOnce I’m settled into college, I plan on having a small job/side hustle to make a little extra spending money. But, as far as I’m concerned, there’s nothing wrong with letting my parents pay for my shit as I go through college, so long as our relationships remain fairly stable. \n\nHonestly, if I were you, I’d keep my mouth shut. Nobody needs to know our financial situations. It should always be kept between the student and their parents, to avoid making others who aren’t so blessed as we are feel bad. Don’t mention your financial status. Don’t act like a spoiled Jake Paul and flex your privilege for the world to see. Just be low-key about your financial/living situation, and if anyone says anything, just politely tell them it’s none of their business. You’re an adult. Your financial situation is confidential. And that’s that. If someone steps on your toes, just tell them to fuck off or something lol", "author": "camohorse", "created": 1629526864, "upvotes": 1}, "h9rdwtk": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rdwtk/", "text": "I'm you, but my mom paid for almost everything. It allowed me to focus on school, and I would say almost all the time I was ahead of my peers. Just focus on doing what you're there for.", "author": "SauteedAppleSauce", "created": 1629526301, "upvotes": 3}, "h9rdmae": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rdmae/", "text": "They are simply jealous. You do you and focus on your grades. However make sure you do internships.", "author": "cuppa_tea_4_me", "created": 1629526083, "upvotes": 1}, "h9rd8lu": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rd8lu/", "text": "The premise of “they should suffer if I suffer “ is as old as human nature. It’s “cooler” when you struggle and succeed in the end. Everyone wants the disney story. I would just not share that info, simple as that.", "author": "timmy_42", "created": 1629525801, "upvotes": 3}, "h9rd48x": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rd48x/", "text": "So with you getting everything paid for, having a roof over your head for free, probably get your food cooked for you too, not having even a part time job, you should literally have no worries in life, but school.\n\nWith that, I doubt many women or men find this attractive because you aren't being independent meaning you have to have someone else take care of you, so why would they think you could take care of them? I'm not trying to be judgmental, but this is how I am thinking of it.\n\nBecause you only have one priority, I would say you should be absolutely dominating your classes with outstanding grades and possibly even taking on extracurricular activities. If you aren't, then compare yourself to your friend who has student loans, paying for rent, paying for her own meals, etc., and she is somehow carrying this 3.0 GPA....Well, that's a lot better than you having everything taken care of and you getting a 3.7 GPA.\n\nWhen it comes down to it, she will be able to succeed with pressure on her. She knows this because she is doing it right now and her grades are the proof. That is what employers, peers, and subordinates want to see.\n\nOf course, you could say you did the same stuff as she did (paid for your own bills, took care of yourself, etc.), but I think it would show when you did get the job, or you did start trying to date while working 40 hours a week, and you start breaking down.\n\nYou're in your developmental years where you learn how to be an adult and how to adjust to this thing we call life. Sure you may have it easier now, but there's a reason why so many parents don't coddle their child as soon as they hit 18 or graduate high school. It isn't bad parenting. It is learning how to live on your own.\n\nI worked since I was 16 and before I graduated high school I had 3 jobs. Dropped everything and joined the military. Now have certifications, 90% done with a degree (3.8 GPA), while working on two other degrees, and work a 24/7 job as a soldier.\n\nMy father threatened to kick me out of his house if I didn't get a job at 16. By 17, I was driving and paying rent. As a kid, I was given chores and was paid for it. (a bag of leaves was $1 and in the fall I hustled. Made a good $20/day working from 6am to 8pm)\n\nMy point is, could I have been where I am doing as much as I am right now if my father didn't raise me how he did? Absolutely not. No way. I've gotten more ambitious as the years passed by and am now coming up on my 22nd birthday. I hope to have a PhD before 30 and am making beyond 125k supporting a wife that I married early this year and a child that I plan on having next year.\n\nWhat you have right now isn't luck at all. I would in fact call it a sabotage because you aren't learning anything different than when you were a child/teenager. Your dad could ride this out until the day he dies, then you inherit everything he has including the house. Possibly might not even need to work. Is this luck? Is that the dream life everyone wants? The simplest road a person can take would be that. That's not at all what I would want especially if I were to have kids. My kids would learn the exact same thing as I learned from my father weather that be your dad or my dad.\n\nNext thing I know, my own kid is getting picked on and he hates me because I don't want him to work or be independent. Than with you as a father, how would you even educate him? You would just teach him what your father taught you because that is what we do as a generation. We just pass knowledge down.", "author": "xXTinyTotzXx", "created": 1629525711, "upvotes": 1}, "h9rd1ob": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rd1ob/", "text": "IMO, those people/friends are envious that your parent support your education. I would too if I were them. \n\nIn this world, some parent won’t pay for there child to go to college. Once they 18, some parent would kick there kids out of there house. Which then put them in a bind on what to do.  There choices are limited to enlisting to the military, finding a job or go to college which a full scholarship.\n\nMy high school teacher once said , take advantage of what your parent offer. As you wouldn’t have it in the future.\n\nAs for me, I got my A.S in compsci a year ago. It took me 5 year because I was mostly part-time. The reason why I was part time, cause I get ZERO financial aid. I lived with my parents, but I also help them with there business. Currently I’m getting my B.S , but my father apply a loan on my name. So, once’s I graduate I’ll be in debt", "author": "Likethisname", "created": 1629525658, "upvotes": 1}, "h9rczp5": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rczp5/", "text": "It’s not you, it’s the system.\n\nIt is impossible for a full time student to fully fund themselves without unhealthy exhaustion and loans.  We are no longer at the societal point where that is remotely possible.\n\nThe sad reality is that some parents can financially get their kids through this situation and do, while some can, but don’t.  Some parents cannot financially get their kids through this situation, but would if they could, and some wouldn’t.\n\nBeing in as much debt and being as overworked as we are is not normal and it should not be this way.  Your dad recognizes this and is giving you the debt free, financially comfortable life a lot of students already get in other progressive countries.  What you have is what all students deserve.\n\nIt is very hard to see people who have the life you deserve, while you’re struggling to stay afloat.  So I feel for your friends.  However, it’s nothing personal to you.\n\nTo make themselves feel better about the absurd loans and long minimum wage hours, they say these mean things to you.\n\nI have friends in countries where their college tuition is free and their parents are legally obligated to pay for their living expenses until they graduate.  In these places it is extremely abnormal for students to have jobs.  Not only are they incredibly successful, well educated, happy, and not-exhausted, but their countries are doing much better.\n\n*I assumed you were American given that we have this notorious problem and attitude here, so forgive me if you are not.\n\n** I am also aware that it is technically possible to get through college without loans and exhaustion alone via scholarships and financial aid.  There’s not enough scholarships for everyone to do this, or else college would be cheap/free.  I believe everyone deserves an education, so frankly, I don’t care if it’s technically possible.", "author": "blahblahplahpoo", "created": 1629525618, "upvotes": 6}, "h9rcnle": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rcnle/", "text": "People are jealous - and rightfully so, the situation you are in is a dream that most people do not have the luxury of ever experiencing - but that doesn’t mean you’re in the wrong. Just make sure you don’t come off bragging. Having to take out loans and be in debt is a struggle, and people are trying to cope with that struggle. Speaking to you in that way may be part of their coping, even if it is wrong. \n\nYour dad is awesome and just because you’re not the most independent adult-y adult at 24 years old in grad school doesn’t mean there’s anything wrong with you. Having your college finances paid will make it much easier to actually be independent when you get that engineering job. Make sure to thank your parents.", "author": "treehugger417", "created": 1629525371, "upvotes": 1}, "h9rcdqr": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rcdqr/", "text": "I’m kind of in the same boat and just recently got a job as a Behavior Technician for my field as a 23 year old so at least I don’t feel too bad about still living at home and having my parents care for me. I don’t find it too much of an issue because I’m not mooching off of them. I pay for groceries every now and then, clean, make dinner every night, and I am the caretaker for my grandparents.\n\nI wouldn’t tell people about this aspect of your life because people tend to get offended easily when they feel as if they struggled more than you financially and are more deserving of any type of aide (not just financially). Some people just take things personally when certain situations don’t even apply to them. If your family is willing to support you and all is fine within the household then don’t worry too much about it. Keep an eye out for jobs though when you’re all done with your education so you can apply to some good ones when you get around it. It’s always a good idea to prepare.", "author": "TheRestIs_Confetti", "created": 1629525173, "upvotes": 1}, "h9rc8eb": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rc8eb/", "text": "I’m in the same position as you. I felt so pressured one time that I got a full time job while doing full time classes and it was so hard to manage both effectively that it ruined my grades :/ Don’t make the same mistake as I did.\n\nIf you don’t mind me asking, are you Asian possibly? \n\nReason I asked is because it’s somewhat of an Asian culture thing for adults to still live with their parents until they get married. I’m Asian, so I explain this to people and some of them understand.", "author": "mango_mochi95", "created": 1629525066, "upvotes": 1}, "h9rbdcb": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rbdcb/", "text": "Having your parents pay for your tuition is a blessing, and it seems you’re making great use of it. Just because everyone else is struggling doesn’t mean you have to. Continue to work hard and make your dad proud by making something of it.", "author": "Comfortable-Soup8150", "created": 1629524445, "upvotes": 2}, "h9rb11z": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9rb11z/", "text": "Just stop telling people all of this information? It’s none of their business", "author": "Blackberries11", "created": 1629524202, "upvotes": 1}, "h9r9lyt": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r9lyt/", "text": "Don’t feel bad, many of us are in a similar situation too. Just need to understand that we are very privileged over our peers and need to be considerate of them. With the high expense of school, you should feel lucky that you have this opportunity as it seems your friends are more envious of your situation (and I think that’s fine for them).\n\nAll I would say is offer your kids the same opportunity if you can afford it or if you don’t have kids, pay it forward in some way to the next generation. No need to waste money or go into debt. Once you have a salary at a job, you’ll be financially independent anyway.", "author": "thejman1208", "created": 1629523223, "upvotes": 1}, "h9r9e5i": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r9e5i/", "text": "Misery loves company. Fuck them.", "author": "orangeblackteal", "created": 1629523077, "upvotes": 2}, "h9r8l9y": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r8l9y/", "text": "People feel resentment towards you because it doesn’t feel fair to them that they have to work their asses off and stress about money constantly and you don’t have to. Even though there’s not really anything wrong with your parents paying your way (although you should be building credit in your name and building up actual work experience), it will make people angry that they don’t have it as easy as you do in life. \n\nI have a very close friend who was like you when we were in college. She had never worked a day in her life at age 21. Anything she wanted at all, her parents paid for for her, even if it was $10. Meanwhile, I was working three jobs and in school full time. Yeah, it fucking sucked to have to go through all of that and pinch every penny and have to constantly see her just using her parent’s credit card to pay for anything at all she wanted. I love her to death, but it’s just not a nice thing to have to experience when you are struggling yourself. Worrying constantly about money can really fuck up your mental health. \n\nMy advice is this: do not mention anything about your finances to your friends, and don’t act like you understand the financial problems that they have to face. You are very very very privileged. If your friends are complaining about bills or rent or loans, just be quiet. Also, start building credit in your own name. The comments that you are not independent are accurate. You should consider taking some steps to at least experience a little bit of independence from your dad. You don’t want to be moving out in a couple of years having no idea how to pay a utility bill or how to do your taxes in your mid 20s.", "author": "numberthangold", "created": 1629522532, "upvotes": 1}, "h9r8dqm": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r8dqm/", "text": "Usually the answer that everyone is just envious and you are in the right is wrong, but you are 100% not doing anything bad, in fact this should be the normal.", "author": "Vexerius", "created": 1629522391, "upvotes": 1}, "h9r7y7b": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r7y7b/", "text": "I’m in the same situation, I’m a sophomore though. I do work two jobs during the summer to help pay for stuff I want and this year I saved up for my rent since my college is an hour from home, some people just like to make you feel bad though. I generally don’t mention it and when I do I try to be low key and direct attention to the other person. I don’t always feel like I’m being prepared to adult but my parents are giving me a huge gift so I’m trying my best not to waste it and I try to still learn about finances so that when I am independent I don’t waste what they have given me by being dumb with money", "author": "ajbear01", "created": 1629522104, "upvotes": 2}, "h9r7o1m": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r7o1m/", "text": "Personal opinion, the smart thing to do is take advantage of the recourses allocated to you. If someone offered to pay for my living expenses while I put my all into education to better prepare myself for the future, hell yeah I'm jumping on that bandwagon. The only thing I would worry about is money management, it is a really good skill to have and probably the biggest thing I would see you missing out on (that comes to mind right now). People are going to be jealous, it's a blessing to have the stress of money elevated off of your shoulders. That's my logistical side to it, so long story short. Accept help from others, I believe it would be foolish not to accept help from others.  \n\n\n On the morality side of things (this is personal morals so feel free to disregard this next part) Don't bring up the fact that you are being funded, I see it as a respectful thing for the sake of others' minds. If someone asks then I wouldn't lie, I'd just make sure I throw in there how beyond grateful and in debt you feel to your father for the support. If they are friends then regardless of whether they are jelious or not they should attempt to be happy for you as this is a wonderful thing to happen to someone. That's just a personal view on the matter so take it for what you will.", "author": "Brycemaniac", "created": 1629521916, "upvotes": 1}, "h9r7dqp": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r7dqp/", "text": "You are lucky and should enjoy it. Be a little discreet about it because others may have to work to pay their bills. It might be good to get summer jobs or an internship so you can at least buy your own clothes and have spending cash and it can also help you gain experience before you graduate. Maybe even save money from a job so when you do have bills, you have a little bit of savings already. Make use of this time and appreciate your dad for his help.", "author": "poliomikayla", "created": 1629521728, "upvotes": 1}, "h9r6bcb": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r6bcb/", "text": "\"You should take out loans like ME instead of your Dad paying tuition\"\n\nFuck. That. Shit.\nDon't go into debt because someone wants a pissing match with you.", "author": "im_not_really_batman", "created": 1629521055, "upvotes": 16}, "h9r5nfk": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r5nfk/", "text": "Stop caring about what other people think. They are just insecure because you are in a better standing than them.", "author": "sirNameless_0", "created": 1629520640, "upvotes": 7}, "h9r5jyk": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r5jyk/", "text": "People talk like they actually want to work at a McDonald's while being in college....I am sure 99 out of 100 would take the easy way if it was offered to them. You have nothing to be ashamed of. Just be grateful and make the best of it", "author": "DieSchungel1234", "created": 1629520580, "upvotes": 5}, "h9r5fyy": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r5fyy/", "text": "Hey dude honestly fuck them. I was in a similar situation when I was in college. My parents funded everything for me because they wanted me to get my degree and I just got it. People will envy you if you’re doing better than them. Just do you and finish school.", "author": "Common-Few", "created": 1629520514, "upvotes": 4}, "h9r5f2l": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r5f2l/", "text": "I'm in a similar position. Currently 26, working on my bachelor's in accounting and I don't work. I try not to really let people know too much about it to avoid hearing them make a stink and it's also none of their business. \nIt is a privilege and maybe you are losing some independence or life experience, but why should life be made harder than necessary? \nI do try to show my appreciation by trying to keep the house clean so my parents have to do less at home, and helping out with my mom's small business. \nDon't worry about what others think, you are a real adult, just make sure you're able to stand on your own when it's time.", "author": "Tola_Chola", "created": 1629520499, "upvotes": 1}, "h9r5epk": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r5epk/", "text": "They are simply jealous. What is wrong with taking your family's support if they can afford it?", "author": "OkMolasses2853", "created": 1629520493, "upvotes": 1}, "h9r4fkc": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r4fkc/", "text": "Don't let their negative comments get to you, they just envy you. Your dad is doing what any decent and financially capable parent would do. I promise you, as a student that will be taking out loans, that if their parents offered them the same opportunity they would take it with no questions asked. Just keep crushing those classes and secure that degree!", "author": "toofeduptocare", "created": 1629519896, "upvotes": 5}, "h9r4a4h": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r4a4h/", "text": "They’re jealous. Just don’t flaunt/brag. And if you are worried just plan on paying it forward if you have kids", "author": "SpartanElitism", "created": 1629519806, "upvotes": 1}, "h9r35k4": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r35k4/", "text": "If your parent is able to support you financially until you can get a career, that's a blessing! As long as you're not taking advantage and it isn't putting your dad in a tough financial situation then do it.  \n\nSo many people have the \"suffer to live\" mindset and feel like others shouldn't have it \"easy\" because they didn't.  Don't put yourself into debt just because other people are too.  Your dad seems content and supportive of your academic career.  Just be mindful that you're very lucky.  Many parents make sacrifices for their children and don't end up being able to do such a thing for their own.", "author": "norcalturtle222", "created": 1629519140, "upvotes": 8}, "h9r2zkx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r2zkx/", "text": "Also don't be an idiot and take out loans unless it's needed", "author": "EboyEman", "created": 1629519042, "upvotes": 2}, "h9r2pp8": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r2pp8/", "text": "I’m jealous as hell. I had to take out 70k in loans for just living costs. Thank your dad and live your best privileged ass life. You were born into a dream family where you can shoot for the stars because you have no worries. If I didn’t take out those loans I would have been homeless you never have to worry about homeless because you have your dads. Be grateful and thank your dad. Live your dream life.", "author": "beanie1816", "created": 1629518878, "upvotes": -7}, "h9r2g3v": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r2g3v/", "text": "I don’t see an issue with your parents supporting you or you talking about your situation when you feel comfortable to do so. That said, do keep in mind that others are not as fortunate so talking about your situation to them is much more likely to come off as bragging no matter how you say it. \n\nThere is a point to be made regarding independence and learning normal adult things. Getting experience paying your own bills, keeping a job, taking care of yourself - these are all things that you have to learn eventually. Your dad fully funding you *is* taking away that experience from you. What happens when you graduate and are fully on your own? Are you going to be prepared? What are you doing now to ensure that you are? You’re going to be taking on a full-time job, your own bills, and your own housing all at once. \n\nThe comment about taking out loans and paying your own way is a bit extreme. You should not take on debt when it’s not necessary. But it is smart to look at what lines of credit you have open and how you are building your credit score (if you are in the US) so that you can qualify for big items in the future, I. E. Car, apartment, house.", "author": "persephone_24", "created": 1629518720, "upvotes": 1}, "h9r1n8m": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r1n8m/", "text": "If that’s one of the first few topic that you bring up when talking to people, it can be seen as bragging to those that don’t have the same type of funding as you. I hope you can see that those people clearly have it harder than you needing to do around the same amount of work as you do, but also need to worry about paying for it out of their own pocket, don’t bring that topic up, people get easily envious of those having it easier than them.", "author": "NFC818231", "created": 1629518250, "upvotes": 1}, "h9r1ctq": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r1ctq/", "text": "Sounds like most of them are jealous or aren’t mature enough to separate their emotions from fact. \n\nThis is proven by their opinions changing just with that knowledge as if it was true they would have brought it up before you mentioned it.\n\nAs others have said tho I would not discuss it. I am personally in the same boat. I see how much harder it is to work and do well in school and I have respect for those who do. But I also have respect for myself and realize how much maturity it takes to focus on school and not just screw off. Working and school/ bills really takes no more maturity but instead will and effort in different respects.", "author": "LPKKiller", "created": 1629518084, "upvotes": 1}, "h9r130g": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r130g/", "text": "people who struggle envy people who don’t, i’m not saying you aren’t but be grateful :)", "author": "No-Archer7267", "created": 1629517928, "upvotes": 2}, "h9r0yqt": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r0yqt/", "text": ">  I have had people/friends legit get mad, telling me I am not independent, I will struggle in life, I need to be a real adult and work while doing school like everyone else, ect. \n\nNone of their business, and nothing to get mad at. I don’t even speak to my parents, and have been pulling myself by my bootstraps out of poverty these past few years because my family is worthless. The fact that your dad sounds wonderful doesn’t bother me, because it shouldn’t.\n\n> My friend told me I should take out loans like her \n\nBeing buried in debt is not the same as independence. And if she is telling you to take out nondischargeable debt out of spite, she doesn’t sound like a friend.", "author": "ACaffeinatedWandress", "created": 1629517860, "upvotes": 4}, "h9r0phk": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r0phk/", "text": "If he can afford it, good for you there’s nothing wrong with that.\n\nI’d suggest building some credit if you haven’t already. It’ll pay big dividends down the line when you’re on your own.", "author": "lanceparth", "created": 1629517716, "upvotes": 1}, "h9r0n1p": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r0n1p/", "text": "Jealousy can be an ugly thing, so some info must be kept on the down low.  Enjoy the great opportunity you have to devote yourself to your studies, and don’t worry, you will be and are a fine adult.", "author": "Groove4Him", "created": 1629517677, "upvotes": 1}, "h9r0kut": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r0kut/", "text": "Fuck social pressure, do whatever that makes you most comfortable. It’s a privilege, take advantage of it and enjoy your life.", "author": "Affectionate-Candy-2", "created": 1629517642, "upvotes": 1}, "h9r0kfk": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r0kfk/", "text": "I do think it will be a major adjustment to learn how to budget, spend,  build your credit score,  build a resume, etc. You may come out of this with a great degree and no student debt (which is wonderful), but you will be at a disadvantage in other areas (namely work experience, credit score,  and life skills). That said,  best of luck to you and the fact that you are talking about and questioning this shows good motivation and a desire to be successful.", "author": "rural_life_goals", "created": 1629517635, "upvotes": 7}, "h9r0h6h": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r0h6h/", "text": "Generational wealth is a problem for a lot of us. People are struggling. Glad you're fortunate, but keep it to yourself.", "author": "Decker-the-Dude", "created": 1629517584, "upvotes": 3}, "h9r0gik": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9r0gik/", "text": "I was in a similar position as u during undergrad except I lived on campus and paid most of my nonessential items. My parents paid for housing, tuition so I didn't have loans, school supplies, medical supplies and I got a quarterly allowance. They also didn't want me to work at all until I was done with school, but personally I really really wanted to be as independent as possible, partially because I felt behind many of my peers who didn't have a lot of their expenses covered by parents, so I gradually started paying my own medical expenses and some school supplies without telling them.\n\nI can definitely feel being uncomfortable about people delving into your financial life tho and I usually feel very guilty knowing I had that privilege many don't. Definitely nothing wrong with parents paying for your expenses, as long as you have plans to manage them afterwards etc as others have said. Overall I kinda just heavily downplay how much my parents supported me and I never brought it up first to people cuz most will feel jealous and react pretty negatively about it", "author": "maverna_c", "created": 1629517574, "upvotes": 1}, "h9qzw3c": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qzw3c/", "text": "I am 21 and still in school. My parent did it with my brother and I (just currently me for the now since my brother is doing his residency, I think). I won't go around boosting about though I kinda of admitted something similar but we needed for a class project (We were more or less pretending that the project was real so I don't know if it counts). I just generalized/vaguely mentioned it by saying that my parents let me live at home when I am studying.\n\nTBH: I feel a bit guilty because I using their money for the time being. When I graduated high school, I wanted to get a job or join to military and then go to school so that I could pay for school myself and not bother them (and to build my resume) but they (and people around me) seemed to encourage me to school a bit too much.", "author": "Legolas0170", "created": 1629517258, "upvotes": 2}, "h9qzttx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qzttx/", "text": "There’s no problem with it. Finish school and get your own job and start becoming independent. No need to be a debt slave. It’s a sad society where everyone is crippled and families are broken and kids are raised poorly and the system itself gouges everyone on top. \n\nThese people’s reaction comes from a place of conditioning and bias. There’s a difference between parent supporting you through school and being 30 or 35 and dependent", "author": "Relrik", "created": 1629517223, "upvotes": 3}, "h9qzpa2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qzpa2/", "text": "Fuck the haters, keep doing you.\n\nA thing to note, three topics to avoid:\n\n- Money\n- Politics \n- Religion\n\nEveryone has different beliefs and financial backgrounds so best to avoid all three to avoid conflict.", "author": "ShadowIG", "created": 1629517150, "upvotes": 6}, "h9qzexh": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qzexh/", "text": "Honestly who cares if he pays I don’t see why that should bother anyone if they were your “friends” it shouldn’t bother them either since it has absolutely nothing to do with them. As long as you’re not bragging and being rude about it- it shouldn’t matter fr", "author": "Littledre15", "created": 1629516988, "upvotes": 2}, "h9qymne": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qymne/", "text": "Yeah man at 24...*you* personally should be seeking some independence and responsibility. I believe in helping out your kids, but I also believe in letting them grow up. If something were to happen to him and you were left fending for yourself, you would have no clue how to operate in the real world.\n\nHow can you make mistakes, learn from them, and grow, if he doesn't let you?", "author": "LeHaitian", "created": 1629516559, "upvotes": 5}, "h9qy9bx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qy9bx/", "text": "Don’t know why you told people this in the first place. But it is good your dad funds you hope you have all your money in the market so you have a good chunk when you are independent.", "author": "ORCA_OF_WALLST", "created": 1629516355, "upvotes": 1}, "h9qy0gm": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qy0gm/", "text": "As a college student (24 as well) who lives at home and is working on getting a license to drive themselves, I get where you are coming from. I had to take out loans but that's because my parents arent in a position to pay for my college. College is not cookie cutter experience where you go in at 18, live in a dorm, join one of the cults, and graduate at 22 after 4 heavy years of drinking, parties, late night studying, and whatever else comes to mind.\n\nIts great that your dad wants you to focus on college while you are studying cause not everyone has that luxury. If they have a problem with it than that's on them. You shouldn't be ashamed of what you do or how you're getting through college. \n\nMy brother is an engineer major and he has been doing internships with companies (which gain him valuable experience and potential jobs). You may want to look into that to give you a headstart on your path to finishing.  Good luck with it all.", "author": "The_Lady_in_Boots", "created": 1629516220, "upvotes": 4}, "h9qx338": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qx338/", "text": "It's great your father is doing this. Personally this is how i would like for my children to go through college. Debt and worry free, especially studying full time. It can be exhausting.", "author": "Peace_Pea69", "created": 1629515714, "upvotes": 4}, "h9qx0nn": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qx0nn/", "text": "They are just haters. Most people can go to college for pretty cheap if they do it smart way ie. not going out of state, not going to expensive schools for regular degrees. So if anyone is giving you a hard time about it don’t mind them. Their poorly planned college expense is kinda their fault especially with the abundance of people who advocate for going to college the cheaper route. But you also shouldn’t be sharing this imo.", "author": "desjb18", "created": 1629515677, "upvotes": 5}, "h9qwhoo": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qwhoo/", "text": "1) Don’t offer this info to people. They don’t need to know how you pay for school and it’s none of their business. It’s just going to make some people resent you and be jealous of your situation. \n\n2) If you aren’t doing some sort of work (researching under a mentor, on campus job, internship, whatever), you should at least do something that will show employers that you know how to be an employee. You can have all the schooling in world and if you don’t have any applicable practiced skills, people won’t hire you. Having a job is nothing like school and you need to have an education as well as experience that demonstrates you can be a good, reliable employee. Even if it’s a part-time job in retail.", "author": "Dont_Blink__", "created": 1629515397, "upvotes": 4}, "h9qw7ar": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qw7ar/", "text": "The only issue I’ve ever had with students who don’t pay their own bills is when they try and argue with people who are gonna have debt about how college shouldn’t be more affordable. Otherwise if it’s your situation you can acknowledge your privilege without feeling guilty about it.", "author": "anonymous_gam", "created": 1629515243, "upvotes": 9}, "h9qw75j": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qw75j/", "text": "Your friends are honestly just jealous that you don't have to take out loans like them. Your dad seems to care about you a lot. Just focus on your studies and make sure to pay him back later on.", "author": "kyllua16", "created": 1629515241, "upvotes": 1}, "h9qvui8": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qvui8/", "text": "NTA. They're jealoys and upset they don't have that luxury.\n\nI would kill for my college and bills to be fully paid by soneone else and I already have a pretty good scholarship.", "author": "lynn378", "created": 1629515056, "upvotes": 4}, "h9qvt2o": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qvt2o/", "text": "Don't tell your peers", "author": "Comprehensive-Let884", "created": 1629515035, "upvotes": 1}, "h9qvcwv": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qvcwv/", "text": "I wouldn’t tell anyone any specific details about what your dad supplies. Just be very broad if they ask why you live at home and say it’s because it’s easier for your family or something. You don’t owe anyone a full infomercial about yours family’s income/ social class etc. As for your friend telling you you need to be more independent, I wouldn’t listen to anyone outside of your family regarding personal financial advice. For starters advising someone to take out unnecessary loans for no reason is absolutely horrible advice and can cause tremendous damage to yourself finically in the future. The bottom line is your friends won’t be affected by your financial decisions so they won’t suffer from their bad financial advise the same way you will.  Therefore they are more likely to be jealous/give bad advice because they aren’t benefiting at all and don’t feel as important. You sound like your an educated person so I would continue to use your own judgement as well as educate yourself more about personal finances, it’s never to early to practice budgeting  as well even if you aren’t totally affected by your expenses.", "author": "chefski02", "created": 1629514804, "upvotes": 2}, "h9qv9je": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qv9je/", "text": "Don’t struggle when you don’t have to. As long as this is part of a plan to move forward that’s all that matters.", "author": "AppleTreeBloom", "created": 1629514755, "upvotes": 7}, "h9qv8f1": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qv8f1/", "text": "I wouldn’t bring up your situation voluntarily without being asked, not because there’s anything wrong with it, but because it’s no one else’s concern. Having said that, I don’t see anything wrong with what you have going on. Everyone is different, and people live in different situations. \n\nI wouldn’t listen to the comments people make about how you have things arranged. In my opinion, if you are in graduate school for engineering, you are likely reasonably responsible and will be able to function in the “real world” once you learn a few things.", "author": "115machine", "created": 1629514738, "upvotes": 1}, "h9qv18w": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qv18w/", "text": "All I’m gonna say, as someone with the complete opposite experience, is milk that shit for as long as you fucking can.", "author": "redactedname87", "created": 1629514633, "upvotes": 1}, "h9qu33z": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qu33z/", "text": "Nah they sound jealous ignore them", "author": "thorppeed", "created": 1629514149, "upvotes": 3}, "h9qtulr": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qtulr/", "text": "They are jealous of your situation, and they are going to attempt to elevate themselves in their minds by putting you down. Don't answer personal questions like that.\n\nMy parents are doing the same for me. I'm quite thrifty, and they have me on as an authorized user of one of their cards. They pay my school expenses, books, computer, since that is not considered a gift under estate taxes. And they give me the max cash gift allowable without estate tax kicking in. The CPA calls this estate planning. \n\nDon't pay any more attention to people who criticize. Your job is working for your grades.", "author": "CindsSurprise", "created": 1629514032, "upvotes": 17}, "h9qtsrw": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qtsrw/", "text": "From the comments I can see alot of varying opinions with this. I think it's fine just be mindful that alot of people aren't in your situation. Besides that I think its absolutely fine if you're not independent either. Especially if you have a good relationship with your father. I'm in a similar situation but with just my mom but we get along great and she says she is happy to fund college until its done. If someone is telling you to struggle because it will make you better I think it's down right ridiculous. That's like saying burn yourself to get used to it. No it's gonna sting every damn time lol.", "author": "BraveUnion", "created": 1629514007, "upvotes": 6}, "h9qthsv": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qthsv/", "text": "It sounds like they’re bitter. And our society is kind of obsessed with suffering and the virtue of suffering that even billionaires will try to make it seem like they’ve come from terrible backgrounds. It’s so weird how our relationship with suffering is.\n\nThe difference between struggling on your own and receiving a lot of support is that struggling on your own forces you to figure things out whereas when you receive lots of support, it’s more of an option. Some people might be genuinely concerned but it sounds like their comments are coming from a place of jealousy. The support you’re receiving from your father offers you a chance to still take the initiative to gain some skills on your own but the difference is that you actively have to learn, like start getting an idea of finance and things like that. And the good thing is you can do this without the stress of having to do it.", "author": "strawberrysweetpea", "created": 1629513853, "upvotes": 86}, "h9qthrp": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qthrp/", "text": "I used to think like this when I was a kid. I would get jealous when my peers get everything because they have rich parents. But I've grown to understand that it's usually what the parents want to to, and if I become a parent one day and have the opportunity to, I'd prolly do the same thing. So, as long as your not pretentious about it, there's nothing wrong with having your dad funding you. But try to ignore what your peers are sayin, they prolly just don't know any better...", "author": "Lfaruqui", "created": 1629513852, "upvotes": 67}, "h9qt8g2": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qt8g2/", "text": "Enjoy your privilege. Please. So many don’t have it as good and so many have it even better. Just enjoy what fortunes you do have in this life. You shouldn’t feel wrong or guilty. Live your happy life and enjoy your blessings. Bask in it even. Brag online or to yourself. Enjoy your privilege all the way through and die guilt free. This life is but a moment and you are not hurting others.", "author": "PhantomJellyFish", "created": 1629513719, "upvotes": 131}, "h9qsiqr": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qsiqr/", "text": "Why the hell is this a topic of conversation with people. I’d tell them it’s none of your business", "author": "NoOutlandishness9892", "created": 1629513358, "upvotes": 7}, "h9qs6jy": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qs6jy/", "text": "You don’t have to tell people how you pay for school. Some people will always be dramatic and have negative opinions about everything that someone else does.", "author": "Fleur498", "created": 1629513191, "upvotes": 8}, "h9qrsfn": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qrsfn/", "text": "Faculty here so it probably doesn't mean much.\n\nUnless your peers are offering to pay for your education, it's not their place to judge or say who should or shouldn't pay for it. Your priority right now is your role as a student. Use whatever resources you can get your hands on. If your dad is willing to pay for it, great. If you got on a scholarship, great. If you have a grant, even better. Paying for college yourself doesn't make your degree any better or worse. You either learned something useful or you didn't. Who the hell cares who is paying for it.\n\nThat said, look for a job or an internship, hopefully in your field. Not so much as to pay for things, but it'll help you in the long run, especially if it's in your field of study.", "author": "ceti_alpha_v", "created": 1629512997, "upvotes": 197}, "h9qrqzx": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qrqzx/", "text": "Your dad is right, but in my own opinion how do you learn from life's lessons and hardship if he holds your hand every step of the way. When you do become an engineer you would have gone through different things than most others do. I recommend having plan and trying to understand stuff if your dad wasnt there.", "author": "nathanielx9", "created": 1629512977, "upvotes": 10}, "h9qq3g7": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qq3g7/", "text": "Who cares what they believe you should be doing. Your dad loves you very much and is willing to support you throughout college. Ignore them. If they were in your situation they wouldn’t deny parental support. Enjoy it but make sure you’re educated on money management.", "author": "GodOfThunder101", "created": 1629512170, "upvotes": 14}, "h9qpydd": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qpydd/", "text": "If your parents can pay for you and are willing to do it, then there is nothing wrong with it. Just focus on your goals and don't care about what other people think.", "author": "therealpj24", "created": 1629512102, "upvotes": 15}, "h9qoak3": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qoak3/", "text": "You probably should still get an internship or something. Almost no jobs will hire anyone with no experience, nowadays the expectation is that everyone has had at least one internship and usually more.", "author": "ilikecacti2", "created": 1629511320, "upvotes": 1}, "h9qo1lw": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qo1lw/", "text": "Why do you care about what other people think about you? Sounds like you hit the jackpot. Enjoy it", "author": "psychadella", "created": 1629511204, "upvotes": 39}, "h9qnaqq": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qnaqq/", "text": "Don’t tell people you have money like that", "author": "Rickysmalls1010-", "created": 1629510847, "upvotes": 9}, "h9qmyyw": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qmyyw/", "text": "Because the more I read your comments in this you sound like you are being boastful... And don't realize how lucky you are. That generally is going to infuriate people who aren't as lucky as you. Acknowledge your privilege", "author": "veanell", "created": 1629510687, "upvotes": 9}, "h9qmph0": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qmph0/", "text": "I envy you. I’m 25, a junior, and have to work full time on the weekends. My dad still pays my tuition and helps me with rent though. I wish I could live at home but my dad and stepmom won’t allow it.\n\nDon’t feel bad about it man. I mean if he’s offering it you’d be a damn fool to decline it. You’re already an engineering grad student. Trust me you are gonna get paid fat when you are done with school. Don’t stress it. Your friends are jealous. You are doing nothing wrong.", "author": "VoiceofReason541", "created": 1629510556, "upvotes": 410}, "h9qm19l": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qm19l/", "text": "Just be discreet about it.", "author": "vedasiw", "created": 1629510230, "upvotes": 34}, "h9qlmj3": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qlmj3/", "text": "If you are lucky enough to be in a situation where your bills are all handled for you and this allows for you not to take out loans, then that’s fantastic for you. But you have to recognize that most of the people that you are talking to are not in that situation and it can seem like you’re bragging. \nI’m not saying you’re in the wrong, but if the comments are getting to you then I would be careful about broadcasting your finance-free life in one of the most financially stressful times of most people’s lives. \n\nAs for the mindset as a whole, you’re definitely not independent by any means. Being fully funded = being dependent. I do personally think that working and managing bills are monumentally important parts of the maturation process, but I also believe that students shouldn’t be drowning in debt just to get an education so it’s really up to you and what you think is wise in your own situation", "author": "inkedplanets", "created": 1629510028, "upvotes": 323}, "h9qk4d1": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qk4d1/", "text": "The people who tell you to take out loans are ridiculous and jealous of your situation. They feel they worked hard and they are jealous to see you getting it for free. Why would you take out loans? At that rate I’d call them a fucking idiot. \n\nJust don’t come off like you’re bragging. Maybe don’t tell people about how you pay for school since some people get weird with this stuff.", "author": "Nofapdeity", "created": 1629509298, "upvotes": 38}, "h9qjpkh": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qjpkh/", "text": "Try not to talk about your finances with others. Its not bad that your parents are supporting you as long as you have a plan once you get your degree", "author": "GoldRequest", "created": 1629509103, "upvotes": 781}, "h9qj2a7": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qj2a7/", "text": "I’m saying this from the perspective of having parents who couldn’t/didn’t/both for my college funds, so I had to take on debt myself at 18. This is common for those who feel they can seek higher education. These people have to pay for it, hence you see student-work programs and people working off campus. You CAN do this, as you said you did, for fun, for experience, for connection, but you don’t HAVE to. You won’t die if you don’t. Your friends will. They have to work to sustain themselves, like most people. They have practice at this. They are likely worried that you won’t have enough practice with working and thus won’t do well being an employee and that you won’t want to because you have someone to fall back on. \n\nIt sounds like your family has a decent amount of money and your friend’s families don’t. This is not your fault or theirs, but it is incredibly tone deaf to go around telling you friends that money doesn’t rule your life, when most of your friends will be in at LEAST college debt for an average of a decade. Money rules their lives because they don’t have the luxuries you do, and it can be very hurtful to tell them things like this, even from a kind/neutral place. It points out a lot of inequity within higher education when they just want to see you as their friend.", "author": "OddExpressions", "created": 1629508786, "upvotes": 26}, "h9qh025": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qh025/", "text": "I mean your friend is right you’re not an independent. You fully rely on your dad, you are dependent of him. I feel as though you sound very privileged and it sucks (as someone who’s not) but some people are just as privileged as you. Never having experience paying bills and being responsible for your spending could backfire on you though, depending on your knowledge of finances and what you have learned about expenses and budgeting.", "author": "Concerned-23", "created": 1629507802, "upvotes": 32}, "h9qgslh": {"link": "/r/college/comments/p8hwkf/my_dad_fully_funds_me_while_im_in_school_and/h9qgslh/", "text": "I wouldn’t go around telling people this stuff because that’s the reaction you’ll get from people. Just do whatever you want and don’t worry about what others think", "author": "kmurphy798", "created": 1629507707, "upvotes": 1678}}}