{"sid": "oklphx", "link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/", "title:": "My Story of Sexual Assault as a Freshman", "text": "As soon as I felt my eyes open today, I quickly changed the position I was asleep in. \nFor the past 144 days, I would wake up and change the position I was asleep in. Not out of comfort or habit - out of necessity. \n\nBecause that moment, the moment when a person realizes they are awake in bed, the moment they begin their day, the moment that may define their mood for the next few hours, on ______ that was also the moment I could feel real pain - the moment I realized he was inside me. \n\nAnd for the past 5 months, I have begun every morning thinking about that exact moment - feeling the pain and reliving the trauma, everytime I opened my eyes.\n\nDay 1. It was unbearable.\nAt 7am, after running out of his room, the room I had no recollection of coming to, I stared at myself in the mirror and tried to make sense of the hundreds of broken pieces of memories in my head from the night. I didn’t have my bra on. My head was pounding. I had never blacked out before. I had bruises. My underwear was on backwards. Everything hurt. \nAnd it wasn’t until I talked to my friends that I realized the most horrible thing a person can remember - I was raped. \n\nI thought that that day and the next night were the worst night of my life. I thought that it couldn’t get worse than the inability to sleep, the burning, aching pain running through my body, the uncomfortableness I felt being in my own skin, the hatred I felt for myself, the fact that I could only replay him assaulting my passed out self and focus on nothing else, the loneliness I had when I stood in the room at 4am scared to go outside and try to see my friends - knowing he lived near me. And so I cried for hours, staring at the mirror, begging someone to heal my body and mind and pleading the world to go back in time and give me a redo. I thought that was my rock bottom. \n\nTo my dismay, that wasn’t the worst night. The worst came with time. \nExpectations of how one was supposed to heal from this set in. And as days went by, the anger inside me grew. \nI hated the sun for coming up everyday acting like I had the energy to repeat another brutal 24 hours, I despised my classes for continuing when all I could focus on was my pain rather than school, I felt unbearably guilty all the time, and I resented everyone who smiled and went about their life normally without a care in the world. I hated the therapist I was given because i didn’t want to speak to someone who I knew didn’t care. I hated my friends for loving me more than I deserved. But most of all, I hated myself.\nThe person I had become was no longer me. I felt my spark die. I didn’t want to laugh anymore, I didn’t want to exert my energy, i didn’t want to think about anything, and most of all I didn’t want to feel. \nSo I tried not to feel. I drank until I thought the pain would fade, I attached myself onto people who I thought could heal me, I didn’t feel the need to make new friends or be kind to people who I didn’t care about, and I went out thinking I wouldn’t let this affect me for one night. \nI was reckless, unbothered, unmotivated, and numb. And I thought I could make it work. \nBut frankly, I didn’t care if I lived or died. It wasn’t as though death seemed attractive, but more so that with the life that I was living - I felt death couldn’t hurt more than right now. \n\nThen came the night I broke. I was embarrassed, I was hurting, I couldn’t stop thinking about that night on repeat, and I was more in pain than ever before. I could physically feel my mind deactivating my entire body causing my legs to collapse onto the floor of my dorm room. I couldn’t breathe through my tears or be coherent enough to tell my body to inhale. And at that moment on ____, lying on the floor of my messy room in a blue hoodie with leggings, struggling to see, shivering and sweating at the same time, digging my nails into my hand until I bled but not feeling anything, hitting my hand against the tiled floor, \nit felt like I was already dead. \n\nAnd if it weren’t for 4 people who cared about me more than I cared about myself, I very much would be. \n\nI call that my rock bottom. \nAnd it gave me two choices. I could let my trauma define me, control me, even kill me. Or I could grow from here and start being good enough for the people who believed I was good enough to stay with them. \n\nThe hardest decision I made that next day was to wake up. And looking back two months later, it took time and patience, but I am so thankful that I did. \n\nI still fall asleep every night and wake up every morning thinking about that one day. Thinking about the amount of pain I was in, feeling the memory of the pain still. But now I also fall asleep knowing that I am loved. Knowing that I am better than the shitty card I was delt this past year. And knowing that I am stronger than I ever thought I would be. \n\nThis is why I can confidently say that one day, I will no longer have to switch my position when I wake up. My trauma will no longer be residing in my thoughts at all times. This burden will not weigh on me as heavily as it did before. \n\nFor the first time in months, I feel alive again. I feel like myself. And dare I say, I feel happy. \n\nI now speak directly to my assaulter: I will be damned before I give you more time and importance than I already have in this wonderful life I am about to live. \n\nThank you for reading.", "author": "anonymousandhappyy", "created": 1626324701, "retrieved": 1632947776, "over_18": false, "upvotes": 835, "upvote_ratio": 0.93, "comments": {"h5er4tb": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5er4tb/", "text": "That was one of the most beautiful posts I've ever read. What you sent through was horrific, and I'm so sorry for it. But your reaction to it, your courage and your strength, is truly exceptional. You are a brave, good person and a true hero--thank you for sharing your story.", "author": "TennysonOfIthaca", "created": 1626450666, "upvotes": 2}, "h5dpvu5": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5dpvu5/", "text": "What's the difference between being raped and having sex for pleasure?\n\nI get that You don't enjoy the feeling when being rape but people say that their bodies hurt after being raped but isn't it the same process when having sex?\n\nI just don't get how your body hurt after being forced to have sex (raped) but not after having pleasured sex.", "author": "DragRepresentative83", "created": 1626430080, "upvotes": -1}, "h5crx5t": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5crx5t/", "text": "Man, reading your story and some of the comments really got me terrified and sad. I can’t believe these kind of people exist, the ones you confide the most in, the ones that you give your time to and sometimes even the ones you love. I have not been in any situation related to yours but I’m feeling sick just reading what happened. I don’t know you so I can’t really do much for you but I’m always protecting my family, my friends and my loved ones from these type of situations. The trauma, the pain, the blaming yourself, everything triggered by this event are things YOU DONT DESERVE, you deserve to feel happy, comfortable, enjoying your time at college (because for most people it is the best time of their lives) and being loved. I’m truly sorry you went through this and I hope you are on a path to heal completely and move on from this nightmare you’re living. The only thing I can offer you is my direct messages if you ever need to talk to me or if anyone else needs someone to talk please send me a message and I’ll reply as quickly as I can. No one deserves these kind of things in their lives.\n\n\nYOU ARE AMAZING! Keep fighting please you got this! \n\n\nHave a blessed day!", "author": "YourAverageThinker", "created": 1626404904, "upvotes": 2}, "h5c4nd0": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5c4nd0/", "text": "You are such a strong person! Your courage shines through", "author": "KickingCrave", "created": 1626392654, "upvotes": 3}, "h5b98kn": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5b98kn/", "text": "[deleted]", "author": null, "created": 1626378037, "upvotes": 2}, "h5ausxn": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5ausxn/", "text": "you make me want to burn the world to the ground because of humans", "author": "clucks18", "created": 1626371790, "upvotes": 4}, "h5ai0ps": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5ai0ps/", "text": "This was so hard to read. I had to take a break in the middle and come back to it. The impact rape has on a person is no joke, and you are so so incredibly strong. Of course, you don’t have to be strong. You can be vulnerable, and you should take the time you need to heal. Your body will always be your own. Love it, nourish it, be gentle with it. I’m sending you so much love right now.\n\nAnd as for that rapist, I’m praying for his demise. He’s a piece of shit and I really wish colleges would take sexual assault more seriously. I hear about so many girls going to parties and being violated and it almost sounds like…it’s a normal occurrence? I really hate that", "author": "greatmoonlight21", "created": 1626366432, "upvotes": 7}, "h5ah0ai": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5ah0ai/", "text": "I'm so sorry this happened to you. This was written eloquently from a place of newfound power and strength. I am proud of you OP. I wish you more happy days ahead. Keep living and speaking your truth.", "author": "MS001812", "created": 1626365996, "upvotes": 2}, "h5acj1x": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5acj1x/", "text": "Thank you everyone for your support, it means more than I can explain ❤️", "author": "anonymousandhappyy", "created": 1626364034, "upvotes": 10}, "h5a8uz4": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5a8uz4/", "text": "PLEASE KEEP SHARING THIS STORY!!", "author": "klauselijah", "created": 1626362449, "upvotes": 1}, "h5a8t8u": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5a8t8u/", "text": "You are amazing. Never let anyone tell you any less.", "author": "klauselijah", "created": 1626362429, "upvotes": 2}, "h5a8pk6": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5a8pk6/", "text": "i'm sorry OP. i (a guy) was badly molested by three older girls at a campground when I was 13, and i woke up naked in a bathtub at a party with obvious signs of sex all over me when i was 16. because of those two experiences i completely shut down sexually and i have never been in a relationship. i am 33 now and i regret not getting appropriate help. i hope you are doing everything you can to heal. i pray you will be able to trust again", "author": null, "created": 1626362385, "upvotes": 24}, "h5a60rj": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5a60rj/", "text": "I saw it happen to many girls at the dorm. I punched someone off me once at a frat party. This is a huge issue at colleges and literally no one talks about it.", "author": "haveuceena", "created": 1626361213, "upvotes": 9}, "h5a33ym": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5a33ym/", "text": "You are so strong and I really wish you the best. You don’t deserve this at all but I’m so happy that you’re starting to feel happier again. Thank you for sharing this.", "author": "aiznus", "created": 1626359935, "upvotes": 1}, "h59z93l": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h59z93l/", "text": "Much love. You don’t know me and I don’t know you but I am rooting for you. For both of us :)", "author": "maebird-", "created": 1626358190, "upvotes": 1}, "h59rs81": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h59rs81/", "text": "[removed]", "author": null, "created": 1626354624, "upvotes": 1}, "h59me2n": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h59me2n/", "text": "[deleted]", "author": null, "created": 1626351590, "upvotes": -9}, "h59g1q7": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h59g1q7/", "text": "No words.. nothing but LOVE!", "author": "cosmoscubit", "created": 1626347306, "upvotes": 6}, "h59907x": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h59907x/", "text": "OP you are one of the strongest people! I am sorry you had to go through this against your will. You have written very well and I just couldn't help myself but feel the same pain you went through, I hope you overcome this soon", "author": "kushpyro", "created": 1626341426, "upvotes": 26}, "h596kdr": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h596kdr/", "text": "You're awesome to come forward with this. I can't truly imagine what you have been through, but I'm glad you're doing better", "author": "ZeroExost", "created": 1626339191, "upvotes": 8}, "h591eu5": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h591eu5/", "text": "[removed]", "author": null, "created": 1626334575, "upvotes": -5}, "h5916q8": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h5916q8/", "text": "after a few times , you get used to it ... \n\n\nmy first time i was 9 years old ... my cousin lured me into his room by showing me toys and telling me to go play with him... i don't know how I ended up on the bed , all i remember is him being on top of me from the back , i had no idea what was going on.. i was wearing a short skirt he didn't even have to undress me .. \n\n second i was 17 .. my \"best friend\" who was a guy, gave me some pills .. we had always gotten high together, i trusted him ... well this time , he took me to someone's house .. i remember i couldn't walk and then i was in a bed getting fucked in the ass ...i remember that part so clearly , i could talk but i couldn't move, i just kept saying \" please don't \" after going to planned Parenthood to get checked .. they saw all my bruises and i told them i had been raped , you could literally see bruises of fingers painted into my hips from how hard they fucked me , oh yeah \"they\" there was multiple .. since I couldn't move , i didn't see if one of them was my \"best friend\" ... so planned Parenthood called the cops, i refused to talk to them, somehow it felt like it would too much trouble to investigate .. i hate being too much trouble , i didn't feel worth it , i felt like i deserved it\n\nthird , fourth , fifth ...many i don't know how many ... from 18 - 19 ... i was drugged and kidnapped .. I'm pretty sure they charged the guys that raped me, tho i never saw the transactions ... they kept me drugged the entire time ... not only during the rapes , i mean the entire time.. i was in a city which i don't know , in a motel which i don't know .. one of the guys who raped me also saved me .. he kind of fell in love with me , real love , real enough to save me instead of keeping raping me .. he took me out of the motel and let me go .. i went into the nearest Starbucks and asked a girl to use her phone ... i used Facebook to contact my family and they picked me up .. they never knew what happened.. i told them i was partying there with some friends and they left me ... they didn't question my absence for a year since i had moved out of my mom's house already before i was kidnapped , and i am very well known for not staying in contact with family , i should've called the police ... i just wanted to go home.. \n\ni have never spoken about any of these with anyone, and this is the first time talking about them on the internet. i have thought about seeing a therapist but the fact that they get paid to listen makes me wonder if they really care ... i don't tell friends , because i don't have any ( probably because my \"best friend\" did that) and I'm not close with any family (probably because my cousin did that )  \n\nanyway , excellent job OP , very well written\n\n ... i wish i could give you some type of 'this will fix it' advice but honestly , it'll just take time ...", "author": "aguafreska", "created": 1626334387, "upvotes": 69}, "h590bkk": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h590bkk/", "text": "[deleted]", "author": null, "created": 1626333650, "upvotes": 23}, "h58uxwx": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h58uxwx/", "text": "Please, please, spread your message. It needs to be heard by all the other idiots out there. I know someone who was raped when she was 13 and it was difficult to see her angry. but she made it through. I can confidently say she is happy and she is killing it in college (IVYs!) Please contact me for any support. I am here for you and other people out there.\n\nEdit: I am so thankful for all of you who upvoted these comments. I don't really care by the upvotes, but you need to know that this mindset will improve our environment. I support everyone from here, and please pm for anything.", "author": "Fit-Butterscotch-537", "created": 1626329336, "upvotes": 97}, "h58q0x9": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h58q0x9/", "text": "I don't know who you really are, but the story you shared was incredible. Firstly, overcoming the mental trauma and facing the assaulter looking their eyes needs some serious courage. Hats off to you,  you deserve the maximum respect❤️", "author": "AcanthocephalaOk1809", "created": 1626325786, "upvotes": 65}, "h58oxht": {"link": "/r/college/comments/oklphx/my_story_of_sexual_assault_as_a_freshman/h58oxht/", "text": "You incredibly brave and strong soul. I am so, so sorry about what happened, and you deserve all the love in the world. Hugs to you sister. And if you want, I'm right here and my DMs are open.", "author": "ShiningAway", "created": 1626325045, "upvotes": 167}}}