{
  "sid": "qaqkuy",
  "link": "/r/college/comments/qaqkuy/fomo_how_to_find_youthful_people/",
  "title:": "FOMO: How to find youthful people ?",
  "text": "Hi. I (20F) am more and more developing the social skills I used to lack in high school. I recently realised I love people, love the sense of community you can get out of it and that my “cursed poet” era isn’t doing me any more good – even though I think it was needed. \n\nAnyways, I don’t really struggle for the basics on how to meet people 101, but as I am not a drinker and that I am easily overwhelmed in “ecstatic” parties (you know what I am talking about), I don’t really know where to find youthful-minded people to have fun with. You know, the kind of relationship that makes your heart burst out of genuine laughter, the kind of people that are a little crazy, loud. \n\nI know life is short and I wouldn’t like to miss the cray-cray social part of my life. I want to make the best out of it. I know personality also depends on the college program (theater kids vs literature students are very different I can tell by experience). \n\nDo you have any tips on how to meet these kinds of people? Does it come with time ? I think I’ll still go to parties cause you never know who you’ll meet, but other options would also be appreciated. Also; how do you approach others based on their program ?",
  "author": "peachybooxoxo",
  "created": 1634575564,
  "updated": 1634654743,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh4qoo5": {
      "link": "/r/college/comments/qaqkuy/fomo_how_to_find_youthful_people/hh4qoo5/",
      "text": "My advice to find like-minded individuals that are similar to you would be to simply look at all the clubs your college offers. Look into all of them and join one that best fits you specifically. Almost a 100% guarantee you'll find people similar to you and you'll make some great friends.  Approach others by just being you, it doesn't matter what program you're in. It's so common that your best friend could end up having completely different life goals from you, it really doesn't matter if one is more interested in a subject than another. \n\n&#x200B;\n\nIn the end, you're all just people. Go out, join a club or 2, and just be yourself and talk to people and find out if you match. Best of luck!",
      "author": "BigKitchen1056",
      "created": 1634577980,
      "upvotes": 1,
      "replies": {}
    }
  }
}