{
  "sid": "qznoq4",
  "link": "/r/college/comments/qznoq4/has_anyone_dropped_out_or_know_someone_who_did/",
  "title:": "Has anyone dropped out? Or know someone who did?",
  "text": "I really want to just drop out of uni. Its so exhausting and I find no interest in my classes. My professors suck and I'm not learning anything. I feel like all I do is learn for an exam but I'm not actually learning the material. To be fair, I have been slacking/semi-failing and just really unmotivated because I find it all so pointless. I don't even want to work in the field I'm currently studying for anymore. I want to do something fun with my life and live on a farm or something. \n\nHas anyone dropped out before or know someone who has? What are they doing now? My parents really want me to get a degree and I do agree that it is good in the modern day world that we currently live in, but I just can't handle school. So im really lost on what to do. I wanna go into theater or art. My major is currently HEAVY in STEM but I want to be in something more creative and fun. I know those fields are a lot more competitive and hard to make money in though but is money really that important? \n\nIs anyone else struggling with this. Please comment and lmk!",
  "author": "totothepotato_",
  "created": 1637594210,
  "updated": 1637689087,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hlna59b": {
      "link": "/r/college/comments/qznoq4/has_anyone_dropped_out_or_know_someone_who_did/hlna59b/",
      "text": "Yes. I dropped out. I struggled to get a good paying job. Health insurance. Vacation time. Sucked.\n\nWent the entrepreneur route and luckily landed a job in a corporate company and am finishing my degree in may. If I ever need it I’ll have a much easier time getting a job where I can maintain my quality of life.\n\nSwitched majors from something math and business related to psychology. I just wanted the piece of paper. Now I’m invested into getting my masters to become a licensed therapist. \n\nSo worth it. In my 30s and never want to fight the way I did in my 20s. \n\nI wish you the best of luck.",
      "author": "deafika",
      "created": 1637594336,
      "upvotes": 3,
      "replies": {}
    },
    "hlnc05v": {
      "link": "/r/college/comments/qznoq4/has_anyone_dropped_out_or_know_someone_who_did/hlnc05v/",
      "text": "I dropped out, got s job, realised my opportunities were shit without a degree so i went back part time until i was ready to take ot seriously. This semester is the first ive ever been a full time student and im KILLING it as a remote student. Also im getting grants so theres an appeal to staying. It took 5 years after dropping out.",
      "author": "Growlpop",
      "created": 1637595142,
      "upvotes": 3,
      "replies": {
        "hlnsodr": {
          "link": "/r/college/comments/qznoq4/has_anyone_dropped_out_or_know_someone_who_did/hlnsodr/",
          "text": "This is me",
          "author": "AsleepSoil7426",
          "created": 1637601938,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlnjbu2": {
      "link": "/r/college/comments/qznoq4/has_anyone_dropped_out_or_know_someone_who_did/hlnjbu2/",
      "text": "I dropped out when I was 19, just wasn’t ready for college and my parents were pressuring me to study something I didn’t enjoy. Worked for a few years, got financially independent, decided to go back to school to finish my bachelors and graduated last year summa cum laude and now in the process of applying to grad school in my field! So definitely make your own choices, it’s not the end of the world. College isn’t for everyone, especially at 18 years of age. The great thing is that nowadays it’s never too late to finish your education.",
      "author": "ye_itsher",
      "created": 1637598172,
      "upvotes": 2,
      "replies": {}
    },
    "hlnbsxr": {
      "link": "/r/college/comments/qznoq4/has_anyone_dropped_out_or_know_someone_who_did/hlnbsxr/",
      "text": "“I feel like all I do is learn for an exam but I’m not actually learning the material”\n\nYup, welcome to college! I don’t think I’ve met anyone that has retained what they were supposed to learn in college. Thankfully, when you start working you will learn more on the job than in a classroom.",
      "author": "Spicybooiii",
      "created": 1637595057,
      "upvotes": 0,
      "replies": {}
    }
  }
}