{
  "sid": "qv9w1p",
  "link": "/r/college/comments/qv9w1p/ive_never_had_good_roommates_how_do_i_put_my_foot/",
  "title:": "I've never had good roommates. How do I put my foot down?",
  "text": "My freshman year I shared a double with a girl who partied three times a week, was a heavy drinker and always on Adderall. She would throw things at me in my sleep because the Adderall kept her awake at night and pissed her off. She stressed me out so bad I got oral thrush.\n\nIn my sophomore year, I shared a triple with girl A and girl B. For the first semester, girl B was doing school remotely and that was good cause I get along well with girl A. Then girl B came back and sexually assaulted me. She even threw her drink on me because I called her a narcissist.\n\nNow I'm a junior and living in a triple with girl A and another girl, who I'll call girl C. Girl C is a hot mess. She's on academic watch, she drinks all the time, stays out late, burns through all her meal plan and begs us to buy her things. She's incredibly self centered and plays loud music and tiktoks all the time. Also, we have two rooms between the three of us and without asking, she took the single room. So now me and girl A are sharing a room so small that some of A's furniture needs to be in C's room. Without asking, C put a bunch of her stuff on top of A's dresser and fridge.\n\nHow do I stand up to these people? Why does this keep happening? I've tried to tell girl C to pick up her rotting food and she won't listen to me. I'm about to just start being mean. \n\nHow do I deal with her?",
  "author": "Important_Ad6281",
  "created": 1637075428,
  "updated": 1637181405,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkvh057": {
      "link": "/r/college/comments/qv9w1p/ive_never_had_good_roommates_how_do_i_put_my_foot/hkvh057/",
      "text": "Move out to another room also  I'd tell them to fuck off straight up .. dealt w/ those types a lot. They only respond to same / equal energy back at them",
      "author": "KIDPESOO",
      "created": 1637082328,
      "upvotes": 2,
      "replies": {}
    }
  }
}