{
  "sid": "jsm5o7",
  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/",
  "title:": "Professor gave me a 0 on a test for emailing her a question.",
  "text": "I was taking an exam for a resourcing class which was open book. I had put the wrong choice for a question and wanted to change it however, the test did not allow back tracking so I took a screenshot of the question I had put wrong and emailed the professor after the exam asking if I could change the answer to this question. \n\nAfter some time, my professor emailed me saying I was given a 0 for taking a screenshot of the question and being on an electronic device.\n\nThis makes the class extremely difficult for me to pass as I need a 100 on the final exam and 100 on all other assignments now to pass with a 70 average for the class. \n\nI am confused on why I was given a 0. The test was online and open book so I would have to be using my computer. I took a screenshot for her to know which question I was referring to. I can’t cheat because it’s an open book test. If I was cheating I wouldn’t be dumb enough to have went to the professor. \n\nFailing this class would put me a year back as I cannot progress in my program without it. I’m wondering what I can do to appeal this?",
  "author": "zhangman123",
  "created": 1605147608,
  "over_18": false,
  "upvotes": 1729,
  "upvote_ratio": 0.98,
  "comments": {
    "gc412wo": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc412wo/",
      "text": "I'd go to whoever is her department chair. My professors always try to be online all day on exam day and some have even given us their phone number so we can text them if we have a question. Also if it's open book I don't know why she got so mad that you took a picture to ask her a question, like half my books are online anyways. \n\nIf she is head of her department then I'm not sure what to do",
      "author": "mmccnnmm",
      "created": 1605232877,
      "upvotes": 1,
      "replies": {
        "gc47fnw": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc47fnw/",
          "text": "You have to consider that to a prof, taking a picture of exam questions = students are sharing the exam with others. That’s why they don’t typically* give you the hard copy tests back, usually just your scantron and maybe they go over the questions missed next class. Academic integrity has always been a policy. Also, online tests where you cant go back after submitting an answer has been a thing since like atleast 2009-10. I can remember them being set up that way. Regardless, college can be a bit of a culture shock for people who come in thinking it’s gonna be similar to high school. It’s a harsh lesson, sure. But OP’s scenario is not new nor is it something to accommodate due to covid. Sorry - thats just what I know to be true as both a college student and having worked in higher education the last five years.",
          "author": "OHmyblueberries",
          "created": 1605236486,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gc3o4k2": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3o4k2/",
      "text": "This is your own fault you just had to screenshot the questions then go on here wondering why you got a 0.",
      "author": "anxiouseverywhere1",
      "created": 1605225351,
      "upvotes": 2,
      "replies": {}
    },
    "gc3mnd1": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3mnd1/",
      "text": "My prof once took of points on hw because I made a mistake in my scratch work(even though I got the answer right) and because he didn’t like the way I wrote the number 4 so I feel ya",
      "author": "SinfullySinatra",
      "created": 1605224510,
      "upvotes": 1,
      "replies": {}
    },
    "gc3l8wp": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3l8wp/",
      "text": "I would be honest at this point. \nAs somebody who understands where you’re right and where you’re wrong, the mercy is at the foot of the professor or you working your ass off for the next x amount of days to get an excellent grace on the final, not spending your time throwing a fit to the admin..... \n\nI would respond to my professor this word for word: \nHi, whomever, \n\nI see where I******^^^ was wrong in this situation. I really wished I could go back and tell myself to think before I do but I was primarily focused on this exam, but also how much this one grade matters to the completion of my degree. \n\nI was so upset/stressed that I acted before thinking, I should have used common sense to NOT take a picture of an exam because that rule is self-explanatory!!! \n\nI will be working every second that I can to make up this mistake on the final to show I understand where I was wrong on the question and correct my error of calculation (or recall,) \n\nMY apologies, \n\nI’m sorry but I agree a 0 for the entire exam was outrageous however this is apart of the lesson to follow rules, the consequences maybe much larger than one failed exam",
      "author": "afgrace",
      "created": 1605223741,
      "upvotes": 3,
      "replies": {}
    },
    "gc3hh8f": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3hh8f/",
      "text": "Why tf are u here. Email that Prof . Make sure you don’t have that 0 . Trouble that prof till u get ur score. Don’t come back here until your score is changed !!",
      "author": "obasmeme",
      "created": 1605221746,
      "upvotes": 0,
      "replies": {}
    },
    "gc33dpt": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc33dpt/",
      "text": "That’s nonsense on the part of the professor.  You did nothing wrong.\n\nEmail the professor explaining why you didn’t believe you did anything wrong and you would appreciate them reconsidering the situation.  See what they then say.  If they don’t drop the zero, tell them that you believe you are still in the right and don’t believe this is being handled fairly.  Tell them you don’t want to escalate the matter but because you believe you aren’t being treated fairly you will be contacting the division chair.",
      "author": "PotatoSaladBoy",
      "created": 1605214683,
      "upvotes": -1,
      "replies": {}
    },
    "gc33ctf": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc33ctf/",
      "text": "Go to the university ombuds office if it can't be resolved at the department chair level.",
      "author": "Jscott1986",
      "created": 1605214671,
      "upvotes": 1,
      "replies": {}
    },
    "gc32m67": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc32m67/",
      "text": "Lets be real, any professor that doesn’t allow backtracking on online exams/quizzes is a shitty person and shouldn’t be teaching",
      "author": "fitzthetantrum",
      "created": 1605214312,
      "upvotes": -4,
      "replies": {}
    },
    "gc2yqij": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2yqij/",
      "text": "I would ask your professor to clarify. I’m going to play devils advocate and say your professor is giving you a zero because you asked to change an answer but yet can’t backtrack. Some professors do this because with open book exams they don’t want students collaborating/cheating and then go “Oh shoot, I answered this one wrong, let me go and fix it.” I’d also clarify if the professor said open book or open source. If it’s open book, you can only use the book. If it’s open source, you can use the internet. I’ve had professors nail students for cheating because of this discrepancy and the education program flagged the exam for opening a different browser tab.",
      "author": "visser147",
      "created": 1605212460,
      "upvotes": 2,
      "replies": {}
    },
    "gc2jh1r": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2jh1r/",
      "text": "Talk to your academic advisor",
      "author": "jolygoestoschool",
      "created": 1605205558,
      "upvotes": 1,
      "replies": {}
    },
    "gc2eud2": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2eud2/",
      "text": "Sounds like another nerd who finally found herself in a position of power.",
      "author": "omgitsabean",
      "created": 1605203769,
      "upvotes": -4,
      "replies": {}
    },
    "gc2bgro": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2bgro/",
      "text": "drop out.",
      "author": "waterisfortheweak007",
      "created": 1605202194,
      "upvotes": -3,
      "replies": {}
    },
    "gc2489u": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2489u/",
      "text": "I'm a bit late to the party, but OP, download the syllabus before reporting them. If you are using a service like Canvas, profs have the ability to change the syllabus at any time. So be proactive and collect your evidence before it's altered.",
      "author": "PonchoHung",
      "created": 1605198781,
      "upvotes": 2,
      "replies": {}
    },
    "gc23f7g": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc23f7g/",
      "text": "I would go to the department  head. This is ridiculous and  if your professor is  the department  head. Go to the president of the school. This isn't cool.",
      "author": "LegendkillahQB",
      "created": 1605198400,
      "upvotes": -6,
      "replies": {}
    },
    "gc2262f": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2262f/",
      "text": "What does it say in the syllabus about screenshotting / what to do if you have a question during the test?",
      "author": "KING_COVID",
      "created": 1605197803,
      "upvotes": 7,
      "replies": {}
    },
    "gc1yxps": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1yxps/",
      "text": "How can you take a picture of a question you can't go back to? And why didn't you just email the question number or a few details to indicate the quest ion. Yo u should not have gotten a zero but this makes no sense",
      "author": "StardustNyako",
      "created": 1605196239,
      "upvotes": 3,
      "replies": {}
    },
    "gc1yc7t": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1yc7t/",
      "text": "That’s messed up. Talk to your advisor",
      "author": "notthatrelevant1",
      "created": 1605195948,
      "upvotes": 0,
      "replies": {}
    },
    "gc1xp1e": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1xp1e/",
      "text": "Maybe your professor assumed you were using your phone to send it to other people, which could technically constitute as cheating. Also if you already answered and couldn’t go back, then the answer was submit.",
      "author": "LittleHaitian",
      "created": 1605195638,
      "upvotes": 2,
      "replies": {}
    },
    "gc1wbkr": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1wbkr/",
      "text": "Escalate to the department chair or your dean. Be extremely polite and honest.",
      "author": "that_tom_",
      "created": 1605194959,
      "upvotes": -1,
      "replies": {}
    },
    "gc1sp17": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1sp17/",
      "text": "Most universities have an academic misconduct policy. Something like cheating/plagiarizing typically goes through them and they determine the severity of the punishment (I.e 10% deduction vs. a zero on an assignment) \n\nI would find that policy and find the names attached to  it to appeal the decision made by your prof. They often don’t have sole authority in academic matters. \n\nBest of luck! I personally don’t see this as cheating, but I understand the appearance of it. Seems rather harsh as you said. Don’t take it though, this is something that 100% can be fought.",
      "author": "maddiesighsloudly",
      "created": 1605193084,
      "upvotes": 5,
      "replies": {}
    },
    "gc1sgh8": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1sgh8/",
      "text": "Report her to the dean of whatever department she is employed within. That’s entirely unfair and a complete abuse of an exam rule. On the technicality yes you did take photos of the exam and yes you did use an electronic device however it’s a stretch to say you cheated or received or gave any unauthorized assistance (actually it isn’t a stretch it’s an outright lie). So don’t settle for the zero, fight for the credit you deserve",
      "author": "JamesK1220",
      "created": 1605192958,
      "upvotes": -1,
      "replies": {}
    },
    "gc1scx7": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1scx7/",
      "text": "isnt a 60% a passing grade for classes?",
      "author": "Miikeymt",
      "created": 1605192905,
      "upvotes": -4,
      "replies": {
        "gc202kr": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc202kr/",
          "text": "Here any class going towards your major or minor must be at least a C to pass. Could be similar at OP’s school.",
          "author": "G0B1GR3D",
          "created": 1605196789,
          "upvotes": 6,
          "replies": {}
        },
        "gc21jz7": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc21jz7/",
          "text": "Most degrees require at least a C which is usually a 70",
          "author": "taffypulller",
          "created": 1605197510,
          "upvotes": 2,
          "replies": {}
        },
        "gc59de2": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc59de2/",
          "text": "Some are a D but I’ve found that most are a C. I have seen degrees where you can pass with a 2.0+ gpa.",
          "author": "petiterunner",
          "created": 1605268912,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gc1s8ee": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1s8ee/",
      "text": "Yuh student affairs, go off thats ridiculous",
      "author": "Pedittle",
      "created": 1605192837,
      "upvotes": -3,
      "replies": {}
    },
    "gc1prld": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1prld/",
      "text": "Drag this prof to the head of the department even if it gets him fired. This is the kind of prof a university is better off without",
      "author": "thomas5221",
      "created": 1605191485,
      "upvotes": -5,
      "replies": {}
    },
    "gc1mg9o": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1mg9o/",
      "text": "Report her. Go to whoever you can that's higher than her. It's a broken system and it's bad enough that you're having to take tests in a less than ideal situation right now. You don't need these professors on a power trip making it harder for you just because you want to change your answer and the system won't allow you",
      "author": "indianajoes",
      "created": 1605189567,
      "upvotes": -7,
      "replies": {}
    },
    "gc1m1fp": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1m1fp/",
      "text": "So I had a professor state the other day that screenshotting the test counts as academic dishonesty, as it now could potentially be shared. While I don’t think you deserve a 0, this might have contributed.",
      "author": "retromoonbow",
      "created": 1605189316,
      "upvotes": 27,
      "replies": {}
    },
    "gc1hbor": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1hbor/",
      "text": "Am professor. You are getting a ton of bad advice. You are in a position that is inherently less in power than the professor you are at odds with. That’s why you need to use the system to fight rather than an emotional appeal of “that’s not fair.” Escalating immediately to your dean will make you look reactionary and petulant. \n\nFirst, look into the process to how to appeal class grade/individual grades assignments. \nSecond, use that avenue to pursue this to the eventual end. That is the only way you could possibly get what you want. \n\nI highly recommend that you meet with the professor to ask why your specific actions were deemed cheating. Might also request that the department chair be present. If they don’t have a valid policy based reason they are caught and will have to change it. But be aware that you will be burning a bridge with this professor the more you push this issue. That is not to say don’t do it but keep it in mind that they could also cause you problems later if you take them for another class.",
      "author": "tactful-dan",
      "created": 1605186169,
      "upvotes": 41,
      "replies": {}
    },
    "gc1h9uv": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1h9uv/",
      "text": "Is she a robot lol? That's ridiculous.",
      "author": "Nullveer",
      "created": 1605186131,
      "upvotes": 1,
      "replies": {}
    },
    "gc1gmb6": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1gmb6/",
      "text": "Lmao what a dumbass. It's a test, why should the prof change your wrong choice?? You know you can't back track. Take the 0, you deserve it for being that stupid. I don't even like profs, but wow.",
      "author": "CrimeAt5Dollars",
      "created": 1605185645,
      "upvotes": -6,
      "replies": {}
    },
    "gc1b50c": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1b50c/",
      "text": "It’s likely that the syllabus states that if you make copies of any questions, your entire test will be invalidated. \n\nThe teacher may believe that you took screenshots of every question, posted them on Chegg, and emailed her after you found out from someone else that your answer was wrong. \n\nYou can try pleading your case to the department chair, but if the question turns up on Chegg, it’s going to be bad for you. \n\nIf you are really worried you’ll fail the class, request a meeting with your academic advisor first and ask how to proceed.",
      "author": "StereoOnCookingBacon",
      "created": 1605180919,
      "upvotes": 87,
      "replies": {
        "gc238ao": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc238ao/",
          "text": "This. I am so sure it will be on the test stating not to take screen shots.",
          "author": "profbioanth",
          "created": 1605198309,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "gc16mld": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc16mld/",
      "text": "OP rules are important and all but fight for your grade (respectfully.) ultimately you are there to get your education and walk out with that degree. Don’t let people tell you you’re being a nuisance pursuing this. Do what you gotta do to get that degree as timely as possible.",
      "author": "BoringRedditPostGuy",
      "created": 1605176113,
      "upvotes": 7,
      "replies": {}
    },
    "gc12b55": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc12b55/",
      "text": "Yeah it is a dumb reason to get a zero for, but the professor is right. With these online tests, professors will tell that you cannot use a mobile device, take pictures of the test, etc. but how would they know? they don’t. Unless, a student does what you did and uses a mobile device and take pictures. Then he has a valid reason to give you a zero. You could be taking pictures of the exam and sending to other students; the professor doesn’t know. That is why the professor has to punish you. Also, when the professor says “open book” it doesn’t mean use your phone, web browser, etc. No, it means use the book and/or notes only. But, how would he know? he doesn’t. Unless, someone does what you did.\n\nI’m on the professors side, you should have not taken the picture. You should have just told them the question number in an email. If you go to the department or admins, they’ll tell you the same thing. Rules are rules.",
      "author": "WhitePhantum",
      "created": 1605172670,
      "upvotes": 17,
      "replies": {}
    },
    "gc0zidt": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0zidt/",
      "text": "Some people are saying you should take it to a higher up. Others are calling you a liar and a cheater. Personally, I don't know which one is correct. You should've just got the answer wrong instead of emailing about one question, that's lowkey weird and dumb. \n\nWhat you should do, in my opinion, is ask the professor to give you a 50 on the exam. I'm studying education and this is apparently becoming popular in classrooms. By giving students a 50 or what ever failing grade (above a 25 normally I assume) you allow them to see that they failed but still bring their grade up to pass the class. If you get a 50 now and a 100 later you will have a 75, so you pass and are not set back a year, but you have major consequences still (a C which can affect your transcript). So, I say, ask the teacher to do something like this instead of knocking you out completely. If they can't do that, try to get the 100s. If you know you cant then try graduate a year late I guess. Sorry.",
      "author": "goldxoc",
      "created": 1605170576,
      "upvotes": 21,
      "replies": {
        "gc20vfh": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc20vfh/",
          "text": "[deleted]",
          "author": null,
          "created": 1605197185,
          "upvotes": -2,
          "replies": {
            "gc2szok": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2szok/",
              "text": "No shit I read that. I was giving them an example and suggestion.",
              "author": "goldxoc",
              "created": 1605209731,
              "upvotes": 2,
              "replies": {
                "gc33urf": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc33urf/",
                  "text": "Yeah and I was clarifying. No need to get defensive.",
                  "author": "taffypulller",
                  "created": 1605214912,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gc0ysgx": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0ysgx/",
      "text": "My question is, why did you think it'd be ok for you to change the answer in the first place? If other students can't do it neither should you",
      "author": "CorrectMySwedish",
      "created": 1605170075,
      "upvotes": 30,
      "replies": {}
    },
    "gc0ydjz": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0ydjz/",
      "text": "... no words.. but maybe they stupidly gave u a 0 is because they assumed you took a screenshot of the whole test to send to people ?? but like .. you said you aren't that dumb and for them to assume that without talking is plain wrong. hope this gets sorted out",
      "author": null,
      "created": 1605169789,
      "upvotes": 4,
      "replies": {}
    },
    "gc0y0it": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0y0it/",
      "text": "Wow, that's just... incredibly unreasonable. I had a closed book online exam today, but when I emailed about a question the teaching team was really flexible about it.\n\nAlthough your professor is definitely in the wrong here, just a reminder while you go to the dean or department head to stay level headed when dealing with this. Unreasonable professor will probably also make unreasonable arguments later on.",
      "author": "ste11arstar",
      "created": 1605169529,
      "upvotes": 2,
      "replies": {
        "gc10628": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc10628/",
          "text": "I mean when you ask your teaching team question do you send them a screenshot taken during the test? That violates the academic integrity, if you are just asking it in words I doubt she’ll give the OP 0 but cmon a screenshot of the test? Is like you are wiping in their face the fact that you might cheated.",
          "author": "mikeke3",
          "created": 1605171035,
          "upvotes": 9,
          "replies": {
            "gc1kiah": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1kiah/",
              "text": "It's crazy to me that people think it's not obvious you SHOULDN'T BE TAKING SCREEN SHOTS OF TEST QUESTIONS. Whether guilty or innocent, this isn't a court of law. It's an academic institution. They have rules to prevent dishonesty. They can't make exceptions or it weakens academic integrity. It's so fucking normal and clear.",
              "author": "BravesMaedchen",
              "created": 1605188360,
              "upvotes": 12,
              "replies": {}
            },
            "gc10dji": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc10dji/",
              "text": "So no innocent until proven guilty? There should always be an investigation, not an outright 0, at the very least.",
              "author": "Perfectclaw",
              "created": 1605171183,
              "upvotes": -1,
              "replies": {
                "gc1kma5": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1kma5/",
                  "text": "This isn't a court of law. It's am academic institution. They have rules. Not taking pictures or screen shots of tests seems like an incredibly obvious one.",
                  "author": "BravesMaedchen",
                  "created": 1605188430,
                  "upvotes": 9,
                  "replies": {}
                },
                "gc10soo": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc10soo/",
                  "text": "The school probably will tell OP no investigation is needed because taking a picture of test question is against the academic integrity which OP probably agreed during the beginning of the class. You signed a contract and you violated the rules obviously there are consequences. If you don’t believe it try it yourself, take a picture of the test and email it to your professor and ask to change your answer, they’ll give you a 0 or a straight F for the class. Whether the OP have the bad intention or not they’ll flag it as an attempt to leak academic material and there is 0 tolerance for that in any institution.",
                  "author": "mikeke3",
                  "created": 1605171481,
                  "upvotes": 3,
                  "replies": {
                    "gc1jqwv": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1jqwv/",
                      "text": "Hmm, could you explain how taking a picture is against academic integrity? Probably my school has slightly different policies than yours but I feel like as long as you don't send the screenshot to any other student it wouldn't violate academic integrity. I mean it's the professor's own questions sent from OP to the professor so that probably wouldn't count as a violation or an attempt to spread material.",
                      "author": "ste11arstar",
                      "created": 1605187857,
                      "upvotes": 0,
                      "replies": {
                        "gc1kopi": {
                          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1kopi/",
                          "text": "Because they can share test questions with other students who haven't taken the test yet, giving them an unfair advantage.",
                          "author": "BravesMaedchen",
                          "created": 1605188473,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "gc16ehf": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc16ehf/",
                      "text": "Yea just let the old tenured professor use the same test from the 90s dammit!",
                      "author": "BoringRedditPostGuy",
                      "created": 1605175865,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gc0xldm": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0xldm/",
      "text": "Look at the guidelines for the test. Sometimes open book is just open notes and the actual textbook not open internet.",
      "author": "sjj999",
      "created": 1605169238,
      "upvotes": 6,
      "replies": {}
    },
    "gc0xkwe": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0xkwe/",
      "text": "How the fuck does your professor expect you to not be on an electronic device for an online quiz?\n\nReport them.",
      "author": null,
      "created": 1605169229,
      "upvotes": -2,
      "replies": {}
    },
    "gc0vw19": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0vw19/",
      "text": "Ask her to prove that every other student wasn’t on a mobile device during the test. That is unfair and unreasonable treatment. Please tell her what she is doing is lazy.",
      "author": "davidc5494",
      "created": 1605168088,
      "upvotes": -3,
      "replies": {}
    },
    "gc0viq2": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0viq2/",
      "text": "I just did this, emailed prof saying I wanted to change an answer cause I turned it in days early. He told me to just send him the updated copy whenever. That is hella unreasonable, this would be the same as bringing your test to the teachers desk, and asking them to explain XYZ during open book exam. This is covid, the same rules do not apply. We are always on our devices now, we can’t not be. We would much rather just ask you in person but guess what we can’t. Sorry your going through that, but seriously appeal appeal, try and reason with them, reference the honor code in relation to covid, and there policy in the syllabus and if it has covid specifiers- if it doesn’t there was no clear way for uou to know this was wrong as we are all new to this shit show and trying to gain our balance. Good luck xx",
      "author": "Greeneyedgirl17",
      "created": 1605167809,
      "upvotes": 17,
      "replies": {
        "gc3kz5u": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3kz5u/",
          "text": "[deleted]",
          "author": null,
          "created": 1605223597,
          "upvotes": 1,
          "replies": {
            "gc3vd3y": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3vd3y/",
              "text": "He did it for everyone and actually extended the due date cause we all had so many questions/ needed a lot of clarification because we didn’t have anyone to ask",
              "author": "Greeneyedgirl17",
              "created": 1605229601,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gc0uk2a": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0uk2a/",
      "text": "At my school there is a student advocacy group/board and if I were you I would be going straight to them. That's fucking bullshit",
      "author": "Zefphyrz",
      "created": 1605167082,
      "upvotes": 15,
      "replies": {}
    },
    "gc0t2yy": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0t2yy/",
      "text": "Demand satisfaction.",
      "author": null,
      "created": 1605165978,
      "upvotes": -4,
      "replies": {}
    },
    "gc0qkb1": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0qkb1/",
      "text": "The professor may be calling you out for taking screenshots of the exam questions. This is how students end up transferring stuff onto Chegg and other “cheat” sites. You may have violated your school’s academic integrity policy or at the very least caused the professor to question whether you were taking screenshots to share with other students, more than just the one you shared with the professor. Just bear in mind that this may not necessarily be a win for you.",
      "author": "pearlsnvodka",
      "created": 1605164247,
      "upvotes": 108,
      "replies": {
        "gc0qxkl": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0qxkl/",
          "text": "I think so as well, I really didn't have those intentions in mind when I emailed them about it. I just wanted to have an answer changed if possible. \n\nI don't really want a win and would accept a penalty other than getting a 0 on the exam.",
          "author": "zhangman123",
          "created": 1605164480,
          "upvotes": 32,
          "replies": {
            "gc0sr7n": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0sr7n/",
              "text": "Sure, but there’s no way to prove your intentions. The only proof is apparently a screenshot of the exam which absolutely should not have been taken.\n\nIf you jump the gun and take this to the higher ups (which is actually a terrible idea) they are going to investigate to see if those exam questions have been posted on any of the study share sites. They will also reach out to those sites to ask if you have ever been active on them and if so that could be enough for them to claim you intended to upload those answers even if you haven’t posted them specifically (or if you have taken them down). Alternately, they would be justified in saying that what you did was equivalent to making an unauthorized copy of a paper version of the exam.\n\nPersonally I find this story hard to believe as it is presented here. You couldn’t go back to change the answer but you were able to go back and take a screenshot of your answer? That doesn’t make sense. I cannot think of a single online proctoring system that does not allow you to change your answers prior to submitting the exam. If you were unable to change your answer that means you confirmed/submitted the answer as final before realizing your mistake. In that case it is on you for not paying attention to the parameters of the exam procedure.\n\nMy conclusion based on what you have presented here is that you were taking screenshots of the questions as you were going along, or you were taking screen shots of the final review page prior to submitting the exam, which would violate 99% of academic integrity policies.\n\nAs someone who did undergrad and an MBA online I have done tons of online exams and this story absolutely does not add up. Either you are not being entirely truthful about the steps you took, you are not sharing the entirety of your professor’s reply, or both. Personally I would apologize to the professor for not understanding the academic integrity policy, chalk it up as a lesson learned, be happy I wasn’t being reported to the Dean, then move on.",
              "author": "pearlsnvodka",
              "created": 1605165739,
              "upvotes": 71,
              "replies": {
                "gc1sa8m": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1sa8m/",
                  "text": "AC here. Your points were dead on but there are tests administered by the college board that don't let you go back or forward. Those are usually entrance exams though and this parameter is stated explicitly before the test starts. \n\nI cringed when op said they took a screen shot. Why not just describe the question or say \"I want to change my answer to number five\" ?",
                  "author": "iamsavsavage",
                  "created": 1605192864,
                  "upvotes": 25,
                  "replies": {
                    "gc1zx6n": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1zx6n/",
                      "text": "Yup, I learned via an earlier comment that there are now OLPs that lock in your answers. If that’s the case OP knew those were the parameters of the exam and should have been more careful. The professor is not obligated to let OP change their answer after the exam was submitted. They could have easily Googled or looked up the answer in that amount of time.",
                      "author": "pearlsnvodka",
                      "created": 1605196715,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "gc0tytz": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0tytz/",
                  "text": "You’re making a fair point. OP needs to really make sure they were no violating any policies stated in the syllabus or otherwise before escalating the issue to higher authorities. Also \njust wanted to let you know there is a proctoring program used by my school called lockdown browser. It doesn’t let you go back to the previous question once you’ve moved onto the next one. You can’t even view the previous question let alone change the answer.",
                  "author": "ashi3456890",
                  "created": 1605166640,
                  "upvotes": 59,
                  "replies": {
                    "gc0wvb3": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0wvb3/",
                      "text": "That’s exactly why I think something is up here. I hadn’t heard of Lockdown Browser before but assuming that’s what OP’s school was using, that DEFINITELY means they were taking screen shots of each individual question. Otherwise, how would they have them?\n\nI’m not privy to the in’s and out’s of Lockdown Browser but I’m assuming it flags every time you do a mouseclick outside of the browser window or something. If OP was using a screen grabbing tool that means the instructor could see OP was clicking outside the window, right? And with what frequency, etc.? I’m not naive enough to believe OP took a screenshot of just this one question.\n\nAlternately, if OP was taking the exam inside a VM as an attempt to bypass some of Lockdown Browser’s functionality, providing a screenshot would demonstrate they were doing that (i.e., system didn’t flag OP for clicking outside the browser but now they magically have a screenshot).",
                      "author": "pearlsnvodka",
                      "created": 1605168753,
                      "upvotes": -7,
                      "replies": {}
                    }
                  }
                },
                "gc1wijf": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1wijf/",
                  "text": ">If you jump the gun and take this to the higher ups (which is actually a terrible idea) they are going to investigate to see if those exam questions have been posted on any of the study share sites. They will also reach out to those sites to ask if you have ever been active on them and if so that could be enough for them to claim you intended to upload those answers even if you haven’t posted them specifically (or if you have taken them down). Alternately, they would be justified in saying that what you did was equivalent to making an unauthorized copy of a paper version of the exam.\n\nA lot of websites are linear when taking tests and I've run into this problem before too. You have to submit your answer before moving onto the next question and I've accidentally marked the wrong answer too but I just had to move on with the test. It's completely plausible and websites like Pearson do this. Just because you haven't run into test programs like this doesn't mean they don't exist.",
                  "author": "Skater719",
                  "created": 1605195056,
                  "upvotes": 12,
                  "replies": {
                    "gc23fjg": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc23fjg/",
                      "text": "Even tests on Canvas can be like this. I’ve had professors that will make some tests backtrack-able and some where once you submit your answer, that’s it. \n\nI personally find it stupid. Any in-person testing allows you to go back and review your answers. Sometimes a question will jog your memory for past/future questions and you may want to change your answer. \n\nWhat happened to the days when students checking their work and answers was not just encouraged, but expected?",
                      "author": "illucidaze",
                      "created": 1605198404,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "gc1zoqf": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1zoqf/",
                      "text": "Somebody corrected me in an earlier comment, thanks.",
                      "author": "pearlsnvodka",
                      "created": 1605196601,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gc0wsvr": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0wsvr/",
                  "text": "OP worded it wrong, they said that they took a screenshot of the question after the question they made the mistake on and told the professor ‘hey the question before this one is the one that I made a mistake on’\n\nIt was an honest mistake. I don’t see how all of this would happen, assuming OP has been a completely honest student thus far. What is OP supposed to do? Just be okay with a zero and most likely be unable to graduate because of that one zero on an exam? That’s ridiculous, especially for something so small. OP should absolutely bring this up to the department head or whoever can solve the problem.",
                  "author": "Aqua7KH",
                  "created": 1605168705,
                  "upvotes": 25,
                  "replies": {
                    "gc0xhsu": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0xhsu/",
                      "text": "“The OP worded it wrong” and “OP has been a completely honest student thus far” are major leaps of faith based off of a few paragraphs on Reddit. None of us have enough evidence to prove or disprove those statements. The professor does. The professor gave a 0. Likely AFTER consulting with their chair to make sure THEY weren’t doing the wrong thing.\n\nI will say again, intent does not absolve a student of the duty to adhere to the school’s academic integrity policy. The policy exists for a reason. Would you be lenient with a student who plagiarized their thesis just because they needed it to graduate?",
                      "author": "pearlsnvodka",
                      "created": 1605169180,
                      "upvotes": -5,
                      "replies": {
                        "gc0y2p2": {
                          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0y2p2/",
                          "text": "The reason why I say OP worded it wrong is because they literally said in the comments that they worded their post wrong and that they took a screenshot of the question that came after the question they messed up in. As for OP being an honest student, I’m not saying that they are for a fact, but I’m saying that IF they are, they should take it to the department head. I understand how serious the situation is.\n\nThe question of plagiarizing a thesis is in my opinion, is comparing apples to oranges. When someone copies and pastes a paper, they obviously know they’re doing something incredibly wrong, that’s straight up cheating. There’s no way to ‘accidentally’ plagiarize. However from what we know, OP merely took a screenshot to show the professor their problem. Something similar happened to me. While, it wasn’t a test, my professor literally ASKED me to email them a screenshot of the error that I kept getting for my assignment so they could see what was wrong.",
                          "author": "Aqua7KH",
                          "created": 1605169572,
                          "upvotes": 27,
                          "replies": {
                            "gc0y4bd": {
                              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0y4bd/",
                              "text": "> apples to oranges\n\nBut you can still compare them.",
                              "author": "SpunkyDred",
                              "created": 1605169605,
                              "upvotes": -14,
                              "replies": {
                                "gc0yc5v": {
                                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0yc5v/",
                                  "text": "What do you mean you can still compare them? It’s a different situation. That’s like saying you can compare someone hitting another person simply because they wanted to to someone hitting another person out of self defense. While yeah there is an act of hitting, the two situations are different and cannot be compared fairly towards one another.",
                                  "author": "Aqua7KH",
                                  "created": 1605169764,
                                  "upvotes": 10,
                                  "replies": {}
                                },
                                "gc160pq": {
                                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc160pq/",
                                  "text": "I think he means they’re not equivalent",
                                  "author": "BoringRedditPostGuy",
                                  "created": 1605175568,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "gc15yly": {
                          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc15yly/",
                          "text": "False equivalence",
                          "author": "BoringRedditPostGuy",
                          "created": 1605175527,
                          "upvotes": -1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gc15pgu": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc15pgu/",
                  "text": "Or maybe you’re wrong?",
                  "author": "BoringRedditPostGuy",
                  "created": 1605175338,
                  "upvotes": -4,
                  "replies": {}
                }
              }
            },
            "gc2xhu7": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2xhu7/",
              "text": "And you should win. Of course its POSSIBLE that you can do those things with a screenshot, it is not in any way proof. Imagine if we punished people in court for their capacity to commit a crime, rather than actual proof that they are the perpetrators. Its illogical and unethical and the prof needs to be held to a higher standard of accountability unless it was made abundantly clear you cant screenshot",
              "author": "_Convair_",
              "created": 1605211877,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gc1tp1f": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1tp1f/",
          "text": "Pearlsbvodka,\nWell stated. I agree that the screenshot was the violation as many schools have academic integrity policies that cover this. My current class is open book/notes; however, it explicitly states that I cannot use electronics (to take screenshots), browse the internet for answers, talk to others, etc. These instructions are in the syllabus, as well as on each of the exam pages. I have a proctor watching me that also scrutinizes my materials ahead of time, so it would be an automatic fail if I pulled my phone out to take a screenshot. \nThe fact that OP took a screenshot and sent it to the professor, they basically told on themselves.  At the two universities I’ve been at, this kind of infraction, if deemed egregious enough, warrants expulsion. A zero is a low price to pay in comparison. Probably an unpopular opinion, but you agreed to the rules when you started school and the course. 🤷🏻‍♀️",
          "author": "Svenska80",
          "created": 1605193617,
          "upvotes": 9,
          "replies": {
            "gc1zud1": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1zud1/",
              "text": "I think you don’t understand the difference between taking a screenshot and taking a photo.",
              "author": "awgiba",
              "created": 1605196676,
              "upvotes": -4,
              "replies": {
                "gc2q28e": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2q28e/",
                  "text": "I’m perfectly aware of the difference. The result is the same though. You have a photographic proof of an exam question, which would violate the academic integrity policy.",
                  "author": "Svenska80",
                  "created": 1605208340,
                  "upvotes": 3,
                  "replies": {
                    "gc2q9e2": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2q9e2/",
                      "text": "You said “pulled out my phone to take a screenshot”. That means you clearly don’t know what a screenshot is lol.",
                      "author": "awgiba",
                      "created": 1605208434,
                      "upvotes": -2,
                      "replies": {
                        "gc2uklq": {
                          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2uklq/",
                          "text": "OK, I’ll concede that my word choice was poor; however, the result remains the same. Whether you take a shot of the screen with your phone’s camera or a screenshot with your computer, both actions result in photographic evidence of what the exam looked like at the time. \nOP can always ask the professor where “taking a screenshot” is explicitly stated as prohibited, but the professor will most likely point back to the syllabus or the schools course catalog where these are described in detail. 🤷🏻‍♀️",
                          "author": "Svenska80",
                          "created": 1605210477,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gc0pt5b": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0pt5b/",
      "text": "An online test has completely different expectations than a paper test. The instructions were clear about no going back, correct? So why would the instructor be obliged to change any answer after you moved on? In addition, the real problem is that you are in a position were you need to get 100% on everything. It is not your instructor's fault that you are in that situation. Work had. Follow the rules. Don't expect special treatment.",
      "author": "Piglet03",
      "created": 1605163780,
      "upvotes": 27,
      "replies": {
        "gc0qmkm": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0qmkm/",
          "text": "Agreed. While I do think the professor is overreacting with a 0, OP come on... i know its easy to say this in hindsight, but they should have owned the mistake and moved on. Not paying attention and reading questions carefully cost them the entire exam. I couldn’t imagine myself taking a damn screenshot of an exam even if its open book.",
          "author": "MobileUser21",
          "created": 1605164290,
          "upvotes": 27,
          "replies": {
            "gc0t29h": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0t29h/",
              "text": "Yea, it would have been best just to take the L for that one question. I can't imagine any professor actually letting a student change their answer after the test even if they had no issue with the screenshot.",
              "author": "Zerobeastly",
              "created": 1605165962,
              "upvotes": 20,
              "replies": {}
            }
          }
        },
        "gc16ak3": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc16ak3/",
          "text": "One 0 is enough to cripple an A student just sayin.",
          "author": "BoringRedditPostGuy",
          "created": 1605175773,
          "upvotes": 0,
          "replies": {
            "gc212t0": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc212t0/",
              "text": "Except he’s not an A student. He needed this test to be 100 and the following assignments to be 100 in order to pass with a 70 *average*",
              "author": "taffypulller",
              "created": 1605197283,
              "upvotes": 12,
              "replies": {
                "gc2kuir": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2kuir/",
                  "text": "I think OP meant after getting a 0 on this test, now he needs all following tests and assignments to be 100.",
                  "author": "agliyt",
                  "created": 1605206092,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "gc28egm": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc28egm/",
              "text": "Is it? Did they say how many points this test was worth? Or how many points total are available in the class? If a class is structured so one zero \"cripples\" an A student (whatever that means) it is a very poorly constructed course.",
              "author": "Piglet03",
              "created": 1605200766,
              "upvotes": 1,
              "replies": {
                "gc2kkmk": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2kkmk/",
                  "text": "I’ve had several classes where the final is worth as much as 40% of my grade, and classes where each midterm is worth 20% of my grade. Even if I was projected to get, say a 90%, getting a 0 on a test worth 20% can bring the grade down to a 70%. So this is very common and doesn’t necessarily dictate a poorly constructed course :)",
                  "author": "agliyt",
                  "created": 1605205984,
                  "upvotes": 5,
                  "replies": {
                    "gc2nwk1": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2nwk1/",
                      "text": "Just because its common doesn't make it \"good\" or \"correct.\" What do you teach? What level? How us it fair to your students to have so much of their grade dependent on one assignment?\n\nEdit--sorry I did not mean that your courses are not \"correct.\" Looking for context and background with these questions.",
                      "author": "Piglet03",
                      "created": 1605207320,
                      "upvotes": 4,
                      "replies": {
                        "gc2tug4": {
                          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2tug4/",
                          "text": "I’m a student, so I don’t teach these courses, I just take them. I’m a CS student, but I think the classes where the exams are worth a lot are physics and math classes. I’ll take physics 1 at my university for example. 5% is recitation attendance, 20% quizzes, 15% homework, 10% exam 1, 10% exam 2, 10% exam 3, 30% final (we had 4 midterms but the lowest is dropped). I think the main motivation for the professor for having such a large percentage of my grade be the final is because he sees it as such a culmination of what we learned. My 3D calc class was even “worse” in terms of having exams be a large part of my grade. 10% homework, 20% quizzes, 20% exam 1, 20% exam 2, 30% final. (I actually pulled up my past syllabuses for this, haha) As to why my professors do this, I’m not sure, but these are all well-established introduction level courses that have been taught already for many years. As for my CS classes the theoretical CS class I’m taking right now has 35% for each of the 2 midterms, and my computer systems class has a final worth 30%! Perhaps you are right that this is not necessarily the best way to access our knowledge in the course, but I think it’s relatively standard for college classes to attribute a big portion of grades to exams. Or maybe this is just a thing for American universities. I don’t know ¯\\\\\\_(ツ)\\_/¯",
                          "author": "agliyt",
                          "created": 1605210133,
                          "upvotes": 3,
                          "replies": {
                            "gc2vyh2": {
                              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2vyh2/",
                              "text": "I teach in the US. It makes no sense to me, but I teach humanities. It sounds like laziness. Once again, just because tenured faculty get away with doing it does not necessarily make it a best practice.",
                              "author": "Piglet03",
                              "created": 1605211139,
                              "upvotes": 3,
                              "replies": {
                                "gc5mf8k": {
                                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc5mf8k/",
                                  "text": "The argument I hear is it prepares student for real world experiences where their everyday work can create huge losses like that.",
                                  "author": "BoringRedditPostGuy",
                                  "created": 1605278951,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gc0nhhs": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0nhhs/",
      "text": "How could you take a picture of a question and not be able to change the answer. If it was unavailable for changing; it would also be unavailable for picture taking. Unless, you happen to take pictures of all the questions as you go. I think that's reasoning behind the 0?",
      "author": null,
      "created": 1605162269,
      "upvotes": 5,
      "replies": {
        "gc0qx4c": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0qx4c/",
          "text": "I don’t know if OP is like this but I had a test where once you picked an answer you couldn’t pick any else. So you have four answers, you click on B, all you can do is either stay on the page of the question or move on to the other one. The teacher was warned about this and he changed it.",
          "author": "Loliemimie",
          "created": 1605164472,
          "upvotes": 6,
          "replies": {
            "gc0srs0": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0srs0/",
              "text": "Perhaps, but the OP said back tracking was their issue and not answer changing. I'm starting to think these 'How do I prove how innocent I am' postings have an implied inside joke that we all know they cheated. Hit that down vote.",
              "author": null,
              "created": 1605165750,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "gc0mdz2": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0mdz2/",
      "text": "She probably assumed you were taking pictures to send it to other people. \n\nIt’s also probably against the rules to take pictures because some teachers reuse test questions (even when we took paper tests many professors didn’t let us take the test home or take pictures of it). \n\nI would try explaining the situation to her, and telling her that you took a picture of only that question with the sole intention of sending it to her and that you hadn’t realized it was against the rules. Then you might ask her if there is anything you can do to fix it.",
      "author": null,
      "created": 1605161569,
      "upvotes": 35,
      "replies": {}
    },
    "gc0m9pd": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0m9pd/",
      "text": "Wait, if you couldn't backtrack to change your answer, how could you go back to take a screenshot. I'm confused. Am I missing something?",
      "author": null,
      "created": 1605161499,
      "upvotes": 96,
      "replies": {
        "gc0mg8l": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0mg8l/",
          "text": "Nope you are right I worded it wrong. I took a screenshot of the question after it telling her the previous question I had put the wrong answer.",
          "author": "zhangman123",
          "created": 1605161609,
          "upvotes": 79,
          "replies": {
            "gc1k2hj": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1k2hj/",
              "text": "Ok, but in what world are you allowed to go back and say \"hey after finishing the test, I realize I got an answer wrong, can I change it?\" That's not how tests usually work. And I have noticed that tests have some pretty strict technology rules since they're having to do them online. They don't want people cheating or giving answers/questions away. Taking screen shots of tests questions has the potential to compromise the test. It's weird to me no one here is thinking of these things. It's not a free for all. It seems obvious to me you shouldn't be taking screen shots of test questions.",
              "author": "BravesMaedchen",
              "created": 1605188074,
              "upvotes": 91,
              "replies": {
                "gc1kcrz": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1kcrz/",
                  "text": "That’s sort of what I was wondering too. You can’t screenshot questions because that opens up the potential to share the answers and whatnot with peers and online. I’ve never seen a professor that would be on board with this.",
                  "author": "JoshuaTheProgrammer",
                  "created": 1605188261,
                  "upvotes": 49,
                  "replies": {}
                },
                "gc1l51u": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1l51u/",
                  "text": "On blackboard etc. You can take the exam, not be able to backtrack, but at the END of the exam also see a recap of questions you got wrong without the answer choices revealed. It just restates them question with no answer choices and it also doesn’t show you what you chose either (but an indicator if you got it right or wrong.)",
                  "author": "sydnelizabeth",
                  "created": 1605188762,
                  "upvotes": 23,
                  "replies": {
                    "gc1lnkl": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1lnkl/",
                      "text": "I've taken tests like that. The key here being that that recall is part of the test. It happens before the test is closed out. OP finished the test. You don't get do overs. It's a fucking test. It's like turning in your paper to the teacher and coming to their office hours to ask if you can change your answers. Uh...no? Unless it's pre arranged (like the class policy, or that black board recall) why would you just assume you can email the teacher up after the test is done and change an answer?",
                      "author": "BravesMaedchen",
                      "created": 1605189081,
                      "upvotes": 23,
                      "replies": {
                        "gc26h7f": {
                          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc26h7f/",
                          "text": "Mistakes do happen though and a little understanding goes a long way. Their knowledge of the subject was not accurately recorded by giving them a zero and being a jerk. \n\nEven if I know the material like the back of my hand, it doesn’t mean that I can’t make a mistake and select the wrong answer. If it was an in class test you would be able to go back, so this was the only way they would be able to fix their mistake.",
                          "author": "sydnelizabeth",
                          "created": 1605199866,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gc1sp11": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1sp11/",
                  "text": "I agree with you, BravesMaedchen. \nNot being able to go back and review your answers before submitting is kind of odd and something I’ve never encountered in almost 5 years of school. \nMy current class is open book, but I’ve had very few exams that were in the past. With that said, mine are proctored and it explicitly states in the instructions (syllabus and exam page) that resources are allowed, such as handwritten notes, pdf textbook, and whatever resources I deem useful that I can show the proctor at the time I take the exam. However, I cannot browse the internet, talk to individuals during the exam, use electronics, or take screenshots. My tests are also not returned with my correct/incorrect answers. While the open book/notes format doesn’t really quiz you on knowledge you know since you can look them up during the exam, the latter are to ensure the integrity of the testing process. They don’t want their exam questions on quizlet, etc. \nThe violation was the screenshot, not that OPs had asked a question about changing an answer. As a professor and department head, I would stand by the original decision (bring on the downvotes. Haha).",
                  "author": "Svenska80",
                  "created": 1605193084,
                  "upvotes": 7,
                  "replies": {
                    "gc25uc0": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc25uc0/",
                      "text": "I don't think a screenshot can justify giving the 0. The policy that the professor has is at the crux of the issue, but I speculate that the policy relates to communicating with other students or the internet. To that end, I encourage professors to browse the internet, cross-check student exams, and even set up Chegg booby traps.\n\n\"Using an electronic device\" like the professor said is not evidence enough because doing so is, in fact, a requirement to take the exam, and therefore cannot in good faith be interpreted to be part of the policy, whether it is written in or not. \n\nThe screenshot is also not enough evidence. In a real-life exam room, you are allowed to show the professor your exam if you have a specific question. The only way to emulate that in an online setting is to screenshot. And here's the thing. If you make a claim to a professor about an online exam, chances are they will ask you for proof. Therefore, taking a screenshot has no inherent connection to communicating with other students.",
                      "author": "PonchoHung",
                      "created": 1605199562,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "gc3fckz": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3fckz/",
                  "text": "He wasn't finished the test. This was during the test. \n\nThe test taking software doesn't let you go back to previously answered questions. Where this is a problem, is prematurely clicking next or a keybinding you didn't know that moves to the next question. \n\nI agree that screenshots may not be appropriate, but if you were having a technical issue, or a test question - which an instructor should be available to answer - what do you do?",
                  "author": "Alyscupcakes",
                  "created": 1605220625,
                  "upvotes": 3,
                  "replies": {}
                },
                "gc2w2fz": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2w2fz/",
                  "text": "It’s not that people aren’t thinking about things, it’s just that it seems so wildly out of proportion to the actual infraction, especially in this particular context. I mean, in what world are you not able to fix a misclick on a question nor ask the prof questions about how the test works during the exam itself? Even if it seems a bit dumb in retrospect, I can totally see why OP ended up doing what they did, especially under exam pressure.\n\nYou make it seem like the mere act of taking a screenshot has the potential to compromise the test, but that’s not really true. Either you share a screenshot or your don’t. And if you are doing something inappropriate with those screenshots you probably don’t e-mail them to the professor ... In reality, what OP did is no more damaging than just having memorized the question to refer to it later, prof is over reacting to the particular method IMO. A zero on an exam for this just seems way out of proportion with what they actually did (and also nearly irrelevant to the goal of actually stopping the people actually cheating on these tests). Kind of like a cop arresting people for jaywalking instead of trying to fight actual crime or something.",
                  "author": "Thunderplant",
                  "created": 1605211193,
                  "upvotes": 0,
                  "replies": {}
                },
                "gc2x2qr": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2x2qr/",
                  "text": "In the world where youre not allowed to backtrack and change answers. In other words basically no real world scenario because I've never heard of an in person written test where you cant change your answers before you submit",
                  "author": "_Convair_",
                  "created": 1605211679,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "gc28490": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc28490/",
              "text": "That's much different.  AFTER you were told that your answer was wrong, THEN you realized you made a mistake.  You were told if your answer was right or wrong after each question rather than the entire exam being graded at the end.\n\nYou have no basis to have asked to have your answer for that question changed.  But you should be able to have the prof remove the 0 score for the exam.",
              "author": "lupineblue2600",
              "created": 1605200633,
              "upvotes": 5,
              "replies": {}
            },
            "gc0mlol": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0mlol/",
              "text": "Gotcha. Yeah that's BS",
              "author": null,
              "created": 1605161697,
              "upvotes": 17,
              "replies": {}
            }
          }
        }
      }
    },
    "gc0k9p6": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0k9p6/",
      "text": "\nThe wording just seems so bizarre here. What do they mean “being on an electronic device” when you literally have to take a test online? Are there written instructions for the test you can reference? Maybe the prof have thought open book meant print only (no online?). \n\nThe whole thing is super nonsensical, especially since by your account you emailed the professor after the exam was over. Therefore, the only thing you did “wrong” during the exam was take the screenshot - emailing prof on your own time after you were done really should have no bearing on this. Might be an angle you can use while fighting this.",
      "author": "Thunderplant",
      "created": 1605160271,
      "upvotes": 275,
      "replies": {
        "gc0n3e2": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0n3e2/",
          "text": "I find the situation bizarre as well, the test was online on the compuer so I had to be on the computer. The test involved accessing databases to collect information, the professor even mentioned it being allowed. \n\nI am willing to accept punishment for the screenshot if it really effects my professor that much however, I don't see how a 0 is justified.",
          "author": "zhangman123",
          "created": 1605162003,
          "upvotes": 172,
          "replies": {
            "gc1c9n3": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1c9n3/",
              "text": "keep us updated on what happens. i feel bad for you bc it definitely doesn't seem like you had any bad intentions & that you just made a mistake & honestly i can see myself doing something like this.",
              "author": "lyndsay0413",
              "created": 1605182017,
              "upvotes": 48,
              "replies": {}
            },
            "gc1t2ev": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1t2ev/",
              "text": "Don’t accept that punishment man. Especially if you will graduate a year later because of it. The financial implications of that are awful (another year of tuition + another year you are out of the job market)",
              "author": "lil_layne",
              "created": 1605193280,
              "upvotes": 33,
              "replies": {}
            },
            "gc1ussx": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1ussx/",
              "text": "Me wondering if they have such little computer literacy that they think you used your phone to take the picture...?",
              "author": "stvbeev",
              "created": 1605194187,
              "upvotes": 13,
              "replies": {}
            },
            "gc3exvi": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3exvi/",
              "text": "Wait. Screenshot...\n\nMaybe the Prof thinks you took the photo with your phone?",
              "author": "Alyscupcakes",
              "created": 1605220413,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gc0zvsw": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0zvsw/",
          "text": "Seems like OP took a SS with his phone, and the prof did not like that. She is afraid she will send the test to other people. \n\nYeah shot herself in the foot here.",
          "author": "CarSuperFast",
          "created": 1605170836,
          "upvotes": -60,
          "replies": {
            "gc1alms": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1alms/",
              "text": "Perhaps the professor, like you, does not understand the difference between a screenshot and a photo.",
              "author": "StereoOnCookingBacon",
              "created": 1605180377,
              "upvotes": 58,
              "replies": {}
            },
            "gc1adu4": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1adu4/",
              "text": "Thats not what a screenshot is.",
              "author": "deprimada",
              "created": 1605180157,
              "upvotes": 34,
              "replies": {}
            }
          }
        }
      }
    },
    "gc0jdp0": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0jdp0/",
      "text": "the issue is that you are taking screen shots of questions on the test, although its not cheating, it is def not allowed there is a reason why you cant go back on the test. \n\ntry to appeal but in my eyes your in the wrong, you cant take pictures of a test . ever",
      "author": "unforgivingregret",
      "created": 1605159706,
      "upvotes": 35,
      "replies": {
        "gc10d3s": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc10d3s/",
          "text": "Okay but use common sense. Why would someone cheating send screenshots to their professor? We're not robots, we can use critical thinking. It's technically against the rules but no harm comes from this. There is no reason for OP to have to retake the class, let alone be held back a year for something so stupid. Should they be punished? Maybe, but this is beyond punishment",
          "author": "invaderzz",
          "created": 1605171175,
          "upvotes": 18,
          "replies": {
            "gc1bzbf": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1bzbf/",
              "text": "I agree 100% & I don't really blame OP for what they did, but if i were to take a screenshot of an exam question & email it to my professor, i would expect repercussions even if it was open book & even if it was the chillest professor ever. i don't blame OP for doing that, but I also feel like they seriously should have known better. However I think it's a huge dick move for the professor to give them a 0 on the exam just for that. Like obviously OP wasn't cheating or else they wouldn't have sent that screenshot to their professor, so i see no reason why the professor couldn't have realistically just let them off easy. I feel like in this situation most professors would just let you retake a different version of the exam, or even just let you off with a warning. Sounds like either this prof has reason to believe OP should not pass this class, OR they're just a massive douchebag.",
              "author": "lyndsay0413",
              "created": 1605181747,
              "upvotes": 11,
              "replies": {}
            },
            "gc1vl9a": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1vl9a/",
              "text": "Believe it or not, this type of thing happens occasionally. Students will mention something offhand that accidentally gives them away. Just the other day I read a note from a professor whose student mentioned that they and another student had been copying off of one another all semester (totally cheating in that course).",
              "author": "Esmereldista",
              "created": 1605194596,
              "upvotes": 6,
              "replies": {}
            },
            "gc2ac2p": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2ac2p/",
              "text": "The harm could be that OP has the pictures. He could have been sending it out to people during the test, he could post those online and people who may take the test next semester now have the answer. Taking screenshots is a no no. Are you allowed to pull out your phone during a test, just to take pictures? \n\nOP self snitched, im not acting like i haven't taken screenshots but I use my critical thinking to know to never send it out, especially to my professor. Why do some people call 911 on themselves? Some people are just dumb or made a mistake, and OP made a mistake and there are consequences for that",
              "author": "unforgivingregret",
              "created": 1605201669,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gc0mt0i": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0mt0i/",
          "text": "I appreciate hearing from someone that isn't on my side. Could you explain how I am in the wrong other than taking a screenshot? I just want to get an idea of how my professor might feel because they didn't mention anything but a one sentence email of you get a 0 because you took a screenshot of my test.",
          "author": "zhangman123",
          "created": 1605161821,
          "upvotes": 9,
          "replies": {
            "gc1ktgl": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1ktgl/",
              "text": "Whether or not your intent was to cheat, the rule is no screen shots. To make an exception when you're waving in your teacher's face that you broke a rule is unfair to other students and it weakens academic integrity.",
              "author": "BravesMaedchen",
              "created": 1605188557,
              "upvotes": 13,
              "replies": {}
            },
            "gc0pspj": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0pspj/",
              "text": "She might be scared you took more screenshots  to share  the test with other students\n\nEdit: autocorrect",
              "author": "butterflyworld95",
              "created": 1605163772,
              "upvotes": 23,
              "replies": {}
            },
            "gc29jwl": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc29jwl/",
              "text": "like i said what you did wrong was take the screen shot, that is a no no. you know that. she could assume that you were sending those screen shots to people and cheating. you cant pull out your phone to take pics of the test when in person, so what makes it ok to take screen shots of the test when you are online",
              "author": "unforgivingregret",
              "created": 1605201304,
              "upvotes": 4,
              "replies": {}
            },
            "gc3hp97": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3hp97/",
              "text": "OP, might as well drop out of college if you need a reddit stranger to explain to you how you're wrong.",
              "author": "CrimeAt5Dollars",
              "created": 1605221864,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gc0futg": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0futg/",
      "text": "[deleted]",
      "author": null,
      "created": 1605157671,
      "upvotes": -3,
      "replies": {
        "gc0gndi": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0gndi/",
          "text": "I mean if someone would count me using my resources to take an open book test as cheating I guess it cheating lmao. That’s beside the point I contacted the professor to change an answer and they failed me for taking a picture of the question.",
          "author": "zhangman123",
          "created": 1605158104,
          "upvotes": 7,
          "replies": {
            "gc0oli7": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0oli7/",
              "text": "[deleted]",
              "author": null,
              "created": 1605163023,
              "upvotes": 2,
              "replies": {
                "gc0p70o": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0p70o/",
                  "text": "I know what my professor said, I put it in the post. \nDo you not read?",
                  "author": "zhangman123",
                  "created": 1605163393,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gc0f97x": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0f97x/",
      "text": "Bring it up with the department chair of that subject. If that Proff is also the Chair then take your case up to the higher school administration. You shouldn't take that lying down if it's going to keep you from graduating for a year.",
      "author": "Aragorn9001",
      "created": 1605157333,
      "upvotes": 889,
      "replies": {
        "gc0pcoa": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0pcoa/",
          "text": "THIS RIGHT HERE.\n\nEdit: I do think you should be made aware anything that could be screenshot/considered a cheating method shouldn't be used. In the future, if you're given an open book exam, just write down the question and email if to your prof that way - as if you remembered it, not verbatim. That way they don't have evidence you may have cheated.\n\nThat's going to be the issue here - she'll say you \"cheated\" and you'll have to defend yourself. You'll need to talk to the dean of the department and give solid reasons why you didn't think that was cheating and that you haven't shared the info with any other student. Just tread carefully, but definitely talk to her again, escalate to the dean, and escalate further as needed until someone does something. Make it clear you did not cheat and you need to be allowed y graduate on time.",
          "author": "auntruckus",
          "created": 1605163492,
          "upvotes": 234,
          "replies": {}
        },
        "gc12she": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc12she/",
          "text": "I would do this + CC the dean on the email. Some professors won't take action unless they know their supervisor is aware of the situation.",
          "author": "kLinus",
          "created": 1605173065,
          "upvotes": 76,
          "replies": {
            "gc24lq3": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc24lq3/",
              "text": "Don't skip the chain of command. You won't be taken seriously, and in some school policies you can't be helped, if you don't go through the necessary steps.",
              "author": "PonchoHung",
              "created": 1605198962,
              "upvotes": 29,
              "replies": {
                "gc4dzz3": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc4dzz3/",
                  "text": "Where did I say skip the chain of command? I said copy their supervisor.",
                  "author": "kLinus",
                  "created": 1605240287,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gc2k7ic": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2k7ic/",
              "text": "The dean can't do anything about this, nor is it their business to deal with it. It's like CCing your governor because of a pothole. The department head is the person to go to.",
              "author": "Mesahusa",
              "created": 1605205846,
              "upvotes": 10,
              "replies": {}
            },
            "gc1mb4n": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1mb4n/",
              "text": "Skip the Dean.  Go straight to the president or provost of the school.  Or their board of regents.  If it’s a public school, straight to the governor.",
              "author": "imjustsayin314",
              "created": 1605189482,
              "upvotes": 17,
              "replies": {
                "gc1nf10": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1nf10/",
                  "text": "Might as well CC President Trump too",
                  "author": "Artillect",
                  "created": 1605190146,
                  "upvotes": 73,
                  "replies": {
                    "gc1p1tm": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1p1tm/",
                      "text": "and biden too, just in case the issue takes a few months to resolve",
                      "author": "turtlesandtrash",
                      "created": 1605191086,
                      "upvotes": 60,
                      "replies": {
                        "gc1pm0n": {
                          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1pm0n/",
                          "text": "Make the United Nations aware of the situation incase you have to escalate",
                          "author": "Dingleberry_Custard",
                          "created": 1605191398,
                          "upvotes": 51,
                          "replies": {
                            "gc2jbi9": {
                              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2jbi9/",
                              "text": "The Galactic Space Federation probably should also be looped in, just to be safe",
                              "author": "kittymeowss",
                              "created": 1605205499,
                              "upvotes": 14,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gc1h92o": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1h92o/",
          "text": "90% of the time the answer to these posts is just “go to the department chair”. People still don’t get it lol",
          "author": "Jakeremix",
          "created": 1605186114,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "gc0e1jx": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0e1jx/",
      "text": "Does she think you took a picture of your screen on your phone?",
      "author": "foreverignominious",
      "created": 1605156674,
      "upvotes": 4,
      "replies": {
        "gc0g1cb": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0g1cb/",
          "text": "Was a screenshot off the computer",
          "author": "zhangman123",
          "created": 1605157767,
          "upvotes": 15,
          "replies": {}
        },
        "gc0g66j": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0g66j/",
          "text": "[deleted]",
          "author": null,
          "created": 1605157838,
          "upvotes": -4,
          "replies": {
            "gc0l8wj": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0l8wj/",
              "text": "They literally said that they used their computer to take a screenshot.",
              "author": "terrorbirdking",
              "created": 1605160879,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "gc08mc9": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc08mc9/",
      "text": "I would report that prof. That’s so unreasonable to give you a 0 for realizing you put the wrong answer. If you were in person you would be able change your answer.",
      "author": "spicymeatball97",
      "created": 1605153199,
      "upvotes": 1754,
      "replies": {
        "gc1utqm": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc1utqm/",
          "text": "Moreover, in person tests *require* that the professor answer any logistical questions or clarifications of what the test is asking that you need. That’s non-negotiable. \n\nMy engineering professor told us ahead of time to feel free to hit him up on Teams or an email during a 90 min exam he would be available for the duration of, as a way to cope with the online situation. There is zero reason this professor should have given a zero when the student used the device the test was taken on solely to communicate with the instructor.",
          "author": "HaloGuy381",
          "created": 1605194201,
          "upvotes": 350,
          "replies": {
            "gc2da42": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2da42/",
              "text": "I'm going to guess the line here was taking a screenshot, which you could then share with others to show them what's on the test. Most schools or professors have some kind of restrictions in place for that. However, taking a screenshot should not earn you a 0. Being caught sharing them with others is what should be punished if that is in fact what you're doing.\n\nFurthermore, from the sound of it, this test was designed horrendously. A test that wont let you go back and change an answer is ridiculous. Answers should never be locked in until you submit the entire test. Imagine if you were taking the test in person and you weren't allowed to use your eraser.",
              "author": "fullforce098",
              "created": 1605203045,
              "upvotes": 97,
              "replies": {
                "gc2e9hi": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc2e9hi/",
                  "text": "Admittedly, I’ve had a professor in fluid dynamics insist I use a pen, but that was because he had a hard time seeing pencil and the eraser marks, and had plenty of scrap paper if we made errors and crossed them out. \n\nI’ve also had the SAT, which doesn’t let you change answers from prior sections, but that ends up functioning like a series of tests, and in each one you can do as you wish.\n\nFundamentally, he needed to be able to show the professor what was wrong, and the only way to do that was a screenshot (or take a pic with phone, which would come off worse). Completely unfair",
                  "author": "HaloGuy381",
                  "created": 1605203510,
                  "upvotes": 29,
                  "replies": {}
                },
                "gc3atjx": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3atjx/",
                  "text": "In my University all the online tests I had were like that! I thought it was a mistake the first time  but when I emailed my professors he said it was intentional and that it was imposed by the university to prevent students from cheating...",
                  "author": "adorablyshocked",
                  "created": 1605218308,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "gc3lsvt": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3lsvt/",
              "text": "This is one of the worst parts about online. I hate when you need clarification on the wording but can’t get it.",
              "author": "lovingtolive",
              "created": 1605224041,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gc21uil": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc21uil/",
          "text": "It’s not the manager at Arby’s. There is a proper procedure for tackling this. First, I’d talk with the prof. Good chance we aren’t getting the whole story or there was a miscommunication on one side or the other. Verify this. \n\nThen, it makes sense to speak to the dept chair. I’d hardly call this “reporting this” but the department chair will seek to resolve it. \n\nIf that doesn’t lead to a satisfactory resolution, then speak to the dean. \n\nIdk, saying “report it” makes it sound like retail, not academia.  Students aren’t customers and faculty aren’t employees tasked with serving students.",
          "author": "urnbabyurn",
          "created": 1605197649,
          "upvotes": 58,
          "replies": {
            "gc26r9i": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc26r9i/",
              "text": "I think you’re being overly critical. “Report it” to me means exactly what you said, and I’m assuming they’ve already tried to clarify this with the professor.\n\nAlso, if professors aren’t employees there to provide a service to students, then what exactly are they? Those students are paying a lot of money to be taught by that professor. This isn’t a fast food restaurant, but they are definitely customers. Students are paying a company/institution for a service, which the company/institution is fulfilling via the labor of one of its employees.",
              "author": "vendetta2115",
              "created": 1605199998,
              "upvotes": 36,
              "replies": {
                "gc276za": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc276za/",
                  "text": "Professors aren’t the same as teachers. Teaching is just one part of their job, but even then, I wouldn’t equate teaching with a service job. It takes responsibility away from students to have this view. \n\nA lose analogy would be actors in a movie or play. They are not serving the audience.",
                  "author": "urnbabyurn",
                  "created": 1605200200,
                  "upvotes": -11,
                  "replies": {}
                }
              }
            },
            "gc27o67": {
              "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc27o67/",
              "text": "Exactly this.  Yet again, /r/college's default response is \"complain to the manager\" rather than acting like an adult and having a discussion with the professor.\n\nTalk to the professor and ask what you should have done in this situation.  \"I realized I had incorrectly marked an answer and the exam doesn't allow returning to a question and changing it... I took a screenshot of the question so I could include the image when I contacted you after the exam for guidance on this matter.  I don't understand your comment about 'being on an electronic device', as the exam was administered online, so every student was on a device.  Could you explain your reasoning for the 0 score you gave me and how you would have preferred I handle this situation?\"\n\nBe an adult; use your words.\n\nedit:  AH! from another comment, it appears that the student is told their answer is wrong after moving on to the next question.  So AFTER being told the answer was wrong, then OP decided she wanted to change it.  At that point, you just have to let it go.  Talk to the prof about reverting the zero, but you have no basis to request being allowed to change an individual answer after you've been told your answer was wrong.",
              "author": "lupineblue2600",
              "created": 1605200423,
              "upvotes": 37,
              "replies": {
                "ge9dcob": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/ge9dcob/",
                  "text": "> Exactly this. Yet again, /r/college's default response is \"complain to the manager\" rather than acting like an adult and having a discussion with the professor.\n\nLmao truest thing I've heard. My universities subreddit loves to complain about \"karens\" but then they turn around and want to complain to \"managers\" (the schools president or the press lol) every time something doesnt go their way.\n\nSomeone once complained their professor wasnt wearing a mask during their lecture. The comments didnt tell them to talk to the professor about it (either in person or through email) but insisted the student take secret pics and send them to the Salt Lake Tribune. Shit was ridiculous",
                  "author": null,
                  "created": 1606832272,
                  "upvotes": 3,
                  "replies": {}
                },
                "gc3fzuq": {
                  "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3fzuq/",
                  "text": "Exactly, it's an exam. I don't understand how OP had that thought process of emailing his prof because he got an answer wrong. If you're wrong, you're wrong. You can't back track, so take that one question mistake. Obviously, you can never take pics of the exam. It doesn't take half a brain to figure out that OP is wrong here, so I don't understand people who are saying he should take it to admin. That's the shittiest idea ever, and makes it look like OP is even more entitled than he is.",
                  "author": "CrimeAt5Dollars",
                  "created": 1605220963,
                  "upvotes": 12,
                  "replies": {
                    "gc3jquo": {
                      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc3jquo/",
                      "text": "I agree. Taking pictures are not allowed because you can send to others to give them a heads up on the exam. Also if it’s a timed exam, and they obviously couldn’t reopen it, your time was up.  When I take any exam on proctortrack, it gives u a list of things not allowed. And if u do one of them, you get a zero. Like having a smartphone out. Automatic zero. Follow the rules. And I’ve MEVER heard of any professor letting you email and chamge an answer on an exam after you submitted. A regular assignment, maybe; but then again, if it’s after the due date no. \nAnd whoever said student is paying money for professors to teach....actually, we’re paying for the degree. I have professors I haven’t seen or heard their voice. They’re there to give assignments and grade them. We are not paying “to be taught” 😂 college is learn on your own pretty much.",
                      "author": "melsue1026",
                      "created": 1605222951,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gc07o1c": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc07o1c/",
      "text": "Definitely try to appeal it, maybe email her again? Not sure if emailing the department head is appropriate",
      "author": "realNeonNinja",
      "created": 1605152621,
      "upvotes": 105,
      "replies": {
        "gc0ygmo": {
          "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc0ygmo/",
          "text": "I would say if the prof is being unreasonable it isn’t wise to try email again. I would go the academic chair for the course in that case.",
          "author": "Perfectclaw",
          "created": 1605169849,
          "upvotes": 36,
          "replies": {}
        }
      }
    },
    "gc05z5c": {
      "link": "/r/college/comments/jsm5o7/professor_gave_me_a_0_on_a_test_for_emailing_her/gc05z5c/",
      "text": "Damn, what a prick! I can’t help but I Hope you manage to get this sorted out!",
      "author": "JuskBolton",
      "created": 1605151598,
      "upvotes": 149,
      "replies": {}
    }
  },
  "updated": 1634054310
}