{
  "sid": "qprj52",
  "link": "/r/college/comments/qprj52/how_do_you_deal_with_possible_career_uncertainty/",
  "title:": "how do you deal with possible career uncertainty",
  "text": "I have a dream career that everyone tells me i can do, and that makes me feel amazing. like i can actually achieve it, but i’m concerned i’ll have a lot of career uncertainty. this dream job requires moving abroad and working in what i believe is a mildly competitive field.\n\nsometimes i feel secure with myself, what i want to do, and how i’m going to do it. and other times i feel like none of it will ever happen.\n\nhow do you deal with stuff like this? is there anything to help it? it worries me a lot and i get really stressed and have anxiety about the future",
  "author": "bandtrash_ands",
  "created": 1636418186,
  "updated": 1636655307,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hjy65o7": {
      "link": "/r/college/comments/qprj52/how_do_you_deal_with_possible_career_uncertainty/hjy65o7/",
      "text": "I feel you. The fields I'm hoping to break into are in a weird place right now, so getting a good job in them is going to be a challenge. This may not work for everyone, but for me, there are two things that have eased my anxiety.\n\n\n-Building up the odds. You can't guarantee getting any job, but actively finding opportunities to build up your resume and your network will increase the odds. If you know what job hunting in your field entails, there may be aspects you can consider and start planning for. Having a plan, even an incomplete plan, is going to make things easier than if you didn't think about this at all until it's time to job hunt.\n\n\n-Finding some other plans. Obviously no one wants to do their Plan B, and ideally you should focus on Plan A as much as you can. But if you find something where you can use your skill set or do some of the things you'd like about your main plan, it can take pressure off, because regardless of what happens you'll have *something* to hold you over while you continue to apply for the jobs you want.",
      "author": "torgoboi",
      "created": 1636473791,
      "upvotes": 1,
      "replies": {}
    }
  }
}