{
  "sid": "qq4han",
  "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/",
  "title:": "How do you make friends at a community college?",
  "text": "It's a lot harder because there aren't any dormitories and that makes it a bit more challenging to make friends with people.( at least in my opinion it does).",
  "author": "mr_Swagerbossr420",
  "created": 1636466988,
  "updated": 1636655214,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 1.0,
  "comments": {
    "hjyssr4": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hjyssr4/",
      "text": "you start a spanish study group with an unlikely crew of misfits",
      "author": "melifaro_hs",
      "created": 1636482775,
      "upvotes": 18,
      "replies": {}
    },
    "hjz5x66": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hjz5x66/",
      "text": "Gonna be honest. You don’t.",
      "author": "imjustawolf",
      "created": 1636487989,
      "upvotes": 12,
      "replies": {}
    },
    "hk07alk": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hk07alk/",
      "text": "Community college is a weird limbo where its a mix of kids from high school that want to save money/repair a low high school GPA and adult students that are there to better their lives and everyone commutes. I wouldn't even bother trying, you will only know them for two years max before everyone goes their separate ways and never talk again. It sucks but it'll be easier to focus on classes.",
      "author": "Sermos5",
      "created": 1636503474,
      "upvotes": 8,
      "replies": {}
    },
    "hjyghnk": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hjyghnk/",
      "text": "You dont really",
      "author": "daltonoreo",
      "created": 1636477915,
      "upvotes": 19,
      "replies": {}
    },
    "hk1b4cu": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hk1b4cu/",
      "text": "Join a club/make friends with people from your major/make friends with classmates",
      "author": "Cerenya",
      "created": 1636522989,
      "upvotes": 3,
      "replies": {}
    },
    "hk0xk52": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hk0xk52/",
      "text": "I formed a study group with a few guys that I share all my classes with. \n\nDepending on your situation it could be incredibly hard. Be straight up with people and keep trying.  Most people in community college commute and book it out of there as fast as they can. A lot of the students are still In high school causing them to be too busy or too big of assholes to put up with for the most part. \n\nIn the end it comes down to you asking someone to be your friend. I'd start small by asking to study or work on homework. Out of 7 engineering students that are in all 5 of my classes 2 stick around to hang out. The others all go home as soon as they can. Add covid and remote learning and it is a challenge. Keep trying and you'll get there eventually.",
      "author": "sleepymedic4466",
      "created": 1636515364,
      "upvotes": 2,
      "replies": {}
    },
    "hk6ajpk": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hk6ajpk/",
      "text": "I don’t agree with the person who said to don’t even bother trying because you’ll all go your separate ways after two years. Two years is a hell of a lot of time, and it’s probably the same amount of time you’ll be spending at wherever you transfer as well. So it’s absolutely worth trying to make friends\n\nAt my 4 year it’s extremely easy to meet people through clubs. I don’t imagine a community college would be *that* different. If anything, it’ll probably be even easier since community college students who seek out clubs are probably even more willing to meet people than regular 4 year students",
      "author": "suburbanscrub27",
      "created": 1636612790,
      "upvotes": 2,
      "replies": {}
    },
    "hjxxdmj": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hjxxdmj/",
      "text": "Get involved in Student Government or a campus club, or join a sports team or get a student worker job on campus. These are the easiest ways to find like minds on campus.",
      "author": "AndyStylez",
      "created": 1636470122,
      "upvotes": 2,
      "replies": {}
    },
    "hk0oz73": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hk0oz73/",
      "text": "Get involved. Community College is one of the easiest places to make really good friends",
      "author": "Ambitious_Bonus2285",
      "created": 1636511406,
      "upvotes": 1,
      "replies": {}
    },
    "hk1vns5": {
      "link": "/r/college/comments/qq4han/how_do_you_make_friends_at_a_community_college/hk1vns5/",
      "text": "You start a study group as a fake-board-certified tutor in the attempt to sleep with a fellow student, attracting a middle-aged African American Housewife, a recovered addict, an offensive elderly moist-towel prince, a football player as well as a Middle-Eastern Asperger and then film six seasons of it.",
      "author": "voxface",
      "created": 1636539457,
      "upvotes": 0,
      "replies": {}
    }
  }
}