{
  "sid": "qnlztw",
  "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/",
  "title:": "College Grads: What was your experience after college like?",
  "text": "I'm about to graduate and feel like I don't know what to expect when I get my degree. I just want your experiences: the good, the bad, the ugly. What did you do after graduation? Were you successful?",
  "author": "Butthole_seizure",
  "created": 1636150372,
  "updated": 1636655859,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "hjh43y4": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjh43y4/",
      "text": "Still vaguely looking for a job and shitting around the house. LUL!",
      "author": "tibsies",
      "created": 1636150565,
      "upvotes": 9,
      "replies": {
        "hjhoeg7": {
          "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjhoeg7/",
          "text": "Did shitting around the house start before or after you graduated?",
          "author": "SquigglyHamster",
          "created": 1636159076,
          "upvotes": 5,
          "replies": {
            "hjhxqx9": {
              "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjhxqx9/",
              "text": "It comes in phases but yea before",
              "author": "tibsies",
              "created": 1636163386,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hjh5sne": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjh5sne/",
      "text": "College has not made me successful. All I could manage to get is a part time salaried position in my field of choice.\n\nHowever I still hope I'm the future I will be successful. Unfortunately though a degree does not garantee success",
      "author": "Impressive-Name5129",
      "created": 1636151236,
      "upvotes": 8,
      "replies": {
        "hjh67hc": {
          "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjh67hc/",
          "text": "What was your degree in if you don’t mind me asking?",
          "author": "TheNameIsZander",
          "created": 1636151405,
          "upvotes": 1,
          "replies": {
            "hjh69y4": {
              "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjh69y4/",
              "text": "Read my flair",
              "author": "Impressive-Name5129",
              "created": 1636151432,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjhnvbv": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjhnvbv/",
      "text": "I needed some time to figure out if I wanted to go into my intended field (education) so I did odd jobs for 2 years. Now I’m in grad school. \n\n🤷🏼‍♀️",
      "author": "lauthom93",
      "created": 1636158839,
      "upvotes": 3,
      "replies": {}
    },
    "hji4ij2": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hji4ij2/",
      "text": "Couldn't get a job in my math degree at first. Graduated in May 2017. \n\nGot a job as a roof salesman in June. Got fired. I'm not sociable person and I'm afraid of heights so that wasn't really a fit anyway. \n\nGot a job at a factory same day. Worked there until October. Got a job as a network engineer at a dying telecom company. \n\nConstant fear of layoffs, petty corporate rules about dress code, constant time monitoring. \n\nApplied to grad school and quit. I'm now about to have a PhD and graduate in May. \n\nHopefully I don't have to work as a roof salesman.\n\nEdit: unless you're from a top school, don't expect to get a well paying job in your field unless you go to grad school. Colleges turn out way more graduates than the economy needs.",
      "author": "DisastrousAnalysis5",
      "created": 1636166598,
      "upvotes": 3,
      "replies": {}
    },
    "hjin2xv": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjin2xv/",
      "text": "graduated in 2018, struggled the first year. BA in history minors in business and computer science. Also needed a break tbh but ultimately got into \"gig work\" which amounted to a survey to see if a product was in store, good experience etc. I made $4k in 2019 in seeing if I get carded for buying cigarettes (never smoked in my life).\n\nEnd of 2019, got a internship thinking it would be until may 2020 then crap hit the fan with director having stage 4 colon cancer then pandemic, new guy and by the time new guy and the pandemic they extended it to end of 2020 (no raise).\n\nThen 2021, worked more side jobs but I mid 2020 got a vendor job at walmart. I have had a lot of serious home stuff in 2021 (worse then 2020) but at the same time, I found more auditing employment (built on 2019 experience) but now I am back in college getting my cpa license (or close to it). so I have 7 more classes to go for that.\n\nSo hopefully 2022 is full time job, reality if I married a guy who is a bit settled (I am 27 for reference), with everything else, I might be ok with low-key no full time job but continue on with what I got, but I travel so much in my area. so 500 miles a week easily. I am exhausted but its slow and steady.\n\nI use all my degrees but have to finish projects and build on what I got and that's the issue.",
      "author": "enoughstreet",
      "created": 1636177131,
      "upvotes": 3,
      "replies": {
        "hjin3l7": {
          "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjin3l7/",
          "text": "500 miles is 804.67 km",
          "author": "converter-bot",
          "created": 1636177144,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjjm8in": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjjm8in/",
      "text": "Graduated right at the start of the Great Recession. A friend worked for a government contractor who was in the progress of renewing their contact. The new contract would have created a few additional openings, one of which was promised to me. Needless to say, their bid was not accepted and they lost the contract.\n\nSo, I decided to go to graduate school and wait out economic downturn. During my last semester I sent out a few thousand (literally) applications and ended up being hired by a Fortune 10 company. Worked there for several years only to see my job be outsourced. Was hired a few months later by another Fortune 10 company where I worked for several years before I accepted a job with different Fortune 10 company (where I work today).\n\nYeah, I consider it a success. My current annual compensation exceeds the combined earnings of my parents and siblings. No, I do not live in a HCOL location.",
      "author": "mjj092000",
      "created": 1636203052,
      "upvotes": 2,
      "replies": {
        "hjm8r0t": {
          "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjm8r0t/",
          "text": "I’m a little concerned about graduating when the economy takes a dive but I try not to let that get to me bc what am I going to do about it.",
          "author": "Butthole_seizure",
          "created": 1636245222,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjh3y1t": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjh3y1t/",
      "text": "Graduated in 2018. Long story short, no I wasn't successful. Started working at a job making just above min wage and have been stuck there ever since. And I have a ton of debt that I doubt I'll ever pay off.",
      "author": "sics2014",
      "created": 1636150498,
      "upvotes": 2,
      "replies": {
        "hjhkcil": {
          "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjhkcil/",
          "text": ">Fuck",
          "author": "Butthole_seizure",
          "created": 1636157275,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjhao0y": {
      "link": "/r/college/comments/qnlztw/college_grads_what_was_your_experience_after/hjhao0y/",
      "text": "Got an apartment and worked all the time.",
      "author": "kryppla",
      "created": 1636153200,
      "upvotes": 1,
      "replies": {}
    }
  }
}