{
  "sid": "qgpr81",
  "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/",
  "title:": "The pure ecstasy of College.",
  "text": " As a politician, your career lives and dies by the number of votes you get. During the 60’s, the public thought it only makes sense that they should be able to vote. To get someone to vote for you, all you have to do is promise to solve whatever their biggest pain point is. \n\nAnd what is the biggest pain point for young adults?\n\nCollege! The minute students could get loans so they didn’t have to pay out of pocket - colleges started jacking up their prices. Prices started going up, and it became a feeding frenzy. Colleges have started competing on who can have the best amenities to get that tuition money. And with more amenities, bigger campuses, bigger staff, the expenses have gone through the roof!  Let’s take Rutgers University for example: they have over 71,000 students at an average of around $18.5k in tuition each. But universities like Rutgers do have one advantage over these billion dollar companies, it’s that those billions are tax free. So, you opened up your college for business, you have all this tax free money pouring in, you can’t let it just sit there and collect dust, now can you? So what should you do with all this money?  What you shouldn’t do is use it to lower tuition prices bc we got to keep milking this house of cards for everything it's got!   \n\n\nWhat you should do is hoard the cash, start a hedge fund!   \n\n\nBut the problem is, if they call it a hedge fund, it would make us sound too greedy, too money hungry! So let’s call it an endowment!   “But Ember, we’re in this too deep, we need student loans, schools should get tax benefits because they’re educating our youth, endowments are important”. When you buy almost any product - if it doesn’t deliver what it promised, you get a refund. So if the promise of a degree is that it’s equals success in the world, why don’t colleges and universities offer a money back guarantee if you don’t get a job?    \n\n\nNow they say that “even though it's our fault that college is this expensive, this time it’s different - we’re just gonna give you free college. So vote for me, please!” I am not a fan of arbitrary student debt relief. I think a step in the right direction would be to let students declare bankruptcy just like any other debt.  So why is the college racket possibly history’s greatest scam? Because most scams like Bernie Madoff ponzi schemes don’t last very long. But with college, the general public has been fooled for decades. Even though most students know it’s a rip off going into it, even though they know they have no idea what they want to do with their life - they still sign that loan.   \n\n\nLinking back to recreation, that colleges overall have become a recreationally aimed institution from what we can tell off of history. Colleges have grown the arms and legs of business corporations which can be seen by the fact that new things such as football fields and rock walls have been added to campuses for students (customers) to use and to be satisfied by the provider. What students really need is an environment where they can completely focus on learning, this is achieved by a change in the system that is college. In further detail it is achieved by changing the way that degrees are given out A.K.A the refund policy. If you don\\`t get a job, you get your money back. This would force colleges to prioritize learning and would likely increase the number of persons that leave college and never find a job afterwards. But this would obviously reduce prices as its cheaper to educated than it is to recreate. Which is not what colleges want, they want money and if it means that students may not get the results they desire it does not bother the colleges as long as money remains in their wallets. \n\nWhat do you think on the matter? :0\n\nThank you for listening to my TED talk.",
  "author": "Ember203",
  "created": 1635313975,
  "updated": 1635457103,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hia8biq": {
      "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/hia8biq/",
      "text": "1. Price is from increased demand of amenities and guaranteed loans. Universities are simply responding to student's insistence on having counselors, new gyms, multicultural centers, etc. Students are looking for this extra stuff and then complaining about cost.\n\n2. Endowment contributions come from donations and the fund is fairly illiquid (buildings, land, restricted gifts: not stuff you can just convert to cash in a day). Your tuition is used to pay operating expenses and is what universities actually have for cash-on-hand.\n\n3. College is an investment. The service is the education, not the outcome. No one gives you a refund when you make a bad investment and it doesn't return well. It would be like asking for a refund on concrete when you pour it wrong and the foundation starts to crack.\n\n4. Job-based refunds would result in higher tuition because you need the margin to give them out. Income based tuition schemes (pay 10% for 10 years) would lower the risk for most students and prevent people from taking on really unviable majors because they can just get a refund if it doesn't work. The % for income based over 10 years would be based on the employment rate and salary of their major.",
      "author": "darniforgotmypwd",
      "created": 1635361953,
      "upvotes": 3,
      "replies": {
        "hichr06": {
          "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/hichr06/",
          "text": "I understand that the students have demand for gyms etc. however doesn't this relate too closely to the concept of supply in demand? after all before students were able to take out loans their possible demands weren't taken into consideration. Ever since protests would occur for students to be able to take out loans from banks, Colleges saw this as an opportunity to increase prices. When they saw that there was a decline in student numbers due to the prices regardless of the loans, they tended to customer demand you could say. After all my overall point is that Colleges operate closely if not identically to businesses, when instead they should be purely educationally motivated. Linking back to tending to customer demand, the demand of students in my opinion is to some extent irrelevant when it comes to education. This might seem harsh at first however, it is agreeable that at times the younger population doesn\\`t exactly prioritize their most important needs. To be honest, they are not to blame, they are new to the world and have only lived in it for a 1/4 of their entire lifetime. When people think college they think freedom, this freedom is at many instances abused and unproductive. Overall, with reference to graduates who found success, one could only imagine if learning was strictly focused and controlled. However it could be argued that Students need to be prepared for life through being set to their own devices, which can be agreed upon. Then again, this could simply be taught or rather, it could be taught how to learn living alone etc. This could not necessarily be done through college but through life or through coaching.",
          "author": "Ember203",
          "created": 1635398474,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi8noy2": {
      "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/hi8noy2/",
      "text": "THe endowments dont come from tuition typically, they come from philanthropy.\n\n\nI have 5 students in my class that dont really do very much, will wind up just passing and get a degree but they dont really know most of the stuff and dont have either soft or hard skills that would make them good employees or even interview well.  they also dont  go to the free Career center, resume center, writing center tutoring center mental heal a thing center etc.  So they will graduate, but are unlikely to be hired.  the school is responsible for them not getting a job?\n\nDo I get to now tell you what classes and majors you can take becasue I know these things make you employable?  Or do you get to choose music and bitch about how there are no jobs.  Can we require that you take jobs as a studio musician playing in ads or in piano bars when want you want to do it be a rock star and that is not the kind of job you had in mind?\n\nPlaces where there are tax funded higher ed exist.  And I personally think we should be moving toward this.  But you should realize that it is quite hard to get into college then and a lot of American students would not make the cut in the first place.  \n\nAnd you stay in college in those places by mandatory  attendance, handing stuff in on time, very rigorous grading etc that a great number of you also would not be able to do.\n\nYou can already prioritize your marketability for jobs i you want to do that.  Many colleges already make public and advertise their employment rate in certain programs, and their acceptance rate to grad school or med school etc.  If you pick someplace that doesnt do that , that is kind of on you for choosing a school that doesn’t .\n\nMany people find out what they want to do by going to school, some not.  But if you say you want to go to school and sign the loam and write an application that says how much you want to go to school, should I forbid you from doing that becasue I can somehow, as a member of the admissions board , read your soul?",
      "author": "PersephoneIsNotHome",
      "created": 1635338391,
      "upvotes": 2,
      "replies": {
        "hicik8n": {
          "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/hicik8n/",
          "text": "My overall point in this is that colleges work like businesses. The whole refund talk was generally a shot in the dark and its sole purpose is to get people thinking :)   \n\n\nI can see now how my post could be seen as biased against the way colleges work but rest assured that was not the intention. The initial intention which I believe can be seen 3/4 of the post is to debate about whether or not College is a business, or at least increasingly similar to how a business would operate. Another point id made is that students generally are more giving towards the recreational side of things and therefore are quite vulnerable to many things that a college offers (recreational things) such as e.g. gyms or rock walls. This vulnerability in my opinion shouldn't be exploited by colleges, by simply feeding into it. Instead maybe (just to get people thinking) this vulnerability should be strengthened.",
          "author": "Ember203",
          "created": 1635399042,
          "upvotes": 1,
          "replies": {
            "hid1kqx": {
              "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/hid1kqx/",
              "text": "There may be some examples of true recreational things causing tuition increases, but for the most part it is other support and services (internships, mental healt, disability accommodations and office, and such like).\n\nNot sure what you thought universities were run like?  They have to cover their costs and the costs of capital outlay (new buildings and repairs, updating computers etc). How did you think they balance the budget?\n\nIt is not that the post was biased, but not really though out at all and wrong in many aspects",
              "author": "PersephoneIsNotHome",
              "created": 1635414585,
              "upvotes": 2,
              "replies": {
                "hifg3b5": {
                  "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/hifg3b5/",
                  "text": "I agree, there's room for improvement. For the recreational side of things what interests me most is, would education be better off without them?  \n\n\nEdit: \"Room for improvement as in, in my post\"",
                  "author": "Ember203",
                  "created": 1635453995,
                  "upvotes": 1,
                  "replies": {
                    "hififhd": {
                      "link": "/r/college/comments/qgpr81/the_pure_ecstasy_of_college/hififhd/",
                      "text": "These are things that students specifically want.  So talk to your peers.  This is not some corporate conspiracy",
                      "author": "PersephoneIsNotHome",
                      "created": 1635454939,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}