{
  "sid": "qtmpr3",
  "link": "/r/college/comments/qtmpr3/cough_for_2_months/",
  "title:": "cough for 2 months",
  "text": "has anyone else just been sick the entire time they’ve been at college? I caught a cold my first week here and I’ve had a dry cough ever since. (It’s not covid). Many people I know have had a cough for months, too. Is this normal or should I go to the doctor?",
  "author": "pinkwritergirl",
  "created": 1636883966,
  "updated": 1637181773,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hkkn9ih": {
      "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkkn9ih/",
      "text": "It's not normal. The fact that moving induced it might give clues.\n\nCould be allergies, dry room at night, issue with your bedding, etc. Are these other people all living in a dorm?",
      "author": "darniforgotmypwd",
      "created": 1636886060,
      "upvotes": 13,
      "replies": {
        "hkmaiyi": {
          "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmaiyi/",
          "text": "yeah. My roommates also have the cough, and other dormers I know have been constantly getting colds.",
          "author": "pinkwritergirl",
          "created": 1636915426,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkl0rgw": {
      "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkl0rgw/",
      "text": "I could be totally wrong and I’m unsure about this but they say when u first get to college you’ll prob get sick because you’re around so many people at once and living around each other etc.",
      "author": "mike_wazowskis_ass",
      "created": 1636895238,
      "upvotes": 3,
      "replies": {
        "hkmam1d": {
          "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmam1d/",
          "text": "this makes sense especially bc we were using masks for so long so our immune systems are probably weak",
          "author": "pinkwritergirl",
          "created": 1636915458,
          "upvotes": 0,
          "replies": {
            "hkmbfg8": {
              "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmbfg8/",
              "text": "Masks prob not. It’s a general college thing. I started in 2017 and everyone told us this before we went. Even before that it was a thing!",
              "author": "mike_wazowskis_ass",
              "created": 1636915763,
              "upvotes": 3,
              "replies": {}
            },
            "hkmgvvc": {
              "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmgvvc/",
              "text": "Nah a year and a half of masks isn’t going to do anything to your immune system.  It’s just being around so many different new people all the time sharing everything",
              "author": "kryppla",
              "created": 1636917741,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hklnq4g": {
      "link": "/r/college/comments/qtmpr3/cough_for_2_months/hklnq4g/",
      "text": "Yup. Some people have called this the “frat flu”. I’ve had this cough for months too. First urgent care visit about 2 weeks in to college I completely lost my voice and  it was bronchitis. I had to to the ER because the cough kept getting worse. They have me more antibiotics and an inhaler. About 3 weeks later i started getting sick again, they gave me antibiotics but didn’t really say what it was. About 3 weeks later I went to urgent care again and was told I had a sinus infection. Since then nothing too serious except my cough is starting to come back and this past week I had a little cold (sore throat, stuffy nose)",
      "author": "Traditional-Agent776",
      "created": 1636906316,
      "upvotes": 2,
      "replies": {
        "hkmauyn": {
          "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmauyn/",
          "text": "omg that sounds horrible!! I hope you feel better soon. I think I should go to the doctor too lol",
          "author": "pinkwritergirl",
          "created": 1636915552,
          "upvotes": 1,
          "replies": {
            "hkmbr31": {
              "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmbr31/",
              "text": "It was awful! Definitely go to the doctor, if it’s a sinus infection or bronchitis you wanna get that checked ASAP because if you don’t get it treated it’ll just get worse!",
              "author": "Traditional-Agent776",
              "created": 1636915879,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hklz3q2": {
      "link": "/r/college/comments/qtmpr3/cough_for_2_months/hklz3q2/",
      "text": "It could be mold too. I've heard some dorm stories about mold in the vents and air causing everyone to get sick.",
      "author": "genericusername_____",
      "created": 1636911041,
      "upvotes": 2,
      "replies": {
        "hkmardc": {
          "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmardc/",
          "text": "Thank you, I’ll keep that in mind. It probably isn’t mold tho bc our dorms are brand new (they were built this summer)",
          "author": "pinkwritergirl",
          "created": 1636915514,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkmmb2i": {
      "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmmb2i/",
      "text": "Yeah go to urgent care. Ask about bronchitis and lung x-rays. Everyone at UCLA got sick week 1 and many are still sick now. Those that recovered got sick again and the cycle repeats. College is just one big petri plate. Get your flu shots and covid vaccines and that should prevent some colds but the big thing going around is strep and it mutates like crazy so chances are you will get it multiple times with different symptoms and it’ll develop into bronchitis if you don’t rest and take care of your body.",
      "author": "Parking_Cranberry935",
      "created": 1636919782,
      "upvotes": 2,
      "replies": {
        "hkqk5zr": {
          "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkqk5zr/",
          "text": "Thank you! I’m at UCLA too so this is good to know",
          "author": "pinkwritergirl",
          "created": 1636994760,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkmmem6": {
      "link": "/r/college/comments/qtmpr3/cough_for_2_months/hkmmem6/",
      "text": "Try getting a vitamin c supplement and see if it improves after 2 wekeks",
      "author": "kadxar",
      "created": 1636919819,
      "upvotes": 2,
      "replies": {}
    }
  }
}