{
  "sid": "q4hju8",
  "link": "/r/college/comments/q4hju8/do_i_need_to_apologize_to_my_professor_for_asking/",
  "title:": "Do I need to Apologize to my Professor for asking him to Review my Application for a Research Project?",
  "text": "About two weeks ago I sent in an application for a study-abroad research program. When I first learned about it I had about a month until the deadline and immediately started working on it and sent my first draft to the professor who was overseeing the project for my department - the final application and other materials went to the physics department who are in charge of the whole project. I had sent it to the advisor first because students in the past had run similar applications by professors to get input and it was never a big deal. He pointed stuff out to me and I revised my application, but it took me 5 days because I had to balance it with exams. When I sent him my revision he got back to me saying he wouldn't be reviewing this one because it would be a \"conflict of interest\". I went to the school Writing Center and polished it up - it didn't need much work - and turned it in 2 weeks before the deadline. This being said, the professor's words keep eating at me. At first I thought it was his way of hinting that he didn't think I was up to snuff; but, that didn't make sense because I met all the requirements for the position, I have never had an ill interaction with this man (as in we barely interact and when we have it was always amicable), and I assumed we had the same goal - picking a good student able to represent the department as well as do the work needed for the research project.\nI didn't bring it up to him sooner because I wanted to sit on it and try to think if maybe I did something wrong. All I can think of is maybe I was the only one of the 5 or 6 applicants giving him my application to review and maybe I wasn't supposed to? Perhaps I put him in a position where he could be seen as showing favoritism, but I thought he was supposed to be available to look over our applications and helping in general as it is the physics department that chooses the students based on the application and other materials sent in. He also had no issue looking at it the first time and both times I made sure he knew he had zero obligation and it wouldn't hurt my feelings if he said no. Maybe I should have had another professor review it, but at the time I chose him because I thought that since he actually had his hand in the project and knew what was going on he should be the one to review my application. \n\nI don't know. I don't know if I did something wrong and need to apologize, or if I just need to let it go, or what. I feel like I need to clear the air, but we've run into each other a couple times since then and he had made no move to bring it up and tell me if I messed up or not. It's also been a couple weeks and I feel that if I bring it up - even if I use asking when we'll hear who got picked as a buffer or segway - he'd see me as a drama queen looking to stir the pot or something. I just don't know what to do about it, but a big part of me feels like I should at least explain my reasoning behind my choices and apologize whether or not I put him in an undesirable position.\n\nWhat do you guys think?",
  "author": "FuzzyWuzzyTRex",
  "created": 1633769927,
  "updated": 1634083151,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg03zx5": {
      "link": "/r/college/comments/q4hju8/do_i_need_to_apologize_to_my_professor_for_asking/hg03zx5/",
      "text": "Bachelors degrees should be taught by people who are actively engaged in research.\n\nThis means that like your professor said it could very well be a conflict of interest as he is writing a paper on a similar topic or engaging in research of a similar topic. The lecturer doesn't want his accidemic views interfering with your research or your accidemic views interfering with his.\n\nI wouldn't think much of it.",
      "author": "Impressive-Name5129",
      "created": 1633800236,
      "upvotes": 1,
      "replies": {}
    }
  }
}