{
  "sid": "qfl89z",
  "link": "/r/college/comments/qfl89z/i_think_i_offended_my_professor/",
  "title:": "I think I offended my professor",
  "text": "I had a meeting with my advisor about my classes (he’s also a professor that I’ve had all throughout college) and I had asked for his opinion on one of the internships I was considering (I really wanted to intern at Disney World). This professor runs a well known business that is partnered with the school and interning at this place is one of our options. He had talked previously about how he knew people that had worked at Disney and that he could put us in touch with them if we were interested. So during our meeting, I asked him if he knew of anyone I could talk to about interning there. I thought maybe that they would be able to tell me if it was a good place to intern at or not. When I had asked him this, he said “People in my position usually don’t do that. It’s not a good look for me to help students get jobs.” He sounded upset saying this. This threw me off and I’m a little worried he thought I was looking for a handout. I tried explaining to him that I just wanted to know if it was a good place to intern or not. Not for a job. He basically told me that only “lazy people” go to work for Disney since there are so many people that work in the position that I was considering. That I wouldn’t be learning anything. \n\nThis was literally my dream job, but now I’m more worried that I’ve upset this guy. I have a lot of respect for him, but this was completely out of no where as we’ve had really good conversations before. I even told him several times before (literally the first day of the first class I had with him) that I intended to work there. I don’t get it.",
  "author": "WickedPuffin",
  "created": 1635181272,
  "updated": 1636177570,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi0cv2x": {
      "link": "/r/college/comments/qfl89z/i_think_i_offended_my_professor/hi0cv2x/",
      "text": "Seems a little odd to me. Could just be something that varies from person to person or field to field. Do you know him very well and does he know about your work ethic/skills/etc? \n\nIn my experience, I've had at least two professors speak to people they know about employing me and more than that have pointed me towards job openings that they knew of in my field. Every professor I've ever spoken to about this sort of thing has been more than happy to help me out because they know me well and know that I'm reliable. I'm in a really small department though and have had a lot of time to spend with these people",
      "author": "vampyreontitus",
      "created": 1635183331,
      "upvotes": 1,
      "replies": {
        "hi0ie35": {
          "link": "/r/college/comments/qfl89z/i_think_i_offended_my_professor/hi0ie35/",
          "text": "Yeah I know him pretty well. I had already interned for him by that point and I had received a lot of praise from the employees compared to a lot of the other interns. There were a few times they actually said they trusted me more than the others, so I got to do more intense work on my own. I would hope that he would say that (the lazy people comment) just because he thinks more highly of me and would want me to seek out better opportunities. I think the whole partnership is so that he can bring in more employees as well as create better ones in the field we work in, so maybe he was looking for me to take soul interest in his business…but idk. That’s not very realistic if he wants to work at a school and run a business expecting everyone to go to him for a job. \n\nI don’t even plan on going to Disney anymore. It’s just the fact that he seemed offended that I’d ask after already saying it was an option is what’s really bothering me. I don’t want him to think I was looking for an easy way in. I’ve never even considered doing anything like that before. Though, I’m realizing now that almost everyone at my school relies on connections to get the jobs they want. Many of the people here already come from families that work in the field we are in. I am not.",
          "author": "WickedPuffin",
          "created": 1635185597,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi0thu9": {
      "link": "/r/college/comments/qfl89z/i_think_i_offended_my_professor/hi0thu9/",
      "text": "Sounds like he expects more from you than playing a character",
      "author": "MutedInvestigator847",
      "created": 1635190036,
      "upvotes": 1,
      "replies": {
        "hi0zp0c": {
          "link": "/r/college/comments/qfl89z/i_think_i_offended_my_professor/hi0zp0c/",
          "text": "The internship is for an animal keeper position. So I’d really hope I wouldn’t be “playing a character”. I think he’s more worried I’d be bored and not learn anything since they have many many keepers.",
          "author": "WickedPuffin",
          "created": 1635192508,
          "upvotes": 1,
          "replies": {
            "hi11btv": {
              "link": "/r/college/comments/qfl89z/i_think_i_offended_my_professor/hi11btv/",
              "text": "Maybe he doesn’t like how one of the richest companies in the world takes advantage of college students . Disney is overpriced",
              "author": "MutedInvestigator847",
              "created": 1635193167,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}