{
  "sid": "qujmhf",
  "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/",
  "title:": "Don't Be Fooled People Are Studying",
  "text": "I know it's comforting knowing that you're not the odd one out but please don't be fooled, those fuckers are definitely studying.\n\nI work in the campus library, a few days ago I saw a regular of mine approaching and went to go find the book he regularly checks out.  After checking it out, my partner for the shift commented how surprising it was to finally see him studying  even though it was so late in the semester. Alright here's the thing, this dude had been coming so regularly from since the start of the semester that I had remembered his student ID number, He was definitely one of the most committed students I had seen coming everyday for 2-4 hours daily,  so obviously I had no idea what the hell she was talking about.\n\nHe was in her Biochem class and regularly came to lecture with a pen and a sheet of paper, she had expected him to withdraw quickly simply because of his discussed shit study habits and his stated unreadiness for every exam. Even though she'd struggle in the class, she felt better knowing that at least she was doing better than someone. \n\nNow I'm no Biochem person ( I'm a Neuro person), but I know the class is hard. I can understand thinking maybe he was just getting lucky on the exams but luck can only go so far, so it was either he was doing something to prepare or he was a god.  She spent the rest of our shift asking me if I was a 100% sure it was the same guy. And I am.  She fell for the college scams of \" Oh don't worry I didn't study either\",\n\nNow I know better than to fall for that shit because I see it first hand, if you hear that from someone the majority are liars. They are preparing, they're attending office hours, attending tutoring, coming to the library reserving study rooms and spending hours. They're prepared, they wouldn't still be in the class if they weren't doing well. (Unless they were self sabotaging their GPA).  Don't feel comforted start studying your ass off.\n\n:3",
  "author": "monochroma_1487",
  "created": 1636992025,
  "updated": 1637181389,
  "over_18": false,
  "upvotes": 360,
  "upvote_ratio": 0.99,
  "comments": {
    "hkrkyfw": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkrkyfw/",
      "text": "I feel pretty adamant about sticking to \"you don't know what you don't know\". I generally hear it a lot in people.\n\n\"I'm not smart because nobody else studies for these exams and they still better grades than me.\"\n\nThe thing is, it's impossible absolutely know how much other people have studied unless they've explicitly told you. It's always these off the cuff assumptions. It's a bad habit and a hard one to kick. There's a certain kick back of now figuring out how much you actually don't know. It's like the smarter you are, the more you know that you *don't know*. \n\nI will admit, I always check my canvas for average scores put out after exams. That's a good quantifiable way to measure your standing.",
      "author": "Awkward_Mail_2786",
      "created": 1637009277,
      "upvotes": 80,
      "replies": {
        "hksg1ru": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hksg1ru/",
          "text": "To add to this- some classes are easy for some people and hard for others. You should study based on how your performance is reflecting your study habits, not what somebody else is doing. I like orgo and I do fine without studying very much, but physics makes me wanna pull my hair out, for example. In every class there are going to be people studying various amounts based on how much they individually need to.",
          "author": "Jack_Rickle",
          "created": 1637022118,
          "upvotes": 24,
          "replies": {
            "hkt9c3c": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkt9c3c/",
              "text": "I can probably do any math class subject after only revisiting it twice but if I need to remember and recite more than 5 words I'm going to need a week to prepare",
              "author": "kadxar",
              "created": 1637035326,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "hku8f3u": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hku8f3u/",
          "text": ">\tI will admit, I always check my canvas for average scores put out after exams. That's a good quantifiable way to measure your standing.\n\nThis is always a good idea and I hate when professors hide that in Canvas",
          "author": "Sushi_Whore_",
          "created": 1637060039,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkr7rvc": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkr7rvc/",
      "text": "One thing. Some people, if they have to take the class, will stay in the class if they are failing so that when they retake the class, everything will at least be familiar. The good grade they get the second time will replace the failing grade they got the first time, so their GPA will be fine",
      "author": "SnapdragonPBlack",
      "created": 1637004092,
      "upvotes": 99,
      "replies": {
        "hkudsgb": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkudsgb/",
          "text": "That doesn’t work at the university I went to. They just average your two grades.",
          "author": "ChickenPotLie",
          "created": 1637064033,
          "upvotes": 7,
          "replies": {
            "hkv3ply": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkv3ply/",
              "text": "I would hate that. I'm glad that the university I go to replaces the grade",
              "author": "SnapdragonPBlack",
              "created": 1637077027,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hksd0e2": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hksd0e2/",
      "text": "Reminds me of that duck analogy: \"Look at a duck.  Above the surface, it's peaceful, and gliding along smoothly. Below the surface, it's kicking like hell to stay afloat.\"",
      "author": "kawaii_ninja",
      "created": 1637020754,
      "upvotes": 26,
      "replies": {
        "hkt1ohj": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkt1ohj/",
          "text": "[https://www.stanforddaily.com/2012/09/26/the-new-duck-metaphor/](https://www.stanforddaily.com/2012/09/26/the-new-duck-metaphor/)\n\nducks float. it would be a huge waste of energy if they didn't, and evolution is probably why ducks float.\n\nbut i get what you mean.",
          "author": "wobbletelescope",
          "created": 1637031763,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hkrpo4l": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkrpo4l/",
      "text": "I was totally procrastinating, this last sentence called me out... I'm gonna close Reddit 😅",
      "author": "Maeva_132",
      "created": 1637011113,
      "upvotes": 24,
      "replies": {
        "hksjuhk": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hksjuhk/",
          "text": "Not me on Reddit 40 min before my final 😂😂\n\nUpdate: first final went pretty well only 3 more left now",
          "author": "BillerBillions",
          "created": 1637023847,
          "upvotes": 13,
          "replies": {
            "hku65zf": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hku65zf/",
              "text": "YEAHHH congrats! Good luck with the other ones!",
              "author": "Maeva_132",
              "created": 1637058194,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hksq60m": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hksq60m/",
      "text": "I think it's also healthy not to judge people based off of their note taking habits. Even though I'm a totally average student, people often assume that I'm either stupid/lazy or a genius because I don't take notes in class. In reality it's neither. I have adhd and chronic tendinitis, so my handwriting is too slow and too distracting for me to get effective learning from the lecture. IMO it's pointless to try to guess at another person's intelligence or work ethic from what you see of them in a lecture room.",
      "author": "Vlistorito",
      "created": 1637026677,
      "upvotes": 16,
      "replies": {
        "hkt37ey": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkt37ey/",
          "text": "i judge the dude in my math class who is on their computer doing stuff not related to the lecture and hasn't raised his head to look at the board once the entire lecture. i know he's not doing stuff related to lecture because the prof doesn't post lecture notes before class and I can see his screen close enough to read the emails and code (not LaTeX) he writes. idk why he shows up for the math class, we literally have to walk from one end of campus to the other. he would literally save time and energy by not showing up.\n\ni wouldn't care about any of this except he has the macbook with the super loud keys, and it's hell while I try to focus in math class. funnily enough, in the previous class, he is really quiet, either because he takes notes or he doesn't type then.",
          "author": "wobbletelescope",
          "created": 1637032451,
          "upvotes": 2,
          "replies": {
            "hktvoxc": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hktvoxc/",
              "text": "Yeah idk. I would imagine it has something to do with holding yourself accountable. If you're still going to lectures it's easier to stay focused on that class in general.",
              "author": "Vlistorito",
              "created": 1637049405,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hkts5xe": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkts5xe/",
          "text": "Depends on the class and person, but there’s definitely a correlation between taking notes in a class and being a good student.",
          "author": "HighwayDrifter41",
          "created": 1637046683,
          "upvotes": 2,
          "replies": {
            "hktvjkj": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hktvjkj/",
              "text": "Correlation maybe, but that's a bit unfair since nobody takes notes because they're lazy, whereas the opposite can be true. If it's your third year and they're still there, I'd say the correlation isn't valid anymore.",
              "author": "Vlistorito",
              "created": 1637049291,
              "upvotes": 2,
              "replies": {
                "hkw5ntz": {
                  "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkw5ntz/",
                  "text": "Hey man you do what’s best for you, sounds like you’ve found something that works. But all I’m saying if I had to guess which person was a better student between someone who take notes and someone who doesn’t, it’s not hard to see why I’d chose the person who takes notes.",
                  "author": "HighwayDrifter41",
                  "created": 1637091960,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkqr1xd": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkqr1xd/",
      "text": "Im gonna go and study for the biochem class im failing rn. If I get an A in the 3rd and final exam I can get a B because the final is worth more than an exam and will replace the lowest test score",
      "author": "TheRapidTrailblazer",
      "created": 1636997493,
      "upvotes": 21,
      "replies": {}
    },
    "hktzoz0": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hktzoz0/",
      "text": "My kid is freshman and he's definitely giving up partying for studying on weekends. He and another student even reserve back to back rooms so they get 5hr private room in library. He's not a gifted student so he has to work for it. I feel like he's making up for 2-3 years of high school in one semester. He's even starting to use a wall calendar after missing a quiz.  So many people are studying. Partly I think they don't want to lose whatever scholarship they have.",
      "author": "jetclimb",
      "created": 1637052635,
      "upvotes": 4,
      "replies": {
        "hky3w5k": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hky3w5k/",
          "text": "[deleted]",
          "author": null,
          "created": 1637121913,
          "upvotes": 1,
          "replies": {
            "hkyd9nc": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkyd9nc/",
              "text": "More like organized. Use calendar. Also learning to make most of his study hours. Like studying the material you don't know vs all the material. That jumped his sat score huge in just one test. He hadn't used his answer key from previous test. Once he did he focused on what he got wrong. We al need to find what works for us. He's a good student but going from top 5% to top 1% is a huge difference. Either way I'm happy if he's happy.",
              "author": "jetclimb",
              "created": 1637127057,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hksk65l": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hksk65l/",
      "text": "The people who get an A and say “ wow “ can’t believe it I barely studied typically are just trying to boost self esteem ( can confirm, got a BS in biology and now am in graduate school). Lol someone should call these people out! I remember the days of feeling like an idiot and getting a meer A- while the “ non Studying “classmate got almost a perfect test score each time.\n\nPeople who get high grades always study! This is a FACT",
      "author": "Top-Implement-3375",
      "created": 1637023993,
      "upvotes": 8,
      "replies": {}
    },
    "hkss3ax": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkss3ax/",
      "text": "Studying for biochem final as we speak. Lol",
      "author": "WaterCape",
      "created": 1637027519,
      "upvotes": 1,
      "replies": {}
    },
    "hku596t": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hku596t/",
      "text": "Honestly everyone studies just depending on the University you know the University people think others don't it's weird.  My brother is at Stanford and hes like it seems like no one studies but he knows for a fact everyone does it's just you don't see people study typically.\n\nWhile at my University everyone studies and everyone knows it because the classes are ridiculously hard.",
      "author": "pygmypuffonacid",
      "created": 1637057428,
      "upvotes": 1,
      "replies": {}
    },
    "hkto4jh": {
      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkto4jh/",
      "text": "Nah this is BS. I haven’t done an ounce of work all semester and I’m still doing better than most ppl in my classes cuz even though they study they’re dumb as a bag of bricks. Truth is, if you are good w logical puzzles and riddles and shit like that, most of the time you can teach yourself all the material u need to know using context clues from the other questions on the test",
      "author": "dskcnsnskcnn",
      "created": 1637043842,
      "upvotes": -11,
      "replies": {
        "hkudhqk": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkudhqk/",
          "text": "I hope you know this is a very stupid response.",
          "author": "monochroma_1487",
          "created": 1637063827,
          "upvotes": 3,
          "replies": {
            "hkvmsyb": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvmsyb/",
              "text": "Nah it has carried me through school for like 10 years, maybe might not work for like math or physics but u could get all the info u need in like an hour of studying. Just write down the main formulas",
              "author": "dskcnsnskcnn",
              "created": 1637084595,
              "upvotes": 1,
              "replies": {
                "hkvn2ta": {
                  "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvn2ta/",
                  "text": "Does that negate that this was a stupid response to post? Cause I’m telling you it doesn’t.",
                  "author": "monochroma_1487",
                  "created": 1637084701,
                  "upvotes": 1,
                  "replies": {
                    "hkvoxpm": {
                      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvoxpm/",
                      "text": "It’s my experience with college. Idk why you’re so upset about it. You posted your experience, I posted mine because it was a bit contradictory. It was a perfectly reasonable response to this post.",
                      "author": "dskcnsnskcnn",
                      "created": 1637085398,
                      "upvotes": 0,
                      "replies": {
                        "hkvp5l8": {
                          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvp5l8/",
                          "text": "That’s great, but please reread over your response, contemplate why you’re getting downvoted and then maybe you’ll hopefully come to the conclusion why I’m saying this was a stupid response.",
                          "author": "monochroma_1487",
                          "created": 1637085481,
                          "upvotes": 1,
                          "replies": {
                            "hkvpyi2": {
                              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvpyi2/",
                              "text": "What, cuz I said most ppl in classes are dumb as shit? Yea that’s a fact. A lot of ppl in college shouldn’t be in college. It’s this whole push to get every high schooler into higher education that’s the problem. Some ppl just aren’t meant for academia, that’s okay, they can probably do other things, but the fact remains that they fucking suck at thinking abstractly",
                              "author": "dskcnsnskcnn",
                              "created": 1637085790,
                              "upvotes": 0,
                              "replies": {
                                "hkvq6ai": {
                                  "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvq6ai/",
                                  "text": "Uh huh nice nice that’s great for you. I mean if you wanna stay go on ahead idrc but your response is still dumb.",
                                  "author": "monochroma_1487",
                                  "created": 1637085874,
                                  "upvotes": 1,
                                  "replies": {
                                    "hkvqnm2": {
                                      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvqnm2/",
                                      "text": "I mean that’s your opinion",
                                      "author": "dskcnsnskcnn",
                                      "created": 1637086059,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hkvpbf5": {
                      "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvpbf5/",
                      "text": "And this isn’t like me being an arrogant dick or anything. This is literally a skill I have taught a bunch of my friends and it helped them. Just think about tests differently and classes become way easier. Just view the test as a cheat sheet and your scores improve",
                      "author": "dskcnsnskcnn",
                      "created": 1637085543,
                      "upvotes": 0,
                      "replies": {
                        "hkvph8d": {
                          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hkvph8d/",
                          "text": "But that’s how it sounds lol. Great for you that you’ve got that skill but not the right phrasing.",
                          "author": "monochroma_1487",
                          "created": 1637085605,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hky43ei": {
          "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hky43ei/",
          "text": "[deleted]",
          "author": null,
          "created": 1637122011,
          "upvotes": 1,
          "replies": {
            "hky978z": {
              "link": "/r/college/comments/qujmhf/dont_be_fooled_people_are_studying/hky978z/",
              "text": "Nah. I take the classes for the degree. Everything I want to learn I teach myself. More efficient that way. I reach out to other profs for help if I’m stuck, they are usually very responsive",
              "author": "dskcnsnskcnn",
              "created": 1637124710,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}