{
  "sid": "qcuutx",
  "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/",
  "title:": "Ideas for Deviant Behavior/Actions",
  "text": "I’m taking a sociology course this semester, and one of our assignments is to perform a deviant act. The point of the assignment is to recognize negative sanctions when breaking social norms. Our only boundaries are that the act is legal and done to/in front of other people. An example my professor gave was a past student moving their roommates things one inch to the left over two weeks, or driving the legal minimum speed on the interstate. \n\nI’m looking for more ideas on something I could do within 5 days and is funny/entertaining for me and my professor. I don’t have a roommate, but I could go mess with my fiancé and his roommate (they live in an apartment off campus), as long as it wouldn’t get anyone too angry. I can also do things on campus or mess with the people in my dorm hall/on my floor. Traveling off campus is also an option, as I have a car and live in a fairly large town. Any ideas? TIA",
  "author": "am112898",
  "created": 1634831534,
  "updated": 1634849196,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hhi5mbh": {
      "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/hhi5mbh/",
      "text": "Damn wish I had that assignment, sounds fun lol",
      "author": "DeepSpaceOG",
      "created": 1634831793,
      "upvotes": 2,
      "replies": {}
    },
    "hhi6xcf": {
      "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/hhi6xcf/",
      "text": "I did something like this for an assignment back in high school. I wore shirts inside-out and backwards and that was a good way to get some confused looks from people passing by. In my experience no one actually approached me and mentioned or asked about it though.",
      "author": "A_Rest",
      "created": 1634832338,
      "upvotes": 2,
      "replies": {}
    },
    "hhicuot": {
      "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/hhicuot/",
      "text": "Stand the wrong way in line. Planking. Wear dramatic facepaint to classes. Dance to music in the quad, but choose some kind of music that would be \"odd\" to your campus... like Greek techno or 1920's folk.",
      "author": "zifmer",
      "created": 1634834683,
      "upvotes": 1,
      "replies": {}
    },
    "hhidcby": {
      "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/hhidcby/",
      "text": "Sociology professor, used to do this assignment\\*.  The best papers have typically come from things that are really subtle, like not holding the door for people right behind you or facing the wrong way on the elevator.  Because these are norms that we really do without thinking, breaking them tends to produce more insight than the wackier things.  \n\nHowever, at the same time, I really got a kick out of some of the crazy stuff.  I had a girl who wore her prom dress to class, for instance, or a student who carried around and drank water out of a baby bottle instead of a regular one for a day.  \n\n\n  \n\n\n\\*stopped doing it because people kept doing dangerous and/or illegal things, despite having to get it pre-approved -- they'd just change their minds and not tell me :/",
      "author": "FamousCow",
      "created": 1634834875,
      "upvotes": 1,
      "replies": {}
    },
    "hhilxul": {
      "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/hhilxul/",
      "text": "We had a similar group assignment in a drama class in college.  The professor said we had to stage \"a public happening,\" something that caught people's attention in a negative way.  Same requirements, had to be legal, couldn't cause actual harm to anyone, etc.  We registered for one-day use of one of the tables/booths in the student union where various groups pass out fliers about student groups and political causes and campus events, etc.  We all dressed in really formal clothing and handed out fliers advocating the repeal of the 19th Amendment (which gave women the right to vote).  The professor was nearby for about an hour to watch us at the booth.  What was funny was that most students just grabbed the flier and walked on by without looking at it, but occasionally one would read it and circle back to \"discuss\" it with us.  As part of the assignment, we couldn't break character and had to pretend we were serious.  Most just wandered away thinking we were idiots, but one guy got really upset, and the professor had to come over and tell him it was all staged.  Personally, I thought the assignment was stupid; I didn't need an assignment to teach me that people don't behave/react well when highly emotional, but I do still remember the assignment years later.",
      "author": "ChemMJW",
      "created": 1634838286,
      "upvotes": 1,
      "replies": {}
    },
    "hhitme6": {
      "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/hhitme6/",
      "text": "Getting mad at and yelling at someone in public for no reason.\n\nNot wearing a shirt or pants when you get your groceries.",
      "author": "darniforgotmypwd",
      "created": 1634841407,
      "upvotes": 1,
      "replies": {}
    },
    "hhjbkpu": {
      "link": "/r/college/comments/qcuutx/ideas_for_deviant_behavioractions/hhjbkpu/",
      "text": "Run your cart into other people's carts at the super market. \n\nUse the restroom with the door open. \n\nDon't shower.\n\nI feel like I'm just talking about India now.",
      "author": "Awkward_Mail_2786",
      "created": 1634848640,
      "upvotes": 1,
      "replies": {}
    }
  }
}