{"sid": "p4utg6", "link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/", "title:": "Dorm Essentials Help - From an Older Sister Filling in for Mom", "text": "Hello Friends! \n\n\nMy little brother and I are shopping for dorm stuff today. We are estranged from my mom, so I'm doing my best to fill the role, and get him ready for college!\n\n\nWhat items would you recommend that aren't on all the 'dorm room essential' lists? \n\n\nThank you so much guys! I appreciate you!\n\nEdit: you guys have been so wonderfully kind and helpful! Thanks again for all your help and support. It really does mean a lot.", "author": "whatanexperienceitis", "created": 1629038858, "retrieved": 1632802702, "over_18": false, "upvotes": 676, "upvote_ratio": 0.99, "comments": {"h974ql4": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h974ql4/", "text": "One thing I didn’t see on this thread is food. Definitely helps to have some staple meals/snacks when he doesn’t want to go out or the dining hall closes. I also bought purified water jugs/bottles I don’t trust dorm water.", "author": "GMan_SB", "created": 1629143209, "upvotes": 1}, "h95tq0n": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h95tq0n/", "text": "You sound like a wonderful sister for doing all this for your brother! I’m not sure if this has been mentioned in the comments, but snacks! Bring lots of snacks for him to keep in his room, and things like cups of noodles, microwave Mac and cheese, etc. if he has a microwave in the dorm. Also, a reusable water bottle!", "author": "snortbag123", "created": 1629124612, "upvotes": 1}, "h95hetf": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h95hetf/", "text": "I really liked having 2 sets of bed sheets. I rarely had time to change my sheets and do laundry at the same time, so I would change my dirty sheets for my clean ones and throw the dirty ones in the laundry hamper for when I had time. I did the same with towels. You don't want too much of anything but 2 sets of sheets and towels helped me a lot.\n\nAlso, depending on the layout of the dorm and the amount of storage space, I like to fill 2-4 small plastic storage containers for moving, and pack everything else in cardboard boxes. That way I had extra storage space, and a few available containers when moving out again, but I wasn't overwhelmed by the amount of boxes and containers I had to fit in a tiny room.", "author": "JuniorPlane", "created": 1629119016, "upvotes": 1}, "h958r2h": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h958r2h/", "text": "Medicine, 2 of each dish and utensil, slides, shower shoes, a Swiffer, and a kettle or coffee pot (Not a k-cup one).", "author": "crying_onion123", "created": 1629114156, "upvotes": 1}, "h94k3ay": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h94k3ay/", "text": "Ethernet cord because f*** dorm wifi", "author": "AliNotAllie", "created": 1629094799, "upvotes": 1}, "h94gpt5": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h94gpt5/", "text": "Might not be the top of everyone’s list but it’s something some people don’t consider: QUALITY binders if you can fit them in. Not those 30 cent ones that are glorified cardboard. Reasons are two fold: they last a long time (rolling on four years for one I think) and they can hold a decent amount of things so they can use one or two instead of like 4 or 5 binders", "author": "WackyNameHere", "created": 1629092343, "upvotes": 1}, "h94e02l": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h94e02l/", "text": "Chip clips, rubber bands, magnets, tape, thumb tacks, paper clips. All the little things you never think about!!", "author": "Illustrious_Reason98", "created": 1629090476, "upvotes": 1}, "h94c7mf": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h94c7mf/", "text": "Somethings I never thought about but was so happy my mom and dad did: a Britta (brita?) Water pitcher and a small little multi-tool. The water from the tap in my dorm wasn't great and I had to walk a long ways to get to the water bottle filling station for my building, so having something to filter water was wonderful. The little multi-tool thing was super nice too. I'm pretty sure a Walmart would have them pretty cheap. It just had all the little basic tools which I didn't think I'd need but used probably at least once a month.", "author": "KaiBooBai", "created": 1629089325, "upvotes": 1}, "h94avvb": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h94avvb/", "text": "Some trash bags, laundry detergent, an extra phone charger for the bookbag, and shower shoes. NEVER skip shower shoes, u don't know what fungus is growing in those communal bathroom (or even private suite ones). If he's sharing a bathroom with a roommate and/or another room, get cleaning supplies.", "author": "sistersofshiva", "created": 1629088503, "upvotes": 1}, "h94923h": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h94923h/", "text": "A 4 way plug adapter. Tends to come in handy when you need an iPhone charger, a lamp, an alarm clock, a watch charger, and a fan all on your bedside table", "author": "Lkj509", "created": 1629087408, "upvotes": 1}, "h946pq7": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h946pq7/", "text": "Splurge on the best mattress topper, it’s worth it! A laundry basket that is easy to carry down to the washers. Maybe a Amazon subscription service for essentials like body wash, toothpaste, etc?? Lastly, expect to receive multiple calls the first weeks telling you he needs more stuff lol", "author": "hceleste_", "created": 1629086040, "upvotes": 1}, "h940xid": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h940xid/", "text": "Thanks for helping your little brother!", "author": null, "created": 1629082906, "upvotes": 2}, "h93xv7n": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93xv7n/", "text": "I'm a little late...but I've seen that you've gotten great responses! I just wanted to say that you're an AMAZING big sister for doing this for your brother. I wish you guys all the best :)", "author": "calgaryeboy", "created": 1629081360, "upvotes": 1}, "h93w6r3": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93w6r3/", "text": "I got a cheap shelf from Walmart my freshman year. It was just something for me and my roommate to keep the keurig, mugs, and snacks on", "author": "princess_petty", "created": 1629080513, "upvotes": 1}, "h93vino": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93vino/", "text": "Some things from home like pictures, a favorite blanket, etc. It makes it feel a lot less like a dorm and more like their space.", "author": "ComingOutCurious", "created": 1629080176, "upvotes": 2}, "h93v6je": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93v6je/", "text": "An extra power strip or extension chord is very helpful. I remember having a course where there were only 2 outlets in a class of 30 people, bringing my extra power strip definitely helped make a few friends pretty quickly.", "author": "KasseanaTheGreat", "created": 1629080008, "upvotes": 1}, "h93t0dg": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93t0dg/", "text": "Also (unless you litterally got an the.best.dorm). Dont prep for a kitchen section like you might traditionally do for an apartment. \n\nI'd say mini fridge and a microwave (a good convenience) and at most a bunch-o-travel mugs is ok in the food department. This is also exactly how you could lose weight sometimes in college; No easy access to cooking food at night or having em. If you want a coffee machine using it without coffee grounds/kureg pod is perfect for ramen.\n\nIf you have bunk beds, first ask if you have a hard time waking up (like. At all). If you do, pick top and keep your phone on the other side of the room: You'll wake up garenteed and will never struggle again.\n\nIn terms of 'studying'. Be honest: if you're me, dorm is 'tent mode': You rest and relax. Period. It helps immensely (especially compared..ughh...to now) to study better.", "author": "HereToNjneer", "created": 1629078933, "upvotes": 1}, "h93qi7q": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93qi7q/", "text": "Shower shoes or sandals for the communal shower. Kids be NASTY.", "author": "ChaoticxSerenity", "created": 1629077691, "upvotes": 2}, "h93oi3r": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93oi3r/", "text": "It looks like you got a lot of solid advice already. I  just wanted to say you sound like such a thoughtful, loving, WONDERFUL sister! 🤗", "author": "strawberrysweetpea", "created": 1629076697, "upvotes": 1}, "h93njrv": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93njrv/", "text": "Laundry supplies! Think Tide pods instead of liquid detergent - it’s easier to carry a couple pods to the laundry room than a jug of liquid detergent. This has already been mentioned but a laundry bag will be so much better than a laundry basket.\n\nOther than that, things to make the dorm room feel more like home. If you’ve seen the dorm rooms or a dorm tour video, you can kind of pick and choose from this list depending on what’s most important:\n\n- Area rug: covers up gross carpet or cold, hard linoleum and makes the room cozier\n- Lights: a lamp or some string lights make a room so much cozier than the dorm’s fluorescent lights. A desk lamp will also be important!\n- Extra seating: storage ottoman, beanbag chair, anything to make a room more inviting for a few people to hang out in\n- Posters, pictures, anything to cover up a plain white cinderblock wall\n- Full length mirror (some dorms come with mirrors so make sure you need one before you buy it)\n\nHonestly I recommend buying the essentials (shower caddy, laundry bag, etc.) with your brother and then letting him and his roommate take a trip to Target or IKEA to get things like rugs, seating, and lights. It’s a great way for him to get to know his roommate and they can both agree on how the room should look. Maybe give him a gift card to help him out. Keep a bit of money set aside too because he’s gonna call you a few weeks into the semester realizing he needs something neither of you thought of.", "author": "itsnottommy", "created": 1629076218, "upvotes": 1}, "h93milb": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93milb/", "text": "Everyone else has covered most of the things, but I think it's important to remember something:\n\n&#x200B;\n\n**Every town has a Wal-Mart / Target / etc...**\n\n&#x200B;\n\nHome goods are pretty cheap. While you should definitely try and get most of the stuff before hand, don't stress too much about getting every little thing. The worst case scenario is he has to go make a Wal-Mart run after he's been there a couple of days.", "author": "Dj_White_Gold", "created": 1629075704, "upvotes": 1}, "h93gplt": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93gplt/", "text": "Here's something that people haven't said: A handheld, portable vacuum, something you can just plug into the wall and charge. I know this may be more of a girl's thing, but I found it helpful if I wanted to clean up any dust that may accumulate over time. \n\nLikewise, a broom and dust container set, sometimes the brooms are all being used, and it's nice to have for stuff that the vacuum doesn't sweep up. \n\nIf he's scared of the dark, don't be afraid to get a nightlight, and I found especially in the winter months that a purifier/humidifier helped immensely with my room being too dry and waking up with cracked lips. I would double-check that it's allowed, but if it is, definitely get a humidifier. \n\nI also ended up getting a Brita filtered water container for my water in the mini-fridge when my building shut down all the water fountains for Covid reasons, it wouldn't hurt to have and it's especially nice to have your own water on hand in the middle of the night or when he's too lazy to trek out to the public drinking fountains.\n\nEDIT: Also, didn't see this, maybe get him multiples of his favorite shampoo/conditioners, and toothpaste for when he runs out. It's so nice to already have an extra of those items so you don't have to make a shopping trip for them. Plan on getting him a couple of extra toothbrushes as well, I ended up getting sick about halfway through the year and used my original toothbrush while sick. If he gets sick, which in a dorm is bound to happen, it's nice to have a fresh and unused toothbrush or toothbrush head to use so he isn't constantly using the one he was using while sick. All of these would be good in packs of 2, so 2 new shampoos, one to use at the start and one to use after that runs out, 2 new conditioners, and an extra toothpaste and toothbrush for when he runs out of the original toothpaste and for when he gets sick he can then just switch toothbrushes with no hassle.", "author": "cat4hurricane", "created": 1629072848, "upvotes": 1}, "h93g9oo": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93g9oo/", "text": "putting up posters about getting drunk or with half baked girls is a huge No now days. this puts everyone who walks in on douche alert. posters can be whatever he wants as long as they don't force people's mind into unwanted places.", "author": "solvent_causis04", "created": 1629072627, "upvotes": 3}, "h93fw8c": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93fw8c/", "text": "Charging materials for personal devices. Nothing sucks like being glued to a wall or outlet or USB spot. He should have a couple power banks and a couple cords of suitable types for laptop, phone, tablet, etc., so if anything wears out he is in good resupply.", "author": "solvent_causis04", "created": 1629072441, "upvotes": 1}, "h93fovy": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93fovy/", "text": "[deleted]", "author": null, "created": 1629072342, "upvotes": 0}, "h93fe1w": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93fe1w/", "text": "an alarm clock he can trust that will also not piss off his roomies", "author": "solvent_causis04", "created": 1629072196, "upvotes": 1}, "h93eof0": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93eof0/", "text": "A rain jacket and/or windbreaker. I really never thought about how much it rained until I was on a college campus walking everywhere.", "author": "burchillllll", "created": 1629071851, "upvotes": 1}, "h93cx6w": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93cx6w/", "text": "Surge protector, mattress topper, kitchen sized trash can, rolling hamper. Oh and scissors. When I lived in a dorm last year there was a lot of times I needed scissors and didn’t have them", "author": "bitterandconfusedd", "created": 1629071011, "upvotes": 1}, "h93cwwb": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93cwwb/", "text": "I’d get a waterproof backpack if you can help it. And at least 2 pairs of shoes in case one pair gets wet. Rain jacket and umbrella are good things to have too.", "author": "115machine", "created": 1629071006, "upvotes": 1}, "h93bqsz": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93bqsz/", "text": "A shoe rack", "author": "elite4caleb", "created": 1629070443, "upvotes": 1}, "h93aw7k": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93aw7k/", "text": "Extra long charging cable, because there are not likely to be many or convenient outlets. \n\nEarplugs. \n\nSpend some time doing some basic cooking together if he doesn't have much experience. Being able to make a boxed cake with icing and sprinkles as well as fried rice and grilled cheese will go a long way to staying fed and making friends! \n\nLots more masks than you think. Then some more. He needs to be wearing them everywhere and changing every few hours. College kids often go a few weeks without doing laundry, so he needs multiple dozen masks. \n\nMake plans for if he needs to do coursework from his dorm room if he is quarantined. What extra supplies would be helpful? An extra monitor is very nice, as is a good set of headphones with a decent mic.", "author": "PoetryOfLogicalIdeas", "created": 1629070033, "upvotes": 1}, "h938i01": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h938i01/", "text": "Waterproof backpack!", "author": "Starsasha2222", "created": 1629068876, "upvotes": 1}, "h9385ep": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h9385ep/", "text": "I’m not reading through all the comments, but definitely get an extension cord with a lot of outlets, if someone hasn’t already mentioned that", "author": "PasswordLogger", "created": 1629068708, "upvotes": 0}, "h937f6b": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h937f6b/", "text": "Bathroom:\n\n* Shower shoes\n* Caddy\n* Toothbrush cover/protector\n\nBedroom:\n\n* Mattress pad & protector\n* Surge protector / power strip (make sure it's approved by college / not considered a fire hazard)\n* Posters / tapestries / string lights\n\nGood luck!!", "author": "jlaca123", "created": 1629068368, "upvotes": 1}, "h936xyz": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h936xyz/", "text": "Any microwave cooking things usually help, cooking in the microwave is a lot easier when you have some extra equipment\n\nAlso a rice cooker was a big one for me personally, it was super cheap to have some rice with canned chicken and hot sauce (or butter & a bit of salt)\n\nTupperware as well to keep any leftover takeout or dining hall food in. Especially good if they don't let you take food out of the dining halls, so you can sneak them in a backpack and stock up your fridge", "author": "iScabs", "created": 1629068142, "upvotes": 2}, "h93365e": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h93365e/", "text": "You’re a great sibling!  Good luck!", "author": "inflewants", "created": 1629066389, "upvotes": 2}, "h9311da": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h9311da/", "text": "Thank you guys so much! I appreciate all the responses!", "author": "whatanexperienceitis", "created": 1629065398, "upvotes": 2}, "h930z7n": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h930z7n/", "text": "Here are my ideas, some are essential and some are not…\n\n\nBed risers. A bed skirt to hid whatever he wants to shove under the bed (i used curtains with ties cause I couldn’t find bed skirts long enough). A fan, especially if there’s no AC. A sound machine for sleeping. A lamp, or some other source of light, an LED strip, or a little book light clip… bc often the only light in a dorm is awful fluorescent lights, and also if he has a roommate and wants to stay up studying in his dorm, those lights suck.. Maybe also some curtains, depending on what the school provides. Respectfully… I’ve noticed boys dorms get very musty…  so a scent diffuser of some sort, (remember open flames are likely not allowed) i have one of those essential oil misters things. A DUSTPAN AND BROOM SET OMFG. maybe a mini vac instead, if the dorm is carpeted. One of those little plastic drawer sets (with like 3-4 drawers) that they sell at office supply stores is INCREDIBLE for keeping papers organized. Binders. Notebooks. A planner(!!!) Maybe even one of those white board planners you can put on the wall. Also, a little white board to put on the outside of the dorm door can be great for friends to leave messages n such.\n\n\nIf he wants to be studying in bed, a back pillow with those arm things, and a lap desk is great.. Also, lots of bins or boxes of all sizes for storage will be super helpful and quick to keep things organized and tidy when ur a busy college student. And don’t forget hangers! :)", "author": "SnooMaps460", "created": 1629065371, "upvotes": 3}, "h930k75": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h930k75/", "text": "An instant coffee machine and an extra alarm clock incase his phone dies or gets lost under the bed and can't be heard", "author": "EveryDisaster", "created": 1629065179, "upvotes": 5}, "h92xo4n": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92xo4n/", "text": "Watch some YouTube videos and get excited together!!", "author": "PutYaMouthOnIt", "created": 1629063891, "upvotes": 2}, "h92xma2": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92xma2/", "text": "Best thing my family got me were gift cards to stores like Target or Walmart. That allowed me to buy any last minute items without having to worry about transporting them during move-in.", "author": "mindscape1", "created": 1629063868, "upvotes": 5}, "h92wysn": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92wysn/", "text": "Depends on the dorm/school really, as well as if he'll be eating in the dining hall a lot, so remember to keep lifestyle and what already comes in the dorm in mind! I'm a rising senior, here's some of the things I used a LOT:\n\nCollapsible lap desk, cushion for the desk seat, mini fridge, microwave, keurig, a set of reusable utensils, a set of reusable dishes, cleaning products, bathrobe, body length mirror, power strip/surge protector, extension cord, Bluetooth headphones, USB splitter, external hard drive to back up files, lighting (I use string lights that have a warm tone to them which is nice for nighttime when you may not want to use the harsh overhead lights)\n\nOh and also be careful with command hooks. Sometimes in the removal process it'll rip paint off, even when used properly. To avoid this you can put painters tape under the command hook or, instead of pulling the pull tab for removal, sawing through the adhesive part with some dental floss. It'll cut it in half so it's much less strenuous on the paint to peel it off", "author": "atheistart3mis", "created": 1629063574, "upvotes": 9}, "h92rult": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92rult/", "text": "I think this thread covers the basics well\n\nTell bro to join his college specific thrift shop Facebook page. Always got good ass stuff for resell on there and it’s on campus. Bro can either buy what’s already on the page or make a post such as “looking for a 27 in monitor for under $100”. You can find everything for cheap if ur good at it.", "author": "BeenThruWorse", "created": 1629061352, "upvotes": 3}, "h92r80x": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92r80x/", "text": "Prepare for all weather conditions. Cold, hot, rain, snow. Everything espicially for the snowy and rainy days. Multiple pairs of shoes that can dry out between days that rain and soak the shoes. Plenty of socks, umbrella, poncho. \n\nWater filter like a Brita or something similar. \nAnd a boiler if you think he’s gonna eat like instant ramen or tea or instant coffee. \n\nShoe rack for organization but not necessary.", "author": "jasu4321", "created": 1629061089, "upvotes": 7}, "h92puaq": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92puaq/", "text": "I would suggest vitamin gummies (especially immune boosters or vitamin C). They were a big help for me when I was a freshman since illnesses spread pretty easily in the dorms.", "author": "Izzy_El_IT", "created": 1629060510, "upvotes": 5}, "h92oh4j": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92oh4j/", "text": "Dont take too much stuff, easier to buy/bring stuff later than have to store stuff you don't need.   I'd suggest an Amazon(or local store) gift card.  Also if going to help him move in, find targets/WalMarts/whatever stores close by (note the closest may be packed/sold out stuff), you can go on a quick shopping trip.    \n\nSome essentials I always recommend that I haven't seen is extra towels (if no ac/easy way to hang them they will get smelly quick) and lots of extra toiletries.", "author": "rawdeturf", "created": 1629059932, "upvotes": 10}, "h92m5g7": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92m5g7/", "text": "Rain gear and jackets. And a first aid kit. \n\nForgot my rain gear, it going to rain all week. 😐", "author": "K-Lyn-Nova", "created": 1629058944, "upvotes": 13}, "h92j2s2": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92j2s2/", "text": "Decorations, poster of a favorite band or movie to make it feel a bit more homey", "author": "OliveOliveJuice", "created": 1629057622, "upvotes": 3}, "h92ilii": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92ilii/", "text": " a robe to go to and from bathroom /showers", "author": "_ProfessorHamish_", "created": 1629057417, "upvotes": 7}, "h92ili7": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92ili7/", "text": "I would suggest GOOD snacks. I might just have a refined palate but sometimes I would be hungry and not want to go to the dining hall. Having food like fruit, cans of beans that can be heated up with chips (I know this is a weird one), cans of soup, granola bars etc. that can kind of be eaten instead of a meal are helpful. Then obviously the unhealthy food like ramen and candy or whatever he likes", "author": "llamaintheroom", "created": 1629057417, "upvotes": 4}, "h92hy72": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92hy72/", "text": "Some basic cleaning supplies like a broom and dustpan, surface cleaner, glass cleaner, etc.", "author": "chpeaches", "created": 1629057139, "upvotes": 8}, "h92gdly": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92gdly/", "text": "Deck of cards. I've played so many random pick up games of weird games in the lobby's/common areas of various schools I went to.", "author": "thebeatsandreptaur", "created": 1629056468, "upvotes": 15}, "h92g5xa": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92g5xa/", "text": "You’re a great older sister :) good job and good luck to you and your bro!", "author": "vgal48", "created": 1629056376, "upvotes": 29}, "h92fz0h": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92fz0h/", "text": "A small bottle of Tide and a black light. :-D", "author": "SpectrumDiva", "created": 1629056289, "upvotes": 1}, "h92faur": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92faur/", "text": "Ethernet cable. It was the number one “forgotten” item at my daughters uni.", "author": "DeadSheepLane", "created": 1629055994, "upvotes": 19}, "h92e3dh": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92e3dh/", "text": "I forgot to bring chip-clips and all my chips went stale before I had the chance to go out and buy some! Also definitely a little bin with  bandaids, allergy meds, and ibuprofen!", "author": "happpenstances", "created": 1629055461, "upvotes": 23}, "h92dyii": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92dyii/", "text": "everything that the other commenters said +\n\n\\-tide pods and dryer sheets instead of liquid detergent and fabric softener. so much easier to take down to the laundry room. i just throw a tide pod into my basket with me when i go down.\n\n\\-a couple decorations/things that remind him of home. literally just having some posters of my favorite band helped make my side of the room feel a little more homey\n\n\\-command hooks. they make all sorts of sizes like cable holders: he can put one of the side of his bed so his phone charger doesn't fall to the ground every time he unplugs his phone. or on the side of his desk to hold up his laptop charger. with the other sizes he can hang up his keys, hats, coats, you name it.\n\n\\-fan. some dorms don't have AC, only heat, so a fan will be a lifesaver at night when the room is stuffy\n\n\\-bed risers. they let you elevate the bed a few more inches but that can make all the difference for storing stuff under the bed.\n\n\\-snacks for the first couple weeks bc he probably won't have time to go shopping while figuring everything else out\n\n\\-disinfecting wipes. bc of the pandemic you may want to wipe everything down when you get there just in case. idk if your brother would do this but i like to take a pack of wipes with me to the library and wipe down the desk before i used it.\n\n\\-in a similar vein, hand sanitizer. it's super annoying/inconvenient to have to go wash your hands in the dining hall before eating", "author": "EmilyHudsonOF", "created": 1629055400, "upvotes": 46}, "h92capl": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h92capl/", "text": "I think many people forget a beach towel along with the “towels” on most people’s lists.", "author": "poliomikayla", "created": 1629054668, "upvotes": 12}, "h927w09": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h927w09/", "text": "Basic medicine for a cold/soar throat/headache, etc. That and a first aid kit. \nYou're an awesome sister to be supporting your brother the way that you are", "author": "RobotGrapes", "created": 1629052754, "upvotes": 127}, "h927vif": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h927vif/", "text": "This isn't really something I considered when I moved into my dorm but posters or something to hang on the wall so that they aren't blank. It really helped me make the room feel like my room rather then just a room.\n\nI recommend just ordering some on the internet I ended up buying some cheap ones and it really helped.", "author": "Apotheosis62", "created": 1629052748, "upvotes": 131}, "h927180": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h927180/", "text": "If theres a communal kitchen available and they can cook a bit - food containers, mini frying pan, plastic (not one time use) plate and glass, less breakable = better. Also electric kettle is a lifesaver if dorm room doesnt come with it (mine did, super comfy). Lockbox could also be good if he's sharing or just storing valuables/documents.", "author": "TurbulentCherry", "created": 1629052388, "upvotes": 18}, "h926upf": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h926upf/", "text": "Monitor to connect to a laptop, good for productivity, watching movies or playing video games", "author": "roboticguy", "created": 1629052312, "upvotes": 21}, "h923jzp": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h923jzp/", "text": "Philips oneblade for shaving", "author": "_nolovedeeppleb", "created": 1629050900, "upvotes": 9}, "h91ubua": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91ubua/", "text": "One of those shower/bathroom caddie things so you can carry all your soap and shampoo and toothbrushes to the bathroom.", "author": "Fubb1", "created": 1629047050, "upvotes": 61}, "h91tyvb": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91tyvb/", "text": "Just set aside some money. The thing this kid is going to call you needing in 2 weeks is a mystery to everyone. Everything I bought to move out should have been cash for the stuff I didn't know I needed til I needed. That said\n\nTrashcan\n\n2 towels\n\nA timer that plugs into the wall, and a lamp to plug into it. Set the light to come on and then its easier to wake up and get to class\n\nA surge protector strip\n\nShower shoes\n\nA mesh bag for bathroom stuff", "author": "bitetheboxer", "created": 1629046901, "upvotes": 199}, "h91ts9d": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91ts9d/", "text": "shower shoes", "author": "b0bcr4tch1t", "created": 1629046824, "upvotes": 39}, "h91s6l0": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91s6l0/", "text": "Buckets are nice. If you have one bucket then you can use it as a spare chair for friends, or use it as storage space. Or if you're feeling really adventurous you can invite your friends to do tie-dye outside and use the bucket then. A bucket is useful and doesn't take up much space.\n\nAlso don't forget Ibuprofen/Advil/first-aid kit just in case he needs it.", "author": "webadu", "created": 1629046160, "upvotes": 34}, "h91rype": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91rype/", "text": "Condoms.", "author": "Srqjeb", "created": 1629046071, "upvotes": 56}, "h91mcyg": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91mcyg/", "text": "bedside caddy if theres not a table close to the bed\n\nclothing rack for stuff that cant go in the dryer\n\nwall plug in things since u cant have candles\n\nmaybe a few cleaning supplies like dusters and such - my brother didnt bring anything to clean and there were layers of dust on all his stuff when we visited!", "author": "immenseigloo", "created": 1629043730, "upvotes": 31}, "h91m9lc": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91m9lc/", "text": "Twin XL mattress cover and mattress pad! The mattress they supply at colleges is not comfortable at all. Putting a topper on it can make a massive difference (and a protector to keep it clean so you can use it all 4 years)", "author": "zigzag0203", "created": 1629043691, "upvotes": 287}, "h91kw3w": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91kw3w/", "text": "Carpet and some hand towels.", "author": "J_T_K01", "created": 1629043118, "upvotes": 23}, "h91eqom": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91eqom/", "text": "Desk lamp, calendar/planner, **laundry bag instead of a basket**, **sleep mask**, earplugs", "author": "_V_R_A_A_L_", "created": 1629040505, "upvotes": 149}, "h91e2jo": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91e2jo/", "text": "Noise canceling headphones..", "author": "MyCatThinksImSoCool", "created": 1629040207, "upvotes": 29}, "h91c6wg": {"link": "/r/college/comments/p4utg6/dorm_essentials_help_from_an_older_sister_filling/h91c6wg/", "text": "Outside shoes that can just be slipped on like Crocs or something.", "author": "GoldRequest", "created": 1629039368, "upvotes": 393}}}