{
  "sid": "q6oa5q",
  "link": "/r/college/comments/q6oa5q/is_19_credit_hours_too_much/",
  "title:": "is 19 credit hours too much?",
  "text": "I’m currently a dual enrolled senior in high school working to graduate w an associates. this year will be my second year of college. my community college has both 8-week and 16-week classes offered. i’m scheduled to take 19 credit hours in the spring, however most of the classes are only 8-weeks, leaving me w taking 5 classes in the first 8, and 3 in the second 8. two of the classes in the first 8 are labs that are worth 2 credit hours which is why it’s so much. bc i’m still in high school and still live w my mom, i’m in a position where i can work less hours at my job if needed without too much consequence, and i don’t have much of a social life that i would be sacrificing. 19 is the max amount of hours one can take in a semester, and i guess i’m just looking for reassurance that it’s possible given the circumstances. i’m also very interested in the content of the courses i’ll be taking, and it’s much easier for me to stay motivated to do work for 8 weeks straight as opposed to 16 weeks. some of the courses are also taught by professors i had this semester, who i was able to form good relationships w, which im hoping will help if i hit a rough patch.",
  "author": "throwaway568989",
  "created": 1634051304,
  "updated": 1634082581,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgdce01": {
      "link": "/r/college/comments/q6oa5q/is_19_credit_hours_too_much/hgdce01/",
      "text": "Thats definitely a ridiculous amount since they seem to be pretty short semesters. Its.. doable.. but you really wont have a life outside of school. You wont really be able to work or do social things often unless its a study group",
      "author": "taybay462",
      "created": 1634055696,
      "upvotes": 5,
      "replies": {}
    },
    "hgdunqe": {
      "link": "/r/college/comments/q6oa5q/is_19_credit_hours_too_much/hgdunqe/",
      "text": "Respectfully, you are going to die. Good luck.",
      "author": "bentheman02",
      "created": 1634063216,
      "upvotes": 5,
      "replies": {}
    },
    "hgenpmd": {
      "link": "/r/college/comments/q6oa5q/is_19_credit_hours_too_much/hgenpmd/",
      "text": "As a full time college student, I'm taking 15 credit hours. I think 19 is way too many for someone who's also in high school. I think you should cut back for your own wellbeing, bc you're gonna get overwhelmed real quick",
      "author": "lissamarie3",
      "created": 1634075078,
      "upvotes": 1,
      "replies": {
        "hgeoz3l": {
          "link": "/r/college/comments/q6oa5q/is_19_credit_hours_too_much/hgeoz3l/",
          "text": "to be fair, i’m taking 16 currently. i took 5 the first 8, and these next 8 i’ll be taking three. the only different that makes the spring semester more credits is the fact that this semester i have 2 16-week classes, where as next semester i’ll only have 1. i also have no classes at the high school that’ll add to any extra work. I’ve been handling this semester and the set up really well, and the quarter scheduling helps me a lot to handle more of a workload",
          "author": "throwaway568989",
          "created": 1634075615,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}