{"sid": "bhzlu6", "link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/", "title:": "Has anyone else gotten down to one or two semesters of college, realized you chose a terrible major you hate, but realized it’s too late to change?", "text": "And doing another four years would be a complete waste of money and time? I’m majoring in marketing but have only had jobs in my life in writing. I’ve taught myself graphic design and have also gotten small jobs in acting. I feel like my four years and college doing something I hate was a complete waste.", "author": "guava_dog", "created": 1556375439, "retrieved": 1632948232, "over_18": false, "upvotes": 570, "upvote_ratio": 0.98, "comments": {"elyja4v": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elyja4v/", "text": "It is NEVER too late to change\n\nI decided to finish college at 30 - then law school\n\nand now at 51, I am about to obtain a PhD\n\nthere is no time limit on improving yourself", "author": "WUSM", "created": 1556422623, "upvotes": 5}, "elyfv4u": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elyfv4u/", "text": "I wanted to do automotive eng but i was told it was hard for me to get a job in the future. So i am doing mechatronics atm in year 3 and the modules related to software and coding is killing me but i cant really changed anymore. Feels like shit", "author": "SketWithTheKet", "created": 1556419496, "upvotes": 1}, "ely8onl": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/ely8onl/", "text": "Just completed my second term only to realize I absolutely hate what I’m going into! \nI’m dropping out and I’ve already been accepted into what I really want to do. \n\nIt’s never too late.", "author": "Hoods_77", "created": 1556413229, "upvotes": 2}, "ely6p0j": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/ely6p0j/", "text": "I changed my major twice in community college. \nI initially went from engineering, to accounting, and now currently in graphic design. \nI dread every day and every instance of my indecisiveness and realized I should’ve stuck with the initial two majors rather than graphic design.\nI’ve become more financially responsible and realized Design won’t bring in money and I dislike my university classes but I’m only two semesters away from graduating.", "author": null, "created": 1556411546, "upvotes": 1}, "ely0oi5": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/ely0oi5/", "text": "Changed my major and transferred last semester. I would be graduating next month if I actually stayed with my original major but it’s whatever. The only thing that sucks about it is that I’m 23 and I feel like I don’t relate as well to a lot of traditional students now that I’m getting older which makes it harder to make friends.", "author": "redflavormp3", "created": 1556406745, "upvotes": 1}, "elxyn53": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxyn53/", "text": "I got a math degree, taught for a while. Then joined the Army where I was as 25 P (Signal corps) after I got out I went back to my Alma mater and got an Telecommunications systems management degree and was able to take extra tsm courses compared to my peers and a bunch of computer science classes, if I went back I'd be a year away from a 3rd bs in computer science.", "author": "crunchthenumbers01", "created": 1556405174, "upvotes": 1}, "elxt4pi": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxt4pi/", "text": "I don’t hate mine, but I wish I had done computer science instead of history.", "author": "lastpieceofpie", "created": 1556401011, "upvotes": -2}, "elxsox3": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxsox3/", "text": "A marketing degree is very versatile. A writing degree is not.", "author": "ikilledtupac", "created": 1556400682, "upvotes": -2}, "elxsofr": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxsofr/", "text": "I’m graduating in May, it took me until I have been job searching to realize that I might of went into the wrong field. I love my major and I throughly enjoyed learning about it but I can’t help to wonder if I would of enjoyed something else better.", "author": "Kulaasus", "created": 1556400671, "upvotes": 1}, "elxsn0o": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxsn0o/", "text": "It’s not too late to change. Doing something you’re good at, and enjoy, is worth more the time and money. If financing is available of course.", "author": null, "created": 1556400643, "upvotes": 1}, "elxmx7x": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxmx7x/", "text": "I'm in the same boat. I majored in Animal Science and now it's mostly about killing and is regarded as a really emotionally draining major. Everyone kept saying I'd get used to it but how do you get used to something like that?\n\nEveryone says it's never too late to change, but I really can't afford extra years of college. I couldn't afford 4 years to begin with.\n\nEDIT: Oh shit I read 1-2 semesters as 1-2 years. I'm like over halfway done. I switched from graphic design after 1 year and it ended up working out pretty okay.", "author": null, "created": 1556396345, "upvotes": 1}, "elxkj9e": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxkj9e/", "text": "It's never too late, I switched after a year and a half. Although my majors were kind of close so I only lost a semester after transferring", "author": "mlgnewb", "created": 1556394558, "upvotes": 1}, "elxjxkv": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxjxkv/", "text": "Your major doesn't completely define your resume and your job prospects. Writing and graphic design are both hugely valuable in communications/PR jobs (if that's something you're interested in), and you can definitely work this skills learned in your marketing degree into a larger picture of who you are as a professional. It's not necessarily a linear \"got a marketing degree now I have to be a marketing exec at Publicis\" thing.", "author": "manondessources", "created": 1556394104, "upvotes": 1}, "elxh5z9": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxh5z9/", "text": "This is kind of why I'm thankful I went to community college instead of straight to uni. Took me 6 years to graduate instead of the usual 4 but I'm really happy with where I'm at academically. A lot less pressure to pick a major right away, especially when I was 19 and had no idea what I wanted to do.", "author": "EmotionalEater", "created": 1556392033, "upvotes": 1}, "elxh4b8": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxh4b8/", "text": "I finished my third year of college, realized that I was pursuing a shit degree and changed it.", "author": "idkwhattonamethis21", "created": 1556391997, "upvotes": 4}, "elxery0": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxery0/", "text": "My engineering teacher in high school took 10 years to get his bachelor's degree and he couldn't be happier. He changed majors so many times from one engineering to another before settling on teaching. I'm only a sophomore and I've changed once and added another. You can do it and 50 years from now you're gonna wish you spent a couple extra in college.\n\nDon't continue making a mistake just because you spent a long time making it.", "author": "SomebodySmarter", "created": 1556390222, "upvotes": 2}, "elxbl53": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxbl53/", "text": "If you're interested in business at all, a Marketing degree pairs pretty well with an MBA.  \nMarketing + graphic design would make you a great candidate for an advertising firm, if you think you'd enjoy the more design oriented side of that field.", "author": "-firead-", "created": 1556387822, "upvotes": 2}, "elxab9x": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elxab9x/", "text": "Yep. Honestly though graphic design can be a really important part of marketing and in your case I’d just take some online courses or maybe squeeze in a minor if you can instead of completely changing your major.", "author": "dak0taaaa", "created": 1556386858, "upvotes": 2}, "elx80lk": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx80lk/", "text": "Yep haha", "author": "mackys", "created": 1556385158, "upvotes": 1}, "elx80k7": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx80k7/", "text": "I am not in a major I completely hate, but I wish I had more time to take more classes in the field that I actually want to be in. Or even double major. But it is too late to change and I know everyone says that it isn't. But, for me, I do not have the money to actually change my major and stay in college for another year or so. I have to graduate with my degree. So yeah, I understand exactly how you feel.", "author": "Small-Town-Girl-123", "created": 1556385158, "upvotes": 2}, "elx7vby": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx7vby/", "text": "I went from biochemistry at one school, transferred to actuarial science at another, and then my senior year I changed to economics. And I’m graduating on time in 15 days, you can definitely change", "author": "thedoctorisout25", "created": 1556385050, "upvotes": 4}, "elx7gqm": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx7gqm/", "text": "Never too late to change. Can always get the degree you’ve already spent the time in to help you w/ job opportunities while you search for another major you like.", "author": "imbrownbutwhite", "created": 1556384748, "upvotes": 1}, "elx6x95": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx6x95/", "text": "The purpose of university is to learn how to learn.  Your major rarely matters in any specific sense, unless you want to go to medical school or something, in which case you better have taken organic chemistry.  You could easily move in to a graphic design career path with a marketing major", "author": "NotThatBatman", "created": 1556384358, "upvotes": 4}, "elx5yc0": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx5yc0/", "text": "It’s never too late to change your major! After all, you’re paying for the education, so you might as well do something you like. If that’s intimidating, you could also try to double major or use your current classes for a minor. \n\nI switched majors (and schools) after my freshmen year and I don’t regret it one bit. I got about half of my classes to transfer to my new university. I also had to rearrange my 4 year class plan a lot and take some classes in the summer, but I’m still graduating “on time”.\n\nChanging is easier than you think, especially if you stay within your university. Speak to an advisor, be open minded, and good luck!", "author": "PutinInMyPepe", "created": 1556383665, "upvotes": 3}, "elx5v3b": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx5v3b/", "text": "Everyone on the internet makes it seem like every degree is useless other then engineering and business so I thought that a lot", "author": "Graardors-Dad", "created": 1556383595, "upvotes": 18}, "elx4b3g": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx4b3g/", "text": "Why don’t you like marketing? As a finance major it’s one of the few degrees I’d contemplate going back for. If you’re willing to think outside the box and eat shit for a few years, marketing has high earnings potential and can be a really fun career choice.", "author": "TheBigShrimp", "created": 1556382426, "upvotes": 5}, "elx3qy5": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx3qy5/", "text": "It's never too late.   I had about 2 or 3 semesters left before I changed my degree to one that I'm going to be happy in.", "author": "SatanicSlugrifice", "created": 1556382010, "upvotes": 1}, "elx3apa": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx3apa/", "text": "OP, like you, my degree is is Marketing. I’m now an IT Manager. It can work out for you. Marketing teams use graphics people all the time. This can work well for you", "author": "hayfever76", "created": 1556381680, "upvotes": 11}, "elx35jh": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx35jh/", "text": "I had that exact experience. Changed my major multiple times and finally decided I needed to stick with one. My last two semesters I decided I didn’t like major anymore and found one I thought would be a better fix. But it would have put me behind another couple of years so I didn’t change it. I just spent the last year trying to graduate. Luckily I was able to find a job with the major I picked though.", "author": "kikiorangutan", "created": 1556381578, "upvotes": 7}, "elx1y5e": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elx1y5e/", "text": "Yup - I am an adult learner and realized after 3rd year (actually 4th year in school), but it wasn't worth it to change course at that point. I am 2 classes away from graduating now, and have done well throughout most of my degree. My interests are still tangential to my degree and I can pivot now, or with a masters degree. \n\nThat said - I am just exhausted and frustrated with my undergrad at the moment though, and not willing to dive into a graduate degree at the moment. \n\n(FYI - Forestry degree pivoting towards environmental science/conservation, policy/economics. Generally interested in interdisciplinary studies of humans and environment; not sure how to turn it into a job).", "author": "Mug_of_coffee", "created": 1556380685, "upvotes": 7}, "elwzz3e": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elwzz3e/", "text": "It ain't too late. \n\nI'm on my 5th year, just transferred colleges and changed my major last semester. I was previously in business loathed everything about it, but I thought it was too late after a couple semesters. \n\nHowever, my grades reflected my interest. I left the first college with a GPA of like 2.2 but now that I'm in a major I enjoy, and am taking classes pertinent to said major, this semester is looking like a 4.0 is extremely feasible, with a lot of cushion for my finals. My GPA wasn't hot last semester (had a lot of shit going on between moving, injuries, illnesses, death in the family, a lot of other shit) and I think was about the same as my cumulative GPA from the last college, but this 4.0 will sure as shit help that and I enjoy this program enough to where I'm confident that I am able to learn the materials and excel.", "author": "Delivery4ICwiener", "created": 1556379146, "upvotes": 13}, "elwzw3d": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elwzw3d/", "text": "You don’t need a degree in something to put it on your resume. If you like graphic design and know the programs well then you can apply for a job doing that. The company could be more impressed that you know everything a graphic design major does while majoring in something else. Also shows you bring more to the table.", "author": "YumIzChicken", "created": 1556379077, "upvotes": 87}, "elwystm": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elwystm/", "text": "You could always get a masters in a different but similar degreee", "author": "Ereyes18", "created": 1556378198, "upvotes": 18}, "elwwxza": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elwwxza/", "text": "It wouldn’t be another whole four years. Some things can transfer into other majors. I don’t suggest sticking with something you hate...I’ve changed majors twice. And I’m changing again since I hate this one too, actually even more than the last one. My first major was actually graphic design. Do you like that a lot? Major in that, you can still get into marketing if you decided that later on.", "author": null, "created": 1556376675, "upvotes": 21}, "elww5p2": {"link": "/r/college/comments/bhzlu6/has_anyone_else_gotten_down_to_one_or_two/elww5p2/", "text": "You could always not graduate and double major. I think credits last for 6 years so you can keep all your other credits and do what you need for the major you want", "author": "science-n-shit", "created": 1556376006, "upvotes": 55}}}