{
  "sid": "q7rjn3",
  "link": "/r/college/comments/q7rjn3/what_if_i_choose_the_wrong_major/",
  "title:": "What if i choose the wrong major?",
  "text": "Im a senior and college/uni applications are due jan 13 and I’m terrified and have constant anxiety about college/uni. My grades aren’t that good in sciences and maths so I’ve been focusing on psych and law and I’ve been doing well in them, but now everyone’s saying that I’ll end up jobless and my salary will be low and I’m so scared of ending up with a bad job and regretting not getting into the medical field, but i can’t even take the hard courses in sciences and maths because it’s too late for me and i needed pre-requisite’s for them. I can still try to take biology and chem because now I want to get into a stable field which is medical and try out nursing, but I’m really horrible at the sciences and maths and i don’t enjoy them, but i just want a good salary. what the fuck does it take to live a stable life and be able to afford a car and a house with a family? that’s all I’m asking for. I know that if I work my ass off I can do well in the maths, bio, and chemistry and I really want to push myself and be proud looking back instead of taking the easy way by getting into psychology or a criminal justice degree which i don’t want because first of all, psych will get me nowhere meaningful and criminal justice is too dangerous for me and I’m a female and I’ve heard bad stories. I don’t know what I’m doing with my life and I’m extremely worried and anxious. I don’t know what path to take anymore and social work seemed good, but I’ll end up unstable and with a low salary and I’ll be devastated. I’m really interested in nursing, but I’m really bad with memorization and all the sciences and maths like i can’t even do basic math. Should i get a tutor and start now or am i doomed and screwed for the future? Any advice would be super helpful and appreciated thank you!! I’m 17 and graduating by June 30th. So scared.",
  "author": "Mediocre_Hall4504",
  "created": 1634182618,
  "updated": 1634252167,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hgkpkel": {
      "link": "/r/college/comments/q7rjn3/what_if_i_choose_the_wrong_major/hgkpkel/",
      "text": "If you're a senior in high-school, try not to worry too too much. Majors can be changed for most of your college career, its going to be okay. You have time to learn and grow, and there are nursing programs that probably have people to help specifically with knowing the material. You don't have to know 100% what you're doing when you first go to college. Take a few classes in what you're good at, and maybe just 1 or 2 the first year with what you're struggling with, and see if any of them fit. You csn do this, and you don't have to have it all figured out right now. Definitely talk to your admissions counselor and then your academic advisor when you have one, they are a great resource.",
      "author": "romandrogynous",
      "created": 1634185864,
      "upvotes": 6,
      "replies": {}
    },
    "hgkumyq": {
      "link": "/r/college/comments/q7rjn3/what_if_i_choose_the_wrong_major/hgkumyq/",
      "text": "This is a big decision and undeniably a lot of stress on someone who's young and still learning. I would try your best to calm down and breathe because although you think this is the end all be all decision, it isn't. Many universities allow you to be undecided for the first year or so because regardless of your degree, freshman will pretty much be taking basic core classes such as English 101, entry level math, and whatever core classes such as cultural or social behavioral sciences. I was a biology major sitting in most of my classes with English majors, engineering majors, physics majors, etc. during my first year of college. I assure you, you don't need to be so worried. I think you'll do great and although it can be easy to think solely on the future salary you'll be making, you also need to consider your long term happiness. This is a decision you still have time to make, so please take a breather :)",
      "author": "Anarantula",
      "created": 1634189220,
      "upvotes": 1,
      "replies": {}
    },
    "hglkbsq": {
      "link": "/r/college/comments/q7rjn3/what_if_i_choose_the_wrong_major/hglkbsq/",
      "text": "I failed math a couple times it cost me a small fortune and left me with Fs on my transcript if I could travel back a year in time I had said screw math I'm taking clep test and I study on my own. $100 free if I would've used modern states. Instead I spent $400 once $400 twice to retake and fail again and now if I retake $1200 that's at a community college by the way. If your not good at math unless it's college algebra which was easy in my opinion your best bet would be to avoid risking alot of time money and effort on math. You know now my transcript is messed up. Gpa went from 3.75 to like a 2.5. it's alot of money down the hole on math. Not saying there's math people or not math people but one is like protected clep as opposed to not protected transcript. Intro chem was easy I mean I took it and got a lot a low B like an 80 but I mean I was busy with other classes and really could've tried harder if I had wanted to.intro chem is a bit tedious it's super easy but it's basically a bunch of simple math problems like 1 cup of sugar is 240 grams I 1.5 moles is how many liters. Very easy but after solving 100 of these types of problems again and again I got kind of bored. It's important of course but it's very repitive. Intro psych was great. If you love government that's that. But for me very important was am I taking an 8 week course or a 16 week course am I taking zoom or not zoom you may have the attention for zoom but I hated it everybody's different but it makes a world of a difference when the prossor has 100 PowerPoint slides and 2 long lectures that go overtime every week.",
      "author": "sars79",
      "created": 1634210719,
      "upvotes": 1,
      "replies": {}
    },
    "hgllfbv": {
      "link": "/r/college/comments/q7rjn3/what_if_i_choose_the_wrong_major/hgllfbv/",
      "text": "Honestly no matter what you choose there will be challenges but all of these challenges you will be able to overcome as long as you are persistent in your effort. Deciding your major isn’t super urgent for another two years. It’s good that you know your general track is towards the fine arts. Even still, there are doctors who majored in English for their undergrad.\n\nAs for salaries, it is more about how you market yourself in your field. If you get a lot of experience, you will give cause to hiring you at a higher wage. The loans, the house, everything else will happen with time - as long as you make payments, it’ll get paid down eventually. And as scary or intimidating as taking out loans can be, it’ll work out. \n\nLastly, college is a different game than high school. You’ll likely need to take some basic math classes and science classes even as a psych/poli sci major. And you might find that you enjoy those subjects. College requires more studying in general, and it will push your limits, and you’ll learn how to memorize and you’ll learn these skills. You can try to memorize psych terms to practice memorization. If you want to be a nurse, you can switch and become a nurse. It may take more effort but it will certainly be rewarding. You have to believe in yourself. Your potential is not tied down.",
      "author": "milk1tea",
      "created": 1634211455,
      "upvotes": 1,
      "replies": {}
    },
    "hgljrca": {
      "link": "/r/college/comments/q7rjn3/what_if_i_choose_the_wrong_major/hgljrca/",
      "text": "Your worrying about picking the right major here I am sitting at home and can't sleep thinking. Do I get the Phizer moderna or nothing. My appt is like in a couple hours and I might not seem like it but considering I washed my hands wore the mask and 20% min of the population has gotten infected while 60% vaccinated I've been in this fight and millions of people infected here with my hand sanitizer gummies for immune system etc and if anyone tells me about the dangers of not getting vaccinated I can vote the fact that 4 million caught it and I still hadn't and vaccinated people who were lazy did because they didn't care. Especially with the meipa virus I heard of coming out on the news. And the whole delta thing I mean you know the major thing is hard I face it to worse case scenario I blow a year of my time and 10k. It's alot but health is more important. Also making decisions health is more important I may have seriously fucked up on my major choice you know maybe I fucked up on my major but you know what college is a freaking battle and whatever the hell class I took it was all hard and alot of the time I forgot about oh I'll be a doctor or something else. I just got talking with my brother and it was like oh so how's school and I was like not great I think I might want to change my major. And he classes aren't the right classes I end the conversation and it's basically like when will I ever use this in real life and he's like I just used that like 25 times today. And then I got thinking shit no matter what I take I'm just trying not to work at mcdonald's or walmart. And if I made the wrong decision then really I didn't because those classes I'm taking aren't about the money. It's all about the time those 6 hours sitting down reading for hours on ancient chinese painters ok. And I mean the only thing I learn of any use is how to sit down open a book and write. And it don't matter if it's precalc. Calculus engineering to become a doctor whatever it's the grind because everything taught in school literally could fit in a single bookshelf and the lectures could all fit in a few dvds. And if I made the wrong decision in college then I'm off to Barnes and nobles or to buy the book. College or no college while I figure stuff out.",
      "author": "sars79",
      "created": 1634210329,
      "upvotes": 0,
      "replies": {}
    }
  }
}