{"sid": "pwlkco", "link": "/r/college/comments/pwlkco/miss_my_old_life/", "title:": "Miss my old life.", "text": "I loved all of my highschool before college. I have always been a person to not like change, I love a routine it’s always when I’m happiest and most confident with myself. The last summer before college happened to be my favorite routine. I met the best girlfriend after a horrible relationship before that, I had a great group of friends who had parties every weekend with our group, I went to the gym with my best friends and ate lunch every day with them, hung out every night. It was perfect. The girlfriend is 100% one of the biggest factors that makes me sad and miss home and I know that. I’m over a month into college and it honestly wasn’t to bad at first, I left my girlfriend and we decided it was best for us to breakup but we decided to check in occasionally which I think helped me push away the thoughts of sadness and ignore them for a while and I got a good friend group in college and it was pretty fun. I do a lot of activities and joined a fraternity and now I am just at point where I am kind of just sick of it all, I don’t have desire to party or drink cause everytime I do it’s not as fun w out my ex gf and I think of that. And everything else I do with my friends is great but it just doesn’t compare to my at home life. It’s so hard to comprehend that I’m stuck here and everytime I come to that realization again that there is no going back it hurts really bad. I’m going home this weekend for the first time and I am gonna see her even though we aren’t together and am gonna hang w my friends and have my routine for the weekend again. I have actually been upset in this week leading up to going home rather than excited because I have been thinking about what’s gonna happen when I leave back for college again and won’t come back for a long ass time. I’m struggling with this and don’t know what to do. Btw I am out of state and 3 hour flight from home.", "author": "nothingtilted123", "created": 1632762448, "retrieved": 1632945553, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"heit67h": {"link": "/r/college/comments/pwlkco/miss_my_old_life/heit67h/", "text": "Feeling you a lot rn bro\nAlmost same identical situation for me minus the girlfriend part lol\nI ended up feeling the same way about going back home. However, I went home last weekend and ended up feeling fairly fulfilled. Got to see my local area again, see some of my friends who stayed local, and see all the fam and such. Felt great yet horrible knowing I’d have to dip again in 2 days. \nI think knowing that none of that is ever going to disappear made me feel better. Maybe if being away from home is a large struggle, try your best to go home on the weekends more often if possible and slowly regress from doing so. It seems to me like getting used to college and it’s differences has been taking a while for me and it seems it might be that way for you too. It’ll all be normal soon enough. Might not ever get truly “better” than back home, but ya gotta make the best of what you got I suppose.\nI’ve definitely found a lot of self fulfillment and distraction at college recently by just forcing myself to hangout with new people even if I don’t really want to. I was stuck in this really bad slump for like the first three weeks of college where I never wanted to leave my dorm, but thankfully I pushed myself to get out a bit. Campus events and such saved my butt.\n\nHope things get better homie", "author": "SansBoner420", "created": 1632780373, "upvotes": 1}}}