{
  "sid": "iv7izl",
  "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/",
  "title:": "I hate zoom lectures",
  "text": "As soon as I sit down and open my laptop for zoom meetings, my head gets all weird. It feels cloudy almost? And I get a headache with it. Does anyone else have this problem?",
  "author": "b99fan2014",
  "created": 1600440731,
  "over_18": false,
  "upvotes": 782,
  "upvote_ratio": 0.98,
  "comments": {
    "g7wia2h": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g7wia2h/",
      "text": "Some of it is because people are looking at us 100% of the time, potentially, which is not how a classroom works. AND they aren’t looking directly at you, they are not looking directly into the camera so it looks like you’re talking to someone who’s not making eye contact which can be uncomfortable. It’s usually something that signals extreme social anxiety so our brains are registering this.\n\nSo, realize people aren’t looking directly at you most of the time. Don’t feel bad if you can’t have your facial expression in constant rapt attention. That’s too much to ask. If you get called on, don’t be afraid to say, okay hang on. Let me think about that for a second.",
      "author": "Dorothy_Day",
      "created": 1601998083,
      "upvotes": 1,
      "replies": {}
    },
    "g5udjs2": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5udjs2/",
      "text": "If you are not use to looking at screens, change the color settings, it can greatly help relieve any eye/brain pains.  \n\n\nI dislike zoom lectures in general though, because it would be more efficient if the professor posted completed lectures and used the class time for answering questions or going over possible questions.  \n\n\nTo make it worse, most professors are so behind in knowing how to properly give an online lecture/course that it's often better to just ignore them and find another lecture of the same material online.  \n\n\nOne of my profs still is struggling to just write basic notes.  \n\n\nFor those that still may be struggling, turning an old or used tablet/smartphone into a writing drawing pad then connecting (or casting) it to your main PC does wonders.",
      "author": "Sevenzulu",
      "created": 1600540060,
      "upvotes": 1,
      "replies": {}
    },
    "g5tdsg7": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5tdsg7/",
      "text": "It’s so hard to keep my eyes open",
      "author": "goldenflagirl",
      "created": 1600524150,
      "upvotes": 1,
      "replies": {}
    },
    "g5tbc1o": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5tbc1o/",
      "text": "Buy blue light canceling glasses.",
      "author": "CozmicOwl16",
      "created": 1600523101,
      "upvotes": 1,
      "replies": {}
    },
    "g5sve95": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sve95/",
      "text": "As a non-traditonal student (30+ yrs old), I hated it. The remote classes were just as the same as going to class in-person, and proctoring exams/quizzes was a big time waster when it takes 30 to 40 minutes for an instructor to check everyone's webcams.\n\nI decided to withdraw and opt-in for a 100% online program with no video conferencing.",
      "author": "DammieIsAwesome",
      "created": 1600511283,
      "upvotes": 1,
      "replies": {}
    },
    "g5sp82w": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sp82w/",
      "text": "this sounds like brain fog, I think the internet is full of info on it and why it happens and tips on how to help it, iirc it's often related to anxiety or depression (personally I struggle with it due to adhd)",
      "author": "robthelobster",
      "created": 1600504350,
      "upvotes": 1,
      "replies": {}
    },
    "g5soj3r": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5soj3r/",
      "text": "Seen an eye doctor lately?",
      "author": "DJayne42",
      "created": 1600503596,
      "upvotes": 1,
      "replies": {}
    },
    "g5sn2tb": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sn2tb/",
      "text": "I don’t hate it but still feels a little weird. For some classes I can’t help but think how YouTube videos would probably be a more effective way of learning. It’s also easier to get distracted and disengage.",
      "author": "FreudTheGoat",
      "created": 1600502073,
      "upvotes": 1,
      "replies": {}
    },
    "g5skegw": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5skegw/",
      "text": "I’m confused, are you saying electronic screens makes you feel unwell? Or the act of being in a Zoom meeting",
      "author": "legend_kda",
      "created": 1600499404,
      "upvotes": 2,
      "replies": {
        "g5vpblw": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5vpblw/",
          "text": "zoom i guess",
          "author": "b99fan2014",
          "created": 1600556774,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g5sjwu2": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sjwu2/",
      "text": "Yuppppp. My single zoom class I have is an absolute nightmare. Our prof doesn’t “teach” whatsoever lol. Instead makes us get in groups and present the material ourselves lolol. \n\nI mean, I took him before and it was an easy A. He’s nice and all. But damn part of me is like why in the fuck is that allowed?! I am paying almost $3k to take this class - an advanced professional level course mind you. For graduate students who are studying project management- yet the “teacher” doesn’t do one single instance of teaching anything whatsoever lol. \n\nI’m cool with the easy A. Just kinda disappointing based on the cost, the purpose of college and specifically grad school, plus how can you consider yourself and educator- let alone a professor who also holds a Doctorate mind you- when in reality you do not teach one single thing lmao. \n\nAdditionally, he assigns two papers and one research paper for this class. The other course I took, over a completely different subject debatably, had the same requirements. Upon studying our list of approved sources I realized they’re literally the exact same damn ones from the other class. So in a way, it’s a win. I already have them written. Got 100 on them. So yeah fine by me. But still, that was like a 3000 level junior-level course and this is meant for postgrads pursuing their master’s degree and whatnot. \n\nSo like yeah easy A is fine. Less work is cool. Presenting is easy and also easy A’s. But I can’t help it that there is a part of me that is bothered by the fact I pay that much money to teach myself and my classmates and vice versa, the assignments for our research papers are the exact same as from a class intended for undergraduate juniors, and the professor does absolutely nothing besides sit there and listen 99% of the time, barely speaks English as well, and if he does in fact have any sort of comment it is almost only to refer to himself in third person and remind everyone he had his Doctorate degree. lol \n\nSo yeah perhaps I’m just picky and a bit of a student most others hate- I just kinda feel cheated considering how expensive it is and I’m getting a professional degree and whatnot. An easy A is cool and all but I think for me personally, especially at the postgrad level of masters and above- there should at the very least be a distinct difference from a class meant for students two or three years under us. Plus, I might be a little overbearing but still my goal in doing this is to actually learn and prosper professionally. Getting an easy, automatic A is great don’t get me wrong and eases my stresses by a ton. But still at the same time it does not necessarily provide me with any sort of professional skills or knowledge I am seeking by pursuing my masters degree. \n\nMaybe I’m just crazy. Shit, I’d be absolutely fine with it if he would actually just teach. Or if they lower the cost to sub $1k lol. Wouldn’t bitch at all then. Yet as it stands currently in the setup of the course and the requirements, it’s simply the same exact course I took two damn years ago to get my bachelors sans the final research paper which is over a different topic and the material in the textbook we present is different. \n\nOther than that, literally it’s the exact same shit. I turned in a paper I wrote in thst other class. Once I noticed the list was the same, because I knew I made 100 on it before. Got myself 100 again lol. \n\nLove having good grades but I’d also like to actually learn and benefit from the courses I’m paying good money for in order to become a business leader one day and more qualified in many areas. \n\nJust doesn’t seem right to me. \n\nPlus, requiring the class to present is super annoying and always has some sort of technical issues due to zoom. Never fails. It’s literally doing more harm than good in my opinion lol I’d rather just fuckin teach myself the class, then take my exams and write my papers - all of which have been written in the past- and get my A and move on. That would be possible to do in a maximum of 2 weeks working at a slow pace. One week if you simply engaged yourself and got the work done. \n\nI just believe it truly is a fantastic representation of the flaws within our education system - specifically due to the expense and the increased need for a postgraduate degree. Kinda pointless to me to pay nearly $20-50k if the professors do not teach, use the exact same material from undergrad courses, require the students to teach the material, and simply just sits there and speaks only to remind us he has a doctorate degree. That, to me, does nothing whatsoever to increase one’s professional aptitude or knowledge and simply is a waste of time, money, and resources entirely. It defeats the entire purpose of getting an advanced degree and also proves that it’s simply a piece of paper at the end of the day which for whatever reason makes those who can afford to get it or wind up having their company pay for it seem more knowledgeable or qualified for advanced or high level positions when the truth is they simply just paid a ton of money, learned arguably nothing that will actually make them a better leader or more qualified to do said jobs, or ensure they are of a higher intelligence level compared to those with simply a Bachelors degree, or even some with no degree at all and a ton of experience.  \n\nIf nothing else, it shows that our education system and the ways some companies require their workers to possess such degrees is beyond flawed and arguably pointless. Because this course is not the only one I have encountered like that during my studies. It’s quite sad and honestly it makes me mad honestly. Because I could learn more valuable information that would actually be applicable and beneficial to myself and my company if given the chance to mentor someone with multiple years of experience. Then, at least one would actually get to see how things should be done, how to do them, and ultimately learn more useful and relevant info compared to what some of these courses present. \n\nIt’s laughable really. A waste of money for us students as well. I personally am thankful more companies are beginning to realize this as well and are shifting to more experienced based promotion and training verses what a piece of paper says about your abilities lol. Frankly, there are students in a number of my masters classes who cannot even properly put a presentation together nor communicate the information in a manner consistent with high level course work. Some simply struggle to speak whatsoever. It baffles me how someone that is incapable of basic communication skills managed to obtain a Bachelor’s degree to begin with - but also will be able to get a masters degree and as such a leadership based or higher level position as a result. If one cannot even properly speak or communicate, then how in the hell are they going to effectively lead a team or be capable of performing their day to day duties the job may require. I myself cannot think of many jobs, especially on a professional or advanced level where communication is not vital and something used every single day while at work. \n\nSorry y’all. Rant over. I just feel as if it helps demonstrate that just because one may look impressive on a piece of paper - it doesn’t not necessarily guarantee they’ll possess the qualities, abilities, or knowledge to succeed in a job; in fact, in some instances there would be some people with no degree whatsoever who would out perform them in nearly every way if compared. \n\nI just do not believe that should be allowed to happen. I think that we should re-evaluate how we go about hiring people into those types of jobs and consider experience and abilities just as important as a piece of paper they managed to pay a lot to receive yet can’t speak correctly. \n\nJust is frustrating to me personally I apologize. \n\nHad to get it off my chest lol",
      "author": "Jcald25",
      "created": 1600498931,
      "upvotes": 1,
      "replies": {
        "g5skyid": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5skyid/",
          "text": "Is it a seminar class?  Some grad classes are supposed to work that way.",
          "author": "SpoonyBrad",
          "created": 1600499950,
          "upvotes": 1,
          "replies": {
            "g5spw85": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5spw85/",
              "text": "Nah this class is not. It’s actually supposed to be a leadership and management challenges and procedural operations course. Set up as a normal class. \n\nOther professors also teach it except they actually teach lol. \n\nI’ve had my hair share or seminar classes lol. This is just a last prof I’m pretty sure honestly. \n\nPlus he barely speaks English. Which also is baffling. Nothing against people of other cultures but I go to a rather well known and respected university where I’m from so it’s weird to have a prof like that.",
              "author": "Jcald25",
              "created": 1600505086,
              "upvotes": 2,
              "replies": {
                "g5sqcgr": {
                  "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sqcgr/",
                  "text": "Okay, yeah, that's weird then!",
                  "author": "SpoonyBrad",
                  "created": 1600505582,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g5sjjyo": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sjjyo/",
      "text": "I am on the same damn boat. Its like feeling so unmotivated. So many things being assigned and we basically have to teach ourselves. Glad im not the only one feeling like this!! But something that helps is developing a schedule that will help you feel like you got something done like take some notes before/after class or YouTube/google what you don’t understand and try to put it in your own little terms. Hope everything works out",
      "author": "PoonGaming",
      "created": 1600498596,
      "upvotes": 1,
      "replies": {}
    },
    "g5sh7jg": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sh7jg/",
      "text": "It helps to wash up and maybe put on a nice shirt like you are going out to class",
      "author": "FMG_99",
      "created": 1600496499,
      "upvotes": 1,
      "replies": {}
    },
    "g5sgryh": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sgryh/",
      "text": "No.",
      "author": "SchizzleStick",
      "created": 1600496223,
      "upvotes": 1,
      "replies": {}
    },
    "g5sfvm9": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sfvm9/",
      "text": "Sounds almost like dissociation to me",
      "author": "AutumnStars9",
      "created": 1600495656,
      "upvotes": 3,
      "replies": {
        "g8q7s1a": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g8q7s1a/",
          "text": "Speaking from experience: yeah. Could be a stress reaction to Zoom calls that’s become an association. But it could also just be screen/Zoom fatigue.",
          "author": "chrisjjs300",
          "created": 1602620873,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g5sfq0k": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sfq0k/",
      "text": "This is called \"Zoom Fatigue\" it is happening to a lot of people. Sorry I have no solution for you besides maybe recording the live lecture to watch watch you miss later.",
      "author": "AwkwardAng",
      "created": 1600495561,
      "upvotes": 5,
      "replies": {}
    },
    "g5saizr": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5saizr/",
      "text": "Online classes on zoom don't feel like regular classes because people don't treat them like regular classes. People wake up 30 seconds before a class begins, flip open their laptop while still in bed and half a sleep. Then, they complain about how they can't learn.\n\nThat's your fault, take responsibility.\n\nBuy a desk, lamp, and comfortable chair. If your laptop screen is not large enough, get a 2nd monitor. Place those items in a quiet, distraction free area in your home.\n\nWake up 30-60 min before your class begins. Brush your teeth, make breakfast, and take a shower (if you're that type of person). Take out pen and paper. Prepare yourself to learn and you will learn.",
      "author": "SadWolverine24",
      "created": 1600491631,
      "upvotes": -3,
      "replies": {
        "go58ja5": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/go58ja5/",
          "text": "Faccts! People are so freaken annoying! It's the same thing as learning on YouTube!! Stop complaing!!!",
          "author": "GrapefruitOk4660",
          "created": 1613847115,
          "upvotes": 1,
          "replies": {}
        },
        "g5vp7cr": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5vp7cr/",
          "text": "[deleted]",
          "author": null,
          "created": 1600556731,
          "upvotes": 0,
          "replies": {
            "g5vw621": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5vw621/",
              "text": "Desk, lamp, and chair are PRIVILEGE?",
              "author": "SadWolverine24",
              "created": 1600559114,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g5s9uxg": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s9uxg/",
      "text": "relatable. my lessons are 3h seminars that require class participation (10% of grade) so you literally HAVE to be there and it sucks",
      "author": "someoneneedstosleep",
      "created": 1600491119,
      "upvotes": 2,
      "replies": {}
    },
    "g5s8sx9": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s8sx9/",
      "text": "And I thought I had no idea what was going on in an in-person lecture. Turns out I was wrong. These Zoom lectures are making me feel more clueless than ever when they’re over for the day",
      "author": "520mile",
      "created": 1600490339,
      "upvotes": 1,
      "replies": {}
    },
    "g5s8o16": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s8o16/",
      "text": "Ngl, it really sucks. I wanna fool around, play something while lecture but I can’t. Gotta study dammit",
      "author": "MiserableCalamar",
      "created": 1600490240,
      "upvotes": 2,
      "replies": {}
    },
    "g5s6z4t": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s6z4t/",
      "text": "I have serious migraines from screen time, I'm super sensitive to light and sound and some things that have helped me are blue light glasses (seriously a game changer for my headaches) and not using headphones and having it on a lower volume (only an option if you're already in a quiet area unfortunately). Also drinking coffee or tea, I think caffeine really helps my brain and my headaches!",
      "author": "legopadme",
      "created": 1600489225,
      "upvotes": 2,
      "replies": {
        "g5ux2zk": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5ux2zk/",
          "text": "Yeah, in the past I've had a few ocular migraines that seemed to be triggered by screens (7 times out of 10 I'm looking at a screen when it triggers). I thought it went away, but I had one recently for the first time in 4+ years.\n\nI'm a computer guy to begin with, so it's not like I'm completely new to spending a lot of time looking at a screen, but with everything being online now it's still more than I normally would.\n\nI discussed it with my optometrist yesterday and he recommended a new prescription with a blue light tint. There seems to be a lot of migraine people saying it helps them, yet in my uni sub someone linked a CBC story debunking blue light as harmful. But I'm not sure if that was intended more for the average person who's just worried about blue light damaging their eyes and not migraine people.",
          "author": "sleepy_scav",
          "created": 1600547300,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g5s4mmm": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s4mmm/",
      "text": "I hate *giving* Zoom lectures. One of my classes voted for a fully synchronous one. I really, really hate not being able to play off peoples' reactions and the energy in the room. If the energy is slow and dull, I pep it up. If it's excited or eager, I find ways to carry it. \n\nThe little funny moments during classes are what I live for, and nothing is more rewarding than making my students laugh with dry sarcasm and stupid jokes. I really, really dislike not being able to do that. Looking at people's disembodied heads on my computer just doesn't cut the mustard.",
      "author": "purple_ombudsman",
      "created": 1600487964,
      "upvotes": 8,
      "replies": {}
    },
    "g5s3ir3": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s3ir3/",
      "text": "I really liked zoom classes for last semester and when I had my summer semester, but now I am beyond stressed and wished I was back in the classroom. I feel like I’m learning nothing and I’m falling behind.\n\nNot to mention one of my instructors stopped our zoom meetings because “we didn’t show up for class” when in reality, all 16 of us did and he just ended the zoom call anyways. I’m only three weeks in and I’m already burnt out.",
      "author": "Jebbles077",
      "created": 1600487340,
      "upvotes": 7,
      "replies": {}
    },
    "g5rpaxk": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rpaxk/",
      "text": "Am I the only one loving zoom?  I mean, not having to get dressed up, eat breakfast, get in the car, finding parking, and walking across campus to get to class and making sure I don't need to use the restroom first, and  sit near some distracting fools around.   Nah, I'll take the comfort of my home all day long...",
      "author": "redditfish3",
      "created": 1600480251,
      "upvotes": 13,
      "replies": {
        "g5smxf8": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5smxf8/",
          "text": "I get this, in a sense. but isn’t that sort of what makes college? it’s preparation for our adult lives and for me it helps me stay on top of the things. the routine, the physical “i have to be here!” deadlines. it’s so easy to just get distracted when your bed or access to anywhere in your house is just right there. not to mention just a single click and i am hidden from the world and can freely go through tik toks. it’s just made me lazier and i am trying so hard to combat it but i can’t at home.",
          "author": "icanloveyouAMA",
          "created": 1600501917,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g5rkvhn": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rkvhn/",
      "text": "So glad i took this semester off. I already knew I was gonna hate having ALL my classes online after last semester switching online in the middle.",
      "author": "cactusKcaj",
      "created": 1600478239,
      "upvotes": 1,
      "replies": {}
    },
    "g5rg1gi": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rg1gi/",
      "text": "Your professors hate them too.",
      "author": "Gunter-Karl",
      "created": 1600475570,
      "upvotes": 7,
      "replies": {
        "g5s91oj": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s91oj/",
          "text": "Indeed :-(",
          "author": "_The_Professor_",
          "created": 1600490518,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g5rfks1": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rfks1/",
      "text": "not to mention that u still need to present ur own reporting also thru zoom sometimes :(((",
      "author": "noturnuhtella",
      "created": 1600475313,
      "upvotes": 2,
      "replies": {}
    },
    "g5r3zpc": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5r3zpc/",
      "text": "Cheating and finessing is so easy now. I don’t even have to study for a test anymore.",
      "author": "NegativeStomach28",
      "created": 1600468829,
      "upvotes": 3,
      "replies": {
        "g5s976g": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s976g/",
          "text": "What’s the point, then?",
          "author": "_The_Professor_",
          "created": 1600490630,
          "upvotes": 3,
          "replies": {}
        },
        "g5sd2pe": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sd2pe/",
          "text": "Same",
          "author": "zeyadx23",
          "created": 1600493722,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g5r0xqa": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5r0xqa/",
      "text": "I understand <1% of what's going on",
      "author": "nateCod",
      "created": 1600467389,
      "upvotes": 6,
      "replies": {}
    },
    "g5qzror": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5qzror/",
      "text": "I fall asleep",
      "author": "corpsejockey",
      "created": 1600466819,
      "upvotes": 3,
      "replies": {}
    },
    "g5qwyne": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5qwyne/",
      "text": "I believe that a hybrid method it will balance out, prod and cons, what about a platform that you could be online watch pre recorded videos or lessons and have a real-time campus to interact with friends and teachers. That will be awesome. I am helping a company in Edtech that has that. Anyone would like to try it?",
      "author": "Afreites",
      "created": 1600465542,
      "upvotes": 1,
      "replies": {}
    },
    "g5qvodx": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5qvodx/",
      "text": "Do professors know when you are on zoom or not? I mean active on the app. I hate not being able to actually sit in class and learn old school style 🤣",
      "author": "Alil_twisted",
      "created": 1600464974,
      "upvotes": 1,
      "replies": {}
    },
    "g5qihwl": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5qihwl/",
      "text": "I get a lot of screen fatigue from looking at the screens so much so I relate. :(",
      "author": "chiicha",
      "created": 1600459098,
      "upvotes": 9,
      "replies": {}
    },
    "g5qblbs": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5qblbs/",
      "text": "its so discouraging to have to take notes and learn like this, it is what it is tho",
      "author": "Honest_Examination_6",
      "created": 1600455539,
      "upvotes": 3,
      "replies": {
        "g5sjpy8": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sjpy8/",
          "text": "The classic advice applies: enjoy the good parts and try to tolerate the bad parts.",
          "author": "jones_supa",
          "created": 1600498751,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g5q7x2c": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5q7x2c/",
      "text": "That’s how I feel with in person lectures - not that I love video calls",
      "author": "purple_mountain_",
      "created": 1600453671,
      "upvotes": 2,
      "replies": {}
    },
    "g5pyh16": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pyh16/",
      "text": "I only have this problem when I forget to wear my glasses. Even with my glasses, I still sometimes end lectures with headaches, but that's just because I have four 3-hour lectures that are taught in ASL and the incredible amount of concentration required for me to see, translate, and understand the material in real-time puts a great strain on my brain and eyes.\n\nIs it possible you also need glasses (if you don't already have them)? Is the ambient light in the place you're watching the lectures in too low or too high? Are you drinking enough water? Finally, have you considered having some other things to do while you're in-lecture (taking notes, playing with a little fidget toy, etc.) that will help keep your mind occupied and clear that mental fog?  \nIt can be super frustrating to deal with this stuff, so I feel for you. I really hope you can find something to help you out!",
      "author": null,
      "created": 1600449057,
      "upvotes": 10,
      "replies": {
        "g5q5w2z": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5q5w2z/",
          "text": "i write notes while also scrolling on my phone. The biggest change is that I opened my blinds so i could try to close bc when closed, my head was fine. thanks!",
          "author": "b99fan2014",
          "created": 1600452632,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g5pxczl": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pxczl/",
      "text": "I started using night mode to reduce blue light and it makes a world’s difference",
      "author": "CorrodedRose",
      "created": 1600448559,
      "upvotes": 22,
      "replies": {
        "g5q5qe0": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5q5qe0/",
          "text": "thanks for the advice! i got blue light glasses and they kinda work but i’m too self conscious to wear glasses on call",
          "author": "b99fan2014",
          "created": 1600452552,
          "upvotes": 9,
          "replies": {
            "g5s41bf": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s41bf/",
              "text": "wearing glasses is a very normal thing?? why would you be worried",
              "author": "iamfearformylife",
              "created": 1600487649,
              "upvotes": 12,
              "replies": {
                "g5voxlb": {
                  "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5voxlb/",
                  "text": "I’m ✨insecure✨",
                  "author": "b99fan2014",
                  "created": 1600556638,
                  "upvotes": 1,
                  "replies": {
                    "g5wue2m": {
                      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5wue2m/",
                      "text": "i mean i wear glasses, lots of people wear glasses. we're not like, lesser or something, for wearing glasses",
                      "author": "iamfearformylife",
                      "created": 1600569416,
                      "upvotes": 1,
                      "replies": {
                        "g5wv2dt": {
                          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5wv2dt/",
                          "text": "yes! I know! I just don’t like change haha and I can’t scroll through twitter with the reflection",
                          "author": "b99fan2014",
                          "created": 1600569630,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g5prrtr": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5prrtr/",
      "text": "Using a blue light filter can help with headaches in my experience (windows has one built-in), but yeah I don't really dig these remote lectures",
      "author": "robo_burrito",
      "created": 1600446090,
      "upvotes": 80,
      "replies": {
        "g5ruutb": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5ruutb/",
          "text": "I use blue light filters / nighttime mode plus blue light glasses. I still get headaches but not as much",
          "author": "kd0919",
          "created": 1600482822,
          "upvotes": 16,
          "replies": {
            "g5sj99s": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sj99s/",
              "text": "It is also good to take care of flicker. A PWM backlight can cause headaches and eye strain, so a flicker-free monitor (or a laptop with flicker-free display) is recommended. Also your surrounding lights might have flicker. Sometimes you can point out flicker by filming a video clip with your smartphone and you see stripes in the clip.",
              "author": "jones_supa",
              "created": 1600498320,
              "upvotes": 3,
              "replies": {}
            },
            "g5tgn41": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5tgn41/",
              "text": "I got a pair of cheap blue light filtering glasses on amazon to help wit this. The blue light filter on my laptop just doesn’t do enough but if throw in my contacts and pop on the blue light filtering glasses I can look at the screen for much longer.",
              "author": "fritz0126",
              "created": 1600525426,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g5s6kl1": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s6kl1/",
          "text": "MacOS has one built in too.",
          "author": "LynchRed",
          "created": 1600489009,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g5pph7x": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pph7x/",
      "text": "Moving the whole experience of in-person learning to online learning is very overwhelming. I do not like it either especially with the workload and expectations from students to perform as if like is normal.",
      "author": "SchoolOfLife502",
      "created": 1600445081,
      "upvotes": 20,
      "replies": {}
    },
    "g5pp5gq": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pp5gq/",
      "text": "You can always get up and stretch.",
      "author": null,
      "created": 1600444937,
      "upvotes": -3,
      "replies": {}
    },
    "g5poadv": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5poadv/",
      "text": "I hate them too, and feel the same way. I'm honestly so glad it's my last semester. Can't imagine how freshmen must feel.",
      "author": "BuyMeLotsOfDiamonds",
      "created": 1600444565,
      "upvotes": 3,
      "replies": {
        "g5ptdbd": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5ptdbd/",
          "text": "As a freshman, it’s certified horrible. Literally pulling my hair out because my stat teacher can’t teach without pausing to ask for questions every 2 minutes. And ofc, people always have questions in a 100 person lecture.",
          "author": "toohardtochoose1",
          "created": 1600446769,
          "upvotes": 5,
          "replies": {
            "g5pw8qi": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pw8qi/",
              "text": "I'm so sorry. I promise it's much easier in person.",
              "author": "BuyMeLotsOfDiamonds",
              "created": 1600448068,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g5rkp65": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rkp65/",
          "text": "We are going crazy. My chem professor is a great teacher in person. On zoom, I might as well not go.",
          "author": "randomfandoms2001",
          "created": 1600478158,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g5pnzyi": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pnzyi/",
      "text": "That’s just when I have a headache. I love my professors but when they have live zooms and attendance is mandatory, and I’m cramping with a wild headache, looking at a screen for another hour and trying to understand calculus is just not it",
      "author": "halftherainbow",
      "created": 1600444436,
      "upvotes": 274,
      "replies": {
        "g5rnsuu": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rnsuu/",
          "text": "Omg i have a 4hr pre-calculus class that switched to a zoom meeting and my professor stays on for the whole time after the first two hrs I’m not even mentally there anymore.",
          "author": "desjb18",
          "created": 1600479550,
          "upvotes": 99,
          "replies": {
            "g5ro0nb": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5ro0nb/",
              "text": "Four hours? What the fresh fuck?",
              "author": "halftherainbow",
              "created": 1600479646,
              "upvotes": 84,
              "replies": {
                "g5rpb0p": {
                  "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rpb0p/",
                  "text": "Yes four hrs pre-cal for business it still blows my mind how long the class is. And it’s Saturday at 9am the only day and time my school offers the class.",
                  "author": "desjb18",
                  "created": 1600480251,
                  "upvotes": 53,
                  "replies": {
                    "g5rq2is": {
                      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rq2is/",
                      "text": "U poor soul. U have my utmost sympathy fr",
                      "author": "halftherainbow",
                      "created": 1600480583,
                      "upvotes": 35,
                      "replies": {}
                    },
                    "g5sd3ac": {
                      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sd3ac/",
                      "text": "Professor here. If my school tried to make me teach a 4 hr class that started at 9 am on Monday I’d tell them to fuck off.  And then I’d start looking for a new job.",
                      "author": "fredprof9999",
                      "created": 1600493736,
                      "upvotes": 31,
                      "replies": {}
                    },
                    "g5s6agh": {
                      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s6agh/",
                      "text": "I'm sorry but you're in hell and idk how the internet reaches down there, I would suggest begging to be saved by angels cus that is not earth that's hell",
                      "author": "ConnorCarbon",
                      "created": 1600488856,
                      "upvotes": 20,
                      "replies": {}
                    }
                  }
                },
                "g5s3zi9": {
                  "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s3zi9/",
                  "text": "I have two three hour humanities seminars on Zoom per week. Along with all my other zoom classes which span 1-2 hrs. The three hour classes just fucking kill me.",
                  "author": "slantedsc",
                  "created": 1600487620,
                  "upvotes": 11,
                  "replies": {}
                },
                "g7dzwpw": {
                  "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g7dzwpw/",
                  "text": "My chemistry class is 5 hours. 8am to 1:10pm Monday and Wednesday. Labs aren't really working online so she uses the entire 5 hours to lecture. End my suffering.",
                  "author": "I_am_not_creative_",
                  "created": 1601634917,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g5sia6d": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sia6d/",
              "text": "I would be checking to see if attendance is mandatory lol, or at least how much not attending would take off the total grade. That's some bullshit. You could get so much homework done in four hours.",
              "author": null,
              "created": 1600497423,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g5rur7t": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5rur7t/",
          "text": "I feel that, I have a MWF 4 hour architecture studio where the instructors believe we should be able to be engaged for 4 hours straight, 3 days a week, to give feedback and critique the entire time.",
          "author": "kd0919",
          "created": 1600482777,
          "upvotes": 9,
          "replies": {}
        },
        "g5s3ldy": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s3ldy/",
          "text": "I feel u man🥺",
          "author": "obo10101",
          "created": 1600487384,
          "upvotes": 3,
          "replies": {}
        },
        "g5s9jfi": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5s9jfi/",
          "text": "I straight up stopped attending calculus lectures two weeks into the quarter last quarter",
          "author": "miekolpham",
          "created": 1600490883,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g5pj1f3": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pj1f3/",
      "text": "I have gotten this feeling too when I sit for long for zoom lecture. Because in-person, I can't sit for long and I have to write down lectures note rather than just siting. Maybe try to move around or write notes to get distracted by the headache problem",
      "author": "hanakoyo",
      "created": 1600442020,
      "upvotes": 22,
      "replies": {
        "g5sf1yx": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sf1yx/",
          "text": "Zoom is super nice for me because I can move around or get a drink or use the bathroom or whatever without it being a disruption [and i can keep listening to the lecture if i can be arsed enough to sort out the tech for it]\n\nor sometimes i'll just fiddle around on my guitar - it helps my brain to just listen to the lecture but also have something to do with my hands - which of course i couldn't do irl",
          "author": null,
          "created": 1600495146,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "g5pifk8": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pifk8/",
      "text": "Actually quite the opposite, I get that exact same feeling during long days of in-person lectures. Like my brain wants to zone out and staying focused is literally painful.",
      "author": "michacu",
      "created": 1600441715,
      "upvotes": 111,
      "replies": {
        "g5pio0d": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pio0d/",
          "text": "I think in person lectures were mentally better for me becuase I had friends to make the day better. Now, as soon as i log onto my first meeting of the day, my head just gets foggy. Maybe it’s a mental health thing but I can’t focus in online classes because of this",
          "author": "b99fan2014",
          "created": 1600441833,
          "upvotes": 57,
          "replies": {
            "g5pjfax": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pjfax/",
              "text": "Sorry to hear that you're struggling with this. Maybe try changing the place where you take your zoom classes to somewhere with less distractions around? Or the opposite, do some doodling while listening to the lecturer, if you don't have to be super focused on the material (sounds like that isn't currently working anyway). That way you'll at least look like you're taking notes and your brain will be satisfied with doing a non-zoom activity while you're still partially paying attention.",
              "author": "michacu",
              "created": 1600442209,
              "upvotes": 10,
              "replies": {}
            },
            "g5sj3ex": {
              "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5sj3ex/",
              "text": "Feel the exact same way. Within 10-20 minutes of a zoom lecture I just get a really foggy head and it feels like a really bad headache, and for me it lasts for the whole day. I had a 3+ hour long lecture in the summer and I felt the headache for the whole day afterwards. I’ve tried changing things up but I can’t get it to go away. Shorter, more frequent lectures work a lot better for me in this environment",
              "author": "GP915",
              "created": 1600498168,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "g5pheie": {
      "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5pheie/",
      "text": "[removed]",
      "author": null,
      "created": 1600441191,
      "upvotes": -10,
      "replies": {
        "g5phumr": {
          "link": "/r/college/comments/iv7izl/i_hate_zoom_lectures/g5phumr/",
          "text": "that would make me straight but ok bro",
          "author": "b99fan2014",
          "created": 1600441421,
          "upvotes": 9,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634056263
}