{
  "sid": "q5bq4h",
  "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/",
  "title:": "I hate lectures help",
  "text": "I hate lectures, I love participating and learn more effectively in small groups of people. I can't concentrate if it's a lecture. Do you have any tips?\n\nEdit: I forgot to mention that I’m doing pretty well, I don’t have any problems regarding success. I currently have a 3.7 GPA. I’m a language major so most of my courses are discussion heavy in small groups of people (like 20-30). I just really don’t like lectures and was asking if anyone had any tips to make them more bearable and efficient.",
  "author": "tiramisuandbooks",
  "created": 1633884386,
  "updated": 1634083033,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "hg4eov4": {
      "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg4eov4/",
      "text": "unfortunately this is simply the way college is…. here’s what i usually do to learn more efficiently though. \n\ni look at the lectures as my outline for what i should be learning. i take notes during them and then i go home and i look at what i need to learn. i then teach myself using whatever methods work best for me…. my method tends to be flash cards. u can do practice tests, diagrams, charts, flashcards, whatever works for you. but you need to do the “active learning” yourself. treat yourself like your own teacher, and the lecture as your lesson plan.",
      "author": "ham_alamadingdong",
      "created": 1633884999,
      "upvotes": 11,
      "replies": {
        "hg5rn2o": {
          "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg5rn2o/",
          "text": "actually my curriculum is filled with interactive courses which is nice. every semester i have 1-2 lectures and the other courses are usually in the form of discussion. but thank you for the tips!",
          "author": "tiramisuandbooks",
          "created": 1633905434,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg4jhiu": {
      "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg4jhiu/",
      "text": "Form a study group with classmates who meet once or twice a week and do the hw/exam review /etc. obviously you’ll still have to watch and understand the lectures but it should help a lot for getting a deeper understanding",
      "author": "harry01772",
      "created": 1633887018,
      "upvotes": 6,
      "replies": {}
    },
    "hg4is0r": {
      "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg4is0r/",
      "text": "Recognize that this is college and listening to lectures is part of it. Go to your student support office and ask them for study skills. Read the material first so that you have an idea of what the lecture is about. Or say that college simply isn't for you. There's no shame in that either.",
      "author": "whiskeyandtaxes",
      "created": 1633886729,
      "upvotes": 5,
      "replies": {
        "hg5s1r0": {
          "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg5s1r0/",
          "text": "well i'm doing pretty good, i'm in my 3rd semester and currently have a 3.7 GPA. i just struggle with keeping my attention during lectures, i was asking for tips to increase focus during classes. it’s even more challenging bc they are online for the time being.",
          "author": "tiramisuandbooks",
          "created": 1633905614,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg5f5qb": {
      "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg5f5qb/",
      "text": "Does your lecturer allow laptops? You can find a group of study buddies and take notes together during lecture on a shared document like google docs. That way you can also ask each other questions. And if you ever have to miss class you know you have people to count on. Of course, if you get easily distracted then this might not be the best method.",
      "author": "coconut_limes",
      "created": 1633899951,
      "upvotes": 2,
      "replies": {
        "hg5s6t5": {
          "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg5s6t5/",
          "text": "well in my college all the lectures are online bc of the pandemic so yes laptops are allowed! thank you for your advice :)",
          "author": "tiramisuandbooks",
          "created": 1633905679,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg63512": {
      "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg63512/",
      "text": "People learn in different ways. Some people absorb everything in a lecture and can recall it. Some people can get what they need from the texts. Some people get it from the discussion groups. You're asking how to get better at something you're bad at and there's no problem with working to shore up any weaknesses but you can also spend time figuring out how to get the most out of your strengths. You're good at small groups, find or form a study group for your classes. Meet with your professors during office hours, tell them that while you will be attending them, lectures aren't your best thing and see if you meet them every week or two for a very quick overview of areas from the lectures to focus on. Getting better at learning from lectures is fine but your need to understand things won't go away while you're doing that.",
      "author": "LandoSyztem",
      "created": 1633910761,
      "upvotes": 2,
      "replies": {}
    },
    "hg4dgw9": {
      "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg4dgw9/",
      "text": "[removed]",
      "author": null,
      "created": 1633884463,
      "upvotes": 1,
      "replies": {}
    },
    "hg4f6gk": {
      "link": "/r/college/comments/q5bq4h/i_hate_lectures_help/hg4f6gk/",
      "text": "[removed]",
      "author": null,
      "created": 1633885212,
      "upvotes": 1,
      "replies": {}
    }
  }
}