{"sid": "pvldm4", "link": "/r/college/comments/pvldm4/i_think_my_professor_has_gone_mia_in_online_class/", "title:": "I think my professor has gone MIA in online class and I need advice on what to do", "text": "I go to this one college who is known in my area for offering pretty good online classes. I decided to do them this semester (my first one). The other classes have been good but I'm having issues with my English class/professor. Started out fine. Teacher took a day or two to respond but that is normal. However, things took a bit of a turn recently. Last week she didn't post something we needed for an assignment. It seems like an email I sent her prompted her to send it out. We were also supposed to use our digital textbook for that assignment. It wasn't available/unlocked then but is now. \n\nThis Tuesday she didn't respond to an email I had about some upcoming assignments. That I can kinda understand it comes with the territory. Except she didn't even post an entire assignment. It just isn't there.\n\nShe was supposed to post questions that we would respond to. That due date came and went and it wasn't there. It was Wednesday so you would think she should have noticed by now. I asked other students and it isn't a me problem. It seems like none of us could do it. I have another assignment due tomorrow and one of the things I am supposed to analyses isn't there. Sadly what she wrote about it is too vague to find anything. I tried looking and I was left with a lot of options. So if she doesn't suddenly respond I'll have to submit it without that part.\n\nI ranted to my mother about this entire situation and she thinks she might have been fired. I think and I hope we would have been notified if that was the case. The best guess I have is from her last email. She said she was probably going to be grading our papers until today (Saturday). But I don't think (and I again hope) that it wouldn't cause her to not post an assignment. \n\nI need advice on what to do. This is my first semester so this could be normal at least for online classes. Should I just continue waiting? I can understand teachers not responding. But she didn't post an entire assignment. That is what is concerning me the most. I'll also have to submit something that isn't done. Should I get in contact with someone Monday? If so, what should I even say? I don't want to get on any faculty member's bad side. But at the same time I'm paying for this.", "author": "RotomeB", "created": 1632624904, "retrieved": 1632800293, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hecrtqe": {"link": "/r/college/comments/pvldm4/i_think_my_professor_has_gone_mia_in_online_class/hecrtqe/", "text": "You should send a polite message to the Dept chair.\n\nExplain that assignments have been posted late, that feedback or postings necessary for the next assignment have not been forthcoming a that the professor is not responding to emails. - Or whatever the specific problems are.\n\nProvided that this is not a single human error and you aren't emailing about things clearly answered in the syllabus (which I don't think is the case here) you have a right to the course materials and a reasonably well run class, online or no.", "author": "TheRightSideOfDumb", "created": 1632669124, "upvotes": 1}, "hebk4ya": {"link": "/r/college/comments/pvldm4/i_think_my_professor_has_gone_mia_in_online_class/hebk4ya/", "text": "One proactive thing you can do is contact the department chair and say that the professor not providing instructional materials on time. A chair has clout with instructors that individual students do not have. \n\nAnother poster talks about how long it takes to get graded material back, but that is different. Professors often do have a heavy workload and do not grade quickly, but all the material needed for each week should be there. These are two different functions, and it sounds as though your professor is in need of a reminder about her obligations.", "author": "SilverRiot", "created": 1632641116, "upvotes": 1}, "heaytps": {"link": "/r/college/comments/pvldm4/i_think_my_professor_has_gone_mia_in_online_class/heaytps/", "text": "Don’t stress. She’ll post it when she posts it. I’ve had a few profs like this. One of my profs this semester said they’d grade our work two weeks ago and we haven’t heard from them since. It happens. Prof’s have lives too.", "author": "Crochitting", "created": 1632627693, "upvotes": 2}}}