{
  "sid": "q1loo8",
  "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/",
  "title:": "Is dropping out of college a wasted opportunity?",
  "text": "I'm a Freshman at a well-known university in the U.S. I'm extremely grateful for the opportunity to attend here on what is basically a full ride. That being said, I think attending this school has definitely made me regret other opportunities that I could have taken when deciding what to do post-high school. Everyone at this school is practically a genius and I feel like I can't keep up with the workload without sacrificing my mental health. I failed my first Chemistry Midterm with a 52% and all my other classmates are complaining about their above 80 percent grades. I'm making my best effort to study but It's difficult to learn how to study effectively. Additionally, it doesn't help that the school culture here is so focused on studying 24/7, this makes me feel inclined to study all the time, but even the thought of studying makes me wanna put off this difficult task even more. \n\nEver since I've arrived here in August I've made very few friends. Although I've met a few people, I have little connection with them and it seems like most only brag about their accomplishments or the difficulty of the classes they're taking. I have thought about joining clubs, but with the stress of classes already on my shoulders, I don't think joining any is the best choice for me right now. \n\nI'm glad to be at the university as a first-generation student in order to make my parents proud, but I feel miserable here and was considering dropping out or transferring into a trade school or local university where I live. (Or taking a gap year). Considering the cost, I don't think it will be too much of a difference when dropping out. However, I will lose the opportunity to study at a great university with little to no debt. \n\nEvery day seems like I'm destined to fail here and I feel no motivation to do better. I'm only at this college to survive and hopefully get a piece of paper that allows me to be somewhat employable. Ever since I've been here, I've felt little joy and wish I should have thought about this college thing more carefully instead of being focused on what would please my parents. I want to tell them, but I have a feeling they'll say dropping out will be a wasted opportunity due to my lack of motivation. Has anyone felt similar or dealt with these thoughts before?",
  "author": "Getanadult",
  "created": 1633401885,
  "updated": 1637389617,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hfg1eve": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfg1eve/",
      "text": "Many people on here would disagree, but I would recommend sticking with it and giving it a solid shot before giving up what appears to be a full ride scholarship.  If you don’t like it after two semesters, then I would consider dropping out or transferring.  I promise everyone is in the same boat as you; I know I was my freshman year.  You don’t have to study 24/7 to be successful, but college will test your boundaries with time management. I know it’s hard now, but try to look ahead and ask yourself if your decision will get you where you want to be.\n\nI wish all the best for you!",
      "author": "Confident_Shine5797",
      "created": 1633409393,
      "upvotes": 17,
      "replies": {
        "hfjav9f": {
          "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfjav9f/",
          "text": "I'll definitely try my hardest to survive until the rest of the year! thanks for the advice :)",
          "author": "Getanadult",
          "created": 1633473407,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hffp2ud": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffp2ud/",
      "text": "As someone who made themselves miserable and went to college to make my parents happy I would take the leap and take a gap year if u really feel you need it you might find what u love to do and it can be done as a trade I wish I would have taken one at 18 and my mental health and college career would have been much smoother and i ended up taking one anyway my junior year",
      "author": "Silver_Least",
      "created": 1633402239,
      "upvotes": 6,
      "replies": {
        "hffql84": {
          "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffql84/",
          "text": "I'm definitely open to the idea of taking a gap year if college or trade school isn't for me. However, I feel like it would be hard to let my parents let me take one due to previous events that involved my brother and him not going back to school after taking one. I guess I'd have to find a really good reason to take a gap year.",
          "author": "Getanadult",
          "created": 1633403033,
          "upvotes": 2,
          "replies": {
            "hffr8fn": {
              "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffr8fn/",
              "text": "Just remind them your not your brother your you and your life is yours I had to tell myself at the end of the day no ones sitting in the classes and doing the work but you and until they are the ones that are doing it day in and day out then accept and respect their input and how they feel but make the best choice for you theyll be upset but my parents saw how much happier i was doing online school from home and were excited for me🙂",
              "author": "Silver_Least",
              "created": 1633403376,
              "upvotes": 4,
              "replies": {
                "hfft1wr": {
                  "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfft1wr/",
                  "text": "I'll definitely mention that If I ever decide to talk to them about it. Thank you! :)",
                  "author": "Getanadult",
                  "created": 1633404355,
                  "upvotes": 2,
                  "replies": {
                    "hfft5ga": {
                      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfft5ga/",
                      "text": "No problem good luck!",
                      "author": "Silver_Least",
                      "created": 1633404408,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfixea5": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfixea5/",
      "text": "Don’t throw away a full-ride scholarship just because college is hard. College is always hard, but it’s worth it. If you don’t like what you’re studying, consider changing majors. Go to office hours, tutoring, the counseling center. Drop a class if you need to. You will make it through.",
      "author": "BikeBonanza",
      "created": 1633467354,
      "upvotes": 6,
      "replies": {}
    },
    "hfhiqcy": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfhiqcy/",
      "text": "You have a full ride, I stopped reading right at that point. Yes it is ABSOLUTELY a wasted opportunity.",
      "author": "dromance",
      "created": 1633446288,
      "upvotes": 4,
      "replies": {}
    },
    "hffpnsd": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffpnsd/",
      "text": "Ok wait are we at the same school? Maybe a very large research uni in one of the first cities in the US..? Lol. But if we are, I feel the same exact way as you. Here, I feel extremely lonely and have barely connected with anyone. It doesn’t help that I feel like the school admin just didn’t give us anything and was like figure it out. I barely even processed that I’m legit in college because it feels like we’re just here and then people form their own communities like its not one school. Idk if you feel this or even are at the same place haha but just wanted to give my input. Nvm you’re not at my uni. But best of luck to you! To quell any inner feelings as I saw your decision was tough, your other top choice fosters a very similar environment!",
      "author": "Jacksol03",
      "created": 1633402546,
      "upvotes": 3,
      "replies": {
        "hffqsnn": {
          "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffqsnn/",
          "text": "Close lol. It's reassuring other people feel the same way. I'm hoping everything works out for you! :)",
          "author": "Getanadult",
          "created": 1633403141,
          "upvotes": 3,
          "replies": {
            "hffre4l": {
              "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffre4l/",
              "text": "To you as well! To reiterate advice I am definitely not listening to: give it time and allow yourself to adjust. College is a huge change and the first semester is hell for everyone going through it. Although trust me, everyday I’m eyeing transfer statistics. We’ll make it through!",
              "author": "Jacksol03",
              "created": 1633403463,
              "upvotes": 2,
              "replies": {
                "hfftd3y": {
                  "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfftd3y/",
                  "text": "I'm definitely trying to complete a full year here before deciding on a final decision. Like you said the first semester is hell, but maybe the second semester won't be as rough as it is now. I'm just taking things one day at a time. Thanks for the advice!",
                  "author": "Getanadult",
                  "created": 1633404527,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hffpqq6": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffpqq6/",
      "text": "It can be tough. Most beginnings are. I can’t advise in regard to switching school. Only you know. \n\nHowever on the social front, why do you think that other, less known school will be better for you? You may switch and only then realize it’s not necessary better. A few things are at play: the subject you study, the size and structure of the school and most importantly - your attitude and personality. \n\nSmall liberal arts schools may be better, but that may lead to other difficulties after graduation.",
      "author": "mikeber55",
      "created": 1633402588,
      "upvotes": 3,
      "replies": {
        "hffseth": {
          "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffseth/",
          "text": "Definitely agree with the fact that transferring schools may not solve all my problems. What I want to avoid is dragging my problems along with me. However, I think switching to a local college may offer me to be in a less stressful/over competitive environment than I am in right now. I'm not saying the college I transfer to will be easier than the one I'm in now, but it will be a lot more manageable in terms of my mental health and the right amount of academic challenge. However, I'm judging a lot of these assumptions based on friends currently at that school. I would like to shadow or take a tour of what the campus culture is like before transferring. I think that was one of the mistakes I made when initially deciding on my college. I'm only attending my current school because they offered me the most money and I wanted the prestigious title (Which reflecting back seems really shallow.) Thank you for the comment!",
          "author": "Getanadult",
          "created": 1633404010,
          "upvotes": 1,
          "replies": {
            "hfft70y": {
              "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfft70y/",
              "text": "Wishing you all the best. Studying engineering, medicine, sciences or accounting can be very stressful. One aspect you can control is how many classes you’re taking. Maybe you loaded yourself with more than you can manage. Having a less stressful schedule can help at any school.",
              "author": "mikeber55",
              "created": 1633404433,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hffx66x": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hffx66x/",
      "text": "Tutoring center or success center is where a lot of schools hide their free resources. A club or two will likely give you the mental health break you need.",
      "author": "CindsSurprise",
      "created": 1633406676,
      "upvotes": 2,
      "replies": {}
    },
    "hfg9vj1": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfg9vj1/",
      "text": "what would you do during your gap year ? and would you still get a free ride after your gap year ? honestly mental health is important but you should also have a more solid plan ? Or get one less class to get more time …",
      "author": "RefrigeratorDear2641",
      "created": 1633415747,
      "upvotes": 2,
      "replies": {
        "hfjc56u": {
          "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfjc56u/",
          "text": "If I do end up taking a gap year my plan of action would be either take the year to find a new college or trade school to transfer into or find a skill that I want to pursue a career in. In terms of transferring schools, the local university in my home state is relatively affordable and I know a couple of people who've attended there, so I'm aware a bit of what the general campus culture is like there. If I go the trade school option I'd probably go down the HVAC or Mechanic route. I have a general outline of what I want to do, but I definitely need to work out the details. \n\nIn terms of trying to take an easier workload at my current school, the add/drop period is over. I can't drop or add any more courses in order to be considered a full-time student.",
          "author": "Getanadult",
          "created": 1633474006,
          "upvotes": 2,
          "replies": {
            "hfk4jmm": {
              "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfk4jmm/",
              "text": "hmm honestly doesn’t sound like a solid plan ? you should look into internships/shadowing to find out what you want to do? and switching schools might not help, mostly sounds like you feel dumb since the people around you are smart ? if you go to a better/higher college then obviously the expectations will rise, if you go to a lower/worse  college then you will have lower expectations. sounds like you want low expectations so then you can meet them easily.",
              "author": "RefrigeratorDear2641",
              "created": 1633488031,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfgf7eo": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfgf7eo/",
      "text": "These kind of thoughts are not uncommon.  My advice is to give it at least one full year.  See how things go until then.\n\nMany students did very well in high school and then find that they are just average or below in college. That is to be expected, because you are competing against the best of the best.  \n\nMaybe you are in the wrong major, maybe you need to find a social group or join some clubs, etc.",
      "author": "time2trouble",
      "created": 1633420602,
      "upvotes": 2,
      "replies": {
        "hfjdgeo": {
          "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfjdgeo/",
          "text": "I'm currently an undecided major at my school and trying to complete some general requirement classes in order to be prepared for whatever major I end up choosing. I would like to pick up a club, but to be completely honest I feel weak and tired by the end of the day and I can't see myself committing to a club without focusing on my classes first. I definitely feel socially deprived here, but I figured it's better that I focus on my classes first.",
          "author": "Getanadult",
          "created": 1633474619,
          "upvotes": 1,
          "replies": {
            "hfk5y7l": {
              "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfk5y7l/",
              "text": "Don't necessarily think of a club as a commitment.  Most clubs let you participate as much or little as you choose.",
              "author": "time2trouble",
              "created": 1633488748,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfft8y9": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hfft8y9/",
      "text": "It might be. Whatever your decision, youll turn out fine and you will manage.\n\nI took a gap year and worked, learned how to financially support myself and get through college. \n\nIt will mess up your scholarships though\n\nFigure out what you want to do first. Once you have that, studying will become easy. Find that passion and learn. Try to get into it.",
      "author": "guy_with-thumbs",
      "created": 1633404462,
      "upvotes": 1,
      "replies": {}
    },
    "hl68azn": {
      "link": "/r/college/comments/q1loo8/is_dropping_out_of_college_a_wasted_opportunity/hl68azn/",
      "text": "I would definitely try to stick it out. Find a community you can feel lax in. I hope things are better for you at this point!",
      "author": "WinterUnvrsity",
      "created": 1637271164,
      "upvotes": 1,
      "replies": {}
    }
  }
}