{"sid": "lgxldf", "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/", "title:": "Does anyone else struggle with the lack of feedback in online learning?", "text": "This isn’t another “hate on online learning post”, but i see it as more of a reminder that feedback in person is good. \n\nIn person, your teachers remind you that your quiz is coming up, you should be about done with your project, etc. \n\nWith online learning, i get none of that interaction so it’s all on me to navigate the syllabus and hope I’m doing everything correctly\n\nI had a dream last night that i forgot i was taking another class and i was missing deadlines. So, my fear is that i am missing deadlines when there are no reminders and no one with whom i can discuss the content", "author": "cualiysht", "created": 1612975170, "retrieved": 1632947413, "over_18": false, "upvotes": 946, "upvote_ratio": 0.99, "comments": {"gmx0hf8": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmx0hf8/", "text": "I missed a quiz 3 days ago because I completely forgot it existed and thought I was scot-free to play one of my games. Only found out today when I got a notification of the ZERO I got on it. So yes, I completely agree with you. That is my only completely online class and I’m always forgetting about it, ngl. It’s the first time I’ve had a class like that AND it’s a subject I don’t enjoy, so I relate to ya.", "author": "KitKatVi7", "created": 1613030024, "upvotes": 1}, "gmwsfhy": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwsfhy/", "text": "Every Monday I sit down and go to my schools online platform and I write down on a piece of paper M-F and then click on each class and see exactly what is due on which day. Then I write it down and when I wanna work on it and I go through all my classes doing the same. Then for the rest of the week I wake up and look at my sheet of paper and know what has to get done :)", "author": "Mech_Bean", "created": 1613023430, "upvotes": 3}, "gmwru8o": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwru8o/", "text": "Constructive feedback is essential in learning. Follow the link below for tutoring assistance. https://discord.gg/K77FVjEE", "author": "MerolineB", "created": 1613023002, "upvotes": 1}, "gmwpbap": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwpbap/", "text": "Most of mine have been posting announcements reminding us what assignments and tests are coming up. I’ve found that super helpful! I also try to put all assignment due dates and test dates on my Google Calendar when we get the syllabus so I can refer back to it throughout the semester.", "author": "Songibal", "created": 1613021285, "upvotes": 1}, "gmwjov3": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwjov3/", "text": "Omg I keep having that same dream too!!!! And that I’m about to graduate but suddenly I remember I forgot about that class so I failed the class and can’t graduate. Sooo stressful then I wake up and I realize it’s not real lol", "author": "Mkgrigsby29", "created": 1613017763, "upvotes": 1}, "gmwi73a": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwi73a/", "text": "Sometimes but, I supplement lack of communication with zoom calls", "author": null, "created": 1613016892, "upvotes": 1}, "gmwhs70": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwhs70/", "text": "As someone who was cyber schooled since third grade, I can say this transition into online learning has been a mess even for me. I just started college this past fall and watching professors who have no idea how to teach online has been frustrating. Of course I don’t hold it against them because they weren’t thrown into this willingly, but I’m just so used to online learning and teachers who have been teaching online for living for years. I guess at least I was prepared?", "author": "falafelbug", "created": 1613016653, "upvotes": 2}, "gmwdjf4": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwdjf4/", "text": "Nope, my professors are great. We do housekeeping in the beginning of every class. Maybe talk to your professors about how you would like more feedback during class. Hope it all works out for you.", "author": "Alternativefacts23", "created": 1613014335, "upvotes": 1}, "gmw188r": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmw188r/", "text": "I still have the dream and I have not been in college for like 20 years\n\nGo to office hours and get more feedback.\n\nAnd I dont want to be mean, but you should be able to transition to keeping all your stuff straight without people constantly reminding you.\n\nGet a planner.  Not a google calendar but a planner.  So you dont only put in the due dates, but also block out time to do the things.  One of the things in my planner is to do over everything on Monday morning and make sure all my dates are right and everything is in my planner.\n\nSounds old school but believe me it works and it is such a stress relief.", "author": "PersephoneIsNotHome", "created": 1613008077, "upvotes": 4}, "gmw0dvr": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmw0dvr/", "text": "My English prof is damn amazing at this. Of course, he's a bit of a boomer, so some of the emails are a tad unnecessary, but I highly value his updates. I just got my first writing assignment back from him, and he recorded a 15 minute podcast-type feedback for me! I just hate the inconsistencies between teachers. Like, my chem prof (also a boomer) doesn't update his students at all outside of class.", "author": "ezw_", "created": 1613007657, "upvotes": 1}, "gmvrfko": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvrfko/", "text": "No", "author": "TigerBalmES", "created": 1613003211, "upvotes": 2}, "gmvjkt3": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvjkt3/", "text": "I made a google sheet that I update every week with my assignments, their due date, and the priority on a scale of 1-5 and then add conditional formatting to give it a visual presentation of my workload. Let me know if you want the file and I can share it! It saves my life pretty much daily.", "author": "infjetson", "created": 1612999284, "upvotes": 8}, "gmvjjv3": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvjjv3/", "text": "Same here", "author": "ccambelle", "created": 1612999272, "upvotes": 2}, "gmvhnj0": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvhnj0/", "text": "OMG I HAD THAT DREAM TOO!!! I HAD A DREAM I WAS 6 WEEKS BEHIND IN A MATH CLASS IM NOT TAKING!!", "author": "spazbagz", "created": 1612998350, "upvotes": 3}, "gmvf3uw": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvf3uw/", "text": "Lol I had the same dream two nights ago", "author": "pokemongofanboy", "created": 1612997175, "upvotes": 2}, "gmvaugh": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvaugh/", "text": "In one of my classes the instructor posts a weekly checklist. It’s incredibly helpful", "author": "Emmias", "created": 1612995241, "upvotes": 2}, "gmv9g7s": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv9g7s/", "text": "I feel so bad for you dude. My school has a thing called Canvas, where they put assignments online. You can interact with classmates, look at and submit assignments, attend lectures, online tutoring. I suggest you mention that to a school official.  I’m a returning student after ten years away. So, I’ve been lucky in that I’m not used to classroom learning. I’m actually finding less distractions learning from home and can communicate effectively with my teachers. I think you should email your teacher and let them know your concerns. Good luck to you! I know it’s not easy for everyone who is used to a classroom environment.", "author": "dawn-of-pickles", "created": 1612994619, "upvotes": 4}, "gmv5d2q": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv5d2q/", "text": "Yeah. My major is big on 'networking', and I was hoping to meet friends and all that- joined the Habitat for Humanity Club, environment Club, Newspaper Club, tried reaching out to profs and classmates, didn't workout.\n\nJust no one really wants to interact in general now, and especially asynchronous classes where the most you get is a blog post", "author": "neverfakemaplesyrup", "created": 1612992859, "upvotes": 2}, "gmv5a6y": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv5a6y/", "text": "Dude I have that dream all the time! Like I signed up for a class I totally forgot about until halfway thru the semester!", "author": "scubasam27", "created": 1612992823, "upvotes": 4}, "gmv523o": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv523o/", "text": "This is the ONE thing I dislike about online learning. \n\nI have taken classes online for the last... 6 years of my life? I LOVE IT. I love the free time. I love having my life, time to myself, time to spend in VR rather than in the real world.. \n\nBut. A lack of feedback is bad. It prevents learning. I almost never bother to type out an entire question to a teacher. Just not worth it.", "author": "ethancknight", "created": 1612992728, "upvotes": 3}, "gmv14ua": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv14ua/", "text": "I’m currently taking an online creative writing class. I’ve turned in tons of pieces, and have received little to no feedback. It’s a little upsetting.", "author": "noble-light", "created": 1612991056, "upvotes": 3}, "gmv0ddp": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv0ddp/", "text": "are you able to contact/email your professors? all my professors are accessible by email, phone and our online system and i’ve found it to be very helpful. sure it’s more work but it works!", "author": "xjulesx21", "created": 1612990739, "upvotes": 4}, "gmuz14z": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmuz14z/", "text": "Imo this isn't even an online issue. Teachers should be reminding and sending out emails whether they're in person or not.", "author": "bearbarebere", "created": 1612990178, "upvotes": -5}, "gmuwqoh": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmuwqoh/", "text": "It’s 100 times worse for me because I am a very forgetful person", "author": "QuickCoyote097", "created": 1612989185, "upvotes": 0}, "gmus4vi": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmus4vi/", "text": "I have one professor who assigns all her readings and weekly assignments at the beginning of the semester and then doesn't teach or grade anything until the last week of classes. And this is the second time I've had her- it's infuriating.", "author": "SnowOverRain", "created": 1612987224, "upvotes": 4}, "gmupgfl": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmupgfl/", "text": "Professor's perspective: we were being told in the spring and fall that students were being bombarded with Canvas notifications and the like, and that we should be sparing about how much we send out reminders and information to the whole class (and instead create well-organized Canvas pages where students don't have trouble finding this info themselves). Whether that's really true, I don't know. I continue to send out reminder announcements 2x/week for my smaller classes, but I've tried to avoid it in larger ones.", "author": "Frequent_Yam_6711", "created": 1612986089, "upvotes": 32}, "gmunzgp": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmunzgp/", "text": "Agreed. I've missed so many assignments these last 2 semesters from pure confusion or oblivion to when they're due, and I've also missed many important statements from professors on assignment requirements. I'm diagnosed with severe ADHD and I'm extremely scatterbrained. The reminders you mentioned come naturally when taking in person classes, and now they're just nonexistent. I relied so heavily on them and not having them has been extremely detrimental to my academic performance.  \n\nIt also doesn't help that professors are using a million different websites for assignments, homework, and tests. They all organize their Canvas pages differently. Last night it literally took me half an hour to \"find\" all my assignments for the week and write them down in my planner. I hate it.", "author": "tacothetacotaco", "created": 1612985467, "upvotes": 22}, "gmug5ey": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmug5ey/", "text": "Go through your syllabus and put everything in your calendar. Set reminders on your phone.", "author": "DrSameJeans", "created": 1612982188, "upvotes": 52}, "gmu8bff": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu8bff/", "text": "I think that professors should do a \"weekly reminder\" post where they record themselves giving a reminder of what is due and what they will be working on. I hate how teachers say they miss teaching in person but yet they make no strive to do anything through online learning. Just a thought I've given a few professors. One actually went along with it!", "author": "Equal-Building4177", "created": 1612978947, "upvotes": 19}, "gmu6jb9": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu6jb9/", "text": "My professors have been trying to combat this by consistently emailing us updates about classes. It’s been super helpful thus far!", "author": "nonconformistnugget", "created": 1612978205, "upvotes": 160}, "gmu2pft": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu2pft/", "text": "This is why I prefer teaching synchronously.  My students seem to have a better time keeping up with their work...", "author": null, "created": 1612976571, "upvotes": 175}, "gmu2aah": {"link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu2aah/", "text": "I sometimes struggle with lack of feedback as a Computer Science major. I guess it forces me to find creative solutions and look online. Silver linings I guess. I have no problems with due dates though because the Canvas dashboard has all upcoming due dates conveniently organized.", "author": "Serious_Place7216", "created": 1612976391, "upvotes": 5}}}