{
  "sid": "qnpk07",
  "link": "/r/college/comments/qnpk07/failing_a_class_im_not_supposed_to_be_in/",
  "title:": "Failing a class I'm not supposed to be in",
  "text": "Hi, so somehow I ended up in a high-level math course in my freshman year of college. I have yet to take the two prerequisites to get into this course but was still able to enroll. I took this course because the other courses I needed were filled and I was in a hurry to get these math classes out of the way as I'm not too interested in them ( also I was way over my head ).  I am currently on the verge of failing depending on how my next exam goes. Assuming the worst, is there anything I could do to mitigate the damage this has on my academic record and financial aid.",
  "author": "M0oseGoose",
  "created": 1636161601,
  "updated": 1636655889,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hjhvogk": {
      "link": "/r/college/comments/qnpk07/failing_a_class_im_not_supposed_to_be_in/hjhvogk/",
      "text": " Can you still withdraw? I’d rather that be on my record than a failing grade",
      "author": "LCHolland82700",
      "created": 1636162430,
      "upvotes": 6,
      "replies": {}
    },
    "hjhvnaa": {
      "link": "/r/college/comments/qnpk07/failing_a_class_im_not_supposed_to_be_in/hjhvnaa/",
      "text": "The only thing you can do is withdraw from the class. Unfortunately though its pretty likely that the window to withdraw has passed if youre in a august-december semester. Aside from that, just do your best, devote more time to that class, get a tutor, attend office hours, etc.",
      "author": "taybay462",
      "created": 1636162415,
      "upvotes": 2,
      "replies": {}
    },
    "hjhx0bb": {
      "link": "/r/college/comments/qnpk07/failing_a_class_im_not_supposed_to_be_in/hjhx0bb/",
      "text": "Aight dude. Steps, tried and true from a 2020 grad when shit like this gets screwed up.\n\n1. Email professor & advisor. Say you're in way over your head, and that you haven't taken any of the prerequisites for the class. You'd hoped you be able to get through it since the others were full and somehow the registration system let you sign up. Also say you're sending this to them and calling/going into the registrar's office.\n2. Call or go to the registrar's office. Yes, it's important that you talk to a real human, and that it be over the phone/in person. Record conversation if legal. Tell them what you said in your email to prof/advisor. POLITELY, tell them that since the system let you sign up that you though you were able to take the class safely, but it's way worse than you realized. Ask them what the steps are to get the class turned into a W on your transcript. They can do this even if you're past the withdraw period and you'd now get a WF. If you're really tactful (and depending on school) they might even erase the W altogether.\n3. if they won't do that and your school allows you to use pass/fails every so often on a course, I suggest asking if they would make an exception and let you do it retroactively. This wont save you AS much, but usually pass/fail won't affect your GPA. Tell prof and advisor you did this, and why. Ask professor what you can do to try and get a pass.\n4. Depending on what they say to the two options, if it's not satisfactory, wait for prof and/or advisor reply, tell them what registrar said and ask for their help figuring out a solution. Hopefully they will have on. Make sure to mention you're worried about financial aid.\n\nSide note - one W or even WF your freshman year should not affect job stuff when you graduate, especially since you have a decent explanation for why, with this whole mess up. Same for pass/fail, and this is all for if they even ask. Most jobs won't care about one little thing on your transcript, especially if you work it around to not affect GPA.\n\nI am so sorry this is happening to you, I hope you can figure it out. Feel free to reply/DM me if you need help or advice as you try and figure this out <3",
      "author": "catsnothats",
      "created": 1636163047,
      "upvotes": 2,
      "replies": {
        "hjhygu6": {
          "link": "/r/college/comments/qnpk07/failing_a_class_im_not_supposed_to_be_in/hjhygu6/",
          "text": "Dude thank you so much, I've been stressing all week haha.  Really appreciate you taking the time to write all this out for me!",
          "author": "M0oseGoose",
          "created": 1636163719,
          "upvotes": 1,
          "replies": {
            "hjhznhh": {
              "link": "/r/college/comments/qnpk07/failing_a_class_im_not_supposed_to_be_in/hjhznhh/",
              "text": "Of course!! You'll get through it and figure it out. Whatever happens, don't let the worry eclipse everything. Do your best, put energy towards getting it fixed but past a certain point stressing about it will only affect your health and other classes. Let me know how it goes?",
              "author": "catsnothats",
              "created": 1636164273,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}