{"sid": "kqx5hb", "link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/", "title:": "Am I a little bitch for not wanting to work during college?", "text": "Because of a great scholarship + living with my parents I have virtually no expenses.I have been working over the break, and I know that I could fit work into my school schedule, but to be honest, I just don't want to. I know this might frustrate some people and sound privileged. I don't mean to brag or something like that.I just feel like it is irrational to work during the school year *if I don't have to.*\n\nLet me know what you think.\n\nEdit: I don't mean not taking internships, etc. I mean working a job exclusively for money. Part of my justification for not working is that it will enable me to pursue internships, shadowing, etc. much more effectively than if I had work + school + everything else. So, for those who would argue that it's necessary to \"work\" (internships, jobs in your field) if you want a good job post graduation, I agree. That's a big part of why I don't want to \"work\" (jobs that are just for $ and don't relate to my future career).\n\n&#x200B;\n\nEdit2: For anyone interested, my plan is to stop working as soon as winter break is over and using the free time for extra growth. By this I mean reading up on career, putting more effort into school, looking for internships, enjoying life, etc. If I still have time outside of school + extra growth, I might consider tutoring or finding some sort of flexible gig that doesn't take up as much energy as most jobs.  \nI have read almost every comment, and I genuinely appreciate everyone replying. I am very surprised that it's 99% positive and not just people accusing me of bragging about not having to work or something. ", "author": "daltonpain", "created": 1609848089, "retrieved": 1632802049, "over_18": false, "upvotes": 1262, "upvote_ratio": 0.97, "comments": {"gichqpj": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gichqpj/", "text": "My Mom legit doesn't want me to work this semester", "author": "AlexandraThePotato", "created": 1609967546, "upvotes": 1}, "gibjtbq": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gibjtbq/", "text": "I mean, you aren’t a little bitch, but I really do think not working at all and having zero work experience doesn’t help.\n\nI’m a computer science student and I did shitty IT work for 2 1/2 years during school, working tech support, then went to IT, then went to system admin.\n\nI just got a job that pays $23 an hour, which is 48k a year if I work full time. Would I be having this high paying job if I didn’t work? Hell no.\n\nI’m gonna graduate with 3 years of experience that is related to my major. I don’t know what your major is, but if you can find a job that’s related to your major, absolutely take it. \n\nI’d rather have a 2.5 gpa grad that has 1-2 years of experience related to the degree then a 4.0 grad with zero work experience at all. \n\nBut hey that’s just me.", "author": "MY_CUM_ON_UR_FACE", "created": 1609952708, "upvotes": 2}, "gib4rug": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gib4rug/", "text": "Well, it can be seen as wanting to take the easy road. If you want to take that road, some people will see you as weaker for it. But that shouldn't be the part that matters if you think it is right for you. Focusing on your schoolwork and getting excellent grades is sometimes more difficult with a job. \n\nI personally think working during school is a good way to save up some extra money just in case. Never know when you'll be strapped and need it. Sometimes it's better to be prepared; things can go south pretty quickly.", "author": "lullaby876", "created": 1609945644, "upvotes": 2}, "giacn15": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/giacn15/", "text": "Im so sorry our world is so toxic. So fed up with \"because i suffered so should you\", or \" i did it so can you\" mentality! Wtf happened to ACTUALLY making it better for the next generation? Why are we so hell bent on this? Hell you can't even be a stay at home mom and enjoy your kids! GOD FORBID! you are not a little bitch, thank your parents, congratulations on your scholarship, and focus on you and your school. Feel free to tell whoever says that to you fuck off and help change this world back to what it should be!", "author": "anonomousbluefox", "created": 1609924180, "upvotes": 2}, "gia4zd2": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gia4zd2/", "text": "I work during college and I'm having a hard time balancing school works, office work, and life. I am a clerical assistant and I am required to come to duty for four hours a day (school days) and 8 hours a day during break. The office works just exhaust me a lot that my mental health and school reports subtly suffer.\n I understand what you're trying to say that you do not want to work to  focus more on other stuff, I wish I can do that too. Goodluck on your next journey! Go for what you think is best for you, I hope everything will turn out great. I am sorry for ranting here 😅", "author": "adibidot0", "created": 1609917277, "upvotes": 2}, "gia31lu": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gia31lu/", "text": "I work full-time in healthcare. I would love to not work during college and just enjoy academics.", "author": "DammieIsAwesome", "created": 1609915743, "upvotes": 2}, "gia28iq": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gia28iq/", "text": "I am the same way! I tried having a job during school and my grades suffered tremendously. When I just focus on school and don’t work, I get straight A’s! So I’d say it’s worth it.\n\nFor example I’m taking 6 classes this semester, Monday-Friday and to me that is basically the equivalent of a full time job!\n\nI’d say there’s nothing wrong with that. Enjoy it while you can!", "author": "aworkinprogress98", "created": 1609915128, "upvotes": 2}, "gia24mf": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gia24mf/", "text": "I totally agree and support this if you are in a position to not have to work. Personally, I am in the same boat. I didn't work my freshman year (I am a sophomore now), and have been looking for a job this entire year but haven't gotten any leads from my applications and I feel kind of guilty for not working during college but honestly it is kind of nice not having to work and being in a position where I can just focus on school and grades. I model part time, so that gives me income for the most part, but other than that I am not working and I am glad that I have found someone else in the exact same boat. I felt kind of behind from my peers who do have jobs right now but seeing your post, I feel less that way and am glad I am not alone in my situation. I don't know if that makes sense, I guess I just feel less guilty for not wanting to go out and get a job if I am not alone in how I feel?", "author": "lilysavage1", "created": 1609915046, "upvotes": 2}, "gia1v45": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gia1v45/", "text": "Love hearing all the stories whos parents rent them an apartment on campus, get them a car, pay for their insurance, phone bill, internet. Buy all their books and supplies. And give them spending money. You're a full on adult right now. Everyone used to have to do what they had to do to go to and pay for college . Which meant working while schooling to pay school bills. \n\nNowadays parents pay for everything.  I'm curious in 10 years how this generation will be living\n \nAfter college will they be back at parents home living rent free until 3o years old?.\n\nAnyone who lives like this, just realize and be grateful that you have that opportunity cuz 75%+ of us depending on city/state/country don't have that option and have to work to get through school and buy ALL THEIR SUPPLIES.  A place to live, tuition, fees, books, groceries, clothes. Literally everything.\n\n  Anddd then we have you guys that have nothing to worry about . You go to class, do your homework and then every night go out on the town with your parents money and party and that's life. No structure other than class and homework. No independence. Yea you live alone but you aren't supporting yourself.  You may as well live with your parents.\n\nHey no hate, just be grateful for what you have. Like you can't even work 15 hours a week just to have some of your own spending money so yoyr parents don't have to pay you THAT ALSO? I'm sure they'd be proud and 15 hours a week is pitiful if that's too difficult. \n\nI commuted 4 hours a day to and from class 5 days a week. Took 18 credits. *Wrote my thesis on the side*. After class biked to and from work to work 25 hours, biked 15 miles total each day 5 days a week. 3 weekday and 2 weekend days. Plus finding the time to study, do homework and maintain relationships when the university recommends 3 hours of studying and work per credit per week.  So under their guidelines on top of work and school and commuting I should have been studying 54 hours a week ontop of that 🙄\n\nSo 54 hours of studying a week, few hours a day of writing my thesis, 25 hours of commuting, 45 miles of biking a qeek, 25 hours of work a week, and having some sort of social life or free time. So without the social life I was expected to do 105 hours a week of school/work/homework and almost 50 miles of biking. Along with the little social life I had.\n\nBreakdown per week\n\nClass 5 days a week, from 1010 am till 230 pm with a 2 hr break per day. (Had online classes too). Physical classes was *12.5* hours per week. 54 hours studying  can just be lumped in with my online classes for simplicity \n\n*54* hours studying \n\n*14* hours/week thesis\n\n*25* hours commuting \n\n45 miles biking a week at (each way was 7.5 miles so bout 45 min each way, 1.5 hr per day. (So *7.5* hours per week)\n\n*25* hours work per week\n\n*5-10* hrs social life per week \n\n\nTOTAL******\n\n130-145 hours a WEEK. Some of you don't have to work or buy anything and are taking 12 credits to get the minimum full time and just go to class, spend 10 hours a week on homework and the other 90% of your life is fun and games with your friends with your parents money. Personally I'd feel like a leech but we all have our own set of morals.\n\n\n\n\nAnd yall complain about working 10 or 15 hours when your parents have boughten you an apt right next to campus, you don't work, no biking 50 miles a week. You have. You literally have an extra probably 90 hours of freetime a week more than I did if not more.. And you can't work a little part time job. LOL\n\nGuess its just slightly annoying hearing these posts. These people don't understand how overly privileged they are. And they're definitely the ones with Prada or fendi bags and brand name 100$ shirts and 200$ jeans lmao. They're just easy as hell to spot in general. They just give off that \"i can and do do whatever i want to do because I have an endless wallet from *dadddddy*", "author": "Slanglie", "created": 1609914848, "upvotes": 1}, "gia03hc": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gia03hc/", "text": "[deleted]", "author": null, "created": 1609913568, "upvotes": -1}, "gi9xv7p": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9xv7p/", "text": "Prof here. If you have the ability to just focus on class, do it.", "author": "shadowcentaur", "created": 1609912084, "upvotes": 2}, "gi9tb32": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9tb32/", "text": "What u majoring in?", "author": "SuperiorT", "created": 1609909370, "upvotes": 1}, "gi9r424": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9r424/", "text": "Not at all!! Enjoy not working, enjoy school, enjoy life. I don’t think anyone should have to work and go to school at the same time (but obviously can if they want). If I didn’t have to work when I was in college, I wouldn’t have! It’s so sad we are conditioned to think that if we’re not earning money, we are wasting time. Like another redditor said, you’ve got the rest of your life to work so enjoy not working while you can! :)", "author": "lilbootyb", "created": 1609908184, "upvotes": 2}, "gi9qwjt": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9qwjt/", "text": "I got laid off because of the pandemic and I took the opportunity to enroll in college. I know I have to eventually go back to work but ugh, I don’t want to. I don’t know how people work and go to school at the same time. I was absolutely swamped with all the assignments I had to do, and I had little else going on. I don’t know how I’m going to be able to juggle school and work when the time comes.\n\nDon’t work if you don’t have to. Focus on your studies.  Enjoy your situation while it lasts, because it won’t be long until it comes to an end.", "author": "reinakun", "created": 1609908072, "upvotes": 2}, "gi9nnas": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9nnas/", "text": "I honestly dont think it's necessary for college students to work during semesters. It's only needed when you're lack of money or if you want income for yourself", "author": null, "created": 1609906347, "upvotes": 2}, "gi9nl8j": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9nl8j/", "text": "I was blessed enough to not have to work during college. I was able to take that time to do personal development activities. If I needed help, my parents were able to support me. Don't ever feel guilty for your situation. \n\nIf I did have to work during college and struggle to make ends meet, would I want to make sure that my kid did not have to do the same? Would I want my kid to work out of gaining experience rather than work out of pure necessity to pay for college? Of course. \n\nMy dad must have thought the same. He worked to build a life so that his kids did not have to go through the same struggle and hurt he went through. I don't know why we're given the circumstances that we have in life, but don't fret. If you feel your time could be better spent elsewhere rather than working during college, then do as you feel led. Maybe the universe needs your time spent in a particular way right now. It's okay.", "author": "Violet_Atlas", "created": 1609906319, "upvotes": 2}, "gi9mb2j": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9mb2j/", "text": "I work but I’m fortunate that the money I make isn’t going to just bills. I don’t have to pay rent or anything like that. I definitely feel privileged (I still have to pay for school :/) but if you’re able to go to school for free and focus all your time on it, why not? I was always told “If you’re gonna do something, do it right the first time” and this seems to be a great chance for you to focus on your dreams!", "author": "QueenLatifahClone", "created": 1609905663, "upvotes": 2}, "gi9lqpr": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9lqpr/", "text": "Your scholarship is your job. The work you put into a scholarship application, skills, and qualifications are the equivalent to a part time job. They're paying you for your job to now be a student. \n\nDon't work. People only glorify working in college because we envy those who don't have to \"struggle\" in their same sense. \n\nI'm assuming you already do this, but don't be an ass about not working in college and be mindful of those who may feel hurt they don't have the same lifestyle. Be mindful when talking to those who are working their way through college.\n\nAlso consider hosting a scholarship session or so to help out your friends or club members to also become part of the no work life.", "author": "BrokeCollegeKid2020", "created": 1609905372, "upvotes": 4}, "gi9le0k": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9le0k/", "text": "I think finding an awesome internship, even if it means working for free or nearly nothing, in your dream field is worth all your time and effort while in college. That will help you find a great job better than any entry-level, flexible-for-college job you might find.", "author": "hellonicoler", "created": 1609905190, "upvotes": 1}, "gi9k0v2": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9k0v2/", "text": "Same deal here. You have a lot of courage asking this question. Full respect.", "author": null, "created": 1609904496, "upvotes": 2}, "gi9jl5d": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9jl5d/", "text": "Not a bitch, but it may be harder to get a job with a gap on your resume. It may also be tough to get back to work emotionally, but I'm not you, and your not a bitch.", "author": "Dabadadada", "created": 1609904279, "upvotes": 2}, "gi9ewis": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9ewis/", "text": "No you're not. I think it's the smartest decision. I had a 3.8 gpa when I graduated high school, much of college was still easy for me. I really wanted to move out of my parents house since I couldn't stand them, so I got a full time minimum wage job and went to a community college full-time or part-time depending on what classes were available each semester that I wanted. It was stressful and I did ok for a while until I had to work long shifts 12-15 hours my bills went up and I needed a second job and worked another minimum wage job full-time, my classes got harder and I started to have car problems. I ended up losing both jobs and dropping out of college. Even though most of my classes were online, a few were a 45 minute drive away and with all the work I did, I didn't have the time or energy to devote to my school work. I know this is anecdotal and you may not experience the same problems I had, but it quickly escalated to be more than I could handle even though I was confident that I could because school was always easy for me. It was a hard time for me, I got really depressed and it's been a struggle to get back on my feet ever since. I felt like a failure for a long time and tried to think about where I went wrong over and over and I'm honestly still not sure that I actually did anything wrong or that I would've changed anything if I could do it over again. Sometimes shit happens (often actually) and it helps to deal with it if you don't have shitty jobs or having to worry about paying your bills and worrying about having a place to stay.", "author": "faloogaloog", "created": 1609901953, "upvotes": 2}, "gi9a7i9": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9a7i9/", "text": "Enjoy your time but also working just a lil is just more money in your pocket for the future when you aren’t in school anymore", "author": "Reggie2187", "created": 1609899670, "upvotes": 2}, "gi99stj": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi99stj/", "text": "If you don’t need to don’t! You’re not a bitch! Unless you start giving your friends grief because they have to work all weekend and do school during the week, then that’s being a bitch!", "author": "legallyderp23", "created": 1609899468, "upvotes": 2}, "gi97dwy": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi97dwy/", "text": "I work and I sure af would love to be in your position I'm drowning here.", "author": "DRsniper1991", "created": 1609898278, "upvotes": 2}, "gi96d2x": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi96d2x/", "text": "Nice blog post. None of us care.", "author": null, "created": 1609897775, "upvotes": 0}, "gi967v8": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi967v8/", "text": "Honestly, if you worked so hard for your scholarship you already worked in my opinion.", "author": "Spivyyy", "created": 1609897701, "upvotes": 2}, "gi95taw": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi95taw/", "text": "Nah dude it's your life, do what you want with it. If you have the means to postpone getting a job, do it, there's time for that later. Free time is valuable.", "author": "Jethzero", "created": 1609897497, "upvotes": 1}, "gi95p56": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi95p56/", "text": "Yes", "author": "BedMonster64", "created": 1609897438, "upvotes": 1}, "gi95ifk": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi95ifk/", "text": "I think you're doing fine. School can be extremely overwhelming and if you're privileged enough to be able to focus completely on school, then take advantage of it. I think because most people are economically disadvantaged and college is so expensive, people just have to work out of necessity. Don't burn yourself out trying to keep up with other people (as someone who worked 3 jobs at once while dealing with multiple health issues before going to school, it is not fun). Most people would love to be in your position. A lot of my friends who work jobs during the school year get super burnt out or have really accommodating bosses who respect the fact that they're in school. It is not all it is cracked up to be. Use the semester to explore other opportunities on campus like clubs and volunteer opportunities, then work in something related to your field on your breaks.", "author": "icyhot09", "created": 1609897344, "upvotes": 1}, "gi9590m": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi9590m/", "text": "No you are not. I am planning on quitting my job tomorrow for the same reasons being in a very similar situation, and I am planning to use the free time on school or finding internships/volunteering opportunities, or literally just sitting there and chilling, you will work from out of college for most of the rest of your life, if you don’t need to now then don’t.", "author": "notabiologist_37", "created": 1609897213, "upvotes": 1}, "gi94q0d": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi94q0d/", "text": "Nah bruh you cool. Reading up on them ancient scholars in my history class, it would seem cool to work minimally and devote my time to studies.", "author": "BurgerBoi19", "created": 1609896947, "upvotes": 1}, "gi942wy": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi942wy/", "text": "Nobody wants to work during college, they do it cause they need to. So no, you are not.", "author": "smartymarty1234", "created": 1609896619, "upvotes": 1}, "gi92pbs": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi92pbs/", "text": "You're doing the right thing! Studying is more valuable than working in something unrelated to your career.\n\nTrust me if you can afford it Education > work all day. trust me.", "author": "JonathanL73", "created": 1609895929, "upvotes": 1}, "gi912rc": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi912rc/", "text": "I went from working 36 hours/wk to not working (after several scholarships and grants), let me tell you, kids who don't work have it EASY. I know this might ruffle feathers. We're supposed to say \"college is a difficult journey for everyone\", but that's just flat out not true. School has been ridiculously easy since quitting my job. The advantage privileged students have on low-income students is absolutely ridiculous, almost immorally so. I cannot believe I suffered for as long as I did, when students around me had a full ride by virtue of generational wealth (I spent several years employed and in college, getting various certifications and degrees). Yall have it easy. Live it up and never take it for granted, but never ever forget that the people next to you are struggling because they're barely making ends meet. Know that half the kids around you are working harder than you and underperforming even still. Remember that life isn't fair and these people will need help from you, so be there for them.", "author": "ItsReallyVega", "created": 1609895111, "upvotes": 1}, "gi90vob": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi90vob/", "text": " Nope. I don’t work during the semester either. I prefer to have the time to study and relax rather than sacrificing the little bit of free time that I do have for work. Unless it’s financially necessary, I see no reason to work if you’re attending school full time.", "author": "spilltheroyaltea", "created": 1609895014, "upvotes": 2}, "gi90kma": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi90kma/", "text": "As an Indian I can tell you that \"working while in college\" seems to be a very western idea. In India, students aren't expected to work during college even if they're from a relatively poor background. Will there be exceptions? Sure, but do understand that not working during college doesn't make you a little bitch unless you want to shit on the culture of an entire country.", "author": null, "created": 1609894859, "upvotes": 2}, "gi90c97": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi90c97/", "text": "I feel the same way. My dad is a vet so me and all my siblings will get GI bill money, combined with scholarships and family employment discount each semester I have a net gain of money, but I still feel like I *should* be working, even though I don’t have to. Maybe if you want something to do, try volunteering for a little bit of time each week? It’s pretty fulfilling for me.", "author": "half-metal-scientist", "created": 1609894745, "upvotes": 2}, "gi8xepf": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8xepf/", "text": "I was also fortunate to not need to work at all and chose not to. And I did that with the plan that I would be able to help set up children of my own one day; start a college fund for them as soon as possible, save money myself so they’ve got someone they can fall back on if necessary. Recognizing the advantage and using it positively in the future is super important", "author": "ferrar21", "created": 1609893273, "upvotes": 1}, "gi8x48s": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8x48s/", "text": "I know for a fact my friends who worked during college skipped out on studying/assignments because of working part time.  \n\nYou are already paying a ton of money to be there, take out a little extra in loans and ensure you can focus on your classes", "author": "Kinkyregae", "created": 1609893123, "upvotes": 2}, "gi8vrc0": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8vrc0/", "text": "Nope. This is the ideal. Being able to purely focus on school and get good grades is amazing. I do have a job now (only 10 hrs a week so not too much) but I didn't my first 1.5 years of school and it was great.", "author": "ggadget6", "created": 1609892442, "upvotes": 1}, "gi8uct7": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8uct7/", "text": "Start investing in self education and learn how to generate wealth by yourself. Work a 9-5 minimum wage job to cover basic expenses. If you are willing to eat dirt for 5 years then you’ll be successful.", "author": "naturalchim", "created": 1609891858, "upvotes": 2}, "gi8tgcb": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8tgcb/", "text": "If you are living with your parents, it’s possible they would prefer that you spend time with them rather than work.   \n\nNot to mention, working a job for money you don’t really need is probably not the best idea  during a pandemic. \n\nAll this pro-don’t-work stance really depends on how much school you have remaining. I read (on here?!) recently that it is important to get an internship/ start looking for a job in your junior year.", "author": "inflewants", "created": 1609891486, "upvotes": 2}, "gi8tct9": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8tct9/", "text": "I’m a senior in college and my recommendation is to not work during the school year unless there’s a benefit outside of money. Things like networking or experience in your desired career would be good reasons. Being a college student is hard enough so it’s good to not split your focus. Also the fun parts of college are things you can’t experience once you move past college and it’s definitely not worth sacrificing for a job in retail or food.", "author": "LilFiz99", "created": 1609891447, "upvotes": 2}, "gi8pcdd": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8pcdd/", "text": "Why would anyone be mad at you for not working a part time job when you have enough money already???", "author": null, "created": 1609889793, "upvotes": 2}, "gi8p22m": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8p22m/", "text": "No you aren't. Different people want/need different things", "author": "forevz_a_student", "created": 1609889676, "upvotes": 2}, "gi8opy6": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8opy6/", "text": "You are so right with that! I would give a ton for not having to work but I wouldn’t be able to afford living like I do right now without it.", "author": "plants_lady", "created": 1609889537, "upvotes": 2}, "gi8l17l": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8l17l/", "text": "As a person who’s been working full time ever since high school due to my family being asswholes I am jealous. However I always say you don’t need to work unless you have too! Enjoy it while it lasts", "author": "Midnighttonigght", "created": 1609888044, "upvotes": 5}, "gi8hs6t": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8hs6t/", "text": "That money could always go into savings. I personally do work during school, but it's hard to balance the two of them, and I have very little free time because of it. To be fair, though, I really like my job.", "author": "Aureilius", "created": 1609886740, "upvotes": 2}, "gi8hdcn": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8hdcn/", "text": "It depends on what kind of work, AKA bartending or being a server versus being a research assistant / coordinator / CNA for example, working in a setting that  will help you up for your future career is different.", "author": "Thewushuking123", "created": 1609886576, "upvotes": 1}, "gi8feh3": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8feh3/", "text": "Nope. Do things that will help your future and your grades.", "author": null, "created": 1609885793, "upvotes": 2}, "gi8aamq": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi8aamq/", "text": "Honestly if i have this opportunity to not work while in college would be heaven!! And i would definitely take it! I wouldn’t judge someone’s who work and not work bc college by itself is already chaos! \n\nI - sadly worked and do school. Its mentality exhausting and bad for mental health but gotta buy them books 😭", "author": "omogal123", "created": 1609883803, "upvotes": 2}, "gi872q1": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi872q1/", "text": "If you can get away without working some bullshit minimum wage job during school, by all means don't work. I'm in a very similar privileged position as you where I am fully covered by scholarships and grants (to the point where I actually usually pocket about $3k worth of grants each semester), so I absolutely don't work during the semester. I even took this past semester off from school (to avoid online classes) and worked a few days a week to build up some savings so I'll be going into this coming semester with over $11k in my bank account. School is too hard already to have to deal with balancing a shitty job on top of homework and classes.", "author": "M477M4NN", "created": 1609882548, "upvotes": 2}, "gi859er": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi859er/", "text": "so im a senior in high school extremely worried about paying for college. i just got fired from my job (i was seasonal so its fine) and i had to make the decision to work somewhere else.\n\nI've decided not to because working and doing school was so stressful and I almost failed multiple classes. And my mom told me that there's no point saving for college of your bad grades keep you from getting in at all.\n\nit's about what you can handle and what you need. don't let anybody's idea of what you should do change what you know is best for you.", "author": "uss_soup", "created": 1609881841, "upvotes": 2}, "gi845xn": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi845xn/", "text": "No!! You're smart for not working if you don't have to. I'm in a somewhat similar position but I'll need to start working again soon", "author": "bad-attidude", "created": 1609881418, "upvotes": 4}, "gi83ntg": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi83ntg/", "text": "Don’t work if you don’t have to! It’s just an added stress and I would take it if I had the opportunity myself too!", "author": "tattooedships", "created": 1609881221, "upvotes": 2}, "gi82wcn": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi82wcn/", "text": "I mean if you don't need to work, then don't. College is such a unique opportunity and you deserve to enjoy every bit you can. Also, working while being a student is more than just money. There's pros (discipline, communication, hard skills, etc.) and cons (loss time, energy, stress, etc.) to consider.", "author": "GreyLakes", "created": 1609880926, "upvotes": 2}, "gi82cje": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi82cje/", "text": "That's up to you. My boyfriend works when he's not at college during breaks, but he saves all his money and that's it. His parents pay for everything and he focuses better when he's not working during college. Me on the other hand, I'm a workaholic and I pay for everything myself. My best friend works even though she has nothing to worry about. It's really up to preference. You're not a little bitch for prioritizing your education, but I would consider the pros and cons of working during school.", "author": "ArtemisTater", "created": 1609880714, "upvotes": 2}, "gi80w6d": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi80w6d/", "text": "Definitely don't if you can avoid it. \n\nDepending on the difficulty /length of your program, working through college may often not be worth it at all financially. A lot of people end up taking more semesters than they would have without working because they arent able to put enough time into school. It ends up meaning that you lose money in the end, having more debt from being in school longer even though you were working. \n\nAlthough many of us don't have the choice.", "author": "KiwiZeta", "created": 1609880150, "upvotes": 2}, "gi7z801": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7z801/", "text": "Not at all. The only reason I was paid during college was because I willingly joined groups that had both paid and unpaid positions - think recruiting, admissions, etc. I knew I wanted to focus my extracurricular time around these activities, and it just so happened there was the opportunity to be paid. Otherwise, I wouldn't have sought out a job either.", "author": "Iripol", "created": 1609879505, "upvotes": 2}, "gi7yc1b": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7yc1b/", "text": "I have been going to college since 2013 and have only worked one job for a short period of time. Looking back on it, it is one of the biggest mistakes of my adult life since **college does not make you money**. Being a broke college student is not fun. Throughout that time, I have watched my peers live life because they make money while I just suffer through college as a broke student. If I could go back, I would work more even if it meant slowing down school. Overall, if you are almost done with school, then just focus on school, but if you have a long way to go like I did, then at least make some money and gain work experience somewhere.", "author": null, "created": 1609879161, "upvotes": 1}, "gi7y4nb": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7y4nb/", "text": "Absolutely not. Having a job is an immense amount of work when studying. If you don't need one, don't put yourself through the extra pressure.", "author": null, "created": 1609879082, "upvotes": 2}, "gi7xtas": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7xtas/", "text": "Being a full time student is a job!!! I wish it was like my grandfathers era of working during the summer to go to college rest of the year. With the cost of things now I'd likely be broke in 2 months working 4 out of the year.", "author": "Furzball", "created": 1609878962, "upvotes": 2}, "gi7xqt5": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7xqt5/", "text": "As someone who had a full ride on scholarships and grants, I say be careful of anything that could cause those to end prematurely. I had to pay for my last year out of pocket (still paying 😅) and I just so happened to be lucky to have the savings in the bank to sustain myself and have a bit for an emergency.\n\nSo no you don't need to get a job for a job's sake. But just make sure you have a backup plan. Enjoy the time you have now, but try to look ahead with a bit of positivity towards your career.\n\n(Basically a side job gives you some spending money which relieves the stress and anxiety around spending your savings. However, you then gain the added stress of a shitty job. It's a give and take that's perfectly up to you.)", "author": "HeadlockKing", "created": 1609878935, "upvotes": 2}, "gi7vu4o": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7vu4o/", "text": "If you don't want to work like, retail that's entirely reasonable. But if you have the opportunity for a paid job that gives you actual skills, you should do that.\n\nFor example, my college has a GIS lab that offers students paid internships year round. It's not technically my field, but I've worked there for two years because it's a great skill to have (and I'm now in basically an assistant manager role, which is great to have.)\n\nIf something like that is available, I'd highly recommend it even if it's not your field. Otherwise, feel free to not work.", "author": "ParsnipPizza2", "created": 1609878211, "upvotes": 2}, "gi7v0hd": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7v0hd/", "text": "[deleted]", "author": null, "created": 1609877901, "upvotes": 1}, "gi7u8ts": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7u8ts/", "text": "I will say check if your major requires an internship. Either way senior year is the time to do something related to your major so you don’t go into the job market with 0 connections. If you can hold off till then (especially with a pandemic) go for it. There is a lot of remote work though that you’d be surprised how easy it is to balance. Again though grades come first.", "author": "dgvelling", "created": 1609877607, "upvotes": 1}, "gi7tlwx": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7tlwx/", "text": "I don't think there is anything wrong with that. Work-study may be a good option though if you are eligible. You make money and gain experience. They are also pretty flexible around finals and mid terms. Win Win.", "author": null, "created": 1609877365, "upvotes": 1}, "gi7tcgj": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7tcgj/", "text": "i live in Sweden so this we are all here in the same boat as you. At least what I'm studying i don't feel i would have time to work when if id have to, i study computer science a 5 year degree and have to work easily 10 hours a day, plus weekends if exams are coming up. i simply and my peers dont work, except of course when summer comes up", "author": "ottoz1", "created": 1609877262, "upvotes": 2}, "gi7r3eh": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7r3eh/", "text": "Yeah no need to work if by work we mean odd jobs almost solely to earn money. Use the time to beef up your transcript - get the best grades. If you're in IT, build something. If not, do something related to your course. Seek internships, etc. Take advantage of this opportunity. \n\nI work full-time while doing my masters and I think I'd easily get higher grades if I didn't have to work and have all my time to focus but I do not have that option. 😂", "author": "PhysiogelAI", "created": 1609876499, "upvotes": 2}, "gi7pxw1": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7pxw1/", "text": "No, there's no reason to feel guilty for not working when you're also a student", "author": "RhyanHawghor", "created": 1609876133, "upvotes": 3}, "gi7osl2": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7osl2/", "text": "Absolutely not. You shouldn't have to work while in school, and if you don't need to then don't. Trust me, it's not worth it.", "author": "SaintLucien", "created": 1609875759, "upvotes": 5}, "gi7nn7y": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7nn7y/", "text": "If I were you, once I adjusted to college, I would find a part-time job. Not because I think everyone needs to necessarily work in college; however, having a paid job with low expenses would mean that all of the money you earn you can save. Think about when you graduate and want to move out. Say you have to pay first + last month's rent and a security deposit in your first apartment, plus buy furniture. What money will you use for that? Or if you graduate and you need transportation for your job, what will you do before you earn your first pay check? Will you be able to afford to move to another city when you graduate if you get a job elsewhere? You can get a campus gig that's only 8-15 hours a week, or tutor in your free time. There are lots of options that are highly flexible, only a few hours a week, and could make a world of difference in a few years.\n\nThat being said, take advantage of not needing to work. Put your time into getting the highest grades possible, and put working on the back burner. But I do think that deciding not to work at all in college is a little shortsighted and a bit premature, and I'm someone in pretty much the same situation as you.", "author": "emf729", "created": 1609875362, "upvotes": 2}, "gi7mo8o": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7mo8o/", "text": "I didn't work last semester and I'm not planning to work this semester. Because of that, I feel that anything less than a 4.0 GPA is unacceptable. It also allows me to do volunteer projects in my field and be involved in clubs on campus that are related to my field, as much as I can and still keep my grades up. It also allows me to JUST focus on school and do nothing else when my mental heath gets to me. I grew up poor in a single parent household, I worked fulltime to be able to financially support both my husband and myself while he was a fulltime student, so I feel VERY privileged to be in the position to not have to right now.", "author": "The-Great-Outd00rs", "created": 1609874993, "upvotes": 2}, "gi7m1tp": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7m1tp/", "text": "I am in a somewhat similar situation, I return home to wait tables and it’s nice having some spending money to pursue hobbies and get some nice stuff for myself", "author": "OrganicGatorade", "created": 1609874730, "upvotes": 1}, "gi7kwmw": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7kwmw/", "text": "Not sure why people are saying you are \"lucky\". Clearly, you've worked hard for that scholarship. Use it to ensure that you do well academically.\n\nAlso, not sure why people are saying that you'll have \"no experience\". Most of the part-time jobs (at least the ones akin to fast-foods/retail) add little value to your resume that another experience cannot already convey.\n\nFinally, I know, for a fact, that scholarship students don't just \"do nothing\" during the school year as the comments are assuming. Typically, they are the type to reach out and become involved in activities/projects within schools and in the community.\n\nIn other words, **you are not irrational to not work during the school year if you do not need to.** This is, of course, my two cents.\n\nedit: Don't be mislead by some of the comments. Do find work experience, but ones that align with internships, tutoring in your field, and/or TA positions in your field. These are the jobs that matter the most, not the ones in fast-food/retail.", "author": "Zenalyn", "created": 1609874247, "upvotes": 2}, "gi7kcb0": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7kcb0/", "text": "My sister and I had very different work/college experiences. She (firstborn) didn't work, and exclusively studied. My parents couldn't afford another daughter not working, so I had a job throughout my entire undergrad. \n\nShe graduated top of her class with honors. I struggled a lot to transition from high school to college and work. But eventually I got it down, had a pretty decent GPA, and liked having a semblance of cash-flow.\n\nNow, we are both graduates. She has zero work experience and is struggling to be hired (pre-COVID). From my connections with the outside world, I have references and people handing out my name to their connections, and I am employed even through the pandemic.\n\nSo I think it's great you don't have to work! Focus on your studies. But maybe consider even a one day per week job, so employers see some semblance of experience. If you're a 1-day barista for 4 years, your resume won't show your hours, but it WILL say, \"I have been a reliable employee to a company for 4 years.\" Which is impressive for a graduate.", "author": "Automatic_Corgi_3237", "created": 1609873991, "upvotes": 2}, "gi7joma": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7joma/", "text": "I know I don't want to work in my upcoming semesters. For the past two years,  I've been taking community college courses while working 40 hours per week and it really burnt me out. Plus, I didn't think I absorbed the material and just got by doing the homework, which now saddens me, because I went back to school to learn not to hand in assignments. So, transferring to a university and I plan on not working at all if I can.", "author": "computer_sushi", "created": 1609873692, "upvotes": 1}, "gi7jltl": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7jltl/", "text": "Not at all, I work and do school and I want to not work all the time. Its honestly better if you don't have to work or just dont work because you can focus more and just enjoy your time rather than work 24/7. So there is no shame at all for not working, but I would say it'd probably be good to work during summer.", "author": "Rapeisntachoice", "created": 1609873657, "upvotes": 1}, "gi7jhvf": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7jhvf/", "text": "Take advantage. Don't feel bad over not working during college because right now, you're in a great financial position to be able to do so. It took me years to get into a job where I can work maybe 5-6 hours a week and make more income than a regular 9-5 retail job (freight dispatching rocks tbh) but even then, I'd love to not have to worry about bills during this time.", "author": "fallenlatest", "created": 1609873607, "upvotes": 1}, "gi7iibj": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7iibj/", "text": "Not to get all commie on you, but I'm gonna get commie on you and remind you that you *shouldn't have to work*. All you gotta do is put your education to good use, and acknowledge that *everyone* should be in a position like you, and that you yourself are here because things worked out well for you. While it may be a source of guilt now, transform that guilt into drive to make the world a better place with your education and skills so that everyone can have opportunities like this.", "author": "AtheaOfAltea", "created": 1609873160, "upvotes": 2}, "gi7hwbp": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7hwbp/", "text": "No, but it will help you get a \\[better\\] job after graduating if you have some \\[relevant\\] experience.  Part-time work can be a great thing.", "author": "Jscott1986", "created": 1609872889, "upvotes": 2}, "gi7haa8": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7haa8/", "text": "For the last three years I worked while I was in school. This year, I lost my job due to COVID and it feels like a weight is off of my shoulders. One less thing to worry about in my final year. I also live with my parents and received some nice scholarships. I also still do work study so I’m not losing too much money to keep paying bills. No I don’t think you should feel bad. If you don’t have to you don’t have to. That’s it.", "author": "QueenZeon101", "created": 1609872617, "upvotes": 3}, "gi7h87a": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7h87a/", "text": "I also didn't have to work during college, and I didn't work during freshman year. However, after that, I realized I was really missing out on gaining work experience that I could put on my resume. I got a job as a peer tutor and eventually (senior year) a job as an assistant in the library archives. Those experiences have helped me more with getting a job after I graduated last May than my education did. If you don't *have* to work, you have more flexibility to find a job that will help your career rather than just one that pays well, and I think you should recognize and take advantage of that.", "author": "Calligraphee", "created": 1609872591, "upvotes": 2}, "gi7h7ul": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7h7ul/", "text": "Not at all. This is an excellent opportunity to concentrate on your studies. If anyone says it's privileged or you're wrong for this, they can go pound sand. Just don't brag about it or rub it in.", "author": "Paesana", "created": 1609872586, "upvotes": 4}, "gi7gwmo": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7gwmo/", "text": "Nah man you're totally good. I had a great time in college all throughout, but my freshman year was the only year that I wasn't working a part-time job and it was so much more enjoyable to have that time. This is literally the only time in your life where you'll be able to have a little extra free time without a job and be able to use it however you please and enjoy it guilt-free. I had my tuition covered so I just had to work to be able to afford food and such lol. If I had extra money from a great scholarship like you're describing, I almost definitely wouldn't have worked. Use the time to focus on school and explore who you are as a person. Trading time for money is so ass so if you can avoid it and spend your time in a much more meaningful way and invest in yourself, then it's a no brainer. Consider if you want the extra cash, though. Might be nice to have some money coming in for drinks, going out, buying something fun every once in a while, or saving up for post-grad, etc. Maybe you could even try not working at first, then trying work for a couple months, and seeing if you like how it feels in your schedule.\n\nAlso not sure what you're field of study is, but especially as you become an upperclassman, you're probably going to want to jump on any worthwhile experience or internship that directly relates to what you want to do after college. Like for example if you want to be a software/computer science person, you'll need to look at getting an internship while you're in school, so just keep that in mind", "author": "gatorzero", "created": 1609872448, "upvotes": 2}, "gi7gsz4": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7gsz4/", "text": "Not at all. It's a good thing you don't need to work because that means you can have an easier time focusing on just school. After all, since you're a college student, college is your main responsibility anyway", "author": "Iron_Vodka", "created": 1609872403, "upvotes": 1}, "gi7gki5": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7gki5/", "text": "Get an easy campus job. There is no reason not to. \n\nLab assistant or something. They make these jobs so easy that U can do ur schoolwork during shifts. \n\nU will also make friends. Any money. U can relax and watch Netflix during most of these jobs. No reason not to.", "author": "Cameron24529", "created": 1609872297, "upvotes": 1}, "gi7fk6c": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7fk6c/", "text": "As someone who broke her back working while in nursing school, the short answer is yes. I wish higher education wasn't a privilege thing anymore, but unfortunately it is.", "author": "TheVoidWithout", "created": 1609871853, "upvotes": 1}, "gi7e2ty": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7e2ty/", "text": "I chose to work from 15-18, and have *had* to work from 18 to 22 (current). I wish I didn't need to buy a car so I could focus exclusively on my college experience. You're not a little bitch. \n\nJuggling classes, social life, clubs, etc is hard enough, and adding on a job that you more than likely don't care about, and definitely are not being paid enough for, is unnecessary. \n\nEnjoy your time in college. Be proud that you earned enough scholarships that you don't have to work.", "author": "KingwasabiPea", "created": 1609871195, "upvotes": 2}, "gi7dxlb": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7dxlb/", "text": "I don’t think think it’s bad to not want o work but it could hurt you down the line when looking for full time employment and you have very little previous work experience.", "author": "elitefailz2", "created": 1609871129, "upvotes": 1}, "gi7dwj5": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7dwj5/", "text": "Get a job that compliments your education. Even if it pays shit, you'll be okay... and will be WAY better off when applying for jobs after graduation.", "author": "Virophile", "created": 1609871116, "upvotes": 4}, "gi7dnxv": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7dnxv/", "text": "I have to work to pay my rent but no if you dont have to work you arent a bitch I wish I didnt have to work lol", "author": "bald_butte", "created": 1609871009, "upvotes": 2}, "gi7cpjt": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7cpjt/", "text": "If the only thing you're getting out of a job is money you don't need, then you shouldn't work that job.\n\nHowever, jobs often have supplemental benefits - experience you can put on your resume most notably. Doing something like tutoring in your field can be a reasonable job for a college student who doesn't need the money. Stocking shelves at Walmart is not.", "author": "ViskerRatio", "created": 1609870585, "upvotes": 1}, "gi7c5sc": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7c5sc/", "text": "I do freelancing work from home and I really enjoy it. But *work* work? Hell no lol.\nIf you want to work you could try freelancing if you're good with either languages, digital art, video editing, etc...", "author": "Fuba301", "created": 1609870339, "upvotes": 2}, "gi7b9sb": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7b9sb/", "text": "To answer the main question, no. Your situation is a privilege and if you see no reason to work during college then you do you. Take advantage now since you'll probably work the rest of your life like the rest of us. \n\nHowever, and many of the commenters have pointed this out, that will translate to a lack of experience on your resume and no employer will hire anyone without experience. So something to consider is a directive/independent studies through internships. My uni did that only for business majors, but what it essentially is is the students apply for internships, get them, and then go to the professors and deans and ask if they can use their internship experience to get credits. Essentially those students got credit for taking a class for doing an internship and then usually doing some related project with the professor or something like that documenting the experience. In a way, your work becomes class. For you, that might be the best option to balance not having to work and work around school and the resume experience.\n\nJust something to consider", "author": "Bri70_vengeance", "created": 1609869942, "upvotes": 1}, "gi7aumw": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7aumw/", "text": "I don't need to work during college, but I do because I have the time too and I feel like having the extra money can't hurt.", "author": "devious-science", "created": 1609869755, "upvotes": 1}, "gi7arma": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7arma/", "text": "It’s good for you to work. For many reasons. But if you don’t have to, then don’t. Just don’t rub it in peoples faces, honestly.", "author": "peterisfrosty1", "created": 1609869717, "upvotes": 2}, "gi7a16x": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7a16x/", "text": "Who cares? It is your decision. I am not going to work during college either, school itself is already stressful enough. I only plan to do internships in the summer", "author": null, "created": 1609869394, "upvotes": 2}, "gi79e8v": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi79e8v/", "text": "I have enough aid to cover my college and my refund gives me enough to live on semester to semester. I still choose to work because I want to be more comfortable but if you have the cushion to not work then don't work. Just make sure you're putting that time into your school and not partying, otherwise, it would be better to work.", "author": "Aces__Charles", "created": 1609869112, "upvotes": 1}, "gi78wjt": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi78wjt/", "text": "No, if you are able to study without working then please do, especially if your grades or mental health will improve. But remember that most people aren't as lucky; don't assume everyone else has the same privilege as you. Also remember that, depending on your field of study, it might be worthwhile to have some kind of work experience before you graduate. The last thing you want is to graduate and still have to work minimum wage jobs because you have 0 experience. Your mental and emotional health, as well as your grades/studies, come first (I know what it's like working a job that you hate and coming home crying every day), but I would talk to your college about student jobs/internships where your hours are limited and you work in a field related to your major.", "author": "pumpkin-jesus", "created": 1609868893, "upvotes": 2}, "gi78uhd": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi78uhd/", "text": "Enjoy your freedom while you can. You aren’t missing out on anything.", "author": "mokenz", "created": 1609868868, "upvotes": 1}, "gi78syl": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi78syl/", "text": "You are not. But also know your advantage. Work on your studies with the time you save not having to earn income. I didn't get to and I really wish I did.", "author": "afoodie92", "created": 1609868849, "upvotes": 1}, "gi78og3": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi78og3/", "text": "Tbh its best to start spending ur free time on looking for internships related to your career", "author": "Nicofatpad", "created": 1609868793, "upvotes": 1}, "gi78i6d": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi78i6d/", "text": "I did a research project on working while in college and the summation of it was that most people these days have to work while in college which both is frustrating and time consuming but a weird part is that theres an large population of people around the world that CHOOSE to work which actually ends up being a positive for them. It gives them a break in their day, allows them to socialize and make a little pocket money. These people only worked maybe 10 hours a week while the people who had to work could be working 15-35+ hours a week. It's one of those things where the people who have to, dont want to, and the people who dont have to, kinda want to.", "author": "thestickersontheback", "created": 1609868715, "upvotes": 1}, "gi77rnj": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi77rnj/", "text": "I feel like your lack of work experience could really end up with you shooting yourself in the foot in the long run", "author": "wolfy321", "created": 1609868387, "upvotes": 1}, "gi77prx": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi77prx/", "text": "I don't want to work either lol. I don't think many people would if given the choice. But I still work because as much as I don't care to, I care more about not having extra money for saving and travel.\n\nIt's an option for you. Personally I don't see the harm in working 5-10 hours a week if it means getting eating out money and saving for a rainy day.", "author": "br1039", "created": 1609868364, "upvotes": 1}, "gi77gd2": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi77gd2/", "text": "If you don’t need to work, you really don’t have to. Some students need to work as they don’t have their parents contributing to their college expenses. I didn’t work at all freshman and sophomore years and I focused on school as well as the school/life balance that was a challenge for me. If you wanted to, you could get an easy part time job that won’t be much of a priority and it will at least give you some spending money every week", "author": "alcreis", "created": 1609868248, "upvotes": 1}, "gi77c09": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi77c09/", "text": "Nah, I only worked about half of my time in school so that it could be my main focus. The other half I had a work study job that was flexible. Plus the whole pandemic thing is a good reason to hold off too. Don't want to get sick and fall behind for 2 weeks or so.", "author": "PreludeToAnEpic", "created": 1609868195, "upvotes": 1}, "gi76yph": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi76yph/", "text": "I don't think you should feel bad about it. As you have a scholarship you sound at least pretty independent.\nPersonally I would die going through the whole school year without work. But that might be because I get enjoyment out of working haha.", "author": "couch_potato167", "created": 1609868031, "upvotes": 2}, "gi76g4g": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi76g4g/", "text": "I’ll second what others are saying - you’re absolutely not a little bitch & should not feel guilty. Not working is very ideal. \n\nOnly things to consider- even working 10-20 hours a week would allow you to 1) gain experience in your chosen field that may be helpful on resumes for applying for careers down the line, or 2) build a bit of savings easily with no money ever going out. \n\nJust things to consider! Not trying to guilt you or anything. I’m in a rather similar situation though I live in the dorms. I have opted to doordash because it’s above minimum wage & very flexible, so I can work when I have time & save money.", "author": "kourtroom", "created": 1609867798, "upvotes": 5}, "gi7614b": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi7614b/", "text": "Not at all, I got grants covering with me, living with my parents until I transfer and activate my GI Bill junior year (in hopes of a master's). No shame in it, if you can pull it, more power to you!", "author": "southcounty253", "created": 1609867609, "upvotes": 5}, "gi75ni1": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi75ni1/", "text": "Ultimately, it's your choice, and what others think matters very little. To echo what most others have said, if your situation is such that you don't *have* to work during the course of a semester, I can't think of any reason why you should. During your time as a college student, pursuing your education should always be your top priority (excluding extenuating circumstances, of course)", "author": "bakedpotatowcheezpls", "created": 1609867439, "upvotes": 4}, "gi74ubj": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi74ubj/", "text": "No man, I'd kill for the ability to not have to work during the school year. You've avoided the hell that is retail during the school year (and, for that matter, the hell that is working during the school year to begin with), etc, etc.\n\nI would just make sure you use this as an opportunity to learn extra things. Like, man, when I want to learn Python, etc, etc, the best time for me is during a break. You've got so much extra time for learning *at your own pace* than someone like me has.\n\nJust, 'ya know, don't be an asshole about it to your peers.", "author": "EgyptianDevil78", "created": 1609867076, "upvotes": 5}, "gi74qsy": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi74qsy/", "text": "Not a little bitch. Be grateful you don’t have to though (as I do 40hrs a week and have an hour commute everyday).", "author": "ryanmaneo", "created": 1609867031, "upvotes": 2}, "gi74kcw": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi74kcw/", "text": "Most employers look at your work experience, that could hurt you. Im situated to have scholarships cover my college expenses, but I still like having my own spending money.", "author": "LittleHaitian", "created": 1609866951, "upvotes": 1}, "gi74jpv": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi74jpv/", "text": "Nope. I did it for a while, but with covid I need a source of something that isn't my own four walls. So I have a job that does only curb side services. There's no problem at all with focusing on your studies. Some days I still wanna leave my job, but I also managed to buy a car - so I can't, unless I magically come up with 6k. Haha. Focus on your work. I can say my work quality has definitely gone down since I started working, and my time management is poor, currently.", "author": "DemonicSippyCup", "created": 1609866942, "upvotes": 1}, "gi73rdh": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi73rdh/", "text": "I don’t work either. My parents tell that they prefer that I don’t work, and to just focus on school.", "author": "labrats21", "created": 1609866586, "upvotes": 1}, "gi73myj": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi73myj/", "text": "Since you aren’t required to work during the semester I wouldn’t. It will take time away from your classes and potentially lower your GPA. A lot of people aren’t as lucky but that doesn’t mean you should work.", "author": "QuickEquivalent0", "created": 1609866529, "upvotes": 2}, "gi73ldc": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi73ldc/", "text": "Sure, you don't have to but it'd be way better if you did I think. But hey, I'm not your mom do what you want.", "author": "initiald-ejavu", "created": 1609866509, "upvotes": 2}, "gi73fd9": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi73fd9/", "text": "It’s great to work a bit during the school year. I work as a tutor and that has been a high point in my internship interviews.", "author": "mech_eng_student", "created": 1609866430, "upvotes": 2}, "gi73afu": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi73afu/", "text": "i work during school and while it’s cool to have extra money on hand for fun, working through school is trash !!!!!!! you are not a little bitch. i am a little bitch <3", "author": "localwtch", "created": 1609866365, "upvotes": 1}, "gi736p9": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi736p9/", "text": "Yes.", "author": "theBlueProgrammer", "created": 1609866318, "upvotes": 0}, "gi732lx": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi732lx/", "text": "Why would you ever call yourself a little bitch, job or no job? Just focus on what you need to focus on and treat yourself like a friend, don’t curse yourself out", "author": "damsus121", "created": 1609866265, "upvotes": 4}, "gi72z0n": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi72z0n/", "text": "If you don't have to work, please do not and instead fill the time you would be otherwise working with internships, fellowships, and other school-related things that will help you get a job after graduation. I worked on an off during college and what I noticed was when I was working off campus doing awful part time service jobs I was significantly less productive and in general have significantly less on my resume and CV from those times. In college its hard enough to balance everything without also having to work a stressful awful service job.", "author": "squirrel8296", "created": 1609866218, "upvotes": 2}, "gi72v1k": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi72v1k/", "text": "I'd say do what you need to do. If you can work, it can get you out of some debt, though", "author": "ToaLegend", "created": 1609866165, "upvotes": 1}, "gi72sy1": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi72sy1/", "text": "If i didn’t have to work during college I wouldn’t. take advantage while you can.", "author": "pink_piercings", "created": 1609866139, "upvotes": 1}, "gi72ljn": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi72ljn/", "text": "Hey I’m kind of the same way! I’m very lucky to be in a privileged position where my parents are taking care of me. They tell me that my job right now is to be in school and do well, and that I shouldn’t struggle doing both school and work if I don’t need to. I think you should absolutely focus on school and not have to worry about job stuff until you need to- online school feels like a job in itself already. Take advantage of the position you’re in and do well in your classes! \n\nPersonally I still choose to work weekends at my job (which is literally just me sitting around entertaining my boss’s dogs and whatever other client dogs we have + some cleaning) just so I can have some money coming in and I can even bring my laptop and do schoolwork while I’m there. But I’m aware most jobs don’t offer that kind of flexibility. I’m hoping this upcoming semester will be good to both of us!", "author": "nini98q", "created": 1609866043, "upvotes": 2}, "gi72g06": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi72g06/", "text": "You’re in a great position to set yourself up for a good career. Do not take that for granted. \n\nI’m poor but attend a school with great financial aid, and this I don’t really need to work and can graduate with well under $10k debt if I don’t work a lick (although I do). \n\nYou need to do extracurriculars of some kind of you want a good career. Some of the best experiences are not paid, mind you. Congressional internships, substantial non-profit work, extensive volunteering, etc., are activities you could do that both show your willingness to do something even though you don’t need the money per say. \n\nThe last thing you want is for employers to think you’re a lazy privileged student. You can get a decent job just getting high grades, one internship, and a club or two, but if you want to excel, you need to do more.", "author": "planvital", "created": 1609865975, "upvotes": 2}, "gi728jy": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi728jy/", "text": "The way I see it is all of us are privileged relative to someone but that doesn’t mean we revoke those privileges. In other words don’t work if you don’t want to and don’t need to. My parents personally never allowed me to work in high school nor will they in college except internships, volunteering(if I decide to do pre-med), and research obviously. Also my parents will be paying for my college and subsidizing my living so I have no particular loans that I have to pay off and seems like you’re in a similar situation so I don’t see why you need to work unless you want to obviously", "author": "VTDMAN7", "created": 1609865880, "upvotes": 2}, "gi71dkx": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi71dkx/", "text": "Nothing wrong with not working during college, but you should try to fill your time with other productive activities. Most employers won't be impressed if you just have good grades without any work experience or extra curriculars.", "author": "cowsarenice", "created": 1609865488, "upvotes": 2}, "gi719au": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi719au/", "text": "Most students don’t work during college, I think you’re fine", "author": "ekaplun", "created": 1609865434, "upvotes": -1}, "gi70ekw": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi70ekw/", "text": "Hello! I work with a recruiting agency. Working while you’re in college, even just part time minimum wage jobs, really give you a boost once you graduate. Sometimes I see hundreds of applicants for entry level, straight out of college jobs. Someone who worked during college stands out over someone who didn’t by a lot. I’m not saying you absolutely have to work, but it really does give you an edge. It also means you have more “real life” work experience. I’ve noticed that people who never worked as a teenager or in college are often in for an awakening once they graduate and get a job, simply because they’ve never experienced it.", "author": "Raven_Em", "created": 1609865040, "upvotes": 1}, "gi70b2l": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi70b2l/", "text": "Depending on your situation near the end of your school career. Like internships and getting a job closer to being done. I’d say take advantage of not working while going to school. Focus on classes, get those A’s. Also if you’re young, enjoy your youth! \n\nI’m 27 and I work full time and do school part time. Gives me little time to enjoy my hobbies and friends. It’s a grind... don’t feel bad about what you’re doing. Also don’t compare yourself to your peers. You have your own path/journey. Doesn’t matter in the long run.", "author": "Ptownskater420", "created": 1609864995, "upvotes": 2}, "gi6zs4j": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6zs4j/", "text": "Honestly I’m jealous as someone who is in a very opposite situation but if I were you I would feel the same way. How about looking at an internship that’s like 10 hrs a week or something or volunteering in a lab? I feel like experience is good because you need some prior experience for a job but like you have more options than most and you don’t have to take on something that’s many hours or taxing.", "author": "isuckatusernames2000", "created": 1609864750, "upvotes": 1}, "gi6zd0c": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6zd0c/", "text": "The only thing I’d recommend is working a summer job, because job experience is important, and being hired at 25 without any experience at all will be difficult to say the least. (And if you can get a summer internship or job related to your degree that’s even better!)\n\nBut otherwise, enjoy your education! Focus on grades! Don’t work if you don’t have to!", "author": "sarahsage56", "created": 1609864555, "upvotes": 2}, "gi6z7qo": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6z7qo/", "text": "Yeah don't work. I was forced to work by my parents on my first year of college while having a full ride. As you could expect, I didn't have time to do homework/read the books and I lost one of my scholarships.", "author": "HectorDBotyInspect0r", "created": 1609864486, "upvotes": 2}, "gi6ys6b": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6ys6b/", "text": "Ideally no one would work or have outside distractions. We’d get all our work done as soon as it’s assigned and have time to relax. Unfortunately, life isn’t like that. Even if you have no expenses right now, it would benefit you a lot to work a little and save up all that money you don’t need right now for future expenses. If it’s too much to keep up with school then you can leave the job since you don’t need it anyway.", "author": null, "created": 1609864286, "upvotes": 2}, "gi6xr3i": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6xr3i/", "text": "A word of warning from someone who didn't work during college.\n\nMake sure you're taking relevant work experience opportunities (internships etc. during the summer). I didn't and am currently paying the price.\n\nI did however do very well on my degree. So there's that!", "author": "Elastichedgehog", "created": 1609863807, "upvotes": 2}, "gi6xjew": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6xjew/", "text": "I didn't work my entire first year of college. I remember applying for a job at Sears later and they asked why I had an employment gap from the age of 19 to 20. I told them it was because I was focusing all my time on school and they seemed to look down on me for that. Seemed a little ridiculous considering they were offering me an entry-level retail position. It's such an absurd formality to expect a job applicant to have worked nonstop since high school, especially when they're under 30.\n\nWork can be incredibly stressful during college, and if you don't need a job for financial support, you shouldn't have to feel ashamed about it. I've done the \"go to school 8am-4pm then work until midnight\" gig before and honestly never want to again. \n\nOn the other hand, make sure you do have something to add to your resume besides simply attending college. Volunteer, intern, start a project of your own.", "author": "Broccoli-Salty", "created": 1609863708, "upvotes": 1}, "gi6xi6k": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6xi6k/", "text": "Comes down to expenses. My parents make me pay rent, even after losing my job and apartment did to COVID :)", "author": "grebilrancher", "created": 1609863692, "upvotes": 1}, "gi6x6b3": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6x6b3/", "text": "I am in a similar boat. college is paid for by the government and I live at home cause I'm close to college. mom works and gets plenty of money so we live comfortably. she has never wanted me to get a job even when I offered so I just sit around until I'm done with my degree. I feel so odd cause so many people talk about needing to work and having their own place.", "author": "BraveUnion", "created": 1609863537, "upvotes": 2}, "gi6x1f3": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6x1f3/", "text": "Shit I wouldn’t be working if I didn’t have to! Fuck what anyone says about you not wanting to work. Use the extra time to work on yourself or go extra hard at school. Find an internship. People may get frustrated and claim privilege but I mean what can you do!? Keep a job and have more disposable income for them to bash on?", "author": "rckrchck", "created": 1609863474, "upvotes": 3}, "gi6wyaf": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6wyaf/", "text": "Don't think of it as a privilege at all, you're at school to do one thing and that is succeed at school. I've been working 3 out of the 4 years I was at college in order to help with expenses, and I can easily say it has cost me some A's and B's in classes (Prolly .3 of my total GPA, im a senior now so its a significant chunk) that would not have been a problem if I had not worked.  Focus on school now and doing the best you can to set yourself up after college. While experience is important and you should get work/internship experience in your field, a job that solely pays for expenses and makes you feel like you're doing what you're supposed to is not worth it at all. Good luck with this next semester", "author": "maccasandblunts", "created": 1609863432, "upvotes": 4}, "gi6wpyg": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6wpyg/", "text": "I'm sort of in the same boat. I don't generally work during the school year, or over breaks. I do have a summer internship each summer but that is it. I get decent financial aid/scholarships and my boyfriend covers our living expenses. After I graduate and start working I will take over most of the everyday expenses. I feel privileged as well, but I'm also under the impression that if you don't have to work during school you shouldn't unless the job is somehow related to what you want to do afterward and the experience would be valuable on a resume.", "author": "anon_throwaway13579", "created": 1609863323, "upvotes": 3}, "gi6wcxv": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6wcxv/", "text": "Have you ever had a job?  It is highly advantageous to have worked part-time during school in a job which is somewhat related to your desired career.", "author": "lupineblue2600", "created": 1609863152, "upvotes": 5}, "gi6wcoe": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6wcoe/", "text": "If I had the chance I would use this time to try and find an internship. Could help you in the long run, but no you don’t have to work.", "author": "trandon1", "created": 1609863148, "upvotes": 1}, "gi6vctd": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6vctd/", "text": "Don’t let anyone tell you you’re lazy or pampered for not working. You worked hard in high school for a scholarship. Many kids choose to go away for college, which adds like $12k a year to their bill. You’re in a good position. Focus on your coursework, building relationships with professors (by email or attend virtual office hours as much as you can), and look for research opportunities if that’s of interest to you.", "author": null, "created": 1609862686, "upvotes": 10}, "gi6urb0": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6urb0/", "text": "I work full-time and do school full time and it's a monster so if you are capable of not working, do that and finish up school. Side note, you're not a bitch. I struggle with depression and I catch myself using the same kind of language and it's not great. I try to remember to not accept treating myself in ways I wouldn't accept others treating me. Love yourself, finish up school, and keep your chin up!", "author": "bundaya", "created": 1609862429, "upvotes": 24}, "gi6udq0": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6udq0/", "text": "I get where you’re coming from- I caught flack from my friends bc I don’t have to work during the semester, BUT I would consider what you plan to do after graduation. If grad school is gonna require some extra $$ I would think about finding something (even just part time) to start saving for that so you’re not stressed later. Or even finding an internship or volunteer at a place that is similar to where you want to work after college. I get that it sucks (especially when you don’t haveeee to) but it will be beneficial in the long run.", "author": "snoopozzly", "created": 1609862249, "upvotes": 9}, "gi6u0z8": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6u0z8/", "text": "I'm basically financially broke, but I don't work during the semester. My tuition, housing and meal plans all go on loans so I have enough saved up to survive for now. I'd rather focus my energy into doing my work and getting good grades", "author": "Kaitlin33101", "created": 1609862080, "upvotes": 3}, "gi6tx3f": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6tx3f/", "text": "I worked a summer job that supported me through the school year and did not work during the school year my Freshman and Sophomore year. Due to being at home currently because of COVID I have been working because I just have so much free time and it’s really the only time I get to leave the house. When/ if we are able to go back I will not be working, different things work for different people.", "author": "spinchrecall", "created": 1609862027, "upvotes": 4}, "gi6tjez": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6tjez/", "text": "Try to avoid it if you can, it fucking sucks to work and study full time.", "author": "FortuneFavors1994", "created": 1609861845, "upvotes": 3}, "gi6t83y": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6t83y/", "text": "It's good to get work experience during college, but if you don't have to work during the semester, DON'T. I say this as someone who went to three different colleges and has had to work 20+ hours a week minimum to cover what loans didn't. Lost my job in March but my husband is full time and we're not hurting to have me out of work.\n\nThis semester, I got six As and two Bs. Spring was the same, A/B average. Before I always had one C because at least one class would take the backseat and get bare minimum from me. I could never focus fully on school, but now I can! Don't work if you don't have to. Chill out and focus on your studies :)", "author": "FurretsOotersMinks", "created": 1609861692, "upvotes": 16}, "gi6s2hw": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6s2hw/", "text": "Nope! Not at all. I think people underestimate how hard college is. Also I’ve found out that when you spend time working you spend less time on school, leading to bad grades and loss of some financial aid scholarships etc. If you don’t have to work don’t", "author": "Worth_Disaster2813", "created": 1609861127, "upvotes": 5}, "gi6r43k": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6r43k/", "text": "I did not work during the semester, I would recommend getting involved in other things instead! Take advantage of professional organizations, social organizations, volunteer opportunities, etc! Recognize the privilege you have and take the time to make yourself a more well rounded individual.", "author": "AdorableIndustry", "created": 1609860654, "upvotes": 7}, "gi6pfe4": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6pfe4/", "text": "I’ve worked during the year before, and I am not this coming because the money I have saved is enough and I just don’t want to. I don’t think there’s anything wrong with that, working takes away either study time that will help your grades or free time that is definitely needed mentally.", "author": "zestyrigatoni", "created": 1609859804, "upvotes": 3}, "gi6n8eu": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6n8eu/", "text": "Eh, if you don’t have anything to worry about with future jobs then sure. However, when you graduate I guarantee it’s not gonna look good that you did absolutely nothing during breaks (winter and summer especially). At least try for summer internships or volunteer (depending on what you want to do after college), even if it’s not for money expand your resume. You can relax now but it’s just gonna make it harder for you to catch a break once you’ve graduated and have to start paying expenses.\n\nPersonally I work while not at school, and It’s 12 hour shifts but it makes hella bank, I do that just so I can have my own money and not be 100% reliant on family.", "author": "AnnaMak", "created": 1609858655, "upvotes": 68}, "gi6n7sf": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6n7sf/", "text": "You’ll be in a world of hurt if you graduate with little to no work experience. No employer wants to hire someone who hasn’t worked.", "author": "Laurasaur28", "created": 1609858646, "upvotes": 44}, "gi6m1ym": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6m1ym/", "text": "if i had the opportunity to enjoy my time in college and not work, i’d take it in a heart beat!! there are thousands of people who would love to have the privelege you do, don’t worry what others think and enjoy your college experience!", "author": "cumsniffer3", "created": 1609858025, "upvotes": 5}, "gi6m14n": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6m14n/", "text": "if I couldn't work I wouldn't. I work 2 part time jobs and in college full time but, recently due to all the stress I got super sick and ended up in the hospital. I think if you could handle some of the stress it will bring then why not.", "author": "weediamonds", "created": 1609858012, "upvotes": 3}, "gi6lfct": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6lfct/", "text": "I tried to work while doing school this semester and it was honestly not the best decision. I'm in my junior year of college and all my 300 level classes were hard and with work to, I felt as though I could only commit 60% of myself to each one.", "author": "Brian2017wshs", "created": 1609857685, "upvotes": 1}, "gi6lfbe": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6lfbe/", "text": "I was fortunate enough to get great scholarships and make enough money from summer jobs and swimming that I don’t need loans. I am currently a senior and up until now, I haven’t worked during university. Don’t feel guilty about it. However, if you get offered an internship I highly suggest you take it. Internships are a huge leg-up on those without one", "author": "PasswordLogger", "created": 1609857684, "upvotes": 8}, "gi6kvv2": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6kvv2/", "text": "I have to work in addition to going to school for financial reasons; however, it's great that you have the opportunity to focus only on your studies. I would take that opportunity and use the extra time for studying or taking an internship (even unpaid since you don't need the money) that could really help your career prospects!", "author": "lait_et_miel", "created": 1609857383, "upvotes": 4}, "gi6k1wz": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6k1wz/", "text": "Fuck working. Take that privilege and use it. It’s nice to have an option.", "author": "imagineer_17", "created": 1609856921, "upvotes": 43}, "gi6jc33": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6jc33/", "text": "No, but it's best to get internship experience for your career goal.", "author": "AnCom9", "created": 1609856520, "upvotes": 1}, "gi6isbo": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6isbo/", "text": "You've literally got the rest of your life to work...enjoy the time while you have it", "author": "storyteller_sun", "created": 1609856203, "upvotes": 701}, "gi6ikpa": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6ikpa/", "text": "Take advantage of the break that you earned through all of the hard work that it took to get to this point\n\nIf you don't have to and you don't want to-- then don't. Do something that inspires you and allows you to enjoy life in your spare time instead =)", "author": "Forsaken-Alternative", "created": 1609856078, "upvotes": 3}, "gi6i34d": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6i34d/", "text": "No not really. My parents paid for my school, as well as a car and a monthly allowance. Also, it is customary for most college students to live with their parents here. Why tf would I work? Building work ethic? Fuck that, nobody is working 30 hours a week at 7-Eleven because they want to build \"work ethic\". You bet your ass I'm going to spend my time going out with friends, indulging in my hobbies, dating, etc.", "author": "DieSchungel1234", "created": 1609855789, "upvotes": 2}, "gi6i346": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6i346/", "text": "Are you using any loans to pay for college? If so I’d say you should be working.", "author": "JMMFIRE", "created": 1609855789, "upvotes": 16}, "gi6go1z": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6go1z/", "text": "I mean I could do the same but I still work. All the money I make I save. Once I graduate I’ll have a shit ton of money I can spend in furniture for an apartment or save towards a down payment for a house. Take advantage of this opportunity, it’s worth it.", "author": "Tackysock46", "created": 1609854918, "upvotes": 142}, "gi6g2j2": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6g2j2/", "text": "Use the time you would have to be at a job productively and you aint no bitch.", "author": "KarmaInFlow", "created": 1609854551, "upvotes": 36}, "gi6bhbq": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6bhbq/", "text": "This is how it's meant to be done. College should be a fulltime job. Make sure you are putting in your 8 hours, Monday to Friday.", "author": null, "created": 1609851350, "upvotes": 55}, "gi6akjf": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi6akjf/", "text": "[deleted]", "author": null, "created": 1609850646, "upvotes": 975}, "gi690ic": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi690ic/", "text": "I would say it is completely fine if you don't need the money, go for an internship or some helpful working experience if you have the chance to not be behind the McDonald's desk because you really need the money.", "author": null, "created": 1609849378, "upvotes": 114}, "gi68tlk": {"link": "/r/college/comments/kqx5hb/am_i_a_little_bitch_for_not_wanting_to_work/gi68tlk/", "text": "I feel the same way sometimes. You gotta remember that you're doing this for yourself. I tried working this past semester with classes and it was doable but it sucked. I'd much rather have more study time and have actual free time. Do what makes you happy. Don't worry about what anyone thinks.", "author": "Apple_Jak", "created": 1609849217, "upvotes": 229}}}