{
  "sid": "q6br47",
  "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/",
  "title:": "Does anyone else just have friends but no close/best friends?",
  "text": "I’m posting this before I go to bed so I won’t see replies until the morning but I was wondering if anyone else only has friends/acquaintances but haven’t established any genuine connections with them? I have like 3 to 4 friends that I go eat lunch with, go to events with and text regularly but it’s only for those reasons. It takes me a while and happens naturally for me to establish a close connection with someone like best friends. I see big groups of friends hanging out and I don’t even have that. I’m pretty introverted so maybe that could be why. When did you start to find your people that you genuinely connected with and even had it last after college if any of you are graduated?",
  "author": "jcks234",
  "created": 1634004955,
  "updated": 1634082584,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 1.0,
  "comments": {
    "hgb28vm": {
      "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/hgb28vm/",
      "text": "Wow, you actually have friends to go to lunch with? Mbn, everytime I ask I just get ghosted or ppl have other plans. It's fine that they do, but to answer your question some people hardly have any friends at all. I've gone through 4 years of school and haven't found that group of people I would consider close friends. I hope that I can find some people to be acquaintances with, but for the most part I'm still looking for my group. \n\nNot that I have any good advice on this topic considering everything I just wrote above, but for you it's alright to have a group of people that you can still hang out with even if it doesn't feel like y'all are close. And being introverted is just part of who you are and there's nothing wrong with that either. I think that if you're looking for that big group of friends to hang out with, ask some of your 3-4 friends to bring some of their friends and you all go do something together. Might make you nervous at first, or it might not it just depends, but it's worth a shot.\n\nAs for me, I feel like once people get to know me, I'm a genuine guy, but making small talk or that initial conversation is kind of a weak spot for me. Don't worry, though, you'll make that group of friends sooner than you realize I'm sure.",
      "author": "TAMUVIBEZ",
      "created": 1634005923,
      "upvotes": 15,
      "replies": {}
    },
    "hgb2dm6": {
      "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/hgb2dm6/",
      "text": "I am in the same boat as you. I don’t really have any advice but I am here to say you’re not alone. I’m an ambivert and I have a pretty busy schedule with school, work, and volunteering (it also doesn’t help that I commute to campus), so that may be a reason why I don’t have any best friends that I’ve made in college. I’ll be following this post.",
      "author": "coolchickstar",
      "created": 1634005986,
      "upvotes": 6,
      "replies": {}
    },
    "hgb10e4": {
      "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/hgb10e4/",
      "text": "Sometimes I don't even know how to start a conversation so your definitely found better than me.",
      "author": "69earthling",
      "created": 1634005362,
      "upvotes": 5,
      "replies": {}
    },
    "hgdiiq9": {
      "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/hgdiiq9/",
      "text": "Im in the same situation, only I don't do events or anything because my commute is 1h each way. Youre not alone I guess. Im grateful that im still close with some of my high school friends even if theyre far away. As for college, I can't say anyone is a close friend, just ppl its nice to talk to when im there, nothing more of a connection",
      "author": "Usual-Article6569",
      "created": 1634058212,
      "upvotes": 4,
      "replies": {}
    },
    "hgdspv5": {
      "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/hgdspv5/",
      "text": "Well man, i was transferred to this university a month ago and i live in a dorm, i still don't have anyone to eat launch with or talk to. You seem like a social person so i think you'll get there tho it might take sometime.",
      "author": "AhmDrake",
      "created": 1634062417,
      "upvotes": 3,
      "replies": {}
    },
    "hge69vc": {
      "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/hge69vc/",
      "text": "Honestly I eat lunch by myself. I go to a nearby park and relax and enjoy the weather. I also don't socialize with anyone but my classmates in class.",
      "author": "willowmei",
      "created": 1634067923,
      "upvotes": 3,
      "replies": {}
    },
    "hgecz5j": {
      "link": "/r/college/comments/q6br47/does_anyone_else_just_have_friends_but_no/hgecz5j/",
      "text": "You have to realize that 1. Not everyone is going to prioritize you as a friend, allowing a close connection to form, and 2. You get out what you put in. And both sides have to do the work to create a close friendship. If one side just isnt doing it you wont get there.\n3. Spend your time on people that prioritize you if you want close friendships.",
      "author": "Cerenya",
      "created": 1634070656,
      "upvotes": 3,
      "replies": {}
    }
  }
}