{
  "sid": "p3qa3r",
  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/",
  "title:": "Just a reminder for incoming freshman to make smart decisions when it comes to drinking",
  "text": "Seriously. You’re a grown up now and free bailouts aren’t a thing. Hangovers suck. blacking out isn’t fun and you can get in some serious trouble that you won’t even remember in the morning. Watch your drinks, slam a glass of water before bed/right after waking up, and keep your hands to yourself. Lastly DO NOT DRIVE IF YOU HAVE BEEN DRINKING. Even if it’s one beer. Not-a-drop laws will screw you and you will deserve it honestly.\n\nI don’t wanna scare anyone. It’s important to have fun when at school. Just be smart, you’ll thank yourself later on.",
  "author": "mcquago",
  "created": 1628876872,
  "over_18": false,
  "upvotes": 1802,
  "upvote_ratio": 0.98,
  "comments": {
    "ha44wrq": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/ha44wrq/",
      "text": "DRINK AS MUCH AS YOU WANT!!! Obviously don’t drive idiots. BUT DRINK AND GET BLACKED OUT OR GO HOME. I just graduated college this summer and I would do anything to go back and drink, be stupid, talk about crazy shit and so much more with my roommates and housemates over the years. LIVE IT UP AND HAVE NO REGRETS. \n\nBtw…blackouts are awesome",
      "author": "Scary-Milk-5437",
      "created": 1629772489,
      "upvotes": 1,
      "replies": {}
    },
    "h9mgta6": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h9mgta6/",
      "text": "Get wasted ppl",
      "author": "LizardKing50000",
      "created": 1629433277,
      "upvotes": 1,
      "replies": {}
    },
    "h8z6ebf": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8z6ebf/",
      "text": "Imagine drinking",
      "author": "As-for-Arsenic",
      "created": 1628988904,
      "upvotes": 1,
      "replies": {}
    },
    "h8ycqwz": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8ycqwz/",
      "text": "Do! Not! Drink!!! If you’re now sure of how alcohol interacts with your medications. I just take an antidepressant and an anti-anxiety pill (not even a controlled substance) and I was laying on the sidewalk vomiting and shaking after drinking half a beer over the course of an hour.",
      "author": "throughappleeyes",
      "created": 1628974411,
      "upvotes": 1,
      "replies": {}
    },
    "h8xnlif": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xnlif/",
      "text": "Also, you don’t *HAVE* to drink. Like if you don’t like the taste, or just don’t like it, you don’t have to. If anyone makes you feel like you have to, they aren’t a true friend. I never really drank and I had plenty of friends/things to do. \n\nAlso, if you’re on medications (especially depression/anxiety meds) be careful. A lot of those don’t play well with alcohol! If you’re worried, next time you pick up your rx, ask the pharmacist.",
      "author": "jtho2960",
      "created": 1628963065,
      "upvotes": 2,
      "replies": {}
    },
    "h8xnk5i": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xnk5i/",
      "text": "Lol by the time I'm done with college I still won't be able to drink legally for two more years.",
      "author": "Japok_Dupwop",
      "created": 1628963049,
      "upvotes": 1,
      "replies": {}
    },
    "h8x6e9r": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8x6e9r/",
      "text": "I'm fine with my vanilla extract.....",
      "author": "whowantsanapple",
      "created": 1628955661,
      "upvotes": 1,
      "replies": {}
    },
    "h8whu8i": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8whu8i/",
      "text": "Thankfully I went to the dorms when I was over 21.  I still had a few drinks.",
      "author": "favnh2011",
      "created": 1628943181,
      "upvotes": 1,
      "replies": {}
    },
    "h8wfj10": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8wfj10/",
      "text": "Also, if you’re gonna indulge in drug experimentation, test your substances. It’s not fun getting sold meth in your molly.",
      "author": "Efficient_Respect952",
      "created": 1628941612,
      "upvotes": 2,
      "replies": {}
    },
    "h8wdxvv": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8wdxvv/",
      "text": "My dad died from cirrhosis. He was in the hospital with tubes in his mouth unable to speak. I didn't get to see him at the end because he was halfway across the country.\n\nAlcohol can kill you without you realizing it. One night of drinking probably won't. But if you do it again, and again, and again, and again, and again, it definitely can.",
      "author": "OoglieBooglie93",
      "created": 1628940442,
      "upvotes": 2,
      "replies": {}
    },
    "h8wdcce": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8wdcce/",
      "text": "Fuck that. Get wasted! Actually enjoy your college years! Drink whenever the hell you want.",
      "author": "zombieguy224",
      "created": 1628939984,
      "upvotes": -2,
      "replies": {}
    },
    "h8wd5rk": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8wd5rk/",
      "text": "THE TIMING. I just saw [https://www.youtube.com/watch?v=AbjdKCsTm44](https://www.youtube.com/watch?v=AbjdKCsTm44) and got so creeped out, came here to write something like this!!",
      "author": "curiouskittyyy",
      "created": 1628939847,
      "upvotes": 1,
      "replies": {}
    },
    "h8w784e": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8w784e/",
      "text": "Not even @ incoming freshman just @ all students. It's been a hard few years, I know we got wasted before covid but now the risk of total blackout is way higher. Please be careful and look out for those around you, whether you know them or not. My first college roommate would get blackout drunk every weekend and sometimes couldn't be brought back home. Enjoy, but end your night at home, not at the hospital or the police station.",
      "author": "YaGirlDrGiggles",
      "created": 1628934837,
      "upvotes": 3,
      "replies": {}
    },
    "h8w57ho": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8w57ho/",
      "text": "Why people go to college just to drink and party is beyond me. I'm 26 and have never been drunk in my life.",
      "author": "imeltinthishurricane",
      "created": 1628933050,
      "upvotes": 0,
      "replies": {}
    },
    "h8vvbwc": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vvbwc/",
      "text": "My favorite thing to do to moderate my drinking is pacing myself, i start out with 3 or 4 drinks within the first hour to hour and a half, then have one ever 45 mins or so the rest of the night, nice level of drunk the whole night. I also try to remember to drink water thrkughout the night too. For example, every other beer ill get a glass of water with it. I havent been hungover in  a very long time thanks to moderation, and I end up having substantially MORE fun for LONGER than my blacked out friends",
      "author": "_ProfessorHamish_",
      "created": 1628924745,
      "upvotes": 2,
      "replies": {}
    },
    "h8voog9": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8voog9/",
      "text": "Do not drink alcohol with xanax or any other benzodiazipene",
      "author": null,
      "created": 1628919739,
      "upvotes": 7,
      "replies": {}
    },
    "h8vl1cz": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vl1cz/",
      "text": "And just don’t get a fake ID. 2 of my friends were arrested on separate occasions for their fakes by cops waiting inside this bar. It’s harder and more expensive than you would think to get it expunged.",
      "author": "flowerchild3624",
      "created": 1628917306,
      "upvotes": 7,
      "replies": {}
    },
    "h8vg3h8": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vg3h8/",
      "text": "I had my first drink freshman year at a cast party. Wasn't planning on drinking that night, but when I decided I wanted to partake, I made sure I could stay over. Following that I always knew I could stay or get a trustworthy DD (never drinks) home",
      "author": "i_greyk",
      "created": 1628914267,
      "upvotes": 2,
      "replies": {}
    },
    "h8vensb": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vensb/",
      "text": "A lot of people have already said keep track of your drink and how much you're drinking... But you also need to make sure no one is putting anything in it. And if it comes from a giant punch bowl make sure that it is safe. I know true life stories where fraternities or party hosts literally drugged the entire punch bowl and had a separate one just for them. Best way to do it is to have a friend that watches out for you and you watch out for them. But different student orgs and University Police will give out things to test your drink with too",
      "author": "veanell",
      "created": 1628913439,
      "upvotes": 2,
      "replies": {}
    },
    "h8vdd60": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vdd60/",
      "text": "Will I have a harder time in college because I don’t drink and smoke? I have a lifelong illness and it would only be progressed by drinking. I think I’d rather live past age 40 so I don’t mind the judgement but I feel like it’s a huge bonding thing..",
      "author": "maxiattaq",
      "created": 1628912709,
      "upvotes": 1,
      "replies": {
        "h8wa2fx": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8wa2fx/",
          "text": "I don't drink ever and nah. There's a ton of social things you can do besides partying. I mean if you really wanted to you cam even do that without drinking.",
          "author": "Ifoundyouguys",
          "created": 1628937330,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8v9hqw": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v9hqw/",
      "text": "SERIOUSLY! You have to be tactical with this shit. Plan to stay with a friend within walking distance of the party, or plan for a reliable ride. Don't fuck with your future. 99% of criminal charges will not effect your chances of getting a job or license, but DUI is in the 1%. Don't fuck yourself.",
      "author": "Lost_vob",
      "created": 1628910629,
      "upvotes": 3,
      "replies": {}
    },
    "h8v8p5c": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v8p5c/",
      "text": "Remember the ABCD rules for alcohol poisoning! I train freshmen on this every year. If someone shows ANY of these signs, it’s time of call for medical attention.\n\nA-alert/aware\nThe person is very out of it or unresponsive\n\nB-breathing\nThe person has irregular or shallow breathing\n\nC-color/clammy\nThe person is very pale or blue or is cold and clammy to the touch\n\nD-doubt\nYou are unsure if the person has taken drugs, mixed alcohols, has a head injury, etc.\n\nAlso, speaking from personal experience, the best way to avoid a hangover is to continuously drink water between alcoholic drinks. Drink a ton of water between shots and before you go to bed.",
      "author": "m-is-for-music",
      "created": 1628910215,
      "upvotes": 1,
      "replies": {}
    },
    "h8v8l8f": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v8l8f/",
      "text": "I'm more confused about how people are being invited to this many parties.",
      "author": "RadiantHC",
      "created": 1628910160,
      "upvotes": 2,
      "replies": {}
    },
    "h8v6kt3": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v6kt3/",
      "text": "Also don't do other drugs while you're drunk. With alcohol 9 out of 10 drugs are a potentially fatal combination.",
      "author": "collegeanswersplease",
      "created": 1628909135,
      "upvotes": 1,
      "replies": {}
    },
    "h8v3ww6": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v3ww6/",
      "text": "Don’t overdo it either. I’m def a stoner but I drink occasionally at parties. Know. Your. Limits. Don’t be the girl screaming and crying and puking in the bathroom or the guy trying to fight everyone. Take 3 shots, vibe, feel good, make a group of friends, and j chill.",
      "author": "smelltheskinny8",
      "created": 1628907812,
      "upvotes": 9,
      "replies": {}
    },
    "h8uzkd4": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uzkd4/",
      "text": "Most people who drink are so lame. Others around them don't have a chance to fail, so they get shunned by drinkers for abstinence. Idk but I can't imagine being so awkward that I have to drink for interaction AND be arrogant about it.",
      "author": "youareaweirdo___",
      "created": 1628905658,
      "upvotes": 0,
      "replies": {}
    },
    "h8uz1kn": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uz1kn/",
      "text": "Yes I agree with this so much! I already know some people starting college this fall and I guarantee they’re going to get drunk and get hurt doing something stupid 🙄",
      "author": "Roflcopter987",
      "created": 1628905399,
      "upvotes": 0,
      "replies": {}
    },
    "h8uytxb": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uytxb/",
      "text": "I plan to be a tee-totaler, anyway. Not only does alcohol cost money, but it honestly doesn't seem healthy to drink, even in recommended levels.",
      "author": "Sonic-Oj",
      "created": 1628905292,
      "upvotes": 0,
      "replies": {}
    },
    "h8upbqp": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8upbqp/",
      "text": "A few tips as a freshman who made some pretty stupid decisions (but in my own home due to covid where I could have easily been caught anyways): There are BAC calculators online for a reason! Use them! Also,  Pedialyte and Dramamine really help with hangovers/nausea. Also, don't use alcohol as an emotional crutch. It's really not worth the repercussions.",
      "author": "foreignnatives",
      "created": 1628900591,
      "upvotes": 2,
      "replies": {}
    },
    "h8uoyq0": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uoyq0/",
      "text": "Shut the fuck up dude hahaha",
      "author": "AlphaQ22",
      "created": 1628900411,
      "upvotes": -2,
      "replies": {}
    },
    "h8uofpa": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uofpa/",
      "text": "Recently had to take a friend to the hospital because of irresponsible drinking. We had vodka, he had already went well past his limit. He was looking for some water and a friend of mine thought it would be funny to give him his Gatorade, which was really 30/70 Gatorade/vodka. All in all he almost had an entire bottle of vodka. \n\nI had to stay up with him all night so he wouldn't choke on vomit or fall over and concuss himself. He couldn't walk,, he had to crawl everywhere. When he stood up he would immediately fall over and multiple times almost hit his head.. The longest 6 hours of my life. He vomited until there was nothing else coming out, and then he dry heaved for q couple of hours. He couldn't drink water without throwing up. Took him to the ER in the morning when I'd sobered up. Doctors said he could very well have died if we hadn't taken him there. He need 2 iv bags of water. \n\nHe wasn't able to eat for nearly 2 days before he could finally hold down food down again. One of the worst days in my life.\n\nWatch what you drink, drink with people you trust, don't give your already drunk friend more than they need. And drink water.",
      "author": "spinac_salad",
      "created": 1628900154,
      "upvotes": 14,
      "replies": {
        "h8v039e": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v039e/",
          "text": "I’ve had to do the same thing with a friend. A group of girls convinced him to chug a bottle of vodka and within 30 mins I was taking him to the hospital. It was very scary to witness, he was foaming at the mouth and had no control.",
          "author": "sammcclue",
          "created": 1628905916,
          "upvotes": 8,
          "replies": {}
        },
        "h8ussfc": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8ussfc/",
          "text": "I sincerely hope the person who gave him more vodka is no longer your friend. That’s not a prank, and it isn’t funny **ever**. It’s just a plain asshole move.\n\nWhat your “friend” did is no different to spiking someone’s drink. In fact, he literally spiked someone’s drink. That’s a criminal offence.",
          "author": "officially_anxious",
          "created": 1628902299,
          "upvotes": 8,
          "replies": {
            "h8vrq1k": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vrq1k/",
              "text": "I never really thought about it as spiking a drink but when I think about it you're right \n\nWorst part was, in the morning he blamed my friend for over drinking and didn't take the blame.",
              "author": "spinac_salad",
              "created": 1628921953,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h8un4zo": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8un4zo/",
      "text": "Like... making out with the hot teacher...",
      "author": "TheFastbat",
      "created": 1628899521,
      "upvotes": 1,
      "replies": {}
    },
    "h8un4t7": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8un4t7/",
      "text": "Scientic studies haven't found a clear correlation between drinking water before sleep and reduced hangovers. Drinking water in between alcoholic drinks on the other hand does seem have to positive effect, if only because it means less alcohol consumed throughout the night. The most important thing is DO NOT DRINK ON AN EMPTY STOMACH. I've known many people (mainly girls) who've had horrible party experiences due to drinking on an empty stomach.",
      "author": "ThreeFingersHobb",
      "created": 1628899519,
      "upvotes": 1,
      "replies": {}
    },
    "h8umqzl": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8umqzl/",
      "text": "Adding on: UBER. Or whatever car service exists near you. Don’t even be tempted to drive by taking a car one way. If you see your designated driver start to drink, call a cab home. Try and take their car keys, but at the end of the day you can’t be responsible for them and you need to keep yourself safe. \n\nAlso: never split up at parties. This especially applies to women (but obviously any gender should follow this rule). It’s ok if your friends find people to talk to, but if you come together, you leave together. Don’t leave anyone with someone, even if they say “it’s fine, I’ll be ok!” They might be mad in the moment but they’ll be thankful afterwards that they didn’t end up in a terrible situation.",
      "author": "throwaway_pineapple_",
      "created": 1628899334,
      "upvotes": 3,
      "replies": {}
    },
    "h8uhq3m": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uhq3m/",
      "text": "a couple years ago, a freshman at my school froze to death.  he was walking home drunk from a frat party, alone, stumbled over, and never got up.  \ni’m going into senior year now and i’ve had to call medical services for drunk people a few times.  it’s okay to do.  everyone ended up fine.\n\noverall, watch out for each other.",
      "author": "hattifattenerrs",
      "created": 1628896955,
      "upvotes": 10,
      "replies": {}
    },
    "h8ugghn": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8ugghn/",
      "text": "I’m not a heavy drinker and at parties for drinking games people volunteer to be the designated ‘hero’ for me (especially if I’m designated driver lol) and drink for me. If you’re drinking with people who aren’t willing to have your back like that, find better drinking companions.",
      "author": "Horror_Candidate",
      "created": 1628896374,
      "upvotes": 2,
      "replies": {}
    },
    "h8ueylm": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8ueylm/",
      "text": "Don’t let someone hand you a drink that’s already open",
      "author": "ORCA_OF_WALLST",
      "created": 1628895690,
      "upvotes": 14,
      "replies": {}
    },
    "h8uc9zg": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uc9zg/",
      "text": "Keep track of how much you’re drinking (and what/who you get it from, etc.). It’s hard to lose track of you’re very drunk, so if you worry that it might be something you forget, count how many each time. I knew someone who rallied how much they drank using sharpie on their hand. \n\nAlso, most people know this, but (girls especially) never ever EVER take a drink from ANYONE unless you saw it being physically poured from a newly opened bottle. You don’t know who will put random stuff in your drinks. Going off of this, too, if you leave your drink somewhere and your eyes are off it for even a moment, get a new one. Don’t risk it.\n\nBe safe this year, everyone!",
      "author": "EwItsLindsey",
      "created": 1628894491,
      "upvotes": 10,
      "replies": {}
    },
    "h8u85hh": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u85hh/",
      "text": "remember: when it comes to alcohol, it's not a race. don't try to get drunk as fast as possible, because you will probably end up drinking more than you want to. pace yourself",
      "author": "nfs87",
      "created": 1628892656,
      "upvotes": 6,
      "replies": {}
    },
    "h8u7ntd": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u7ntd/",
      "text": "Drink and smoke because it’s fun. Don’t do it because you think it will make you feel cool/popular/look good on your snap story. That’s when it gets unhealthy and dangerous and are usually the times when people aren’t looking out for each other. Partying is fun when you’re actually doing it for fun!",
      "author": "treehugger417",
      "created": 1628892439,
      "upvotes": 3,
      "replies": {}
    },
    "h8u6csh": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u6csh/",
      "text": "Yup! A stupid, one-time decision now could fuck you for the next ten years. Many years ago when I was a freshman in my undergrad, someone was caught selling drugs. Immediately expelled. Now he is in jail. That stupid decision severely damaged his life. I’m sure he regrets it",
      "author": "PasswordLogger",
      "created": 1628891873,
      "upvotes": -1,
      "replies": {}
    },
    "h8tzc13": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tzc13/",
      "text": "Also remember that your brain has not finished maturing, and alcohol might hamper your mental development. I know a lot of people who really got into drinking in college and never really let the alcohol go afterward…",
      "author": "DieSchungel1234",
      "created": 1628888939,
      "upvotes": -3,
      "replies": {}
    },
    "h8tyw49": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tyw49/",
      "text": "Or, Just don't drink. Not good for your liver or health. Period.",
      "author": "09ikj",
      "created": 1628888762,
      "upvotes": 5,
      "replies": {}
    },
    "h8tylg0": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tylg0/",
      "text": "Why does this sub treat drinking and partying like the biggest taboo ever? \n\nYou can tell a college freshman all the precautions you want, but they won’t know their limit or know the proper cautions to take until they’ve actually drank and partied a few times. Hindsight bias plagues this sub, and unfortunately, many of us were warned of the dangers of hangovers and blackouts before college, but like most teenagers, it’s meaningless until we actually experience it.",
      "author": "stilldreamingat2am",
      "created": 1628888642,
      "upvotes": 26,
      "replies": {
        "h8uv45s": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uv45s/",
          "text": "I actually disagree. I think being taught harm reduction practices is a good thing and even if everyone won't listen to it, the most important thing is that some will. If it will help some people, and not hurt anyone then why not spread the advice?\n\nI was warned of the dangers of blacking out and hangovers before college and because of that I've never blacked out or had a hangover.",
          "author": "Suicyclone",
          "created": 1628903456,
          "upvotes": 13,
          "replies": {
            "h8uxrta": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uxrta/",
              "text": "I emphasized most teenagers. \n\nIt’s great that you took heed to the warnings, but teenagers are far more likely to learn through experience rather than authoritative figures telling them “no.” \n\nUnpopular opinion here, but blacking out and hangovers can help teach teenagers their actual limits. I mean, to someone who’s never been drunk, what does a limit even mean? By the time you’re drunk past your limit, you’re not thinking “yep, this is my limit, here it goes, let me stop.” And let’s be real, being drunk is fun for most college freshman, so no one cares to stop while they’re in the moment anyway. The consequences aren’t fun, though.\n\nYou don’t realize it until you wake up the next day. They’re learning experiences and are all part of the college experience. It’s not the end of the world if you’re hungover. No one is holier than thou because they’ve avoided hangovers.",
              "author": "stilldreamingat2am",
              "created": 1628904764,
              "upvotes": 1,
              "replies": {
                "h8v4s0f": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v4s0f/",
                  "text": "Exactly this!!! This sub for some reason is very anti weed, anti alcohol, anti frat, and anti party experience from the general tone of the posts and comments regarding it. People will drink. People will smoke. You can focus on harm reduction but people won’t know their limits til they exceed them. Take me for example, I’m a pretty straight edge stoner but I had pretty much no alcohol tolerance before college. Got wasted the first week of college, realized that anything more than 4 shots at a time will literally fuck me because of how skinny I am, and now I no longer take any more than 4 shots at any given time and I haven’t fucked myself up since. HOWEVER, taking 10 shots and landing yourself in the hospital is dumb and should be discouraged",
                  "author": "smelltheskinny8",
                  "created": 1628908234,
                  "upvotes": 3,
                  "replies": {
                    "h8v8inq": {
                      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v8inq/",
                      "text": ">This sub for some reason is very anti weed, anti alcohol, anti frat, and anti party experience from the general tone of the posts and comments regarding it. People will drink. People will smoke.\n\nI'm re-reading OP's comment and I don't see any anti-partying sentiment at all in it. All he's saying is thing like don't drive drunk. Drink water and eat something because you'll have a better experience. If anything this seems like a pro-partying post. He's giving people advice that will make them have a better time partying.\n\n&#x200B;\n\n>You can focus on harm reduction but people won’t know their limits til they exceed them. Take me for example, I’m a pretty straight edge stoner but I had pretty much no alcohol tolerance before college. Got wasted the first week of college, realized that anything more than 4 shots at a time will literally fuck me because of how skinny I am, and now I no longer take any more than 4 shots at any given time and I haven’t fucked myself up since.\n\nHarm reduction isn't about telling people to not get drunk. It's about telling people the safest way of going about it. Like OP said, you can get drunk but try not to drive while you're wasted. \n\nbtw, I had a similar experience to you and my limit is also around 4 shots (of something about 40% alcohol). Since I found this out the first time I got drunk, I didn't get super fucked up since either.\n\nWhere the harm reduction part came in is that when I got drunk, I did it around people who I knew and trusted with people who were there and could watch me to make sure I am safe. There was someone there to make sure I don't do 10 shots and end up doing something really bad. \n\nGetting super fucked up to the point you black out will teach you your limits. But harm reduction tells you that if you do it (you're first time when discovering your limits) at a place where you don't know anyone and there isn't anyone there to watch you, then this might be a bad idea. Especially for women where they often times get taken advantage of in this state.\n\n>HOWEVER, taking 10 shots and landing yourself in the hospital is dumb and should be discouraged\n\nWow, it seems like you fully agree with me that we should spread some harm reduction information then",
                      "author": "Suicyclone",
                      "created": 1628910124,
                      "upvotes": 3,
                      "replies": {
                        "h8v8r0j": {
                          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v8r0j/",
                          "text": "I guess you’re right. Just, from my experience, many of the posts on here aren’t very substance-friendly. I am very pro-harm reduction I guess I phrased my post wrong",
                          "author": "smelltheskinny8",
                          "created": 1628910241,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h8v71i9": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v71i9/",
                  "text": ">It’s great that you took heed to the warnings, but teenagers are far more likely to learn through experience rather than authoritative figures telling them “no.”\n\nYeah I agree. It's a good thing I never said that the best way to approach this issue is to get an authoritative figure to just tell them \"no\".\n\nThere's a difference between teaching someone harm reduction and teaching abstinence (being the \"no\"). I supported the former not the latter.\n\nThe difference is that when it comes to harm reduction you're giving someone information on how to go about doing something in the safest way possible as oppose to abstinence where you tell them not to do the thing at all.\n\n&#x200B;\n\nFor example if we take the issue of teen pregnancy, someone who teaches abstinence will just tell teenagers to not have sex. Someone who teaches harm reduction would educate teenagers about protection and how to do it safely. Based on the data we have, teaching harm reduction (in this case) works better since in schools/areas where sex education focuses on teaching about protection generally tend to have lower teen pregnancy rate.\n\nThis is just one case study in how harm reduction practices do work. Will teaching and giving teens access to protection completely eliminate teen pregnancy? no. In the same way that teaching people who to party safely won't prevent unsafe situations entirely. But that doesn't mean that teaching harm reduction is something that just shouldn't be done.\n\n&#x200B;\n\n>Unpopular opinion here, but blacking out and hangovers can help teach teenagers their actual limits.\n\nSure, that's one way to learn your limits but this isn't necessarily the best way lol. Yes having a hangover could suck but you won't die. However blacking out at a party with a lot of people you don't know can actually be unsafe (particularly to women but generally to anyone).\n\nSo if you can learn your limits in a safer way then why should you subject yourself to this unsafe situation to learn your limits?\n\n&#x200B;\n\n>I mean, to someone who’s never been drunk, what does a limit even mean? By the time you’re drunk past your limit, you’re not thinking “yep, this is my limit, here it goes, let me stop.” And let’s be real, being drunk is fun for most college freshman, so no one cares to stop while they’re in the moment anyway.\n\nWell obviously I'm not saying you should never get drunk (look back at my first paragraph about harm reduction vs. abstinence). You can get drunk and start learning your limits without putting yourself in an unsafe situation of blacking out around a lot of people who might not be interested in taking care of you. Believe me I know that being drunk at a party is fun af, and I've approached my limit before (getting to the point of throwing up multiple times). So what you're saying doesn't really address the point that I'm making because I never said that people shouldn't get drunk",
                  "author": "Suicyclone",
                  "created": 1628909370,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h8twwk8": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8twwk8/",
      "text": "WATCH OUT FOR YOUR FRIENDS \nWhen I was a freshman I remember doing 10 shots of grey goose very quickly\n(cause I’m stupid ) \nAnyway my friend was trying to keep pace even though she’s half my size. She got sick threw up everywhere and passed out. I wanted to call campus police but the people I I was with wanted to leave her in the hallway. I decided that day that my friend was more important to me than being cool and made the call anyway and gotten a ton of trouble but my friend is still alive and one of my very favorite people in the world.",
      "author": "Kellieisgay",
      "created": 1628887996,
      "upvotes": 152,
      "replies": {
        "h8uniu5": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uniu5/",
          "text": "No punishment is worse than watching someone potentially lose their life. Good on you",
          "author": "throwaway_pineapple_",
          "created": 1628899707,
          "upvotes": 65,
          "replies": {}
        },
        "h8vofo3": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vofo3/",
          "text": "That’s really scary. Good for you for doing right by your friend.\n\n(Adding to the advice for incoming students) In general, never try to keep pace with the number of drinks someone else is having. Different bodies mean different reactions to the same amount of alcohol — aside from size, how much food and water you’ve had is a huge factor. When you’re a newer drinker it’s very easy to underestimate how much variation there can be from person to person and even from night to night.",
          "author": "secondpriceauctions",
          "created": 1628919566,
          "upvotes": 14,
          "replies": {}
        },
        "h8xeked": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xeked/",
          "text": "They wanted to leave her in the hallway? That's disgusting.",
          "author": "alapleno",
          "created": 1628959186,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "h8twso6": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8twso6/",
      "text": "You can have fun AND be safe! For some reason we’ve made them separate but going on a rollercoaster with the bars down doesn’t mean it’s not fun.",
      "author": "strawberrysweetpea",
      "created": 1628887954,
      "upvotes": 5,
      "replies": {}
    },
    "h8trj63": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8trj63/",
      "text": "Ya’ll, I work with an org who mentors college students essentially. We work with a fairly large student population and every. single. year. someone dies from a drinking accident. We almost went a year without a drinking death until a student was struck and killed from a drunk driver. The worst will happen, don’t let it be you. And notice I said drinking accidents, because that’s what they often are simple accidents. So be safe, be smart, and do those best practices like knowing what drink you can handle and how many, sleeping on your side, having a buddy, etc etc etc. trust me, drinking is wayyyyyy more fun, when you’re not having accidents while pushing the limit.",
      "author": "Climboy55",
      "created": 1628885967,
      "upvotes": 58,
      "replies": {
        "h8u2ldr": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u2ldr/",
          "text": "Is there any chance I can be a mentee with your organisation? What drinking advice do you have for this thread",
          "author": "Alone-Ingenuity7669",
          "created": 1628890291,
          "upvotes": 8,
          "replies": {
            "h8uz5ah": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uz5ah/",
              "text": "Unfortunately not, we are only in specific regions and work with specific student populations, we also start students in the program beginning at the college application and selection process as this stage has so much impact on the rest of the college experience. You can almost assuredly find a peer mentoring program of some kind though at your university or in the community. Ultimately, all I am to students is someone they have rapport with who can help them figure out where to get resources and support, and you can find that in a lot of people outside of formal programming.\n\nAs for drinking, there’s a lot of advice, so just take this as adding to the chorus, not some kind of authoritative knowledge. Realize that your drinking habits is a relationship between alcohol, your body, and mind; not one of those things are the same between different people, so you just have to learn how your body and mind reacts to alcohol. My honest recommendation is to find a beer and/or wine and/or cocktail that you enjoy. Personally I drink PBR’s and Gin and Tonics always. By doing this you can get a sense of where you normally are per drink (for me 2 g&ts I’m buzzed, 3-4 I’m drunk, never pass 5 unless I’ve been drinking for more than six hours), and doing this gives you an idea if your drink was poured strong or not and you can adjust accordingly. Learn how you handle shots. If you’re new to drinking ease into it and learn your limits. Drink water throughout the night and after you’re finished. Always drink with friends and keep checking in with each other. Plan ahead with your friends and make sure everyone knows what to do if something happens, or when you want to be cut off, if you plan on going home with anyone, coordinate safe words, etc. Sleep on your side. Make your own drinks or leave it to a bartender. Don’t accept others drinks. Don’t leave your drink. Acknowledge and address the disparities in unwanted drinking incidents between different identities. Don’t mix booze with drugs. For those that will inevitably try to get crossfaded, don’t, but get high first and then sip some beers until desired effect is reached, but don’t. Don’t. Ever. Drive. After. Drinking. It’s ok to ask others if your drinking habits are healthy, a lot of us had to relearn what healthy drinking habits are in quarantine and checking in with trusted people is ok. Acknowledge that anyone can be susceptible to alcoholism and alcohol abuse. It’s not a reflection of someone’s character and it should be treated with empathy. If people are reaching out to you about your habits be empathetic of their intentions, if you’re reaching out to someone about their habits, be empathetic of their position. When in doubt, ask questions. Just be mindful.",
              "author": "Climboy55",
              "created": 1628905450,
              "upvotes": 15,
              "replies": {}
            }
          }
        }
      }
    },
    "h8tqquw": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tqquw/",
      "text": "You should also at least understand your schools policies related to underage alcohol and or drug use so you know what your consequences might be if you get in trouble.",
      "author": "obsessiveostritch",
      "created": 1628885663,
      "upvotes": 20,
      "replies": {}
    },
    "h8tm7pl": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tm7pl/",
      "text": "I just want to put it out there that weed doesn't give you hangovers, make you black out, poison you, or make you loose control over your actions. Also feels way better than alcohol imo",
      "author": "Stonedmagus",
      "created": 1628883910,
      "upvotes": 1,
      "replies": {
        "h8tw897": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tw897/",
          "text": "Weed good alcohol bad",
          "author": "bodak_red",
          "created": 1628887739,
          "upvotes": 19,
          "replies": {
            "h8v1jcz": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v1jcz/",
              "text": "Exactly",
              "author": "freshguy2002",
              "created": 1628906635,
              "upvotes": 1,
              "replies": {
                "h8v5vvo": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v5vvo/",
                  "text": "You aren’t wrong but it’s becoming a circle jerk",
                  "author": "bodak_red",
                  "created": 1628908785,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "h8v54nz": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v54nz/",
          "text": "100% agree. HOWEVER please use weed in moderation. I’m a huge stoner, I smoke every day, I have learned to be able to do my work and have a nice session with my friends at the end of the day. But many fellow stoners dropped out, failed out, never went to class to smoke and it can be a nasty habit, I know from experience. But tbh I’ll smoke til the day I die so I don’t take my own advice lmfaooo",
          "author": "smelltheskinny8",
          "created": 1628908406,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h8tl6ru": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tl6ru/",
      "text": "Also, keep an eye on when, where, how much, how often, and why you drink. Alcohol abuse isn't limited to party animals or binge drinkers and it's a lot harder to quit than it is to catch yourself.",
      "author": "Welpmart",
      "created": 1628883506,
      "upvotes": 98,
      "replies": {
        "h8vjvdi": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vjvdi/",
          "text": "Yep. There’s a massive difference between drinking when you’re out with your friends and drinking alone because you’re bored or stressed or upset. Drinking alone is not a good sign, even if you aren’t binge drinking.",
          "author": "cvanguard",
          "created": 1628916572,
          "upvotes": 27,
          "replies": {}
        },
        "h8voybe": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8voybe/",
          "text": "The general rule I follow is: Drinking for fun and recreation, if the amount itself isn’t harming you and it’s not acting as the catalyst for separate dangerous behavior, is probably fine. Drinking as a way of escaping bad feelings or making them easier to deal with is the start of unhealthy behavior.",
          "author": "secondpriceauctions",
          "created": 1628919933,
          "upvotes": 18,
          "replies": {
            "h8xe4t2": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xe4t2/",
              "text": "I follow the same rule. I've convinced myself that alcohol is for hype fun times. When I get caught up in bad thoughts, I drink a lot of caffeine instead. Makes me anxious, but it satisfies the lizard brain that just wants to feel *anything* different, and it's not going to ruin my life.",
              "author": "alapleno",
              "created": 1628958999,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h8tkgu9": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tkgu9/",
      "text": "Adding to this with an unpopular opinion: before you get to college, you should try and get drunk a few times with trusted family and friends. You don’t want to be drunk for the very first time around people you just met. Get comfortable with drinking in a safe environment before you get drunk at a frat party.",
      "author": "Muhammad-The-Goat",
      "created": 1628883222,
      "upvotes": 387,
      "replies": {
        "h8ug327": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8ug327/",
          "text": "Yes! I learned how to drink with my parents and I'm very thankful for that.",
          "author": "Suspicious_Tea4220",
          "created": 1628896204,
          "upvotes": 77,
          "replies": {
            "h8v5i9v": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v5i9v/",
              "text": "As a college prof, I started my kids out young and will continue to permit them to drink alcohol in moderation in the house. When they get older, I'll may get them drunk before they move out. (And may get me drunk after they do :).)\n\nI've seen what binge drinking can do to ruin a student's life, and while it isn't always the case, it seems like those who have come from very restrictive households can end up with the worst of it, since they are new to everything.",
              "author": "halavais",
              "created": 1628908596,
              "upvotes": 53,
              "replies": {}
            }
          }
        },
        "h8umx40": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8umx40/",
          "text": "This. Learned with family, had a little humiliating of an experience, never got that drunk again. Served its purpose.",
          "author": "throwaway_pineapple_",
          "created": 1628899417,
          "upvotes": 34,
          "replies": {}
        },
        "h8xg0u9": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xg0u9/",
          "text": "I’ve seen kids not say they drank for the first time and try to keep up. 6 drinks can get you pretty bad if it’s your first time but it’s an easy night for others.",
          "author": "beansguys",
          "created": 1628959810,
          "upvotes": 4,
          "replies": {}
        },
        "h8y8tms": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8y8tms/",
          "text": "Actually, studies show this is not good",
          "author": "FlameBagginReborn",
          "created": 1628972637,
          "upvotes": 2,
          "replies": {
            "h8y99wh": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8y99wh/",
              "text": "Interesting, you got a link to an article summarizing a study for it?",
              "author": "Muhammad-The-Goat",
              "created": 1628972843,
              "upvotes": 1,
              "replies": {
                "h8y9z8p": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8y9z8p/",
                  "text": "https://drugfree.org/newsroom/news-item/myths-debunked-underage-drinking-of-alcohol-at-home-leads-to-real-consequences-for-both-parents-and-teens/\n\nThis is a simple breakdown of it. If you want any more info let me know!",
                  "author": "FlameBagginReborn",
                  "created": 1628973159,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h8tjfu9": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tjfu9/",
      "text": "Also, be aware of the signs of alcohol poisoning and know when to intervene. Hospitals do not care if you're under 21, they just want to help. Lastly, I think we should all take the responsibility of looking out for women who could potentially be taken advantage of. Keep an eye out for guys who are handsy and hovering around extremely drunk and incapacitated women.",
      "author": "Premedpotato",
      "created": 1628882822,
      "upvotes": 614,
      "replies": {
        "h8twvt4": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8twvt4/",
          "text": "Got frighteningly close to losing a relative to alcohol poisoning because her college buddies, all close friends including a sober designated driver, were more concerned with getting back to the dorm without getting in trouble than they were with making sure that she was really okay. Not a malicious act, but an inexperienced one. Play it safe.",
          "author": "ThirtyNaught",
          "created": 1628887988,
          "upvotes": 172,
          "replies": {
            "hcektf7": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/hcektf7/",
              "text": "Pretty sure there’s some laws in some states where there’s immunity if someone calls 911 or something. That way it doesn’t incentivize people to not reach out for help.",
              "author": "spicyjalapenoman",
              "created": 1631338741,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h8u2b4g": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u2b4g/",
          "text": "Many states have laws specifically protecting people who call EMS from arrests or charges related to things like drug use or underrage drinking. Check your individual state laws but they're pretty common and very important to know in an emergency situation",
          "author": "mocacola15",
          "created": 1628890173,
          "upvotes": 81,
          "replies": {
            "h8un7d1": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8un7d1/",
              "text": "Usually called a Good Samaritan policy. Many universities have them too if you report to their security/public safety.",
              "author": "throwaway_pineapple_",
              "created": 1628899552,
              "upvotes": 41,
              "replies": {
                "h8vdb54": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vdb54/",
                  "text": "good samaritan (in most places so i could be wrong on this) only protect non healthcare provider when they’re trying to help a situation.",
                  "author": "17xcms",
                  "created": 1628912679,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        },
        "h8u5gcu": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u5gcu/",
          "text": "Yes and most (?) universities have some kind of amnesty laws so that you won't get in trouble for being drunk/high on campus if you call for help",
          "author": "emomotionsickness2",
          "created": 1628891492,
          "upvotes": 30,
          "replies": {
            "h8v5oun": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v5oun/",
              "text": "Also, as a residence life professional who serves on duty and enforces policies against underage drinking I can tell you that if I get a call from someone worried that their friend/ roommate/ whoever may be in physical danger of possible death, my first thought isn’t to make the person who called recite the alphabet backwards or walk in a straight line while touching their nose to test how drunk *they* might be. \n\nMy priority is to get help to the person who needs it. I likely would only interact with the person who called to get all relevant information, not to interrogate them or “get them in trouble.”\n\nWe want students to make the call to help each other. We don’t want a death on campus. If you make that call, it’s so unlikely you would face any repercussions at the vast majority of universities. \n\nAnd even if you did, it would likely be one online alcohol safety course and that’s it. That’s a lot better than letting a friend die.\n\nI really can’t stress this enough. Please call to get help for friends and peers in need, even if you’re scared.",
              "author": "aattanasio2014",
              "created": 1628908689,
              "upvotes": 26,
              "replies": {}
            }
          }
        },
        "h8udhkb": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8udhkb/",
          "text": "Not just for college students but please tell your health providers (EMS, doctor, etc.) if you drink alcohol regularly or do street drugs. It really helps with treatment, medicine can conflict, and like most people said, I don't believe they can tell police.",
          "author": "llamaintheroom",
          "created": 1628895021,
          "upvotes": 28,
          "replies": {
            "h8wque5": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8wque5/",
              "text": "yes!! drinking alcohol can cause life-threatening side effects with some medications!",
              "author": "Cali-wildflowers",
              "created": 1628948373,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "h8uvb00": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uvb00/",
          "text": "Seconding this. If your friend is passed out drunk and has blue lips, call the hospital. Also I used to work with a university, we have purposely not busted people for drinking who came to us for help.",
          "author": "TheManicMonocle",
          "created": 1628903550,
          "upvotes": 14,
          "replies": {}
        },
        "h9361fk": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h9361fk/",
          "text": "Watch out for ANYONE who could be taken advantage of. Not just women, rape, SA, etc. are universally damaging.",
          "author": "Own_Albatross3087",
          "created": 1629067726,
          "upvotes": 3,
          "replies": {
            "h9362ej": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h9362ej/",
              "text": "\nHello! You have made the mistake of writing \"ect\" instead of \"etc.\"\n\n\"Ect\" is a common misspelling of \"etc,\" an abbreviated form of the Latin phrase \"et cetera.\" Other abbreviated forms are **etc.**, **&c.**, **&c**, and **et cet.** The Latin translates as \"et\" to \"and\" + \"cetera\" to \"the rest;\" a literal translation to \"and the rest\" is the easiest way to remember how to use the phrase. \n\n[Check out the wikipedia entry if you want to learn more.](https://en.wikipedia.org/wiki/Et_cetera)\n\n^(I am a bot, and this action was performed automatically. Comments with a score less than zero will be automatically removed. If I commented on your post and you don't like it, reply with \"!delete\" and I will remove the post, regardless of score. Message me for bug reports.)",
              "author": "ectbot",
              "created": 1629067738,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h8tje9t": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tje9t/",
      "text": "Absolutely. I never drank or smoked in high school, college changed a lot of things for me. I’ve had such a great experience but I can not stress enough, POUND THAT WATER! Hell, eat some bread. If you can, even before you go to bed. Hangovers suck, but you’ll survive. Honestly nothing like a good glass of OJ.\n\nBut everyone’s different. If it’s you’re first time like it was for me and if you’re curious, I’d say don’t abstain. College is for trying new things. But of course, drink responsibly!",
      "author": "hottubofpee",
      "created": 1628882804,
      "upvotes": 66,
      "replies": {
        "h8vybxf": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8vybxf/",
          "text": "CAN CONFIRM: Bread and water is the best cure for when : A: You are super drunk, or, B: You are super hungover. Also, take an anti acid like Tums and maybe drink something with electrolytes!!",
          "author": "kaitsavage",
          "created": 1628927196,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h8tig3v": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tig3v/",
      "text": "I live in the neighborhood of a mid-sized state university and have worked there for several years. On more than one occasion, a new freshmen doesn't finish the first semester because they get drunk and walk out in front of a car on a busy road. Parents send their precious child to school and their freshman is dies in the first two weeks of their first semester. \n\nI get the coolness of drinking and partying and sometimes it feels good. But think of it this way: if you are 18, you will be 21 in three years, and then will be over 21 for the rest of your life.",
      "author": "lilydlux",
      "created": 1628882425,
      "upvotes": 38,
      "replies": {
        "h8v47av": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v47av/",
          "text": "You know how teaching kids abstinence will only make them wanna have sex? Same thing with drinking. You can preach safe drinking and you can go over the consequences of underage drinking but they’ll still do it",
          "author": "smelltheskinny8",
          "created": 1628907953,
          "upvotes": 11,
          "replies": {}
        },
        "h8tvtd8": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tvtd8/",
          "text": "Waiting till 21 defeats the whole point. Half the reason kids drink is to break the rules. \n\nEdit: pissed off the mormons lol",
          "author": "bodak_red",
          "created": 1628887581,
          "upvotes": 32,
          "replies": {}
        },
        "h8tns8n": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tns8n/",
          "text": "Last paragraph is unbelievable. I don’t really know a single person my age (under 21) that doesn’t drink regularly, or at the very least hasn’t drank before. Did you have any friends whatsoever? This is very alien to me to hear someone actually follow or believe in the over 21 rule.",
          "author": "EvilBob_RapePants_",
          "created": 1628884513,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "h8tgesa": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tgesa/",
      "text": "For real. Sometimes I see people so drunk that they are taking a shit out in public, an ambulance transporting someone too drunk, people being used as a dart chart, etc.\nIf your gonna drink at least respect yourself and your dignity.",
      "author": "ElBarro69",
      "created": 1628881589,
      "upvotes": 20,
      "replies": {}
    },
    "h8tejso": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tejso/",
      "text": "It's not that deep people just fuckin' send it",
      "author": "KING_COVID",
      "created": 1628880835,
      "upvotes": 27,
      "replies": {
        "h8v8oqv": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v8oqv/",
          "text": "Yea lmao just use common sense and don’t do 10 shots in an hour haha",
          "author": "charlesdickinsideme",
          "created": 1628910209,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8tax3o": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tax3o/",
      "text": "Coming from a country where it's legal to drink even in high school, how punitive is the drinking age of 21 as a freshman? How easy is it to obtain alcohol and get away with it?",
      "author": "132kimh",
      "created": 1628879373,
      "upvotes": 103,
      "replies": {
        "h8tcfxn": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tcfxn/",
          "text": "It's not uncommon for freshmen to be drinking because older friends gave them some, but if you're caught drinking underage, the punishment depends on how strict the police are in your town, city or university are.",
          "author": "fruitninja777",
          "created": 1628879984,
          "upvotes": 123,
          "replies": {
            "h8tngjc": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tngjc/",
              "text": ">not uncommon \n\n\nThat is an understatement. Even the nerds drink a decent bit.",
              "author": "EvilBob_RapePants_",
              "created": 1628884389,
              "upvotes": 80,
              "replies": {
                "h8tnzde": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tnzde/",
                  "text": "Decent bit? I'd be surprised if they weren't getting more plastered than those who go out to party.",
                  "author": "wherearetheturtlles",
                  "created": 1628884590,
                  "upvotes": 40,
                  "replies": {
                    "h8todte": {
                      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8todte/",
                      "text": "True, alcoholism is actually strongly associated with higher intelligence. Many alcoholic lawyers and bankers and such. \n\n\nHowever, the most nerdy people that I am friends with will usually just have a couple drinks max.",
                      "author": "EvilBob_RapePants_",
                      "created": 1628884748,
                      "upvotes": 15,
                      "replies": {
                        "h8u7w1q": {
                          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u7w1q/",
                          "text": "In my department of my university, and as a freshman last year, you’ve got the partiers who would pre game at home and be just shy of blacking out every Friday and Saturday.\n\nThen there’s the other half of us that don’t have the time to get in such a mess all the time, so we  instead just plan a small handful of nights to get plastered on.",
                          "author": "Zach_Hutch",
                          "created": 1628892539,
                          "upvotes": 11,
                          "replies": {
                            "h8uen0w": {
                              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uen0w/",
                              "text": "First paragraph is pretty much me, except include some weekdays in that. Also have gotten better at not blacking out by limiting myself to a certain amount of drinks. I’ve even begun ordering an ice water at the bar to help with hydration/sobering up and will tell anyone who asks that I am drinking water without shame.",
                              "author": "EvilBob_RapePants_",
                              "created": 1628895543,
                              "upvotes": 4,
                              "replies": {
                                "h8uywbn": {
                                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uywbn/",
                                  "text": "I’m personally in the second group. 9 hours of class and then work most evenings doesn’t leave a lot of time for lacking sobriety.",
                                  "author": "Zach_Hutch",
                                  "created": 1628905325,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h8ul31g": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8ul31g/",
                  "text": "Well I didn’t want to make us look like we’re all alcoholics blackout drunk 24/7",
                  "author": "fruitninja777",
                  "created": 1628898534,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "h8thffw": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8thffw/",
          "text": "stupidly easy to get stuff. couple skeezy liquor stores don't ID and everyone has fakes or older friends.",
          "author": "Fibrox",
          "created": 1628882008,
          "upvotes": 39,
          "replies": {
            "h8xf0pu": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xf0pu/",
              "text": "There's always a friend of a friend as a last resort, lol",
              "author": "alapleno",
              "created": 1628959380,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "h8tkanj": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tkanj/",
          "text": "My college was super strict. You could lose your financial aid if you were caught drinking and if it was a repeated offense you would get kicked of campus. You could also still be fined a $100 dollars for merely being in the presence of others underage drinking. However, it does not really deter drinking just makes people less likely to reach out for help in iffy situations.",
          "author": "apawneecitizen",
          "created": 1628883156,
          "upvotes": 28,
          "replies": {}
        },
        "h8um66y": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8um66y/",
          "text": "Getting alcohol is easy. Getting caught with it...can suck *a lot* depending on who catches you. I was rafting down a river at age 19 and was seen by police drinking a beer. I had to pay hundreds of dollars in fines and court costs and got my driver's license suspended for a year. Had to pay a reinstatement fee *and* had to pay for and take a remedial driver's education class *and* had to retake my driving tests before they gave my license back to me. And now it shows up in every background check for every job for the rest of my life unless I pay to get it expunged.\n\nMost expensive beer of my life...",
          "author": "NoviceElectromancer",
          "created": 1628899054,
          "upvotes": 23,
          "replies": {
            "h8xg0ip": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xg0ip/",
              "text": "Damn, that's so unfair. Why did they suspend your license? Does a raft count as a vehicle?",
              "author": "alapleno",
              "created": 1628959806,
              "upvotes": 1,
              "replies": {
                "h8xi62j": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8xi62j/",
                  "text": "No idea whether it was because I was on the raft or that was how they handled Minor in Possession charges generally. But I have also always suspected that race had something to do with it...I was in rural Missouri outside a town of 500. From what I could see, I was the only non-white person for hundreds of miles.",
                  "author": "NoviceElectromancer",
                  "created": 1628960734,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "h8tw207": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tw207/",
          "text": "The law can be pretty punitive, police will charge minors with Minor in Possession. But it is extremely easy to obtain alcohol, and there is no less college drinking in the US than in other countries",
          "author": "bodak_red",
          "created": 1628887672,
          "upvotes": 6,
          "replies": {}
        },
        "h8v9d6y": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v9d6y/",
          "text": "It’s insanely easy and common, but the punishment depends on how strict your state laws, local police, and university are. Most underclassmen can get alcohol from older friends or from other underage people who have older friends. Many have fake IDs, and there are a lot of places around most college campuses that aren’t very strict about checking them. It’s also easy to get alcohol at parties as it’s usually publicly available to whoever shows up.",
          "author": "m-is-for-music",
          "created": 1628910562,
          "upvotes": 5,
          "replies": {
            "h8va78r": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8va78r/",
              "text": "I'm more of a private, at home drinker with only a few people. I guess I won't have to worry about getting caught? Is that how it works? I guess I'll have to worry more about how to obtain it",
              "author": "132kimh",
              "created": 1628910993,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h8tndgw": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tndgw/",
          "text": "Pretty much everyone under the age of 21 drinks regularly. Fake ID’s are very common - just about all of my friends have one. Can also get an older friend or sibling to buy for you. Sometimes parents will even buy alcohol for people for special events.",
          "author": "EvilBob_RapePants_",
          "created": 1628884356,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "h8t5es0": {
      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8t5es0/",
      "text": "The best way to avoid this is to not drink at all, everyone thinks that they're the responsible drunker until they black out or throw up everywhere. You won't miss anything by not drinking, just don't",
      "author": "cowfishAreReal",
      "created": 1628877130,
      "upvotes": -6,
      "replies": {
        "h8tltm9": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tltm9/",
          "text": "As a nondrinker, I agree to an extent, but because some people will, I think it makes sense to advise them and reduce harm. More importantly, I was raised by Southern Baptists and I can tell you that blanket bans on drinking can be harmful in encouraging an all-or-nothing, black and white mentality around alcohol.\n\nI'd certainly advise anyone with a family history of alcoholism, substance abuse, or addictive personalities to steer clear, but for the rest of us, it seems impractical.",
          "author": "Welpmart",
          "created": 1628883758,
          "upvotes": 11,
          "replies": {
            "h8tm1bc": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tm1bc/",
              "text": "I'm certainly not talking about banning it, im just advising people to not do it. I know bans don't do anything",
              "author": "cowfishAreReal",
              "created": 1628883842,
              "upvotes": 8,
              "replies": {
                "h8tm73q": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tm73q/",
                  "text": "Miswording on my part—perhaps should have said prohibition.",
                  "author": "Welpmart",
                  "created": 1628883904,
                  "upvotes": 1,
                  "replies": {
                    "h8tmiwg": {
                      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tmiwg/",
                      "text": "I'm also not talking about prohibition, I just said that the best way to avoid the problems OP mentioned is not drinking at all, witch is true, if people still want to drink ill make no attack at stopping them",
                      "author": "cowfishAreReal",
                      "created": 1628884031,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h8t8dbw": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8t8dbw/",
          "text": "I don’t think it’s helpful to shun drinking completely. Most people will drink in college and most adults will consume alcohol through their lives. I think it’s more helpful to develop responsible drinking habits when you first begin doing it, around college freshman age",
          "author": "mcquago",
          "created": 1628878333,
          "upvotes": 45,
          "replies": {
            "h8td0m4": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8td0m4/",
              "text": "Just because most people do it it doesn't mean it's a good idea",
              "author": "cowfishAreReal",
              "created": 1628880218,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "h8tdlhc": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tdlhc/",
          "text": "Not true, I’m a responsible drinker. You just gotta know your limit it’s really not that hard",
          "author": "BylvieBalvez",
          "created": 1628880451,
          "upvotes": 13,
          "replies": {}
        },
        "h8tr8oi": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tr8oi/",
          "text": "Some things are just best remaining unsaid. You're going to offend everyone by proposing any alternative opinion that deviates from the norm. In the end it's up to that individual to determine the choices they make in life. I myself, am completely fortunate that I was never into the whole \"cool kid\" culture--feeling like I need to get \"wasted\" just to fit in. I've never seen the purpose of alcohol, and frankly I don't think I'm missing out on much.",
          "author": "somethingfromnoth1ng",
          "created": 1628885855,
          "upvotes": 6,
          "replies": {
            "h8v1yit": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v1yit/",
              "text": "do you actually think everyone gets fucked up just to fit in?",
              "author": "freshguy2002",
              "created": 1628906845,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "h8t7977": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8t7977/",
          "text": "ehh pretty biased, drinking can be great if you're safe about it. just because you dont drink doesnt mean everyone shouldnt drink",
          "author": "freshguy2002",
          "created": 1628877873,
          "upvotes": 18,
          "replies": {}
        },
        "h8te18s": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8te18s/",
          "text": "Yeah, I feel like it shouldn't be a difficult decision not to drink, since your liver will thank you in the end too. I don't plan on doing any underage drinking at all my first year, and I don't plan on drinking when I am 21. I don't understand what people get out of it.",
          "author": "Dixon-726",
          "created": 1628880626,
          "upvotes": 8,
          "replies": {
            "h8tht8x": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tht8x/",
              "text": "I didn't understand either until I tried it. I don't like getting drunk to the point of incoherence at all, but when you pace yourself nicely and just get a good buzz going, it honestly makes social events a LOTTTT more fun. Truly is a social lubricant. What I'm describing though is completely separate from drinking until you throw up everytime like a lot of people do. That's stupid.",
              "author": "freshguy2002",
              "created": 1628882166,
              "upvotes": 12,
              "replies": {
                "h8tikwr": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tikwr/",
                  "text": "Hm, to each their own, I guess. It's just not my cup of tea and I'm not that sociable to begin with, so it doesn't matter to me.",
                  "author": "Dixon-726",
                  "created": 1628882480,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "h8tgt4g": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8tgt4g/",
              "text": "Most people just want to drink to feel like they fit in",
              "author": "hotglue0303",
              "created": 1628881753,
              "upvotes": -1,
              "replies": {
                "h8ti5bp": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8ti5bp/",
                  "text": "Eh, I don't really care about fitting in, especially when it involves doing something that will harm me more than help me, so it doesn't matter to me.",
                  "author": "Dixon-726",
                  "created": 1628882304,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "h8txt5g": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8txt5g/",
          "text": "What are you, Mormon?",
          "author": "bodak_red",
          "created": 1628888340,
          "upvotes": 2,
          "replies": {
            "h8uwt2q": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8uwt2q/",
              "text": "What are you, an alcoholic?",
              "author": "Comrade_Corgo",
              "created": 1628904283,
              "upvotes": 1,
              "replies": {
                "h8v0fiy": {
                  "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v0fiy/",
                  "text": "Nah more of a stoner",
                  "author": "bodak_red",
                  "created": 1628906087,
                  "upvotes": 1,
                  "replies": {
                    "h8v1453": {
                      "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8v1453/",
                      "text": "Same",
                      "author": "Comrade_Corgo",
                      "created": 1628906426,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h8u297d": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8u297d/",
              "text": "Atheist",
              "author": "cowfishAreReal",
              "created": 1628890150,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h8urttf": {
          "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8urttf/",
          "text": "> You won't miss anything by not drinking\n\nExcept for a good time",
          "author": "Datyoungboul",
          "created": 1628901823,
          "upvotes": 3,
          "replies": {
            "h8urvla": {
              "link": "/r/college/comments/p3qa3r/just_a_reminder_for_incoming_freshman_to_make/h8urvla/",
              "text": "I have a good time without drinking",
              "author": "cowfishAreReal",
              "created": 1628901848,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634057608
}