{
  "sid": "q2vin4",
  "link": "/r/college/comments/q2vin4/starting_college_at_20_and_if_i_can_attend_a/",
  "title:": "Starting College at 20 and If I can attend a university instead of community college. advice greatly appreciated",
  "text": "I'm looking to finally go off to college after being held down by a deep depression throughout my teens, however I'm not sure how to properly go about this given my situation\n\nI did poorly in highschool, but I'm not a fool. I didn't do my school work. I didn't prepare for tests. At that point of my life, the only thing I thought about was just finishing school. Hating every minute practically.\n\nI did graduate highschool, just barley, with around a 1.9/2.0 gpa. Embarrassing but I was at some of the lowest points of my life mentally. I've spent these past couple years since, working a full time job consistently, and figuring out how to believe in myself more. I just overall feel like I'm more mature now to focus on the pursuit of a degree. \n\nSo my question to you all now is, can I go away to a university instead of a community college. Rent an apartment with some roommates as a 20 year old freshman? \n\nIve currently just been renting a room from my grandparents the past couple months, out of having nowhere else to live, and it's already becoming very taxing on them. They've told me a couple of times they wished I'd moved away to Florida with a friends family I used to rent from (not a lot of love in my family) \n\nIs there any way to make this happen by the next semester? Please and thank you in advance",
  "author": "Vlasic_Pickle",
  "created": 1633560643,
  "updated": 1634083682,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hfnzuwa": {
      "link": "/r/college/comments/q2vin4/starting_college_at_20_and_if_i_can_attend_a/hfnzuwa/",
      "text": "Honestly you should do a community college first, it's cheaper by far, and are better equipped for helping students that had a hard time in high school. \n\nYou might be able to skip that like you want, but you need to fill out your FAFSA right now and start applying to universities. You should also probably email the universities you're interested in to ask if they will even accept a starting semester in spring, they may make you wait until fall even if they do accept you. So get off reddit and start contacting them.",
      "author": "SouthernRhubarb",
      "created": 1633563329,
      "upvotes": 2,
      "replies": {}
    }
  }
}