{"sid": "jocb21", "link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/", "title:": "Professors that are assigning group work during these trying times, why?", "text": "Many of us are already bogged down with a heavy workload. Many of us are barely keeping our heads above water. Many of us are beginning to sink with a little over a month left in the fall session.\n\nWhy assign group work when stress levels are at an all-time high? Personally, I don’t want to be responsible for another person’s grades. Is it because you want some interaction between your students?", "author": "FreshPrinceAV", "created": 1604550361, "retrieved": 1632946790, "over_18": false, "upvotes": 2236, "upvote_ratio": 0.98, "comments": {"gbcareh": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gbcareh/", "text": "My college has zero group work. \n\nAll assignments are individual. Now this may seem good to some but they made projects that would normally be groups or suited to groups to be individual. The stress and load of work makes it not worth the trouble for me and others as well. Also in groups you get to interact which at least is a good thing during such times. I haven’t spoken to any classmate since Feb.", "author": "bhippie950", "created": 1604668249, "upvotes": 1}, "gbb5i14": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gbb5i14/", "text": "Because it's effective. It works.\n\nYes, times are trying, but instead of expecting people to make things easier for you, maybe you should consider withdrawing and taking a semester off if you're having such a hard time.", "author": "raxo06", "created": 1604635112, "upvotes": 2}, "gbavhpw": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gbavhpw/", "text": "Lots of opinions have already been shared, but I wanted to add to the fire.\n\nAnother professor's opinion - most of the work my students will ever do will involve dealing with other humans.  The sooner you learn how to deal with groups, the better.  At the same time, it's not fair for a professor to expect a bunch of 20-year olds to know how to work well with others, so I teach them how to do it.  \n\n* You must set ground rules at the onset of a group project - what's acceptable, what's not.\n* You must practice accountability & responsibility - someone doesn't pull their weight, talk to them.  Engage in respectful conflict.  They continue to do it, turn them in.  I've started to really enjoy giving zeros for that one person who thinks s/he can skate by.\n* Learn how to \"storm\".  Conflict is critical to success.  Companies that focus on change and innovation have figured out how to engage in respectful conflict.\n* Group time management is a special skill set.  I recommend Kanban boards.  They're super easy to learn.  You can't procrastinate the same way in a group project that you do in individual assignments.\n\nI do not assign group projects because it's easier to grade (mine are not); I do not copy/paste from previous semesters (I tend to change assignments every other semester anyways).  And the entire planet had to figure out remote, group work, so saying \"online school shouldn't have group projects\" is bad logic.  No one got that choice this year in the professional world, so use your school years to learn how to do well with lowered stakes.  (Yes I'm biased, but grades are dumb.  But it's still better to fail in school than to fail at your job and be fired).\n\nYes - it's frustrating.  But you should never assume it gets easier just because you graduate.  The same people in your group now will go out into the world and still suck at group works.  There's no magical fix that occurs at graduation.  It doesn't get easier, you just get better at handling it.", "author": null, "created": 1604630079, "upvotes": 3}, "gbaq12d": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gbaq12d/", "text": "That’s f’d up.", "author": "flipturnca", "created": 1604627435, "upvotes": 2}, "gbalrbh": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gbalrbh/", "text": "# PLEASE SAY THIS IN YOUR EVALUATIONS!!    Admin is always telling us to \"do more group work.\"\n\nWHY?  It seems to me that 2 people out of the group wind up doing all the work, and then some other idiot plagiarizes his bit and the whole thing gets fucked up.PLEASE -- IF YOU DON'T LIKE GROUP WORK, LET OUR BOSSES KNOW!  \n\n\nSincerely,  \na professor who hates group work too", "author": "emarcomd", "created": 1604625346, "upvotes": 1}, "gbae4sw": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gbae4sw/", "text": "On god. I just had a group project due on Tuesday. One of teachers decided that our *midterm* should be a group project, and guess who did *literally* all of the work? Me, that’s who. I spent several hours filling out the entire presentation and coming up with all the info because nobody else was getting back to me and it needed to get done. That is, of course, until the last two days before it was due, when the other guys who hadn’t been participating suddenly *really* wanted to “do their part.” I let them record the audio because I didn’t have the time but I gave them all of the information so all they had to do was read it and press a button. I didn’t even get to see it before they turned it in. I hate group projects . . .", "author": "divine_trash_4", "created": 1604621618, "upvotes": 4}, "gba91je": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gba91je/", "text": "Me looking at my 2 group computer science projects........", "author": "shortlilgirl", "created": 1604619356, "upvotes": 2}, "gba83iu": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gba83iu/", "text": "The real world is full of “group work.” It is a good, and necessary part of your education to prepare you for that.", "author": "HammMcGillicuddy", "created": 1604618889, "upvotes": 2}, "gba6zr5": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gba6zr5/", "text": "Mind asking my English professor this? I just got told this week that my next project in his class is group work. I’ve already kind of experienced it in peer reviews of papers he makes us do and...yikes. I already know I’ll be pulling more than my fair share of work on this project. Hurray online school!", "author": "crazychica5", "created": 1604618352, "upvotes": 1}, "gba30nr": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gba30nr/", "text": "Agreed!! Group projects are the worst!! My professor assigned a group project of 6 people that’s due next week and we barely started.. I messaged my group and only one person replied like wtf.. I even took initiative and made the PowerPoint and included everyone name on it. The professor didn’t even put us in breakout rooms to get contact information and expect us to reach out to our group by ourselves.", "author": "TheAkatsuki8", "created": 1604616461, "upvotes": 1}, "gba263v": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gba263v/", "text": "I truly don’t get it. My professor assigned us a project that she usually makes individual, but due to COVID- she made it a GROUP assignment????  The project was to write a 4 page report and make a slideshow. \n\nMy group was really good about responding group texts at first, but when it came to actually getting started on the report- they kept making excuses as to why they couldn’t work on it. \n\nSo, I gathered all the resources for the paper and wrote it in addition to still turning in homework assignments for other classes. I told them to summarize the info from the paper into a slideshow and they COPY AND PASTED the entire report onto 4 slides for our video meeting. \n\nWe just turned in the project and none of them even told me thank you for hard carrying them. smh", "author": "tincantran", "created": 1604616056, "upvotes": 2}, "gb9zi2l": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb9zi2l/", "text": "Because if we don’t assign group work, the other half of the class bitches.", "author": "AntiquePangolin", "created": 1604614786, "upvotes": 1}, "gb9pgcu": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb9pgcu/", "text": "Professor here. \n\nSome departments require a certain number of classes to have group work, so your professor may not have any choice. Other times there are course co-ordinators who are specifying it.\n\nI get that group work can be awful. In grad school we had group work in every class, and the first day of class I'd look around, see who was competent in class, and immediately form a group with them. Not everyone was so lucky. But when I became a professor, I started to understand why there were so many group projects.\n\nYes, interaction between students is important. It's part of what you're going to college for -- making connections with other students and faculty. Group work is just one of many ways to do that. It's also important to learn to work as part of a group -- you'll do a lot of group work throughout your life, and it's not always with people who pull their weight.\n\nGroup projects also allow a professor to assign a larger, more interesting project than otherwise could be assigned. (Yes, that does depend on everyone doing their part.) \n\nAnd, let's be honest, if I'm teaching 90 students this semester, it's a lot easier to grade 30 projects in the week between finals and when grades are due than it is to grade 90. And remember a lot of your teachers are part-time faculty (thanks, university budget cuts!) who are teaching at multiple schools or also hold down a full-time day job to make ends meet, and budgets for TAs to help grade have been slashed too. (thanks again, university budget cuts!)\n\nAll that said, group work can definitely be improved. I usually set a maximum number of groups and I'll take and allow some of those to be single person groups -- that seems to cut down on the friction of \"having to take this person no one else would partner with\". (I've also noted that the single person groups usually have the worst projects. Go figure). I also give each group an option to split up if things aren't working out -- no one has taken me up on it. I'm always on the lookout for other improvements, but these two things seem to solve most of the complaints students have had -- the group work usually gets really positive feedback on my reviews, so something is going right.", "author": "Scary-Boysenberry", "created": 1604610115, "upvotes": 3}, "gb9ib2y": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb9ib2y/", "text": "HS here, but for science labs I don’t have enough material for every student to do each lab. And when you’re pushing two cars together, but also need to start a timer on each, it’s a little difficult with 1 person. \n\nGranted, I make videos for virtual students, so I COULD do that with all students. But manipulating objects is so important for physics.", "author": "wcasg", "created": 1604606877, "upvotes": 1}, "gb9hugg": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb9hugg/", "text": "The simple answer is that they’re probably required or recommended to do so by their university. You know those teacher evaluations at the end of the semester? “Did your professor encourage group work/interaction”.", "author": "MsPrincessConsuela", "created": 1604606664, "upvotes": 1}, "gb9gr96": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb9gr96/", "text": "I have two big final projects that require interviews from people out in town, I really want to fake that I interviewed them and provide false evidence.", "author": "Nullveer", "created": 1604606157, "upvotes": 1}, "gb97mdu": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb97mdu/", "text": "Because \n\n1) Group work is beneficial for engaging in meta-cognitive learning, and explaining to others is a great way of learning yourself.\n\n2) It's practical - there are other learning objectives beyond just the course work. Yes it's a pandemic - that doesn't mean every single team in the world has shut down. Learning how to collaborate digitally is a great learning outcome.", "author": "EconMan", "created": 1604601928, "upvotes": 3}, "gb93e4y": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb93e4y/", "text": "It is so much worse than usual, especially since everyone has varying schedules and time zones.", "author": "jalapeno_popper18", "created": 1604600018, "upvotes": 0}, "gb93382": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb93382/", "text": "To anyone saying that we should try to mimic the \"real world\" in our classes -- In the \"real world,\" you  are unlikely to have five different bosses asking for five different products from you, each with its own deadlines, instructions, and expectations. Oh, and the bosses don't know one another nor communicate. \n\nIn college, you're asked to report to five different professors asking for five different products from you, each with its own deadlines, instructions, and expectations. And the professors don't know one another nor communicate.\n\nAdd the pandemic, and it's a no from me.\n\nBTW, professors often assign group work because it cuts the grading way down.\n\nProfessor here who hates group work and doesn't like to assign it. Ever.", "author": "docktor_Vee", "created": 1604599881, "upvotes": 1}, "gb90krn": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb90krn/", "text": "I have had 3 group projects this semester. One of them has lasted 4 months and has become the equivalent of a part-time job for me. The professor expects us to have weekly group meetings that everyone in the group MUST attend (otherwise points get taken off our grades). In another class, I had to do 2 group presentations. Thankfully, there were 5-6 other people in my groups, so the workload was much less but it was stressful coordinating schedules with that many people.", "author": "Lady_Caticorn", "created": 1604598766, "upvotes": 1}, "gb8ylux": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb8ylux/", "text": "Especially groups with more then 5 people!!! We can’t even find a time all of us can meet", "author": "gotthatsushi", "created": 1604597896, "upvotes": 1}, "gb8wvw7": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb8wvw7/", "text": "Even in normal semesters, it's already hard enough to get people to give a shit and cooperate. And if the professors are looking for interaction this isn't it, in my best-organized group project this semester all 3 of us basically went \"OK you do this and you do this and I'll do this\" and we just fucked off and wrote our parts and never spoke again. Got a 94 anyways", "author": null, "created": 1604597132, "upvotes": 1}, "gb8rzev": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb8rzev/", "text": "Honestly, I have a professor who literally recorded all their lectures over the summer and does blackboard quizzes. Why are professors needing synchronous work right now?", "author": "Phenom1nal", "created": 1604594926, "upvotes": 1}, "gb8fpf4": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb8fpf4/", "text": "Large groups are awful as well! You’d think with Zoom available, we’d all be able to find times were we can all meet up, but it’s not easy even with just 8 people", "author": "DazedPenguin15", "created": 1604589148, "upvotes": 1}, "gb8dbsc": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb8dbsc/", "text": "Well FYI, there's still group work in normal life so not sure why there wouldn't be group work in school.\n\nPS The same people who struggle with group work in the workplace probably struggled mightily with group work in college.  I can see why professors would want kids to practice.", "author": null, "created": 1604587937, "upvotes": 13}, "gb8chii": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb8chii/", "text": "Its because they just copy their courses from the previous semester/year over and don't consider and of the future dates or whats happening in the world. In an online class this is one or two clicks, and it auto adjusts dates. Back in August, your prof did this, and maybe briefly thought, \"oh I'll figure all that out later\" then never did.", "author": "Lamech", "created": 1604587500, "upvotes": 1}, "gb88uzs": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb88uzs/", "text": "I have a group project in an asynchronous online class, where each person has to be present virtually at once for a video presentation. Like dude. What does \"asynchronous\" mean?", "author": "ComplexEnthusiasm", "created": 1604585536, "upvotes": 2}, "gb88rd2": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb88rd2/", "text": "Because they are lazy and don't want to adjust their course for online classes.", "author": "FinalFate", "created": 1604585479, "upvotes": 1}, "gb88h7d": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb88h7d/", "text": "Because the teachers are mostly outdated and incompetent and this allows them to lean on the few competent students to try and drag the morons towards the finish line instead of modifying their curriculum to fit the current environment. \n\nHalf of them can’t seem to get webex/office 365 to work every day but still get their paychecks despite their proven incompetence.", "author": "landback2", "created": 1604585320, "upvotes": 0}, "gb86lpz": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb86lpz/", "text": "Honesty group projects feel like a relief to me right now. They're good if your major class is small and you're at least somewhat familiar with the other people through classes.", "author": "SakuOtaku", "created": 1604584233, "upvotes": 2}, "gb7z6q2": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7z6q2/", "text": "My ochem professor not only assings group work, but pretty much everything is group work. There are never really any lectures, we're divided into various groups and each one has to essentially give the lecture on part of a topic. Every single day, all while getting grilled if we weren't able to teach the material to ourselves well enough. It sucks, one member of my group rarely ever shows up to group meetings or even bothers to answer texts. My professor keeps jerking himself off saying his method works great. Yeah it works great if the goal was for me to learn next to nothing. God I can't wait for this semester to be over.", "author": "Maliki16", "created": 1604579203, "upvotes": 4}, "gb7xnw9": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7xnw9/", "text": "This semester I have so many more group projects than I’ve ever had all three years in college. It is DRAINING", "author": "bettyboopvenom", "created": 1604577934, "upvotes": 12}, "gb7pr8c": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7pr8c/", "text": "I have a research to write and I perfectly understand everything about it, I could have finished writing it in a few days, but because I’m in a group, it’s taken us TWO MONTHS seriously, two freaking months.", "author": "meowwmeowwmeow", "created": 1604569763, "upvotes": 8}, "gb7nyc7": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7nyc7/", "text": "1. You probably already have few contacts with others so group work promotes that \n2. It's a good skill to be able to work / collaborate with others via zoom \n\nNonetheless, a large group project purely online is hell but I hope most teachers understand this", "author": "LocusStandi", "created": 1604567839, "upvotes": 2}, "gb7nl6r": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7nl6r/", "text": "The quarter has started here two weeks ago, and for one of my courses, my professor made two group work projects, one due next week and one due two week later. As we have tons of other deadlines at the end of November, me and two of my friends already finished project 1 and are halfways through project 2 -- and now two people messaged us that the professor told us to just join our group. Wtf? The heavy lifting is already done, why is he allowing them to basically free load? Feels like we're getting punished for having been organised enough to recognise that shits gonna go down at the end of this month, and have planned ahead :/", "author": "Pups2", "created": 1604567452, "upvotes": 0}, "gb7nghz": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7nghz/", "text": "My professor admitted to me in private it's the only way they can climax.", "author": "fallout20", "created": 1604567313, "upvotes": 17}, "gb7n02c": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7n02c/", "text": "As much as I hate group work with a PASSION, it's...justified. Classes going remote honestly isn't enough reason to cease all group work.\n\nAnd, note, this is coming from a person whose 4 out of 6 classes require group work. That, along with being in a different time zone, absolutely SUCKS. But I kinda signed up for it.", "author": "gargar070402", "created": 1604566829, "upvotes": 10}, "gb7lkvk": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7lkvk/", "text": "I fucking love my group work. It’s a great way to meet people when it’s been so isolated here with low social interactions. Coming from a math and Comp sci major", "author": "King-Days", "created": 1604565325, "upvotes": 2}, "gb7le96": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7le96/", "text": "I currently have 3 group projects for different classes. I’m struggling here lol", "author": null, "created": 1604565134, "upvotes": 3}, "gb7k04l": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7k04l/", "text": "Let's take this one day at a time we are almost done with this semester!", "author": "RandoMe01", "created": 1604563731, "upvotes": 1}, "gb7jzgv": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7jzgv/", "text": "I really can't stand the group projects. Why do these lazy uncooperative classmates get to benefit with the grade from my hard work when they do the bare minimum? \n\nOne of my classes I have to write a lab report with a partner because we need to learn \"collaboration skills.\" I'm a good writer and I've always gotten good grades on my reports until writing with her. She literally edits my every sentence which removes the flow. I don't know if she just thinks it reads better or if she's being passive aggressive but it's frustrating to work on something and think it's complete only to come back later to find it regressed.", "author": "lovesickpolecat", "created": 1604563713, "upvotes": 57}, "gb7imdx": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7imdx/", "text": "I have three group projects so far this semester, all in my online classes. Had one group that wouldn’t answer my emails until the night before a project was due and told me they didn’t know I was in their group and had already finished and submitted the project. Ended up doing an entire 5-person project on my own the night before it was due.", "author": "rezgirl15", "created": 1604562431, "upvotes": 15}, "gb7giqh": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7giqh/", "text": "My math teacher is doing this. Every chapter we have at least two group projects. On top of that, she has no idea how to date stuff. So something will be due on the third, but she wants it started on the first. But it doesn’t show up in our due section until two days later aka when it’s due. So we constantly get points taken off of assignments because we are supposed to start it two days earlier. I tried explaining this to her and she just couldn’t understand what I was talking about. \n\nI am so done with this class.", "author": "MadamRorschach", "created": 1604560573, "upvotes": 20}, "gb7g9te": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7g9te/", "text": "Honestly I’m doing fine with online group work. It’s more due to my personal circumstances. I have been getting good team members in my groups, and had no problem meeting with them via zoom. I guess I’m lucky.\n\nI don’t see a big difference between group work online vs in person. For me, my group work has been online so far (3 years). Most of our work is done online or on our own time.\n\nI think some professors at least mine, gives group work to have a better understanding of the material and touch bases between other students.", "author": "Icious_", "created": 1604560355, "upvotes": 6}, "gb7fmqd": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7fmqd/", "text": "Man group work sucks. Being a group leader sucks even more. Getting everyone to agree to meet at a single time to discuss is so difficult. Except for me and a girl in our group everyone has an excuse to not attend the discussion. I mean I am doing all the work atleast attend for 10 min so you have an idea what you will be explaining the prof during the live presentation.", "author": "ThatsDopeHomie", "created": 1604559793, "upvotes": 416}, "gb7esam": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7esam/", "text": "Personally I feel like working over zoom isn’t too hard and it’s nice to actually interact with my peers", "author": "SpartanElitism", "created": 1604559066, "upvotes": 8}, "gb7ecrw": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7ecrw/", "text": "My department accepted almost a hundred in our class. And its their first time accepting this amount of students and it's their first time to have online classes. (Yes, it's a small college) \n\nNow we are all having a hard time. The professors are making the activities as a group work because it's very hassle if they make it as individual work.", "author": "secretlangnaman", "created": 1604558698, "upvotes": 1}, "gb7e4ru": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7e4ru/", "text": "r/askreddit", "author": "GiveMeTheYums", "created": 1604558510, "upvotes": 2}, "gb7cvgz": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7cvgz/", "text": "I'm honestly so lucky that my weekly group assignments are with one really down to earth dude bc the others literally just ditched us. Idk how the kids who have to do it all alone feel.", "author": "metallicsharpie", "created": 1604557473, "upvotes": 3}, "gb7cm23": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7cm23/", "text": "Because I made the project part of my rationale for the course to satisfy a university learning outcome and it’s too time intensive to grade individual assignments.\n\nI know it sucks for students, but it’s also honestly what most white collar workers are having to do right now, so it’s not terrible workplace training.", "author": "yanayana_chimichanga", "created": 1604557264, "upvotes": 24}, "gb7ckql": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7ckql/", "text": "Doing the Big Business Game simulator for my capstone class. Literally got my group into the global 100 rankings on my own. Professor wants me to “manage” them. Like homie isn’t that your job.", "author": "JCasasola", "created": 1604557235, "upvotes": 7}, "gb7cevo": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7cevo/", "text": "My professor had a HUGE exam on Election Day and major assignments for the rest of the week. Give me a freaking break, I feel like I’m dying. I haven’t been so sad in a long time.", "author": "psychcrime", "created": 1604557106, "upvotes": 308}, "gb7carx": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7carx/", "text": "With a lot of work moving remotely and signs that some jobs will remain remote, it's a good idea to start learning how to work with a team remotely. But yeah, it sucks and may not be realistic depending on your major. Edit: I suppose it's easier said than done, especially in the first couple years of college. As a grad student, it's pretty easy to organize team projects because everyone wants to succeed. Thinking back on some of my undergrad groups.... All I can say is god speed. Remember these times when an interviewer asks you to describe a time when you overcame a challenge.", "author": "beefstewie13", "created": 1604557017, "upvotes": 198}, "gb7bmr0": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7bmr0/", "text": "Because your parents and other students complain that you aren't getting a true education or the college experience so the admin force us to do shit that none of us want to do....I fucking hate discussion boards with a passion after this semester...", "author": "GriIIedCheesus", "created": 1604556498, "upvotes": 33}, "gb7bgza": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7bgza/", "text": "And plus we can’t really work on it in person because places are close indoors still", "author": "Low-Computer3352", "created": 1604556373, "upvotes": 6}, "gb7ba4i": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7ba4i/", "text": "Especially in engineering classes where there are random \"milestones\" you need to accomplish individually. You don't know who's in your group until you participate in the graded discussion, and who the fuck even knows what the milestones are.", "author": "legitducks", "created": 1604556223, "upvotes": 53}, "gb7a1pz": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb7a1pz/", "text": "I mean, I have one group project and I do all the irk cause they deemed me th smartest of the group so I would love no more group work", "author": "fox-foodz", "created": 1604555280, "upvotes": 13}, "gb78tit": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb78tit/", "text": "I’m *so* glad that none of my professors thus far have assigned group work. I can’t even make it to our zoom classes because of how wonky my work schedule is. I have classroom observations (Ed major) where we are paired up with one of our classmates and I’m having a hard time even managing that and we don’t even have to do anything together besides show up.", "author": "NudlePockets", "created": 1604554372, "upvotes": 43}, "gb77qx2": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb77qx2/", "text": "Group work has been so annoying and stressful!! It is so hard to communicate online, especially when your group ignores texts :/", "author": "lamp3green", "created": 1604553601, "upvotes": 660}, "gb769sx": {"link": "/r/college/comments/jocb21/professors_that_are_assigning_group_work_during/gb769sx/", "text": "In many cases, group work is an essential part of the curriculum. If you're saying that the workload is too much, then you're really just arguing that you don't have the time/energy to pursue your education at this time.\n\nThat's certainly a reasonable decision for you to make. What is not reasonable is asking to receive an inferior education.", "author": "ViskerRatio", "created": 1604552580, "upvotes": -22}}}