{
  "sid": "q4wzs2",
  "link": "/r/college/comments/q4wzs2/it_isnt_fair/",
  "title:": "it isn't fair!",
  "text": "It isn't fair that everything related to school sucks here. Clubs dont exist in colleges, high-school or schools in general, you don't get to pick any classes anywhere, 95% of your grade depends on your exams and nothing else. We have smaller places with small amount of students and it is so much like high school.\n\n From what I know we don't really have group projects and stuff like that. It is basicly just study and however you do on your exam. So even if you work super hard you can fail tragicly because it dosent fucking matter. \n\nYou also have to worry if half of the world would even recognize your damn diploma!? Then you don't even have that many options at what you want to do and study. Your options ar every limited and are honeslty pathetic. It just isn't fair, I wish things worked differently.",
  "author": "Itchy_Word_1523",
  "created": 1633823641,
  "updated": 1634083099,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.67,
  "comments": {
    "hg22pcj": {
      "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg22pcj/",
      "text": "No shit Sherlock, fuck those people and start on yourself.\n\n3 years ago I was living in a tent, father stole my college money and wrecked my credit. I had 78 cents to my name.\n\nNow I own a house, 3 vehicles, 17k in checking/savings and 10k in retirement. Also 100points up on my credit.\n\nMost people you see having problems are people who don't give something up to make themselves better. Most people dig their own graves who are struggling. I currently work part time, take 15credit hours, and am in the army reserves. \n\nYOU HAVE OPTIONS \nGo on YouTube and learn some things about those options and fuck all the other people who's parents were able to help them, but dont sit here to bitch and moan about not having options. You've got options and a surprisingly good way to make things work, you just don't have the drive to achieve what you want.",
      "author": "guy_with-thumbs",
      "created": 1633833205,
      "upvotes": 2,
      "replies": {
        "hg38w82": {
          "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg38w82/",
          "text": "Omg wow did you ever think, \"oh I got lucky?\" or \"I had opportunity to do this\". You are just some random rude idiot on reddit.\n\nMost people I see having money problems  are people around me. People who often try and sacrafice something but still suffer. Also even my parents, they might be shitty but they give up alot of things just for us to live regular lives.\n\nBy your logic every Immigrant that moved from shitty country with no opportunities to country they would have some are idiots? Because by your logic they could have just hopped on the YouTube and found great solutions.\n\nAlso I assume you are from America where \"homeless\" people have phones and make tiktoks. Place where everyone can start an online bussiness easily. Country where people bitch so much without realising how much opportunities they have. Unlike some small and poor countries out there.",
          "author": "Itchy_Word_1523",
          "created": 1633862628,
          "upvotes": 1,
          "replies": {
            "hg3pex7": {
              "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg3pex7/",
              "text": "I do apologize, yes I'm from the U.S. so I guess I'm speaking about the U.S. \n\nMy point was that there are options. If you aren't from the U.S. then I dont really know whats going on over there. \n\nI am an asshole for this, I'm a little angered at the moment with the state of my family. My father is blowing all his retirement and my mother is not in good health. And my childhood neighbor is living with them cause he did some dome stuff and got arrested, but told me today he owes his parents like 50k cause he decided he didn't want to work for 4 months. \n\nI was angry, I apologize, I was taking my anger out on reddit. First thing I did when I was living in a tent was learn how to live off the land, so that was my \"if anything goes wrong, im ready\" plan.\n\nWhat country do you live in if you don't mind me asking?",
              "author": "guy_with-thumbs",
              "created": 1633873452,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg1jza9": {
      "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg1jza9/",
      "text": "I'm with you that it's unfair, but the Working World is far more unfair.",
      "author": "FoxWyrd",
      "created": 1633823816,
      "upvotes": 1,
      "replies": {
        "hg1kfc4": {
          "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg1kfc4/",
          "text": "Listen idk where you are from but you really don't have to tell me that working world isn't fair. Here people can't even live on their own with their salaries. All you see are people having problems with jobs and shit. The only comforting thought is that in the worst case scenario quick jump infront of a car or bridge can solve everything.",
          "author": "Itchy_Word_1523",
          "created": 1633824042,
          "upvotes": 0,
          "replies": {
            "hg1koxr": {
              "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg1koxr/",
              "text": "It gets easier as you go and you get better at playing the Game.\n\nJust make sure you pay attention and learn from your experiences.",
              "author": "FoxWyrd",
              "created": 1633824178,
              "upvotes": 0,
              "replies": {
                "hg1llpx": {
                  "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg1llpx/",
                  "text": "Not it gets easier for some people, for people like me it dosent. I don't learn out of experience and idk shit. Basicly the whole college thing is useless to me because I know I won't learn anything. However I will still get diploma that for couple of years I can't do shit with and will get avarage salary for. The diploma that won't even be of use to me if I move to another country. However I can't move to another country unless I have it in a first place... \n\nAlso I am type of guy that went to high school and I know names of like 5 people from my class. I don't remember a single thing I learned for 4 years there. I also have to repeat simple stuff to myself over and over so I don't forget. So to word it differently, I am stupid as person can be, I can udnerstand shit but I can't remember anything.",
                  "author": "Itchy_Word_1523",
                  "created": 1633824637,
                  "upvotes": -3,
                  "replies": {
                    "hg1lr0w": {
                      "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg1lr0w/",
                      "text": "Well, Life is a lot harder if you don't try to learn from your mistakes.",
                      "author": "FoxWyrd",
                      "created": 1633824710,
                      "upvotes": 3,
                      "replies": {
                        "hg1mknl": {
                          "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg1mknl/",
                          "text": "I can learn from my mistakes but that isnt the problem here. People mistreating  me everywhere my whole life isn't my fault. My memory problem isn't my fault,  I just can't keep in my head no matter hoe much I try. Shitty school system in my country also isn't my fault. Living in shitty family isn't my fault so these aren't thing I can learn from and change. These things are out of my control, I can't affect them.\n\nThis is why my life won't get easier as I learn to \"play the game\"",
                          "author": "Itchy_Word_1523",
                          "created": 1633825128,
                          "upvotes": 0,
                          "replies": {
                            "hg1mqvb": {
                              "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg1mqvb/",
                              "text": "Meh.\n\nI don't know what country you're in so I can't speak on that but my family was broke and shitty.\n\nI eventually distanced myself and started building my life up.\n\nGive it time.",
                              "author": "FoxWyrd",
                              "created": 1633825215,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hg4flke": {
      "link": "/r/college/comments/q4wzs2/it_isnt_fair/hg4flke/",
      "text": "[removed]",
      "author": null,
      "created": 1633885395,
      "upvotes": 1,
      "replies": {}
    }
  }
}