{"sid": "ptuh57", "link": "/r/college/comments/ptuh57/help_i_need_advice_about_a_roommate_situation/", "title:": "help i need advice about a roommate situation", "text": "So my room is in a major urban area and we have very cheap blinds, so a ton of light gets in (i mean a TON - we're literally across the street from a major sports arena and it's basically daylight out there). My roommate wants to sleep with the blinds all the way up because she \"wakes up in a bad mood if natural light doesn't come in\" in the morning. Last year, I slept with blackout curtains because natural light DOES come in even with the blinds all the way down/it wakes me up at 6am. We agreed to compromise so that the blinds are half down on the days she has early classes and all the way down on the days that I do. The thing is, I sleep with a sleep mask even with them all the way down because it's so light and on her days I keep getting woken up at 3-4am when I inevitably knock the sleep mask off (I'm a chaotic sleeper). I have no idea what to do - I woke up last night and couldn't fall back asleep for 2 hours so I put the blinds all the way down and my roommate threw a fit about it today. I haven't slept more than 8 hours a single night I've been here because of this.", "author": "lobstercapote", "created": 1632401317, "retrieved": 1632800758, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"hdyi8t4": {"link": "/r/college/comments/ptuh57/help_i_need_advice_about_a_roommate_situation/hdyi8t4/", "text": "Ultimately, it’s disturbing you more than it would disturb her to have them down. \nIf you have an RA I’d recommend asking to have a mediated conversation about it. It sounds like you already compromised, but it’s not working out that way, so you need to bring it back to the table. \n\nI would also recommend a sleeping cap. I have one of those and you wear it like a hat, but it goes over your eyes. I have the same prob with my sleep mask coming off, but I don’t have that issue with the sleeping cap!", "author": "SnooMaps460", "created": 1632401523, "upvotes": 5}}}