{"sid": "jl0zgd", "link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/", "title:": "Professor won’t allow me to make-up a midterm?", "text": "So I had a midterm this week and got in a serious car accident the day before. (the midterm was only open during the day it was due.) I was unable to do the exam, and in the course syllabus it states, “Make-up tests are given only if there is solid evidence of a medical or otherwise serious emergency that prevented the student from taking the exam”. I wrote her an email stating my situation and offered to provide all documentation as necessary. My professor replied that since they went over the test during the following day’s lecture, there is nothing I can do to make it up. \n\nMy grade went from an 85 to a 51. \n\nEDIT 1: So I should probably clear this up. I emailed the professor before the test was due, and she didn’t respond. Then I followed up after the test was due. I also didn’t make it to class where they reviewed the test, but the lectures are recorded so technically I could go look at the answers at any time.\n\nEDIT 2: Some of you are asking for the exact wording from my professor so here it is. The first email I sent, several hours BEFORE the test was due was where I explained my situation and stated that I would be unable to take the test on the given date and asked if I can make it up. To this I got no response. Then I sent a second email the next day asking again if I can make up the test in some way, as the syllabus says I should be allowed to. Professor replied to my email with, “No you can not make up the test. The solutions were covered in class. Thank you.”\n\nHope this clears the confusion.\n\nIs there anything I can do in this situation? Can I message someone higher up in my college about this? I can’t really afford to fail this class, especially not for a reason such as this.", "author": "mrcheese14", "created": 1604078334, "retrieved": 1632802110, "over_18": false, "upvotes": 1098, "upvote_ratio": 0.99, "comments": {"gb20w5p": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gb20w5p/", "text": "First, go to your advisor. If you’re an undergrad, (and I’m guessing you are by your prof’s bitch attitude), be prepared to be dismissed. Next stop, the dean’s office. \n\nIf you are early on in your school career, the grade in this course will affect your GPA more heavily than if you were later on. But there’s no reason your prof can’t get off her fucking ass and give you a new test. She should’ve been on top of her email ... just like students must be. Good luck!", "author": "BanannyMousse", "created": 1604444572, "upvotes": 1}, "gaoozj7": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gaoozj7/", "text": "Go straight to the dean. Some professors are just plain ass.", "author": "WhipsandPetals", "created": 1604137501, "upvotes": 1}, "gaoo053": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gaoo053/", "text": "I was in the ED (nursing student and emailing a NURSE prof) with a variety of weird symptoms. Emailed my prof and she basically said to fuck off.  I was told I would fail my final and fail out of nursing school....for going to the ED because my heart felt it was going to explode. \n\nWell, I definitely didn’t accept that and went immediately to the department head. She very quickly changed her tune. \n\nI don’t care about class standards or rules or policies. Life happens. This same prof had 3 weeks off for a family death in a summer semester. We literally missed out on weeks of lectures and help, but no one complained because we felt sorry for her. However, when that same understanding doesn’t extend to students...nope. You can fuck right off. Side note, I also lost my aunt the next day and she (again) told me to fuck off or take the final that day. \n\nSuch. A. Bitch.", "author": "space_pill", "created": 1604136297, "upvotes": 2}, "gaogf05": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gaogf05/", "text": "Do not under any circumstances watch that lecture. They will be able to tell if you have seen it(at least on your own account) and could use that as a legitimate reason not to let you take the exam.", "author": "grumpy_flareon", "created": 1604127086, "upvotes": 1}, "gao9shp": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gao9shp/", "text": "I'm really sorry that you got into a car accident and I hope that your recovery goes smoothly. Also I'm really sorry that your professor is acting this way and I hope that you can still take the exam. Get well soon! ❤️❤️", "author": "lillybee1234", "created": 1604120483, "upvotes": 1}, "gao9gpi": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gao9gpi/", "text": "This thread has devolved into an unhelpful student vs professor fight. \n\nOP - can you tell us what the prof exactly said?  This seems a little slanted and raises a lot of question marks.  Can you (with appropriate redactions) let us know exactly the wording of the emails from your prof?  You said one was not responded to and one was with a no?   It would be helpful to see *exactly* what the wording was.", "author": "imjustsayin314", "created": 1604120197, "upvotes": 1}, "gao0t56": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gao0t56/", "text": "Speak to their department head", "author": "TaleOfKade", "created": 1604113640, "upvotes": 1}, "ganyyy6": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganyyy6/", "text": "honestly this prof seems ridiculous. i had missed an important exam literally because i slept through my alarm and he made a new test and i took it right after he took it", "author": "Snoo_90736", "created": 1604112388, "upvotes": 3}, "ganwshe": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganwshe/", "text": "Yeah, that’s shady & extremely unprofessional on her end. Here’s what you need to do ...\n\n1. Start with her, which you did and it doesn’t seem that she really cares at all. That’s fine, you checked the first box.\n\n2. Go to the Academic Dean of your department, as that’s who is most likely next on the totem pole. See that happens with that.\n\n3. If nothing, then you have to go up the ladder one more time, to the dean.", "author": "CollegeFreshmanFocus", "created": 1604110941, "upvotes": 1}, "ganvcgt": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganvcgt/", "text": "I think you can petition and go to the dean for an appeal", "author": "hle80201", "created": 1604110004, "upvotes": 1}, "ganrjfq": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganrjfq/", "text": "Definitely contact the department head. Especially if you had emailed the professor before the exam was due and she didn’t respond. She should’ve been reachable during the time of the exam, it’s ridiculous that she wasn’t and she shouldn’t punish you when you did everything right. I think the proper thing for her to do would be to make a new midterm for you to take, it might be more work for her but it’s just absolutely so unfair for her to deny you the chance to make up the exam given the circumstances. It’s not like you just had a cold and didn’t say anything until after the fact, you were seriously unable to take the exam and you told her beforehand.", "author": "ssiiempree", "created": 1604107581, "upvotes": 4}, "ganplng": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganplng/", "text": "Lots of people are saying go to the Dean, but you should check to see if your school has an academic grievance procedure first, and follow that. If not then yeah, talk to the chair of your department or the Dean.", "author": "kkoiso", "created": 1604106371, "upvotes": 6}, "ganowo6": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganowo6/", "text": "Can’t you ask for a remake of the exam later with different questions? \nWhenever we miss a midterm with the proper documentation our teachers allow us to make it up for it at the end of the semester, but it has the contents of all the semester like a final.", "author": "izzypy71c", "created": 1604105937, "upvotes": -1}, "ganls01": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganls01/", "text": "I am not sure how it is in your country/university, but by common sense, if you had an injury where you weren't allowed to perform the exam by medical advice, **nobody** can prevent you from retake the exam you've missed. Just like if someone tests positive for n-cov and has to stay home if the exam is in person the teacher is obligated to allow the student to retake the exam. \n\n&#x200B;\n\nLong story, short, go to your doctor and ask for the paper where it states that you were injured. Pay attention that not all papers work. It must be a fit/sick note. There is a diffence between the papers the doctor might give you. If he gives you a paper that you were in an appoitment the day before the exam that won't work. It has to be a paper that states that from day X to Y you had medical leave(something like that, I can't remember the exact name lol)", "author": "brunommpreto", "created": 1604104006, "upvotes": 0}, "gani3s8": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gani3s8/", "text": "I recommend contacting the Dean (might vary from place to place but they dealt with grade disputes and complaints at each place I’ve taught at) and explain the situation and before you do so, you should look into whatever rules the university has on grade disputes. At my university for example, I’m obligated to agree to allow for a make up exam should the student contact me within two business days after the exam (assuming that the student has verification of an emergency which prevented them from taking the exam and notifying me sooner) regardless of whether or not I respond to the email.\n\nNote: Don’t contact the chair. It doesn’t tend to be a part of their job to handle these sorts of disputes. At my previous university, the protocol was for the dean to handle the dispute and they’ll probably ask the chair to discuss the situation with the prof/instructor. (Although this could vary from place to place)", "author": "Erockoftheprimes", "created": 1604101797, "upvotes": 6}, "ganezbn": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganezbn/", "text": "Do you have an ombudsperson at your faculty?", "author": "_JynErso", "created": 1604099930, "upvotes": 5}, "ganc454": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganc454/", "text": "You should contact the Dean of Students. They're really great about helping you communicate with professors when you have extenuating circumstances. Stuff like illness, death of family member, car accident, hospitalization, etc.\n\nThey can help you find the specific people to talk to in order to get this fixed. They can also probably help you out with any other classes you're taking.", "author": "remyymer13", "created": 1604098222, "upvotes": 6}, "ganbhx8": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/ganbhx8/", "text": "(Senior in college btw) If you read this, firstly I'd like to say that I really hope your condition has improved/you're mentally okay regarding the injury.\n\nSecondly, absolutely, yes you can contact a higher up. Forward all emails/documentation that you've sent and received from your professor, regarding the midterm and why you missed it (as well as the syllabus; don't send medical documents unless prompted), to your dean and your academic advisor. As well as this, inform them of your current medical situation (as in how you're doing at the time you send the emails and how you were doing when the test took place) and what you would like to do to remedy the issue (i.e. making up the exam, getting an exemption from the midterm, etc.).\n\nMake sure to say that you want to be cc'd/bcc'd for any and all communication regarding this issue. Also, if any email is sent to you and only you, regarding this issue (whether it's from the professor, dean, academic advisor or otherwise) cc/bcc both your academic advisor and your dean when responding to the email; if you're not responding to it, and the email sent to you is just meant to be a memo about the issue, forward it to your academic advisor and Dean.\n\nYou want to make sure that both your academic advisor and your dean are fully aware of the issue at hand and that you had no control of the situation that occurred. That rule of \"no-make up exams\" is meant to be a safeguard, so that students don't purposefully miss an exam in an effort to cheat, but it's not meant to be held over a student's head to actively penalized them. It may feel like you're being annoying by sending every email to your academic advisor and your dean, but at the end of the day it is their job to help you, especially with an outstanding situation like this.\n\nSorry for sending an essay, but I want to try and help as much as I can. I hope your situation gets better, and if you read this and want to discuss it further, dm me (if you actually read this far).", "author": "EagleAtlas", "created": 1604097856, "upvotes": 17}, "gan8jxo": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gan8jxo/", "text": "It seems like there is something missing from this. Were you hospitalized from the accident? What about the accident stopped you from being able to take the test?\n\nHow soon after the accident, and how long before the test was due did you contact the professor?\n\nIt's entirely possible to read your description as being that you were not injured, but just distracted with taking care of insurance, getting a rental, etc, that you missed the midterm, and you contacted the prof just an hour before the window closed.\n\nThat's different from being in the ER because of the accident, out of commission from pain killers, etc...\n\nSomething a lot of students don't get is how important it is to be specific and include all the relevant details. (You can tell by how many similar posts are vague and missing details.)", "author": "bl1y", "created": 1604096184, "upvotes": 2}, "gan6mfu": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gan6mfu/", "text": "Are you ok?\n\nThank you for asking this. In a similar situation and have been stressing hard.", "author": "team_sita", "created": 1604095090, "upvotes": 17}, "gan5dtk": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gan5dtk/", "text": "I feel like there’s some crucial information missing here.  How much time was given between when the test was given and when it was reviewed in class?", "author": "imjustsayin314", "created": 1604094402, "upvotes": 3}, "gan4r4d": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gan4r4d/", "text": "lmao what is with these people. Hope everything works out in ur favor", "author": "pokemongofanboy", "created": 1604094050, "upvotes": 7}, "gan4ii9": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gan4ii9/", "text": "Speak to your advisor or dean about this. This is actually serious.", "author": "rollllllllll_", "created": 1604093918, "upvotes": 2}, "gan0oal": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gan0oal/", "text": "Sounds pretty petty to me, Some people have no decency. I hope you follow up with the department, the whole situation could make the department and by extension the college look bad.  The only thing colleges care about more than money is PR.", "author": "Discarded1066", "created": 1604091808, "upvotes": 3}, "gamyl19": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamyl19/", "text": "Ya i say go straight pass the professor to the dean or department head. You’re paying thousands of dollars for the education that they are trying to refuse you. Lmao im either getting another test or a couple thousand back. Especially after an incident like that, i would raise absolute hell! Thats just me though, but it usually works", "author": "arteagad14", "created": 1604090696, "upvotes": 1}, "gamy5l0": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamy5l0/", "text": "You can reach out to the dean, chair or appropriate person in the Dept and ask for help by describing your situation and have copies of emails and any supporting documentation. Your professor is ignoring you bc they don’t want to hassle with it. Don’t stop until you get it taken care to your satisfaction.", "author": "flipturnca", "created": 1604090471, "upvotes": 1}, "gamtdtt": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamtdtt/", "text": "I had a concussion and had a similar situation. I went to the dean of students with my documentation and they reached out to my professor and was able to get the exam dropped", "author": "xwishfulx", "created": 1604087985, "upvotes": 45}, "gamqd4k": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamqd4k/", "text": "That professor sounds like a dick. Life happens.", "author": "Shootersnest", "created": 1604086419, "upvotes": 8}, "gamojp1": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamojp1/", "text": "So I also wouldn’t allow a student to make up an exam I had already gone over the answers to but I would offer some kind of other assignment because of your extreme extenuating circumstances. That would mean more work for me and I would not ordinarily do it but what happened to you is exactly why a policy like that is in the syllabus in the first place.  Ask if that would be possible. If not, then yes, the chair is the person to go to next. If this is legitimate and you can provide documentation, you shouldn’t be penalized.", "author": "hernwoodlake", "created": 1604085484, "upvotes": 68}, "gamnmp6": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamnmp6/", "text": "[deleted]", "author": null, "created": 1604085015, "upvotes": 202}, "gamhtke": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamhtke/", "text": "When did you email the professor?", "author": "BatterSlut", "created": 1604082091, "upvotes": 55}, "gamh668": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamh668/", "text": "she can't give you a different exam or something? wtf", "author": "peachypuzzi", "created": 1604081772, "upvotes": 35}, "gamh545": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamh545/", "text": "Did you attend the lecture where she reviewed the exam?", "author": "SirBensalot", "created": 1604081757, "upvotes": 14}, "gamh3fe": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamh3fe/", "text": "when did you email the prof. you def deserve a make-up but looking at it from the profs view, if you managed to make it to class AND then emailed about the make-up test, the prof is less likely to play nice.\n\noverall i think you should definitely email them again talking about \"it's in the syllabus\", and if they don't budge, talk to the department head etc after.", "author": "loyyaa", "created": 1604081734, "upvotes": 130}, "gamfiwf": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamfiwf/", "text": "Do you have or can you get a written statement from a doctor regarding treatment for injuries caused by the crash? Did you contact the prof before the exam?  If the answer to both of these questions is \"yes\" contact your advisor about what you can do.", "author": "Piglet03", "created": 1604080961, "upvotes": 534}, "gamadew": {"link": "/r/college/comments/jl0zgd/professor_wont_allow_me_to_makeup_a_midterm/gamadew/", "text": "Yes, this is directly against the syllabus, as well as department and school policy. Some professors include a clause that a low test grade can be dropped or replaced with the final at the end of the semester to protect against this. You need to contact the chair in that situation", "author": "Bekah_grace96", "created": 1604078446, "upvotes": 910}}}