{
  "sid": "lqjled",
  "link": "/r/college/comments/lqjled/failed_my_first_exam/",
  "title:": "Failed my first exam..",
  "text": "I’m a first year university student. I study chemistry and I have to write 4 exams in this semester. 3 of them are already behind me, while I don‘t particularly feel like I did good in any of them, I at least felt like I could pass them. I had a really hard time trying to motivate myself to study and it felt really hopeless but now I have my first result. My first exam was physics and I failed miserably.. Like I was miles away from the passing grade (maybe they even gave me the worst grade, I don’t know the grading system yet.) \n\nI was never any good at it but now I feel really stressed out and wonder if I‘m even made for this. I used to really like studying for chemistry in high school but now I can‘t even bring myself to enjoy the classes that have more to do with it than e.g. physics. Now my head is full of negative questions like what if I fail all the other exams too? Will I have to drop out? I know most of this is my fault because I just didn‘t study enough. \n\nBut I’m really desperate right now. Does anyone have any advice?\n\nedit; thank you to everyone who answered.  I don‘t really have anyone who would have comforted and helped me this much. my parents would have just said I didn‘t study enough and that it was the obvious result which would have dragged me down even more. So I’m really grateful to all of you :‘)",
  "author": "cankiyeli",
  "created": 1614090369,
  "over_18": false,
  "upvotes": 661,
  "upvote_ratio": 0.98,
  "comments": {
    "gokcbvn": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gokcbvn/",
      "text": "Sorry about that.\nShould you need help in your essays, I am your best bet. Shoot me a dm with the instructions.",
      "author": "Terrible_Bus_",
      "created": 1614157205,
      "upvotes": 1,
      "replies": {}
    },
    "gok1ijk": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gok1ijk/",
      "text": "Get in contact with your advisor. They can always put you with tutoring services or a learning center or other resources for you. Don’t forget that office hours are still a great place to go, especially for dumb questions.",
      "author": "Slow_Manufacturer_94",
      "created": 1614147667,
      "upvotes": 1,
      "replies": {}
    },
    "gojrvi7": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gojrvi7/",
      "text": "Listen buddy, failure is a part of life. The sooner you accept that fact, the better life will be fore you. Trust me when I say you are absolutely not the only student who has ever questioned whether they’re good enough for what they want to do. But if what you’re studying is your passion, retake the classes you failed. It’s not a big deal, when you fail just try again. Never let your failures define you. Never.",
      "author": "Buffincake",
      "created": 1614141187,
      "upvotes": 1,
      "replies": {}
    },
    "gojkue0": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gojkue0/",
      "text": "i was a chemistry major then i switched to cyber security. my professor always told me half of the class would fail because chemistry is so hard, which shouldn’t be bragged about. it should be taught better. i wish i could tell you good advice, but no matter how much you study, they will always throw questions that are so difficult that you may not be able to answer them. i took chemistry twice and i failed both semesters. it’s not for everyone",
      "author": "shittyredheadperson",
      "created": 1614137204,
      "upvotes": 1,
      "replies": {}
    },
    "goj8djw": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goj8djw/",
      "text": "You failed an exam, not the entire degree. Retake the classes if you fail them and do better. Study more next time.",
      "author": null,
      "created": 1614130889,
      "upvotes": 1,
      "replies": {}
    },
    "goj5uv3": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goj5uv3/",
      "text": "I had a terrible GPA my first semester at Texas A&M as a freshman. Years later, I have a PhD. It is not how you start; it is how you finish. Keep trying!",
      "author": null,
      "created": 1614129575,
      "upvotes": 1,
      "replies": {}
    },
    "goj1ika": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goj1ika/",
      "text": "This is an experience shared by all people who went through rough majors and people in the easy majors will never really understand. Getting bad grades is the norm for tough courses of study in STEM. Getting very good grades would actually be pretty rare. Exams are rescaled so that 70-80% of people pass, so in the future, just make sure you’re studying in a group and are not the dumbest person of the group. You’ll at least be ahead of the people who aren’t studying at all.\n\nKeep it up, or give up. You’re a grown up now. It’s up to you. I recommend you stick with it. The sense of security and power you get in knowing your mind can handle practically any nonsense the world throws at you after you graduate is almost intoxicating.",
      "author": "iwantknow8",
      "created": 1614127340,
      "upvotes": 1,
      "replies": {}
    },
    "goizi9z": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goizi9z/",
      "text": "I failed out of Med school and had to re-apply and start from zero. That experience taught me a lot and right now, I'm among the top in my class. Failure can be defeating or can be a learning moment. Don't let this be your defeat.",
      "author": "Lucem1",
      "created": 1614126337,
      "upvotes": 1,
      "replies": {}
    },
    "goiv617": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goiv617/",
      "text": "Gosh, I am a chem major, freshman and I have the same situation.",
      "author": "Amytof",
      "created": 1614124194,
      "upvotes": 1,
      "replies": {}
    },
    "goisjuy": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goisjuy/",
      "text": "I did miserable on my first A&P II exam...I got a 77 and it was only because of the extra credit points that I got an 82. Did I feel bad? Of course. I did stellar in A&P I, but for some reason I have been STRUGGLING to study this semester. As I type this, I'm getting ready to take my second A&P II exam. You know what I did? I took responsibility for my lack of enthusiasm, my lack of studying, and I turned myself around. I forced myself to study the chapters, read the PowerPoints, watch videos..in short, I took responsibility for my bad grade., my counselor says I'm showing classic signs of burnout, but the only thing I have on my mind is that I want that degree to say \"swollemolle\" on it at the end of my program.",
      "author": "swollemolle",
      "created": 1614122911,
      "upvotes": 1,
      "replies": {}
    },
    "goirbyp": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goirbyp/",
      "text": "There’s always this idea that people who go to college and graduate never fail but that’s not true at all. Failure is, dare I say, normal. My freshman year of college I got and F and a D and I q-dropped a class (which is to avoid failing). I realized that I can’t make myself be good at something and no matter how much you try you can’t make yourself be good at it and understand it. I realized that after failing so horribly at chemistry. The next year I switched to English and never looked back. I was even on the Deans list one semester. And I graduated in four years.",
      "author": "uglybutterfly025",
      "created": 1614122318,
      "upvotes": 1,
      "replies": {}
    },
    "goipusv": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goipusv/",
      "text": "I'm not sure where you study or how they do things but more often than not you're offered a chance to re-sit ( retake your exam ) - likely in the summer \n\nIt's highly probable the above is true, you almost certainly will not need to drop out \n\nhere are a few resources for the future :) \n\n**8 Essentials of Cramming for an Exam**\n\n[https://www.putsimply.co.uk/post/8-essentials-of-cramming-for-an-exam](https://www.putsimply.co.uk/post/8-essentials-of-cramming-for-an-exam)\n\n**6 Reasons Why You're Not Revising**\n\n[https://www.putsimply.co.uk/post/6-reasons-why-you-re-not-revising](https://www.putsimply.co.uk/post/6-reasons-why-you-re-not-revising)\n\n**How to Pass an Exam**\n\n[https://www.putsimply.co.uk/post/how-to-pass-an-exam](https://www.putsimply.co.uk/post/how-to-pass-an-exam)",
      "author": "PutSimply1",
      "created": 1614121582,
      "upvotes": 1,
      "replies": {}
    },
    "goip4dm": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goip4dm/",
      "text": "Do NOT drop out. Keep going. We ALL fail some tests.\n\nI got an A+ in Chemistry in high school; I failed my first chemistry exam in college. I dropped out. I regret letting that one test make my decision for me.\n\nYou're fine, pitter patter!!",
      "author": "shannon_nonnahs",
      "created": 1614121224,
      "upvotes": 1,
      "replies": {}
    },
    "goin2yr": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goin2yr/",
      "text": "The most successful people had to fail many times before. Do not worry about failure, for that is a single bump in the road on your way to success. You will get through this, take some deep breathes and a step back. Try and find time in your schedule to relax and destress as stressing will always make everything seem worse and will also make things worse.",
      "author": "BMOEevee",
      "created": 1614120246,
      "upvotes": 1,
      "replies": {}
    },
    "goijeuk": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goijeuk/",
      "text": "I missed one of mine! Why's a class that meets on Tuesday having a test on a Friday?",
      "author": null,
      "created": 1614118498,
      "upvotes": 1,
      "replies": {}
    },
    "goiibpx": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goiibpx/",
      "text": "Physics is a tough subject in general. Personally, usually the first test of the semester is my worst grade. But you can still get a good grade for the course. You learn what to expect and how much you need to prepare for the next exam. Keep trying. Attend office hours (even if it’s through zoom). I also recommend watching the organic chemistry tutor, as he often puts things in more understandable terms.",
      "author": "broopycat",
      "created": 1614117983,
      "upvotes": 1,
      "replies": {}
    },
    "goicn3o": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goicn3o/",
      "text": "Drink some koolaid and take a deep breath",
      "author": "IndecisiveShape",
      "created": 1614115439,
      "upvotes": 1,
      "replies": {}
    },
    "goibc7z": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goibc7z/",
      "text": "i don’t get why people stay in university if they have no motivation time after time. like maybe take a break and think about what you do have motivation to do",
      "author": "gregungha",
      "created": 1614114929,
      "upvotes": 1,
      "replies": {
        "goidmwj": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/goidmwj/",
          "text": "one word: parents",
          "author": null,
          "created": 1614115857,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "goi6as9": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goi6as9/",
      "text": "Dude...please chill out lmfao. No, you will not have to drop out. This is your first year of college and you failed your first exam. It won’t be the last. That doesn’t mean you rage quit when things get hard. You will be fine.",
      "author": "SuperBlueBloodMoon_",
      "created": 1614112981,
      "upvotes": 1,
      "replies": {}
    },
    "goi4znp": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goi4znp/",
      "text": "I basically had to stop going to school at one point and ended up with a GPA of 1.7. Now I'm about to finish my associate degree with a GPA of 2.68. It took a lot of work, but it's okay to fail sometimes!",
      "author": "vickyisicky",
      "created": 1614112476,
      "upvotes": 1,
      "replies": {}
    },
    "goi4yrl": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goi4yrl/",
      "text": "Studying shouldn’t be a result of motivation, it should be a result of discipline. If people went to the gym whenever they feel motivated, they wouldn’t lose weight",
      "author": "Plankyz",
      "created": 1614112466,
      "upvotes": 1,
      "replies": {}
    },
    "goi4aa6": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goi4aa6/",
      "text": "You can do it! Chemistry is a hellish subject that I am convinced was invented to torture us college students, you are not alone!",
      "author": "xxMiloticxx",
      "created": 1614112205,
      "upvotes": 1,
      "replies": {}
    },
    "goi47gb": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goi47gb/",
      "text": "Along with what everyone else said, this may be a sign that your interests aren't what you thought or are changing. But if you only feel like you aren't cut out due to grades, then that is a bad philosophy. Before you really consider that, think for a moment. Did you do your best? In preparation, studying, using office hours etc... If it keeps happening then you aren't cut out for it",
      "author": "pointlessarguments3",
      "created": 1614112174,
      "upvotes": 1,
      "replies": {}
    },
    "gohy9zo": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohy9zo/",
      "text": "My first chem class I got a 30 on the first exam and a 15 on the second. I failed. I failed again when I retook it. I took it a third time and got a B.  Then I was taking chem 2. It was tough but between group and individual tutors I had a B+. That was March 2020. In the time to the final I dropped about 20 points. I failed the class by 1 point and had to retake it over the summer. I passed over the summer and then had to do orgo last semester. I passed with a C+. \n\nNow I’m taking all bio courses and electives and it feels so much better (minus the pandemic and general shittiness of the last year). It’s tough, my gpa is definitely hurting, it felt like I’d fail or never escape but I got through it. Now I feel like I’m a better person and student for sticking with it. College is tough. Many people change majors or dropout but it really comes down to what my advisor said when I failed chem the second time, “You’re going to hit rock bottom at one point. Maybe you hit it already, maybe you haven’t hit it yet. It’s going to suck. You’re going to have to ask some tough questions. Is this what you want? Is this worth it? No one can tell you the answer. That’s something you have to decide for yourself. You can choose to give up or find another path, there’s nothing wrong with that, or you can choose to keep fighting and find out how far you can go.”",
      "author": "Mail540",
      "created": 1614109762,
      "upvotes": 1,
      "replies": {}
    },
    "gohundc": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohundc/",
      "text": "Please go to your professor and ask what you did wrong and how to fix it for future exams. You don't wanna keep this up. Failure happens to everyone, just gotta power thru and learn thru it : )",
      "author": "SergeantBenton",
      "created": 1614108178,
      "upvotes": 1,
      "replies": {}
    },
    "gohrxof": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohrxof/",
      "text": "My older sister wanted to major in chemistry, and she did start college out with it. She was number five or six in her class in high school and had multiple scholarships, so she’s pretty smart. She changed majors because she thought chemistry was hard and didn’t want to lose her scholarships. She’s majoring in digital media now, but she’s enjoying it",
      "author": "Best_Bisexual",
      "created": 1614106992,
      "upvotes": 3,
      "replies": {}
    },
    "gohq082": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohq082/",
      "text": "I had a very similar experience in my first year of university studying biomedical science. I was terrible at math but loved biology, so I focused on biology classes but let math fall by the wayside. I failed differential calculus (I got around 12% I think). I lost all motivation with college and had the same imposter syndrome you described (wondering if you're even cut out for the degree). I failed calculus again in the repeat exam, and then AGAIN by only 2% when I had to repeat the year. They let me through for medical reasons.\n\nSo I don't what my point is. Just that you aren't alone in feeling this way and it's completely normal to feel demotivated after failing an exam. But if you can repeat this physics exam at any stage then you can pass it.",
      "author": "smellytrashboy",
      "created": 1614106164,
      "upvotes": 4,
      "replies": {}
    },
    "gohoulq": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohoulq/",
      "text": "College freshman, Chem major here as well. I'm pretty sure it's all about time management. I'm a huge procrastinator, so I have to plan out times to do my work. Generally i take at least an hour before each exam to go over everything another time. For me, I'm really enjoying o-chem because it doesnt have many equations at all. It'll probably get better, even though I'm in the same boat. Try going one more semester of chemistry, then switch if you still don't like it.",
      "author": "Juniper02",
      "created": 1614105669,
      "upvotes": 1,
      "replies": {}
    },
    "gohnic7": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohnic7/",
      "text": "Don't be afraid to schedule a meeting (even if online) and ask your professor \"what can I do to improve,\" or \"what have I been doing wrong?\" Communicating with your professors can be really important in realizing what either needs to be fixed, or (and this is the important one) what you've been doing right. Finding positives in the negative experiences can change perspectives",
      "author": "FenixFyre09",
      "created": 1614105102,
      "upvotes": 1,
      "replies": {}
    },
    "gohj2rt": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohj2rt/",
      "text": "Study as hard as you can and on your free time ask for help from a tutor or professor on stuff you missed on the first exam. This is just the first exam, keep grabbing all the easy points and I am sure you can still pass the class with a good grade! Hang in there friend !!!",
      "author": "Nevertrumper2019",
      "created": 1614103205,
      "upvotes": 1,
      "replies": {}
    },
    "gohiuv1": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohiuv1/",
      "text": "I’m a biochemistry student in my final semester of uni. I have failed so many exams throughout my college career for so many reasons but I will still be graduating on time with honors and offers from graduate schools and employers. The first year transition from secondary school to uni is always a difficult one. I bombed my first calculus exam and had to retake physics altogether after dropping it the first time because I failed the first exam so badly. \n\nChemistry is a difficult subject and just because you may not do well occasionally doesn’t mean you’re not cut out for it. You still have potential to be a great chemist and graduate with a stellar record so try not to let anxiety and intrusive thoughts put you off. \n\nI will also say that foundational chemistry classes are always a nightmare (I struggled more in gen chem than graduate level biochemistry because the class was so badly organized and taught) and personally, I have never met someone who was good at/comfortable with both chemistry and physics. All my chem friends hate physics and all my physics friends hate chemistry. I think they just require a very different style of critical thinking and very few people are competent in both. \n\nSo hang in there! You’ve got this",
      "author": "orgodeathmarch",
      "created": 1614103110,
      "upvotes": 1,
      "replies": {}
    },
    "gohhxcp": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohhxcp/",
      "text": "lmao I nearly got kicked out of the mechanical engineering program at my university for poor performance early on. Not long after, I nearly dropped out because I didn’t think I could take it mentally. I got my diploma a couple weeks ago. Stick to it, you’ll be okay!",
      "author": "holycornflake",
      "created": 1614102713,
      "upvotes": 3,
      "replies": {}
    },
    "gohheau": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohheau/",
      "text": "I’m just going to tell you from lived experiences, I’ve failed handfuls of midterms, even finals. Graduating this June. \n\nMy other friends who excelled in high school science and math classes failed epicly in first year physics, chemistry, calculus. It’s a different game in college/university.  Do not let 1 exam in undergrad dictate your entire life.",
      "author": "hattokatto12",
      "created": 1614102492,
      "upvotes": 3,
      "replies": {}
    },
    "gohgt2v": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohgt2v/",
      "text": "There is a huuuuuuuge learning curve your first semester of college. If you enjoyed learning in high school, you will enjoy learning in college. It will take time to adjust to the new style though :) don’t get discouraged, and study smart, not (too) hard!",
      "author": "skrrtlord667",
      "created": 1614102283,
      "upvotes": 2,
      "replies": {}
    },
    "gohg1ac": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohg1ac/",
      "text": "The greatest teacher, failure is.",
      "author": "SebRev99",
      "created": 1614102006,
      "upvotes": 1,
      "replies": {}
    },
    "gohelus": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohelus/",
      "text": "Wish I had a wholesome award right now.",
      "author": "xFaJacos",
      "created": 1614101488,
      "upvotes": 1,
      "replies": {}
    },
    "gohdk4l": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohdk4l/",
      "text": "I would advise you to just ignore the fact that you failed that exam for now. Thinking about bad grades/having failed the exam is extremely demotivating! I would not think too much about the question whether you are suited for this major and just try to do your best for the next exams. Don’t think about consequences or anything but just study (maybe even take on a mindset as if you had passed all the past exams). If you successfully do that and really concentrate on studying you will probably succeed (as you said that the main reason for failing that last exam was because you didn’t study enough. Not because you had major problems understanding the content). I think a good grade or a pass will be the thing that will bring back your joy and motivation for future exams. \nSo give yourself another 1 or 2 semesters before thinking about quitting!\nI think it’s definitely worth a try!! :)",
      "author": "BlinaXx",
      "created": 1614101111,
      "upvotes": 1,
      "replies": {}
    },
    "gohd6lw": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohd6lw/",
      "text": "Study hard and smart, use your colleges tutoring and really just do as much as you can. Physics is tough but one thing everyone alright or good at physics has is they take the time to do the problems and figure them out so they make sense. Start a study group with others and really ask for help from anyone when you need it, it's okay to fail,  but it's not okay to stay down, you need to get back up and really go for it dude. You can do it, you just need to work hard at it. If you think you get something, keep working at it, some teachers and classes are harder than others and can be deceiving in making you think you know the stuff, when you don't. Good luck my dude, you can recover!",
      "author": "jsimercer",
      "created": 1614100973,
      "upvotes": 2,
      "replies": {}
    },
    "gohb5k2": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohb5k2/",
      "text": "I recommend going out on YouTube and looking for videos and examples of the problems you are having difficulty with. Understanding why you are getting things wrong is probably the more important thing in physics, math, and statistics. You need to learn not just how to arrive at the answer, but why (and why not something else). Understanding the nature of the problems more deeply before trying to answer them will help with that.",
      "author": "SpectrumDiva",
      "created": 1614100247,
      "upvotes": 5,
      "replies": {}
    },
    "gohaqoc": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gohaqoc/",
      "text": "I know it's a phrase, but try not to worry about it too much, especially in the beginning. The first class I attended was, ironically, also one of the last classes I passed before finishing my bachelor's.\n\nTake your time to get used to the new environment at uni/college and find a group of people via the online offers of your college, especially now during Corona. At least that's what helped me",
      "author": "CombatWombat994",
      "created": 1614100094,
      "upvotes": 1,
      "replies": {}
    },
    "goh9g9o": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh9g9o/",
      "text": "Just keep going! That’s really the best advice bc no matter what there is still always a chance. I would also reach out to your professor and explain your situation. They are willing to help if you are willing to reach out. School in times like this are ridiculously hard and you should really take advantage of all the help you can get! I failed one of my classes last semester & I thought the world was over for me lol, but even if you do fail, you just get right back up and do it again (w a different professor lmao). If it’s something you really want and enjoy, you’ll make it work. Don’t let this struggle define you. We are all struggling during these times, so when we make it we’ll just be even more badass. I wish you the best of luck and I hope I didn’t ramble too much. O_o lmao :)",
      "author": "JMR3898",
      "created": 1614099622,
      "upvotes": 1,
      "replies": {}
    },
    "goh75xf": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh75xf/",
      "text": "Stop the downward spiral of negativity. Many go through this at some point, you will look back at one day and be happy that you eventually passed and went through it. You will be giving the next person who feels this way advice on how to overcome.",
      "author": "Tutorshares",
      "created": 1614098798,
      "upvotes": 11,
      "replies": {}
    },
    "goh6v7t": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh6v7t/",
      "text": "I just wanted to tell you, take a couple deep breaths. And for the love of all that's holy, GIVE YOURSELF A BREAK.  You're still a first year student in a hard major, and that's not an easy transition. First exams are really hard. You don't know what to study, what type of questions they ask, what the professor's grading style is. There is so many unknowns that you don't know until after you take the exam. What is the worst that's going to happen from this? You realize this isn't what you want to do, and that means you can spend your time focusing on stuff you actually enjoy doing. But beating yourself up about this isn't going to help or do anything beneficial for you.",
      "author": "alybear567",
      "created": 1614098690,
      "upvotes": 2,
      "replies": {}
    },
    "goh4djh": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh4djh/",
      "text": "If you can learn from your mistakes and own up to it, you can improve for next time. Although it definitely sucks (I failed a class so badly I didn’t bother showing up for the final), you should be able to take the class(es) again for grade replacement. \n\nMy advice would be don’t give up, one class (and especially not one or two exams!) doesn’t define you as a student. Take a break, come back stronger and more motivated if you need to. Take a look and see how badly you want it, and if it matters to you then you can take that second chance. But, the point is, there’s always a second chance, TONS of people fail exams and classes. It’s the ones who come back from it that get the degree, that’s why it’s worth it to employers. \n\nKeep your head up!",
      "author": "Scorpia03",
      "created": 1614097778,
      "upvotes": 3,
      "replies": {}
    },
    "goh3z0l": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh3z0l/",
      "text": "I’ve always been notoriously bad at exams myself. There was a time in my political science test where I walked out of that exam feeling incredibly confident with how well I did; I thought I aced it. I got a D on that test.\n\nGenerally, know when you need to study more or utilize more academic resources such as office hours or tutoring. Yes, I know it can be anxious to use them, especially when you don’t have that in-person assistance, but you should know when to reach out for more help. I myself have been someone who has breezed by high school with no troubles. This is college, not high school. You actually need to work hard and study hard to get good grades. Your teachers aren’t making As free handouts anymore.",
      "author": "simberry2",
      "created": 1614097610,
      "upvotes": 9,
      "replies": {}
    },
    "goh33uv": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh33uv/",
      "text": "I just graduated, with a 3.4.\n\nI got a .5 GPA my first semester.\n\nIt's only a waste of time if you didn't learn from that failure. If you learn how you learn, then it is worth it. Regroup and attack it again, keep your chin up and you will make it.",
      "author": "you90000",
      "created": 1614097232,
      "upvotes": 68,
      "replies": {
        "goh9d3w": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/goh9d3w/",
          "text": "can i ask how you did that? my GPA (right now, after first semester) is 3.03 and i feel like it’s bad because everyone told me in first year, i should get the highest possible grade.",
          "author": "jennie033",
          "created": 1614099592,
          "upvotes": 19,
          "replies": {
            "goh9knf": {
              "link": "/r/college/comments/lqjled/failed_my_first_exam/goh9knf/",
              "text": "Wrong priorities. I was too focused on my girlfriend at the time. I drop 3 hours everyday to be with her.",
              "author": "you90000",
              "created": 1614099665,
              "upvotes": 16,
              "replies": {
                "goh9rc7": {
                  "link": "/r/college/comments/lqjled/failed_my_first_exam/goh9rc7/",
                  "text": "how did you manage to bring up your GPA after first year? i really wanna do that this semester.",
                  "author": "jennie033",
                  "created": 1614099733,
                  "upvotes": 7,
                  "replies": {
                    "goha4w4": {
                      "link": "/r/college/comments/lqjled/failed_my_first_exam/goha4w4/",
                      "text": "You retake the classes you failed. \n\nAnd how I passed was I put time into projects, studying, and office hours.\n\nOh do any extra credit you can. Buffers are great for tests and help with stress with tests.\n\nAlso make friends for study groups, helps with accountability and learning.",
                      "author": "you90000",
                      "created": 1614099876,
                      "upvotes": 17,
                      "replies": {
                        "goi2ahm": {
                          "link": "/r/college/comments/lqjled/failed_my_first_exam/goi2ahm/",
                          "text": "Can I ask what happened to your girlfriend?",
                          "author": "ClariV2",
                          "created": 1614111441,
                          "upvotes": 1,
                          "replies": {
                            "goi2fjw": {
                              "link": "/r/college/comments/lqjled/failed_my_first_exam/goi2fjw/",
                              "text": "Broke up with her,. Causing too much stress with driving, and I needed to focus on school.",
                              "author": "you90000",
                              "created": 1614111494,
                              "upvotes": 11,
                              "replies": {
                                "goi2on3": {
                                  "link": "/r/college/comments/lqjled/failed_my_first_exam/goi2on3/",
                                  "text": "Were you guys not in the same college? I'm in my first year in a relationship as well  (we live a couple minutes away) and i feel I could study a lot more if we didn't spend time together but I don't really want to give that up",
                                  "author": "ClariV2",
                                  "created": 1614111590,
                                  "upvotes": 3,
                                  "replies": {
                                    "goi3dfi": {
                                      "link": "/r/college/comments/lqjled/failed_my_first_exam/goi3dfi/",
                                      "text": "She wasn't in college, no job, no car. She was in a completely different city.\n\n A lot of issues. \n\nIt wasn't a bad break up, we still keep in contact, but she needs a lot of help which I can't provide.\n\n\n\nIf you want your relationship to work, have a set day to hang out, set day for school. You have to be organized. School has to take priority, if she doesn't realize this, you need to break up. School is what will allow you to help her even more in the future.",
                                      "author": "you90000",
                                      "created": 1614111860,
                                      "upvotes": 8,
                                      "replies": {
                                        "goi3mh9": {
                                          "link": "/r/college/comments/lqjled/failed_my_first_exam/goi3mh9/",
                                          "text": "You do have a point ye, I will try to do that. Thanks dude, hope everything goes well for you :)",
                                          "author": "ClariV2",
                                          "created": 1614111953,
                                          "upvotes": 3,
                                          "replies": {
                                            "goi3t7u": {
                                              "link": "/r/college/comments/lqjled/failed_my_first_exam/goi3t7u/",
                                              "text": "Good luck to you!",
                                              "author": "you90000",
                                              "created": 1614112023,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        },
                                        "gojmq97": {
                                          "link": "/r/college/comments/lqjled/failed_my_first_exam/gojmq97/",
                                          "text": "I don’t even have time to treat myself I have no clue how I’d even put the needs of another person emotionally on top of school haha, props to those that can do it. I’d crumble with stress and burn out. Literally, I only have time to eat some food nowadays, school is crazy.",
                                          "author": "spicyystuff",
                                          "created": 1614138230,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "goijk6y": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/goijk6y/",
          "text": "I started w a 3.8 i feel like with this semesters start I'll have an inverse of your gpa trajectory",
          "author": null,
          "created": 1614118568,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "goh2bme": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh2bme/",
      "text": "My buddy scored a 19 on his first thermodynamics test. He ended up passing with C. You'll be fine as long as you can get your shit together, recognize why you failed, and do your best to fix it. \n\nI personally got a 35 on my first Fluid Mechanics exam, and got pissed at myself for it and was able to get an 85 and a 74 to finish the course with a C. Could I have gotten better than that? Yes and I should have. But I didn't. And I learned from it.",
      "author": "WWalker17",
      "created": 1614096890,
      "upvotes": 7,
      "replies": {}
    },
    "goh1vb4": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh1vb4/",
      "text": "Lemme tell you my Chemistry story.\n\n&#x200B;\n\nGen Chem 2, first exam of the semester, 30 questions multiple choice, went to every SI session and saw the professor multiple times during office hours.\n\nI get my exam back expecting maybe a 50% or 60% I got an 11% *AFTER* the curve, pre-curve it was 6.6% AKA 2 out of 30 questions right.\n\n&#x200B;\n\nYou will fail exams, it happens to most people. And the best part is, you *will* survive :D\n\n&#x200B;\n\nI'm now a happily graduated student and a fellow degenerate in /r/wallstreetbets \\- I couldn't be happier with my life!",
      "author": "GennaroIsGod",
      "created": 1614096721,
      "upvotes": 6,
      "replies": {}
    },
    "goh1m5j": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh1m5j/",
      "text": "Time to be a business major lol",
      "author": "nickydaddyy",
      "created": 1614096626,
      "upvotes": 1,
      "replies": {}
    },
    "goh1g2g": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/goh1g2g/",
      "text": "Don’t worry. You’re in your first year so you’re still learning “the game” so to speak. I wouldn’t go far as to thinking about dropping your studies altogether. Best way is to take it as a learning opportunity and maximize success for the next step forward. Hindsight is 20/20 so it’s reasonable that you’ll feel stressed out about this but it’ll be better to focus your stress and energy on upcoming assignments/exams. Don’t fall in the spiral of being stressed out from what happened in the past without looking ahead.",
      "author": "xMacadamiaNuTx",
      "created": 1614096563,
      "upvotes": 2,
      "replies": {}
    },
    "gogzb85": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogzb85/",
      "text": "Henlo stranger! Same situation here. Im studying ChemE and I received a failing grade on midterms. As of today I'll be taking my 2nd quiz for finals and in a few days my finals exam... Im sure I'll fail them and highly fail this class. Im sad.",
      "author": "Oktibles1",
      "created": 1614095701,
      "upvotes": 1,
      "replies": {}
    },
    "gogybwu": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogybwu/",
      "text": "I don’t know why I’m still subscribed to this subreddit but maybe it was just to tell you this. I’m 35 now but when I was an undergrad I failed my first ever college exam. I studied just like in high school but it didn’t work. You reteach yourself how to take tests and study how the professor makes their tests. I failed my first exam with a 60, but I graduated in 4 years with a 3.5 GPA. Keep working. Don’t just learn from the material, but learn the tendencies of how the tests are written.",
      "author": "tna4u2",
      "created": 1614095279,
      "upvotes": 5,
      "replies": {}
    },
    "gogxtbi": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogxtbi/",
      "text": "First semester physics is usually hard for students cause it’s different from how it’s taught in highschool. All I can say is keep your head up. you failed, it happens. Now what will you do about it? How will you make sure you aren’t in the same boat? You got this. Don’t drop out cause of one L. Remember, The path ahead is filled with many losses, only the perseverant survive to the end.",
      "author": "justtrynasurviv3",
      "created": 1614095047,
      "upvotes": 7,
      "replies": {}
    },
    "gogwjk1": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogwjk1/",
      "text": "I remember being a chem student in college. I got a 40 on one of my physics exams and was convinced I was doomed. 5 years later I’m a physical chemistry PhD student and doing very well! I promise that you are not doomed! Just figure out exactly why you didn’t do well on this exam and study hard going forward. Physics is rough for a lot of people (including me, I never seemed to do very well in it). Best of luck!",
      "author": "greenyoshis",
      "created": 1614094469,
      "upvotes": 11,
      "replies": {}
    },
    "gogv5j1": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogv5j1/",
      "text": "First year always comes with the worst grades, it just be like that. I got a 2.4 gpa my first sem at Rutgers (last fall) now my overall is a 3.5. Just do your best, you’ll recover from it",
      "author": "emilyrgall",
      "created": 1614093831,
      "upvotes": 21,
      "replies": {}
    },
    "gogutm6": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogutm6/",
      "text": "i only passed 1 out of 9 exams in my first two semesters. i was ashamed and thought a lot about quitting. but i pulled through! i changed the way that i studied. i used to study the way friends did, but now i feel more comfortable doing it my way. \nstart to study 2 months before your exams. it may sound really far away then, but if you prepare all of your study sheets and study question, you’ll have more time to actually study and you‘ll have already familiarised yourself with your topics. \n\n(and also i find it much easier taking exams a second/third time because you‘ll have a better grasp at the questions and what actually is needed for the exams)",
      "author": "baeksoo",
      "created": 1614093677,
      "upvotes": 50,
      "replies": {
        "gogv8l6": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/gogv8l6/",
          "text": "i do really recommend starting early though! \nbecause then you‘ll have much more time to take breaks and you wont have to cram all of the information at once. AND therefore you’ll feel less stressed and more at ease. \n\ndon’t worry for now. see this as a learning curve. college exams and study habits are totally different to how they used to be at high school. \nas long as you realize that you have to change and therefore start to do the change everything will be fine. \nit‘s good that you’ve realized it this quickly. now you can adapt better. \ni’m wishing you good luck. if you have any more need for advice or more questions feel free to dm me.",
          "author": "baeksoo",
          "created": 1614093871,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "gogufj2": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogufj2/",
      "text": "learn from your mistakes, this is life, welcome.",
      "author": "dutchbarbarian",
      "created": 1614093494,
      "upvotes": 8,
      "replies": {}
    },
    "gogtljl": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogtljl/",
      "text": "I scored a 30 on my first statics test. That’s 30 out of 100. Then I scored 30 something on my second. I repeated it the following year and had a 99ish average. I only missed a point or two for minor mistakes. \n\nLooking back I realize it was good for me to experience that, because it cured me of my fear of failure and it helped me realize that I am still cut out for it, and what matters is whether you come back to try again.",
      "author": "SplatterPlot",
      "created": 1614093109,
      "upvotes": 271,
      "replies": {
        "goi97py": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/goi97py/",
          "text": "I just got a 67 on my stats test. I hope I will end up improving like u did man",
          "author": "BlueNets",
          "created": 1614114095,
          "upvotes": 29,
          "replies": {
            "goiblij": {
              "link": "/r/college/comments/lqjled/failed_my_first_exam/goiblij/",
              "text": "67 is totally recoverable, my dude",
              "author": "SplatterPlot",
              "created": 1614115027,
              "upvotes": 31,
              "replies": {}
            },
            "gojl3dl": {
              "link": "/r/college/comments/lqjled/failed_my_first_exam/gojl3dl/",
              "text": "I got a 20% on my Physics 2 exam and a 62 on my Diff Eq exam so far this semester. Last semester I got a 0% on my first Calc 3 exam (my grandfather died hours before and I just couldn't handle it). I ended up finishing with a C. \n\nNeedless to say, my study habits have changed drastically for the better.",
              "author": "M1A1Death",
              "created": 1614137337,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "gojd12j": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/gojd12j/",
          "text": "I got a 35 on my first calc 1 exam. Busted my ass and got a 90 on the final, failing is no biggie!! Ended up giving me alot of motivation to improve.",
          "author": "Puzzleheaded_Can_750",
          "created": 1614133285,
          "upvotes": 5,
          "replies": {
            "gok5ghn": {
              "link": "/r/college/comments/lqjled/failed_my_first_exam/gok5ghn/",
              "text": "Good for you!  I think I got a less than a 50 on my first gen chem exam.  I ugly-cried in the bathroom after we got the exams back.\n\nIt was the motivation I needed to improve, and I ended up with an A in a class that had like a 40% drop rate.  I now tutor for chemistry!",
              "author": "ThereIsNo14thStreet",
              "created": 1614150903,
              "upvotes": 2,
              "replies": {}
            },
            "gol0cx1": {
              "link": "/r/college/comments/lqjled/failed_my_first_exam/gol0cx1/",
              "text": "I rode a low C all through differential equations and then wore out a few dry erase markers with some friends working for the final. I was the second to the last person to leave the room, and the last page of the exam was nearly translucent with all the erasing I did. \n\nI scored a 100, and apparently there's no such thing as student-teacher confidentiality because all the other teachers of the math department that knew me were commenting on it whenever they saw me. :D",
              "author": "SplatterPlot",
              "created": 1614175885,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "goircfh": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/goircfh/",
          "text": "Im currently repeating my mechanics course and im just stressed since my ‘teacher’ just sends the class notes and problems and expects us to do it. I already flopped two quizzes but hopefully i’ll be able to understand and ace it",
          "author": "arayeah",
          "created": 1614122324,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gogqpl1": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogqpl1/",
      "text": "You need to think positively. Don't let the fear of failing  and the guilt of not studying to actually fail you. Be the motivation you need. Meanwhile study as much for the remaining papers and hope for the best. Take this, from a sophomore medical student. Best of luck!!",
      "author": "Dull-Duty5900",
      "created": 1614091772,
      "upvotes": 29,
      "replies": {}
    },
    "gogoz2i": {
      "link": "/r/college/comments/lqjled/failed_my_first_exam/gogoz2i/",
      "text": "Always remember ,the path to the  peak of a mountain includes abrupt slopes . So just keep pushing and keep learning",
      "author": "MESSboi783",
      "created": 1614090947,
      "upvotes": 238,
      "replies": {
        "goidakm": {
          "link": "/r/college/comments/lqjled/failed_my_first_exam/goidakm/",
          "text": "This is so true. I failed two exams in my first year - I got 35% on a physics midterm and I even managed to get 48% on my bio final but still pass the course. Now I have a masters and am in law school. First year was probably the hardest for me as it took time to get into the swing of university. Don't lose hope!",
          "author": "pandoaspen",
          "created": 1614115709,
          "upvotes": 13,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634057556
}