{"sid": "epchz8", "link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/", "title:": "Is it weird to be aggressively asocial during college?", "text": "I'm currently a freshman, don't have any friends and have never had a girlfriend. This is continuing on from high school, where I found that I developed a pattern of exhaustively isolating myself from everyone but my family, and wound up leaving school with little to no practical social skills. In college it's only gotten worse, as I've found that, for whatever reason, I'm so scared of people that I will go out of my way to avoid them both physically and conversationally. I constantly move away from people, I never sit next to anyone and I always move as far away as I can if someone sits next to me. I also don't make conversation unless absolutely necessary, and I have no experience with small talk. However, since I'm in college I want to have fun and try and enjoy myself, since I know I'll likely never experience anything like this again. How can I change this and try and reach out? I've tried doing clubs, but there aren't any good ones on my campus so I feel like I've run out of options.", "author": "Adam_Drivers_Ass", "created": 1579140408, "retrieved": 1632947877, "over_18": false, "upvotes": 721, "upvote_ratio": 0.98, "comments": {"ff58se3": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/ff58se3/", "text": "Not sure how much I can help since I feel the same way, but one thing that helped me alot was working part time at Chick-fil-A. As I worked, I felt my confidence increase and usually a coworker at the register over would try and do small talk with me. But probably what made me feel really confident and gives me confidence is that the more I worked, the more I got the impression that the customers were actually as awkward and antisocial as me. Although I'm not sure its right to interpret it this way, I now carry this view that \"this person is probably as awkward and insecure as me\" whenever talking to a stranger and it gives me some confidence. If you like to game, try finding someone to play with you via discord call(if you play halo or l4d2 hit me up, I'll play with you), I'm not sure, but that might help you along the way and not require you to put alot of effort.(Might actually be worth researching). But remember, baby steps, you can start by finding your local college esports discord or gaming discord, find people to play with and start by playing online with them from there. Then maybe switch to local play from there. Now I know this is kinda exclusive to gaming, but hobbies usually are a good way to get started. \n\nTL;DR: Getting a part time job will teach you pretty fast the basics. Also understand that people are insecure, you don't have to feel like taking 30 seconds of their time to try and initiate an conversation is a big deal, if they ignore you or avoid you, fuck em, you'll never see em again. Also try and listen and watch instead of speaking, don't feel forced to try and initiate a conversation, people love talking about themselves, let them do it.", "author": "Regicide62", "created": 1579583637, "upvotes": 2}, "feol16e": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feol16e/", "text": "Something I got used to doing is just introducing myself to the person next to me. It's a pretty decent ice breaker for me cause they usually interact with him on and off after that( which is better than nothing at all). Surprisingly this works well with females. I'm a commuter student but it seems like its easy to make friends if you live in the dorms.", "author": "freeignition", "created": 1579301602, "upvotes": 2}, "feo1ixe": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feo1ixe/", "text": "Hi! I’m currently in college as a freshman and one thing I can say is just be yourself. You are who you are. One thing I learned is that everyone is scared of everyone. Your mind is the only thing holding you back. \nFirst you should start with smiling, it will not only make you feel good but other will smile at you because it’s normal. \nTalking to someone will never hurt, just be like hey what’s ur name what’s ur major. Just little questions open up so much room for a friendship to form. Talk about what interest you and don’t ever be scared to say “hey we should hangout sometime” or something along those lines. \nAsk for a Snapchat or instagram everyone loves more followers! Only you can do it and just like the all the millions of people on this earth you will do just fine. Humans are excellent communicators so don’t let your brain put you behind bars😤. \nDon’t be afraid of anything ever!", "author": "empathetic_user", "created": 1579293864, "upvotes": 2}, "fenxl0m": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fenxl0m/", "text": "Two words: STUDENT LOUNGE.", "author": "ThisSubIsRacistAsf", "created": 1579292308, "upvotes": 2}, "fenojdf": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fenojdf/", "text": "\"It is really too bad, unfortunate, that our schools do not teach conversation-skills, or that our society doesn't place more importance on conversation-skills. They are just as important as math or history or any other subject. Hell, to me, they are much more important, thousand times, million times more important, because communication is the way you climb social-ladders.\" \"The better you are at conversation, the easier it is to get a job, promotion, attract people to form relationships, networking with people to advance professionally, and befriend people with ease\"\n\nI feel they should be mandatory for guys, men, because the burden of opening your mouth first always is one-sided.", "author": "H8CourtshipALot217", "created": 1579288606, "upvotes": 2}, "fenk4y0": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fenk4y0/", "text": "I have some of the same problems but I talk a little bit more to people but I just don’t fw my peers half of the time but you got this", "author": "Xfelix17", "created": 1579286418, "upvotes": 2}, "felnmxh": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/felnmxh/", "text": "Your behavior is protective. As long as you continue to treat people in this manner, you don't have to encounter any potentially complicated emotional feelings toward another person or persons. But this isn't healthy. You know it, which is why you're reaching out on here, and congrats to you for that! \n\nI have a few suggestions. \n\nTry saying hi to folks. Look them in the eye when you do and smile. You will be amazed how good this makes you feel. \n\nGet a part time job or volunteer somewhere. Why? Because having a common purpose or interest virtually forces you to interact with others in that environment, and is a great way of making acquaintances and friends. \n\nFinally, and this is the hardest one to master: Get. Out. Side. Get off the computer/phone. Go out into the world. You can have 100 facebook friends and still feel like the loneliest person in the world. \n\nGood luck, hope one or two of these help.", "author": "FrenchPressYes", "created": 1579226497, "upvotes": 2}, "fekqvuc": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fekqvuc/", "text": "I can talk to like one new person a week, it’s awkward and hard, but it makes my classes more enjoyable", "author": "NorseGodOdin", "created": 1579205739, "upvotes": 2}, "fekmywj": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fekmywj/", "text": "Yes, it's weird in more than one way.\n\nYou are basically paying to attend college and avoiding half of the benefit. College is half learning and half connecting, by not talking to people you are getting half the benefit everyone else will get. Academics is really often not the most important thing.\n\nWhy exactly are you attending a traditional college? If you aren't going to spend time connecting with people it makes more sense to do a cheaper option like online or evening courses.\n\nEveryone talks about the \"having friends\" part but no one talks about just how different your life is and will end up with and without connections and a strong peer group in college.", "author": null, "created": 1579203410, "upvotes": 2}, "fekh9vf": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fekh9vf/", "text": "No all the friends I’ve made in college the few I did I have lost over the years people change & move on. I’ve always viewed college friends as pointless so never bothered much. Worked out fine for me to each their own I guess.", "author": null, "created": 1579200015, "upvotes": 2}, "fekfi45": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fekfi45/", "text": "Take classes that require group work or smaller discussion sessions", "author": "renoka", "created": 1579198959, "upvotes": 2}, "fekatf8": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fekatf8/", "text": "Sounds like you have some anxiety issues. Don't fret, it's very common. Would you consider talking to a therapist? Most Universities have a mental health service.", "author": "Elastichedgehog", "created": 1579196181, "upvotes": 2}, "feka2t7": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feka2t7/", "text": "Join 👏clubs 👏 on 👏 campus 👏", "author": "metalaoraor", "created": 1579195746, "upvotes": 2}, "fek80vh": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek80vh/", "text": "Same. My social anxiety is bad. I have zero friends. I give up trying to even make any =/", "author": "Scadeau101", "created": 1579194532, "upvotes": 2}, "fek7bl3": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek7bl3/", "text": "Book suggestion: How to win friends and influence people. Read it :) And push yourself a little bit out of your comfort zone, that's where growth happens. Try small talk. Try opening the door for someone and just say hello. Approach someone that looks like they might be having a hard time, you have this ability! If it's terribly awkward and uncomfortable, good. Keep doing it. It'll help you be comfortable to expand to more long form conversations over time.", "author": "FerrilDavis", "created": 1579194111, "upvotes": 2}, "fek5ks1": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek5ks1/", "text": "That's my life dude 🤣🤣🤣 and fucking love being alone the whole time xD", "author": "kirasiris", "created": 1579193078, "upvotes": 2}, "fek3xi8": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek3xi8/", "text": "You should watch YesTheory on youtube. They are insanely good at talking to people and even offer some tips in some of their videos. I have found a lot of positivity from their videos and I think you could too.", "author": "TheBoogyMan_", "created": 1579192087, "upvotes": 2}, "fek3ppb": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek3ppb/", "text": "Rush a frat honest to god changed my life", "author": "thehawaiian_punch", "created": 1579191956, "upvotes": 3}, "fek2sm2": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek2sm2/", "text": "Leave your dorm room door open! \n\nIt may be the second semester, but it's never too late to meet people.  Another thing I may suggest is ask someone in a class for a small favor.  Borrow their pen, watch your bag while you run to the bathroom, etc.  Now you have a familiar face to small talk with before class, on campus, whatever and go from there", "author": "FreeSkittlez", "created": 1579191397, "upvotes": 2}, "fek2aw9": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek2aw9/", "text": "Get a job on campus. Join activity clubs. Take classes out of your comfort zone. Volunteer. Just be nice, strangers are friends you haven't met yet.", "author": "iamrubberyouareglue8", "created": 1579191094, "upvotes": 2}, "fek20ab": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fek20ab/", "text": "Try Meetup groups!", "author": "Of_Blades_", "created": 1579190913, "upvotes": 3}, "fejzeg0": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejzeg0/", "text": "Honestly, I get this. I have extremely bad Social Anxiety and I had started college (I too am a freshman btw) trying to avoid everyone. Even so, I am trying to put myself in uncomfortable situations such as talking to \"strangers\" and makin small talks. It will be hard at first but using coping mechanisms such as controlled breathing (E.g. breath in for 4 counts, hold for 7, and breath out in 8 and keep doing that. It slows your heart rate and decreases the production of the stress hormone) and Cognative Behavioral Therapy (Challenging your automatic thought with positive or realistic thoughts. E.g. your initial thought is \"I am not social enough to talk to others.\" And you correct it to \"I can do this because there is always room to improve ). I use both of these on a daily basis so, I know they work for me and I hope that these can help you as they do for me. Good luck!", "author": "LeeDaLeeMustArt", "created": 1579189302, "upvotes": 3}, "fejyo0t": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejyo0t/", "text": "I didnt have friends at first, i just started saying HI and hello to random people in a polite way and friends just came by", "author": null, "created": 1579188841, "upvotes": 2}, "fejxqrw": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejxqrw/", "text": "Volunteer work is a really good place to meet friendly people. Most people are there because they want to be, and it's usually easier to talk to people if you're working on a task together.", "author": "poondi", "created": 1579188256, "upvotes": 2}, "fejxq0j": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejxq0j/", "text": "that sounds a lot like it could be social anxiety. you should consider seeing a therapist; a lot of universities offer free therapy for those who need it! see if yours does.\n\nif you feel like therapy’s not for you (even though i highly recommend it, everyone has something to gain from it), start small. in your classes, sit next to the same group of people. chat before the professor begins lecture and after as well; crack jokes, talk about how he’d the homework was, etc. everyone can relate to that. pretty soon you’ll have a fully-fledged study group to text for help who will steadily become better friends with you. as your college years continue, your classes will become more specific to your major, and you’ll be able to gain friends within that major.\n\njoin organizations!!! this one is so important. it’s hands-down the best way to find friends. you like gaming? join the gaming club. enjoy theatre? theatre club. you get the gist. if you’re involved in an organization it almost grants you instant friends. \n\ngood luck! and remember that everybody struggles with loneliness to some degree at college.", "author": "loversdesire", "created": 1579188243, "upvotes": 2}, "fejx3qj": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejx3qj/", "text": "Start a snowball fight on the way to class. Ask someone to study with you. Go into town when you have time off. You're an adult and aren't tied down at your parent's house. Go out and have some fun!", "author": "cookerz30", "created": 1579187846, "upvotes": 3}, "fejwjdo": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejwjdo/", "text": "I'm actually in the same boat. I mostly sit in my dorm every chance I get. I end up not eating for hours on end just so I don't have to go to the dining hall and see people. I just go to class. That's it.\n\nThe past two nights however, people have reached out to me to hang out and honestly I was feeling quite isolated so I accepted. It felt really good to have just a few hours of conversation and laughter with others. \n\nIts actually really hard for me to not push people away and isolate myself. I don't really know why. But, it feels good to let yourself be included sometimes.", "author": "hiroshimasfoot", "created": 1579187478, "upvotes": 7}, "fejw9m6": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejw9m6/", "text": "The great thing about college at least in my experience is that everyone is a lot nicer than the prepubescent hormonal little shits we all were in high school. Went through the same thing you did. You'll find your crowd and you'll be with them all 4 years guaranteed as long as you put yourself out there. Start small like the meetings your floor has with your RA. Get to know the ppl living around you, and the rest will fall into place.", "author": "j_crist32", "created": 1579187304, "upvotes": 2}, "fejvovo": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejvovo/", "text": "Was same way until an extrovert found me and ‘adopted’ me. Befriend an extrovert! You can’t go wrong, they love people and talking so if you randomly started a convo I’m sure they would take the lead and just keep talking lol", "author": "SnivelKnievel", "created": 1579186927, "upvotes": 2}, "fejv7wz": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejv7wz/", "text": "You’re not alone. I’m a freshman at a large state school and it’s impossible to make friends there. I really want to open up and get involved and go to parties and all that, but I just don’t really know how to get started so I’m just on autopilot the whole day. I didn’t have any friends in hs either so I’m quickly losing hope of a decent social life.\n\nFor some advice, go to the counseling center on campus if it has one. They can give you pointers on how to open up to people and putting yourself out there. It’s not going to happen overnight, but it’s a start :)", "author": "520mile", "created": 1579186619, "upvotes": 3}, "fejtx87": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejtx87/", "text": "Lol this is so me rn", "author": "shiverglow", "created": 1579185764, "upvotes": 2}, "fejsz9l": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejsz9l/", "text": "This is how 90% of the people on my campus seem so i’d say, no not weird", "author": "DemonsInsid3", "created": 1579185102, "upvotes": 2}, "fejsvw5": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejsvw5/", "text": "I was the same I anti-stalked people but eventually I believe that you’ll find a really good friend that enjoys the things that you do and it’ll just feel natural. Now I’m graduating  not with a lot of friends but with really good friends.", "author": "thesouplovers", "created": 1579185035, "upvotes": 2}, "fejryqk": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejryqk/", "text": "I used to be like this and My favorite strategy is to get people to talk about themselves! I usually ask someone a dumb question “where did she say this was” and then they ask you a few over a few days. Then you ask their name and their major and why they’re going into that, they’ll usually feel pretty comfortable with you and vice versa after that, it hasn’t failed me yet.", "author": "EchoChamber10", "created": 1579184376, "upvotes": 2}, "fejrh4h": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejrh4h/", "text": "You'll end up making friends. I'm a freshman in college and have trouble meeting people and making friends. But I managed to make one. Sometimes one friend is all you need.", "author": "lasombraduerme", "created": 1579184013, "upvotes": 4}, "fejpo3j": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejpo3j/", "text": "It is weird to be aggressively antisocial in college. If I were you I would join a sports club or something of the like. They usually have great team camaraderie and even if you don’t stick with it- I’m sure you would wind up making some friends.", "author": "Waxwalrus", "created": 1579182625, "upvotes": 2}, "fejpciu": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejpciu/", "text": "Try “rejection therapy”. This YouTube video[TED talk](https://youtu.be/-vZXgApsPCQ) is an excellent introduction. Don’t worry about making friends right away, good friendships develop over time. Your first goal should be just feeling like you can communicate when you need to or when the situation comes up again that someone sits nearby or a classmate might ask a question you should feel comfortable with your own space and not leave. Being social is not something that came naturally to me and I definitely not outgoing and prefer quiet alone time.  But I realized social people did better in school and at work, not by merit, so I’ve put in effort to memorize various kinds of small talk and social etiquette that can get me through impromptu encounters with strangers. Then when you’re ready for the next level of human interaction  get a side job in retail that will force you to deal with shitty entitled people on a minute by minute basis.", "author": "notforsale50", "created": 1579182363, "upvotes": 5}, "fejot9y": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejot9y/", "text": "Are you me", "author": "DocPBJ007", "created": 1579181925, "upvotes": 2}, "fejophp": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejophp/", "text": "Are you from India? XD", "author": null, "created": 1579181835, "upvotes": 2}, "fejojaz": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejojaz/", "text": "Have you talked to a psychologist? I don't think it's weird to like being alone but if you're scared of interaction then you might have some sort of anxiety and a therapist can give you the tools to work through and overcome that. Plus it's nice to have someone to talk to about it and that in itself helped me. If you're really interested in overcoming your fear of socializing, you should definitely look into it! That being said, I think you should experience college how you want and not how you think it should be experienced! Good luck :)", "author": "nepsatron", "created": 1579181691, "upvotes": 2}, "fejn136": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejn136/", "text": "Have you considered joining a fraternity? They’re not all like the ones you hear about on TV. There are ones specifically for engineering majors, business majors, band kids, Christians, people who want to volunteer, Latinx, Asian, etc.... pretty much any group of people you can think of! Some fraternities are all male and some are coed. I was very similar to you in how shy I was freshman year, and I joined a small, not-very-popular social sorority. Because it was less popular the recruitment/pledging process was very casual. 5 years later and I’ve graduated and moved but still talk to my sorority sisters, who are my best friends, every day", "author": "paperclipmary", "created": 1579180370, "upvotes": 2}, "fejj37p": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejj37p/", "text": "A quick trip everyone is to busy thinking about themselves to think about u. If u wanna talk to someone just start with a compliment and let the conversation flow. Also u can just talk about homework or something along those lines. U also don't need to talk to people of u don't feel like it.", "author": "Godfist04", "created": 1579176417, "upvotes": 2}, "fejdwkv": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejdwkv/", "text": "Dont let people tell you theres something wrong. I'm just like you. I (age 31) have no real friends except my wife. That's how I've always been except for a few phases. Some people get more pleasure from being alone and that just dandy.", "author": "bendadestroyer", "created": 1579169286, "upvotes": 2}, "fejc657": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejc657/", "text": "This is actually how I spent most of my college years, but I was/am currently in a long term relationship. Looking back, I do regret it because other than my academic achievements (?), I have nothing to show for for college. I never went out, I don’t have any close life long friends, etc. I just never felt like I fit in with anyone, although that was probably just an excuse, since my uni was so god damn large. I had some internal issues with myself, and I learned that sometimes you’re the problem, not everyone else. 😂\n\nI’m currently in professional school where I feel more confident and feel like I “relate” to others more, mostly because we’re under the same high-stress academic environment. It’s hard not to bond over stress. \n\n**Try making “small talk” involving school work with your fellow classmates. Usually, that’s led me to other conversations that led to acquaintances and even friendships.** You gotta find common ground somewhere. I’m not going to give you the bull shit advice by saying, “Put yourself out there! Go join a club.” Even if that were to be an effective solution, I *know* how hard it is to attend a club meeting by yourself and make meaningful connections in that environment.", "author": "cbyu", "created": 1579166653, "upvotes": 3}, "fejbp66": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejbp66/", "text": "The things people are telling you are all lies. You can sit next to 100 people, 5 might talk to you but it's not going to go further than small conversation. Also if people have already made friendships it's going to be 99.99% impossible to insert yourself in these already formed groups. Don't go out of your way to avoid people, because that makes you look even more stunted, but don't have high or even low expectations for anything because I guarantee from personal experience that they're going to be shattered.", "author": null, "created": 1579165945, "upvotes": 2}, "fejatma": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejatma/", "text": "I just want you to know that not socializing only makes your already bad situation even worse. You will not feel more comfortable living all alone by yourself and isolating yourself from everyone. Moreover, social skills is extremely important for you to be able to survive later in life as well as in the working environment. Having friends to hang out with is fun, too. I'm not saying you SHOULD socialize, you HAVE TO. Do it as soon as you can. Changing is hard, but it is necessary. Don't wait until it is too late and too awkward.", "author": "2luauplife", "created": 1579164649, "upvotes": 2}, "fejag3l": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fejag3l/", "text": "I know the advice \"just talk to people!\" is pretty lame and old-fashioned, but it's honestly what worked for me. I used to be super shy, now I don't give a shit. I talked to my hair dresser today for 20 minutes, that may not seem big but I'd never do that 5 years ago. I would have sat quietly and nervously getting my hair cut. \n\nIt's not weird to be antisocial, but do remember you'll one day think back on your college memories. The more people you meet, the more memories you'll form. I met my best friend in college just by sitting next to her and asking a simple question about homework. I met most of my other friends through that person. It just starts with talking to people, and there's no formally announced time to do that -- you just do it. \n\nHopefully this rambling means something to you.", "author": "hatewrecked2", "created": 1579164109, "upvotes": 2}, "feja5d4": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feja5d4/", "text": "I for one have a ton of small talk experience due to work and absolutely fucking despise it. Don't ask me about the fucking weather, we live in the same city. As a college senior I have made a couple acquaintances but that's from them approaching me first. I see absolutely no reason to engage with anyone because I don't see any way that it could be worth it honestly. Not saying that this is the right way to go along with your college experience but that's just me. 90% of people I meet piss me off to one degree or another. Don't get me wrong, I've met some amazing people as well, but overall I keep to myself. Nothing wrong with being overtly friendly or a people person but that's not who I am so I tend to hate it when someone forces me to match their character. Sorry for the rant, but just be you, the right people will find you, and if they don't, fuck em.", "author": "DjSzymek", "created": 1579163684, "upvotes": 2}, "fej9q0z": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej9q0z/", "text": "When I was a fresher I was in a similar situation. Go join some uni societies. You'll find a lot of like-minded people, many who will be as terrified of talking to you as you are of them.", "author": "scubaguy194", "created": 1579163091, "upvotes": 2}, "fej984a": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej984a/", "text": "If you live in a dorm and have common areas, hanging out in there is a good way to see people. My dorm my freshman year had a common living room area and a kitchen and whenever people would cook others would say hey when they were passing by. Food is always a good conversation starter.", "author": "dogsaregreat6", "created": 1579162415, "upvotes": 2}, "fej8v8z": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej8v8z/", "text": "I have trouble talking to others, but I doubt they realize that. I grew up with basically zero social skills. I try to take mostly online classes but some I need to take on campus, and the idea of group projects and socializing makes me uncomfortable. I still try though and I’ve made friends in my new class already. However, I think yours is more extreme and you probably should talk to a counselor about it. And you have even admitted it yourself.... are you sure you’re not self-sabotaging with the clubs at school? There’s not a single one you’d be somewhat interested in?", "author": "Jdog1805", "created": 1579161933, "upvotes": 2}, "fej7vto": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej7vto/", "text": "It will fuck you over later, as they say practice makes perfect. Especially if you don’t start networking with those in your major. Start out with those in your major. You can ask about schedules, projects and whatnot to start then move into the social, outside of class stuff a bit later.\n\nLike don’t ask right off the bat where people live or anything weird like that, maybe offer up some info about yourself. What’s your commute, if you work what do you do, if not what hobbies do you have or what do you like to do with your time, etc. Don’t forget to ask them some what about yous in there too, otherwise it comes off as one sided.\n\nAs a general rule, I’d avoid politics, religion, or any topics where people get heated easily. Unless if those are part of your major, in which case hey why not.", "author": null, "created": 1579160640, "upvotes": 4}, "fej74ko": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej74ko/", "text": "Idk if this will help or not, but I am a very introverted, awkward, and relatively antisocial person, I have learned that simply talking to classmates can help you make friends. And it doesn't have to be huge and philosophical conversations, you can simply just throw an innocent and genuine compliment at them (if you like their shirt, complement their shirt), or ask them about the class, or ask if they want to potentially get a study group together some time, etc. \n\nJoining clubs is also very beneficial, it practically forces you to get out of your comfort zone and go out and interact with your fellow club members. I can almost guarantee that there is at least one club on campus that you would find interesting. And if there aren't? Find the one that sounds the least boring and give it a go. \n\nEither way, I wish you the best of luck, my friend! Live your best life, and if you enjoy being solitary? That's okay, too. But college can be a very stressful and isolating point in your life, and sometimes having people who aren't family to talk to and hang out with can help to make your life a bit better", "author": "livingstone97", "created": 1579159678, "upvotes": 2}, "fej737i": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej737i/", "text": "Hey man I'm a huge fan!", "author": "collegeapplyhobo", "created": 1579159630, "upvotes": 2}, "fej6vv5": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej6vv5/", "text": "I'd always been very shy, but when my family moved to Poland, it got so much worse, to the point where I barely spoke to anyone my own age *(for some reason, adults and kids were ok, maybe because I wasn't so scared of them judging me)*. What ultimately helped me was making baby steps; eye contact and smiling at people. Greeting people I knew/recognized if I saw them somewhere. If I ended up standing near a classmate, where I'd before pretend not to see them, now I'd reach out with some small talk, usually either \"what's up?,\" \"so, how's \\[the test/the assignment\\]?\" or \"how was your weekend/holiday\"? \n\nBut also: talk with people about the classes! My first few friends in university were classmates that I ended up discussing lesson topics with and sharing our opinions. You already have a common topic with everyone there; both the classes themselves and the subjects you're learning about. Projects and assignments, esp ones that require your creative input, can be great conversation starters. If you find yourself just standing around in the hall near someone, greeting them and asking them them about their day or making a remark about the classes/ongoing assignment/upcoming test is a good first step. Most importantly, it's a signal that you're friendly and open to interaction. If people think you want to be left alone, they'll leave you alone, so even just acknowledging people can be enough to let them know you're interested in interacting!", "author": "Psixie", "created": 1579159376, "upvotes": 3}, "fej4m2t": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej4m2t/", "text": "Does your college have a rec center? If so, try going there and participating in any activity that you may think you'll enjoy. It's an easy way to meet people and any small talk will usually revolve around what you're doing in the moment. Also, try weight lifting, it's a great way to build up build up confidence that can translate into social interactions. Hope this helps.", "author": "alpoe03", "created": 1579156708, "upvotes": 5}, "fej3wb5": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej3wb5/", "text": "[deleted]", "author": null, "created": 1579155939, "upvotes": -4}, "fej2voe": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej2voe/", "text": "Speaking from my own experiences, it’s not extremely weird to be asocial especially since you mentioned that it’s your freshman year. Growing up, I’ve never been that person who would avoid social interactions. I was the exact opposite all through my K-12 experience. I thrived off the energy from people around me. I was super outgoing and was a member of several school organizations. \n\nHaving said all of this, when I entered my freshman year of college, I became the exact opposite. I was reclusive and similarly to you I avoided interacting with anyone. I would always eat lunch by myself and just feel extremely lonely and isolated. I’m not entirely sure if it was the fact that I wasn’t familiar with the new surroundings or perhaps I wasn’t sure how I could mesh with the already established different social circles. For the first two years of college I went to a community college so I think that in the beginning there was no need for a tight knit relationship. People would attend class and then when it was over, generally people would leave the “campus” and go home.\n\nI was only like this during my first semester. The big changing point in which I could start enjoying my college experience was when I made that step to interact with others. Three factors went into this.\n\n1. I figured that since I’m already paying for this (tuition, books, etc.), I might as well make it the best experience that I can possibly get.\n\n2. I wanted to have that strong sense of a friendship system that I had in high school again. I knew that in the long run I could end up making life long friends which I extremely happy to say that I now have. I never would have forged these bonds with them had I never taken the first step. I found that having a reliable support system was CRUCIAL to maintaining a relatively sane outlook during my undergrad life. \n\n3. I also knew that once I graduated I would be thrusted into the “real world” and could no longer have those same carefree experiences that college readily has available. Well thinking back at my previous sentence, you can still have those carefree experiences but you might just have to juggle more things compared to when you were in college. As you previously mentioned that you only have this one chance to enjoy all of those experiences. \n\nI know that at first it seems like it will be difficult and I total see where you’re coming from but I can assure you that once you make the first step to creating friendships and being more social then everything will turn out better. Who knows you could even find a girlfriend but it can only happen if you put yourself out there. The possibilities are truly endless once you develop confidence in yourself.\n\nHope that this was able to help🤙🏾", "author": "LeinadArevet", "created": 1579154857, "upvotes": 5}, "fej2jqt": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej2jqt/", "text": "Honestly, I think it would help going to talk to a college counselor about your difficulty. The counselors are there for you and they want you to be successful. They’ve seen people of all kinds and will be very understanding and helpful. They are also professionals who can offer very sound advice. Hope this helps", "author": "bittahknight44", "created": 1579154516, "upvotes": 4}, "fej1y0d": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej1y0d/", "text": "[deleted]", "author": null, "created": 1579153934, "upvotes": 4}, "fej1bru": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej1bru/", "text": "I was like that too.  Later in life I got help from my doctor and I am now able to enjoy meeting people.  I would love to have been able during college though.  Maybe go see a doctor, or your campus health department and see if they can help?", "author": "ttribeid", "created": 1579153341, "upvotes": 3}, "fej18wn": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/fej18wn/", "text": "Don’t take this the wrong way, but you might want to check what counseling services your school offers. It seems like you MIGHT be suffering from sever social anxiety and talking to someone at your school’s counseling center could help! They are non-judgmental and completely confidential. \nWhat helped me was knowing that the person I was talking to would never pass judgement on my feelings or ideas. They are there to listen to you and often times those services they provide are completely free for students!", "author": "mgonza54", "created": 1579153262, "upvotes": 9}, "feiy3u6": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feiy3u6/", "text": "I'm not uber social but I always remember the kids that ask my name when they sit at the same table/row and we start to talk a little bit that can be a pretty good way to get to know someone a little bit. Living on campus has also really helped bc I see a lot of the same people everyday and kinda get to know them. I've actually made a few friends by joining already existing friend groups.", "author": "Frendzy", "created": 1579150445, "upvotes": 9}, "feixv5v": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feixv5v/", "text": "I use to be the same way! I did make 1 friends in high school but she was my only friend....until I started working! Have you had any jobs yet? A part time job is good environment for making friends and understanding how to interact with other people. Socializing, especially when it doesn't come naturally, can be very tough but as long as you do try to put yourself out there you will get better. (Also alcohol and smoking weed has helped me a bit with social anxiety but i know those kinds of things are not everyone's cup of tea lol. I started making friends BEFORE I started smoking and drinking though)", "author": "TabithaLovesStuff", "created": 1579150241, "upvotes": 8}, "feiw739": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feiw739/", "text": "So is this weird? Yes. Have you considered counseling? If social anxiety is actually driving you to isolate yourself from others and you're made uncomfortable simply by being around people (say in class) it's something you should try to address by more than just posting on Reddit. If you're in the US it's almost a certainty that your college has a counseling center that offers services for which you've *already paid* as part of your student fees. Make an appointment to talk with someone there-- a professional can help you decide if you're suffering from a severe social anxiety that can be diagnosed/treated or if you're just someone who needs to put himself out more. If it's the former than can help you get connected to counseling, therapy, or other treatment options.\n\nWhy go through life like this if you don't have to?", "author": "SnowblindAlbino", "created": 1579148878, "upvotes": 55}, "feiw4fs": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feiw4fs/", "text": "I've been trying to be less asocial since high school where I never used to even say a word unless it was necessary and I didn't have a single friend (up until the end). Now in college, I have a few friends, but I prefer to not speak with them sometimes(sometimes I just don't feel like it) or hang out with them because I would rather focus on my college work, the reason why I commute for an hour and the reason I'm spending so much money on it in the first place. Obviously people will tell me that I shouldn't behave in this way, but I know myself and I know that if I start hanging out with them too much I'll start losing my work ethic.  Anyways I highly doubt we're anything alike in this way, but I thought that I would mention that having a balance in both of them is difficult and something you should watch out for. Sorry for the rant, but as for making friends I would say just try to say hi and try to talk to someone in your class. That's literally how I made all of my friends, I was just sitting beside them in class and I introduced myself to them and we soon became friends. Or you could try just talking to someone outside your class and try asking them about their major since I've done that a lot of times, and it always seems natural and not forced. I know that it sounds difficult to physically make the initiative and do it, but if you want to push yourself and be social you'll have to force yourself.", "author": null, "created": 1579148821, "upvotes": 10}, "feivtpq": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feivtpq/", "text": "I’m actually just like this too, but I can tell you what has helped me in the past few years.\n     After I moved from my hometown of 15 years growing up, I got suuuper awkward and shy in school. I legit didn’t have a friend until junior year. I actually met most of my best friends in church(if you’re not opposed to that). But now in college I had to move away from my friends and start all over for this past semester. I joined one group related to my major and we had a few local tours and a couple weekend trips out of town. I went on every damn tour and trip they offered and got really close with the people in this club and many of them are in my classes too. On top of going to clubs, I met multiple friends in regularly assigned group projects. Don’t let it be one of those projects where no one talks to each other and you do the work on your own. Facilitate meetings with your group members and try and socialize a little bit while working on the project. Last way I made a couple friends was in the dorm hall’s kitchen. Lol you’re just stuck with a person alone for like 10-15 minutes so you basically have to talk to them a little bit. \n     But yeah I know exactly where you’re coming from; don’t just listen to the advice you’re getting and go to bed feeling better tonight. Actually get up tomorrow and make some sort of next step. Even if it’s just a simple, “hey how’s your day going?” to a person near you. \n      Anyways, good luck and have some fun in school. :)", "author": "tryan2winn", "created": 1579148592, "upvotes": 6}, "feiuhg3": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feiuhg3/", "text": "The easiest conversation starter I've found in college is asking people what their major is and if they went to high school in the same town as the college and just take the conversation from there", "author": "spunkymonkey058", "created": 1579147547, "upvotes": 48}, "feip32k": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feip32k/", "text": "Hey take your time, but seriously get out of your head. Talk to people if not let them talk to you. Even the básicas about class or where to eat. Ask questions that you already know the answer to if it seems that hard. You don’t NEED friends but it’ll make it a lot more memorable of an experience and you’ll get your money’s worth. \nTLDR; take your time and talk to peoole as you can. Be friendly and try to avoid being negative too everyone is just as stressed out and kinda down in the dumps as you are if they aren’t clearly overwhelmingly jolly and bubbly. STAY UP KING patience is a virtue. Also hit the gym too and eat you fruits and veggies. You’ll literally be thanking yourself in a year even a few weeks or months. I promise I was in the same position before too", "author": "ghostinatux", "created": 1579143718, "upvotes": 45}, "feinyct": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feinyct/", "text": "As a very open and outgoing person, i do hope you can make some friends. Though I have no advice for such a situation, i do offer my online friendship. If you have a discord, you can add me. :) I'm a huge gamer, and maybe talking to someone online can slowly help you build to talk to people outside.   \nEnvyYou73 #1602", "author": "EnvyYou73", "created": 1579142964, "upvotes": 183}, "feinvg4": {"link": "/r/college/comments/epchz8/is_it_weird_to_be_aggressively_asocial_during/feinvg4/", "text": "I know it might seem very nerve wracking but maybe start just saying hi to people around campus, try saying hello and talking about class with the people who sit next to you. It would probably be hard at first but very worth it!", "author": "rbfk17", "created": 1579142911, "upvotes": 383}}}