{"sid": "nqyg9s", "link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/", "title:": "I can't express my hatred for discussion board posts enough. Nobody cares and nobody knows one another, just give up on the discussion boards.", "text": "I know many professors are required to do this so I can't blame them. If you do it voluntarily though, then just stop. Discussion boards are the best example of the failures of online college. Absolutely no engagement or effort because no one knows anybody and nobody cares. We just want the grade for the post so it's always boring and minimum effort. I hate racking my brain trying to think of three responses to these random people just to get a 3 point grade. Just stop assigning them, please.", "author": "orangesNH", "created": 1622673638, "retrieved": 1632801988, "over_18": false, "upvotes": 1465, "upvote_ratio": 0.98, "comments": {"h0ijm88": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ijm88/", "text": "Hi… Prof here. I get it. Not only am I teaching classes, but I’m taking one as well. Discussion boards rise and fall on student engagement, and if students aren’t engaged, they suck. They suck to read, and they suck to write. So my only advice here is to be the change you want to see in the world. I’ve had some that are awesome, and I’ve enjoyed reading them so much! I give extra credit if you try to help a classmate to understand something or bring something to the conversation from outside of class. Try that. It might help.", "author": "CreatrixAnima", "created": 1622771146, "upvotes": 2}, "h0h5584": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0h5584/", "text": "If you want a grade, do the assignment.  Every class is different, and years ago before the internet, we had tedious things we had to do as well that they don’t do now.  We didn’t like them either, but we sucked it up and did it because we wanted a good grade.", "author": "SalisburyWitch", "created": 1622748022, "upvotes": 1}, "h0gz1i7": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0gz1i7/", "text": "I’m not trying to make a reddit chat type discussion with the discussion boards. I’m creating a system where students are basically posting a response the prompt with 1. A bit of motivation to not sound like a complete idiot or blow off because it is seen by everyone, and 2. To read other responses to help circulate ideas. \n\nI agree that it’s not for simulating an in class back and forth. But I think of it as a super mini writing assignment where some sharing occurs.", "author": "urnbabyurn", "created": 1622745446, "upvotes": 1}, "h0gudih": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0gudih/", "text": "I’m fine with it if writing a paragraph a week is  going to contribute to 30% of my grade.", "author": null, "created": 1622743505, "upvotes": 1}, "h0gqjie": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0gqjie/", "text": "I liked the way one of my professors did discussion posts this past semester. Instead of requiring a discussion post every week, you would have a general \"participation\" category for 10% of your grade. You could get points toward this by participating in the chat during class, doing problems during recitation, or by posting on the discussion board. She would post discussion questions every week, but you didn’t have to respond every week if you got your participation points another way. Also, there were no deadlines and the only requirement was that you \"participate\" at least 10 times throughout the semester to get the points.", "author": "bxtchcoven", "created": 1622741942, "upvotes": 1}, "h0gmzbm": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0gmzbm/", "text": "Hey u/orangesnh I agree totally with the sentiment echoed in this post! Discussion boards are useless and a terrible waste of time for all involved. I highly doubt that anyone even reads what people reply back to them. Once again, great post and very informative.", "author": "hopderp17", "created": 1622740484, "upvotes": 2}, "h0glurz": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0glurz/", "text": "I always liked discussion board assignments, reading others responses make me consider the text in ways I didn’t consider before", "author": "Theprophicaluser", "created": 1622740015, "upvotes": 2}, "h0ggc4z": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ggc4z/", "text": "No effort because the students choose to not do effort. If someone responded to my post with enthusiasm, i would do the same thing. You should be upset at your peers for not trying.", "author": "AstuteYetIgnored", "created": 1622737707, "upvotes": 2}, "h0gd6lq": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0gd6lq/", "text": "i met my bf on a disucssion board, so I am not a hater", "author": "doubt__first", "created": 1622736394, "upvotes": 2}, "h0gcf3c": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0gcf3c/", "text": "Damn this dude really hates discussion boards", "author": "iamzerothree", "created": 1622736077, "upvotes": 3}, "h0g8fdc": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0g8fdc/", "text": "I love the discussions. It gives me a chance to prove that I read and understand the material.\n\nIf I respond first, I have the advantage of setting the tone and idea stream of the entire class.\n\nIf I wait too long to start discussing, I am typically at a disadvantage, because whatever idea I have may have been discussed already, so I have to come up with a new topic.", "author": "HemetValleyMall1982", "created": 1622734453, "upvotes": 3}, "h0g8ax7": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0g8ax7/", "text": "I never check them after I’ve done my required posts. I respond and never look at what/if they wrote back. I agree it is a total waste of time", "author": "hardcorechim", "created": 1622734403, "upvotes": 1}, "h0g7okx": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0g7okx/", "text": "In exchange for discussions posts/replies how about an online lecture/q&a where everyone must attend in order to get credit. It's the same as going to school f2f, you'd have to show up for 1.5 hours anyway. You're just doing it online.", "author": "swollemolle", "created": 1622734146, "upvotes": 1}, "h0g1faa": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0g1faa/", "text": "Oh my gosh yes!!! I hate the comments on the discussion boards it usually goes something like this: wow I actually agree with everything you said! What else is there to say? You hit the nail on the head with this one. \n\nI want to hit myself with a cast iron frying pan when I read that 😂", "author": "Longjumping-Shoe3278", "created": 1622731555, "upvotes": 1}, "h0g0pl1": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0g0pl1/", "text": "It’s literally a waste a space but my biggest pet peeve is responding to other.", "author": "Vurdou", "created": 1622731254, "upvotes": 1}, "h0fyu99": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fyu99/", "text": "Yeah we get nothing from them it’s like a Facebook post for class", "author": "chillest_dude_", "created": 1622730463, "upvotes": 1}, "h0fye2i": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fye2i/", "text": "At my uni discussion posts aren’t actually subject to grading, so most are intrinsically motivated to begin with. While they’re usually just general course queries, occasionally there’ll be a spark of discussion about some interesting we covered. I think making them optional is the key", "author": "BITWk", "created": 1622730269, "upvotes": 1}, "h0fxldl": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fxldl/", "text": "And yet, everybody posting here is actually posting right now, on their own time, for no credit, on a discussion board. Many making valid points, supporting them, thinking about the question and others’ responses. \n\nReddit IS a discussion board!\n\nThe problem is not discussion boards. The problem is professors who don’t know how to use them. If students care about the question, have real things to say and want to be heard (and if the question is an authentic question, with no “right” answer), discussion boards can really add a fun and motivating element to an online class. And real learning can happen through them.", "author": "lepidio", "created": 1622729929, "upvotes": 4}, "h0fqhd3": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fqhd3/", "text": "The worst is math discussion posts. In my precalc class I just finished my professor, who was the worst, harshly graded them and took points off for not having thorough discussions about the math. How do you even have a discussion about math?? It just turned into everyone trying to critique each other's work but 90% of the time everyone did everything correctly so it was just a mess.", "author": "Sola_Fide_", "created": 1622726845, "upvotes": 3}, "h0fqefv": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fqefv/", "text": "Or assign it but do not require it for a grade.  Maybe have a TA or some \"fake\" students come on and start seed discussions and then see who replies and engages.  Any amount of genuine discussion is better than forced discussion just for points.", "author": "jaysonm007", "created": 1622726807, "upvotes": 1}, "h0fnv53": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fnv53/", "text": "Just lean in and they are easy points. I always get full points and it helps pad the real coursework.  Be thorough,  polite and demonstrate knowledge of the material.  I love pointing out other classmates errors in the nicest way possible.", "author": "SublimeUniverse", "created": 1622725571, "upvotes": 1}, "h0flmtn": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0flmtn/", "text": "After the pandemic shut everything down and my school sent everyone home, my one professor switched to online discussion boards. Maybe like 2 a week, so by the end of the semester there were like 15-20 discussions we had to post and reply to 2 other students. God, I never saw my grade drop so fast... some of the discussions I never bothered to do. Some require us to watch 1-2 hour long videos or read a 40 page chapter a book. It was just ridiculous, and I didn't learn anything from it.", "author": "thatkilliankid", "created": 1622724416, "upvotes": 3}, "h0fl3eu": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fl3eu/", "text": "Another professor chiming in — last fall around Week 5 of the semester I substituted a Blackboard Journal assignment for the discussion and asked them to tell me their honest opinion of discussion forum assignments. The overwhelming majority shared what most of you have said here — answering the original prompt was fine, but they hated forced responses to classmates. Many said that they liked the accountability of the discussion, that it made them engage with the chapter materials and think more critically; they also noted that they kind of enjoyed reading what their classmates had to say, just not responding. So, I changed the discussion grading rubric and eliminated the requirement to respond to other posts. \n\nInstead, I offered extra credit. They could choose to respond to up to two students each week and earn 3 points for each post, as long as it was substantive and met some other criteria.  The course adds up to 1000 points, so doing this once wouldn’t really change anything, but it gave students the opportunity to earn up to 30 or 40 points, which did make a big difference by the end of the semester. \n\nIt made the experience better for EVERYONE, including me. Original posts were more interesting and the students who whose to response made really insightful comments that moved the conversation forward.", "author": "greyhairdontcare22", "created": 1622724129, "upvotes": 3}, "h0fgber": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fgber/", "text": "When you have like 5 of them its an easy grade tbh, better than if you were assigned a test worth 15% which youre more likely to get points off. Appreciate it, literally the easiest assignment you can do it doesnt matter if you dont care about it, its a free grade lol.", "author": "EpilepticFire", "created": 1622721390, "upvotes": 2}, "h0fcgyi": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0fcgyi/", "text": "I went hard for one, and I relatively enjoyed it. The part that got me - the professor seemed to agree. Finishing up a degree in nuclear engineering technology, had most of the important credits from my time in the Navy. Was taking intro to liberal arts as a required credit.\n\nI politely said if liberal arts was so damn important for me to get a nuclear engineering degree, then it should be qualified as gen Ed and rolled into high school. It is a BS fluff class to generate money for the university by wasting my time. Also pointed out that almost everything we were covering *was* covered in high school. Paying to be retaught something that I had already been taught in grade school was insulting.\n\nI had the distinct feeling from the professor's participation in this discussion that they were trying to gain ammo to revise the lesson to not have to do the discussions.", "author": "zarchangel", "created": 1622718926, "upvotes": 2}, "h0eyuke": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0eyuke/", "text": "I feel like discussion boards should be an option for students, for them to get a better insight on someone else’s opinion about something.  \n\nIt stresses me out that some of my professors would only give full credit if we respond in college level writing, to at least 2-3 students. \n\nI don’t want to, cause I don’t give a damn!!!\n\nMaybe other students like discussions, but there are those who just don’t have the time. \n\nJust make it an ungraded option.", "author": "DumbHuman53", "created": 1622707285, "upvotes": 2}, "h0exw6u": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0exw6u/", "text": "Actually discussion boards usually help me as an online student. I always go to the assessment discussion and whatever thing I am wondering is usually answered. I find it helpful but again, I’m not in class so that may be why", "author": "calidownunder", "created": 1622706429, "upvotes": 2}, "h0eviag": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0eviag/", "text": "Hi \\_\\_\\_\\_\\_\\_\\_\n\nI agree with your statement on \\_\\_\\_\\_\\_\\_\\_\\_\n\nThank you for posting. \n\nThe braindead formula for discussion posts.", "author": "noimdirtyd4n", "created": 1622704357, "upvotes": 20}, "h0evadx": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0evadx/", "text": "I hate them with every fiber of my being. You're 10000% right, nobody cares about each other's responses and it ends up looking like robots talking to each other.\n\n Every single time we have to do reflections or Professor evaluations, I make sure to express how much I dislike discussion posts.", "author": "szatanna", "created": 1622704165, "upvotes": 3}, "h0esg7q": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0esg7q/", "text": "You literally just reminded me that I have a fucking discussion board post to do.", "author": "EternityNotes", "created": 1622701838, "upvotes": 4}, "h0esef4": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0esef4/", "text": "YESS! it's ridiculous and i hate it as well... but also you should know that they require professors to implement that into online classes .. it's supposed to resemble the interactions students would have in a irl classroom environment..", "author": "aguafreska", "created": 1622701798, "upvotes": 1}, "h0erbxu": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0erbxu/", "text": "I'm fifty-fifty split on discussion boards. I think it comes down to what is being discussed and what kind of things we're being asked. I'm in a class right now where I enjoy the questions and thoughts being proposed. I enjoy sharing my views and the thoughts that lead me there. I get to look at other people's answers and find a way to continue the discussion (whether they reply or not). I remember experiencing the same thing in my English 1101 class. Some of us students would have chain long discussions.\n\nI think, to have a good discussion board, that the questions being asked need to be thoughtful and provoke true discussion.", "author": "Moonstonemuse", "created": 1622700962, "upvotes": 2}, "h0ept7w": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ept7w/", "text": "I hate discussion boards!!", "author": "chitownbabe17", "created": 1622699799, "upvotes": 2}, "h0eoy8a": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0eoy8a/", "text": "yeah idk, in my intro to computer science course the discussion board has been great, people ask questions related to the assignment, when i have the same question the answer is already there for me waiting lol", "author": "ysl_bean", "created": 1622699171, "upvotes": 5}, "h0emlrb": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0emlrb/", "text": "Idrc about them bc they’re just free points for doing (usually) very little work. I just bs them and make sure they’re long enough and that’s it. I even was in one class where people were super passionate about the subject and actually wrote engaging posts lol. I know that’s not the norm but of all the annoying things about zoom uni, discussion boards are one of the lesser ones.", "author": "airbear13", "created": 1622697526, "upvotes": 4}, "h0elvn4": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0elvn4/", "text": "Yeah I don’t even care to look at anyone’s feedback on my discussion posts. If I said something debatable, I really don’t care cuz I just wanna pass the damn class. That’s just my opinion that even I don’t take seriously so people could disagree.", "author": "FMG_99", "created": 1622697033, "upvotes": 6}, "h0ekg48": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ekg48/", "text": "I gave up on discussion boards years ago", "author": "poop_on_you", "created": 1622696101, "upvotes": 2}, "h0ej8n1": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ej8n1/", "text": "I have a love/hate relationship with them. They can be fun if the professor actually cares. I’ve had people steal my posts & change like 3 words to make it their own & they were never called out & I even complained to the professor. \n\nI also have this huge problem with discussion posts that are automatically graded. If I put so much into a post & another student who did the bare minimum gets the same grade it messes with my motivation. Should I point it out? Should I do less? And my boyfriend tells me not to worry what anyone else does (he is right) but I feel like my hard work is not being appreciated.\n\nOne of my professors today sent out a email to us all saying that he will be deleting commentary that is not sufficient or is just the bare minimum to get points. Thank god! I’m honestly happy with this", "author": "TheRestIs_Confetti", "created": 1622695382, "upvotes": 15}, "h0ehw32": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ehw32/", "text": "No I love them. I think it’s so interesting to see on how differently everyone thinks. Also the discussion question are usually interesting. I judge people super hard their posts. How can everyone be so stupid?", "author": "kapbear", "created": 1622694589, "upvotes": 3}, "h0eh9uq": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0eh9uq/", "text": "They’re not assigned for value to the student, they’re assigned for ease of the professor. Some private schools discourage their professors from using them as a teaching tool.", "author": "xNINJABURRITO1", "created": 1622694218, "upvotes": 1}, "h0egy9p": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0egy9p/", "text": "[deleted]", "author": null, "created": 1622694028, "upvotes": 7}, "h0egvyn": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0egvyn/", "text": "Discussion boards aren’t bad...but Ment.io is. If a professor is using an AI/analytics tool too grade your discussion board posts and participation, you’re fucked.", "author": "frenchtoastdick", "created": 1622693991, "upvotes": 22}, "h0egul6": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0egul6/", "text": "Discussions posts are fine. Requiring 'X amount of replies' to fellow students for full points is garbage. Just require that the discussion post be relatively meaty and there is no need to go on with the ridiculousness of mandating replies which basically just end up being super tedious and low effort like OP is saying.", "author": "Capricancerous", "created": 1622693968, "upvotes": 181}, "h0efxfh": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0efxfh/", "text": "It’s so frustrating when you have to respond to others and your classmates only start posting the night it’s due.", "author": "FreezingDemon", "created": 1622693417, "upvotes": 8}, "h0ecozq": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ecozq/", "text": "I’d love to chip in here about this new thing my professors are doing with not allowing us to do more than one discussion a day?? I am currently taking a class and I procrastinated last week really bad and ended up doing 2 discussions on the same day and I got a 4/6 for it simply because they were done on the same day. (Out of 3 total discussions) I understand it might be to curb procrastination, but last semester, I had a professor that did this and at the beginning of the week I wanted to get all of the discussions out the way because they were easy, but I had to wait until separate days to do them. It was really annoying. Also procrastination is never going away so stop making it impact students who are trying their best or have different life circumstances.", "author": "sparklingsnow46", "created": 1622691566, "upvotes": 4}, "h0ecctm": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0ecctm/", "text": "Discussion board responses are always like… “I agree with you. It makes so much sense this way!” Yeah that’s engaging enough… *eye roll*\n\nStudents don’t have to respond to others who actually say something in an in person class, so not sure why it’s different for online classes", "author": "Tall_Specialist", "created": 1622691374, "upvotes": 13}, "h0eccjh": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0eccjh/", "text": "“I agree with you. It makes so much sense this way!” Yeah that’s engaging enough… *eye roll*", "author": "Tall_Specialist", "created": 1622691369, "upvotes": 1}, "h0eavcl": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0eavcl/", "text": "Unpopular opinion, but I always enjoyed discussion posts. And I actually like replying to people because it makes a class feel more “normal”. I will note that most of discussion post assignments I’ve enjoyed have been in classes with a political slant, so you can respectfully disagree with classmates and actually start a discussion. I can see how it’d be a boring assignment in a STEM class or basic English 101 class.", "author": "morose_bug", "created": 1622690534, "upvotes": 27}, "h0e8crc": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0e8crc/", "text": "(Teacher) my online certification requires it. Sorry about that. I'll try to make it as painless as possible.", "author": "acm2033", "created": 1622689141, "upvotes": 2}, "h0e6gty": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0e6gty/", "text": "It’s funny to have engaging conversations with strangers on a message board while talking about how boring conversations with strangers are on a message board.\n\nThat aside, the boards are actually fantastic for your upper level courses where people really want to learn about the topics at hand in-depth.", "author": "milgradstudent", "created": 1622688152, "upvotes": 43}, "h0e1w0v": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0e1w0v/", "text": "Same. However, if it’s worth 20% of your grade then I wouldn’t mind. Easy A I gotten from previous classes cause of it", "author": "Dekus1", "created": 1622685875, "upvotes": 31}, "h0dvl61": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0dvl61/", "text": "I also hate discussions posts the point of online classes is to not have to interact with other people. If I wanted to be around people I would attend actual in person class. I usually just post the initial post and say fuck the replies I still get a good grade. Discussions are just a sad circle jerk of people telling each other I agree with your post blah blah.", "author": "Vorian_Atreides05", "created": 1622682709, "upvotes": 16}, "h0dt9ni": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0dt9ni/", "text": "My lecturers in the past have told groups to make blog posts and reply to each others which is an interesting way of conducting assignments. Your reply will be marked as well\n\nIf anyone knew the link you too would be able to see the work that was submitted", "author": "Impressive-Name5129", "created": 1622681548, "upvotes": 3}, "h0dhaoi": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0dhaoi/", "text": "I agree that it's stupid, so just don't try hard. I've never had points taken off as long as I've done the assignment as asked. \n\nI just take it as free points. It's nice to have some guaranteed cushion so that less of my grade is made up of tests which I have less control over.", "author": "Rockleshmocks", "created": 1622675636, "upvotes": 24}, "h0dgi67": {"link": "/r/college/comments/nqyg9s/i_cant_express_my_hatred_for_discussion_board/h0dgi67/", "text": "I kind of agree with you. I'd love to hear your thoughts on alternate assignments.\n\nFirst: I assign discussion board posts because it is one of the few ways to ensure students do the readings. The few semesters I did not, no one read. Really. I'd ask what author X's main point was, and it would be silent. Did discussion boards the next semester, and students at least had to skim enough to pick up the main point. The other alternative is reading quizzes. But I hate writing those and you all hate taking them.\n\nSo: the dilemma is how to get students to read and participate in discussion without having discussion posts. History has shown we can't just trust you to do the readings -- EVEN when there is a large component of the grade coming from participation. It was 15% for my course this term, and even then many students still chose not to read and not to participate (because they had no clue what we were talking about). \n\nI would love to hear ideas from students about how to keep you engaged outside of the classroom. Since we only meet two or three days a week, we as professors need to ensure that you actually do the readings (and trust me, it is a battle every single class). If you have suggestions or solutions, I'm all ears, but \"trust us, we'll read,\" or \"increase participation\" don't work.", "author": "Galactica13x", "created": 1622675241, "upvotes": 281}}}