{"sid": "a5n0am", "link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/", "title:": "Professor was late to a final and said it was our fault", "text": "Hey I’m not sure where to post this but I’m kind of at a lost for what to do. It’s currently finals week as many of you know and I have been studying my ass off. Today I had a midterm for my psych class that was set to be at 3:30pm, I know this because on the online finals schedule that every professor follows it stated 3:30pm was the time of the final. So me along with a majority of my classmates show up at 3:30 and waited but my professor failed to show. We spoke to the head of the department and they informed us that if the teacher does not show in the next 30 minutes then we were legally(?) exempt from the exam. Every person that showed up signed their name on a piece of loose leaf as proof of their attendance, we then brought the paper to the head of the department to get it signed. We emailed the teacher a picture of the attendance sheet and a small paragraph explaining that we showed and she failed to show up on time so we were directed to leave. Anyways, 4:30 rolls around and we get an email from the professor saying that the exam was actually at 4:30 and she stated this in class last week and since we were not there for the exam we would all have to reschedule it and take it with a proctor on another day. Now this is where I’m at a loss because there was no follow up email or anything other then her ALLEGEDLY (i’m emphasizing this because if she stated it I’m sure no one would of showed up at 3:30)  stating last week in class that it was moved to 4:30. Is this something that is allowed??? Correct me if I’m wrong but I think this is extremely unfair to everyone. Does anyone have any experience with this or know of what I should do?? \n\nUpdate: I couldn’t make it to the school because something came up (I had no final scheduled for today so my mom asked me to go with her to the doctor). However I did email the dean about the situation as well as my professor asking when I could reschedule the test because at this point fuck it I’m just going to take it and I know I’ll get a good grade on it anyways because I’ve studied a hell of a lot. Anyways, back to the stuff you guys care about- no one has responded to my emails. I sent both emails out at around 9am and I’m still waiting to hear back. Seems like I’m not much of a priority 🤷🏻‍♀️\n\nNew update: my professor emailed me back and my new test date is Monday at 11. I also still haven’t heard back from anyone else so that’s disappointing. ", "author": "skittlecrack", "created": 1544653009, "retrieved": 1632947766, "over_18": false, "upvotes": 845, "upvote_ratio": 0.97, "comments": {"eiqb4pl": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eiqb4pl/", "text": ">\twould of\n\nRetard", "author": null, "created": 1552830990, "upvotes": 1}, "ebso3uw": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebso3uw/", "text": "Any update?", "author": "whitebreadzack", "created": 1544815349, "upvotes": 2}, "ebrfisj": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebrfisj/", "text": "Thanks for posting an update OP.  That is ridiculous.  I hope the department head steps in.  There could have been students that had a conflict with the new exam time. ", "author": "Entertainmentguru", "created": 1544787191, "upvotes": 3}, "ebpnsc0": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebpnsc0/", "text": "Hopefully this issues gets some closure. It's very outrageous she essentially gaslighted the majority of the class! ", "author": null, "created": 1544724885, "upvotes": 1}, "ebozt3n": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebozt3n/", "text": "RemindMe! 24 hours", "author": "theburgerhut", "created": 1544704639, "upvotes": 1}, "eboyyuu": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eboyyuu/", "text": "Funny because in the entirety of my college career the finals were always picked by our professors and were held during a regular class session unless it was an engineering or math exam. None of which applied to me because I was Computer Science.  All maths above the one I finished up at did that.", "author": "ThatNerdyRedneck", "created": 1544703433, "upvotes": 1}, "ebowqzv": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebowqzv/", "text": "RemindMe! 24 hours", "author": "Entertainmentguru", "created": 1544699706, "upvotes": 1}, "ebopkoe": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebopkoe/", "text": "No way this is your fault. Finals are scheduled for an allotted time because other classes may need that classroom for their own final. Check the official final schedule. Your professor is not allowed to alter that. If they did, look for electronic validation ( emails, canvas post, etc) if there wasn’t any, it only further discredits this professor", "author": "wwjgd27", "created": 1544686176, "upvotes": 2}, "ebono64": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebono64/", "text": "Your university almost definitely has a publicly available final exam schedule. Google “[university name] final exam schedule fall 2018” and there’s a good chance you’ll find it. Professors can’t just change that. Also double check the syllabus. If the syllabus didn’t specify her 4:30 time, problem solved.", "author": "enigmaticowl", "created": 1544683205, "upvotes": 2}, "eboksa1": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eboksa1/", "text": "I thought that a department of the school set the finals? Usually the professor doesn’t set the final date and time to avoid this exact problem. Definitely talk to the dean on this one. ", "author": "OG_Kurama", "created": 1544679389, "upvotes": 1}, "ebokjg2": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebokjg2/", "text": "I took a Spanish II class on campus on Tuesday and Thursday. Teacher didn’t show for the first 2 classes. After 20-30 minutes of waiting for her to show for the second one, all of the students went to the dean’s office to find out what was going on. Later that evening, the instructor sent out an email to inform everyone that this was now a DVD Spanish class (!!!!) and since drop/add ended Wednesday (all this happened on Thursday), we were stuck taking it. DVD Spanish II 🤦🏻‍♀️", "author": "hasskell", "created": 1544679086, "upvotes": 1}, "ebok5r0": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebok5r0/", "text": "This isn’t helpful, but last spring one of my professors forgot about our final. My major is small, so we’re all close. Our normal class time was at 1:30, but the exam was at 1, and around 1:15 someone decided to call him in his office, and he had forgotten that it was the final exam, not a normal class time. It was priceless hearing his confused voice over the phone and everyone laughing as he walked in the classroom ", "author": "kinda-guy-kinda-sly", "created": 1544678634, "upvotes": 4}, "ebojqc2": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebojqc2/", "text": "There’s no written proof so I’d say just take it up with the dean. It was her mistake", "author": "Fallen_Sheep", "created": 1544678131, "upvotes": 2}, "eboj0ha": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eboj0ha/", "text": "My school doesn’t allow professors to schedule final exams outside of the designated time due to the possibility that it could interfere with another exam. I don’t see why your school wouldn’t do the same. I hope you find a solution to your situation because this sounds like BS.", "author": "BearerBear", "created": 1544677309, "upvotes": 1}, "eboii5x": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eboii5x/", "text": "I had the same thing happened at my physics final yesterday. The professor was nearly 10 minutes late to the final. It's comical because he told us if we were late for the exam he would  lock the room and we would not be able to enter. He did allow us 10 extra minutes on the exam. Although, there was construction going on in the basement, right under the large classroom. During the exam we could hear drilling in the hammering - so loud it vibated our desks. It wasn't continuous but happened enough to be very distracting. ", "author": "BigotSudoku", "created": 1544676736, "upvotes": 2}, "ebohmgb": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebohmgb/", "text": "Dude in our college this thing has happened a couple of times. In fact, it has often happened that we aren't given assignments throughout the semester and on the last day the giddy old prof reads the study plan and suddenly walks into class and warns us to give our assignments in a day. Best thing to do is to take this up with your department head, as we did and it was sorted. The old Prof will grumble for the rest of the days, but that's on him/her/it.", "author": "braintumor_", "created": 1544675773, "upvotes": 3}, "ebofv11": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebofv11/", "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/collegerant] [Professor was late to a final and said it was our fault](https://www.reddit.com/r/CollegeRant/comments/a5pxl8/professor_was_late_to_a_final_and_said_it_was_our/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "author": "TotesMessenger", "created": 1544673990, "upvotes": 1}, "ebofmkl": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebofmkl/", "text": "Take it to the higher-ups. It's statistically improbable that 90% of the students in the class didn't 'remember' your professor changing the date unless it was communicated very poorly. But honestly, I wouldn't get too hung up about it unless it's your last exam and you're planning to go to Disney World the next day. ", "author": "Mesahusa", "created": 1544673758, "upvotes": 2}, "ebofkmn": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebofkmn/", "text": "I'm sure it depends on the school, but in my experience, professors are not in control of exam times. The school schedules them, and professors must follow those times (which are determined before the first day of classes).", "author": "grahamalondis", "created": 1544673702, "upvotes": 1}, "ebofbr2": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebofbr2/", "text": "Considering that you have an entire class of people who say the opposite of what the teacher said, I would explain this to the dean and the fact that the dean did sign it meaning you're exempt, *should* mean exempt. Not a retake. Not your fault. The teachers fault. Explain this to the dean and tell them that the entire class(that signed the paper that was notorized by the dean) was not informed of the test being at 4:30. This is not your fault, this is the teachers fault and they should be held accountable. ", "author": "homegrowntwinkie", "created": 1544673462, "upvotes": 3}, "eboe9ep": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eboe9ep/", "text": "It’s bullshit. I had a professor move an 8am exam on Tuesday to 8am Thursday without telling anyone, and like you, while not following the universities exam schedule. I, along with all 150 of my classmates showed up but.. nothing. Professor never showed. She sent an email today, a full 32 hours after the final was SUPPOSED to be given, explaining when our final is actually going to be. Nothing we can do other than take it tomorrow. It’s bullshit man", "author": "BlueberryOnions", "created": 1544672460, "upvotes": 2}, "ebob883": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebob883/", "text": "You can't announce something that crucial in *just class*, wtf. Why are some professors dicks", "author": "OneWaterPlease", "created": 1544669671, "upvotes": 15}, "eboafqx": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eboafqx/", "text": "How does a professor even technically move an exam up an hour anyway? Don't most universities have like a mandated exam schedule they put up semesters in advance?", "author": null, "created": 1544668969, "upvotes": 10}, "eboa19p": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/eboa19p/", "text": "When you say \"allowed\"...? Ask for their supervisor :D", "author": "rmlrmlchess", "created": 1544668625, "upvotes": 3}, "ebo90h5": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo90h5/", "text": "Any time my teachers want to move an exam, particularly a final, it has to have unanimous approval from the class, and even then it's kind of done under the table unless it's a class large enough that we use two rooms to test.\n\nI doubt it's ok for her to move it like this, particularly since she apparently did not get any input from the class on it beforehand.", "author": "LordMudkip", "created": 1544667710, "upvotes": 2}, "ebo8unt": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo8unt/", "text": "Hahaha nooopppe. March to the deans office. If they have half a brain they’ll tell the professor to pound sand. There’s no chance that nobody in the class heard specific and important information regarding the exam, even then she should have reminded you again via email. Even my least involved professors have kept us updated about important things over email", "author": null, "created": 1544667566, "upvotes": 9}, "ebo8p4m": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo8p4m/", "text": "1. I am always amazed that other profs. sometimes have NO CLUE that there is a final exam schedule, which is not optional, and differs from regular class meeting times. I’ve seen this happen, a lot, no excuse for it. \n2. There is NO “legal” implication here. Kudos for covering your but.\n3. The department chair will likely determine what comes next. Depending on the subject and level a final exam might be 100% required by the university or a professional accreditation body for certain careers.\n4. I imagine you will likely have to take the exam. Good news— you have a very strong case to fight any penalty, should the instructor decide to apply one.", "author": "xohwhyx", "created": 1544667430, "upvotes": 7}, "ebo8esq": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo8esq/", "text": "You should be exempt. There’s no actual documentation of her ever rescheduling. Bring it up with the dean.", "author": "JTJWarrior_3", "created": 1544667176, "upvotes": 3}, "ebo7hol": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo7hol/", "text": "If you have access to a syllabus that lists the final as 3:30, I would print a new one with a date on it (possibly as a screenshot?) or just keep it in general. The teacher may post a new syllabus with the time set as 4:30 to cover her ass.", "author": "splashylaryn", "created": 1544666361, "upvotes": 90}, "ebo7emm": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo7emm/", "text": "When does your class normally start/end? I need to ask first to tell whether this is fair or not.", "author": "Diabeetush", "created": 1544666288, "upvotes": -2}, "ebo6vjl": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo6vjl/", "text": "It doesn't really matter what happens next. If your professor wins the argument, you take the rescheduled exam on another day. If you win, you take the rescheduled exam on another day.", "author": "kjfdlhs", "created": 1544665814, "upvotes": 15}, "ebo69x0": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo69x0/", "text": "Find a person who records lectures and see if she ever said anything about it being 4:30. That’s pretty hard proof. ", "author": null, "created": 1544665274, "upvotes": 15}, "ebo606u": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo606u/", "text": "Ombudsman. Go to your college's Ombudsman office. They exist for situations like these. ", "author": null, "created": 1544665034, "upvotes": 15}, "ebo5yas": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo5yas/", "text": "Honestly there is suppose be a finals schedule that your professor must follow and schedule the exsm for the allotted time frame.", "author": "Groothy", "created": 1544664988, "upvotes": 101}, "ebo5vhf": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo5vhf/", "text": "The professor also can't prove that they said the final was at 4:30. They need to have it in writing!", "author": "rolllingstoned", "created": 1544664918, "upvotes": 83}, "ebo2xe2": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebo2xe2/", "text": "Clearly its not your fault if most the class thought the exam was at 3:30pm as well.", "author": null, "created": 1544662214, "upvotes": 32}, "ebnsn9n": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebnsn9n/", "text": "It is unfair. Every time I read something like this, I’m dumbfounded. Whenever my Professors would make a change to anything on the syllabus, they’d send out an email to everyone, in addition to posting it on Canvas. ", "author": "Boolien", "created": 1544653471, "upvotes": 428}, "ebnsaph": {"link": "/r/college/comments/a5n0am/professor_was_late_to_a_final_and_said_it_was_our/ebnsaph/", "text": "Definitely discuss it with the dean of the department again they know the policies better than anyone", "author": null, "created": 1544653199, "upvotes": 806}}}