{
  "sid": "q8glbh",
  "link": "/r/college/comments/q8glbh/i_fcked_up_and_now_im_not_sure_how_to_proceed_any/",
  "title:": "I f*cked up, and now I'm not sure how to proceed. Any advice is appreciated.",
  "text": "So I had a pretty large homework assignment due at midnight tonight. I waited a little bit too late to start, but by 11:30 I had done an amazing job. Like, I knew I would be getting an A on this assignment.\n\nI was looking back through and accidently deleted half of the assignment. I'm still not totally sure what I did, but I hadn't saved any of my work in a few hours so a huge chunk of progress was totally lost.\n\nI did my best to complete the work, but 30 minutes was not nearly enough time.\n\nI was about to email my instructor letting him know what happened and ask about partial credit or bonus opportunities or literally anything to save my grade.\n\nIt's just that this is an upper level class and this was a dumb mistake that could have been avoided had I not waited until so late to do the assignment. So I'm not sure that I'm really in a position to ask for that kind of help.\n\nIdk. I'm just so frustrated. My A level work just became a D.\n\nAny advice on what to do is greatly appreciated.\n\nI'm thinking I should maybe just take the L and learn from my mistakes.",
  "author": "maplegirl515",
  "created": 1634271868,
  "updated": 1634331621,
  "over_18": false,
  "upvotes": 25,
  "upvote_ratio": 0.9,
  "comments": {
    "hgp9s7s": {
      "link": "/r/college/comments/q8glbh/i_fcked_up_and_now_im_not_sure_how_to_proceed_any/hgp9s7s/",
      "text": "At least message your Instructor and tell him/her. If they say no then you take the L. If they have a better option then accept the way to fix.",
      "author": "anxietyhoh",
      "created": 1634272255,
      "upvotes": 23,
      "replies": {}
    },
    "hgpw8lr": {
      "link": "/r/college/comments/q8glbh/i_fcked_up_and_now_im_not_sure_how_to_proceed_any/hgpw8lr/",
      "text": "take the L and never forget to save again. that's all you can do. it's dumb and upsetting for sure, but it's not the end of the world. it sounds like you can whip out some pretty good quality work in little time so I'm sure you'll be fine!",
      "author": "Klutzy-Classroom6756",
      "created": 1634289673,
      "upvotes": 8,
      "replies": {}
    },
    "hgp9zxr": {
      "link": "/r/college/comments/q8glbh/i_fcked_up_and_now_im_not_sure_how_to_proceed_any/hgp9zxr/",
      "text": "Is there not an undo button or anything in the program you were using?",
      "author": "ilikecacti2",
      "created": 1634272380,
      "upvotes": 12,
      "replies": {
        "hgpax5e": {
          "link": "/r/college/comments/q8glbh/i_fcked_up_and_now_im_not_sure_how_to_proceed_any/hgpax5e/",
          "text": "I couldn't find any way to undo it in the moment. I now know that you can't undo mistakes, but the program saves all of your code in a history file. \n\nI was kind of panicked at the time so I wasn't thinking clearly.",
          "author": "maplegirl515",
          "created": 1634272867,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hgpizz6": {
      "link": "/r/college/comments/q8glbh/i_fcked_up_and_now_im_not_sure_how_to_proceed_any/hgpizz6/",
      "text": "ctrl z",
      "author": "XayahTheVastaya",
      "created": 1634278266,
      "upvotes": 4,
      "replies": {}
    },
    "hgpewnu": {
      "link": "/r/college/comments/q8glbh/i_fcked_up_and_now_im_not_sure_how_to_proceed_any/hgpewnu/",
      "text": "I would explain your situation, go back and try to find the og assignment and ask if they can mark that instead",
      "author": "Most_Boysenberry_522",
      "created": 1634275351,
      "upvotes": 2,
      "replies": {}
    }
  }
}