{"sid": "pwi9it", "link": "/r/college/comments/pwi9it/what_do_you_think_is_the_most_fair_in_grading/", "title:": "What do you think is the most fair in grading students for their overall course GPA?", "text": "A little bit of context:\n\nLast summer semester I had an awful Chemistry course with a lecturer that doesn't care what is going on in the class, gave out bunch of homework and assignments and never review them in the following class; put a bunch of AP questions into our assignments and mid+final exams (the course is General Chemistry by the way); never explain clearly when asked questions. It was really bad, yet it didn't stop at the final days of the course with a laboratory paper along with Virtual lab in which we were also given a self-designed lab paper with hypothetical scenario, a selection-by-choice list of acids and bases, and expect us to write everything from scratch.\n\nThe following week, which is the lab paper's deadline, we are rushed into final in which we are given 4 questions (each questions has 4 smaller questions); are expected to have precise outline and specific work, and a time window of 75 minutes + 15 minutes to take pictures into a .docx file and submit, or you'll receive an F automatically, no make-up. My friends skipped one questions and about 2 small questions. This also happened exactly to our mid-term exams from beginning to end (confusing questions, short time period) with us also not being able to complete everything. After the final exam, some of us brought some confusing data in one of the questions and the lecturer's response was \"You are supposed to figure out from the data given in the question?\"\n\n1 week after the finals, and I got a C, which is fair since I didn't do well on my mid and final, but other 3 of my friends got a perfect score on lab paper, midterm paper and a really high score on the final. Overall GPA of theirs are A. I feel frustrated and cheated because there are people who also performed the same or worse than my friends, but they also got some preferences and received an A overall at the end. I suspect that she likes some students more and gave them an unreal, absurd bonus on their GPA, while silently downplaying those she doesn't like; however, 1-3 people didn't get the lecturer's favor and still got As so I'm very confused by this method of grading.\n\nWhat do you guys think of this kind of grading criteria, and what is, in your opinion, is the most fair grading criteria: performance, attitude, etc. and should be followed for a fair, fun and effective course?\n\nTL;DR: bad lecturer gave unfair and unreal GPA results to some people in the same class with what seemed to be lecturer favor treatment.", "author": "sakibaraki", "created": 1632752938, "retrieved": 1632800200, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"heh737j": {"link": "/r/college/comments/pwi9it/what_do_you_think_is_the_most_fair_in_grading/heh737j/", "text": "Do you have any evidence to suggest these people 100% performed poorly to show that the teacher is manipulating the grading?\n\nBecause that’s a pretty serious accusation as it puts into question that teacher’s ability to do their job if they’re breaking rules.", "author": "kizeltine", "created": 1632754165, "upvotes": 3}, "heh72zw": {"link": "/r/college/comments/pwi9it/what_do_you_think_is_the_most_fair_in_grading/heh72zw/", "text": "When you think you got an unfair grade, ask for the markup so you can see how/where you’re being marked down in respect to the expectations of the assignment. \n\nThere were a few students I repeatedly gave very low grades to (despite their work appearing pretty similar to much higher grades students at first glance) in a class because they somehow managed to miss almost all the points on the rubric. It’s much harder to know what’s expected if rubrics aren’t given ahead of time but you can always ask for them. They’re usually not given for exams but they should be available for most assignments. \n\nIt’s also possible they were graded by different people who interpreted the rubric differently. General chemistry assignments are usually not graded by the professor but grad student TA’s (but maybe they are in very small schools).", "author": "Contntlbreakfst", "created": 1632754162, "upvotes": 4}}}