{
  "sid": "q5d9xz",
  "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/",
  "title:": "Help Responding to a Professor",
  "text": "So, I recently turned in a small(pretty inconsequential to overall grade in the course) assignment worth no more than 2 points. These are frequently assigned given around 1-2 times every week. It is literally a question to lead following discussions in class.\n\nThis assignment being the first, I had missed the initial due date and turned it in late. In this assignment my work was not up to the standard as presented by the professor as I was missing a key part of the assignment. I take full responsibility for both and I am accepting of the 0 i got for this first assignment. \n\nOut of some semblance of hope I shoot a quick THREE SENTENCE EMAIL in what is considered \"Proper Email Etiquette\" . The structure of the emails starts with me explaining I recognize her grade, then followed by if there is a chance to redo or earn any points on this assignment.  And I close up by asking what she requires specifically to get full points and thanking them for their time.\n\nShe responds with \"nope.\".  Upon reading this i felt angryish(idk), because of her inability to provide specific expectations of how she wants her assignment completed. But now I feel more confused than anything. \n\nMy first thought was, like any sane and rational person(this is sarcasm), that maybe she just didn't like me. This is pretty unfounded as I am literally two weeks into this class and she has just graded a 300ish reflection paper that was by far not my best work and gave me full points and said \"Well done.\" along with a few more specifics of why she though I did well. \n\n  \nBut now I don't know how to respond or to digest her email back to me. \"nope.\" I mean come on it was three sentences theres no way she didn't read it completely.  Sorry if this is convoluted, I don't really post ever and my head is a bit muddled after this. Thanks for your time.",
  "author": "peinman",
  "created": 1633889200,
  "updated": 1634083069,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hg4rzqp": {
      "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg4rzqp/",
      "text": "Faculty here.  My take on this situation is that the assignment is worth so few points and is such a trivial thing that you basically get one shot at it.  You either do the assignment with solid effort, or you turn in the assignment late / don't do the assignment at all / do an obviously poor job on it.  So it's an either/or thing.  You either get the credit, or you don't.\n\nBy \"nope\" I suspect the professor is communicating that (i) no, it isn't possible for you to turn in the assignment after the fact and get back some credit, and (ii) that the assignment is so trivial that there's really nothing she can write about her \"expectations.\" The only expectation for such a simple assignment is that you just do it - answer the question and submit your answer on time.\n\nSo you missed this assignment and will not get the two points.  As you already wrote, it's no big deal.  Just keep up with the due dates in the future, especially because you know that these small assignments are due multiple times per week.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1633890481,
      "upvotes": 5,
      "replies": {
        "hg59tg9": {
          "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg59tg9/",
          "text": "I dont take late work on things that aren’t trivial in some cases either.\n\nIf they ask to re-do the answer is still not",
          "author": "PersephoneIsNotHome",
          "created": 1633897730,
          "upvotes": 1,
          "replies": {}
        },
        "hg4ywtp": {
          "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg4ywtp/",
          "text": "it wasn't the issue of not meeting the due dates or even earning a zero that bothers me, but rather how the professor wont elaborate on what I need to do to get  full points in the future. How might I respond to her email to indicate that I do indeed understand and accepting of my grade but am quite frustrated at the lack of explanation behind the assignment. Thanks for your reply.",
          "author": "peinman",
          "created": 1633893338,
          "upvotes": 0,
          "replies": {
            "hg59wnn": {
              "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg59wnn/",
              "text": "You didn’t ask how to do better.  You asked for a re submit.\n\nNobody has ESP.",
              "author": "PersephoneIsNotHome",
              "created": 1633897766,
              "upvotes": 2,
              "replies": {
                "hg6f1r4": {
                  "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg6f1r4/",
                  "text": "Sorry if i didn't do a good job indicating it in the post. I did in my email. Not very good at posting on redit.",
                  "author": "peinman",
                  "created": 1633916619,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg54143": {
      "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg54143/",
      "text": "Submit an answer to discussion question on time?",
      "author": "roguezebra",
      "created": 1633895437,
      "upvotes": 2,
      "replies": {}
    },
    "hg56jqy": {
      "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg56jqy/",
      "text": "Allow me to give you some insight on real email interactions with professors.\n\nMe: Sends email with proper email etiquette explaining how I missed the due date on an assignment, but when I went to turn it in the next day for partial credit, the drop box was closed. I used formal language, proper introductions, everything,\n\nMy professor: Its fized -aj (Sent from my iPhone)\n\nSome professors just throw email etiquette out the window and give short one or two word replies. You get used to it. Also, often times professors have very strict policies on late work, so don't even bother sending them emails about it.",
      "author": "Ihavsunitato",
      "created": 1633896424,
      "upvotes": 2,
      "replies": {
        "hg6g1gb": {
          "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg6g1gb/",
          "text": "ooooffff, Ive had so many high school teacher fly off the wall for bad email etiquette claiming professors won't even look at your emails if they are written poorly. Well thanks for the tip.",
          "author": "peinman",
          "created": 1633917088,
          "upvotes": 1,
          "replies": {
            "hgb0msm": {
              "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hgb0msm/",
              "text": "I'm not saying *you* shouldn't use proper email etiquette, I'm just saying don't expect a formal email in return",
              "author": "Ihavsunitato",
              "created": 1634005195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg59ntm": {
      "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg59ntm/",
      "text": "You want to do over an assignment that was either late or incorrectly done.  There were instructions and clear due dates.\n\nThe answer is no.\n\nIt has nothing to do with someone liking you, the answer is no.\n\nIf you want to ask questions about how to complete an upcoming assignment ,dont wait till the last minute and read the instructions and ask your specific questions or go to office hours.\n\nYou didn’t ask for expectations of how to complete the assignment. You asked for a chance to re-do.  That is a yes or no answer, which you got.",
      "author": "PersephoneIsNotHome",
      "created": 1633897666,
      "upvotes": 2,
      "replies": {
        "hg6fsjn": {
          "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg6fsjn/",
          "text": "\" And I close up by asking what she requires specifically to get full points and thanking them for their time.\"  sorry if it wasn't clear in the post, but I made it much clearer in my initial email. I am completely fine with her response to me re-doing the assignment.",
          "author": "peinman",
          "created": 1633916968,
          "upvotes": 1,
          "replies": {
            "hg860vi": {
              "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg860vi/",
              "text": "Go to office hours\n\nEither this was explained in rubric or instructions  or the syllabus OR it is not somethign that can easily be explained in an email.",
              "author": "PersephoneIsNotHome",
              "created": 1633959235,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg6br5s": {
      "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg6br5s/",
      "text": "When you ask if there is a chance to \"redo or earn any points\" you show that you were not being honest when you say \"I recognize her grade\". You are actually suggesting that you deserve another chance, a chance that other students won't get.\n\nI'd say a simple \"nope\" was being pretty polite.",
      "author": "bimbosan",
      "created": 1633915043,
      "upvotes": 1,
      "replies": {
        "hg6flmp": {
          "link": "/r/college/comments/q5d9xz/help_responding_to_a_professor/hg6flmp/",
          "text": "One of the main reasons I said I recognized her grade was because I see that I did not meet the requirements of what she had asked but I am still unsure of what they are. *\" And I close up by asking what she requires specifically to get full points and thanking them for their time.\"*  sorry if it wasn't clear in the post, but I made it much clearer in my initial email.",
          "author": "peinman",
          "created": 1633916876,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}