{"sid": "pw305z", "link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/", "title:": "Is the amount of work fair to anyone?", "text": "Is the amount of work that colleges assign fair and reasonable to anyone here?\n\nIn my opinion, it would be fine to give us more work if we already knew how to do it. \n\nHowever we are given so much assignments and so much work on top of having to learn it and maybe even teaching ourselves. \n\nWhat are your opinions on this?", "author": "OctopusOnPizza1", "created": 1632692415, "retrieved": 1632800186, "over_18": false, "upvotes": 39, "upvote_ratio": 0.77, "comments": {"hehfk43": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/hehfk43/", "text": "It depends on the professor. The last 3 semesters I think have been fine and understandable in terms of work load but the ones I have this semester are driving me nuts.\n\nFor context though, I'm a full time worker and part time student. \n\nThis semester, I have one class that expects 16-20  assignments a week (not including reading the chapter or power point). While some are just easy quizzes, others are essays and take days to finish. \n\nMy other professor didn't show up for 3 weeks, posted an open ended assignment that ended up being 15 pages long. 15 pages. In a week and a half! Not including reading, which we would have had no idea the chapters to read since they were weird ones like 10, 12, and 13 to start the semester. \n\nSo yea, I think its too much this semester. I haven't been pressed this much for time before despite my school load staying the same. I wish professors were help to a much higher standard.", "author": "KoldGlaze", "created": 1632757742, "upvotes": 1}, "hegr1bk": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/hegr1bk/", "text": "Yes it’s reasonable. If it wasn’t there would be more people dropping out and failing. \n\nBut you also have to understand that college isn’t for everyone. If you genuinely, physically and mentally cannot handle the workload and this isn’t just a rant because you don’t have as much free time as you did compared to high school, then maybe college isn’t for you", "author": "kenshin817", "created": 1632746478, "upvotes": 0}, "hegkcq6": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/hegkcq6/", "text": "Imo semesters should be longer, so many classes need to move at a lightning fast pace to fit in all the material that it feels almost needlessly stress-inducing and results in you retaining less information.  Maybe we dont need fewer assignments, but just a slower pace for classes in general.", "author": "Don_Macaroons", "created": 1632742429, "upvotes": 2}, "heg6p1e": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/heg6p1e/", "text": "I get you.\n\nOn one hand, I understand the workload. As someone else said, it’s a full time job essentially. On the other hand, I bet I spend more than 40 hours a week working on school related stuff, even if I don’t I noticed that I’m far more stressed by college than I am a job, even one where I worked more than 40 hrs a week.\n\nI wish I didn’t have to sacrifice my happiness just to go to college. People have this idea that college is a great time in your life, but in my experience, it’s completely miserable.", "author": "Hopefulaccount7987", "created": 1632729878, "upvotes": 9}, "heg1aei": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/heg1aei/", "text": "A full time college class schedule (4-5 courses) over a 16 week semester doesn’t require an unrealistic amount of time to complete the workload. You should expect the course work to be more rigorous, it’s college, it’s supposed to challenge you and force you to grow. It also is supposed to teach you time management skills that will undoubtedly aid you in “the real world”. Granted some courses are drastically more difficult than others, but if proper planning is used to balance highly rigorous courses with easy electives or lower level requirements those courses should also not be a problem. I’m currently in my second term of taking 4, 8 week courses simultaneously and I could barely even call my currently smothering workload to be unfair, even though I have next to no free time, my social life has disappeared, and I haven’t gotten a full nights sleep since classes started. I knew what I was signing up for at the time I did so, and I’ve managed to maintain a 4.0 while doing so. That’s my reward for diligently disciplining myself to do what needs done by being chained to my laptop. Something can hardly be unfair when one was in agreement to making the required commitments before beginning. If a social life and large amounts of free time are more important than earning your degree cut back to part time status or get out of the kitchen entirely if you can’t handle the heat, the classes won’t get easier as you progress. You have to adapt and overcome the challenges to earn your degree it won’t be just handed to you.", "author": "LissaLee26", "created": 1632724996, "upvotes": 0}, "heg0tnb": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/heg0tnb/", "text": "I think it’s hard to quantify what “fair” is because some find it fair and some don’t. Here’s my take:\n\nA lot of work I’ve been given thus far has just been busy work. Do I think it’s reasonable that we’re paying 60k a year and I have to memorize lines from a Shakespeare play that I’m never going to use again? Nah. In fact, I think having a workload that is overbearing busy work makes students resent the actual content. In my opinion, many students get stuck on busy work and don’t actually appreciate or retain what’s being taught.\n\nBut work is necessary. We need to constantly refine our reading and writing skills, math, etc.\n\nI feel that the amount of work varies for everyone though. Some majors just have less homework than others - or at least less rigorous work. Some profs are more lenient. Others don’t have work other than studying (which is up to the student)\n\nIt’s a hard question to answer", "author": "Different-Stress6041", "created": 1632724646, "upvotes": 1}, "hefj9q2": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/hefj9q2/", "text": "Dude you’re at a university the schoolwork as rigorous as a general depending on the school you’re going to it could be more challenging than others but it’s still college the workload is higher than in high school for most cases. The expected amount of studying is basically the equivalent to working a full-time job about 30 hours a week this is pretty damn normal and they aren’t going to adjust the curriculum for people who are also working or may have other shit going on like if their parents or something. A university education is challenging doesn’t make it easy.It’s a higher level of education than high school so of course you’re going to have more work it’s expected you just need to learn how to study and manage your time you’re an adult in a more challenging post secondary institution your first year is what’s expected for you to learn how to study in the most effective way possible and manage your time properly in addition to getting the best grade you possibly can so everyone has the same workload no matter whether they have additional obligations outside of school work", "author": "pygmypuffonacid", "created": 1632712955, "upvotes": 6}, "heffvln": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/heffvln/", "text": "I work full time on weekends and do 13 credits during the week. \n\nStop your belly aching it ain’t that bad. \n\nAdmittedly though. I have no social life and get little sleep. Way she goes.", "author": "VoiceofReason541", "created": 1632711260, "upvotes": 1}, "hefcexn": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/hefcexn/", "text": "I totally agree with you! I don't think it's fair either luckily I'm almost done and i won't ever go back again to school!!", "author": "radchicken23", "created": 1632709341, "upvotes": 1}, "hef1uho": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/hef1uho/", "text": "wtf if you already knew how to do your homework then you wouldn't be learning anything, you'd be wasting your time", "author": "wobbletelescope", "created": 1632704360, "upvotes": 28}, "heeec2j": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/heeec2j/", "text": "If you are a full time student, the expected hourly requirement is roughly the same as a full time job.", "author": "PhDapper", "created": 1632693186, "upvotes": 100}, "heedyot": {"link": "/r/college/comments/pw305z/is_the_amount_of_work_fair_to_anyone/heedyot/", "text": "it’s perfectly fine and reasonable. you have more than enough time in your day to master your coursework. You’re in college not in high school, work will be significantly harder and you have to work harder to understand it. The work assigned isn’t meant to hinder your success it’s meant to help you learn, and become more proficient.", "author": "Fluffy-Mechanic-7052", "created": 1632693022, "upvotes": 7}}}