{
  "sid": "q71ovd",
  "link": "/r/college/comments/q71ovd/favorite_note_taking_apps_methods_strategies_etc/",
  "title:": "Favorite note taking apps, methods, strategies, etc for taking online courses?",
  "text": "Hi guys!\n\nI’ve been taking online courses for about a year now with SNHU. I’ve purchased most content digitally, some paperback. I have a tough time focusing and retaining information so I take my reading and notes seriously and try hard to do so effectively. I have tried taking notes by hand, digitally with Word/Notes, using the digital text book’s in program note system.\n\nSo far I have found hand written notes to be the most effective, but I’d like to go digital for ease when traveling and for organization. \n\nWhat are you guys using, what seems to be working? Any app or method that stood out for you guys?\n\nThanks!",
  "author": "imnotsure20211",
  "created": 1634092584,
  "updated": 1634167609,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfq607": {
      "link": "/r/college/comments/q71ovd/favorite_note_taking_apps_methods_strategies_etc/hgfq607/",
      "text": "For my math heavy classes I do love to have hand written notes. For all other classes I use good notes on my IPad or also one note with my computer pen.",
      "author": "SMITHL73",
      "created": 1634092676,
      "upvotes": 1,
      "replies": {}
    },
    "hgfq8ws": {
      "link": "/r/college/comments/q71ovd/favorite_note_taking_apps_methods_strategies_etc/hgfq8ws/",
      "text": "I love using GoodNotes on my iPad! Getting my iPad was a game changer. I didn’t have it fit undergrad but I have it for grad school and I wish I would’ve gotten it much earlier",
      "author": "Anxious_Pine_47",
      "created": 1634092714,
      "upvotes": 1,
      "replies": {}
    },
    "hgfuvaa": {
      "link": "/r/college/comments/q71ovd/favorite_note_taking_apps_methods_strategies_etc/hgfuvaa/",
      "text": "I have a surface pro. Taking note is decent on it.",
      "author": "AcademicDifficulty",
      "created": 1634095050,
      "upvotes": 1,
      "replies": {}
    },
    "hggdphf": {
      "link": "/r/college/comments/q71ovd/favorite_note_taking_apps_methods_strategies_etc/hggdphf/",
      "text": "For stem related classes or mainly just math, chemistry, physics, business, of course do everything by hand. I used to do every subject by hand but during the pandemic i shifted to doing my non-stem(or just exempting the classes i mentioned) stuff on google docs and just typing everything out.\n\nI like it on the computer for those types of classes(the non-stem ones) since you can just do CTRL F to find a word or definition easily, especially with a shit ton of pages to scroll through. I think it just takes too long to even do math or stem notes digitally, like you can setup a graph(provided it isnt something too complex) or do skeleton structures in organic chemistry way faster than on a computer. Like you would have to click this, click that, make a new one for the next problem, like ughhhh.\n\nBut yeah, for the most part hand written wins all the time. On computer you have to click between tabs or scroll through but with hand written you can lay multiple papers out and quickly flick between pages.",
      "author": "Chaz_Delicious",
      "created": 1634106805,
      "upvotes": 1,
      "replies": {}
    },
    "hghcjzu": {
      "link": "/r/college/comments/q71ovd/favorite_note_taking_apps_methods_strategies_etc/hghcjzu/",
      "text": "Get a second monitor. Open word on the second screen to take notes.",
      "author": "peppyunicorn",
      "created": 1634132372,
      "upvotes": 1,
      "replies": {}
    }
  }
}