{"sid": "psxd0k", "link": "/r/college/comments/psxd0k/college_advisor_is_delaying_my_graduation/", "title:": "College Advisor is delaying my graduation", "text": "I am a Computer Science student getting a Bachelors degree. This past summer I was enrolled in a course and got really sick with COVID the last week. I talked to my professor and he agreed to give me an 'I' for incomplete and let me turn in the final project when I recovered. He left it up to me what date I turn it in. It took me a while to recover and then the Fall semester started and I had to keep up with my current classes.  I plan on submitting the project by October 1st and getting that 'I' grade replaced with a letter grade. There is no problem there. \n\nCome Fall 2021, my university requires us to take a senior thesis course our last semester. I planned on graduating this Fall so I have to take this thesis course. We get to choose an senior elective and write a paper related to that topic. So the class is a mix of students who are only taking it as an elective and students who are doing a Senior paper. \n\nThe course approval form requires 3 signatures from 1) an academic advisor 2) the Professor and 3) the Dean, in that order.\n\n I waited until the third week of class to submit my approval form because I wanted to see what the professors thesis assignment would be in the two electives I am enrolled in. One professor released it on the third week and I decided I would go with his class because I liked the topics he chose. His only requirement is we have to submit a 20 page paper by December from a list of topics he has chosen. \n\nI submitted the course approval forms to the Advising office through email and the advisor replied and said I had to get email proof from the professor that he will still accept me since classes started already. There is no deadline for the Thesis course application listed on the website so I had no knowledge of this rule. I even spoke to an advisor and she said to do it as early as possible but did not give me a date. I have classmates who applied after classes started as well so I thought I was good. Still, no problem. I talked to my professor and he sent them an email saying he will accept me. Everything seemed fine.\n\nTwo weeks later I received an email from the advising office that said they cannot accept my request because I have an 'I' grade from the summer (see first paragraph).  I have scanned the entire university website trying to find this rule and couldn't find anything on it. I replied and explained my situation and how that course won't remain an 'I' grade as I am submitting my project soon. \n\nI am very upset because I don't understand the grounds for denying my request. Lets say I don't submit my project and get an F in my incomplete summer course. Obviously I would not graduate and that would make sense. They can take away my Senior Thesis credit and I would have to retake it in Spring. That would be reasonable and fair.\n\nBut why are they denying me the opportunity to try and finish the semester and graduate? If I submit my senior paper and finish the Summer course I will meet all the requirements. I have a 3.0 GPA and am on track with all my Fall 2021 classes. \n\nPlease give advice on what I should do. Is there someone higher up I can talk to like the Dean? It just seems like the Advising Office doesn't care about derailing my graduation and I am so disheartened.", "author": "RedxAjah", "created": 1632275547, "retrieved": 1632800950, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hdspr18": {"link": "/r/college/comments/psxd0k/college_advisor_is_delaying_my_graduation/hdspr18/", "text": "Call until you get an in person appointment. It’s ridiculous and I’ve faced a similar situation myself this semester and I had to MAKE someone sit down and help me. Something I worried myself to death over for months was solved in 15 minutes just by sitting down and being able to explain your situation.", "author": "Top-Bobcat-8313", "created": 1632277241, "upvotes": 1}, "hdspjjo": {"link": "/r/college/comments/psxd0k/college_advisor_is_delaying_my_graduation/hdspjjo/", "text": "You may need to discuss with a different advisor. Make them acknowledge your concerns and situation.", "author": "Top-Bobcat-8313", "created": 1632277140, "upvotes": 1}}}