{
  "sid": "p8evzx",
  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/",
  "title:": "Extroverts are a different breed. Like, wow.",
  "text": "I'm an introvert who struggled to make friends all throughout college. I tend to be too nervous to start conversations unless it's a forced situation like with roommates, and I am guilty of judging a book by its cover. Someone who visually looks like the type of person who would not talk to me is someone I'm not talking to. My high school friends are still solid, and I just don't care anymore as a senior, but this just happened.\n\nI had the privilege of shadowing an extrovert at an event, and she had a friend group assembled in just minutes. This girl was indiscriminate about who she was talking to. She just went for it. Literally the next four people who approached our area were roped into a circle and added to a group chat, and everyone was invited to another event. This is the first time I've seen \"it's easy to make friends in college\" happen in real life. I was amazed lol. Like, what power is this???",
  "author": "IAlmostDieded",
  "created": 1629496554,
  "over_18": false,
  "upvotes": 846,
  "upvote_ratio": 0.98,
  "comments": {
    "h9tllp3": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tllp3/",
      "text": "I am an extrovert to a fault. It is a cope to my social anxiety problems, and my talkative nature can sometimes get in the way of my professional life. Its something i have been working on and taking notes from introverts.",
      "author": "AreasofInterest",
      "created": 1629573621,
      "upvotes": 5,
      "replies": {
        "h9tmnfv": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tmnfv/",
          "text": "Interesting. I didn't realize being an extrovert could have a negative impact on someone's professional life. I guess it's all about finding a balance. Thanks for sharing!",
          "author": "IAlmostDieded",
          "created": 1629574113,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9tkf4w": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tkf4w/",
      "text": "I am an extrovert. I struggled socially mt first year of college. I love talking and meeting people, but I struggle to form lasting relationships. Being an extrovert isn’t everything.",
      "author": "ihatemathematica",
      "created": 1629573071,
      "upvotes": 3,
      "replies": {}
    },
    "h9tctmo": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tctmo/",
      "text": "Hey, I am 17F and been an introvert until 14. Then I decided to at least try and change something about myself, because just hated the way I was. Now I can call myself an ambivery(can compliment random peopleat shops, etc.) However,  I would really love to become extroverted. What can you guys suggest?\nPs.: sorry for my English, it is not my native language:)",
      "author": "thelilpsycho",
      "created": 1629569572,
      "upvotes": 2,
      "replies": {}
    },
    "h9t89y1": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9t89y1/",
      "text": "Extroverts are not those shallow people as they are portrayed in mainstream. I love their energy to be around.",
      "author": "ppllmmm",
      "created": 1629567539,
      "upvotes": 4,
      "replies": {}
    },
    "h9t3yis": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9t3yis/",
      "text": "I’m extrovert but terrible at making AND friends. I think she was just someone who naturally pulls others",
      "author": "Cinnamode",
      "created": 1629565590,
      "upvotes": 2,
      "replies": {}
    },
    "h9syqy4": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9syqy4/",
      "text": "THEY’RE BUILT DIFFERENT. Like how??? I can’t talk to a person and keep eye contact for a long time. It’s either we have a silent staring contest or I talk to you while I look to the floor. They’re just so talkative and welcoming I feel like they want to scam me like those people that talk to you so easily just to get something out of you but they’re just people trying to make friends  aren’t shy to talk to strangers.",
      "author": "YourAverageThinker",
      "created": 1629563273,
      "upvotes": 3,
      "replies": {}
    },
    "h9sgwob": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9sgwob/",
      "text": "same situation here, against the narrative that college is the best/easiest time to make friends, it's been really hard for me. even if online school didn't interrupt everything for a year, i really have trouble putting myself in front of people and seeming interesting. happy to hear it's not just me in the world who feels similarly.",
      "author": "fowmart",
      "created": 1629555048,
      "upvotes": 1,
      "replies": {}
    },
    "h9rp3ma": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9rp3ma/",
      "text": "I don’t really understand either. It’s not really an anxiety thing for me as much as truly burning out socially super quickly. I can’t socialize at the level you described, but I can be friendly with strangers for a period of time or hang out with friends and talk for a while. Not a chance I could do that stuff you described though. It’s some black voodoo to me how people can both create and enjoy so much constant interaction with people they barely know.",
      "author": "XxNHLxX",
      "created": 1629535582,
      "upvotes": 4,
      "replies": {
        "h9scjnz": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9scjnz/",
          "text": "Same. I do get nervous about being the one to start things, but I'm also just a homebody who thrives in my alone time. I do go out of course, just not a ton. I like this person though, and I would like to hang out sometimes. I need to find the sweet spot between my me time and my out time. I'm just worried that if I say no too much, the invites will stop, and then I'll be sad lol.",
          "author": "IAlmostDieded",
          "created": 1629552804,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h9rfos1": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9rfos1/",
      "text": "I'm an introvert and I have social anxiety 💀",
      "author": "Competitive_Space_43",
      "created": 1629527656,
      "upvotes": 13,
      "replies": {
        "h9t25u6": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9t25u6/",
          "text": "Same. I try to make connections at my job here and there since I haven't started community college yet. \n\nAny tips especially if your going remote?",
          "author": "throwaway1142018",
          "created": 1629564791,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h9r93fy": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r93fy/",
      "text": "Please tell me more lmaoo as an introvert I need these powers",
      "author": "shrimpynut",
      "created": 1629522875,
      "upvotes": 4,
      "replies": {
        "h9scm3p": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9scm3p/",
          "text": "Idk man lol. I lucked out. She's one of my new roommates, and she's just very outgoing. Even this morning, she and the other roommates went out together. I'm too tired to go since I stayed out late last night, but I was amazed again. This will be a new normal I guess. I'm just going to observe and join in when I have the energy lol.",
          "author": "IAlmostDieded",
          "created": 1629552838,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h9r5hlh": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r5hlh/",
      "text": "I feel like introverted people think too much of themselves sometimes, they’re always like “is this weird to say? What should I say?” Nobody is thinking about you as much as you are, and maybe  if you say something weird that relates with someone else, you can make a cool friend. Introverted people I’ve know always held back sharing niche interests and thinks in fear of judgement. but as an extrovert, I’d genuinely like to hear it. but also introversion and extroversion have nothing to do with confidence and charisma, it has to do with how much you yearn to actually connect with people. I make good conversation because I actually am interested in other people. other people I find can’t make friends because really, they don’t care and are just caring for the sake of having “friends” around. But also personally I’d rather be introverted, I care too much about feeling connected with people and most people would rather mostly be alone, and just have u by their side in case they feel like talking for once. Which feels isolating. I would say I have more friends than most but I probably feel alone more than someone who’s just content with being alone. I am only as secure as my surroundings are",
      "author": "FckMiDed",
      "created": 1629520540,
      "upvotes": 19,
      "replies": {}
    },
    "h9r1gl1": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r1gl1/",
      "text": "i am intro , whenever i feel shy i just forcibly do it , thats the solution, ex: was afraid to ask for extra oreggano at dominos , went karen mode and aasked for 10 more , got only 3 btw",
      "author": "Embarrassed_Ear_1146",
      "created": 1629518143,
      "upvotes": 8,
      "replies": {}
    },
    "h9qxn3m": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qxn3m/",
      "text": "The college I currently attend has a ton of people like this. I feel like almost everyone has a group of friends, even the freshmen. It's certainly strange to me and makes me feel a little like the odd one out lol",
      "author": "Autumnleaves201",
      "created": 1629516016,
      "upvotes": 8,
      "replies": {}
    },
    "h9qvcys": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qvcys/",
      "text": "Chances are, this girl was probably good looking, making it easier for people to like her.",
      "author": "09ikj",
      "created": 1629514805,
      "upvotes": 11,
      "replies": {
        "h9selcn": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9selcn/",
          "text": "Interesting point. That's not impossible, but she had on a huge mask. Idk if pretty privilege was a factor here.",
          "author": "IAlmostDieded",
          "created": 1629553871,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9qkvf4": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qkvf4/",
      "text": "Introversion =/= being nervous",
      "author": "Eddie_078",
      "created": 1629509662,
      "upvotes": 87,
      "replies": {
        "h9r2ni9": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r2ni9/",
          "text": "^^^. This is true. Being introverted/extroverted isn’t really related to having social anxiety or being nervous. It’s more of what environment you feel recharged in, if you find yourself feeling re-charged & energized from being alone vs being around others. Introverts and extroverts can both be sociable people, but they differ in where they thrive/feel better in.",
          "author": "JuggernautOk7990",
          "created": 1629518841,
          "upvotes": 26,
          "replies": {}
        }
      }
    },
    "h9qkoxh": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qkoxh/",
      "text": "sure, same as people on facebook with 10k friends, but zero real ones.",
      "author": "ghostmode342",
      "created": 1629509576,
      "upvotes": 3,
      "replies": {}
    },
    "h9qjqiw": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qjqiw/",
      "text": "Being an extrovert isn't necessarily the same thing as having charisma, though. The person you were with clearly had charisma. Regardless it is awesome to be around someone who is like that",
      "author": "unholymanserpent",
      "created": 1629509115,
      "upvotes": 434,
      "replies": {
        "h9qpahh": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qpahh/",
          "text": "This is very true. I'm in between an introvert and extrovert, but my parents taught me how to network at a very young age. I feel comfortable going up to literally anyone and talking to them. \n\nI will say this I make friends like this but they're not really long-term friends. I have very few very good friends. And it often feels like I mostly have acquaintances. Which ironically makes me feel lonely.",
          "author": "veanell",
          "created": 1629511779,
          "upvotes": 193,
          "replies": {
            "h9qpz2i": {
              "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qpz2i/",
              "text": "Wow I feel like I wrote this myself. I’m an extrovert and have no issues making friends or talking to strangers but I don’t have that many close friends. I have a few and the ones I do have are awesome but I also feel lonely sometimes too. I think part of that is just growing up like we’re not in high school anymore where you’re forced to socialize for 8 hours a day ya know",
              "author": "Ultrarapidcyclerbitc",
              "created": 1629512111,
              "upvotes": 60,
              "replies": {
                "h9qq5ff": {
                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qq5ff/",
                  "text": "yeah I miss high school it's definitely easier to make friends when you're forced to be around the same groups of people for 8 hours a day.",
                  "author": "veanell",
                  "created": 1629512197,
                  "upvotes": 27,
                  "replies": {
                    "h9qqu25": {
                      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qqu25/",
                      "text": "What year are you? If you’re a freshman, it gets better. I’m a junior and freshman year of college was by far the worst year of my life. One thing that has helped me though is going out to parties. If you’re not a drinker this may not be your thing lol but being around the same people a lot makes you comfortable and eventually creates relationships. My issue is I’m realizing that my “party friends” are not exactly my people. Time to make new friends I guess haha",
                      "author": "Ultrarapidcyclerbitc",
                      "created": 1629512526,
                      "upvotes": 19,
                      "replies": {
                        "h9r2y19": {
                          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r2y19/",
                          "text": "how do you find parties to go to? I really want to get out there and make a bunch of friends at parties but I don’t even know where to start. My roommate is not the party type and I’m not sure how to bridge the gap between talking to people in class/cafeteria/dorm etc. and “let’s go party.” thanks!",
                          "author": "Dramatic_Chest_4133",
                          "created": 1629519016,
                          "upvotes": 8,
                          "replies": {
                            "h9r4edc": {
                              "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r4edc/",
                              "text": "Are you in Greek life? I’m not personally but I have a few friends who are and that’s how I find parties to go to. Since I’m not 21 yet, we mostly go to house parties, but if you’re over 21 (or have a fake lol) then I would recommend going out to bars with a few friends. The trick is you need to find at least one person who’s pretty outgoing and has connections. My best friend is the life of the party so I usually find out about events through her. The easiest way to make friends in my experience is through friends. It just takes time and practice. Good luck! :)",
                              "author": "Ultrarapidcyclerbitc",
                              "created": 1629519876,
                              "upvotes": 9,
                              "replies": {
                                "h9sfpam": {
                                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9sfpam/",
                                  "text": "I’m not in greek life but it’s something I’d consider in future years(I’m a freshman btw). Where did you meet these party type people? Dorm or classes etc? And yeah I should probably stop worrying since it’s only the first week of my college experience lol",
                                  "author": "Dramatic_Chest_4133",
                                  "created": 1629554444,
                                  "upvotes": 2,
                                  "replies": {
                                    "h9sitj3": {
                                      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9sitj3/",
                                      "text": "I had some friends coming into college but I met more through my classes & a few on my hall as well. I promise you you will meet people! Everybody in college is so friendly and they want to make connections just like you. It won’t happen overnight but you’ll look back in a year or 2 and be proud of how far you’ve come. I guess some advice of mine would be to be yourself so people like you for who you are & definitely take advantage of the first few weeks because that’s when people are the most open to new friends. Also try to stay there on the weekends if you can (I made the mistake of going home every weekend freshman year and regret it tbh). If you have any other questions please just let me know!",
                                      "author": "Ultrarapidcyclerbitc",
                                      "created": 1629555969,
                                      "upvotes": 4,
                                      "replies": {
                                        "h9skv30": {
                                          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9skv30/",
                                          "text": "thanks so much!",
                                          "author": "Dramatic_Chest_4133",
                                          "created": 1629556934,
                                          "upvotes": 3,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "h9qrcom": {
                          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qrcom/",
                          "text": "I'm in grad school ... And yeah it gets better. Grad students know how to connect in college because we know it's the only way to survive and stay sane. :) \n\nAnd yeah grad students generally know how to drink... I go to trivia a few times a months and usually win free beer with my team. The undergrads hate our team...",
                          "author": "veanell",
                          "created": 1629512777,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h9qu2ck": {
              "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qu2ck/",
              "text": "i was quite sheltered growing up, is there any hope?",
              "author": "Letmetellyouabtlyfe",
              "created": 1629514138,
              "upvotes": 11,
              "replies": {
                "h9qu8z0": {
                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qu8z0/",
                  "text": "Absolutely. One of my closest friends was homeschooled that didn't really make any friends till college. Just be yourself and try and put yourself out there. \n\nIt helps to join a study group or a campus organization. Do something that interests you.",
                  "author": "veanell",
                  "created": 1629514229,
                  "upvotes": 7,
                  "replies": {
                    "h9qxuqu": {
                      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qxuqu/",
                      "text": "they r very cliquish so i never ever fit in unless u have some special talent or smth",
                      "author": "Letmetellyouabtlyfe",
                      "created": 1629516132,
                      "upvotes": 3,
                      "replies": {
                        "h9qy08j": {
                          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qy08j/",
                          "text": "Mnn... Generally speaking in college people are very open to relationships. Know that they don't see themselves as cliques... They most likely won't exclude you if you strike up a conversion",
                          "author": "veanell",
                          "created": 1629516217,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h9r0wb3": {
              "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r0wb3/",
              "text": "same dude, parents taught me well. Apparently my dad would purposely make me ask questions to store staff, cause I barely talked when I was young. Now I'm able to boldly get stuff started and round people together. I do, however, lack long-term friends. I blame corona.",
              "author": "Kerisma123",
              "created": 1629517822,
              "upvotes": 4,
              "replies": {
                "h9spp7v": {
                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9spp7v/",
                  "text": "Yeah my dad was a lobbyist in his youth and my mom worked in HR and then as advisor that placed kids in jobs...",
                  "author": "veanell",
                  "created": 1629559191,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h9qhp9u": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qhp9u/",
      "text": "I’m an introvert and it’s really not that hard to do this bro. When ever I go out which is like once or twice a week and I’m having fun I can just talk to people like it’s nothing and they can too. You gotta just relax lol they’re human too. Remember being introverted is not the same as being a shy and unsociable person, it just means you get your energy by being alone.",
      "author": "LuukeyBoy",
      "created": 1629508129,
      "upvotes": 61,
      "replies": {}
    },
    "h9q8rws": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9q8rws/",
      "text": "I believe that extroversion and introversion is a childhood habit, the path you go on depends on your household and family structure. Just with any habit, you can learn to break it, but you have to be committed and put yourself in uncomfortable situations to learn.",
      "author": "StillSadAboutJiraiya",
      "created": 1629503888,
      "upvotes": 73,
      "replies": {
        "h9qs185": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qs185/",
          "text": "I mean some people have actual anxiety that prevents them with connecting with people...",
          "author": "veanell",
          "created": 1629513118,
          "upvotes": 28,
          "replies": {
            "h9s56s1": {
              "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9s56s1/",
              "text": "Well the question is what caused you to develope anxiety? When you were a toddler im sure you werent afraid to be yourself, you were just trying to play. Then you experience something socially traumatic, it never gets resolved and when you turn into an adult it transforms into anxiety.",
              "author": "StillSadAboutJiraiya",
              "created": 1629548586,
              "upvotes": 7,
              "replies": {
                "h9udldm": {
                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9udldm/",
                  "text": "\n>Then you experience something socially traumatic, it never gets resolved and when you turn into an adult it transforms into anxiety.\n\nSome people are just predisposed to it man. It doesn't take some big trauma, and it can develop in childhood.",
                  "author": "Suspicious-Metal",
                  "created": 1629586763,
                  "upvotes": 3,
                  "replies": {}
                },
                "h9sp431": {
                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9sp431/",
                  "text": "Ironically I'm more extrovert than introvert... But as a toddler I was incredibly shy because I had a hearing impairment. \n\nI was referring to OP. Anxiety is a disability for some. Not just something one gets over. I got tubes put in my ear and went through speech therapy. When I could hear and talk without be judged I lost my shyness... But everyone is different. \n\nTalking about anxiety as something people get over is ableist.",
                  "author": "veanell",
                  "created": 1629558919,
                  "upvotes": 5,
                  "replies": {
                    "h9ssuzp": {
                      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9ssuzp/",
                      "text": "Your right, I am talking from an ableist standpoint. In our generation mental health has surfaced to the point where anyone, able bodied and all, can say they have anxiety and depression. Having an actual physical inpediment is a different story, but not the most common.",
                      "author": "StillSadAboutJiraiya",
                      "created": 1629560623,
                      "upvotes": -5,
                      "replies": {
                        "h9tw17b": {
                          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tw17b/",
                          "text": "lol what",
                          "author": "flippers_666",
                          "created": 1629578453,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9q69w7": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9q69w7/",
      "text": "Personally, I would hate that.",
      "author": "PianoConcertoNo2",
      "created": 1629502712,
      "upvotes": 18,
      "replies": {
        "h9qonld": {
          "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qonld/",
          "text": "Hate what? What are you referring to?",
          "author": "Glittering_Ad8893",
          "created": 1629511485,
          "upvotes": 5,
          "replies": {
            "h9qpdo5": {
              "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qpdo5/",
              "text": "The post. I would hate to be a person doing person things and have another person come up to my person.",
              "author": "PianoConcertoNo2",
              "created": 1629511822,
              "upvotes": 3,
              "replies": {
                "h9stwzr": {
                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9stwzr/",
                  "text": "Then you probably wouldn’t go to such an event, the whole point is to network and meet people",
                  "author": "BylvieBalvez",
                  "created": 1629561098,
                  "upvotes": 2,
                  "replies": {}
                },
                "h9r22ma": {
                  "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r22ma/",
                  "text": "So you mean like if you were shadowing the extrovert you will be mad if others joined and socialized with ya'll?",
                  "author": "Glittering_Ad8893",
                  "created": 1629518500,
                  "upvotes": 1,
                  "replies": {
                    "h9scu27": {
                      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9scu27/",
                      "text": "I interpreted it to mean that they would rather be left alone than be randomly approached for friendship.",
                      "author": "IAlmostDieded",
                      "created": 1629552953,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9pza4w": {
      "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9pza4w/",
      "text": "I’d say I’m an extrovert/sociable, I’m very similar to the person you just described. To me, it’s always amazing how shy some people are. Like some of my friends are too shy to ask for something at a restaurant or greet someone who said hi to them. It’s just different brains working differently.",
      "author": "coolkidstone",
      "created": 1629499446,
      "upvotes": 137,
      "replies": {}
    }
  },
  "updated": 1634051897
}