{
  "sid": "qcvs9n",
  "link": "/r/college/comments/qcvs9n/defeated_academically_not_sure_how_to_stay/",
  "title:": "Defeated academically, not sure how to stay motivated to do anything.",
  "text": "I have one purpose in life and it’s to help people. That’s fine. I sacrifice my time, energy, enjoyment, and entire self towards that. I’ve accepted that.\n\nI do the same for college. No parties, no time off. Constant studying, day in and day out. I grasped the material. I thought I was doing really well.\n\nWell apparently not. Got my exams back. 63, 78, 78, 82. I did everything that I was supposed to. I did more than I was supposed to, honestly. And it wasn’t enough.\n\nWhat do I do when my absolute most isn’t enough? I went to office hours, I went to tutors, I studied and studied, I felt confident with practice exams, I felt confident with homework, quizzes, all of it. And nothing. \n\nI can’t do anything else. Why try if it’s just going to result in those marks, for every class.",
  "author": "username17366217",
  "created": 1634834152,
  "updated": 1634849195,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hhidnuq": {
      "link": "/r/college/comments/qcvs9n/defeated_academically_not_sure_how_to_stay/hhidnuq/",
      "text": "Sounds like me, I always fail exams. I just want to call it a psychological condition at this point except you got 80’s so that’s not bad",
      "author": "ThicccPanta",
      "created": 1634835000,
      "upvotes": 3,
      "replies": {}
    },
    "hhifu65": {
      "link": "/r/college/comments/qcvs9n/defeated_academically_not_sure_how_to_stay/hhifu65/",
      "text": ">Got my exams back. 63, 78, 78, 82.\n\nIt might help to recalibrate your understanding of the grading scale.  The scores you received are not objectively bad, they've average.  I understand how these grades might come as a surprise if you tended to receive much higher grades in high school, but college work is simply a different level of expectation and understanding compared to high school.\n\n>What do I do when my absolute most isn’t enough?\n\nIsn't enough *for what*, exactly?  Getting all A's?  That's a nice goal to have, but it's certainly not *necessary* in order to graduate or get a job after college or whatever.  The 78's and 82's are fine, roughly C's or B's depending on the exact grading scale.  The 63 is a little more concerning, but certainly not unrecoverable based on your performance from here on.\n\nI think you're doing ok overall.  Just keep studying and keep working at it.  If you're taking a wide variety of subjects, it's not unreasonable to assume that you'll do better in some of them compared to the others depending on your particular interests and abilities.  So just keep diligently studying, attending class, going to tutors, etc., and do the best you can.  That's all you can ask of yourself.\n\n> No parties, no time off. Constant studying, day in and day out.\n\nOh, and stop doing this.  Nobody can work 18 hours per day, 7 days per week.  Research clearly shows that after a certain amount of work without a substantial break, our ability to learn new things, absorb complex information, and use that information to complete tasks falls off drastically.  So, there's a clear point of diminishing returns for someone who studies all the time.  I'm not saying you have to become a party animal and go out on the town 5 nights per week, but you should distribute clear periods of leisure throughout your week, even formally adding them to your daily schedule if you need to.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1634835848,
      "upvotes": 2,
      "replies": {}
    },
    "hhij2qd": {
      "link": "/r/college/comments/qcvs9n/defeated_academically_not_sure_how_to_stay/hhij2qd/",
      "text": "Consider switching your major. There are lots of ways to \"help\" people, but HOW will?",
      "author": "zifmer",
      "created": 1634837129,
      "upvotes": 1,
      "replies": {}
    },
    "hhit2t7": {
      "link": "/r/college/comments/qcvs9n/defeated_academically_not_sure_how_to_stay/hhit2t7/",
      "text": "Why do you want straight As? There isn’t really a good reason for them in college unless you are super focused on grad school, but even then there is a cost benefit analysis to do. All that time overstudying is time away from experiences that can help you get jobs outside of college. Once you pass high school straight As aren’t really as important anymore. Mostly Bs and As are just fine.",
      "author": "QuickEquivalent0",
      "created": 1634841186,
      "upvotes": 1,
      "replies": {}
    },
    "hhja4nr": {
      "link": "/r/college/comments/qcvs9n/defeated_academically_not_sure_how_to_stay/hhja4nr/",
      "text": "For what it's worth, most employers are not considering college gpa's as the sole factor of greatness anymore. It has shifted to experience in many fields ranging from Liberal Arts to STEM. They want to see your independent research, your written book, your personal project, your lab assistance. Likewise, an F - C- is not ideal, but your grades already tread on C - A territory. I would spend some hours of your intense studying revaluating good study habits, and then I'd spend the rest finding  research / internship opportunities on campus that could help propel my resume.",
      "author": "youareaweirdo___",
      "created": 1634848063,
      "upvotes": 1,
      "replies": {}
    }
  }
}