{
  "sid": "q9rs2k",
  "link": "/r/college/comments/q9rs2k/why_am_i_still_emotional_about_leaving_for_college/",
  "title:": "Why am I still emotional about leaving for college?",
  "text": "I’m in my fourth year of college and I still get emotional every time I need to leave home for college. My home isn’t even a good environment, my parents are toxic and abusive, but somehow I still hate leaving this home. I miss my dog and my grandparents who are back home most of the time. \n\nBut then, when I’m at college, I don’t find myself wanting to go home either. I’m guessing I just don’t like changing environments and would rather stay in one place. \n\nMy other guess is that I miss my home city (large city) whereas my college city is tiny. \n\nAnyone else feel the same? How did you get over it?",
  "author": "VisualLimit",
  "created": 1634445193,
  "updated": 1634654847,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgyevpe": {
      "link": "/r/college/comments/q9rs2k/why_am_i_still_emotional_about_leaving_for_college/hgyevpe/",
      "text": "Grass is greener on the other side. You want X, then when you get X, you want Y - vice versa. \n\nI'm the same. Home area/town/city isn't great, but I still want to go back when I'm at University. When i'm at home, I sometimes want to go back to University. For me, it's basically hating changing environments and being away from a part of my life (i.e. at home, I'm missing my college life, at college, I'm missing my home/personal life). Also, nostalgia is a big factor as to why I like my home town/city/area. \n\nHow'd I get over it? I didn't. I'm about to finish my 4th year at University real soon (in the coming months), and it's time for me to leave my University town for good (unless I get a job here  - but I doubt it since there's fucking nothing here). \n\nLowkey, don't get too hung up over college. In the grand scheme of things, it's the smallest/shortest stage of your life - 4 years, compared to 12-13 years of school or 30+ years during the career stage.",
      "author": "stick7_",
      "created": 1634451951,
      "upvotes": 2,
      "replies": {}
    }
  }
}