{
  "sid": "pxyuph",
  "link": "/r/college/comments/pxyuph/dropping_out/",
  "title:": "Dropping out.",
  "text": "How many times did you consider dropping out of school and did you ever do it? Honestly for me it feels like I contemplate dropping out 3-4 times a week and my head is exploding lol.",
  "author": "Own-Maximum-2087",
  "created": 1632932388,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.94,
  "comments": {
    "her84lh": {
      "link": "/r/college/comments/pxyuph/dropping_out/her84lh/",
      "text": "every time my average slightly drops in a class but at the end of the day i know this is something i need to do",
      "author": "EdelwoodOil",
      "created": 1632941452,
      "upvotes": 1,
      "replies": {}
    },
    "her4hct": {
      "link": "/r/college/comments/pxyuph/dropping_out/her4hct/",
      "text": "I don’t even hate hard work. I just have trouble focusing in class, or shifting from one subject to the next, and I often miss things not being detail oriented, which devastate my grade\n\nThe hard working people I know are baffled by this. They think smart = success, and only lazy people struggle. Good for them I guess, I don’t care\n\nI think I’ll have a fine time in the work world. Though I’ve only worked non academic jobs, I’ve never struggled at work. The struggle is having to learn many new concepts every week. Were it just one subject, or just consistent work projects, not exams, I’d do fine\n\nSo I think of dropping out, but then i remember if I stick through it work will be easier. And to those who say college is easier, im glad you’re a sponge who can just soak up knowledge, enjoy that",
      "author": "DeepSpaceOG",
      "created": 1632939942,
      "upvotes": 1,
      "replies": {
        "herslre": {
          "link": "/r/college/comments/pxyuph/dropping_out/herslre/",
          "text": "Lmao well put man best of luck!",
          "author": "Own-Maximum-2087",
          "created": 1632949752,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "heqycbr": {
      "link": "/r/college/comments/pxyuph/dropping_out/heqycbr/",
      "text": "every single day …",
      "author": "TownUsual4788",
      "created": 1632937409,
      "upvotes": 5,
      "replies": {}
    },
    "herj24z": {
      "link": "/r/college/comments/pxyuph/dropping_out/herj24z/",
      "text": "Every time I breathe",
      "author": "fruitninja777",
      "created": 1632945898,
      "upvotes": 6,
      "replies": {}
    },
    "herqfnx": {
      "link": "/r/college/comments/pxyuph/dropping_out/herqfnx/",
      "text": "I loved going to class and learning about various subjects. I thrived away at college, on my own and had a 3.9 gpa. And I dropped out after completing my sophomore year. I've been out of college for about a year now.\n\nIf it would be beneficial to your mental health or growth, I seriously recommend taking a semester or year long leave of absence. Obviously that privilege isn't available to everyone, but sometimes a break is just needed. Especially if you're experiencing burnout or a lack of motivation. \n\nPersonally, I know i'll go back to school because I enjoy it but obviously that isn't the case for everyone. Taking time off was so good for me because it allowed me to get my lust for learning back and motivation to move towards the future I want for myself. Ive also finally been able to address my mental health and anxiety disorder after struggling with it my entire life. \n\nJust know that there are so many good paths out there for you and there's no shame in taking a little longer to graduate if that's something you choose. Best of luck!!",
      "author": "noelle_21",
      "created": 1632948879,
      "upvotes": 5,
      "replies": {
        "herswk2": {
          "link": "/r/college/comments/pxyuph/dropping_out/herswk2/",
          "text": "I started late because of the military and feel like I was so focused on catching up that it has completely exploded my motivation. Part of me wants to work full time and not get my bachelors (I have an associates) the other part of my wants my bachelors but idk if I can suffer through 2 more years of this shit. I’m proud of you for addressing your mental health issues tho!",
          "author": "Own-Maximum-2087",
          "created": 1632949878,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hersgsw": {
      "link": "/r/college/comments/pxyuph/dropping_out/hersgsw/",
      "text": "i constantly feel worthless here. I have not met a single person who promotes going to college other than the forcefulness of it from high school. Im completely hating it here, obtaining higher education feels like a total waste of money and time unless you absolutely need a specific degree for your field. My parents told me if I dont go then I will be completely disowned by them. I ended up going to school just to try, regret...goodbye family.",
      "author": "xfettuccins",
      "created": 1632949695,
      "upvotes": 3,
      "replies": {
        "hes3pdd": {
          "link": "/r/college/comments/pxyuph/dropping_out/hes3pdd/",
          "text": "I'm 32 and dropped out when I was early 20s. I'm a very smart person.\n\nThe jobs I had without a degree were all shit. There's people in the world that love to WORK HARD. That's their thing. They could move bricks 12 hours a day and be happy. If you're one of those people, quit school. Jobs can break you. Shitty jobs do. I haven't had a 401k for most of my jobs in the past decade. I've had two jobs making 50k a year in the past 10 years.\n\nStay in school for you. I know it's aggravating but I assure you, a shitty job working for horrible people without many ways out is debilitating. They won't grant you vacation, you don't *earn* vacation. 10 hour shifts are horrible on your body. Working 70 hours a month blows.",
          "author": "Awkward_Mail_2786",
          "created": 1632954699,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hes59wx": {
      "link": "/r/college/comments/pxyuph/dropping_out/hes59wx/",
      "text": "I dont ever. I failed out the first time I went to college, I didnt actively want to leave i just made a lot of bad choices. Not being in school and working a shitty minimum wage job made me rethink my priorities. Its hard, i have 2 assignments to do right now that i just dont want to do, but im going to. Itll be worth it someday. You should have some kind of career in mind thatll bring you happiness or at least you can be content with, thatll bring in enough money for the things you enjoy",
      "author": "taybay462",
      "created": 1632955446,
      "upvotes": 1,
      "replies": {}
    },
    "hesrdde": {
      "link": "/r/college/comments/pxyuph/dropping_out/hesrdde/",
      "text": "Every single day do I wish I could drop out",
      "author": "Sparkelz13",
      "created": 1632965871,
      "upvotes": 1,
      "replies": {}
    },
    "hesxvw1": {
      "link": "/r/college/comments/pxyuph/dropping_out/hesxvw1/",
      "text": "I’ve dropped out twice 😬. The first time was due to my brother dying and that being overwhelming/school was uncooperative with me over my late work (I only missed Tuesday-Friday of that week). The second time I just wasn’t in the right head space to do the work. I was always looking for a reason to skip class or turning in shitty work so I decided I needed to take a step back for awhile. I’m back in school now… 2ish years later",
      "author": "delusionalry",
      "created": 1632968957,
      "upvotes": 1,
      "replies": {}
    },
    "hetp2g3": {
      "link": "/r/college/comments/pxyuph/dropping_out/hetp2g3/",
      "text": "I only thought about dropping out when I had no idea what to major in",
      "author": "lazairiaw",
      "created": 1632986272,
      "upvotes": 1,
      "replies": {}
    },
    "hew9yng": {
      "link": "/r/college/comments/pxyuph/dropping_out/hew9yng/",
      "text": "I'm a senior and the thought hasn't left me since my freshman year. Two days ago, I looked up the other schools I got accepted into originally and I wonder what would've been different if I just went there instead.",
      "author": "peaachlyy",
      "created": 1633035114,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634051137
}