{
  "sid": "qbj29g",
  "link": "/r/college/comments/qbj29g/looking_for_advice_should_i_ask_to_take_my_exam/",
  "title:": "Looking for advice: should I ask to take my exam later?",
  "text": "Hi, I’m a freshman going to a small liberal arts school (idk if it’s relevant). I’ve been very sick with a cold for the past week. I sleep 15 hours a day, I’m exhausted, and I just generally feel awful. Also it doesn’t help that I have to choose between taking cold medicine to feel okay or my ADHD medication so I can function, as I am not supposed to take both at the same time. \n\nTo illustrate how sick I am, today one of my professors made me leave class and told me to please go to my room and sleep because I am so sick.\n\nAnyways, I am taking a math class and I have not been able to go to class for a week because I’m sick. (The terms at my college are ten weeks long.) I have class again on Wednesday and then I have an exam worth 20% of my grade on Friday. The problem is that I missed about half of the content that will be on the exam because I was absent from class. I’m trying to teach myself the content but I’m still having trouble thinking straight because I am sick. And I haven’t been able to study at all because I can’t think straight. My question is:\n\nWould it be reasonable to ask to take the exam on Monday instead of Friday? A relevant detail is that I have an academic disability so I take my tests at the disability center rather than in class. So it (hopefully) wouldn’t inconvenience my professor to take it later, but I am unsure whether this is a reasonable request or whether I should suck it up and take the exam and risk getting a very bad grade.\n\nWhat do you think? I appreciate any advice!",
  "author": "InconsistentToaster",
  "created": 1634672167,
  "updated": 1634750315,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh9uzda": {
      "link": "/r/college/comments/qbj29g/looking_for_advice_should_i_ask_to_take_my_exam/hh9uzda/",
      "text": "I think it's better if you ask earlier than later.",
      "author": "Awkward_Mail_2786",
      "created": 1634673254,
      "upvotes": 3,
      "replies": {}
    },
    "hh9uz64": {
      "link": "/r/college/comments/qbj29g/looking_for_advice_should_i_ask_to_take_my_exam/hh9uz64/",
      "text": "It seems like a reasonable request given your sickness is a disadvantage as it hinders the ability for you to be well-rested enough and concentrated for the exam.\n\nHowever, mine or anyone else’s opinion doesn’t matter. Whether the request seems reasonable or not really is dependent on your professor. And if they have strict policy, they may rightfully so require you to provide a doctor note in order to be able to retake the exam at another time.\n\nSo your best bet is to just email the professor anyways and ask. Explain everything you mentioned here and see what they say. In the meantime, try your best to continue studying just in case they do refuse to grant you the ability to take it at a later date.",
      "author": "kizeltine",
      "created": 1634673252,
      "upvotes": 2,
      "replies": {}
    }
  }
}