{
  "sid": "qk6lf9",
  "link": "/r/college/comments/qk6lf9/is_it_better_to_drop_or_fail_a_class/",
  "title:": "Is it better to drop or fail a class?",
  "text": "I am taking a business statistics course which I am pretty sure is mandatory for my degree and I have been doing horrible on the quizzes and I have an exam coming up that is worth 25% of the grade. On the first exam I got a 31 out of 50 only because the professor grades it. A few people in my class have already dropped it but I don't know how that affects my classes or my financial aid.",
  "author": "susman01",
  "created": 1635741731,
  "updated": 1635779395,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hiupmmd": {
      "link": "/r/college/comments/qk6lf9/is_it_better_to_drop_or_fail_a_class/hiupmmd/",
      "text": "Personally, I would say drop; so you don’t screw up your gpa. If you’re already failing a test and struggling- help your mental Health and drop the class. If you think you can get better-study- put in the long hours and pull up your grade than stay. \n\nIf think your not going to pass- drop it.\nIf your mental health is in jeopardy- drop it.\nWorried about your gpa tanking- drop it. \nIt’s better to have a W-withdrawal then a low gpa and wishing you dropped the class earlier. \n\nTake another class to substitute to the class you have withdrawn from- and make sure it’s an easy and good professor.",
      "author": "RedForceList",
      "created": 1635743591,
      "upvotes": 3,
      "replies": {}
    },
    "hiuwvhn": {
      "link": "/r/college/comments/qk6lf9/is_it_better_to_drop_or_fail_a_class/hiuwvhn/",
      "text": "At my last college (i went to a CC and transfered. double check yours, but i believe this is standard most places). When you drop within the allowed dates you recieve a W on your transcript, meaning withdrawn (aka dropped the course). It shows up on your transcript BUT DOES NOT AFFECT GPA. If you are to fail, you get a D or F (or whatever grade is failing for that class) on your transcript. This WILL affect GPA.\n\nAt my college you could do that with the same course 2x. Once you dropepd the 3rd time it defaulted to an F.\n\nThis can be used to keep scholarships, however it is good to make sure the scholarship doesnt have any specifics about withdraws. The scholarship i had in CC says im allowed 1 withdraw a year. My scholarship now at university says none (mostky because my college does classes super weird)",
      "author": "Aluratherogue",
      "created": 1635749629,
      "upvotes": 1,
      "replies": {}
    }
  }
}