{
  "sid": "qdw22o",
  "link": "/r/college/comments/qdw22o/i_am_hoping_for_a_little_input_basically_i_have/",
  "title:": "I am hoping for a little input. Basically, I have been in school for way too long.",
  "text": "Got a certificate in 2016, started general ed in 2017 to start working toward getting into a veterinary technology program. Mine is online, and I need the vet hospital I work at as my site to do clinical tasks. My advisor has projected me to graduate in at least the end of 2023. There are courses involving video tasks that my advisor insists I can’t do more than one at a time. The course catalog for a full-time student has one semester filled with FOUR of those classes plus other classes in the course plan. I have to have the classes approved by an advisor before they can be registered. She wants me to retake classes I don't need (already passed) to do the course plan her way. I don't understand why I can't be advised about doing more so I can graduate sooner than that so I can stop burning out and needing breaks. I am very uncomfortable with all of this and I don't know what to do about it.",
  "author": "AsterLeaCelestine",
  "created": 1634956524,
  "updated": 1635184663,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhp8xxm": {
      "link": "/r/college/comments/qdw22o/i_am_hoping_for_a_little_input_basically_i_have/hhp8xxm/",
      "text": "Why do they suggest 1 per semester? How many hours are you working at your job weekly?\n\nI work full time and have managed 6-7 credit hours per semester for 3 consecutive semesters, which is 2 classes. Is it possible to transfer to another school that would let you go faster?",
      "author": "MyCatThinksImSoCool",
      "created": 1634957615,
      "upvotes": 3,
      "replies": {
        "hhp9a9h": {
          "link": "/r/college/comments/qdw22o/i_am_hoping_for_a_little_input_basically_i_have/hhp9a9h/",
          "text": "I am working full time right now, but I might have the opportunity to do more if it's worth it to talk to my manager. Each class in my program, though challenging enough to deserve 3 credits sometimes, each have 2. I normally take 6 credits a semester which is the minimum for my financial aid. I sent her a question asking if I can manage to work less how many can I take? And she gave me the same schedule I have now. It seems fishy and I don't like it at all. If I transfer, none of my credits come with me so I start all over again. This is supposed to be a 2 year degree and I have already been doing it for 2 years. They seem to want it to take four, though they advertise a totally different schedule.",
          "author": "AsterLeaCelestine",
          "created": 1634957810,
          "upvotes": 3,
          "replies": {
            "hhpd5xn": {
              "link": "/r/college/comments/qdw22o/i_am_hoping_for_a_little_input_basically_i_have/hhpd5xn/",
              "text": "I would verify that the program is fully accredited before continuing. Reputable programs generally transfer credits.",
              "author": "MyCatThinksImSoCool",
              "created": 1634960095,
              "upvotes": 1,
              "replies": {
                "hhpfl29": {
                  "link": "/r/college/comments/qdw22o/i_am_hoping_for_a_little_input_basically_i_have/hhpfl29/",
                  "text": "They are accredited by AVMA, which is the authority who would handle my licensing. Another college doesn't always accept all of your credits. I had only certain ones that would transfer to them, and a different set of my credits (still not all) was going to be accepted by a  different college that I had thought about also. It looks like I need to stop being nice at this point, I could already be registered if I had simply chosen an in-person program, but I had to keep working at the time. Now I have more flexibility but the advisor isn’t changing it. So the only answer I can see is be annoying until my needs are met, which really sucks.",
                  "author": "AsterLeaCelestine",
                  "created": 1634961515,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}