{
  "sid": "q27sqb",
  "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/",
  "title:": "I am currently in the uncomfortable position of having to report my group partner to the professor.",
  "text": "We had a group assignment this past week with one other person. Right off the bat I did not get a good feeling from my partner. I had seen him and known of him weeks before this assignment. I remember the second week of the semester we were in a study group ready to turn in hw1 and he shows up all \"huh? what are we supposed to do for this assignment?\" never mind the fact that it was due in a few hours. \n\nHe also asked me multiple times when the hw was due. We have had a hw every single week and it has always been due Tuesday night. Every single time, it has never changed. Very concerning if he doesn't even know that. Furthermore, he has not been present for the last 3 class lectures. \n\nAnyways, I took initiative to set up a zoom meeting the next morning of the day it was assigned. He agreed to meet on zoom but the next morning he was nowhere to be found. I asked him what happened and he said he “forgot”. Never-mind that I told him about it not 12 hours ago the night before.\n \nWe met the next day and we agreed I would do half 1 and he would do half 2 and we would meet up at the end of the week. Well it’s due tonight and he tells me he has nothing, not even a sorry or anything. Just 'oh well' *shoulder shrug*. The professor told us to report it if the other person did not contribute and they would receive a zero. On one hand I want to and think he is definitely deserving of this. On the other I am hesitant bc he seems to be friends with another classmate who has been helping me with this class. There is a possibility that the three of us will be put together in a group for the final project. This would probably make it very awkward and more difficult to work with down the line as I see him bad mouthing me and accusing me of getting him a zero on this hw.",
  "author": "gtrman571",
  "created": 1633474753,
  "updated": 1634083655,
  "over_18": false,
  "upvotes": 231,
  "upvote_ratio": 0.98,
  "comments": {
    "hfjf8yz": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjf8yz/",
      "text": "Tell the prof, and if he doesn’t like you for it then who cares he was dead weight anyway. I wouldn’t even partner with him on the final and tell the prof that too. Best to roll the dice on a new group. A similar thing happened to me and I had to go from carrying a group to carrying a different group, but at least the second group at least cared enough to show up",
      "author": "harry01772",
      "created": 1633475460,
      "upvotes": 267,
      "replies": {
        "hfjfrwn": {
          "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjfrwn/",
          "text": "Yup. Report him and attach the documentation that you’ve given him multiple opportunities to participate and he hasn’t. In the work force no one is gonna carry him through his career so if he doesn’t get corrected now it will never change.",
          "author": "rynpickles",
          "created": 1633475716,
          "upvotes": 63,
          "replies": {}
        }
      }
    },
    "hfjgfbd": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjgfbd/",
      "text": "Honestly report him, do you really want someone like that on your final project?",
      "author": "not-reusable",
      "created": 1633476033,
      "upvotes": 106,
      "replies": {
        "hfjstrn": {
          "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjstrn/",
          "text": "Of course not but I would like our mutual friend on it and he might let him into the group.",
          "author": "gtrman571",
          "created": 1633482014,
          "upvotes": 24,
          "replies": {
            "hfjzzmc": {
              "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjzzmc/",
              "text": "Start chatting with other people. Might have to ditch your friend with him and get another group",
              "author": "GoldRequest",
              "created": 1633485833,
              "upvotes": 60,
              "replies": {}
            },
            "hfkr4ro": {
              "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfkr4ro/",
              "text": "Can you tell your mutual friend? Idk how you would word it but say something along the lines of \"he's a great guy but not a great teammate\"",
              "author": "llamaintheroom",
              "created": 1633502158,
              "upvotes": 15,
              "replies": {
                "hfkrk6y": {
                  "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfkrk6y/",
                  "text": "The thing is our mutual friend is kind of passive. I think he has trouble standing up for himself. I don’t think he realizes his own worth and doesn’t really care if people copy off him as hardworking as he is.",
                  "author": "gtrman571",
                  "created": 1633502516,
                  "upvotes": 5,
                  "replies": {
                    "hflloom": {
                      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hflloom/",
                      "text": "then don't work with him",
                      "author": "marbelousgeologist",
                      "created": 1633525788,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                },
                "hflweqt": {
                  "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hflweqt/",
                  "text": "one of my best friends was a terrible worker (they were lazy) and i ended up doing all the work and i was kind of annoyed but i knew they were lazy and we kind of drifted apart (me and another friend complained too much \\*we didnt complain to them we complained to each other\\*",
                  "author": "Moteoflobross7",
                  "created": 1633530801,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hfo4555": {
              "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfo4555/",
              "text": "Then tell your mutual friend you don't want to work with this person because they don't do any work.",
              "author": "Prof_Adam_Moore",
              "created": 1633565433,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfjgnce": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjgnce/",
      "text": "Look at this from another perspective:  Your partner is expecting you to carry the load while providing him with a decent grade.  Few people would find that arrangement acceptable.\n\nYou're not \"telling on\" him as much as you'd be stating the obvious:  He hasn't helped.  There's not much else to the story.  It's not personal; it's just the facts.  As far as his \"bad mouthing\" you, this was something he brought on himself, so should it become necessary, you should be ready to \"correct\" his version of events.",
      "author": "DeskRider",
      "created": 1633476140,
      "upvotes": 39,
      "replies": {}
    },
    "hfjkewc": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjkewc/",
      "text": "As professor this is exactly the type of information I wish we had. Zero for the partner, full credit for the student who did all the work. You are providing the documentation, so it's a no brainer.\n\nPlease tell your professor!",
      "author": "yostreed",
      "created": 1633478001,
      "upvotes": 41,
      "replies": {}
    },
    "hfjwn2l": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjwn2l/",
      "text": "Ugh, this is why I hate group assignments with a fiery passion. I do *not* want to have to hold someone's hand or nag them to complete their part of the work... My grade should depend on my work and my work *alone*.",
      "author": "Apprehensive_Half617",
      "created": 1633484144,
      "upvotes": 14,
      "replies": {
        "hfldtqn": {
          "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfldtqn/",
          "text": "Honestly. I got an A- in class once simply because my groupmates were incompetent at our assignment. We literally went over strategies and discussed everything together and I gave reminders on exactly what not to do when we were presenting because the professor told us that she would mark us down for it (turning our backs to the audience, reading off the slides, not making eye contact, having too much text on our slides), yet my groupmates did all of that.",
          "author": "roganwriter",
          "created": 1633521332,
          "upvotes": 2,
          "replies": {
            "hflus5t": {
              "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hflus5t/",
              "text": "i had the reverse problem in a class like that, i was put in a class where all we did was presentations and almost all of them were group projects. i’m horrible at giving presentations, i would go to all the group meetings and practice for hours but always get anxiety during the actual presentation and mess up. i wish the presentations in classes like that were focused more on how we did individually especially because it wasn’t a class for our major and was one of those required core classes.",
              "author": "lasagnaisgreat57",
              "created": 1633530090,
              "upvotes": 2,
              "replies": {
                "hflvd0h": {
                  "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hflvd0h/",
                  "text": "Yeah I get that too. But, for me it was a class for Comm majors filled with other comm majors. If the people in my group weren’t comfortable with presenting or willing to learn how to overcome that, then they really should’ve considered changing majors.",
                  "author": "roganwriter",
                  "created": 1633530339,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfjwhly": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjwhly/",
      "text": "Report him! And if your mutual friend dislikes it, tell them to look at it from your perspective.",
      "author": "glossaam",
      "created": 1633484049,
      "upvotes": 7,
      "replies": {}
    },
    "hfko73a": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfko73a/",
      "text": "There’s always going to be shitty people who don’t contribute their share, it’s the fundamental flaw in group work in college. Don’t feel bad for reporting him, he didn’t do the work and you shouldn’t let him freeload off of your hard work",
      "author": "Ok_Opportunity4248",
      "created": 1633499831,
      "upvotes": 4,
      "replies": {}
    },
    "hfjkfun": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjkfun/",
      "text": "You did your half, he didn’t even show up. Some people are just like that. He earned the zero, so who cares what he does now.",
      "author": "TWR3545",
      "created": 1633478014,
      "upvotes": 3,
      "replies": {}
    },
    "hfjs272": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfjs272/",
      "text": "Report him! The teacher wants you to because the teacher wants to be fair! It’s not your fault he didn’t contribute and you definitely tried to help him along too. Tell your teacher you don’t want to work with him again if they have any say in the matter. \n\nDon’t partner with him on your final. If somehow you are, then report him again if he doesn’t put in the work. If he doesn’t put in the work, your other friend should be just as annoyed. But it’s for your friend to discover for themselves if they give that person a chance.",
      "author": "shoelaceys7373",
      "created": 1633481656,
      "upvotes": 3,
      "replies": {}
    },
    "hfkmmjh": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfkmmjh/",
      "text": "He’s going to get a zero anyways man. He can’t blame you if it’s his fault",
      "author": "dblevs22",
      "created": 1633498650,
      "upvotes": 3,
      "replies": {}
    },
    "hfl1fid": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfl1fid/",
      "text": "Why do you care if what seems to be his friend is helping you with the class. Report you did it the report on your own. \n\nPlus I doubt your final project will include the idiot who can't pull his own weight. You'll probably be able to choose people for it, or he'll probably drop the class if that's still an option.",
      "author": "Rj_owns",
      "created": 1633511595,
      "upvotes": 3,
      "replies": {}
    },
    "hflhaf0": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hflhaf0/",
      "text": "Never let anyone bring you down and take advantage of you! This is your grade. You paid a lot of money to be there, therefore do NOT let anyone who clearly does not respect you, decrease your chances of succeeding. \n\nWhen I was in undergrad, I had a couple of group projects where I worked with “trashy” people or people that just didn’t live up to my expectations, and guess what I ended up taking a grade that I was NOT happy with and to top it all off, I had to do most of the work. And I’m not happy for doing that to myself! To this day, when I look back, I get angry at myself for letting those kind of people take advantage of me \n\nIf you think that the one person, “mutual friend”, who has been helping you out will choose not to help you out after you report their friend, then that shows his/her character as being poor. And why would this mutual friend want to have someone that doesn’t do their work in their team? That doesn’t make any sense to me. I understand they’re friends, but from experience, these kind of friends gotta go! Like what others have commented, try to branch out of this group and into a healthier/cohesive group. \n\nIf you have to report that trashy partner of yours, so be it. They’re not going to help you get what you want. And at the end of the day, they don’t care about you. \n\nPut yourself first, my friend! 😌🙌🏾",
      "author": "Oniko_2009",
      "created": 1633523377,
      "upvotes": 2,
      "replies": {}
    },
    "hflb5d7": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hflb5d7/",
      "text": "I had a partner from hell once too. I reported him. He had – after 3 months – no clue what we were doing. I had to hold his hand installing the basic programs. He always sweettalked me when I raised my concerns. Since I had done the whole work anyway I couldn't see why he should get credit for it. I got a B+, which is a good grade for me. To this day I don't know what his problems were. He blatantly refused to hand in his part, although it was just documentation. My secret suspicion is that he took drugs. No regret!",
      "author": "MissPiggyWasABadPig",
      "created": 1633519596,
      "upvotes": 1,
      "replies": {}
    },
    "hflyha2": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hflyha2/",
      "text": "Report it and ask to not be placed with that guy on the final.",
      "author": "poop_on_you",
      "created": 1633531688,
      "upvotes": 1,
      "replies": {
        "hfm3b0o": {
          "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfm3b0o/",
          "text": "I did. He says we choose partners for final. My fear is I’ll pick mutual friend and mutual friend will pick idiot thus trapping me with him again.",
          "author": "gtrman571",
          "created": 1633533724,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfmdeb3": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfmdeb3/",
      "text": " Report his ass, your future comes first",
      "author": "twistedguts800",
      "created": 1633537872,
      "upvotes": 1,
      "replies": {}
    },
    "hfndt00": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfndt00/",
      "text": "I'm currently having group problems too.  Its incredibly stressful, I know the situation you're in.\n\nIf its a simple case of the person not doing the work, and your grade will suffer because of it, just tell the prof.\n\nYou won't even remember these people in a few years, so his opinion of you is meaningless.",
      "author": "throwawayyyyout",
      "created": 1633553172,
      "upvotes": 1,
      "replies": {}
    },
    "hfnij2q": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hfnij2q/",
      "text": "You are not causing his consequences. He caused his own consequences. Please tell the instructor",
      "author": "airwesisgarbage",
      "created": 1633555211,
      "upvotes": 1,
      "replies": {}
    },
    "hga139j": {
      "link": "/r/college/comments/q27sqb/i_am_currently_in_the_uncomfortable_position_of/hga139j/",
      "text": "This sums up why group projects are so ridiculous.",
      "author": "CardinalHijack",
      "created": 1633988304,
      "upvotes": 1,
      "replies": {}
    }
  }
}