{"sid": "ihxjz4", "link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/", "title:": "So I guess I didn’t graduate college?", "text": "UPDATE: After finding this out yesterday afternoon, I contacted several admin and professors. The issue has been worked out, and they have agreed to grant my degree for the semester I *should’ve* graduated. Thanks, y’all! \n\n\nJust curious if anyone has experienced anything similar, and if so, what was the outcome (though I hope no one else has been here). \n\nSo, I *graduated* in spring. I was accepted to a grad program, moved across the country, and have been taking GRAD classes/working/conducting research all summer. \n\nI received an email this afternoon from my UG uni stating that I could apply for readmission and graduation, if I wanted to graduate in December. \n\nSay what?! \n\nIt turns out, I had an incomplete (thanks to Covid) THAT WAS NEVER CHANGED. Mind you, this was a research course that was an elective (didn’t need it to graduate). The instructor turned in the grade after the deadline. \n\nAgain, say what?!\n\nBefore finding out that a degree wasn’t granted, I contacted the uni asking why I haven’t received my diploma yet. They mentioned they were backordered and I wouldn’t receive until the end of summer. NEVER did anyone mention that I wouldn’t be awarded a degree.  \n\nIt’s likely my grad school won’t mind at all, and I’ll continue on like nothing happened, but my mind is blown right now. And I know the pandemic has really hit academia hard, but shit. Can’t a girl even graduate?! \n\nTL;DR: Found out I didn’t officially graduate undergraduate despite already being in grad school, thanks to UG uni not submitting paperwork.", "author": "PaleoNimbus", "created": 1598576522, "retrieved": 1632802047, "over_18": false, "upvotes": 1269, "upvote_ratio": 0.99, "comments": {"g365ad8": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g365ad8/", "text": "I “graduated,” and walked before my final grades were released, as many grads do. I knew I had passed all my final classes so I wasn’t worried. \n\nMoved out, left for a 3 months summer grad trip. \n\nGet back home to a message from the admin office saying I will not be receiving my diploma because they never received my final grade for my last neuro lab. \n\nI basically asked how that was my problem and that I am aware that I passed and finished the course. \n\nThey told me I had to come to campus and locate the professor and tell them to submit my grade by the end of the week or I won’t get a degree.\n\nAre you fucking kidding me?!?\n\nThankfully I only lived ~7 hours away, so I drove there, literally searched the campus. Found a grad student lingering in the lab rooms who I didn’t know. Was able to convince them to somehow locate this professor. Professor wouldn’t see me, but apparently would submit my grade by the end of the day per grad student. \n\nThey did, thankfully. I received my degree and diploma, but I seriously couldn’t fucking believe that shit. \n\nThis was at UC Santa Barbara Btw. Fuck that school.", "author": "Johnnyring0", "created": 1598645277, "upvotes": 2}, "g35kw2y": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g35kw2y/", "text": "I work for a university and we will retroactively add students to graduation if it was a university error that kept them from graduating. You might want to push this if it wasn't your fault at all.", "author": "EasilyEnabled", "created": 1598635716, "upvotes": 3}, "g35jbnx": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g35jbnx/", "text": "[deleted]", "author": null, "created": 1598634977, "upvotes": 1}, "g34m1ur": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34m1ur/", "text": "Yeah alot of teachers pushed grades back and had one teacher submit my grades on the day of deadline in spring. He didnt even respond to anyones emails on grades. \n\nAs of now teachers are submitting grades as I turn in assignments for this semester. So if i submit an assignment today, ill get the grade by today.", "author": "nathanielx4", "created": 1598617861, "upvotes": 3}, "g34iu7x": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34iu7x/", "text": "um your grad school might care about this matter. yikes.", "author": "spoon_clank", "created": 1598615486, "upvotes": 2}, "g34hqw7": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34hqw7/", "text": "My friend had all of her credits in line to graduate in May 2019. She found out in the late fall of 2018 that one of her classes had not counted towards a requirement according to her student catalog. She would have to take a class over the summer to graduate. She decided to study abroad and make the most of it. While abroad, she found out that the school had messed up again and told her that the wrong class would count. She had gotten it in writing but apparently that wasn’t enough. She had to take an online class in Fall 2019 to finally graduate in September.", "author": "TheFork101", "created": 1598614603, "upvotes": 4}, "g34fvft": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34fvft/", "text": "Did you meet the graduation requirements, or not?", "author": "mikeblas", "created": 1598612995, "upvotes": 4}, "g34eqo4": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34eqo4/", "text": "Yup, take this one to the top. You might have to make threats to get your way. If you talk to enough people you will eventually find someone willing to help.", "author": "WhoGivesADuckAbout", "created": 1598611931, "upvotes": 3}, "g34ebqg": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34ebqg/", "text": "This happened to me sort of! About 10 years ago, I had registered under the 2008-2009 curriculum. In spring 2011, I was told I couldn’t graduate because I didn’t satisfy the curriculum. Turns out that the advisor never turned in the paperwork that year, but did the next academic year, so the curriculum changed. They ended up honoring it after looking at the scanned original that was submitted for the wrong year. It was ridiculous and probably would have been easier to just take the extra semester but I had to stand up for myself.", "author": "mother_of_nerd", "created": 1598611533, "upvotes": 8}, "g34dtp2": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34dtp2/", "text": "Same thing happened to my brother only instead of going to a graduate school, he became a commisioned officer in the Navy. The Navy temporarily halted his orders and stationed him near his old school to take the one course he thought he didn't need in order to get his diploma that once again he was assured he was getting because he had graduated supposedly.\n\nHe met his now wife during that time and is now a commander O5 with my three nieces.", "author": "Nullveer", "created": 1598611039, "upvotes": 6}, "g34bldz": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g34bldz/", "text": "I had something slightly similar happen. I turned all my incomplete work in well before the deadline to my prof, find out after a few months, after COVID had already started, that my audit was still showing an incomplete, was told if it wasn’t changed soon, it would turn into an F. I freak out, email professor. She doesn’t respond, presumably because of COVID stuff. I manage to find a mobile number of her’s from Syllabus, I text that, she says that she already submitted it, but will submit it again, but it still hasn’t been changed even after back and forth with prof, she claims she sent the grade update stuff multiple times but after a few months, it still hasn’t shown up. Registrar isn’t answering my emails still. It was a Gen Ed course.", "author": "fullofregrets2009", "created": 1598608768, "upvotes": 17}, "g341k4t": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g341k4t/", "text": "Definitely don’t tell your grad department.  If they haven’t checked by now, they won’t.  If you tell them, you compel them to look into it.", "author": "imjustsayin314", "created": 1598598393, "upvotes": 20}, "g33760p": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g33760p/", "text": "I had a situation where one of my requirements was not met, turns out I needed a diversity credit, despite taking multiple classes that definitely should've met that requirement, I wasnt told about it til towards the end of Spring 2020. Luckily I was able to take the class in the summer quarter and now have my AA degree from my community college as I head to my University.", "author": "Cascades2Seattle", "created": 1598578099, "upvotes": 121}, "g3357kk": {"link": "/r/college/comments/ihxjz4/so_i_guess_i_didnt_graduate_college/g3357kk/", "text": "So, if the prof submitted late, he still submitted and you’re X/U grade will be turned into a (whatever grade you received) on your transcript once everything is kosher with the school again right? (If not, smells like a lot of law suits are coming their way)\n\nSo just apply to graduate when ever the next application date is, and everyone continues on right?", "author": "ttyy2000", "created": 1598577020, "upvotes": 422}}}