{
  "sid": "qptsue",
  "link": "/r/college/comments/qptsue/overcoming_procrastination/",
  "title:": "Overcoming procrastination…",
  "text": "College sophomore rn I’ve pretty much stopped procrastinating on homework but freshman I was terrible. I would turn in assignment within hour of due date often and Sundays were the so stressful. \nI got a job that allows me to do homework at work and I started doing homework in between classes instead of hanging out or watching tv. So now I practically don’t have any work to do over weekend. And I don’t feel stressed about school most of the time anymore.\nI say all this to encourage any procrastinators to get your work done as soon as you can, it makes college feel 100x easier and less stressful. I don’t really have any tips other than just do it.",
  "author": "Disgruntled-2k",
  "created": 1636425444,
  "updated": 1636655316,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjw2up6": {
      "link": "/r/college/comments/qptsue/overcoming_procrastination/hjw2up6/",
      "text": "Submitting within an hour of the due date? Try submitting at 11:59pm when it's due at 11:59pm 😎\n\nYeah but seriously, I've been improving on working ahead recently and I hope I can keep it up. Because that last minute (literally) panic is NOT worth it at all.",
      "author": "NoDryHands",
      "created": 1636427645,
      "upvotes": 2,
      "replies": {
        "hjw4oce": {
          "link": "/r/college/comments/qptsue/overcoming_procrastination/hjw4oce/",
          "text": "In my English 102 I submitted a paper at 11:59 and canvas marked it as late but my teacher gave full credit still. I think a part of me liked to submit things the last minute makes focus and give you the motivation you need to do it, get it done or drop a letter grade.",
          "author": "Disgruntled-2k",
          "created": 1636428483,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}