{
  "sid": "qxtks7",
  "link": "/r/college/comments/qxtks7/should_i_transfer_help_please_this_decision_has/",
  "title:": "Should I transfer? (Help please, this decision has been weighing on my for a while)",
  "text": "I'll try to keep it as concise as possible.\n- First year student. I took classes at Ohio State for a couple years in high school so I have enough credits to where I'm a sophomore technically so I can buy myself some time. I decided to go to a small school called Otterbein, which is about 30 minutes from me, because I didn't enjoy the classes I took at OSU.\n- After a semester at Otterbein, I have been very unhappy. There are close to no clubs and the ones I looked into have very few meetings or aren't engaging, no intramural sports, and seemingly the only social event is to party at frats, which I don't like to do. The food is also bad and has no options. I haven't stayed a weekend yet because all my friends do is party and the ones that don't party complain about how there's nothing to do. \n- On the other hand, if I transferred to OSU I'm not sure I'd be happier. I'd be closer to home, there'd be more clubs, but I'd likely have to commute and feel like I would be behind on making friends since I'm a transfer. The food would at the very least have more options and it's a better school, but I honestly can't tell if I'd be happer, and I already have friends at Otterbein.\n\n- I know none of you can make my decision for me, but has anyone been in a similar decision and can help?",
  "author": "therhinsocceros",
  "created": 1637368418,
  "updated": 1637689553,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlc58io": {
      "link": "/r/college/comments/qxtks7/should_i_transfer_help_please_this_decision_has/hlc58io/",
      "text": "hey, fellow ohioan here! osu is a rather boisterous environment (one that i don't jive with myself) and since you're not a fan of frats dominating the social scene.. i don't think going there would necessarily help you, not to mention that you didn't enjoy the classes you took there. are there any other schools that you've looked at? do you have to stay home/in-state? your options are not limited, and i think you can find friends anywhere! it's difficult when you already have a social circle, but from what it sounds, you still don't enjoy the environment at otterbein. ask yourself if you want to do this for 3 more years. if not, weigh your options and talk with your advisor.",
      "author": "datsruffbuddy",
      "created": 1637373954,
      "upvotes": 1,
      "replies": {}
    }
  }
}