{
  "sid": "qzb9br",
  "link": "/r/college/comments/qzb9br/do_college_grades_matter_when_youre_applying_for/",
  "title:": "do college grades matter when you're applying for a job?",
  "text": "i'm not satisfied with my school performance lately, it doesn't help that i failed most of my quizzes lately no matter how hard i study.  as a result, my grades are super average, and its hard to get a 1.00 (this is considered the highest possible grade) in my university.  \n\ni'm worried my future employer would take one look at my transcript and decide not to hire me because of my grades.",
  "author": "inczann1a",
  "created": 1637549601,
  "updated": 1637689114,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlle8rc": {
      "link": "/r/college/comments/qzb9br/do_college_grades_matter_when_youre_applying_for/hlle8rc/",
      "text": "Yes, for your first one, after that people don’t care about your transcript. Don’t listen to people who say “Grades don’t matter!!” You still need good grades for internships while in college.",
      "author": "M33RHARIS",
      "created": 1637550342,
      "upvotes": 5,
      "replies": {}
    },
    "hlli183": {
      "link": "/r/college/comments/qzb9br/do_college_grades_matter_when_youre_applying_for/hlli183/",
      "text": "Sort of? They're a good saving grace if you didnt do anything in college. Like, if someone was in college and had no side projects, no volunteering stories, no extra curriculars, or anything besides school then it matters a lot. But if you used the knowledge from your freshmen intro to ECE course to build a clock, then thats pretty cool.",
      "author": "AHumbleLibertarian",
      "created": 1637552185,
      "upvotes": 1,
      "replies": {}
    },
    "hllpnvm": {
      "link": "/r/college/comments/qzb9br/do_college_grades_matter_when_youre_applying_for/hllpnvm/",
      "text": "It depends on the field and the job. It ranges from barely mattering to hard GPA cutoffs.",
      "author": "TheProfessorsCat",
      "created": 1637556075,
      "upvotes": 1,
      "replies": {}
    }
  }
}