{
  "sid": "qiwybz",
  "link": "/r/college/comments/qiwybz/i_need_some_input_from_transfer_students_about/",
  "title:": "I need some input from transfer students about transferring colleges! Plz help",
  "text": "Hey everyone,\n\nSo basically I'm deciding on whether or not to transfer from Marquette University to another school like Loyola University Chicago or University of Illinois Urbana-Champaign. The main reasons I want to transfer are social and mental reasons. Being here has taken a toll on my mental health as I feel isolated, anxious, and depressed simply being on campus, I'm struggling to fit in severely, and I can't seem to find friends I can relate to. As an Indian here at Marquette, it's very hard to find others like me. With that stated, I want to transfer but I'm concerned and stressed about how the transfer process is like, which is why I need some input. What did you have to do to \"officially\" transfer between colleges? How long did the process take? What reasons did you have to transfer? What was the transition to a new college like? Did you regret it or was it worth it?  Was it stressful? \n\nThanks for the input! I appreciate it a ton!",
  "author": "Clear_Coach9633",
  "created": 1635581520,
  "updated": 1635779798,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hip35ch": {
      "link": "/r/college/comments/qiwybz/i_need_some_input_from_transfer_students_about/hip35ch/",
      "text": "You have to apply to the schools to which you want to transfer.  You would apply as a transfer student. The process will be on the new school's website.  You will need to provide your high school transcripts, as well as transcripts from your current college.  \n\nAs a word of advice, you should carefully consider why you want to transfer.  Transferring for academic reasons is often a good move.  Conversely, social and/or mental health issues will not automatically be cured by transferring.",
      "author": "taxref",
      "created": 1635632377,
      "upvotes": 1,
      "replies": {}
    }
  }
}