{
  "sid": "qrs74w",
  "link": "/r/college/comments/qrs74w/i_think_i_should_drop_out_of_college_but_im_not/",
  "title:": "I think I should drop out of college, but I’m not sure.",
  "text": "I’m very sorry for how long this post is, i just want some advice from people who are more familiar with college than i am if that’s alright. I don’t totally know where to begin, and sorry if this isn’t the right place and for my poor formatting since I’m on mobile. I figure I would talk about it here and see if I can’t get some advice from others. \n\nMy first career path was going to be a charter jet pilot and I was in flight school for a short time, but we started to do exercises that made me incredibly dizzy and nauseous and sick (it was specifically blinder flying, in which I wasn’t allowed to look out the windows during the flight and just had to fly based off the instruments- I could fly off the instruments, but I just needed to be able to look out the window to not get incredibly sick). So I decided to cut my losses and switch to my plan B which was to become a translator/interpreter since I’d already been taking German for ~7-8 years and learning Japanese for ~3 and it came pretty easily to me. \n\nI decided I wanted to go out of state to be away from my family, so I did and I’ve been working towards my dual major in German and Japanese and my minor in Russian. I’m paying, in total, ~27k per year for this school plus room and board, hoping that I can get a job as a translator/interpreter after university. \n\nI haven’t been able to take a class towards even my minor since semester one, (it’s now nearing the end of semester 3) it’s been purely all the prerequisite classes like history and math and political science and other humanities like behavioral science, I’m still studying languages on my own in my free time but it’s incredibly difficult to stay invested in school when it’s not even close to what I’m trying to study. I understand that some of these classes are required with any degree plan, and it’s not totally out of the blue or weird, especially since I came here with German credits from high school, but nothing for Japanese or Russian. I can’t imagine they expect me to be proficient in either of these within 4 years if I’m not taking any classes in them for the first 2 years. It seems like it’s just going to be extended to more than 4 years from what I could tell talking to my advisors, which sucks because this school is a bit on the higher end for me and I don’t want to drown in debt. Taking all these classes that feel unnecessary is absolutely killing my motivation, too. I came here to focus on advanced German grammar and kanji and everyone gets really mad at me when I don’t do well in math, even though everyone knows it’s not my strong suit. \n\nI want to go back to flight school, if planes make me feel sick then I want to fly helicopters, it’s cheaper than one year of college to get my commercial license and I’ll make more money immediately after getting it than I would as a translator. \n\nAm I overreacting to all the pre-req’s? Has anyone else had something similar? If I do drop out, what should I be aware of and take steps towards? If I stay, what should I do to make sure I can actually take the classes I want to major in alongside my prerequisites?\n\nThank you so much for your time.",
  "author": "Mewchiiii",
  "created": 1636656902,
  "updated": 1636745771,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk8jl0w": {
      "link": "/r/college/comments/qrs74w/i_think_i_should_drop_out_of_college_but_im_not/hk8jl0w/",
      "text": "I’m not familiar enough with aviation or pilot licenses to speak on that part but most people don’t like pre reqs. I was done with all of mine by spring of freshman year and was slowly transitioning to a major focus. It’s unfortunately just something you have to do. \n\nLanguage classes in college move extremely fast, at least in my experience. I had to take two semesters of german for my psych degree and by the end of the second semester we were all speaking, reading and writing papers fully in advanced german. (you’ll be able to test out or advance to upper levels, as you already have german experience) \n\nYou are also taking two completely different degrees with a minor so it should be expected that you’ll take around 5 years to graduate as the overlap between your majors in minimal. The only way for you for really graduate “on time” would be you having to take winter & summer classes, which is more money out of pocket. \n\nIf you want to be a pilot & fly helicopters then do that. Don’t feel like you need to stay in college, especially if you are settling for a degree when you would rather be doing something else. \n\nIf you choose to drop out make sure you are registered in a commercial licensing program soon after you leave your school. I’ve seen so many people drop out thinking they will go into a trade or related field but they started working and continuously push it off.",
      "author": "rynpickles",
      "created": 1636657743,
      "upvotes": 1,
      "replies": {
        "hk8l5lx": {
          "link": "/r/college/comments/qrs74w/i_think_i_should_drop_out_of_college_but_im_not/hk8l5lx/",
          "text": "They kept advertising it to me as I’d still graduate in 4 years, it’s weirdly reassuring to hear that it would more realistically be 5 years. Language classes can absolutely move fast, but I hate the feeling of impending dread that it’s going to feel crammed in the last year or two with all the prerequisites; especially since they kept adding more for me. For my first semester they said I’d only have to take one math class since I was transferring here with some math credits already, but then now they say I need to actually take 3 more, so it just keeps adding frustration, I can definitely relate to most students disliking them. If I drop out I’ll definitely be planning to enter my flight program soon after, like next month kind of soon, so it’s nice to know I’d be on the right track. Thank you so much for your answer, it’s very reassuring.",
          "author": "Mewchiiii",
          "created": 1636658382,
          "upvotes": 1,
          "replies": {
            "hk8m0jb": {
              "link": "/r/college/comments/qrs74w/i_think_i_should_drop_out_of_college_but_im_not/hk8m0jb/",
              "text": "Does your school offer a degree audit or anything? They list all the boxes you need to check off before graduation. I found it more helpful than going to my advisor as they often gave me wrong information too. \n\nEx: my advisor had me set up to take algebra to meet the universities math req but I found through my audit the stats class required for my major already meets that requirement. Taking the alg class recommended by my advisor would’ve set me back a semester.",
              "author": "rynpickles",
              "created": 1636658736,
              "upvotes": 1,
              "replies": {
                "hk8n1zi": {
                  "link": "/r/college/comments/qrs74w/i_think_i_should_drop_out_of_college_but_im_not/hk8n1zi/",
                  "text": "My school requires us to go through an advisor for everything, I think I got a degree audit at the start when I first started attending but I can’t remember it",
                  "author": "Mewchiiii",
                  "created": 1636659167,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hka4rwt": {
      "link": "/r/college/comments/qrs74w/i_think_i_should_drop_out_of_college_but_im_not/hka4rwt/",
      "text": "If you get hired with a college degree, the employer assumes you also have a lot of knowledge beyond your primary focus. If all they wanted was someone to translate, they wouldn't ask for a college degree.",
      "author": "zifmer",
      "created": 1636683020,
      "upvotes": 1,
      "replies": {}
    }
  }
}