{"sid": "dbbxxi", "link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/", "title:": "Got a 46/100 on my first exam that's related to my major..is it time to panic a little?", "text": "Title pretty much says it all. I got a 46/100 on a biology exam. I didn't study as much as I needed to and I definitely need to change that because I don't want to feel this way again, but what else can I do to pull the grade up before the end of the semester?\n\nEdit: this is blowing up WAY more than I thought it would, so thankyou. And just to be clear I didn't come here looking for any sort of sympathy, I was just curious as to what advice others could give who knows what it's like to be in this position. I know that the only person that can pull the grade up is me and that I'll have to work for it which I am more than capable and more than ready to do. Im a strong believer in failure being the greatest teacher. Failing is just another opportunity to learn from an experience to ensure that it doesn't happen again and I fully intend on applying that to my current situation. Thankyou to everyone that's seen this post and has commented.", "author": "huntv16", "created": 1569851872, "retrieved": 1632802457, "over_18": false, "upvotes": 879, "upvote_ratio": 0.99, "comments": {"f58pyho": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f58pyho/", "text": "I'm gonna go against the grain and say - yes, you should be panicking. But in a controlled manner that lets you grow from here. From a scale of \"this is fine\" to \"I am calling the police\" you should be at \"who are you and how did you get into my house?\" \n\nWeird panic scales aside, you should be *concerned*. Biology is not an easy course and is often the weed out course. Failing the first exam means you don't have a comprehensive understanding of the basics, which impacts your ability to learn the next concepts which are built upon the basics. You have to invest a lot of time not only studying for the next exam but catching up and understanding what you didn't learn for the first exam. \n\nMy advice is to actualize change. Not thinking about change but making real changes. Something as small as \"I will study in a different room\" may lead to great change. As for tried and true study habits, you want to engage in as much active learning as you can. Don't read and reread. Read and rewrite in your own words from your memory. Don't read definitions in the textbook, write them out on flashcards/Quizlet and study them. Don't read through the practice questions, try preparing for and then taking them as if they were an exam.", "author": "gazeintotheiris", "created": 1572061366, "upvotes": 2}, "f3gklo2": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f3gklo2/", "text": "I made a 50 on my first test and a 91 on my second. I wouldn't worry.", "author": null, "created": 1570912431, "upvotes": 1}, "f320m7i": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f320m7i/", "text": "I'm a bio major. Biology is hard. It takes a lot of studying. I didn't do well on my first one either. Just relax and study more efficiently and harder.", "author": "MeGotShadowbanned", "created": 1570589872, "upvotes": 1}, "f241lfh": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f241lfh/", "text": "There's bottleneck classes for most majors. They're the tough classes that weed people out. Failing doesn't mean give up, it doesn't mean that you're not smart enough. It means \"do you want this major enough to do what it takes\". Which means you might have to study more or even in the worst case take the class again. \n\n&#x200B;\n\nBut it's still early. Study more and if you really want to major in that, take the class again.", "author": "Zebee47", "created": 1569942831, "upvotes": 1}, "f23b0e6": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f23b0e6/", "text": "Nope! I got 49 out of 100 on my first biology test. I think I had the second to worst score. It took a while to find my groove and study strategies that worked for me, but I stuck with it and graduated Cum Laude last May in biology!", "author": "kittenfloof", "created": 1569914283, "upvotes": 2}, "f238a9z": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f238a9z/", "text": "There is relative grading in my college. If I get it, its a pretty decent score for me", "author": "KUSHtoGADBADhai", "created": 1569910342, "upvotes": 2}, "f237nui": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f237nui/", "text": "Pro tip: along with studying smarter, harder, and better, go to office hours every single week and ask lots of questions. Often times, the professor will give clues or ideas as to what will be/won't be on the test.", "author": "Starfire_Fox", "created": 1569909513, "upvotes": 2}, "f234thq": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f234thq/", "text": "Start studying for exams 2 weeks (14 days) before you take them.\n\nSounds like overkill? Good. Overkill is better than a 46%.", "author": "hatewrecked2", "created": 1569906119, "upvotes": 2}, "f2323lw": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f2323lw/", "text": "[deleted]", "author": null, "created": 1569903421, "upvotes": 1}, "f231jxm": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f231jxm/", "text": "Learn from your mistakes. I failed my first test in one of elective classes and I thought it was the end of the world. I studied so hard for the next test that I passed with an A. One test is not going to make or break your grade, just ask the professor what you can do to better yourself next time and goto office hours, it will show the prof. that you are serious about their class and it could possibly help you if you need a few extra points to pass the class if it ever comes to that.", "author": "shrimpynut", "created": 1569902920, "upvotes": 1}, "f22ziz8": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22ziz8/", "text": "I would absolutely suggest going to see your professor and asking their advice for studying and doing better on their tests. Tell them that you studied. They like to see that students are trying to do better!", "author": "coadnamedalex", "created": 1569901145, "upvotes": 1}, "f22xfah": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22xfah/", "text": "I mean that’s really close to a pass and p’s get degrees so just try a bit harder", "author": "aspie_giraffe", "created": 1569899448, "upvotes": 1}, "f22wc7k": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22wc7k/", "text": "Don't worry too much but take this exam 1 has a learning curve to put more effort in for the next exam. Also, don't get behind....", "author": "FickleCar", "created": 1569898663, "upvotes": 1}, "f22msb7": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22msb7/", "text": "Take this first test as an example for you to hunker down and try harder. You'll get it, have faith. One shot in the dark compared to the bright future you're already looking at isn't a thing.", "author": "maniacassassin", "created": 1569892166, "upvotes": 2}, "f22ljq8": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22ljq8/", "text": "From here on out, try and overcompensate on your first exam. Read everything the professor provides and go to any group study sessions. It’s way easier to reel it back in after over-studying and getting an A than it is to be unprepared and battle back from a low grade.", "author": "Fugazi_Bear", "created": 1569891537, "upvotes": 2}, "f22i24d": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22i24d/", "text": "If it’s your first exam then don’t panic yet just set yourself up better for the second exam. If it’s a biology class then reading the textbook is the best way to learn the concepts and material. Make sure you know the concepts forwards and backwards.", "author": "dinoegg2", "created": 1569889475, "upvotes": 2}, "f22evth": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22evth/", "text": "Hey man just saying when I took my first bio exam in 2017, I failed the crap out of it. I got a 48/100 but that didn’t discourage me, instead it. Motivated me. I study a crap ton hours and managed to improve my score and ended off with a B+.", "author": "platinum_eon", "created": 1569887662, "upvotes": 2}, "f22cjrj": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22cjrj/", "text": "I failed my first test then received pretty much all 90%s on all 5 tests afterwards for one class. This was a non major course though but still applies to anything.", "author": "HaxusPrime", "created": 1569886380, "upvotes": 2}, "f22bbt3": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22bbt3/", "text": "Nah man. So was my first exam on chem. Graduated best of the faculty. Had to reach bottom first to get my shit together and work hard and smart. \n\nFirst exam got 48/100. You still have hope if you really like it.", "author": "notlostinchina", "created": 1569885805, "upvotes": 2}, "f22adp7": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f22adp7/", "text": "Frodo: I wish the Ring had never come to me. I wish none of this had happened.\n\nGandalf: So do all who live to see such times, but that is not for them to decide. All we have to decide is what to do with the time that is given to us.", "author": "voyager14", "created": 1569885242, "upvotes": 2}, "f2279c5": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f2279c5/", "text": "My class average on the first test for Bio Majors was a 48, my best friend and I were some of the only ones who passed and we barely studied shit. Its an entirely different subject than what you've experienced before, and I'm sorry to say any 'culture shock' you felt here doesn't really let up as you progress. That being said, you definitely get used to it. These are the fundamentels you need to become things like doctors and advanced biologists, the more you're exposed to the easier it is to take it in. Make sure you're looking at the material your teacher gives out, whether its HW questions, in the end of your chapter/powerpoints, or through online assignments. Being exposed to the terminology and rules are the best ways to learn it for a written format like a test. \n\nDon't obsess the night before a test, you really need to be looking at this stuff maybe 10-20 mins a night after you learn it and to help review. That's how the brain cements info, not by rushing through a month of material you haven't looked at in weeks and are trying to relearn the night before. \n\nFind things to ask the professor about, if you're curious about more detail ask for it. I would come to office hours all the time and ask about specific scenarios I knew about, or to critique questions I felt weren't phrased well. This lets you get close to the teacher in your major, and helps reinforce specifics for you to call back on during assessments. When my teacher talked about parthenogenisis I asked about a crayfish species that does it, or if we talked about the immune system I would ask how it was different between things like reptiles and birds. I don't know where your interests are, but I assume you're a Bio major for a reason, so find the things that let you internalize the material and keep it relevant for you.", "author": "Meperson111", "created": 1569883340, "upvotes": 2}, "f226o23": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f226o23/", "text": "I got a 34% on my first exam for calculus this year. I understand how you feel.", "author": "froggie-style-meme", "created": 1569883008, "upvotes": 2}, "f226cmu": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f226cmu/", "text": "That’s college! You’ll be fine.", "author": "pastelxbones", "created": 1569882795, "upvotes": 2}, "f224rv4": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f224rv4/", "text": "Lol welcome to the club my friend. There’s many more of those to come and some even worse", "author": "WhitE-TightE", "created": 1569881933, "upvotes": 2}, "f224b2o": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f224b2o/", "text": "You gotta study man. Uni isn’t like school where you just breeze through you gotta not only know the notes you took but make sure you understand the material to apply solutions to different problems", "author": "Kungpowchikn95", "created": 1569881611, "upvotes": 2}, "f21xmja": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21xmja/", "text": "Yeah you’re right, I put 46 instead of 64 when I calculated", "author": "Patrick_Schlies", "created": 1569878134, "upvotes": 2}, "f21ueqy": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21ueqy/", "text": "Haha, I have failed so many of my first exams it's not even funny. Don't worry, keep going to class, change up how you are studying and GO TO OFFICE HOURS. Get a tutor if necessary or possible. You got this", "author": "hi-skinny-legend", "created": 1569876915, "upvotes": 2}, "f21stcu": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21stcu/", "text": "Unless it’s weighted heavily enough that you can’t recover", "author": "xbigwhale", "created": 1569876332, "upvotes": 2}, "f21mhly": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21mhly/", "text": "I got a 26 out of 92 on a calc exam my first semester.  Relax bro. 😂", "author": "_34_", "created": 1569873970, "upvotes": 2}, "f21ld7i": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21ld7i/", "text": "If you’re a freshman, this is expected.  Its not highschool anymore, and now you know that first hand!\n\nGood luck though", "author": "MTGplayer1254", "created": 1569873590, "upvotes": 2}, "f21jl0p": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21jl0p/", "text": "That's completely typical. You'll do better on the next one because you'll know what to expect.", "author": "MythicalWhistle", "created": 1569872987, "upvotes": 2}, "f21ht8g": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21ht8g/", "text": "Don’t worry, it’s your first exam. I got a 69 on my first math exam. I figured I was doomed for the whole semester and was going to fail the class. A few weeks in since that and I now know what an exam will look like from that teacher. Took my second one and got an 85. You’ll be fine, just study harder. Only thing to worry about is if there’s only four exams for example. Then you have to make sure you do better on the next ones. Try using Quizlet if you have to study terms. That’s really worked for me in other classes besides math. It also helps to ask the teacher for study tips and if there’s extra credit opportunities. You’d be surprised how many teachers offer extra credit. Plus the final exam may outweigh a bad test score. My math teacher has a policy where if you did poor on an exam but do better on the final exam, the poor grade will be left out. Definitely worth asking about this.", "author": "bookishreview", "created": 1569872394, "upvotes": 2}, "f21hh83": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21hh83/", "text": "It's fine. In your major, there lots of different topics covered. May not have been your best topic. Just study more.", "author": "__chooseausername_", "created": 1569872281, "upvotes": 2}, "f21g72s": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21g72s/", "text": "Depends, on what’s the mean and median? Is the course curved? Are you a freshman? Are you premed/aiming for grad school? \n\nI got 32 on an exam in higher level stats (my major), but honestly, if you can believe it or not, that 32 probably felt better than getting a 95 in some liberal arts course I took to fill requirements.", "author": "CornHellUniversity", "created": 1569871857, "upvotes": 2}, "f21fvsu": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21fvsu/", "text": "Think about why you didn't study. were you just being lazy or was it because you simply don't care enough for the subject to motivate yourself to do so? I'm only asking this because it's important that you care about what you study or this will keep happening. Make sure you're invested before it becomes too hard to change your major.\n\n\nI think that this happens a lot with new college students where they didn't study at all in high school but realize that college is very different. it requires a lot more personal responsibility and motivation; the professors are there to help but they won't hold your hand like high school teachers do.", "author": "Bluecheeseur", "created": 1569871756, "upvotes": 3}, "f21dtmh": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21dtmh/", "text": "Nah.\n\nIn fact it’s better to bomb the first one cuz it doesn’t matter much.", "author": "ikilledtupac", "created": 1569871039, "upvotes": 3}, "f21bd0e": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21bd0e/", "text": "Congrats on setting the curve", "author": "wnsj15", "created": 1569870186, "upvotes": 5}, "f21afgu": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f21afgu/", "text": "Like all of the guys by me just got 50-60 and most of them are gonna be fine. But make sure you work your but off to get it back up!\n\nEdit: for their science test", "author": "Crossfire_X", "created": 1569869867, "upvotes": 2}, "f218hgi": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f218hgi/", "text": "I'm sure you're tired of replies at this point, but was this your first exam in Bio 1?  IIRC, the first 1/4 or 1/3 of Bio 1 was all stuff that required knowledge learned in Chem 1.  Have you had Chem 1?", "author": "Inactive_Account", "created": 1569869199, "upvotes": 3}, "f218h7r": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f218h7r/", "text": "I got a 46 on the first exam I ever took in college. I ended the class with an A. \n\nAfter that first failure I buckled down and started overstudying. I Did above the average on the second exam, I got the highest score in the class on the third exam, I was couple points off the highest score on the fourth exam, and I did well on the final.", "author": "Nyy0", "created": 1569869197, "upvotes": 2}, "f218ax8": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f218ax8/", "text": "Well i dont't really know how theese things are in the us, but where i live we had drastically different prior knowledge (there were huge differences between schiols in different cities) and I really sucked at my first few exams nearly failing, but as time went on I easily passed every test with pretty good grades. This first exam just shows that you probably have to work a bit harder, put in some extra time and you will be fine.", "author": "ferdzsoe", "created": 1569869138, "upvotes": 2}, "f217bl4": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f217bl4/", "text": "I got a D in a class that was major specific, granted the teacher was a bitch, but the concept was still foreign to me. The following year I got the job at my dream company doing what I would have learned in that class and understood it once I actually see it", "author": "comicrun96", "created": 1569868804, "upvotes": 3}, "f214qv2": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f214qv2/", "text": "I straight up dropped out of my first major related course because I was failing. \n\nRetook it the next semester, got an A.\n\nYou're fine.", "author": "Zerobeastly", "created": 1569867891, "upvotes": 2}, "f210rao": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f210rao/", "text": "Yeah it is. 46 is bad unless the class is curved a lot or everyone else did worse than you.", "author": "BuildingRealism", "created": 1569866412, "upvotes": 2}, "f210h9q": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f210h9q/", "text": "Don't panic ever. It takes time to get used to courses, professors, programs and new schools. You'll get the hang of it. If you start failing lots of things then you should panic.", "author": "Aded_367", "created": 1569866308, "upvotes": 3}, "f20zzed": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20zzed/", "text": "You can definitely bring the grade up. Now you know what type of questions your professor asks on his tests, so you know what to look for while studying. Personally, I did great in a chemistry class and got a low C on the final (which was worth a lot more than the regular tests). Still ended with an A in the class. You just gotta make sure you keep up with the rest of the school work in order to bring the grade up.", "author": "Skiesofamethyst", "created": 1569866126, "upvotes": 2}, "f20yg8r": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20yg8r/", "text": "I remember not doing well when I first started my college courses. It can be a rough adjustments especially since some classes demand more studying than others. Considering you're already concerned and know you need to changes... that's a pretty good sign if you ask me. \n\nAlso: Make sure to study the material you DON'T know. Don't reread and revise past notes because you probably know if after a while. Make sure whenever you're studying you're retaining new information. I fall into that habit a lot and it tends to bite my in the a\\*\\*. Good luck!", "author": "kylerez1228", "created": 1569865594, "upvotes": 2}, "f20sa2l": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20sa2l/", "text": "The only D I got in college (haha) was in freshman year first semester bio. I didn’t care much for it and didn’t study a ton, then bombed the final after studying really hard. Moral of the story, pay attention in class because no amount of cramming will outweigh consistent effort. I ended up on deans list every semester after that. First semester of college will smack you right in the mouth, just learn from it", "author": "TemperatureBoiling69", "created": 1569863427, "upvotes": 2}, "f20s50y": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20s50y/", "text": "I got a 22. I'm definitely panicking.", "author": null, "created": 1569863375, "upvotes": 2}, "f20s31e": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20s31e/", "text": "Literally on the same boat. I got a 70/100 on my first accounting exam. That’s no where near as bad as yours but I personally felt like I should have done worse since I also didn’t study as much, it was mostly multiple choice so that helped I guess. But I also do poor on the first exam. Anyways. We got this!", "author": "VS_Sanji", "created": 1569863354, "upvotes": 2}, "f20s042": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20s042/", "text": "do not panic. I was failing a class related to my major, my advisor told me to drop the course and pick it up next year/semester. now i have an A in that class and am still on course to pass 👍🏻sometimes all it takes is a mental break", "author": "dcoke99", "created": 1569863323, "upvotes": 3}, "f20rxjz": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20rxjz/", "text": "Dont sweat it, just work on it", "author": "RebeCawCaw", "created": 1569863297, "upvotes": 1}, "f20rt6d": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20rt6d/", "text": "Nah. It’s your first exam. Use it as a tool to understand what you can improve at. We’re not all exam takers and not all exams are created equally. Not all professors and their TAs grade papers equally. You need to find out how they do so and make sure your answers match what the professor wants. So don’t freak out for the first exam. Learn what you need to do.", "author": "FBI_Open_Up_Now", "created": 1569863252, "upvotes": 2}, "f20p9cl": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20p9cl/", "text": "Lol I graduated with an engineering degree and my very first chemistry exam I made a 62. Nah, don’t even trip dawg", "author": "Darklink834", "created": 1569862357, "upvotes": 1}, "f20p8we": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20p8we/", "text": "I got a 60/100 on my first exam related to my major and felt like shit, turns out the highest grade was like a 70 so I felt better. A lot of people dropped the class after that test though", "author": "knipdaddy", "created": 1569862352, "upvotes": 3}, "f20oyzv": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20oyzv/", "text": "This is literally how I felt last week 🤦🏽‍♀️ with my biology exam", "author": "Teetee4", "created": 1569862255, "upvotes": 1}, "f20n2q7": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20n2q7/", "text": "I honestly just went through the same thing, got a D on an exam for a class related to my major. All I did was went to the professor to talk about the grade. He ended up giving me some points back with a possibility of having the test curved. \n \nHe also gave me tips on how to improve \n\nSo just go in and talk to them. You never know what could happen.", "author": "malgal46", "created": 1569861607, "upvotes": 2}, "f20mi2j": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20mi2j/", "text": "Nah dude. Just relax and do better on the next one. Sometimes you gotta do bad before you can do well.", "author": "likly64", "created": 1569861409, "upvotes": 1}, "f20m1ps": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20m1ps/", "text": "I am in a biology related major and the first exam came back with a 60% average, I got a 56% on it. Don’t panic. The first test is a shock to everyone. Hopefully you’re thinking of new ways to study/take in information etc!", "author": "sum1inphx", "created": 1569861253, "upvotes": 2}, "f20hclx": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20hclx/", "text": "It depends on how the rest of the class did.", "author": "AcademicDifficulty", "created": 1569859722, "upvotes": 1}, "f20g46e": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20g46e/", "text": "you will be laughing about this at the end of the semester.", "author": "Madarimol", "created": 1569859274, "upvotes": 25}, "f20fuh9": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20fuh9/", "text": "Without failing you wouldn’t know how to try harder. Failing gives you something to work up from and improve on. You needed this lesson to learn how much you need to study to do well in your desired field.", "author": "oldGilGuderson", "created": 1569859175, "upvotes": 2}, "f20fh7v": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20fh7v/", "text": "Depends on how many points are in the class overall. Im right there with you my friend.", "author": "PastaVeggies", "created": 1569859047, "upvotes": 2}, "f20ervd": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20ervd/", "text": "if you don't find the material interesting enough to do well, consider where you'll be in a year or 2.  You'll be in much harder, less interesting classes and may realize that biology isn't for you.  Think long term.  I don't mean to be a pessimist but that's reality.", "author": null, "created": 1569858814, "upvotes": 11}, "f20dhwm": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20dhwm/", "text": "Study more, try to get connected with tutors, etc. If you're really passionate about biology, you can get better!", "author": "Quarexis", "created": 1569858384, "upvotes": 4}, "f20dfbt": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20dfbt/", "text": "You said it yourself study more", "author": "papichuloswag", "created": 1569858360, "upvotes": 3}, "f20cl7b": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20cl7b/", "text": "Nah, that's just room for improvement", "author": "arlomilano", "created": 1569858071, "upvotes": 1}, "f20bvp3": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20bvp3/", "text": "Im assuming you are a freshmen?\n\nSounds like you got 46/100, but theres a total of 500 points in the class?", "author": "CryptoHammer1982", "created": 1569857822, "upvotes": 1}, "f20brwu": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20brwu/", "text": "What kind of question is this?\n\nIs it time to panic? Yeah dude. 46 assuming no curve on a major part of your grade is not okay. \n\nWhat else can you do to pull up the grade?\n\nGet better grades. \n\nI feel like you’re hear to have someone give you a hug and tell you it’s gonna be okay. It’s not, unless you make it happen. No amount of reddit smoke up your ass is gonna change that grade. It’s in you and only you", "author": "Burt__Macklin__FBI2", "created": 1569857786, "upvotes": 7}, "f20bm2k": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20bm2k/", "text": "First off, you already realize you didn't study enough. It's good that you can admit to your errors, but now you've got to look at this experience and be able to take something away from it. \n\nFirst test/exam is the warm-up. Now you've got a sense of how the exams are put together by your professor. You got a feel for how they test, so use that going forward. \n\nNow, put more time into this class. Get on quizlet and find some study aids, find an interesting YouTuber that covers the material, and/or get someone to tutor you.", "author": "TheRealSuperNoodle", "created": 1569857732, "upvotes": 2}, "f20bcn8": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20bcn8/", "text": "I am in my 4th year of college and I just got a 46% on an exam. Its fiiiiine. Just go ham on homework amd studying for the next one. You figured out this is harder tha  you thought, so adjust.", "author": "poopoojerryterry", "created": 1569857644, "upvotes": 2}, "f20angk": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20angk/", "text": "What was the class average? It's not uncommon for professors to make their exams overly tough and then just curve the class up to passing grades at the end of the semester. If the average grade was also a failure, you're probably fine.", "author": "Karakov", "created": 1569857384, "upvotes": 16}, "f209zbh": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209zbh/", "text": "Omg I got the same score on my calc exam. Twinsss!!\nI didn't try thou. Just do all of your work you should be fine and pass the next 3 exams. See if there's extra credit available", "author": "sometimesmale", "created": 1569857142, "upvotes": 2}, "f209w3p": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209w3p/", "text": "You take your exam. You study the shit out of it. And I mean, you redo it. You look at every questions carefully, and you absolutely go see the prof for anything you thought you understood but got wrong, and things you don't understand. \n\nI don't know how you prepared for the exam, but with a sub 50/100 on the first exam it's a wake-up call that tells you to not skip any practice, no matter how optional they may be. You take notes, you do the practice, you do additional homeworks and you go above and beyond to get the material in. \n\nIf it's relevant to your major, chances are the material will come back in other courses. It needs to sink in. \n\nYou can bring your score up, it's not a death sentence, but you need to work.", "author": "Murderous_squirrel", "created": 1569857108, "upvotes": 9}, "f209okq": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209okq/", "text": "No, what is panicking going to accomplish? Are you going to switch majors because of one exam? The only option is to do better. Get off Reddit and get your shit together.", "author": "footballfutbolsoccer", "created": 1569857029, "upvotes": -2}, "f209mwd": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209mwd/", "text": "What was the class average?", "author": "pankake_man", "created": 1569857012, "upvotes": 4}, "f209l4y": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209l4y/", "text": "Ask for a retake", "author": "PersistantBlade", "created": 1569856995, "upvotes": -4}, "f209jpr": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209jpr/", "text": "What are your current study habits? I am a former bio grad so maybe I can help...", "author": "Jaagsiekte", "created": 1569856981, "upvotes": 5}, "f209ia3": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209ia3/", "text": "I got a 64 on my second biology exam (biology major). I called my dad afterwards crying because I thought I didn't have a chance, especially if I was already failing that early in college. \n\nIt takes time. Change your study habbits, manage your time better and even get an accountability buddy.", "author": "rukwitme", "created": 1569856968, "upvotes": 24}, "f209aod": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f209aod/", "text": "I failed a final in my first semester. After that I got my ass in gear and have gotten 4’s since. I think failure at the beginning is a must and a good thing. \n\nAlso does your university do supplemental exams? Bc u should maybe look into that", "author": "Talnix", "created": 1569856887, "upvotes": 3}, "f208ygk": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f208ygk/", "text": "I'm assuming you're a freshman? The way we are educated in public and private primary and secondary schools is horrible. Research tells us that we're basically told we're smart the moment we defy expectations and that label ends up trapping us in this circle of fuckdom where we attempt to retain the smart label by taking the easier or familiar until when we are confronted with failure again we get this dawning sense inadequacy brought on by our unfamiliarity with struggle. So in short, not it's not time to panic. Take this is an opportunity to struggle and grow. Mistakes are how we actually learn. Study harder next time. Reach out and use the resources available to you. And push yourself past how you're comfortable learning.\nEdit: Also, in my personal experience my colleges professors are uninvested in the teaching process or extremely blinded by poor advice from biased peers which leads to their instruction being about 25% of learning you actually need to succeed on exams and homework. I highly recommend reading through whatever text you have and while attending instruction, not relying on it as your only learning resource. For most professors, especially in lower division classes, teaching is their side gig they're asked to do by the university as part of their contract. In the future use RateMyProffessor before picking courses.", "author": "GueroSuave", "created": 1569856763, "upvotes": -2}, "f208ec7": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f208ec7/", "text": "You'll be fine. Everything will be okay.", "author": "_Jubilating", "created": 1569856563, "upvotes": 14}, "f207olo": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f207olo/", "text": "What percentage of this exam is toward the final grade?\n\nI saw you said that these are 100 points each except for the final.   But, points and percentages toward a final grade are different things.", "author": "Entertainmentguru", "created": 1569856300, "upvotes": 2}, "f202a0v": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f202a0v/", "text": "[deleted]", "author": null, "created": 1569854183, "upvotes": 82}, "f2023hy": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f2023hy/", "text": "[deleted]", "author": null, "created": 1569854093, "upvotes": 795}, "f20170e": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f20170e/", "text": "You could meet with your professor or the class GA during office hours to go over what you missed, but studying more and better will do the most to pull up your grade.", "author": "veanell", "created": 1569853671, "upvotes": 33}, "f1zzkoc": {"link": "/r/college/comments/dbbxxi/got_a_46100_on_my_first_exam_thats_related_to_my/f1zzkoc/", "text": "[deleted]", "author": null, "created": 1569852890, "upvotes": 152}}}