{
  "sid": "q6k0yi",
  "link": "/r/college/comments/q6k0yi/thinking_about_going_to_college_11_years_after/",
  "title:": "Thinking about going to college 11 years after dropping out of high school. Anyone have an experience or input they would like to share?",
  "text": "So I dropped out of highschool at 16 and got my GED. School just wasn’t working for me. I took online classes to receive a veterinarian technician certification 4 years ago which was one of the hardest challenges in my life. Other than that I have no real experience in schools, tests, note taking. I really just want to get my basics to help me with my math and grammar as-well as having it on my resume for future jobs. I keep feeling like I’ll just give up once I get stressed or get addicted to adhd meds again just to get through things. I’m really stuck and making this decision to go to college has been eating at me for years. I am located on the US.",
  "author": "Dude_on_earth",
  "created": 1634038036,
  "updated": 1634082574,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hgctqvm": {
      "link": "/r/college/comments/q6k0yi/thinking_about_going_to_college_11_years_after/hgctqvm/",
      "text": "If you’re not in a rush to get a degree, why not go to your local community college and enrolling in some classes part time? Get a lay of the land and see if it is something you feel you can handle. \n\nYou can always transfer after getting your Associates and it will save you more money in the end.",
      "author": "kizeltine",
      "created": 1634047857,
      "upvotes": 8,
      "replies": {}
    },
    "hge2odd": {
      "link": "/r/college/comments/q6k0yi/thinking_about_going_to_college_11_years_after/hge2odd/",
      "text": "Well, I'm 32 fuckin' years old. \n\nDo it. There's no better time than now. \n\nWhat gets me through is my experience in the last 10 years of being out of school. My work ethic is better than 90% of my peers. My purpose of being in college is to learn, not just to complete assignments. \n\nAt my age, I know how much money each class costs and how much that really equates to in the real world. I think young adults have problems seeing that failing an 1800 dollar course just isn't a great option. \n\nPlus, being an adult helps to really break down the barriers that could have stopped you seeking help before. I have absolutely no problem talking to anybody on campus. I can talk with any of my professors without feeling like they are above me or looking down on me. We are both adults, I'm paying them for a service. \n\nI can say that it's still difficult but I find myself stressing about getting a B instead of passing. Before I was skating by on the bare minimum. It just doesn't work. If you put in hard work, it will pay off.",
      "author": "Awkward_Mail_2786",
      "created": 1634066477,
      "upvotes": 2,
      "replies": {}
    },
    "hge3yy4": {
      "link": "/r/college/comments/q6k0yi/thinking_about_going_to_college_11_years_after/hge3yy4/",
      "text": "Many schools have faculty and offices that will help non traditional students on their way. Find one at the school you want to go to and reach out.",
      "author": "orangesNH",
      "created": 1634066993,
      "upvotes": 1,
      "replies": {}
    }
  }
}