{
  "sid": "qiml3l",
  "link": "/r/college/comments/qiml3l/its_family_weekend_and_im_sad/",
  "title:": "It’s family weekend and I’m sad",
  "text": "Title. Everyone’s parents are here and they all look so happy. Being around my parents gives me so much anxiety due to their toxic relationship and how fake I have to be around them, and my mom thinks everything’s fine and asked to come, but I just made up some excuse so they wouldn’t because I can’t be around them. But it still makes me feel really sad that so many people have loving families they actually WANT to see.",
  "author": "idwbas",
  "created": 1635542131,
  "updated": 1635779793,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 1.0,
  "comments": {
    "hil5mhj": {
      "link": "/r/college/comments/qiml3l/its_family_weekend_and_im_sad/hil5mhj/",
      "text": "I feel you. My family is toxic and I have deep resentment towards them because of that. I hope everything turns out well for you. Shitty families are the worst!",
      "author": "Competitive-Ninja449",
      "created": 1635555722,
      "upvotes": 5,
      "replies": {}
    },
    "hilicyi": {
      "link": "/r/college/comments/qiml3l/its_family_weekend_and_im_sad/hilicyi/",
      "text": "While there are plenty of happy families you have to realize they all have their issues and problems. People around you may look happy but a lot of them are faking it just like you. Don't compare yourself or your family to others, because you will just never know the real story with other people, like you know the real story with yourself. \n\nComparison is the thief of joy. It's okay to have family problems and not have the picture perfect relationship with your parents. It's okay to feel bad about that. But its not necessary to feel bad and suffer because your life is different or inferior to the lives of those around you. \n\nFocus on what you can do to improve your life. Try to do what you can with your family, even if that means staying away and taking them in small doses. Make a family of your own. A lot of your sadness is self-made. You're happier than you think.",
      "author": "-Theliquor",
      "created": 1635562043,
      "upvotes": 1,
      "replies": {}
    }
  }
}