{"sid": "kyv505", "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/", "title:": "My microbiology professor asked if it was okay to not wear a mask and I was too scared to speak up after my whole class immediately agreed and said it was okay.", "text": "So I'm not really sure what to do in this situation and would like some perspective.  \n  \nOn my first day of class this past week I had my Microbiology professor say some things I consider to be really unprofessional.  \n  \nFirst, as he begins his introduction he pauses to ask me and another student (we are seated in the front row) if it was okay if he didn't have his mask on while he was in the front of the class (which is JUST barely 6 feet away). He said he already cleared it with the Administration and as long as we were okay with it they would allow it.  \n  \nThen he goes into a spiel about how masks are pointless because they don't work; virus' are too small to be blocked by masks. When I questioned him on why would they mandate it if it didn't work he went into it about how Fauci is an idiot who was out of touch with reality and hasn't worked as a clinician since his residency many years ago.  \n  \nHe also mentioned he got COVID-19 last January though I find that odd because I don't even think they were testing for COVID-19 at that point last year in the US.  \n  \nHe then ends it with saying the only way to get over this mess that is COVID is herd immunity.  \n  \nOf course it's my fault for not speaking up right away, I just found it hard to when the whole class agreed immediately. I have a bit of social anxiety. But I do find all the things he said to be unprofessional. I know professors are human and can have opinions but I'm really put off by him asking if we would be ok with him taking his mask off.  \n  \nI'm looking for any advice on what to do in this situation or if anyone has been in a similar predicament. I'm weary of approaching I guess cause of my grades since he has control of them. Not sayin he would do anything but bias' are a real thing.  \n  \nEDIT: I'm in FL", "author": "lazyspectator", "created": 1610843153, "retrieved": 1632947325, "over_18": false, "upvotes": 1101, "upvote_ratio": 0.9, "comments": {"gjjrx5u": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjrx5u/", "text": "Locked. Advice has been given.", "author": "Laurasaur28", "created": 1610861807, "upvotes": 1}, "gjjr0cx": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjr0cx/", "text": "My college has a mask mandate and distancing rule, but my environmental science professor told us a few times that we were too young to get sick from covid.", "author": "Adhdicted2dopamine", "created": 1610861201, "upvotes": 5}, "gjjpy4h": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjpy4h/", "text": "Honestly? I'd drop the class and report him. No way I'd be taking a biology class, out of all things, from someone who doesn't understand masks", "author": "al_the_time", "created": 1610860501, "upvotes": 4}, "gjjp3bh": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjp3bh/", "text": "I would just transfer to a different section with a different professor if possible. This guy sounds like a jerk and I wouldn’t want to be in his class if  I could help it.", "author": "QueenOfEndor21", "created": 1610859938, "upvotes": 1}, "gjjo87b": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjo87b/", "text": "Your professor sounds like a moron. I thought my school was being dumb about COVID but I’ve never seen a prof or administrator go without a mask. That’s also so fucked up that he teaches microbiology you do NOT need to be learning that from him. Reminds me of my roommate who’s currently COVID positive and is still going out as normal infecting the rest of the town, and she’s going to med school next year. Summary is I hate how stupid people are and if I had your professor I probably would have started throwing hands.", "author": "smeseal99", "created": 1610859375, "upvotes": 3}, "gjjo47a": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjo47a/", "text": "\"you miss 100% of the shots you don't take.\"", "author": "TheMcWhopper", "created": 1610859303, "upvotes": 2}, "gjjnn2b": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjnn2b/", "text": "Wow. \n\nReach out to your advisor or administration and talk to them about it. In your discussion, outline the following:\n\n- Explain that the nature in which the question was discussed (with great bias) did not allow for time to think about it nor did it allow for anonymity in voting\n\n- If your state requires masks then it doesn’t matter if everyone says yes or not - it’s still going against the mandate. \n\n- lastly, and perhaps most likely to get them to move on this, mention that the professor’s views on this contradict the CDC and WHO recommendations, and given that any student in the classroom could potentially contract the virus and have a potential for long term damage (emerging data supports this, even for the college aged population), it’s a liability to the school if they are not enforcing precautions", "author": "thetorioreo", "created": 1610859000, "upvotes": 5}, "gjjm95z": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjm95z/", "text": "I see you are in Florida. Insane state that allows indoor teaching and no masks. The United States is doomed.\n\nIf you can, sit in the back away from the whackjob professor.", "author": "dan5234", "created": 1610858151, "upvotes": 3}, "gjjlzfm": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjlzfm/", "text": "According to my professor with a doctorate in immunology, herd immunity refers to vaccination (so the herd is immune because most people are immune), not letting vulnerable people die. I am extremely skeptical of this professor’s credentials not just because of his treatment of COVID but also the terms he is using. Please update us with what happens!", "author": "moonsands", "created": 1610857988, "upvotes": 3}, "gjjlmf6": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjlmf6/", "text": "Can you sit a couple rows back? I understand wanting to be attentive (I’m that kid too) but sounds like that’s a hazard with this guy.", "author": "skrrtlord667", "created": 1610857775, "upvotes": 1}, "gjjkye8": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjkye8/", "text": "Well, that's why he's a professor of microbiology. This guy should head the NIA.", "author": "foreveryoungemokid7", "created": 1610857384, "upvotes": 2}, "gjjky96": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjky96/", "text": "Ditch the class and Rate My Professor that asshole", "author": "cev4", "created": 1610857382, "upvotes": 5}, "gjjkv2t": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjkv2t/", "text": "Not in my class specifically, but an E&M professor in my department (physics) had kids writing an extra credit essay about why COVID is a hoax created by 5G, and how its mass government control and suppressing American freedoms. For those of you who aren't physics majors, while you cover E&M concepts in physics II, this is typically a junior level class.\n\nInevitably, when people complained, he said that this was a paper meant to have people look for ligament information and not just take everything they see on the news as literal. Information literacy is important, but this is a 300 level physics course. I can't think of any physics majors who are openly anti-maskers or conspiracy theorists, but professors don't need to feed into that. Also, it's disrespectful to call something a hoax when students have lost family members, had it themselves, etc. \n\nThis professor has been dinged before for being openly anti-vaxx, a staunch creationist against the big bang theory, and other weird stuff. I know that COVID isn't' exactly a physics topic, but for someone who has a PhD in physics, this professor is not super STEM-literate or aware of the world.", "author": "quantum_complexities", "created": 1610857332, "upvotes": 3}, "gjjk92a": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjk92a/", "text": "Only one of my professors wears a mask. The students all do, but I didn't think anything of it until these comments.", "author": "PhilosophicalElk", "created": 1610856995, "upvotes": 5}, "gjjjze4": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjze4/", "text": "And this is a microbio professor???? I had a microbio professor last semester and he spent the whole semester teaching us about viruses and bacteria and infections and stuff (obvi), all the while using the class material as justification for why mask wearing and social distancing is so important. What you went through is absolute bullshit.", "author": "keisaramus", "created": 1610856846, "upvotes": 7}, "gjjjz19": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjz19/", "text": "Florida i could see it", "author": "Odin16596", "created": 1610856840, "upvotes": 7}, "gjjjjwi": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjjwi/", "text": "Move to the back of the room and then report him.", "author": "rmthugger", "created": 1610856608, "upvotes": 2}, "gjjiie9": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjiie9/", "text": "My atmospheric science professor was a climate change denier. A Ph.D isn’t always a sign of intelligence", "author": "logan-8787", "created": 1610856029, "upvotes": 41}, "gjjg6ak": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjg6ak/", "text": "How is this guy a microbiology prof?", "author": "Oreo-808", "created": 1610854772, "upvotes": 15}, "gjjfqz7": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfqz7/", "text": "wear your mask and you’ll be fine", "author": "grubbycoolo", "created": 1610854549, "upvotes": -14}, "gjjfn9q": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfn9q/", "text": "Bunch of snowflakes. Withdraw. Obviously....the rest of the class is fine with it. Fuck it. Life is too short 🤣", "author": "tejedaj", "created": 1610854497, "upvotes": -20}, "gjjfm15": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfm15/", "text": "I fucking hate people like that, just wear the piece of cloth, I work in the ER and we wear our N-95’s 12 hours a freaking day, yeah we complain but we choose to wear it, it’s the only reason why I haven’t gotten covid yet. \nAnyways, I would email the higher ups and actually make sure that he was cleared because wtf? My university asks professors to double mask and wear a face shield if they have to break the 6 foot rule", "author": "imarabianaff", "created": 1610854479, "upvotes": 1}, "gjjcwx8": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjcwx8/", "text": "Can you sit towards the back of the class? That would at least protect you, if not the other students in the front. Does your teacher have a soft voice, cause I know their are a lot of quiet people who already struggle to project to the whole class and wearing the mask just makes it worse for them. Not saying he is in the right, but I sympathize.", "author": "meandgoliath", "created": 1610853077, "upvotes": 5}, "gjjcb5h": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjcb5h/", "text": "Drop the class and file a complaint. No reason to deal with that.", "author": "BenjaminTW1", "created": 1610852743, "upvotes": 3}, "gjjbo2y": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjbo2y/", "text": "I've worked in universities for almost two decades, closely with every group -- faculty, students, senior admins, lawyers, HR... I'm 90% sure your professor did not clear this with the administration or the administration agreed to something safer that he didn't actually do. \n\nHaving known professors with a \"this rule doesn't apply to me\" attitude, my gut says it's something akin to this: he was in a department meeting recently where the head was reviewing the school's safety mandates for in-person teaching; the head says \"now, this one part about when it's okay to remove a mask is ambiguous, so I'll follow up on that, so in the meantime obviously use your best judgement\"; and your prof is now describing that as \"cleared it with the administration\".\n\nSo don't bother contacting your professor. If you're comfortable DM'ing me your school name, I can walk you through the offices you should reach out to instead. (The unit names and responsibilities vary from school to school.)\n\nI should ask since it may help others: did your prof specifically say \"administration\"? As opposed to \"administators\" (or something else). \"Administration\" means the institution's senior offices, and it would make absolutely no sense if an individual professor went to them to clear permission for himself to not wear a mask. If he said \"administrators\", that means the people who do the day-to-day work of departments and absolutely would not be ones deciding on when it's okay to wear a mask. Lastly, if he had perhaps phrased it as, \"The administration cleared it for us to do this,\" there will be a stated policy somewhere. I'd that's what he said, I'm happy to help you find that policy.", "author": "dcgrey", "created": 1610852382, "upvotes": 165}, "gjjb3e7": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjb3e7/", "text": "it's less about the masks and more about how he's supposed to be a science teacher... and a microbio teacher at that and he believes all that crazy nonsense. If it were any other subject. I would still be annoyed but not worried since it doesn't really relate to the subject you're learning about. But... having a science teacher act this way towards COVID is worrying, to say the least. Also, I'm not sure about your school's covid rules but mine has a small fine for students not wearing masks. Go look at your school's covid rules if it has anything similar tell him and that if he acts up again, you'll report him. I would even talk to another science teacher you may know and express your concern. This isn't how he should be acting almost a year into a global health pandemic.", "author": "extrasmallbillie", "created": 1610852055, "upvotes": 30}, "gjjb1yl": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjb1yl/", "text": "My microbiology teacher was a creationist who excelled in her field of cancer research. You do not owe fealty to an instructor.  They are flawed humans as we all are.", "author": "Hedgehogz_Mom", "created": 1610852033, "upvotes": 7}, "gjjavdy": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjavdy/", "text": "Could just start coughing a lot.", "author": null, "created": 1610851930, "upvotes": 3}, "gjja5vd": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjja5vd/", "text": "You should email the dean to report him for not wearing a mask and risking his students lives. You would think as a science major he would know how dangerous covid is 😬", "author": "Worth_Disaster2813", "created": 1610851541, "upvotes": 3}, "gjj9q6l": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9q6l/", "text": "[removed]", "author": null, "created": 1610851298, "upvotes": -18}, "gjj9p2i": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9p2i/", "text": "masks do not prevent covid from spread it reduces the odds", "author": "deathworld123", "created": 1610851281, "upvotes": -12}, "gjj972d": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj972d/", "text": "Just saying NY and Cali have way more covid cases than FL and TX.. guess which one has the tighter restrictions?", "author": "spliffgang", "created": 1610851014, "upvotes": -14}, "gjj962b": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj962b/", "text": "I support the professor", "author": "sharpwaffle", "created": 1610851000, "upvotes": -21}, "gjj8ute": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj8ute/", "text": "He's a nutcase. Run. This will be a miserable semester for you if you stay in his class. Drop it. Delay it. Anything. The university's admin are morons too if they allow professors to unmask \"if they ask.\"", "author": null, "created": 1610850831, "upvotes": 3}, "gjj7z07": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj7z07/", "text": "Bruh", "author": "toolshed_abandoned", "created": 1610850352, "upvotes": 11}, "gjj7rqh": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj7rqh/", "text": "Isn’t your school offering remote instruction? I am not entirely sure how on earth can a lecture with loads of ppl gathered in one confined space not causing any problem. \n\nHere in Southern California (esp. in my  school), all classes are remote, and the campus is like a ghost town. I don’t consider it to be anything good, but these efforts are necessary and inevitable IMO.", "author": "Typical_Resource_340", "created": 1610850240, "upvotes": 8}, "gjj78cc": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj78cc/", "text": "I could understand if the professor was maybe literally any other subject but... Microbio? He should have his credentials taken away holy shit.", "author": "redemptionsoath", "created": 1610849957, "upvotes": 26}, "gjj6uig": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj6uig/", "text": "Email him anonymously telling him that you're uncomfortable with him not wearing a mask, but you were uncomfortable saying that in front of everyone.", "author": "temsik1587againtwo", "created": 1610849755, "upvotes": 4}, "gjj5ahp": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj5ahp/", "text": "Pretty sure he would have tried to humiliate you in front of the class if you called him out on it. Don’t be scared though, have the courage to follow through even with stuff like following the herd/mob mentality/everyone else saying it’s ok. I know it’s hard sometimes to speak up but you gotta do it sometimes. I recently had a similar run in with a Karen about a different ethical issue and I debated calling her out on it as I knew it would escalate. I called her out on it(she called cops but idgaf and lied and tried to overdramatize while making a scene). If necessary go annoymous and report but have the courage to call out people who violate your moral code, stand up for yourself even if no one else will", "author": "Lifedeather", "created": 1610848939, "upvotes": 28}, "gjj4xln": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4xln/", "text": "Talk to whoever is head of the department or just send him an email.", "author": "andredude2008", "created": 1610848748, "upvotes": 2}, "gjj4wj5": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4wj5/", "text": "If you feel uncomfortable with it, just let him know. He’ll likely accommodate your concerns. I’m seeing a lot of people getting really upset and borderline calling this professor evil. He’s not evil. He’s opinionated, and you can disagree with him on the subject, but I think reporting or pursuing punishment before talking to your professor is the wrong way to go.", "author": "McChickenFingers", "created": 1610848731, "upvotes": 7}, "gjj4dmn": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4dmn/", "text": "I’ll avoid arguing about all of the other things since it seems covered.\n\nYou need to be an adult and speak up. If you’re uncomfortable with something say you’re uncomfortable with it. or email them or whoever is above them as was suggested. \n\nIt’s a very important lesson and skill to learn for the rest of your life, college is a great time to learn and grow and establishing boundaries with superiors is a very valuable skill that will benefit you greatly.", "author": "Satan_and_Communism", "created": 1610848450, "upvotes": 6}, "gjj46tg": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj46tg/", "text": "Prof here.  His actions are NOT okay.", "author": "catscience247", "created": 1610848351, "upvotes": 49}, "gjj3ydg": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3ydg/", "text": "This professor sounds nuts. Any decent, objective microbiologist would understand that SARS-CoV-2 doesn’t travel through the air by itself, but rather, on tiny spit droplets that we always let out when we breathe/talk, which *can’t* pass through masks very easily.\n\n[This picture](https://science.sciencemag.org/content/sci/368/6498/1422/F1.large.jpg?width=800&height=600&carousel=1) from a [Science article](https://science.sciencemag.org/content/368/6498/1422.full) describes how it works pretty well.\n\nIf your professor is so against masks that they’d ignore science that they *should* know to support their rhetoric, I’d try to get out of that class and switch to a different professor, if you can. This professor doesn’t seem to be the most trustworthy source of information.", "author": "Atrapper", "created": 1610848226, "upvotes": 16}, "gjj3sz9": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3sz9/", "text": "I- goddamit\n\nI’m a microbio major and to respond to your professor....while it is pretty obvious that viruses are fucking tiny and yes, they can pass through the mask, the reason why it is implemented to wear them is to prevent the saliva aerosols that CONTAINS the viruses from entering our system. It increases the chance of you not getting covid. It doesn’t mean it’s 100% foolproof but that don’t make it pointless...ahhh and yes. Herd immunity. Tell him it’ll be a long time before we can achieve herd. Fucking. immunity considering anti-maskers often are also antivaxers\n\n\nSo while your professor not wanting to wear them is one thing but to tell his students that masks are useless is fucking ridiculous & to say that Fauci doesn’t know any better is even more ridiculous. How old is he? What is even going on in that class/ that school? Why is there in-person lecture? If the class is not required you can switched out. If it is. Avoid sitting in the front and  remind yourself that his lectures from now on should be taken with a grain of salt", "author": "BadNad", "created": 1610848143, "upvotes": 98}, "gjj3sgw": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3sgw/", "text": "please please please report him to the chair of the department.\n\nIt’s not just the not wearing a mask and putting y’all in danger, it’s the spewing politically-motivated pseudoscience as a microbiology professor. Report him.", "author": "esk12", "created": 1610848135, "upvotes": 40}, "gjj3qla": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3qla/", "text": "AHHHHH, Florida.", "author": "symmetrical_kettle", "created": 1610848107, "upvotes": 13}, "gjj3q0c": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3q0c/", "text": "Tell your dean", "author": "davidc5494", "created": 1610848098, "upvotes": 7}, "gjj3lko": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3lko/", "text": "If he is talking, he is spewing droplets all throughout the air.\n\nNo, the mask will not 100% prevent it, but it will minimize it greatly.", "author": "982140747", "created": 1610848032, "upvotes": 759}, "gjj2kbo": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj2kbo/", "text": "Not saying I agree with him at all because I don’t but some people got sick before the US started testing for COVID but you can tell if you had it through blood tests. I think there’s certain antibodies you can still see on these tests and it tells you if you’ve had it before", "author": "gotthatsushi", "created": 1610847497, "upvotes": -9}, "gjj2174": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj2174/", "text": "Is it possible to meet with him one on one to discuss this? Or just out of the way from the rest of the class? You shouldn't be uncomfortable in class, espeically in that case. I'm also in FL and have a professor like that, so I sit all the way in the back of class. I also have social anxiety, so I understand where you're coming from. I believe in you!", "author": "lettucezucchinisalad", "created": 1610847214, "upvotes": 5}, "gjj1yqd": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1yqd/", "text": "If your goal is to have him wear a mask you could call whoever he cleared it with to say you weren't able to speak up do to anxiety but that you aren't comfortable with the prof being maskless while lecturing. You don't have to give your info or even which class exactly you are taking, just that you have a class with that prof and you want to see the mandate followed.", "author": "okThisYear", "created": 1610847176, "upvotes": 523}, "gjj1qxi": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1qxi/", "text": "Wow this subreddit is filled with idiots. You’d think after a year of coronavirus, they’d realize things. This is precisely the reason covid won’t go away ever and we’re all gonna miss our college experience. It’s a piece of fabric. I wish people would stop crying about it and just put it on.", "author": "microfsxpilot", "created": 1610847060, "upvotes": 355}, "gjj16ce": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj16ce/", "text": "Your professor is right. Little cotton masks are absolutely shit and won’t do shit to protect you or anyone else.", "author": "GetYourselfAHapa", "created": 1610846765, "upvotes": -71}, "gjj1397": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1397/", "text": "Hey man. This is a big deal and especially with Microbio? I would definitely email the dean of STEM at your school or even the Dean as a whole. You don't include where you are or where your college is, but in NJ masks are mandatory and they should be. Especially with regard to a professor whose specialty should be bacteria and viruses.", "author": "kimareth", "created": 1610846719, "upvotes": 134}, "gjiy7nx": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjiy7nx/", "text": "[deleted]", "author": null, "created": 1610845144, "upvotes": -64}, "gjivcgd": {"link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjivcgd/", "text": "I would ask to see some credentials. I wouldn't take biology from a professor that didn't insist on everyone wearing two masks. Herd immunity his way would consider killing off 6.6 million an acceptable outcome.", "author": null, "created": 1610843590, "upvotes": 359}}}