{
  "sid": "q6tak9",
  "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/",
  "title:": "I think im doomed at uni and that my life is pointless",
  "text": " Hey, So im an American (18f) living in the Netherlands for university. I lived in Austria before for my moms job. The thing is I want to stay at university. But I think I may be forced to drop out. In the Netherlands if you dont pass the first year they kick you out which means the country also kicks you out due to it being a student visa. I am afraid because I wont have the opportunity to go to uni again at least for many years. Also the financial loss will be great as its all out of pocket. Also my contract forces me to pay for my housing for 12 months even if I got kicked out of the country. I also cant work in Austria (cant speak German). I also dont want to go back to the US. I dont know what I would even do. Im so scared and I feel like my life is over already.",
  "author": "Idontknow610",
  "created": 1634065666,
  "updated": 1634582299,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfb5l8": {
      "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfb5l8/",
      "text": "Listen to me. It’s going to be OK. I know that you don’t want to go to America, and I don’t blame you, but really there are many good community colleges over here I can give you a leg up and will except you as long as you have a pulse. You’re only 18, and I hope this doesn’t sound condescending, but you were great and you have so much amazing possibility ahead of you.\n\nIf it’s possible have you considered looking at other universities in Europe that teach in English depending on your major?",
      "author": "miasmicivyphsyc",
      "created": 1634085692,
      "upvotes": 1,
      "replies": {
        "hgfbwf4": {
          "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfbwf4/",
          "text": "The issue is that after this I would be too low on money to go to a community college. Also I dont know where I would even go for college. I have considerd other places in Europe but there were things that prevented it or simply I just didnt want to go there.",
          "author": "Idontknow610",
          "created": 1634086046,
          "upvotes": 1,
          "replies": {
            "hgfc6aa": {
              "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfc6aa/",
              "text": "Have you heard about the FAFSA? I thought I couldn’t afford community college but if you make under a certain amount of money college is reduced and sometimes even free.\n\nAnd why don’t you want to explore other options? Because, I hate to sound like a bitch, but I really would reconsider your options. Desperate time calls for desperate measures, trust me I’ve been there before",
              "author": "miasmicivyphsyc",
              "created": 1634086173,
              "upvotes": 1,
              "replies": {
                "hgfcn0c": {
                  "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfcn0c/",
                  "text": "I guess I dont really know any other options tbh. Just that I cant stay in Europe for university and that I dont want to go back to the US. Also im not fully sure im screwed yet here but it seems to be going that way.",
                  "author": "Idontknow610",
                  "created": 1634086388,
                  "upvotes": 1,
                  "replies": {}
                },
                "hgfe8he": {
                  "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfe8he/",
                  "text": "but I really dont know what to do and I may be forced to come back to the US even though im afraid and kinda desperate not to",
                  "author": "Idontknow610",
                  "created": 1634087119,
                  "upvotes": 1,
                  "replies": {
                    "hgfeq4c": {
                      "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfeq4c/",
                      "text": "If you don’t know what to do, that is literally what community college is for. If you make under a certain amount of money and file your FAFSA and community college is literally close to nothing and for me it was completely free. If you want to spend time in the Netherlands fine, but you’re going to have to find a new program to study because this one isn’t working. And if you want to look somewhere else in Europe then I would consider broadening your horizons.\n\nAny reason why you don’t wanna go to the US, because I know Reddit makes it out to be a third world country but as someone from a Third World country trust me do US is literal paradise even though it’s not as great as Europe (lived in Germany) and the university systems is pretty decent actually.",
                      "author": "miasmicivyphsyc",
                      "created": 1634087343,
                      "upvotes": 1,
                      "replies": {
                        "hgffhi8": {
                          "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgffhi8/",
                          "text": "Like the issue is that the US isnt safe for me. There are some good places but they are expensive to live in.  I also dont know anything about the US uni system as I didnt research it or even consider which state I would consider",
                          "author": "Idontknow610",
                          "created": 1634087684,
                          "upvotes": 1,
                          "replies": {
                            "hgfirs0": {
                              "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfirs0/",
                              "text": "Safe how? I’m biracial, half black, half brown, trans NB, gay, not trying to make a statement literally that’s what I am, and it’s fine? College campuses are extremely liberal, and no one cares.\n\nThe US is NOT a monolith. If it’s something else like immigration, then I understand, or an abusive family member or partner, I understand but just saying the “US is not safe” is just a massively huge generalization.\n\nAlso the US Uni system literally babies you. It’s the most hand holding university system in the world. Foreigners from third world countries (me, before Germany) love it here because, well, there’s so much flexibility.\n\nAnd community college is very forgiving. Do NOT go to a big city. You can apply to a community college and fill out FAFSA. Colleges are also always hiring custodians and secretaries which make decent money so do that for a year (family member did that, saved up 40k, cheap rent in mid size city)",
                              "author": "miasmicivyphsyc",
                              "created": 1634089191,
                              "upvotes": 2,
                              "replies": {
                                "hgfjlkd": {
                                  "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfjlkd/",
                                  "text": "well it depends a lot on the state as well. im not saying the entire country isnt safe. But a big majority of states are. I am a trans girl and lesbian and would need to go somewhere thats accepting. But again I dont know which states are the best. even then the best states are expensive to live in.",
                                  "author": "Idontknow610",
                                  "created": 1634089577,
                                  "upvotes": 1,
                                  "replies": {
                                    "hgfkov4": {
                                      "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfkov4/",
                                      "text": "So am I. Trans and gay. It’s hard I know, but college campuses are very liberal because young people \nIn The US are extremely socially conscious. \n\nTrust me, people in Europe like Germany and Austria are extremely transphobic and racist; I know you lived there but some of the worst racism and be experienced is because of my skin color and don’t even get me started on transphobia in Europe. Just because they don’t “talk about trans issues” doesn’t mean that they’re any less horrible. \n\nThere are no magically “good states”. If you go to a safe mid size city, then you will be fine. Honestly suburbs are fine too. College campuses are fine for trans people, honestly as a trans NB bio female, there literally the most accepting places on earth. \n\nThat’s it. Maybe stay away from the Deep South but that’s just not true. They’re are plenty of gay and trans people that live in the south, and honestly we’re thriving and doing just fine. Homophobic people on college campuses are laughed out of classes, it’s genuinely not a problem over here. \n\nOr you can look somewhere else in Europe and get a job. Up to you. But you need to do your OWN research, and broaden your horizons then. \n\nAlso look at Eastern Europe if you want cheap prices and education l, but know that it’s not always LGBT friendly.",
                                      "author": "miasmicivyphsyc",
                                      "created": 1634090087,
                                      "upvotes": 2,
                                      "replies": {
                                        "hgfl7j4": {
                                          "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfl7j4/",
                                          "text": "Yeah, im thinking now about going back to somewhere in the US if I do fail but thats not assured yet. I'll look at more friendly states and then look at community colleges for maximum safety.",
                                          "author": "Idontknow610",
                                          "created": 1634090326,
                                          "upvotes": 2,
                                          "replies": {
                                            "hgflqvc": {
                                              "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgflqvc/",
                                              "text": "I apologize if I sound really bitchy or rude, I don’t wanna alienate other trans people. But I want you to know that there is no perfect place to be trans. As much as I wish there was a place with no racism or trans phobia or homophobia that shit always sneaks in. And even from developed countries like Europe, that shit can be so much more insidious. Just because they don’t talk about transgender issues doesn’t mean that they actually care in fact I found that all they do is sweep it under the rug.\n\nBut we keep thriving as LGBT people because we are strong and our very existence means to be marginalized. I wear mine as a badge of honor, because Whether I am in Alaska or the Middle East or France, I will always be the minority because that’s just the way we are. So I wear mine as a badge of honor and I don’t let anybody fuck with my opportunities. It is our life to live, our space is wherever we want, and Give people a chance especially if they come from undeveloped countries or even countries that don’t seem nice on paper. You’d be surprised how flexible the people are from the country and how a government does not represent the average every day citizens",
                                              "author": "miasmicivyphsyc",
                                              "created": 1634090573,
                                              "upvotes": 2,
                                              "replies": {
                                                "hgfmoc4": {
                                                  "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfmoc4/",
                                                  "text": "I agree with you and fully understand. But I do want to go to a place that's still mostly safe. And no you don't sound rude or anything so don't worry. Im just worried about my future. Specifically my current situation.",
                                                  "author": "Idontknow610",
                                                  "created": 1634091007,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "hgfshcs": {
                                                      "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfshcs/",
                                                      "text": "Stay safe and good luck",
                                                      "author": "miasmicivyphsyc",
                                                      "created": 1634093820,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hgfgs84": {
                          "link": "/r/college/comments/q6tak9/i_think_im_doomed_at_uni_and_that_my_life_is/hgfgs84/",
                          "text": "so basically I dont know where I would even go.",
                          "author": "Idontknow610",
                          "created": 1634088274,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}