{
  "sid": "qa0y3x",
  "link": "/r/college/comments/qa0y3x/how_to_date_in_college/",
  "title:": "how to date in college?",
  "text": "Serious question, I'm just wondering how people met their significant other/started the relationship. I've tried online dating, but the connection always feels forced. I would love to just organically start spending more time with a guy I like and then have that morph into a relationship, but that doesn't seem likely to happen :/ . Anyone have advice?",
  "author": "Longjumping-Target-3",
  "created": 1634484532,
  "updated": 1634654801,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hgztxhf": {
      "link": "/r/college/comments/qa0y3x/how_to_date_in_college/hgztxhf/",
      "text": "Pretty much every couple I know in college met because they were in the same class on the same club. So I guess just trying to make friends in your classes and joining clubs would be a good way",
      "author": "cowfishAreReal",
      "created": 1634485169,
      "upvotes": 9,
      "replies": {}
    },
    "hh00g1v": {
      "link": "/r/college/comments/qa0y3x/how_to_date_in_college/hh00g1v/",
      "text": "Met my SO on bumble. Lots of people meet online lately. We’ve been together for 3 years and living together over a year. Plan to get engaged in the next 2 years",
      "author": "Concerned-23",
      "created": 1634487957,
      "upvotes": 6,
      "replies": {}
    },
    "hh0343h": {
      "link": "/r/college/comments/qa0y3x/how_to_date_in_college/hh0343h/",
      "text": "Don’t expect the perfect scenario to arise in college, or like.. ever. But especially college. It’s the intro to dating for most people. Just focus on getting to know yourself and what you want out of life / other people. Respect everyone including yourself, and respectable people will match that energy towards you. It’s cliche but loving yourself first really opens up the dating world for you, I wish I caught onto that sooner",
      "author": "INeedAYerb",
      "created": 1634489113,
      "upvotes": 7,
      "replies": {}
    }
  }
}