{"sid": "kan6ps", "link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/", "title:": "I (23f) have ADHD and I've been a straight A, 18hr a semester, fully virtual college student who does only 1 hour of homework a day for 3 years and this is what I've learned.", "text": "This is mostly for people who did well in high school without effort and now have to time and project management skills. \n\nTLDR; I thrive on schedule but have to legitimately force myself to stick to them. I used these tips to stay on the Dean's List, procrastinate mindfully, stop wasting time on studying ineffectively, and ease the stress of 18 college hours with my 3 homeschooled kids and a job.\n\n-MAKE A WORKSPACE: Make a little area that you keep your school stuff at. Sit there an hour a day to work, make important phone calls, ect. Your \"adulting\" spot. Dont doodle there. Dont eat dinner there. Dont play video games there. Even if it's a backpack, chair, and a tv tray. Mine is a desk in a closet. Decorate meaningfully. A school vision board and an erasable calendar maybe. \n\n-If you can, take notes on one word document so that you can search your notes instantly for a keyword. \n\n-MAKE TIME (just a little) to actually work. Everyday. Like a job. Even when you have no work to do, sit down at your desk for a bit every day and find something important to do that is unpleasant/has been put off and do it in that \"work time\". Make that appointment you havent made, call the matenience to fix the dishwasher you have been not using for a week bc you havent called, do whatever and limit the adulting to that hour and do it everyday. You'd be surprised how much an hours of actual work can get done if its consistent. But consistency is hard for me so I have to enforce it. My kids have an hour or so of nap/quiet time in their rooms while I work, and I rarely if ever need more time than that. Most of the time I spend outside of that is on important tests that cant be interrupted. \n\n-RITUALS: No not those. But you cant just sit down and expect to switch gears. Do something everytime you sit down to work that gets you \"in the zone.\" Maybe it's a cup of water and a journal, or checking your calendar or whatever, or even a cigarette and 20 minutes of a game that you only play right before you buckle down, set a timer. Setting out 15 minutes  or so to sit at my desk and bullshit actually makes me work better. \n\n-ONLY HIGHLIGHT key words in notes and textbooks. If the course has many dates and names, consider highlighting those in a seperate color.\n\n- COMBINE POWERPOINTS all the teachers powerpoints she sends out into one giant  PowerPoint that you can search for keywords efficiently.\n\n-COPY AND PASTE all test questions that allow it into ONE master document of test questions for each class: if you can correct the wrong answers after, even better. This takes no time if you do it during the tests, or print screen after you've taken it. Not all classes allow this, though.\n\n-INDEX everything that you cant search easily. If you do it as you go, it's easy but it's hard to get started. \n\n-  *Leave it for the due date* , if you have to, but not the night it's due. Work in the morning. Trust me. Wake up at the same time everyday. Do something pleasant for a limited time and then work until you're done for the day. Then you can enjoy you're whole day without the clock ticking down to 11:55PM when that quiz is due that you've known about for 2 weeks and havent done. It's going to happen, it always will, but it you do it that morning, you will always feel better. \n\n- Bring your snack or drink with you and dont get up, if you can manage that.\n\n- totally optional: Bullet journals. Especially for those that love to be creative, hate taking notes, and cant seem to get organized. Everyone loves to be organized and consistent, deep down.", "author": "someones--mom", "created": 1607631439, "retrieved": 1632801613, "over_18": false, "upvotes": 1906, "upvote_ratio": 0.95, "comments": {"gjfa137": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gjfa137/", "text": "Thanks for the post, I'm finding it helpful as I'm planning my upcoming semester. What do you mean when you say you index everything? What info do you put in the index? Do you keep an alphabetical index of keywords in your notes word doc with or do you write them down in a Bullet Journal spread or something else?", "author": "Persea_americana", "created": 1610772757, "upvotes": 1}, "ggnysma": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/ggnysma/", "text": "Hello, my name is Eli and I am a student at Golden Gate High School and I am taking AP Research and I am currently doing a research project on the presence of meritocracy and academic elitism in the life of college student.If you are currently enrolled in either Harvard, Yale, Oxford, Princeton, FGCU, or FSU, or any public, private, and community university. I was wondering if you would be part of my study or if you had students that would be part of the study. All you would have to do is complete a survey and questionnaire. The identity of the participants would remain anonymous. If you are not interested or don’t attend any of the schools listed above, then you can just ignore this message. Here’s the link to the survey. https://docs.google.com/forms/d/e/1FAIpQLSfJi5rSonDi9Wba8LB_Nq22wzU7rTpeoTil_o4pRzNnpYhAsA/viewform", "author": null, "created": 1608614608, "upvotes": 1}, "gg1y4qz": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gg1y4qz/", "text": ".", "author": "WhalesVirginia", "created": 1608142441, "upvotes": 1}, "gfjti20": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfjti20/", "text": "Okay I've recieved some strong and harsh criticism that has been helpful for me. I'm not really going to defend my schedule because maybe it's a dumpster fire and you guys know something I dont. I'm willing to accept that. But I also have some advice that might be harsh... you guys are wasting your lives.\n\n No offense everyone saying that my major is a joke, but it's one of the most well paid and stable degrees you can get right now. I go to a well recognized state school. If my degree is a joke than most degrees are jokes. \n\nMore likely, you may not be as efficient of students as you think and you're letting your early adulthood destroy you. College is not a prison. I LOVE school. I wanted to be a career student even. I enjoy every single hour I put into school. It's not a burden or a prison. No offense but maybe some of you need to reorganize your lives to work for you. I had three kids already, I'm not judging. But now I have three kids, Almost a dual degree, writing a fantasy novel while I watch my kiddos, I finish a book for fun in just my spare toilet time at least once a month. I watch netflix while I clean and I work out daily to wind down. I have ADHD so even if I had the time to sit for hours a day after work, that would be soul crushing and more importantly OBVIOUSLY UNNECESSARY... for me and my skill set.\n\nYou guys need to enjoy yourselves more! School isnt my whole life. Just one beautiful part of it. To stay healthy and happy and challenged, I can only spend 1 hour a day and make the grades obviously other people do, then why should I? That's what efficent people do, they dont waste their time. \n\nMy heart goes out to you guys. \n\nBut just because I'm not falling apart every exam, doesnt mean I'm not learning anything. I have a finance job now and I apply things I learned in school constantly. I did absolutely top tier in high school, loved the shit out of it,  and basically did no work at home. School is easy for me and maybe that's the missing piece. If you need 40+ hours a week for your 4 classes because you cant pass them without selling your entire life, leave college and get a job you love, you may be the one who wakes up a year after graduation and realized that your technology degree is obliterated by an algorithm and that you wasted your life on school. But if you fully utilized that time and enjoyed school how it was meant to be enjoyed, you didnt waste your time. College wasnt meant to kill you.", "author": "someones--mom", "created": 1607792260, "upvotes": 0}, "gfjojg4": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfjojg4/", "text": "If you can spend this little time on homework for your degree then your major/ program is a joke.", "author": "qonkwan", "created": 1607790575, "upvotes": 3}, "gfjk89q": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfjk89q/", "text": "1 hour a day shows that you have a very low workload", "author": "Wizard_Nose", "created": 1607789087, "upvotes": 3}, "gfij17h": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfij17h/", "text": "[deleted]", "author": null, "created": 1607774885, "upvotes": 1}, "gfhd0vv": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfhd0vv/", "text": "Combine PowerPoint: never a problem for a Mac user.", "author": "nerdDragon07", "created": 1607741464, "upvotes": 1}, "gff8rbv": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gff8rbv/", "text": "This is everything I needed before this past semester, thank you for your wisdom", "author": "baijones1", "created": 1607712300, "upvotes": 1}, "gff2v9a": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gff2v9a/", "text": "Just a tip to add to one of the points you made. If you like physically writing your notes, still transfer it to a Google Docs at the end of the day to help you in the future. It makes it so much easier when you can Ctrl + F words/concepts you know are hiding in your notes", "author": "DazedPenguin15", "created": 1607710510, "upvotes": 1}, "gfemex3": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfemex3/", "text": "You mentioned mindful procrastination, can you elaborate a bit more on that?", "author": "emporerzurg0538", "created": 1607704906, "upvotes": 2}, "gfelixs": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfelixs/", "text": "Did shit in high school, until the end when I studied like crazy. And now I’m in college having to studying 10x harder. I do not understand and are extremely jealous of people to succeeded in the way schools teach.", "author": "tulip_problems", "created": 1607704479, "upvotes": 1}, "gfeia6c": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfeia6c/", "text": "Maybe I'm overfocusing on this quote, but I do all this and still get burn out. Then I see, \"or even a cigarette...\" \nOh. Uses drugs to reduce stress. We'll, no wonder she has such an easy time at it.", "author": "IWHYB", "created": 1607702895, "upvotes": 0}, "gfe4uj7": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfe4uj7/", "text": "Thanks", "author": "chocolander", "created": 1607695686, "upvotes": 1}, "gfdrrkg": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdrrkg/", "text": "Lol you think you is getting read?", "author": "ndgoLiberty", "created": 1607685521, "upvotes": 2}, "gfdommn": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdommn/", "text": "[removed]", "author": null, "created": 1607682275, "upvotes": 0}, "gfdom9y": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdom9y/", "text": "Do you take prescription for ADHD?", "author": "OsmocTI", "created": 1607682265, "upvotes": 2}, "gfdnyv2": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdnyv2/", "text": "Works for memorization-heavy curriculums, not for problem-solving-heavy curriculums like maths, physics, or engineering.\n\nStill, order is important.", "author": "MrStealYourFrog", "created": 1607681574, "upvotes": 4}, "gfdnva4": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdnva4/", "text": "How is this even possible? I start all of my projects and assignments early and still get overwhelmed. I never procrastinate! I’m a CS major at a top public university and each 4 unit class requires a minimum of 12 hours a week to be spent on it. I’m taking Calc 2/this python programming class and I have to spend >4 hours a day in addition to my English homework. These tips aren’t bad but even if I was hyper-focused, I still wouldn’t be able to reduce my homework to just one hour a day. I guess it’s just the nature of STEM.", "author": "Famboiis", "created": 1607681467, "upvotes": 2}, "gfdkaxw": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdkaxw/", "text": "Oh, the wonders of being medicated and treated 😂 \n\ncongrats", "author": "spaghetti_consumer", "created": 1607677771, "upvotes": 1}, "gfdiaf7": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdiaf7/", "text": "1 hour of homework a day? Right..", "author": "frogshithomie", "created": 1607675808, "upvotes": 1}, "gfdebkn": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdebkn/", "text": "Thank you for the PowerPoint tip! It makes so much sense and I’m definitely going to do that going forward :)", "author": "Binnykins", "created": 1607672093, "upvotes": 2}, "gfdb1l6": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdb1l6/", "text": "“-INDEX everything...” \n\nwhat does that mean?", "author": "whydoesSATexist", "created": 1607669288, "upvotes": 1}, "gfdasvq": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfdasvq/", "text": "I know you’re getting a lot of flack OP. But it is solid advice. This is coming from a a fellow ADHD person. Of course it won’t work for everyone, and maybe not even most people. But maybe someone on here can get something useful out of it. Even if it’s just a small tool or behavior they might be able to enforce. (Enforcing my own behaviors though. I struggle lol)\n\nA lot of this could not work for me, but that doesn’t mean it won’t work for someone else. So good on you for trying to help others.", "author": "AzulAnemone", "created": 1607669090, "upvotes": 6}, "gfd59en": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfd59en/", "text": "Well said.", "author": "Psa-lms", "created": 1607664888, "upvotes": 2}, "gfd51xs": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfd51xs/", "text": "You're a genius and I love you!! From one inattentive ADHD lady to another, you are spot on. I wish I had your discipline at your age. Yes!!", "author": null, "created": 1607664744, "upvotes": 1}, "gfd15hr": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfd15hr/", "text": "Cheat, cheat, cheat", "author": "bvdgies", "created": 1607662155, "upvotes": 0}, "gfcv5td": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcv5td/", "text": "Agreed. I am also on Dean's list. I follow the same 'time blocking' method. Certain things at certain times. Every morning I wake up and go to the gym. I'm on my way there before I'm awake enough to realize it. I know I feel better and have a more productive day after the gym but getting out of bed is difficult.\n\nAdditions:\n- stay healthy. Exercise, get mind space, eat well.\n- use a planner if your scatterbrained. You can find several free ones online.\n- prioritize.\n- know yourself. We all have off days. My studies have fallen to the wayside while I've adjusted to a new job on a new schedule.\n- keep at it. With everything going on and ask if the changes, one day of your plan or schedule not working doesn't mean the end of it. Try again tomorrow and don't give up. 2020 has been a hell of a journey for all of us.", "author": "erivanla", "created": 1607658571, "upvotes": 3}, "gfcuana": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcuana/", "text": "I don't know if I have adult ADHD but from what I've found from _working_ a job, is that living by someone else's schedule is easy as hell.\n\nI succeeded in college by going to class.  When I didn't go to class, my grades dropped.\n\nMy grades also improved when I stayed on campus to do a lot of work.\n\nThe only consistent things match up with yours:  \n\n* Maintain schedule  \n* Maintain workspace", "author": "ITriedLightningTendr", "created": 1607658085, "upvotes": 5}, "gfcsxtl": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcsxtl/", "text": "Lol", "author": "BananaYNotUrr", "created": 1607657335, "upvotes": 3}, "gfcrccf": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcrccf/", "text": "Ok I LOVE the term “procrastinate mindfully” I feel like that really encompasses what I’ve been doing in college lol. This semester not so much (procrastinating but not mindfully, thanks, online school).", "author": "ekaplun", "created": 1607656474, "upvotes": 3}, "gfcq4j4": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcq4j4/", "text": "i have adhd too, i’m a senior and have managed to get (almost) straight As every semester with 5 or 6 classes each time and yeah this seems kinda like what i do lol. except i am still horrible at time management and am super slow so i have to set aside like, 6 hours every day (maybe like 3 of those i am doing work the other 3 i am staring into space or something). sometimes i can hyper focus and go for like 12 hours in a day but that’s rare. i don’t really have exams anymore and just have a lot of big projects so my method probably doesn’t work for everyone but what i do is make a checklist every week with all my assignments, and every day i make a tiny checklist with what i need to work on and a time slot to do it (and i make the time slots a little longer than i think i’ll need just in case). sometimes i won’t be able to finish but i try to finish at least one thing on the checklist every day. plus i leave fridays and weekends empty and plan my schedule so i don’t have to do work on those days besides on sunday night so i can have a nice break every week. even if i have a lot of work to do and need to work friday and sunday i try to reserve saturdays as “no work days” and i think it is the thing keeping me sane lol.", "author": "lasagnaisgreat57", "created": 1607655815, "upvotes": 3}, "gfcoabn": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcoabn/", "text": "Cries in STEM", "author": "imarabianaff", "created": 1607654892, "upvotes": 22}, "gfcm5xu": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcm5xu/", "text": "Good stuff thank you, much appreciated 🤝", "author": "Anexcelworksheet", "created": 1607653824, "upvotes": 2}, "gfcjvyk": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcjvyk/", "text": "You have 3 school aged kids at 23?", "author": "hannibe", "created": 1607652660, "upvotes": 43}, "gfcfho5": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcfho5/", "text": "I can't have a workspace in online classes :c I live literally in my room, I use my only desk for everything, and next to it is my bed, is really hard, during the day I get back to sleep, I do nothing, any idea of what can I do?", "author": "k-tia", "created": 1607650336, "upvotes": 1}, "gfced6l": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfced6l/", "text": "Congrats on the excellent semester !! How many more semesters to go ? Or was this the last one ?", "author": "AwesomeBlue98", "created": 1607649737, "upvotes": 1}, "gfcdlri": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcdlri/", "text": "Is this even real?", "author": "Max-Zorin", "created": 1607649329, "upvotes": 15}, "gfcc0x1": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcc0x1/", "text": "eh i’ll read it later, time for a nap", "author": "dubbee35", "created": 1607648491, "upvotes": 3}, "gfcbbj7": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcbbj7/", "text": "I wish I was you. Straight As damn must be nice", "author": "veeeerain", "created": 1607648124, "upvotes": 3}, "gfcai2r": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfcai2r/", "text": "Or you can just cheat with your phone. Boom.", "author": "darknetvendor2", "created": 1607647685, "upvotes": -2}, "gfc9ejn": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfc9ejn/", "text": "This is amazing. How does it apply to textbook readings? My classes are text-book heavy. 😭", "author": "strawberrysweetpea", "created": 1607647111, "upvotes": 2}, "gfc75tx": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfc75tx/", "text": "I got all excited to read this and then realized that my last class was last night.", "author": "Kisua", "created": 1607646118, "upvotes": 1}, "gfc75ea": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfc75ea/", "text": "\"i (23f) just took my adderall and want to make a long extremely detailed list of things and publish it\"\n\nim 26 now and i used to take the maximum prescribed adderall (30mg xr) 5 to 6 days a week. it made me feel great and it made me feel like all i wanted to do was be around people and talk to them and tell them all sorts of cool stuff. unfortunately its all crackhead energy and when youre young and surrounded by academia people dont notice it as much, as well as it hits your system differently. luckily i stopped using adderall when i was like 19 so it never made me look or sound like a crack head.", "author": "Joyson1", "created": 1607646112, "upvotes": 26}, "gfc4gtc": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfc4gtc/", "text": "[deleted]", "author": null, "created": 1607644974, "upvotes": 100}, "gfc06h4": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfc06h4/", "text": "Thats like 6 classes. Either youre joking or your program is a joke", "author": "onyxx8", "created": 1607643193, "upvotes": 55}, "gfbzx3e": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfbzx3e/", "text": "Um how did I not think of the powerpoint thing!!!! Especially with my open book exams", "author": "leafyleafboi", "created": 1607643087, "upvotes": 7}, "gfbsa6x": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfbsa6x/", "text": "Not to be an asshole or anything but working on an hour a day for me would never work out. In taking 15 credit hours and my engineering class alone of 5 credit hours regularly said I should be putting on average 2 hrs per day minimum so that I can spread out the work. Thats on the low side and assuming that I am not aiming for As in the class, 2 hrs average would be aiming for a high C low B.\n\nIm really glad you found a way that works for you an your major and espically going to school when you have kids. I could never imagine how stressful that must be for you. Thank you for making this post because even if it wouldnt help me, it will help someone else.\n\nI really just wanted to say that this advice will not work for everyone and no one should be feeling bad that they are working longer than an hour a day and not getting As.", "author": "helloeveryone4", "created": 1607638944, "upvotes": 297}, "gfbqxcx": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfbqxcx/", "text": "I (adhd) can’t read this whole thing bye", "author": "Rocatex", "created": 1607636339, "upvotes": 1005}, "gfbmza0": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfbmza0/", "text": "These are really helpful tips! Thanks!\n\nThis whole semester, my math professor thought I was doing math in a closet. In reality, it was just my messy bedroom with storage in the background. 😆\n\nMy favorite way to organize is by putting colorful sticky notes on the wall according to the days of the week. If the sticky note is there, I do the assignment on that day.", "author": "Visneko", "created": 1607634398, "upvotes": 10}, "gfbm1di": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfbm1di/", "text": "The math doesn't really work out. You'd be only doing 70 minutes per class a week. Also, ADHD with a solid GPA. I put in 6 to 7 hours a week on my primary major class alone.", "author": null, "created": 1607633930, "upvotes": 67}, "gfbkq6b": {"link": "/r/college/comments/kan6ps/i_23f_have_adhd_and_ive_been_a_straight_a_18hr_a/gfbkq6b/", "text": "Hi!! Thank you for providing these tips.\n\nMay I ask you what your major is?\n\nI wish I could do this. Online classes have gotten harder this semester. I feel really burnt out, especially since my university took away our breaks for fall 2020. I am a nursing student and I’m looking for different, more efficient ways for me to study but still take care of myself. I’m also getting a puppy too.\n\nHow do you study for exams and remember information?", "author": "Summerbutt", "created": 1607633293, "upvotes": 121}}}