{
  "sid": "irm4i2",
  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/",
  "title:": "Does anyone else feel like you can't enjoy a Saturday anymore due to online classes?",
  "text": "I usually take Sundays off from schoolwork. But now we have to spend Saturdays catching up on stuff you missed during the week or getting ahead so there isn't a traffic jam during the week.",
  "author": "_34_",
  "created": 1599949419,
  "over_18": false,
  "upvotes": 1833,
  "upvote_ratio": 0.99,
  "comments": {
    "g57qupc": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g57qupc/",
      "text": "I don’t even have weekends anymore. I’m going to burn out VERY soon. Everyday it’s wake up, eat/use the bathroom, study, eat, study then go to bed. Last semester online was better, and it had a better learning technique than now.",
      "author": "ElBarro69",
      "created": 1600074610,
      "upvotes": 3,
      "replies": {}
    },
    "g55x9sp": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55x9sp/",
      "text": "Do you homework in the week. You’re scheduled is the issues get all your homework done by Friday problem solved.",
      "author": "Northenwoodswolf",
      "created": 1600032199,
      "upvotes": -2,
      "replies": {}
    },
    "g55slce": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55slce/",
      "text": "Some people in here are like \"just do it by Friday\" and its like uh thanks Karen but not all of has have easy classes that you can just \"do it all by Friday\".",
      "author": "JayAggRev",
      "created": 1600030031,
      "upvotes": 4,
      "replies": {}
    },
    "g55ro9d": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55ro9d/",
      "text": "I literally had to drop a class so Id be able to have some time off. Im currently being very self destructive and basically not doing anything despite the fact I have a midterm due at midnight today because how burned out and unmotivated I am. After this semester Im only taking like 3 classes per term, including the summer to make up for this “small work load”. I know teachers think making tests on the weekend gives us more time to prepare, but what it really means is that we don’t get a single day off. I really need to get a job but just can’t because I wont be able to handle more work.",
      "author": "deprimada",
      "created": 1600029624,
      "upvotes": 3,
      "replies": {}
    },
    "g55o2ht": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55o2ht/",
      "text": "I just finished an assignment for this week today, and we get our new assignments on Mondays. For some classes I'm able to make a long weekend for myself by getting everything taken care of by Thursday, but lately it's just felt like I'm never taking a break",
      "author": "UsernamesAre4Nerds",
      "created": 1600028130,
      "upvotes": 2,
      "replies": {}
    },
    "g55mdwm": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55mdwm/",
      "text": "no i dropped out :)",
      "author": "dxiiv",
      "created": 1600027513,
      "upvotes": 2,
      "replies": {}
    },
    "g55koou": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55koou/",
      "text": "I can't speak for any other profs, but I actually made things due Saturday to be more flexible! I used to have all assignments due on class days, but now that only half the class comes at a time, that seems kind of pointless. I thought about having students turn in some work they days they don't come in (if you come on Wednesdays, your work is due on Fridays and vice versa) but that felt like I was imposing a structure for no reason given they wouldn't actually come to class. So I just made everything due at the end of the week on Saturday to give students the most flexibility, given I usually wouldn't look at it all until the following week anyway.\n\nI guess no good deed goes unpunished.",
      "author": "BewareTheSphere",
      "created": 1600026853,
      "upvotes": 1,
      "replies": {}
    },
    "g55kk7d": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55kk7d/",
      "text": "what do you think I’m spending my Saturday and today doing :(",
      "author": "lil-dlope",
      "created": 1600026805,
      "upvotes": 1,
      "replies": {}
    },
    "g55kcbl": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55kcbl/",
      "text": "Yep! A lot of stuff is due on Saturday, Sunday, or Monday for me. My weekends have been taken away and now we don’t even have a fall break even though our term is normal just because the last week of “classes” when we would be reviewing for finals is entirely online. We’re doing more work, but we don’t have ANY time off.",
      "author": "solaria-pheonix",
      "created": 1600026722,
      "upvotes": 1,
      "replies": {}
    },
    "g55h0xm": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55h0xm/",
      "text": "I do my homework after work on the weekdays when I am free. All my classes are online except my stats class which is once a week. I try to do everything a couple of days early so I can have those stress free days.",
      "author": "TheEvolutionOfCorn",
      "created": 1600025587,
      "upvotes": 2,
      "replies": {}
    },
    "g55e65c": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55e65c/",
      "text": "I always worked some on Saturday anyway, but now it's sunday's",
      "author": "JazzlikeSpinach3",
      "created": 1600024660,
      "upvotes": 1,
      "replies": {}
    },
    "g55cbpp": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55cbpp/",
      "text": "I feel this. I am in a grad program. 15 class hours Monday/Tuesday/Wednesday and a 16 hour internship Thursday and Friday. It's really rough and tiring. I don't really get times to take breaks. I try to but then I feel really guilty for trying to relax, like I don't have time. When I do try to relax, I keep thinking about school so it's not really relaxing lol. My due dates are Sundays so by the time I finish and turn everything in, it's already time to start the grind again on Monday.",
      "author": "lavender_scented",
      "created": 1600024090,
      "upvotes": 1,
      "replies": {}
    },
    "g55bnu9": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55bnu9/",
      "text": "Yes. Right now I'm panicking that it's 3 pm on a Sunday and I haven't done any work today even thought I did work yesterday, all last week, and will be doing more all this upcoming week...maybe I should take a break? I just can't I have an exam coming up so relaxing makes me anxious ugh.\n\nBUT I do have to say reading everyone's responses makes me feel a hell of a lot better and way less alone through this all. It's so easy to forget that you're not the only one experiencing this when you're cooped up in your childhood bedroom all the time.",
      "author": null,
      "created": 1600023876,
      "upvotes": 1,
      "replies": {}
    },
    "g552rzb": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g552rzb/",
      "text": "for me everything is due wednesday and thursday, so it’s constantly working in due dates. and also one class of mine is due on bb disscussion but we have to reply 2 times but spread out so that’s even more hectic in a way if you forgot it. and also one prof asking to do saturday and sunday class since most of my online classes fall on monday and there’s a lot of holidays this september so i can’t even rest in the weekends smh",
      "author": "kwonbh",
      "created": 1600020981,
      "upvotes": 2,
      "replies": {}
    },
    "g54z84q": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54z84q/",
      "text": "I work full time and take online classes. I'm lucky if I get one night a week to rest. Usually I  study 3-6 hours a night and 12 hours each day on the weekends.",
      "author": "SublimeUniverse",
      "created": 1600019588,
      "upvotes": 1,
      "replies": {}
    },
    "g54xntm": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54xntm/",
      "text": "17 credits, eboard member, and one of my classes is considered the hardest for my major. It's not as bad as others have it so I've been able to sort of stay on top of things.\n\n\nI do work every day but I also relax every day. I'm not a fan of cramming work into 5 days and weekends off, I'd much rather prefer spreading work over the week and having a few hours of video games or leisure to myself every day.\n\n\nNot much I can do anyways. Most of my friends are also abstaining from going out because of COVID (or their parents won't let them) or they live far away or at college, so it's mostly just gaming with friends that are available that really constitute my leisure time.",
      "author": "StoicallyGay",
      "created": 1600019027,
      "upvotes": 1,
      "replies": {}
    },
    "g54wnr6": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54wnr6/",
      "text": "\"This is not a self paced course\" headass",
      "author": "MsCarriage_69",
      "created": 1600018637,
      "upvotes": 4,
      "replies": {}
    },
    "g54w742": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54w742/",
      "text": "My school is on week 6 now.. but I’m still in week 3 for some classes. My Saturdays aren’t mine anymore :(",
      "author": "lazairiaw",
      "created": 1600018472,
      "upvotes": 3,
      "replies": {}
    },
    "g54vbo6": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54vbo6/",
      "text": "Working 15 hours a week, taking 18 credits (6 credits at a graduate level) and studying for the GRE. I’m tired. I’m so tired. \n\nAnyone else have profs that are only opening discussion boards for 2-3 days. One of my classes has the discussion boards open on Fridays, and we need to make our first post by 8pm Friday night. Except I work 8 hours on Fridays and I can’t pre-write the discussion posts because I don’t know the topic ahead of time.",
      "author": "HighlyPolitical16",
      "created": 1600018142,
      "upvotes": 3,
      "replies": {}
    },
    "g54tw37": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54tw37/",
      "text": "Honestly, after high school the weekends don't mean the same anymore. Since my week is completely open and I can schedule it however I want, the weekdays are more of a weekend to me having both school and work (not a 9-5).",
      "author": "UpbeatFaithlessness6",
      "created": 1600017617,
      "upvotes": 4,
      "replies": {}
    },
    "g54shtq": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54shtq/",
      "text": "If I have something due on Friday I always try to turn it in Thursday so that way Friday all I have to do is go to classes and then I purposely don’t do homework or think about classes the rest of the day so I can have a break and can refresh my mind before the weekend. Because I do like to focus either on a Saturday or Sunday and just get all the homework done so, just taking Friday night off really really helps.",
      "author": "cottageoceanstoner",
      "created": 1600017097,
      "upvotes": 1,
      "replies": {}
    },
    "g54s849": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54s849/",
      "text": "This is my 3rd year at university. Normally I take 17 units a semester in person. I was signed up to take 17 units this semester but dropped a 2 unit class the 2nd week when I realized how challenging distance learning was going to be. I’m only taking 15 units and have absolutely no school-life balance. I know 15 units is “full-time”, but putting 9+ hours in Sunday through Saturday is not how 15 undergrad units is supposed to be. Distance learning is exhausting. Every week i’m learning a little more how to manage distance learning, and I adjust. I know I am adapting & one day i’ll achieve a balance. So far I haven’t missed an assignment and my grade average is an A. But again, no life just school. First round of exams are next week. Not sure how i’ll fit extra “study” time into my schedule without losing sleep, but I will figure it out. All in all, distance learning blows.",
      "author": "any1thinkofthis",
      "created": 1600017002,
      "upvotes": 3,
      "replies": {}
    },
    "g54ry1s": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54ry1s/",
      "text": "I feel you. I haven't had a free day since the semester started. I used to always take atleast Sunday off when classes were in person. Now that I am doing an nternship and taking classes online things have been much different. I feel like they have raised the coursework this semester. This weekend I decided I am going to take a day off anyway because I feel so burntout, I advise you should too :)",
      "author": "humansaremeh",
      "created": 1600016900,
      "upvotes": 1,
      "replies": {}
    },
    "g54kzy7": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54kzy7/",
      "text": "Online classes have gotten to a point for me where I have to work a significant portion of each day to finish everything and I’m getting sick of it",
      "author": "LobstrPrty",
      "created": 1600014001,
      "upvotes": 2,
      "replies": {}
    },
    "g54jose": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54jose/",
      "text": "attending class via zoom from my bedroom is really screwing me up rn there is no school life/home life balance anymore",
      "author": null,
      "created": 1600013455,
      "upvotes": 3,
      "replies": {}
    },
    "g54jg9z": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54jg9z/",
      "text": "Yep. Even though I love my weekends to study, it now feels like an obligation",
      "author": "iloveyou1220",
      "created": 1600013340,
      "upvotes": 1,
      "replies": {}
    },
    "g54fqkw": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54fqkw/",
      "text": "I have weekly tests for 2 of my 3 courses for the quarter. I have no weekends, it always feels like im playing catch up with the schedule",
      "author": "RonKosova",
      "created": 1600011717,
      "upvotes": 1,
      "replies": {}
    },
    "g54d2n6": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54d2n6/",
      "text": "Fuck yes. I took last Saturday off and boy did I pay the price on Tuesday. Spent 7 hours trying to finish my homework. To top it all, I start working this week. Don't know how am gonna do it.",
      "author": "huey764",
      "created": 1600010349,
      "upvotes": 3,
      "replies": {}
    },
    "g54bwsj": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54bwsj/",
      "text": "My day off from online class is Thursday, maybe Friday as well. Just how it came. Luckily, class sends in 3 weeks.",
      "author": "tillD2t",
      "created": 1600009801,
      "upvotes": 1,
      "replies": {}
    },
    "g54ar5c": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54ar5c/",
      "text": "I felt like that even when we had in person classes",
      "author": "JessicaMurawski",
      "created": 1600009292,
      "upvotes": 3,
      "replies": {}
    },
    "g547kwb": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g547kwb/",
      "text": "I remember working on school work through weekends pre-covid/online classes. The only day I really got off from school work was Friday because I made sure to deliberately take that day off for myself no matter what. So unless I took really difficult or more time consuming than regular classes (I don’t think that’s the case lol), doing school work on Saturday + Sunday is fairly normal in college.",
      "author": "wierdfool5",
      "created": 1600008154,
      "upvotes": 1,
      "replies": {}
    },
    "g546tg4": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g546tg4/",
      "text": "i have assignments due almost every day, and i always feel guilty taking a day off, so i just... don't. i do try to keep evenings free to chill tf out but that doesn't always work out either",
      "author": "decafsucks",
      "created": 1600007864,
      "upvotes": 2,
      "replies": {}
    },
    "g5464l6": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5464l6/",
      "text": "Man, I haven't enjoyed a Saturday since I was twelve years old and began working full-time on weekends, lol. I also recently took a break from religion so my Saturdays went from Shabbat traditions to reading Geography journals and writing argumentative essays with the information therein.",
      "author": "AnothaCuppa",
      "created": 1600007611,
      "upvotes": 3,
      "replies": {}
    },
    "g544hui": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g544hui/",
      "text": "Our saturday holidays have been cancelled this semester, so theres only sunday to rest, enjoy and catch up on pending tasks/revision. 7 hour screen time daily is too exhausting!",
      "author": "just_abhi99",
      "created": 1600006984,
      "upvotes": 3,
      "replies": {}
    },
    "g5445l3": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5445l3/",
      "text": "Yeah, like why does it feel like if I stop for one day, I completely feel left behind and have to play catch-up? It's frustrating.",
      "author": "KaiserWilhelmDaThird",
      "created": 1600006855,
      "upvotes": 2,
      "replies": {}
    },
    "g542yvt": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g542yvt/",
      "text": "I had family come in town that I hadn’t seen in years, including my 89 year old great aunt. I did all my work by Friday so we could spend the weekend with them. Saturday one of my professors decided to post an assignment at 11 am that was due by 11pm the same day. We had gone out to the cabin they rented, so no internet. The ONE day I wanted to take Saturday off, it dropped my grade by almost a whole letter (our homework in this class is weighted very heavy to make up for online lecture). I’m pissed.",
      "author": "_Conservative_Hippy_",
      "created": 1600006395,
      "upvotes": 2,
      "replies": {}
    },
    "g53yeny": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53yeny/",
      "text": "Oh yeah weekends have always been my catch up days 😩",
      "author": "crystalliite",
      "created": 1600004727,
      "upvotes": 2,
      "replies": {}
    },
    "g53wzrj": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53wzrj/",
      "text": "I have zoom calls for my classes scheduled on Saturday. The professor says we have Sunday off but he schedules a quiz for Monday on the material we learned on Saturday so...",
      "author": "37scrub",
      "created": 1600004309,
      "upvotes": 6,
      "replies": {}
    },
    "g53vz64": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53vz64/",
      "text": "Since my school is doing all online my profs have decided that since everything is online, they can ask us for assignments on the weekend. So I have classes and everything that goes with it during the week and then even more projects due on Saturday and Sunday, and on labour day last week. It fucking sucks dude I have no free time anymore.",
      "author": "ThatUsernameTho333",
      "created": 1600004058,
      "upvotes": 1,
      "replies": {}
    },
    "g53se25": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53se25/",
      "text": "Just had my first Saturday class yesterday and it’s dreadful. I’ll be having the same 3 classes in just 4 days when Monday starts. It’s hard to relax as now I have to prepare for Monday and I’m getting overwhelmed.",
      "author": "munderhill22",
      "created": 1600002757,
      "upvotes": 2,
      "replies": {
        "g540c60": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g540c60/",
          "text": "Your first problem was taking a Saturday class...I guess it’s alright with this pandemic tho lol.",
          "author": "ZMAC698",
          "created": 1600005450,
          "upvotes": 1,
          "replies": {
            "g5439ob": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5439ob/",
              "text": "The Saturday classes are school wide so that we are able to end the semester before Thanksgiving. I had no choice in any of it and if I did I wouldn’t have chosen this as an option.",
              "author": "munderhill22",
              "created": 1600006501,
              "upvotes": 3,
              "replies": {
                "g545181": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g545181/",
                  "text": "Shittt knowing that I’d prefer to do it lol. Ending before thanksgiving would be dope. Hopefully get a job after the new year and boom graduation ain’t too shabby haha.",
                  "author": "ZMAC698",
                  "created": 1600007194,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g53qrzd": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53qrzd/",
      "text": "All my stuff is due on Tuesday, Friday, or Sunday. I sleep or whatever on Monday and maybe Saturday, then spend the rest of the week trying to rush through whatever bullshit my professors have me doing. I’ve been sitting here staring at my computer for hours trying to figure out this program for computer science because we literally get no real direction. Some unrelated examples using specific parts of the program to do something else maybe but I can’t connect it. I want to be in the classroom again with lectures and notes instead of a stack of textbooks and a list of assignments.",
      "author": null,
      "created": 1600002174,
      "upvotes": 3,
      "replies": {}
    },
    "g53nc7q": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53nc7q/",
      "text": "It's not just an online class thing, it's a college thing. Don't get me wrong, there's a lot I don't like about online/remote learning, but at the same time, I feel like people are using it as a scapegoat a lot.\n\nBefore, you knew if you didn't show up to a lecture, that was it. You either had to email the professor to see if they could catch you up, text your friends to ask what you missed, or just try to read the textbook and figure it out on your own.\n\nNow, with classes all being recorded, people feel like they have the freedom of missing classes, because \"oh it's just one lecture, I can watch it some other time\". Then come the weekend, they realize they have 16 hours of lectures to go through because of their mismanagement, and then go and blame it on online learning ruining their weekends.\n\nBefore you felt like if you missed a deadline for a homework assignment, that was it, your grade was down the toilet. Now, because of COVID, professors are (understandably) more open to deadline extensions, but that also gives a lot of us that false sense of security of \"oh well I can wait to do this cuz I can just ask for an extension.\" \n\nThose are just 2 examples of how it's less of an \"online classes bad\" narrative and more of a \"I'm mismanaging my time\" problem. Once again, not saying that there's nothing wrong w/ online learning (some professors feel the need to assign way more work purely because everything's online, for example), but having to do work on the weekends is 100% not an online classes thing, it's a college thing, and I'm sorry if I'm breaking any hearts here, but it's a life thing as well.",
      "author": "ZachTheYek",
      "created": 1600001080,
      "upvotes": 5,
      "replies": {
        "g54blrm": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54blrm/",
          "text": "Perhaps having to do work on weekends is just the reality of life, but it’s definitely not always because of mismanaging time. I’ve been doing school or work basically non-stop each weekday from 9am to at least 10pm... I don’t think it can be blamed on time mismanagement if I’ve used all my time towards it and still have more to do on the weekends. However, I do recognize that I’ve always done homework on weekends. Just maybe not this much.\n\nEdit: typos",
          "author": "rbetters",
          "created": 1600009662,
          "upvotes": 8,
          "replies": {
            "g54coby": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54coby/",
              "text": "Perhaps you just took on too many responsibilities/too high of a workload; perhaps your classes got harder and now you have to work for longer; perhaps you've been slacking and are too afraid/ashamed to admit it. All these factors (and many more) go into determining if the \"online classes bad\" narrative is true or not.   \n\nThere are way too many factors at play here to blame it solely on online classes. If (and only if) you've had the exact same workload for an extended period of time pre and post online classes, and that you've observed your time spent studying and working go up to the point where you're forced to work overtime (i.e. on weekends), can you conclude that it's because of online classes.\n\nThe point I'm making isn't that people work on weekends because they've mismanaged their time, it's that online classes provide students with the fallacy that they can afford to mismanage their time, only to come to the realization that they actually can't, and thus being \"forced\" to work weekends when they otherwise would have relaxed.\n\nWhether or not working on weekends is right or not is a whole other conversation, but the one we're having right now is that \"online classes are the reason why we have to work on weekends\", which I find to be completely false.",
              "author": "ZachTheYek",
              "created": 1600010155,
              "upvotes": 2,
              "replies": {
                "g54ds7a": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54ds7a/",
                  "text": "That’s completely fair, and I apologize for going somewhat off-topic. I just wanted to put it out there that time mismanagement may not always be the culprit for weekend work; however, online classes may not be the reason either.",
                  "author": "rbetters",
                  "created": 1600010712,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "g55tj6r": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55tj6r/",
          "text": "I don’t have any previous experiences of non online college, so maybe take this with a grain of salt, but the main problem with me is that theres so much stuff due on the weekends that I think was originally due the following Monday or Tuesday, meaning not only do we have the normal homework on the weekends, we also have tests and quizzes and whatnot. \n\nAlso lots of profs make it really hard to keep up with assignments because they don’t communicate it well, and post them in a way they don’t show up on the calendar of the website my school uses. \n\nIm usually not the person to wait till the day before due dates to start assignments. I spent all highschool working to achieve that, but now I have to, because several different reasons that are direct results of classes going online.\n\nTheres also the fact that hanging out with friends at school gives you a little break, and now you don’t have that little respite.",
          "author": "deprimada",
          "created": 1600030456,
          "upvotes": 2,
          "replies": {
            "g569bi6": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g569bi6/",
              "text": "To answer your first point, due dates are (from my experience) usually set on either Fridays at 11.59pm, or Sundays at 11.59pm, even when classes were fully in person. Unless the professor assigns a quiz that opens on Friday night and is due on Sunday night (which also happens during normal classes), that's kinda a mute point tbh.\n\nThe second point I can agree with you on, especially when you have an older, less tech savvy professor teaching online, it can be a pain to deal with. But imo, that's more of a professor problem and not a \"online classes create more work on weekends\" problem. Yes online classes exacerbates those professors' weaknesses, but to blame the extra work on the umbrella of online classes is just plain wrong.\n\nTo your last point, hanging out with friends isn't inherently a bad thing, but are you tryna argue that hanging out with friends helps you not have work on the weekends? Because if so, that's some bs right there 😂",
              "author": "ZachTheYek",
              "created": 1600036859,
              "upvotes": 2,
              "replies": {
                "g56cfj7": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g56cfj7/",
                  "text": "Your school works differently than mine. (Also my 3rd paragraph had nothing to do with my second, which, sorry if it wasn’t clear) My last point was the bit of socialization you get while on campus and before and after class helps keeps me sane, as a little respite from the constant work load. However thats not really an option now, obviously. I literally have 0 friends and that shit is really not helping my sanity now.",
                  "author": "deprimada",
                  "created": 1600037953,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g541fnc": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g541fnc/",
          "text": "Yep. Sunday deadlines are there to help students catch up, but if students are catching up on material first, then HW gets pushed back even later. Keeping schedule for learning content is the key to having free time on weekend.",
          "author": null,
          "created": 1600005798,
          "upvotes": 2,
          "replies": {}
        },
        "g545fgy": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g545fgy/",
          "text": "You'll probably get downvoted but this is real talk. Even if the due dates were all Wednesdays, people would just wait until the day before to get started. Unfortunately the pandemic is causing everyone to get a real harsh lesson on time management.",
          "author": "bungchiwow",
          "created": 1600007345,
          "upvotes": 2,
          "replies": {}
        },
        "g56e49v": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g56e49v/",
          "text": "None of my professors upload their lectures. If you miss a real-time-remote class, you miss all of the content for that day. I've always gotten As in my in-person and asynchronous online classes, this semester is a legit struggle. I wouldn't be so quick to discount everyone. This semester is hard. My time management skills haven't changed at all, if anhthing they are better than they were when I worked 45 hours a week and did online classes. Instead of lectures there is a lot more zoom group work where nothing gets done, or it is redundant, and then there are mini lectures to watch before class (two to four 3-5 minute videos) because my professors dont like lecturing on zoom (their words, not mine). My professors maybe spend twenty minutes lecturing before telling us to discuss our (usually already  completed) homework assignments with our small groups. I honestly feel like my zoom classes take up too much valuable time to do assignments and readings. I would much rather be doing my actual work than spending 6 hours a day watching professors struggle to use technology and discuss already completed assignments with 2-3 other classmates who probably didn't even do the work.",
          "author": null,
          "created": 1600038899,
          "upvotes": 1,
          "replies": {}
        },
        "g54q8v8": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54q8v8/",
          "text": "when we were in-person almost all of my assignments were due on the day of class (even if they were turned in online) and I would have at most 1 or 2 long-term things over the weekend. There is literally no reason why professors can’t make things due online during the week.",
          "author": null,
          "created": 1600016212,
          "upvotes": 0,
          "replies": {
            "g54wkpo": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54wkpo/",
              "text": "There is also no reason why you couldn't work on it during the week, despite it being due on the weekend? \n\nLet's be honest here m8, it doesn't matter when professors set the due dates, students are gonna procrastinate regardless. COVID and remote learning has just finally given students an excuse to ask for deadline extensions without coming off as lazy.\n\nOnce again, blaming you having to work on weekends on online classes and remote learning is just plain wrong.",
              "author": "ZachTheYek",
              "created": 1600018610,
              "upvotes": 0,
              "replies": {
                "g5580lc": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5580lc/",
                  "text": "I haven’t been asking anyone for extensions. What I have been doing, however is listening to other people and comparing my current schedule to past schedules. Being good at discussion posts and filling out forms every day before 11:59 PM does not make you a smart person. Get off your high horse.",
                  "author": null,
                  "created": 1600022746,
                  "upvotes": 1,
                  "replies": {
                    "g55duux": {
                      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55duux/",
                      "text": "Anecdotal evidence is the lowest tier of evidence ;)",
                      "author": "ZachTheYek",
                      "created": 1600024563,
                      "upvotes": -1,
                      "replies": {
                        "g55jxos": {
                          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55jxos/",
                          "text": "And this isn't a peer reviewed journal anyways. Just giving my two cents like literally everyone else on this site. If you want to virtue signal this hard go back to twitter",
                          "author": null,
                          "created": 1600026566,
                          "upvotes": 1,
                          "replies": {
                            "g55krn7": {
                              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55krn7/",
                              "text": "I see what you're tryna say, but do try to understand my stance on your 2 cents: I don't give a damn about your 2 cents lol",
                              "author": "ZachTheYek",
                              "created": 1600026885,
                              "upvotes": -1,
                              "replies": {
                                "g55lj99": {
                                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55lj99/",
                                  "text": "Then we can agree to disagree, and in the future you can learn how to discuss things with people you disagree with like a civilized human being.",
                                  "author": null,
                                  "created": 1600027183,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g53cz8w": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53cz8w/",
      "text": "Not really. I start classes on monday and then marathon all my work that day since my teachers usually give me all the work I need to do on monday. If I don't finish it monday, then I have tuesday and Wednesday to do it. This is all with working 4 hour days at my job on each weekday, then 12 hour workday on friday. Then i usually have Saturday and Sunday off. It's all about marathoning and suffering the fewest days you can to have fun the rest of the days.",
      "author": "Linkster9",
      "created": 1599997473,
      "upvotes": 1,
      "replies": {
        "g55vmu0": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55vmu0/",
          "text": "Not all teachers give you the work you need ahead of time sadly. Although I’ve been working towards doing that as best I can as well.",
          "author": "deprimada",
          "created": 1600031421,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g52xu1o": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52xu1o/",
      "text": "Every prof thinks since we're \"just sitting at home\" we can do all the assignments plus some more. Any objection and they say \"What else you gotta do now?\"",
      "author": "Penis_popper",
      "created": 1599991101,
      "upvotes": 62,
      "replies": {
        "g54xzlz": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54xzlz/",
          "text": "Does every professor think they're the only one to have the idea to increase workload???? \"No, the history department would never do that so we, the math department, will!\" except everyone's doing it and students are drowning.",
          "author": "uraniumstingray",
          "created": 1600019149,
          "upvotes": 10,
          "replies": {
            "g558m5y": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g558m5y/",
              "text": "It’s not even meaningful work either, my homework has gone from actual practice problems/worksheets (which we used to scan and email to the professor anyways) to 5 different “DID YOU WATCH THE VIDEO” quizzes throughout the week. At least readings haven’t changed",
              "author": null,
              "created": 1600022940,
              "upvotes": 8,
              "replies": {
                "g55rax0": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55rax0/",
                  "text": "Oh my gosh all the small extra \"did you watch the video??\" quizzes and stuff are killing me. They really add up between classes time-wise and are nothing but busywork that contributes to nothing learning-wise.",
                  "author": null,
                  "created": 1600029469,
                  "upvotes": 4,
                  "replies": {
                    "g5tefzr": {
                      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5tefzr/",
                      "text": "It's because of you dont do those, most students dont watch the videos",
                      "author": "jeffp12",
                      "created": 1600524561,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "g57aq2i": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g57aq2i/",
                  "text": "In my calc2 class this is literally every section along with time management quizzes.",
                  "author": "moderatef",
                  "created": 1600058751,
                  "upvotes": 2,
                  "replies": {}
                },
                "g55tunk": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55tunk/",
                  "text": "So many \"Did you watch the video/read the article\" assignments. I'm about to lose my mind.",
                  "author": "uraniumstingray",
                  "created": 1600030600,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "g53tdug": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53tdug/",
          "text": "If that's actually the case with some instructors, which idk if it is, then exploit the hell out of the current situation imo. Most instructors have been told to be very understanding this semester. Fuck their due dates and let them do all their paperwork and grading a few days before the semester ends.",
          "author": "team_sita",
          "created": 1600003118,
          "upvotes": 5,
          "replies": {
            "g540c25": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g540c25/",
              "text": "Very understanding does not equal accepting missed deadlines. Every prof who uploaded HW or assignment at least 3 days in advance (and typically in mine they are available at the beginning of the semester or a good week ahead) will just assign zero and move on.",
              "author": null,
              "created": 1600005449,
              "upvotes": 18,
              "replies": {
                "g54clex": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54clex/",
                  "text": "I had a professor post the work we had to do for the week on Thursday. We were supposed to get it done by Friday 🤦🏼‍♀️",
                  "author": "Canadia_213",
                  "created": 1600010117,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g52s7d5": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52s7d5/",
      "text": "my weekends now have no meaning :( they just feel like a regular weekday",
      "author": "jja_02",
      "created": 1599988780,
      "upvotes": 19,
      "replies": {}
    },
    "g52iu86": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52iu86/",
      "text": "didnt know other people were feeling like this too! \n\ni just started doing all my hw for the next class/week during lectures and primarily mon-tue-wed so that thur/fri is more chill and weekends are free. its honestly hell but I think it’s worth it (otherwise I would literally die.,, not even joking)... but I still feel like I risk missing assignment due dates 🤯",
      "author": "pechecerise",
      "created": 1599985036,
      "upvotes": 13,
      "replies": {}
    },
    "g52iq3x": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52iq3x/",
      "text": "definitely, i have assignments for 3 of my classes due on sundays and sometimes i have saturday classes so i’m literally always working, plus all our vacations have been cancelled so we don’t get any days off outside of weekends ://",
      "author": "buggie321",
      "created": 1599984981,
      "upvotes": 10,
      "replies": {}
    },
    "g52fxdj": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52fxdj/",
      "text": "Yup, and Sunday",
      "author": "trippyequid",
      "created": 1599983835,
      "upvotes": 2,
      "replies": {}
    },
    "g52fn8q": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52fn8q/",
      "text": "Professor here.... yeah, I feel you. I’ve worked 7 days a week since March (with a few days I forced myself to stay away from the computer).",
      "author": "Nerobus",
      "created": 1599983707,
      "upvotes": 3,
      "replies": {}
    },
    "g529wra": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g529wra/",
      "text": "day off is basically non-existent here in my time at uni. online classes or otherwise. but i do have a couple of hours to dick around like here I am at reddit again lol",
      "author": "Hold0",
      "created": 1599981528,
      "upvotes": 10,
      "replies": {}
    },
    "g5282py": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5282py/",
      "text": "I feel happy to get a few hours a week to chill. But there’s definitely not a day I can do nothing anymore :(",
      "author": "psychcrime",
      "created": 1599980895,
      "upvotes": 6,
      "replies": {}
    },
    "g5241ad": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5241ad/",
      "text": "i just never stop. I smartly decided to take 5 classes for 18 credits. there are no days off. im dying already.",
      "author": "hardboiledegg69",
      "created": 1599979066,
      "upvotes": 102,
      "replies": {
        "g52io92": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52io92/",
          "text": "Dude I understand how you feel. Dam 18 credits!? I'm taking 6 courses and yet it's only 16 credits. I feel bad for your chief. But we must survive✊",
          "author": "Deathstroke12420",
          "created": 1599984960,
          "upvotes": 46,
          "replies": {
            "g55jsa3": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55jsa3/",
              "text": "Hell I was taking 16 credits and had to drop to 13 because 16 was too much",
              "author": "KING_COVID",
              "created": 1600026510,
              "upvotes": 3,
              "replies": {}
            },
            "g55le1k": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55le1k/",
              "text": "Are two lecture / lab splits cause i think those technically can be considered 1 class.",
              "author": "Alaskan_Narwhal",
              "created": 1600027127,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g53zwa0": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53zwa0/",
          "text": "Drop a course. Don’t hate your life.",
          "author": null,
          "created": 1600005292,
          "upvotes": 20,
          "replies": {
            "g56bifr": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g56bifr/",
              "text": "Honestly i'm think i'm going to do so",
              "author": "Deathstroke12420",
              "created": 1600037602,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g5456zo": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5456zo/",
          "text": "I'm doing 6 courses for 18 credits!! Good luck :( my classes start tomorrow and reading this thread makes me terrified",
          "author": "dummybug",
          "created": 1600007258,
          "upvotes": 7,
          "replies": {}
        },
        "g54d2bs": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54d2bs/",
          "text": "Damn dude, the only way I could even consider 5 courses was if I quit my job, and I only work saturday and sunday night.",
          "author": "swift-lizard",
          "created": 1600010344,
          "upvotes": 6,
          "replies": {}
        },
        "g55f6px": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55f6px/",
          "text": "I feel this! Even when classes were in person, I took 17 hours one semester and about died! I got through it though so there is a light on the other side of the tunnel! Just keep going you got this!!",
          "author": "Khunte99",
          "created": 1600025010,
          "upvotes": 2,
          "replies": {
            "g55l2q5": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55l2q5/",
              "text": "i might drop my art history class. its so much reading and a surprising amount of writing i wasnt expecting. on top of that im taking bio precalc c++ and spanish i think i need to drop one im worried about sinking my gpa",
              "author": "hardboiledegg69",
              "created": 1600027003,
              "upvotes": 1,
              "replies": {
                "g570eki": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g570eki/",
                  "text": "Oh yeah I took art history... that was a lot of reading and writing you’re not wrong. Kinda gives you perspective that a lot of majors aren’t all easy as they seem. But those are really tough classes. My advice would be to section out your workweek with goals based upon what is due. And start studying 3 weeks before tests because that helped me get ready for my tests especially with other work I had to do and sometimes you may get 4 hours a week of studying for that test but it all adds up in the end and then you’re doing review. Outlines also are helpful. Precalc is all about doing a solid hour or 2 a day of practice problems (I’ve done all classes up to calc 2 and have found this is the best approach to math). The organic chem professor and Kara king math (I think is her name) are great videos to help you. Bio i would say your best bet is to make an outine of your notes putting in blank spaces (fill in the blanks) for definitions or words so that you’re actively studying while filling out your outline. There’s also videos for processes you can watch to help you understand stuff like glycolysis. Spanish, I would recommend practice problems (there’s a site that’s really helpful but I can’t recall the name but it has a red and beige color background that’s all I can remember) and also watching Spanish videos (there’s gringo Spanish and senor James or something Spanish videos. He’s really helpful and has practice at the end with songs too). I made an A in art history through extra credit so if your prof gives you that option def look into it, but the tricky thing about art history is that your prof has a level of what they think is sufficient and they don’t really help you improve upon that (mine didn’t really. Would look at advice, do that, and it would STILL be missing something). I have dropped 2 classes my entire time in undergrad and I haven’t been upset about them. I will say, one semester I ended up making a C in gen chem 2 because I had a similar load to you, I also ended up having to go to the hospital for medical issues right before my final so that sucked... but I got through it. If I could go back, I would’ve dropped another class though to free up time to study for that class (I had bio, bio lab, calc 2, English, gen chem 2 and lab, and martial arts. I ended up dropping martial arts, but should have also dropped bio 1 because that’s a lot of reading on top of my English reading. I would be behind but I would’ve made an A or a B in gen chem had I had more time to study). It’s really up to you though, but I hope this helped and I do truly wish you the best!",
                  "author": "Khunte99",
                  "created": 1600051732,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g5209wq": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5209wq/",
      "text": "I always have assignments due on Sunday. And I'm not taking online I'm taking remote...",
      "author": "aguafreska",
      "created": 1599977565,
      "upvotes": 4,
      "replies": {
        "g53wdbe": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53wdbe/",
          "text": "What's the difference between online and remote?",
          "author": "soappiehome",
          "created": 1600004167,
          "upvotes": 4,
          "replies": {
            "g54cwor": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54cwor/",
              "text": "I think remote means that they’re are still lessons on zoom and stuff and online is just the traditional online courses you would have pre-corona",
              "author": "Canadia_213",
              "created": 1600010267,
              "upvotes": 8,
              "replies": {}
            },
            "g5513hj": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5513hj/",
              "text": "Online : \n\n-you never meet with instructor\n\n-online classes were available before covid-19 \n\nRemote : \n\n-the full name is Emergency Remote Teaching\n\n-you meet with instructors through something like zoom\nOn the days when you would normally have class\n\n\nI specified that they're remote not online because before covid-19 , it would not be possible for an instructor to make assignments be due on Sunday since we can only turn things in on the days that we go to class, unless the class consisted of partial online work.",
              "author": "aguafreska",
              "created": 1600020319,
              "upvotes": 2,
              "replies": {
                "g551xn8": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g551xn8/",
                  "text": "Interesting, I have always turned in most of my assignments online in college, even when we had in-person learning, so I've always had assignments due on Sundays or on days of the week we might not have had class.",
                  "author": "soappiehome",
                  "created": 1600020644,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g51rk1a": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g51rk1a/",
      "text": "yes! I have one class where our Zoom classes are scheduled on Saturday mornings and another that has everything due on Sundays. i’ve done online classes pre-covid and they just seem to be structured in a way where weekends are not a consideration in the same way that they are for in person classes. it’s honestly so draining.",
      "author": null,
      "created": 1599974153,
      "upvotes": 33,
      "replies": {}
    },
    "g51aa1t": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g51aa1t/",
      "text": "I do school 4 days in a row, work three days in a row and do school after work. My breaks are eating, showering and when my brain is so fuzzy even watching TV is too intricate for it to process.",
      "author": "Bodidiva",
      "created": 1599968745,
      "upvotes": 74,
      "replies": {
        "g64g781": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g64g781/",
          "text": "That’s my exact situation, work Friday Saturday Sunday and can barely keep up with my classes. I’m so tired and my grades are bad also. It’s like a lose lose scenario where I spend all my time studying and I still am falling behind and getting bad grades. I’m so tired",
          "author": "KamikazeAlpaca1",
          "created": 1600708326,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g517si0": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g517si0/",
      "text": "My schedule for this entire semester is work work work 7 days a week. Everyday there’s something I have to do that it school related and it’s usually something that requires lots of effort to even get done. No break days at all this semester.",
      "author": "moonsunbaenim",
      "created": 1599967606,
      "upvotes": 204,
      "replies": {
        "g54p4rb": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54p4rb/",
          "text": "No break days, I have something due every single day too except Mondays when I usually need to go in person for a class. There’s no breaks every other month which the thought alone is killing me because I ALWAYS get exhausted around the 5 week mark as it approaches time for break but it’s 5 week mark and no break is coming for two months. How this is affecting college students emotionally doesn’t seem to matter.",
          "author": "Dansii",
          "created": 1600015701,
          "upvotes": 34,
          "replies": {
            "g54xrlt": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54xrlt/",
              "text": "I just had the same thought the other day. The midterm is usually when I'm burning out and need a break but we don't get anything this semester so we can be done a week earlier than usual and I don't know how I'm going to make it.",
              "author": "uraniumstingray",
              "created": 1600019067,
              "upvotes": 7,
              "replies": {
                "g55hhhk": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55hhhk/",
                  "text": "I usually get an October break before my thanksgiving break but my year started earlier this semester plus I do schoolwork everyday this week now. I’m sorry, it sucks so bad. I’m glad there’s other people who understand what we’re all going through. This is the hardest part of my college experience by far.",
                  "author": "Dansii",
                  "created": 1600025733,
                  "upvotes": 3,
                  "replies": {
                    "g55tq7g": {
                      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55tq7g/",
                      "text": "I usually do to but they got rid of it so we can go home a week earlier in December to minimize the number of times we're able to travel but the people who live in the apartment below me have had a party every single night this week so it's not like people are isolating and social distancing",
                      "author": "uraniumstingray",
                      "created": 1600030544,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g54or2g": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54or2g/",
          "text": "Same here. 2 jobs and 13 credits this semester",
          "author": "forthe_loveof_grapes",
          "created": 1600015534,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g517ajv": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g517ajv/",
      "text": "Uhh... I don't even get Sunday off from schoolwork :(",
      "author": "SanjivanM",
      "created": 1599967285,
      "upvotes": 53,
      "replies": {
        "g52frjt": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52frjt/",
          "text": "me neither bro",
          "author": null,
          "created": 1599983760,
          "upvotes": 8,
          "replies": {}
        },
        "g52if8t": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52if8t/",
          "text": "Same brother.",
          "author": "Deathstroke12420",
          "created": 1599984851,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g514q3n": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g514q3n/",
      "text": "In case any of ya'll are thinking of becoming a teacher (college or otherwise), I don't think there's been a week in the last 6 years where I haven't had to grade/lesson plan on a weekend or use at least one weeknight for the same.\n\nI lesson planned/put shit on the LMS for 8 hours today. I'll do another 3 tomorrow, then go to a 4-hour required meeting for the writing center where I work.\n\nI wouldn't recommend it!\n\nP.S. Is UIC in your tag UIC in Chicago? I taught there for a term.",
      "author": "brownidegurl",
      "created": 1599966249,
      "upvotes": 24,
      "replies": {}
    },
    "g50kwsm": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g50kwsm/",
      "text": "Had 3 classes today... so yeah :(",
      "author": "SACRED_SNAIL",
      "created": 1599960110,
      "upvotes": 17,
      "replies": {}
    },
    "g4ztrp6": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4ztrp6/",
      "text": "for me almost everything is due on monday or friday so now my weekend is tuesday-wednesday.",
      "author": null,
      "created": 1599951112,
      "upvotes": 440,
      "replies": {
        "g53ki5i": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53ki5i/",
          "text": "All my assignments are due Saturday and Sunday which I think is the most unfair thing because my weekends should be mine",
          "author": "__hi__friends",
          "created": 1600000187,
          "upvotes": 167,
          "replies": {
            "g53xzei": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53xzei/",
              "text": "Couldn't you just turn it in on Friday?",
              "author": "KnoxButler",
              "created": 1600004593,
              "upvotes": 72,
              "replies": {
                "g5d31fs": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5d31fs/",
                  "text": "I try to when I can! It's just been so difficult trying to balance all these classes online, watch all the lectures, do homework, and then quizzes. Slowly but surely getting the hang of it.",
                  "author": "__hi__friends",
                  "created": 1600182935,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g53zrfz": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53zrfz/",
              "text": "Do them by Friday.",
              "author": null,
              "created": 1600005248,
              "upvotes": 64,
              "replies": {}
            },
            "g53worp": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53worp/",
              "text": "Oh my god me too, my profs decided to just add assignments and projects due on the weekend since it’s all online and “we don’t have to be in person to hand things in anymore”",
              "author": "ThatUsernameTho333",
              "created": 1600004223,
              "upvotes": 51,
              "replies": {}
            },
            "g54d5yx": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54d5yx/",
              "text": "[deleted]",
              "author": null,
              "created": 1600010397,
              "upvotes": 23,
              "replies": {
                "g54pdc7": {
                  "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54pdc7/",
                  "text": "This should be against college policy everywhere",
                  "author": "warrior15678",
                  "created": 1600015809,
                  "upvotes": 16,
                  "replies": {}
                }
              }
            }
          }
        },
        "g5318vb": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5318vb/",
          "text": "this.",
          "author": "iamfearformylife",
          "created": 1599992574,
          "upvotes": 12,
          "replies": {}
        },
        "g54de0w": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54de0w/",
          "text": "Yup same",
          "author": "MyLike4thAccount",
          "created": 1600010514,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4ztddh": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4ztddh/",
      "text": "I never had a Saturday off from anything the whole time I was in school pre-corona because of work.  I took a mix of online and on-campus classes.  If you don't want to overload yourself on certain days, Saturdays are just another day.",
      "author": "xmarketladyx",
      "created": 1599951049,
      "upvotes": 41,
      "replies": {}
    },
    "g4zr0ko": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4zr0ko/",
      "text": "Posting this to procrastinate on an essay I'm in the middle of writing, due tomorrow for an online class :( lol",
      "author": "jiyaski",
      "created": 1599950301,
      "upvotes": 69,
      "replies": {
        "g550x7v": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g550x7v/",
          "text": "Did you finish the essay by now ? How was it?",
          "author": "NikitaStudCoach",
          "created": 1600020250,
          "upvotes": 4,
          "replies": {
            "g55c0m2": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55c0m2/",
              "text": "Yep :) Wasn't too bad",
              "author": "jiyaski",
              "created": 1600023989,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "g4zorfq": {
      "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4zorfq/",
      "text": "Yeah.... I haven't had a day off since school started about 4 weeks ago.",
      "author": "vhunter1991",
      "created": 1599949519,
      "upvotes": 449,
      "replies": {
        "g52iaak": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52iaak/",
          "text": "Fuckin same man. It's frustrating but oh well.",
          "author": "Deathstroke12420",
          "created": 1599984794,
          "upvotes": 88,
          "replies": {}
        },
        "g54o8r1": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54o8r1/",
          "text": "Yep. Assignments due every Wednesday and Sunday so constantly working on the weekend and throughout the week. It’s rough.",
          "author": "Danmanjo",
          "created": 1600015308,
          "upvotes": 19,
          "replies": {
            "g54v1wq": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54v1wq/",
              "text": "I was thinking about including one day off every week in my schedule, the best day for that for me would be Tuesday but that day still wouldn't be a true day off because I hold a TA position and I have to at the very least check email and answer questions everyday three to five times a day. It's really tough to take care of yourself and take care of priorities at the same time. And sometimes those questions might take me a little while to figure out because it's a programming class.",
              "author": "vhunter1991",
              "created": 1600018044,
              "upvotes": 8,
              "replies": {}
            },
            "g54wza3": {
              "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54wza3/",
              "text": "Same! I have assignments due Wed, Fri, Sun and I feel like I literally have no time off. I'm going to try to set myself up for a productive week to leave my weekend free but we'll see how well it goes.",
              "author": "uraniumstingray",
              "created": 1600018760,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g5j7rz7": {
          "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5j7rz7/",
          "text": "Same! The best part is when your chem professor forgets to upload the homework on Monday, uploads it on a Friday night but refuses to extend the due date so it’s still due on Sunday. I work 12 hour shifts on the weekend. I’m drowning in work because my professors aren’t organized enough for things to run smoothly.",
          "author": "bananagramxo",
          "created": 1600303797,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634055216
}