{
  "sid": "qcv4ae",
  "link": "/r/college/comments/qcv4ae/trouble_with_grades_need_some_advice/",
  "title:": "Trouble With Grades. Need Some Advice",
  "text": "For some background info I’m a freshman in my first semester of college and this is a course required for my major. I’d have a B right now but I got a 46% on the first exam worth 20% of our grade (studied the wrong info) and my teacher doesn’t drop the lowest test grade so I’m stuck with it. Instead of a B I now have a D and at this point it’s pretty much impossible to bounce back.\n\nI have As in the other 5 classes that I’m taking plus the lab that’s attached to the D Class. \n\nHow much damage will this do to my GPA? Will I be able to recover from the D in future semesters or should I drop the class and try again (I’d have to also take the lab again)?",
  "author": "EdelwoodOil",
  "created": 1634832261,
  "updated": 1634849211,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhi81j9": {
      "link": "/r/college/comments/qcv4ae/trouble_with_grades_need_some_advice/hhi81j9/",
      "text": "You're playing a game of averages. Your best best is to make sure that each assignment going forward is on time and of top quality between now and the end of the term to see if you can increase that D average. Also, reach out to your teacher about options to increase your grade. \n\nYour GPA will be affected *for now* but again, its a game of averages. It's not uncommon for students go fail at least one exam throughout their entire college coursework. If you have an advisor, get with them too about potential remedies or future impacts.\n\nAll is not lost.",
      "author": "BarIntelligent9156",
      "created": 1634832792,
      "upvotes": 3,
      "replies": {}
    },
    "hhijk74": {
      "link": "/r/college/comments/qcv4ae/trouble_with_grades_need_some_advice/hhijk74/",
      "text": "I messed up a class once by mixing up an assignment. Had to re-take it to replace the D, but it was very easy since I had already take it. It sucks, but consider re-taking after finishing the course.",
      "author": "zifmer",
      "created": 1634837325,
      "upvotes": 2,
      "replies": {}
    },
    "hhiy0ae": {
      "link": "/r/college/comments/qcv4ae/trouble_with_grades_need_some_advice/hhiy0ae/",
      "text": "1. Talk with your professor to see what could be done. But do it in person not email. \n2. a D in your first semester is not the end of the world . Especially since you have A’s. If you are thinking of grad school most of the time they focus only on grades from years 2-4.Once more classes are added your GPA will change. Don’t fret over this \n\nAlso, Don’t hold yourself to have a perfect standard you are allowed to fail/do poorly. Take this as a learning opportunity.",
      "author": "jenniferrook9",
      "created": 1634843185,
      "upvotes": 1,
      "replies": {}
    }
  }
}