{
  "sid": "q75slc",
  "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/",
  "title:": "Why do high school teachers act like college is going to be super hard?",
  "text": "In high school, my teachers would give us “college level” assignments that were super hard and told us professors won’t even know you exist.  When in reality, my professors are super nice and understanding, and I barely have homework (Pursuing Aviation Technology).\n\nWhy be misleading?",
  "author": "clon2645",
  "created": 1634109181,
  "updated": 1634167575,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.75,
  "comments": {
    "hggh8st": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hggh8st/",
      "text": "i’m a stem major & high school absolutely did not prepare me for college lol. maybe it was jus my hs, or maybe i have particularly bad professors, or maybe it’s my major, but i am not doing well (i was straight a student all my life, now i’m failing 2 classes)",
      "author": "swagperson5442",
      "created": 1634109729,
      "upvotes": 12,
      "replies": {
        "hggxvhm": {
          "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hggxvhm/",
          "text": "Same. I didn't even learn the basics of chemistry in H.S",
          "author": "TragicalKingdom",
          "created": 1634124073,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hgggub0": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hgggub0/",
      "text": "Maybe because not all majors are the same?",
      "author": "genesisa86",
      "created": 1634109385,
      "upvotes": 19,
      "replies": {
        "hgggwtn": {
          "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hgggwtn/",
          "text": "Additionally, first year gen eds aren't where the difficulty lies in a degree program.",
          "author": "mrbmi513",
          "created": 1634109445,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "hghcxbb": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghcxbb/",
      "text": "Give CS a try and see how you feel after a year then come back to this post.\n\nJust the math requirements alone at my university:\n\n- Calc 1-3\n- Differential Equations \n- Discrete Math\n- Engineering Probability and Statistics\n- Linear Algebra\n- Physics 1-2\n\nThen you have classes like digital systems, computer architecture while at the same time learning languages in different classes like python, java and c. I'm not even looking forward to the data structures and Algorithms class.",
      "author": "ShadowIG",
      "created": 1634132548,
      "upvotes": 6,
      "replies": {
        "hghy0t9": {
          "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghy0t9/",
          "text": "I took almost all of these classes and I agree with OP. Maybe it’s that the pacing is a bit better but college has been much less stressful than high school.",
          "author": "_jaewonjung_",
          "created": 1634141400,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hggut21": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hggut21/",
      "text": "I get the impression from my own anecdotal experience that my AP Teachers were PhD dropouts and went into K-12 Education because what else do you do with a terminal master's in English?\n\n&#x200B;\n\nI feel they were remembering the rigor of Grad School and forgetting that uGrad, you can largely sleep through.",
      "author": "FoxWyrd",
      "created": 1634121789,
      "upvotes": 1,
      "replies": {
        "hghbkcf": {
          "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghbkcf/",
          "text": "It defiantly depends on your major. In STEM, my first two years I was able to take naps, hang with friends, and have a job. Now I spend about 12 hours studying daily.",
          "author": "wickedtacos",
          "created": 1634131897,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hggizuq": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hggizuq/",
      "text": "Education programs (that your teachers were likely in) typically require more content area classes than prospective teachers expect. Many teachers to be start an education degree program expecting to take a lot of classes on how to teach, and those are usually on the easier side but a lot of papers, instead they come to find out they actually have to take college level chemistry or calculus 3, etc. in order to teach their desired subject area. \n\nTeachers to be expect to just retake high school level classes, as that’s what they want to teach. Instead, they are (rightfully) required to take higher level classes as you need to be proficient in the entire subject area, and you must know more beyond what you’re teaching in order to be a successful teacher. This tends to surprise and challenge a lot of teachers. Most teachers weren’t A+ students in high school. They tend to work a bit harder than average and get Bs. Most people become teachers not because school was easy for them, but because it was a good challenge or too challenging and they want to provide better education than they got.\n\nIn short, your teachers are likely talking about their own experience, not the general college experience.  \n\nAlso, grade inflation has become more and more prevalent in the last 10+ years, so in some senses, college grading may be a tad easier now than it was when your teacher went to college.",
      "author": "IceRose39",
      "created": 1634111314,
      "upvotes": 1,
      "replies": {}
    },
    "hggp40z": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hggp40z/",
      "text": "Considering I did around 40 homeworks my third semester, I can safely say that not all shools are the same.",
      "author": "dumb_blonde_engineer",
      "created": 1634117060,
      "upvotes": 1,
      "replies": {}
    },
    "hghbzzq": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghbzzq/",
      "text": "Don't judge too soon. Some professors are easier and more relaxed than others, and as your classes get harder you will have more work. \n\nYour school has its own rules about homework. The first college I attended, very few classes counted attendance and had homework. I transferred to another university and every class takes attendance and has some sort of weekly assignments. Honestly, when you get a lot of assignments be happy. It helps bring up your grade.",
      "author": "wickedtacos",
      "created": 1634132108,
      "upvotes": 1,
      "replies": {}
    },
    "hghkfr9": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghkfr9/",
      "text": "Not every major is the same, not every school is the same, and not every professor is the same. They are just trying to prepare you for the worst. I think your hs teachers would be happy to hear that you are having a better time at college than you anticipated.",
      "author": "JupiterRocket",
      "created": 1634135845,
      "upvotes": 1,
      "replies": {}
    },
    "hghoibe": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghoibe/",
      "text": "I'm a secondary ed + english major and yeah the \"college level\" shit we had to do in hs was so weirdly rigid and formal, so many of my assignments are analysis papers or lesson plans that really aren't that hard. maybe it's because i enjoy what i'm learning now? \n\nhowever, i've heard those in the sciences get screwed over in college. rip stem majors hope y'all are doing ok.",
      "author": "ourhouse1970",
      "created": 1634137491,
      "upvotes": 1,
      "replies": {}
    },
    "hghp9z7": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghp9z7/",
      "text": "what’s your major? how does your major’s higher ed (masters and phd) compare?\n\nfor me, psychology undergrad is a walk in the park. however, i know higher ed will not be the same way and will take a lot of my time up.",
      "author": "venomtw",
      "created": 1634137803,
      "upvotes": 1,
      "replies": {
        "hgiib8d": {
          "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hgiib8d/",
          "text": "I’m in aviation technology, aka I’m trying to be a pilot.  Idk if they have anything above a bachelors, since you get all your licenses and certifications by the end of the 4 years and the degree itself isn’t too useful, it’s just a requirement to have a bachelors for international pilots.",
          "author": "clon2645",
          "created": 1634149454,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hghvgik": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghvgik/",
      "text": "> my professors are super nice and understanding, and I barely have homework\n\nthis could change.",
      "author": "grownrespect",
      "created": 1634140340,
      "upvotes": 1,
      "replies": {}
    },
    "hghzb3l": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hghzb3l/",
      "text": "😅 not when you are a pre med student or those tough majors",
      "author": "Dangerous-Honeydew64",
      "created": 1634141930,
      "upvotes": 1,
      "replies": {}
    },
    "hgjehjk": {
      "link": "/r/college/comments/q75slc/why_do_high_school_teachers_act_like_college_is/hgjehjk/",
      "text": "It is better to be over prepared than under prepared. Not all of your classes may be as easy. Usually there is tons of readings and studying involved even if there isn’t as many assignments. And hs teachers didn’t get to solely have you as a student, they had to teach other students at different levels who plan on going into different fields at perhaps schools with a more rigorous course load.",
      "author": "milk1tea",
      "created": 1634162721,
      "upvotes": 1,
      "replies": {}
    }
  }
}