{"sid": "g0m7v6", "link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/", "title:": "What are the benefits on moving out of your parents home in college?", "text": "My family is arab, and most arab families sometimes make their college kids stay with them until they finish college or until they get married. My family is okay with me moving out of the house but what are the benefits with moving out during college with housemates? \n\nIs it worth the $700+ rent, while most of us college students are working paycheck to paycheck?", "author": "raknrakn", "created": 1586795049, "retrieved": 1632802613, "over_18": false, "upvotes": 780, "upvote_ratio": 0.99, "comments": {"fo1sy5b": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fo1sy5b/", "text": "My family is not from Middle East, but it is an immigrant family with, uh, \"traditional\" values by American standards. We are typically expected to stay with parents until marriage, unless we have to move due to studying. If unmarried, upon graduation we typically move back in with parents. I have two degrees, and during the first I moved out while during the 2nd I lived with parents, so I can speak to both sides.\n\nOut of the house: main pro is not having your parents around 24/7, and I don't mean in the party-time way. I learned a lot about myself, my values, and independent life by living with roommates. I have no siblings, so this was my first time truly socializing with peers on everyday stuff. I learned how to cook for myself, how to budget, some basics of frugality, self-discipline in studying, and a lot about communication and negotiation. I messed up a lot, but my mom wasn't there to berate me. I caught bronchitis in the first year, and learned how go to the doctor, follow prescriptions, routines, and take care of myself while sick. All-in-all, I went in a 16 year old teen and came out an independent adult with 3.9 GPA. Not bad for being left alone with 1 phone call a week. \n\nmain con: constant money shortage and a hell on earth if you are introverted and you just want people to shut up, just for a little bit... \n\nIn-house: main pro is living/food comfort. If your family takes care of you and honors your study time, you couldn't ask for a better arrangement in terms of living expenses. Having a hot meal ready at the end of the day, a bathroom you don't have to share, no loud roommates, steady internet access, and a back-up ride if the bus doesn't pick you up really does wonders for academic achievement. I was a fairly good student in my first grad round; I was at the top of the crop in my second round due to having boatloads of time to spend on it: 4.0 GPA in second grad school completed in 2 years with a 50% job assignment in the second year. Time is a commodity that you don't realize you lack until it suddenly drops into your lap. I saved up some money from working part-time, and moved out at 26 with a reasonable emergency fund and ZERO college debt, which is a rare. \n\nmain con: no privacy, zero. My mother decided \"to make up\" for lost teen years and doubled down on my \"discipline\" in my early twenties for disrespectful acts, such as cutting the onions in the wrong way or not dropping my homework to wash the dishes for the 5th time in 2 hours. I wrote a draft for my final project while my mother sat on my table (yes, on top of it) and screamed at me on the top of her lungs because she had a bad day. If any of your parents decides to hate you for staying with them midway through, you'd better have a financial incentive or it's not worth it.", "author": "Matrix_spoon", "created": 1587440778, "upvotes": 1}, "fneh5ha": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fneh5ha/", "text": "KEENAN!", "author": null, "created": 1586889283, "upvotes": 1}, "fncp2qd": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncp2qd/", "text": "Here’s something young people tend to not take into account; **the transition from parenting a child and parenting a young adult doesn’t happen overnight.** Even if your parents are totally chill it will be hard for them to totally let go and let you do things that other college students freely do. I’m not even talking about sex or partying. I’m thinking late night trips to stores to impulse buy something with a friend. Midnight drives with a person you’re flirting with. Impromptu chill/light study sessions with a classmate at 11pm. “Night life” in college isn’t just partying and clubs. It’s 2am rants and midnight milkshake runs. Think about it from their perspective. On August 16th and you have a growing child who you keep tabs on (as parents do). Then on August 17th you have a college student who is now magically 100% responsible for themselves and you don’t try/need to police? No. It’s not a switch. There’s a transition and trust me, that transition is ROUGH when you’re living with them. \n\nUnless your parents have already 100% let go of the leash already (and having black/brown parents myself and being in my twenties I am safely assuming they have not lol) you really don’t know how they’re going to react to your comings and goings (and there will be a lot). Even if they’re chill about it being watched wears on you.\n\n*TL;DR- Move out. Independence is priceless.*", "author": "1PettyPettyPrincess", "created": 1586842729, "upvotes": 1}, "fncomma": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncomma/", "text": "At the end of the day both options don’t hurt but the good things about being a college student and living out of home is that it feels like a beta to adult life\n\nAlso it helps if you live closer to campus/it also allows you to be closer (distance wise) to people that can help you out", "author": "vapegod_420", "created": 1586842352, "upvotes": 1}, "fnckl6n": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnckl6n/", "text": "Masturbating to your heart’s content.\n\nNo joke, a buddy of mine had like 3 younger sister (age gap from oldest was 7 years) and had no privacy his whole life. He turned 22, had enough to move out, and as soon as he was set in, he said he spent that first day jacking it all around the house.\n\nCourse, we never visited his apartment after that, but y’know", "author": "Amonasrester", "created": 1586839148, "upvotes": 2}, "fncjaig": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncjaig/", "text": "Having classmates at arm’s reach 24/7.\n\nHaving girls/boys at arms reach 24/7.\n\nTalking to people a lot more and learning from them.", "author": "Dsajames", "created": 1586838190, "upvotes": 2}, "fnci8xz": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnci8xz/", "text": "i chose to live on-campus my first year but i guess it still applies. personally, i wanted to have my own space and live on my own rules and my own terms. even if i was \"an adult\" and could \"do whatever\" i wanted to, i felt like if i was living under my parents' roof i'd have to abide by their rules, ask permission to go out with friends, constantly let them know where i am, etc. it's hard to explain but that's how i felt. the school i go to is 4 hours away from home and i'm taking out loans to help pay for school (the state covers my tuition and my parents help a little, i plan on getting a job soon) but that for me is well worth it.", "author": "edmvnd", "created": 1586837425, "upvotes": 1}, "fncfjpf": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncfjpf/", "text": "Economically, it's a stupid decision. \n\nBe a student part time, going to a local school, taking tops four classes. Work the rest of the time. Put away half of your check, minimum.", "author": "kidneybean15", "created": 1586835524, "upvotes": 0}, "fncee2c": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncee2c/", "text": "This is very dependent on your home. I lived away from my parents and with my college while in college and I prefer living with them", "author": "nickthatknack", "created": 1586834734, "upvotes": 1}, "fncdult": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncdult/", "text": "I have always gotten along well with my parents, but moved out anyway because my school makes you live in dorms freshman year, and if I wasn't paying room and board they'd just take it out of my financial aid. \n\nAnyway I think allowed me to grow a lot socially and make friends I  wouldn't have otherwise. And while I never fought with my parents before I enjoy my time with them a lot more now that I have more separation (let's see what quarantine does to that lol)", "author": "SkiMonkey98", "created": 1586834371, "upvotes": 1}, "fncc4v1": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncc4v1/", "text": "living w family is a blessing and a curse. there's nothing like becoming independent and making your own life routine.", "author": "thatway12345", "created": 1586833221, "upvotes": 2}, "fncaxir": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fncaxir/", "text": "Freedom, living on your own terms making your own rules. \n\nFor me,  I loved living on my own but due to where I chose to go to college it was a struggle to make rent some months. Moved into what i thought better situation after my first year trying it out, ended up failing classes and being put on suspension. \n\nNow I'm living with my parents right now at a new school until this semester is over, then hopefully I can make the move to being independent for my final year.", "author": "adamus13", "created": 1586832453, "upvotes": 1}, "fnc6o3d": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnc6o3d/", "text": "You can do whatever the hell you want man it's awesome, having girls and friend's over, going and partying on weekends, it's a dream and I cant wait to go back", "author": "Speedstormer123", "created": 1586829763, "upvotes": 1}, "fnc24r4": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnc24r4/", "text": "Moving out is great but unless your home life is genuinely toxic I'd say it's not worth it. Especially for your first two years. I had to move out at 18 and have struggled sm financially until this year (rising senior), because of work I haven't had the time to really be involved in school clubs or even make it to many school events which I regret. \n\nEven if rent is only 700 in your area, utilities + groceries + furniture will put you well over $1,000 monthly. Either you will leave school with a bunch of unnecessary debt or you'll have to work a solid 30 hours a week to survive, on top of going to school full time. Probably with very little leftover for savings or enjoyment. \n\nStaying home for just your first two years would save you well over $20,000. That's literally a downpayment on a home. Once you're in your last year or two I think it's a great idea to learn some independence but that's just my opinion", "author": "tullah123", "created": 1586827022, "upvotes": 1}, "fnc17k8": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnc17k8/", "text": "It’s important for you to find an identity outside of your family. Some people in arab cultures can struggle with that. Some don’t. Just basic adult things are learned through experience. I’m grateful for all my mom does and taught me, and I still always call her very first thing, but when I have a problem, I have to handle it. I never would have realized how much work it is to keep up a house. Potty training a puppy alone SUCKS. Why is my carpet always dirty when I vacuum it all the time? Why are there always missing socks? There’s just so much I wouldn’t have learned unless I was on my own. It gave me a whole new view of my mom, and our relationship is amazing. I moved back in with her for medical school, and I am so thankful for all she had ever done for me. I think living with her as an adult could have been a problem had I not been on my own first. Everyone is different though 🤷🏻‍♀️", "author": "Bekah_grace96", "created": 1586826476, "upvotes": 1}, "fnbswio": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbswio/", "text": "I went to college 30 minutes from Home at the local public university after going to college 3.5 hours away from home freshman year. I immediately moved from a dorm to an apartment sophomore year until senior year and stayed with my grandma fall semester senior year and graduated in December. I ended up living with her until August of the following year, so about 8 months. There’s pros and cons to having your own apartment while attending school\n\n1. Responsibility and learning how to budget when you are in college is vital. Especially after college when the average US rent cost is $1200 per month, not including utilities, WiFi or furnishings. \n\n2. Networking and friendships are easier to maintain, you have your social distance (no pun intended) with your college classmates and your family, but also have a place of gathering. \n\n3. You WILL NOT save money living off campus in my opinion. I could’ve lived in a dorm for FREE with my scholarship, and took out 12K in loans for off campus housing and living expenses. Now I’m paying $125 monthly for the next 10 years for those 3.5 years of luxury. \n\n4. If you feel like your family is altering your growth I say go for it. You may have money you owe in student loan debt, however you can also learn responsibility and independence. Many college students fall on their ass in first time apartments and fall apart which is normal. YOU SHOULD EXPECT FAILURE. Especially going into the workforce after college. You wont get every job, car, or home when you’re out of college and I experienced and have seen too many people give up after 6 months of college because mom and dad didn’t let them learn in college.", "author": "jaycharlesluck1996", "created": 1586821674, "upvotes": 1}, "fnbskhy": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbskhy/", "text": "I moved out and I’m incredibly happy that I did. My relationship with my parents has gotten better and since I moved in with people I didn’t know, i kinda had to get to know them and I think my social anxiety has decreased and I’m so glad I met my housemates. But being able to keep up with school while working is really hard, at least for me, so that’s definitely something to consider", "author": "wheresmyboy", "created": 1586821483, "upvotes": 2}, "fnbr8zw": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbr8zw/", "text": "Benefits of living on campus my first year of college far outweighed the cons. Especially now that I'm living back at home with my parents due to the pandemic. Little things like sleeping whenever you want, eating whenever you want, and being able to focus on nothing but your school work are the perks of living away from home. The independence is addicting and now that I'm back at home I don't want anything more than to go back to school so I can have my home away from home again.", "author": "_-Day-_", "created": 1586820740, "upvotes": 1}, "fnbr718": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbr718/", "text": "It depends, if your parents don´t give you to much pressure and peace when you want to study, then staying at home will save you money. And they would make you food, clean your cloth, and all that good stuff. But if you think about it, this is actually bad for you. I would rather pay 700$ for rent and do everything myself, then live with my parents. \n\nThis is my reason, first of all, i don´t like being treated like a handicapped child. When you have arab parents, they will treat you as a handicapped child (speaking from experience) and make you one, as long as you live with them, you won´t progress mentally as you would living alone. my second reason, you get disciplined. You learn how to do stuff, the way you want to do it! This is honesty the most rewarding and satisfying part of living alone. You can plan your life exactly the way you want it to be. And the third reason is you think like a grown up, your mindset will change. I myself would say, get an apartment for your self, don't share with anyone, not even friends. That's the best way to live alone i would say, with your own bedroom, own kitchen and bathroom. \n\nSo i have lived alone for some time, by my self, and with a friend. all and all i would say having your own place is the best. You will get respect from your friends and your parents. And you will take life much more seriously.\n\nI also lived at my parents house, and the only thing i did was study, and sleep. I mean it´s kinda great, but it´s not really great. You don´t want this lifestyle, you want to hustle and grind for your life, not depend on your parents. Hope this helps, gl.", "author": "Top-Student", "created": 1586820710, "upvotes": 1}, "fnbokpo": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbokpo/", "text": "I would love to move out; I actually spent my freshman year in a dorm and then moved back home. I’ll tell you why I did, and why I’m starting to regret it. \n\nDorm life:\n- The friends I made at the beginning of the year ended up making their own little friend groups, got boyfriends, etc. and I had maybe one friend to socialize with. \n- I was in a tough program, and my lack of friends meant I was studying all the time, which helped me academically but absolutely ruined my mental health. \n- I ended up being diagnosed with anxiety and depression and my therapist believed it was partially from my lack of socialization. \n- I’m an introvert so moving into a strange place for a year to a university of 40,000+ was not my thing. \n\nPros of living at home:\n- I don’t have to pay the $760 rent I was looking at for a 4x4 apartment\n- I have my dog and cat with me\n- I get home cooked meals\n- I get to save my money a lot more. \n- I don’t have as much pressure on me (I lived in the Honors dorm and every day felt like an academic competition) \n- I have more freedom to be myself\n- I have my own bathroom!\n\nCons of living at home: \n- Parents can be overbearing\n- I didn’t have to work at university because I had a scholarship; had to transfer schools so now I work anywhere from 15-25 hours a week, which has been a struggle for me to juggle academics with \n- I feel less independent and have felt myself getting lazier because I don’t have to do everything myself. \n\nOverall I think it depends on you. If i went to school closer to home I probably wouldn’t have minded living on my own. I’m actually about to get my AA and then transfer to hopefully an online bachelors program so I can work full time. \n\nI’m definitely more of an introvert though so I would need to live near my family so I have some comforting social ties, instead of having to make all new connections.", "author": "rogertaylorkillme", "created": 1586819277, "upvotes": 1}, "fnbjr27": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbjr27/", "text": "Growing up. Responsibility. Really the best parts about it. But then again you're being taught the opposite in college", "author": "mouseysmack", "created": 1586816765, "upvotes": 1}, "fnbjqef": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbjqef/", "text": "One thing to keep in mind is when you move out that’s when you really have to move out and grow up. Moving out to where you don’t know anybody in an unfamiliar area is really eye opening. The fear of failing always kept me on point.", "author": "TxHerrmann", "created": 1586816756, "upvotes": 2}, "fnbjp1f": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbjp1f/", "text": "Me and my mother mainly butt heads a lot and ever since staying at a college dorm 4 years ago I’ve been planning on moving out, not because I hate living with my family but personally I’ve found that some form of distance between me and my mother greatly improved our relationship. I’m actually planning on renting a small house she recently got.", "author": "santaklaus21", "created": 1586816737, "upvotes": 2}, "fnbjmgj": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbjmgj/", "text": "I'm first generation college, and the youngest of 6 kids. I always felt pressured to make up for my brothers' and sister's mistakes throughout high school. Not to mention family drama was never ending.\n\nMoving away for school allowed me to set up my own lifestyle free of feeling pressured to help my parents or to make up for others. It was such a relief, before quarantine of course.", "author": "Abeeham25", "created": 1586816701, "upvotes": 2}, "fnbj1sp": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbj1sp/", "text": "Self-development is going to be the most universal benefit for all students. Escaping a bad lifestyle is another common reason, though it's not something that every student will have to deal with.\n\nIt's a really lucrative opportunity in my mind. You are sort of getting a practice \"live on your own\" for a few years while you aren't in a full-time career and have a lot of time to figure stuff out. That experience is worth the cost for many people down the road because it makes for an easier transition to independent career life.", "author": null, "created": 1586816405, "upvotes": 1}, "fnbim94": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbim94/", "text": "Hell yeah it's worth it dude. You can drink beers and smash pussy without worrying about your mom seeing your dong.", "author": "ChongLoadJackson", "created": 1586816183, "upvotes": 1}, "fnbihrc": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbihrc/", "text": "just get married to your highschool girl/boyfriend", "author": "littlebro5", "created": 1586816120, "upvotes": 0}, "fnbi00c": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbi00c/", "text": "I would kill to be able toive at my parents house. Even if I had to pay for utilities/rent itd probably be less than what I'm paying for now. I'm usually pretty broke even though i work around 30/40 hours per week as a server. Id be doing the same things - work/gym/school, but I'd be able to be saving a huge amount of money. I'd probably even be able to invest any extra cash. If you already have a healthy savings account, then it's probably worth moving out. If not trust me, living hand to mouth is not fun.", "author": "thothpethific92", "created": 1586815869, "upvotes": 1}, "fnbhq7x": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbhq7x/", "text": "Biggest benefit is having sex passionately", "author": "ACE-JHN", "created": 1586815734, "upvotes": 1}, "fnbftq1": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnbftq1/", "text": "Personally I’d stay at home for at least the first year so you can save money. I live with my aunt and uncle for free and I’ve saved a ton of money over the past few years. However, saving money is pretty much the only plus side. If money isn’t an issue for you then I’d move out.", "author": "asiersbleh", "created": 1586814782, "upvotes": 1}, "fnba558": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnba558/", "text": "Honestly I would go stay in the dorms. All my friends who are commuters  say they wish they lived in the dorms and are moving in next year. It’s just a completely different social situation. I think in the long run it’ll be better because you’ll have more of a chance to make friends. Also just logistically if you have classes that aren’t one after another you won’t be stranded just sitting in the library.", "author": "fuckyoutoocoolsmhool", "created": 1586811900, "upvotes": 1}, "fnb90b5": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb90b5/", "text": "There close support is a bit distanced. However for my family I found that distance did my relationship with my parents good. I wasn’t close enough to deal with their emotionally draining tendencies and if I did bad on an exam I did not have to feel stressed to tell them. Also getting to choose when I have the conversations with them helped as well.", "author": "thatafricanchick", "created": 1586811328, "upvotes": 1}, "fnb8g8b": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb8g8b/", "text": "Depends - do you like living with your family, or does it stress you out?\n\nIt's a HUGE amount of money, esp. over 4 years. It's literally a downpayment on a house, or a year of grad school. \n\nMaybe you could try it for a year and see if you like the independence, etc. Freshman year of college is kind of the most valuable, socially. It's also nice to be on campus, and just sort of *around* for random stuff. \n\nOften by junior/senior year ppl are moving into overpriced apts anyway, you could just plan to move back in then. \n\nBut yeah, really think through the money thing.", "author": "MithrilYakuza", "created": 1586811045, "upvotes": 3}, "fnb6fgx": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb6fgx/", "text": "Girlfriend and I are moving out of our parents house. She’s graduating this semester and I have just one more year left. So much more independence and alone time", "author": "412gage", "created": 1586810031, "upvotes": 1}, "fnb5o6k": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb5o6k/", "text": "It is literally the best decision you can make. You have the freedom to do what you want, see new perspectives and do things you wanna try out without worrying about what your family would say. You get to have your own personal space for doing whatever you want, including schoolwork. Living on campus or around campus was amazing for me.", "author": "mikeymora21", "created": 1586809653, "upvotes": 0}, "fnb3wls": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb3wls/", "text": "Depends. If you like your parents, it'd be a good idea to stay home for financial reasons. If you make friends on campus, you'll be able to crash at their places more often than not. Being a commuter is really cozy if you have a good home life.\n\nThe social perks of living on campus are over-exaggerated, and not worth the price tag of living on campus, unless you're some kind of hyper-extrovert. I lived off campus while I was in undergrad, and I joined Greek life, took E-Board positions in clubs, blacked out at more than enough parties, and could almost always find a place to crash if I couldn't find a way home for some reason or another. All the while saving up most of the money I made working.", "author": "The_Southstrider", "created": 1586808772, "upvotes": 6}, "fnb3lrt": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb3lrt/", "text": "Personally, I regret moving out of the house. Almost every penny of my paycheck went towards rent, I had to take out more loans, and I had less time for socializing and extracurriculars because of work. There were certainly benefits to having my own apartment, but on balance, I’m not sure it was worth it to me.", "author": "czarfalcon", "created": 1586808621, "upvotes": 1}, "fnb3llo": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb3llo/", "text": "I’m gonna be blunt, bringing women over and being as loud as I want to. Walking around swinging in the breeze. I can bring over people when I wish it’s fucking great. \n\n\nThat being said my parents were always the “free roam” kind. They were never on me just had general guidelines that were very acceptable. I get on great with my dad so it’s almost no different other than I can bring home booty calls. 🤷", "author": "GoldenMushroom1995", "created": 1586808618, "upvotes": -3}, "fnb2gw3": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb2gw3/", "text": "Definitely. Your college years are essential to your personal development and living habbits, and the only way to go is to live by yourself. I have friends who continued to live with their parents after high school and they pretty much have the mentality of a teenager. Guess it depends on your parents and your priorities, though", "author": "niennaisilra", "created": 1586808050, "upvotes": 1}, "fnb115m": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb115m/", "text": "The obvious benefit is less time spent commuting", "author": "Sennheiser321", "created": 1586807347, "upvotes": -1}, "fnb0tf8": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb0tf8/", "text": "You can get laid.", "author": null, "created": 1586807241, "upvotes": 1}, "fnb0c31": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnb0c31/", "text": "Moving out gives you full independence and the true college experience.", "author": "numberthangold", "created": 1586807003, "upvotes": 1}, "fnazhvm": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnazhvm/", "text": "I got an apartment and loved having my own space. It was great for me mentally", "author": "night2016", "created": 1586806581, "upvotes": 1}, "fnazcfp": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnazcfp/", "text": "Independence.", "author": "NaranjaEclipse", "created": 1586806501, "upvotes": 1}, "fnayum4": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnayum4/", "text": "Living away from home during college was one of the best things I did. Not so much academically because I can study wherever as long as I have headphones and a good playlist, but socially. My parents are pretty hard on me when it comes to going out. I would've missed out on a lot of social events had I stayed home. My life outside of school would've been very mundane. So that's one of the biggest things I enjoyed while going away to school.", "author": "JackThaStrippa", "created": 1586806232, "upvotes": 2}, "fnay1dp": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnay1dp/", "text": "[deleted]", "author": null, "created": 1586805827, "upvotes": 2}, "fnay1cx": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnay1cx/", "text": "There's something called 'bills', when you stay at your parent's you tend to have less like these sucking up your wallet..", "author": null, "created": 1586805827, "upvotes": 5}, "fnaxeon": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaxeon/", "text": "Lot of factors to consider. Depending how far you live from the college, you could end up paying a good deal toward gas/time. \nBeyond that, it depends if your family life is good. If there’s good boundaries, I would say it might be okay. But if there’s a great deal of work needed on boundaries, then it be better to work on them and your schoolwork from outside the home. It’s hard to serve two masters; and focusing on school should be the priority.", "author": "athan1214", "created": 1586805511, "upvotes": 2}, "fnax629": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnax629/", "text": "I stayed home for my undergrad. I was fortunate enough that my parents had extra income put aside for me for university. I was able to use that money I saved staying home for other things, like possibly saving for a down payment for a house in the future. It just depends what you want. \n\nI remember reading somewhere that if you live at home for university, you're more likely to delay moving out permanently. I'm not sure how scientific that was though. Also that statistic may have just been applicable to my country and idk where you live. Is there a big difference in quality of education from a close school vs a farther away school? \n\nBut for my friends who have moved out, none of them regret it so far.", "author": "allyfiorido", "created": 1586805390, "upvotes": 3}, "fnawv3v": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnawv3v/", "text": "You have to really think about what you’re doing. Freedom isn’t everything. Think about the money you’re wasting that could be saved. Make some sacrifices. It’s more than just wanting to move out and pay rent so you can have your own place. It’s difficult. You need a certain level of discipline when it comes to how you spend your money.", "author": "EinTheCat", "created": 1586805238, "upvotes": 5}, "fnawgr7": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnawgr7/", "text": "It definitely depends on what you want.\nI was lucky enough to have parents that helped support me throughout college, both by paying for tuition and housing. But I also worked throughout college to help support myself, so my parents paid for my essentials but I earned money for food, utilities, and going out with people.\n\nWhen I look at my friends who decided to stay close to home and relied on their parents from things while in college compared to those who left and didn't rely on their parents. I think that those that didn't rely on their parents have become a lot of more independent and know how to do more things to survive than those who stayed near home and called their parents for everything, from rides, to laundry, to food, etc. I also think moving out, even for a short amount of time, like when you're a junior/senior in college helps you to \"find yourself\" and learn how to be self sufficient.", "author": "DarkAngel201519", "created": 1586805037, "upvotes": 8}, "fnavwxu": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnavwxu/", "text": "You just want to, trust me. You do.", "author": "Raymx3", "created": 1586804755, "upvotes": 1}, "fnavaxf": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnavaxf/", "text": "2 of my college bffs are from Egypt: one is Muslim, one is Coptic (religion tends to play a role sometimes, so if you identify with either or neither, I hope this still helps). They both lived on campus their 4 years of college, and absolutely loved it. While it can get expensive, for them it was worth it as they could efficiently focus on school and their personal lives a lot more. \n\nAs for me, my mother is a helicopter parent. I just knew for a fact that if I lived at home while going to school, I would never have done any of the things I got to do (study at the library for hours, join clubs, join a sorority, etc.) because she would just expect me to be home if I was not in class.", "author": "MeowPurrBitches", "created": 1586804446, "upvotes": -1}, "fnauvue": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnauvue/", "text": "You get to live by your own rules. Even the least restricting parents still have some rules, or a family schedule (like stopping to go eat dinner, stopping to do chores, stopping because your siblings need attention, etc.). Moving out removes that schedule. You live by your own rules and on your one schedule. I find that I’m a lot more motivated to work when I’m in my own apartment vs visiting my parents.\n\nThere are drawbacks, of course. You have to start paying for rent, food, utilities, etc. but it teaches financial responsibility that you’ll have to have eventually. You’ll likely have roommates, some of them are very difficult people, but you can always try to get a single bedroom with a lock to alleviate that difficulty.\n\nOverall, I find living on my own makes me more responsible and happier, but everyone is different. Hope this helps!", "author": "TooFarFromComfort", "created": 1586804239, "upvotes": -1}, "fnaumw8": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaumw8/", "text": "I'm Arab and stayed with my family through my 4 years of undergrad, then moved away for grad school and got married. If your family is super restrictive about your schedule and it's driving you crazy, then leave. If they're okay with you coming and going freely, then stay and save the money. \n\nI didn't party, because I had a curfew, but I was gone from around 6-7am to 10pm almost everyday. Granted, I was a FT student and worked at least 2 part-time jobs, so not all of that time was spent fucking around. I dated, drank, and hung out with people. I never tried to fully immerse myself into the college experience, but I don't think I missed out on anything. I also lived around 45 minutes away from my college.", "author": "rayin", "created": 1586804116, "upvotes": 8}, "fnaubv9": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaubv9/", "text": "It depends on if you have the money.  I never did and taking out almost twice as many loans to afford that wasn't an option either.  It's really just the freedom angle.  Depends on how much that is worth.", "author": "xmarketladyx", "created": 1586803963, "upvotes": 2}, "fnatw9l": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnatw9l/", "text": "The best part about moving out is personal space and being able to keep my apartment clean. Currently I live by myself and it’s great. Just so much more chill, although I wouldn’t mind seeing people sometimes ( though current circumstances not really an option).", "author": "lovingtolive", "created": 1586803751, "upvotes": 1}, "fnatrfh": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnatrfh/", "text": "I moved out my first quarter and moved back by my second. Hopefully I can give some perspective for both sides. When I was living in the dorm, I matured much more in my short time away. Living back at home I get better grades because I have a better sense of comfort. I'm on my third quarter now and I'm itching to move out again.", "author": "byorderofthe", "created": 1586803683, "upvotes": 2}, "fnat9ep": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnat9ep/", "text": "If you can afford it, I think it’s a good idea. You could also live at home for part of college and move out later if that makes more financial sense. \n\nI will say that living independently in college has helped me feel more sure of myself and capable of making my own decisions. I feel like I have space to make mistakes and learn from them, and I also became more responsible about taking care of my space.", "author": "amoeba666", "created": 1586803428, "upvotes": 1}, "fnat3vz": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnat3vz/", "text": "In India , we hardly move out of our homes. We only move out if our college is too far. It gets very weird when you try to move out. Because for parents, children are expected to grow up with them , bring home their wives , raise grandchildren and everything in the same home. Provided the house is adequately big.", "author": "lordimpaler037", "created": 1586803351, "upvotes": 5}, "fnat35u": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnat35u/", "text": "Like everyone else is saying, it depends on what you value. Do you value independence, or financial stability? Are your parents willing to help fund some of your rent, or are you willing to have a little extra student loans or work more in order to live alone? \n\nThankfully my parents paid for rent so I didn't need to worry about it, but even if they didn't I still would have moved out. Especially my freshman year, I loved having a sense of independence and operating on my own schedule. Living in the dorms my freshman year really enabled me to connect with other students and kickstart a bunch of friendships. I like hosting so I also became the person who hosted a lot of events, making even more friends. However you don't need to live on campus to make friends...I actually had a big falling out with all of them and my new friends I made while living off campus. A lot of my friends who had to pay for their own housing and had to work a lot or take out loans don't regret it for the same reason above. \n\nMy boyfriend still lives at home. He likes being able to save money, but he also doesn't like the lack of privacy. We usually go over to my place to spend the night. Thankfully his parents are really chill so he doesn't have any rules to follow, but I have friends who lived at home to save money and their parents are overbearing. Saving money was a primary focus for him since he didn't have a lot saved up, and he was still able to make friends and be actively involved in campus.\n\nThis is really just me rambling at this point, but it just depends what you value and what you are willing to sacrifice. Good luck!", "author": "AceOfRhombus", "created": 1586803341, "upvotes": 8}, "fnasqya": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnasqya/", "text": "I'm Middle Eastern and luckily my parents let me move out during college. I feel like it's the best experience I've so far had it really let me grow as a person and learned how to take care of myself. I'm sure you know typical Middle Eastern parents (idk about you but mine are like this) always try to baby me and take care of me. Not that it's bad but I feel like if I continued to stay home I wouldn't learn a lot of things I need to go on daily. They still do drive an hour some weeks to bring me food Haha. But overall my cooking, cleaning skills, even my studies have changed. I think I study better when I'm by myself than I am at home with my parents. Also it allowed me to participate more in school clubs or other extracurricular activities that most people dont get to experience as commuters. \n\nHope this helped.", "author": "ZeGoddess", "created": 1586803170, "upvotes": 0}, "fnaso67": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaso67/", "text": "Definitely depends on your family, and how much you like them, if they’re paying for your education, etc. I have a scholarship that requires me to live on campus (my home address is 2 hours away anyway) that covers all of tuition. Luckily my parents are able to reasonably afford housing for me so I don’t have to get it myself. That said, with the recent events having my campus evacuated for the rest of the semester, I’m not sure if I reasonably could have stayed at home while being productive. There’s just too many distractions and expectations that my parents have (for chores and other stuff) that messes with the schedule I’d been following independently until now. So I think if you really feel like you need independence, you may want to consider moving out. I’m not sure if your family is able to financially help you though, so keep that in mind. Otherwise, you’d save a lot of money between rent, food, and other expenses if you just stayed at home most likely.", "author": "Weeaboology", "created": 1586803130, "upvotes": 2}, "fnasnh6": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnasnh6/", "text": "Yes there is a financial burden you do need to worry about but it's about your value on how much you would pay for that experience to live away from your family. If you live close to the college I would definitely think about if the \"college experience\" is worth $700 a month to you.  What is your motive to move out? Independence? Clashing personal values with your parents/culture/religion? College experience with housemates?", "author": "Cathlulu", "created": 1586803120, "upvotes": 4}, "fnasgos": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnasgos/", "text": "You become much more independent,  confident and can do whatever you want. Mommy and daddy dont tell you what to do. Plus, you can bring a shit ton of hot girls over and mess around all you want. You're closer to class, get more socialization, and feel like you're really starting to dictate your own life. Would recommend!", "author": "BigDaddySurgeon", "created": 1586803025, "upvotes": 7}, "fnasaoe": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnasaoe/", "text": "I came from an abusive household, moving out during college is certainly the hardest thing I've ever done but it's improved my life 1000x. If I came from a normal family I'd still try to move out, probably . But that's only because I overvalue independence .", "author": "CSHooligan", "created": 1586802940, "upvotes": 2}, "fnarbh5": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnarbh5/", "text": "I love my fam and I am lucky to have pretty cool parents, but one of the huge upsides to having my own place is that I have the ability to experiment without getting endless ridicule or commentary. Paint my nails? Try out a new hairstyle? No problems from my roommates.\n\nThere's also some strange dynamics that come with living in your parent's place while being an adult. I've personally found that there's still an expectation on me to contribute to chores and associated household tasks (rightfully so) but also in my family there's an expectation that you spend a certain amount of time around your siblings, family meals, etc. Carving out your own space, your own time, etc. can be critical to just staying sane when sharing a family home, but can be exponentially easier at your own place. My parent's definitely still feel like they should have a say about how I act, what I do, my appearance, etc, even if I feel like those are areas of authority for them that I left behind in highschool.\n\nI like to be self-dependent, and having a good job and my own place helps with that. That being said, if my parents lived 15min or closer to my university, I would save the rent and store the nail polish until after I graduate. The money I could save would be well worth it, and there's plenty of ways to express yourself without getting in trouble with the 'rents.", "author": "bolharr2250", "created": 1586802447, "upvotes": 14}, "fnar8x4": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnar8x4/", "text": "$700 plus rent? Oh man. I wish", "author": "Anthdkn", "created": 1586802413, "upvotes": 12}, "fnar3pd": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnar3pd/", "text": "I was on the mindset of I frequently get homesick so I didn’t want to officially say I moved out of my house and went to school an 1.5hour away. I just graduated in dec and I thought I would enjoy being at home. No rent, a meal is always there and I can finally paint my room. I realized I that I had it good at my student apt that I shared with a random for three years. What I figured out was yeah I miss the family time and that I can just visit or maybe stay in a hotel nearby and make it a vacay. I have a friend in classes who is in their forties with kids of her own and even she gets homesick and visits her parents. I say all of that to get to the point of you and everyone need their space but there’s nothing wrong with wanting family time.", "author": "AXXII_wreckless", "created": 1586802343, "upvotes": 1}, "fnaqwoy": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaqwoy/", "text": "The only benefits arehaving friends over whenever you want, staying up as late as you want, waking up whenever you want, being messy, and getting drunk, high, and laid. But it also costs a lot for money.", "author": "BreddieBoi", "created": 1586802243, "upvotes": 5}, "fnaqng5": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaqng5/", "text": "you are influenced most by the people around you. if you are in college, it might be a good idea for those people to also be students", "author": "joncabot", "created": 1586802115, "upvotes": 7}, "fnap6mq": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnap6mq/", "text": "S", "author": "Kaboom_up3", "created": 1586801378, "upvotes": -4}, "fnaorg3": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaorg3/", "text": "Been living on my own for almost half a year now, moving out must have been one of the best decisions when I turned 18. My parents know I am independent and that I do everything on my own, so as long as they know I am responsible, they aren’t worried about what I’m doing all the time. It is a busy life but I love it.", "author": "ozzy_1005", "created": 1586801169, "upvotes": 1}, "fnaomec": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaomec/", "text": "I’m from a south Asian family and I chose not to move out because my parents let me stay with them rent-free and pay all of my expenses. If I moved out, I’d be on the hook for tuition, health insurance, getting my own car, everything. \n\nFor me, a few extra years of staying home was worth it because I essentially got free money from my parents for it. Going to college costs tens of thousands of dollars. Yeah I might not have the freedom I want, but I’ll have more financial freedom down the line, and that makes it okay to me.\n\nIf your parents let you stay without paying rent, and you expect to pay $700 a month elsewhere, that would save you $33,600 in 4 years. It’s up to you to decide your finances.", "author": "Slothfulness69", "created": 1586801099, "upvotes": 80}, "fnamuah": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnamuah/", "text": "Depends on you, I personally think it’s worth it just to get away from family.", "author": "RapidRoastingHam", "created": 1586800222, "upvotes": 10}, "fnamtuf": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnamtuf/", "text": "Short answer: it is totally dependent on your preferences and your values. \n\nI value independence. I love being able to do things on my own and deal with things on my own. Finally getting my own place was HUGE for me. Sure, it was/is expensive. Rent ain’t cheap. But I value that independent experience way more than being able to save some money.", "author": "dukwrth", "created": 1586800216, "upvotes": 8}, "fnalkp5": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnalkp5/", "text": "Thinking about this too and what always gets me is the hidden costs. I can live at home for very little, or I can go out and get an apartment and get nickled and dimed to death and add to my stress even more. The plan right now is to move out for my junior and senior years if I have enough money by then.", "author": "zachlinux28", "created": 1586799602, "upvotes": 8}, "fnalh7z": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnalh7z/", "text": "If you don't hate living at home, there's more benefit to living with them and saving that money you would have paid on rent.", "author": "symmetrical_kettle", "created": 1586799555, "upvotes": 31}, "fnah2vt": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnah2vt/", "text": "Privacy. I love my family but they can be too much at times. Also you can do whatever you want when you want. Freedom. \n\nGranted, you have to pay rent, and I wouldn’t blame you for not moving out till after college when you have a job and stable income.", "author": "TWR3545", "created": 1586797389, "upvotes": 76}, "fnaf1on": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaf1on/", "text": "Personally, it was a great move for me academically and socially. Here’s why:\n\nAcademically: My mother tends to nurture a lot and my dad is a very “go go go” person. Because of this, doing school work at my home is hard with my mom always checking on me and asking what I’m doing or what I need or If I’m okay. Along with that my dad is always asking for help doing stuff, home projects, things like that. Moving out allowed me to set my own routines and my own schedule and get into a groove to do things at a set time that I choose to make sure they get done! At home you’re just at the mercy of your parents or maybe siblings!\n\nSocially: My parents were always super welcome as far people coming over and me coming and going! With that being said, I was always uncomfortable coming home late or people staying over late because I worried about waking my parents up accidentally or them worrying about when I was coming home, so moving out alleviated some of those concerns!\n\nHope this helps!", "author": "HomelessSecretary", "created": 1586796367, "upvotes": 682}, "fnaeoiv": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaeoiv/", "text": "you can bring a girl home", "author": "49_1", "created": 1586796183, "upvotes": 254}, "fnaehuf": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnaehuf/", "text": "Depends on you and your mindset, my friend. Personally I moved out of the house because, although I love my parents, I can’t really stand being at home and living on their terms. I crave financial and social independence. My mother is predisposed to narcissism, so living with her throughout high school where I was already miserable and stressing about my grades 24/7 was... not good for my mental health. After I moved out of the house I started to feel more like an autonomous individual with healthy boundaries whose perceptions of himself weren’t dictated by his environment, as a direct result of not being among my family constantly or in the (in my opinion) toxic environment of my hometown. \n\nHowever, if none of these things sound applicable to you and you like living with your family and the support they provide you, then why move out and burden yourself with the rent, since that is a pretty hefty undertaking for any college student as you said. For me, $700 of rent is a damn good deal for my independence. But perhaps you could better spend that money elsewhere? It’s up to you, ultimately!", "author": "aadmiralackbar", "created": 1586796091, "upvotes": 233}, "fnae048": {"link": "/r/college/comments/g0m7v6/what_are_the_benefits_on_moving_out_of_your/fnae048/", "text": "In my culture, college (in most cases) represents the freedom and the opportunity to become independent and individualize yourself. Living away from your parents can have a huge impact on that in my opinion and your whole experience in general. Obviously there are negative effects as well however what some see as negative, others are as positive. Regardless: \n\nPositive (just some I can think of)\n° you are allowed freedom and a chance to explore things that you couldn't/did feel comfortable \n° less stress form your family\n° expectations aren't in your face as much \n° you learn a lot of valuable thing from living with others who differ form you \n° you get the real \"college experience\"\n\n\nNegative (some )\n° expensive \n° you might not like the people you live with (part of a growing experience in my opinion) \n° less pressure from you parents to do well and you'll have to hold yourself accountable (I would consider this also a positive ) \n\nWith a this being said, I couldn't afford to go to a four year college and I've been working full time and going to s hook full time at a community college which is an extremely different experience. I always dreamed of going to a four year college and having that experience but it just wasn't a reality for me. So I would say if it's doable within reason. Just do it. You can't put a price on good memories and experiences that will help shape you into an independent, individual.", "author": "TeddieC", "created": 1586795845, "upvotes": 45}}}