{
  "sid": "px25sg",
  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/",
  "title:": "(19F) How can I escape hookup culture?",
  "text": "So I've never been in a relationship or done anything intimately. I'm a freshman in college and all anybody seems to wanna do here is hookup :/ and personally, all I want is to just have a relationship for a few months. I went to all girls school for some context...it wasn't because I was waiting. A few nights ago, my cheating floormates have a threesome in my shared shower. I mean people are freaky. I'm assuming it's because they're out of the highschool relationships phase and just want to experiment....but I'm not even at stage 1 of kissing. People always tell me \"Oh well relationships aren't worth it, and heartbreak sucks....\" but I'd like to atleast experience it to learn. I mean I want to get married one day and I'd like to atleast know how to be with someone. I feel so behind. Like I get excited at the idea that guys would even so much as put their arm around me on the couch watching a movie. And people just say \"awww that's cute, you don't even know how to cuddle.\" It doesn't help that people get shocked when I tell them I haven't had a boyfriend before. All I really want is to feel important to somebody for a little while y'know. Anyways, what can I do? Where do I begin? I'm lost & confused...I need help.",
  "author": "OkSherbert4977",
  "created": 1632819174,
  "over_18": false,
  "upvotes": 916,
  "upvote_ratio": 0.97,
  "comments": {
    "heqxs62": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heqxs62/",
      "text": "Take it slow and don't put out on the first date. People who just want hookups generally filter themselves out quickly.",
      "author": "LordofDsnuts",
      "created": 1632937182,
      "upvotes": 1,
      "replies": {}
    },
    "heqxpfy": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heqxpfy/",
      "text": "Most of the stuff already said has been very good advice. Something I would add is to find a good friend group who is supportive of your mindset, even if they don’t share it. I’m a 21M in college and I personally prefer the hookup thing rn but my best friend is more of the relationship type like yourself. When we go out, our differences in mindset never becomes an issue because there’s just a level of respect there. I know in college, especially as freshman there’s a lot of added pressure to get out there but if you find the right friends, they can really take away some of that pressure & help you stay true to yourself.",
      "author": "ryc22vvvx",
      "created": 1632937150,
      "upvotes": 1,
      "replies": {}
    },
    "hep853k": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hep853k/",
      "text": "There are plenty of normal guys who want a relationship. But if you fall for the guy who is too attractive, keep in mind that you might get heartbroken",
      "author": "1selfconscience1",
      "created": 1632904337,
      "upvotes": 1,
      "replies": {}
    },
    "hep5l7l": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hep5l7l/",
      "text": "I’m a 24 gay female(never been in a relationship and have only kissed a couple girls) in my last semester of college and I’m the same boat as you. I’m not into hookup culture as I’m really old fashioned. I’d honestly rather court someone then date them. But instead of focusing my lack of experience with girls, I focus on other  hobbies/interests like school , church, my cyber security career, comic books. So try pursuing a few hobbies, join clubs, etc and you’ll find someone who wants a real relationship, hopefully we both will. Hang in there!",
      "author": "future_CTO",
      "created": 1632901988,
      "upvotes": 1,
      "replies": {}
    },
    "heoydcv": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoydcv/",
      "text": "CHEATING Room mates?",
      "author": "kiesoma",
      "created": 1632896033,
      "upvotes": 1,
      "replies": {}
    },
    "heoyc8t": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoyc8t/",
      "text": "It sounds like you’re putting a lot of pressure on yourself to find what you’re seeking and maybe feeling insecure about your own background and where you feel you stand in comparison with your peers. You’re not alone or weird though, trust me! What you’re hoping for is honestly more likely to come to you when you’re minding your own and least expecting it, in my experience.\n\nHookup culture often seems a lot more pervasive than it actually is honestly, so don’t be fooled into thinking you’re the only romantic left at your school. With college being a time of exploration, yes, a lot of people go about that sexually, but so many people go for romantic exploration, too. Both are equally valid! You just have to make sure you’re looking for your fellow romantics in the right places—you’re probably more likely to meet who you’re looking for in your study group for bio than you are in the club on the weekend, for example. It’s also going to help if you’re communicating your intentions clearly when you start talking with someone—saves a lot of wasted time and hurt feelings for both parties when you’re up front about what you’re looking for.\n\nOverall, be patient with yourself and enjoy the journey—keep talking to and meeting people in your classes, clubs, dorm, etc and don’t be afraid to take a social leap every so often. Allow yourself to just see where things go when you let them develop naturally! Again, odds are the opportunity you’re hoping for will come the moment you stop looking for it, at least that’s been my experience, personally. Remember there’s nothing wrong with where you are now or what you’re doing. Don’t let your fun college years of self discovery pass you by because you’re spending it all yearning for romance, keep doing you! It sounds like you just have to get out there and see who you click with. Have fun! :)",
      "author": "sarbm",
      "created": 1632896008,
      "upvotes": 3,
      "replies": {}
    },
    "heowblp": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heowblp/",
      "text": "As a guy my best advice would be find a guy you think is attractive. Talk to him like you would a new friend, super easy to do before classes each day, then do stuff around campus together, events, class, study, eat, etc. If you like his personality just ask him if he wants to go on a date. Do all that within a week or two, too long and you'll be friend zoned. Girls hardly ever make the first move and if you wait around for a guy to do it you might graduate by then.",
      "author": "Dylan-the-villan",
      "created": 1632894546,
      "upvotes": 1,
      "replies": {}
    },
    "heouzmn": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heouzmn/",
      "text": "First of all, others don’t make personal choices for you, you make them for yourself. Many people choose to allow others and their environment to influence them heavily in their personal choices, but that is their choice too. If you don’t want something and you have the control to decide whether you do it or not, don’t do it. This, however, takes a strong will and a personal concept of yourself that isn’t easily influenced by what you see going on around you. And that’s particularly true when everybody else seems to be doing what you don’t like, but you still don’t do it because you simply don’t like it (and it doesn’t matter to you if you are the only one who doesn’t like it). So, I will answer your question now and give some advice too. I know this isn’t easy because I myself haven’t found this “special person” yet, but this is an answer indeed. The answer or solution to “escaping hookup culture” is to find another person of the opposite sex who does not like hookup culture either; who cares more about long-term happiness and love than about quick pleasures; and who, indeed, values love and a deep spiritual-connection more than just thrills and orgasms (note: you can have both, but it is far more common to NOT find the first, because it takes a special kind of person to choose to be that way). So, how do we find these people who don’t fit with hookup culture and who want true love ❤️? Here comes the advice 😉. They are good-hearted people. So, that’s the #1 quality that you should look for then. The problem is that for dating, sex, and relationships, the majority of people don’t have that quality as their true number 1 must-have. Even nice people have qualities, such as exciting, interesting, or cute, in a higher ranking than good-hearted. However, if you want long-lasting and reliable love, the person has to be good-hearted. Someone who isn’t is far less likely to live up to the “one true love” dynamic, because that’s not what they value the most or what makes them happiest. The #2 is that this person has to care about this stuff (like I do, for example). Even if they are good-hearted nice people they might not be necessarily looking for “the one” when you talk. So you will have to ask them what they think about it to get a better understanding of whether they are truly seeking the same you seek or not. Finally, I want to point out that these nice or friendly people with a heart of gold (who are more likely to be “true love prospects”) will not have toxic friends and they typically do not come from toxic parents either. You really can tell a lot about anyone if you know who their favorite friends and their parents are.\n\nIn short: look for other people that hate hookup culture too; look for those that want true love and that aren’t reluctant about saying it if they are questioned about it. How to identify them? They have non-toxic friends and parents, and they don’t add toxic people to their life.\n😉😎",
      "author": "BooksLoveTalksnIdeas",
      "created": 1632893607,
      "upvotes": 2,
      "replies": {
        "hep2m2a": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hep2m2a/",
          "text": "Thanks man. And you can still give advice if you haven't found the right person yet....I find it annoying when people say you can't. I'll certainly be on the lookout :)",
          "author": "OkSherbert4977",
          "created": 1632899437,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "heou8u5": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heou8u5/",
      "text": "I'm 24 (M) and have only had one \"GF.\" And that was back in high school, so didn't even feel legit. \n\nUnfortunately, the hookup culture is pretty rampant wherever you go. I go to a religious school so it's not nearly as bad, but the mindset of most people is still the same. \n\nOverall though, do what makes you comfortable and be true to yourself. Like others have mentioned - have a relationship because you want to get to know and be with the INDIVIDUAL, not because you want a *relationship.* \n\nI promise if you set boundaries and standards for yourself beforehand it'll make life a lot easier when people are trying to push you to do things that may not be in your comfort zone. Just remember not to be critical of others for choosing to live differently from you, and you can expect the same respect from them. \n\nAs for how I get away from it, I find groups and sports that get me connected with others! Everywhere you go you should be able to find people like yourself that want to create meaningful friendships (and later on relationships). It just takes a little more work considering how those individuals seem to be the needles in the haystack.",
      "author": "ParkertheLarker",
      "created": 1632893082,
      "upvotes": 1,
      "replies": {}
    },
    "heom525": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heom525/",
      "text": "The good thing is that you can directly choose whether you want to participate in hookup culture. The other good thing is that you can also choose who you hang out with in college. If you are more inclined to get wasted 3+ times a week, smoke out of a bong and attend sorority parties, then you are probably ending up engaging in hookup culture. The easiest way to weed out people would be to clearly state that you are not going to have sex with them for the first 6 months/1 year of the relationship...or be even more ambiguous with it. If you sleep with a new guy after 2/3 weeks you are practically just hooking up with them.",
      "author": "DieSchungel1234",
      "created": 1632887977,
      "upvotes": 2,
      "replies": {}
    },
    "heokxj5": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heokxj5/",
      "text": "If only more girls were like you lol",
      "author": "LordPotaticus",
      "created": 1632887285,
      "upvotes": 0,
      "replies": {}
    },
    "heoiujr": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoiujr/",
      "text": "You can't",
      "author": "Gj_FL85",
      "created": 1632886144,
      "upvotes": 1,
      "replies": {}
    },
    "heoekpm": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoekpm/",
      "text": "When I was 19 and into my early 20s I was too focused on being in a relationship I didn’t care who I was in a relationship with. Take time to date and learn if YOU like someone enough to eventually be in a relationship. If you don’t want to hook up or kiss someone you don’t have too. Just be clear about your expectations and boundaries.",
      "author": "kitkat616",
      "created": 1632883938,
      "upvotes": 1,
      "replies": {}
    },
    "heo95jd": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heo95jd/",
      "text": "My wife was the only girlfriend I ever had and we were each other's first kiss! I was 22 and she was 25. Neither of us were interested in dating unless it was going to lead to marriage. It just seemed silly.\n\nYou seem to have a good head on your shoulders, so perhaps the best advice I can give you is to trust your instincts! You're already making wiser choices than your peers. Don't let them talk down to you. \n\nHaving been the guy whose (often younger) friends said \"we'll tell you when you're older\", I can honestly say that I have a healthier marriage now than most of them, and others have no such relationship at all. \n\nYou're doing it right. Just keep it up and you'll find someone who respects that and wants the same thing.",
      "author": "scubasam27",
      "created": 1632881336,
      "upvotes": 3,
      "replies": {
        "heouan4": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heouan4/",
          "text": "Thanks man! I appreciate it! People really make you feel like crap about it...but I'm gonna keep searching.",
          "author": "OkSherbert4977",
          "created": 1632893118,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "heo0hof": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heo0hof/",
      "text": "Wanting to have a relationship for a few months is exactly why we wanna hookup like lmao what’s the point?",
      "author": "ButterscotchJust4",
      "created": 1632877280,
      "upvotes": 1,
      "replies": {
        "heo7og2": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heo7og2/",
          "text": "Wdy mean? Giving a person my body for a night rather than establishing a connection with someone for a few months or years or decades and doing it is certainly ideal and a lot more special. I'm not cheap and I'm not gonna sell my body for thrill seeking.",
          "author": "OkSherbert4977",
          "created": 1632880650,
          "upvotes": 0,
          "replies": {
            "heocq7x": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heocq7x/",
              "text": "You said you wanted to have a relationship for a few months, as if you’d just break up with them as soon as y’all move out and not around each other anymore, there’s no point in doing that you don’t build a bond with someone and not be around them anymore",
              "author": "ButterscotchJust4",
              "created": 1632883040,
              "upvotes": 1,
              "replies": {
                "heouity": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heouity/",
                  "text": "Well as soon as I move out of college? Yeah...because I wanna see what else is out there besides the person I've been with. I'd wanna spend time alone to see the world and figure out my purpose in it all. I'm not gonna be with someone from half way across the world because of our \"bond\" as you put it. I take experiences as they come and every relationship is a memorable experience no matter if it's over or not. It's like if your spouse died, is it over? No...because that person made something of your life. Hooking up with someone is just a temporary fix to something that could be really special.",
                  "author": "OkSherbert4977",
                  "created": 1632893278,
                  "upvotes": 1,
                  "replies": {
                    "hepmyoi": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hepmyoi/",
                      "text": "Do you realize that could damage the other person too? Like if the other person really into you. He thought it is going somewhere and you suddenly break up with him. You do realize that is hella hurt right? That why men like to date people with experience because relationship can harm people mentall.y",
                      "author": "Ashamed-Sandwich8518",
                      "created": 1632916375,
                      "upvotes": 1,
                      "replies": {
                        "her075m": {
                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/her075m/",
                          "text": "Break up with him over unshared conflicts or leaving states? I'm not into long-distance & I'll make it clear that I don't want to stay with someone in different places in the world. Never been in a relationship, but I'm not romanticizing this idea that we'll just live happily ever after...because frankly, I don't wanna marry the first person I get with because that's all I'll know.",
                          "author": "OkSherbert4977",
                          "created": 1632938163,
                          "upvotes": 1,
                          "replies": {
                            "herw5z0": {
                              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/herw5z0/",
                              "text": "Chance are, most guy wont be interest in the relationship with you. Because that sound like a normal friendship not a relationship. A relationship is a bond between two people. 😐",
                              "author": "Ashamed-Sandwich8518",
                              "created": 1632951282,
                              "upvotes": 1,
                              "replies": {
                                "heu2sh3": {
                                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heu2sh3/",
                                  "text": "Wdym? We'd be in a relationship bruh. I'm saying realistically I won't marry the first guy i fall in love with & I won't be doing long-distance...how is that a normal friendship & why does that mean a guy won't be into me?",
                                  "author": "OkSherbert4977",
                                  "created": 1632998621,
                                  "upvotes": 1,
                                  "replies": {
                                    "hff5ks9": {
                                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hff5ks9/",
                                      "text": "You dont understand relationship. A relationship is an investment that lead to marriage. If the end goal is to break up then it is not worth to pursue. This is why a lot of women end up being single in 30. Just because he is your first guy, doesnt mean he isnt the best guy for you. If your mind already thinking of break up then might as well not get involve in a relationship. It is pretty heart breaking for both, and we know who benefit from it. Only you. \n\nI'm speaking from perspective of someone who is in relationship before, and talk to many people who went through break-up and down side of relationship. \n\nI know one girl who break up with her bf so she could explore her option out there. She ended up being single around 36 while the dude found someone better, that love him. \n\nFor your answer, I would not date anyone who think about going to a relationship, just to break up. Like other guy said, it pretty much like hook up. I would suggest you to find a guy friend and just befriend with him. Learn about men first before get into any relationship. Also look, dont matter much for dude who into relationship vs someone who into hook up. So we pretty much dont give a shit if you are hot. Sex maybe but not going to invest more time on someone we know will break up with.",
                                      "author": "Ashamed-Sandwich8518",
                                      "created": 1633392443,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "henzqo4": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henzqo4/",
      "text": "I was in your exact position 1 year 9 months and 28 days ago. I promise you that if you wait out for the right person, you’ll be “brought up to speed” in every way you currently feel behind before you know it. It will happen eventually, and it will be so so so worth waiting for someone who respects you.\n\nMy girl changed my whole universe and after almost 20 years without so much as a hug from a girl, all my terrible insecurity and worries disappeared before I knew it.\n\nWaiting for someone with whom you can share mutual respect, someone who’s foundational beliefs align with yours, someone who appreciates you, and someone who you can see being great friends with will be so worth it. I promise. \n\nYou’ll find him :)",
      "author": "jesuscrikey",
      "created": 1632876927,
      "upvotes": 1,
      "replies": {}
    },
    "henz5ht": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henz5ht/",
      "text": "I think you're doing fine. There's no rush. At least you don't have to live with any regrets about previous sexual partners. You're going to find someone eventually, and you'll know what it's like to be in a relationship. You escape hook up culture by sticking to your principles and waiting for someone who will treat you right and respect your pace. Start by talking to more guys and being outgoing, show them you're interested, and maybe ask them to \"hang out\". \n\nMost guys are really easy to talk to, and some are just as shy as you. Think of your conversations and chances to find out more about them and if you have things in common.   \nStart off as friends. Talk and meet new people, that's what dates mean, or at least what I think they mean. You don't have to hook up right off the bat.  Go somewhere public for your first date so you don't feel pressured into anything. Getting a boyfriend/girlfriend for the first time is nerve wracking, but I promise once you break the ice it'll all feel natural.\r  \n\r  \n\r  \n\r  \nIn the meantime, I'd keep my eye out for [shower jellyfish](https://www.urbandictionary.com/define.php?term=Shower%20Jellyfish) and maybe talk to your room mates LOL",
      "author": "Nighthawk68w",
      "created": 1632876652,
      "upvotes": 1,
      "replies": {}
    },
    "henyqjt": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henyqjt/",
      "text": "I think you're doing fine. There's no rush. At least you don't have to live with any regrets about previous sexual partners. You're going to find someone eventually, and you'll know what it's like to be in a relationship. You escape hook up culture by sticking to your principles and waiting for someone who will treat you right and respect your pace. Start by talking to more guys and being outgoing, show them you're interested, and maybe ask them to \"hang out\". Go somewhere public so you don't feel so pressured. Talk and meet new people, that's what dates mean, or at least meant. You don't have to hook up right off the bat. Getting a boyfriend/girlfriend for the first time is nerve wracking, but I promise once you break the ice it'll all feel natural. \n\n&#x200B;\n\nIn the meantime, I'd keep my eye out for [shower jellyfish](https://www.urbandictionary.com/define.php?term=Shower%20Jellyfish) and maybe talk to your room mates LOL",
      "author": "Nighthawk68w",
      "created": 1632876458,
      "upvotes": 1,
      "replies": {}
    },
    "henwimr": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henwimr/",
      "text": "same but man",
      "author": "RocketPG_",
      "created": 1632875415,
      "upvotes": 1,
      "replies": {}
    },
    "henu2th": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henu2th/",
      "text": "I know tons of people who didn’t date in college and never dated seriously throughout. It’s no big deal and your choices are yours to make",
      "author": "ludgatedwyer500",
      "created": 1632874265,
      "upvotes": 1,
      "replies": {}
    },
    "henrnxa": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henrnxa/",
      "text": "20F here and I also have zero experience whatsoever. I'm kind of just waiting for that magical moment at this point but I am complete dogshit at talking to guys lol. So I feel you.",
      "author": "bcyega",
      "created": 1632873120,
      "upvotes": 1,
      "replies": {
        "heouvv2": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heouvv2/",
          "text": "It's the people who say \"keep waiting\" that bother me the most in this respect 😓 I mean I swear to god if I were inevitably still single at 40, people would continue to say the same thing.",
          "author": "OkSherbert4977",
          "created": 1632893534,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "henrme2": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henrme2/",
      "text": "I just don't participate in the culture. That is all! Got to find someone like you, and you will find someone eventually",
      "author": "Forest_Warden",
      "created": 1632873100,
      "upvotes": 1,
      "replies": {}
    },
    "heno6wq": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heno6wq/",
      "text": "I did not start having actual relationship experiences until I was about 21. Some of my friends were even older than that. You have PLENTY of time to experience these things and if anyone makes you feel bad for not having had that experience by now then don't hang around them because it is nothing to be ashamed of and they likely value themselves based off of their body count instead of actual qualities. Also, I know you want to have a relationship and see what is it like but that is not a good reason to do it. Take it from me, someone who had the same thought, doing something just to see what it is like because you feel like you are missing out leads you down a bad road because you could easily get into something unhealthy just because you want to \"catch up.\"\n\n&#x200B;\n\nJust meet people with no expectations and when you connect with someone and like them, it'll happen naturally. Don't rush it. Don't force it. All you need to do is focus on school and having a bit of fun with friends etc and you'll probably meet someone you like that you can move forward with. Just be honest about your intentions when you do to avoid confusion.",
      "author": "djt977",
      "created": 1632871488,
      "upvotes": 1,
      "replies": {}
    },
    "henngd2": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henngd2/",
      "text": "This is me. Except I’m a guy. Same, would love to put my arm around in my school.",
      "author": "elpresidentdeusa",
      "created": 1632871146,
      "upvotes": 1
    },
    "henmbgd": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henmbgd/",
      "text": "Focus on your studies and everything else will fall into place. Don’t even worry about dating. It’s overrated when you’re young anyway.",
      "author": "jillianthekitty",
      "created": 1632870612,
      "upvotes": 1,
      "replies": {}
    },
    "henlzth": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henlzth/",
      "text": "Just go out with friends, tell them to invite their friends, befriend their friends and repeat until you find someone whose company you truly enjoy, invite them out when you go out, and just be there. Good relationships just happen but only if your out in the world living life.",
      "author": "Cookies_n_Chemistry",
      "created": 1632870460,
      "upvotes": 1,
      "replies": {}
    },
    "henlgui": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henlgui/",
      "text": "As a grad student how do I get into hookup culture??",
      "author": "aniche15",
      "created": 1632870218,
      "upvotes": 2,
      "replies": {
        "henqpj4": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henqpj4/",
          "text": "Tinder apparently",
          "author": "OkSherbert4977",
          "created": 1632872665,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "heniepc": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heniepc/",
      "text": "Lady, you’re coming here for sex and relationship advice?",
      "author": "SpartanElitism",
      "created": 1632868797,
      "upvotes": 1,
      "replies": {}
    },
    "henbctr": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henbctr/",
      "text": "Yeah I (18M) am in pretty much the exact same boat. I generally don't hang around the people that are constantly hooking up though. I'm aware of them, but don't know them.\n\nA few days ago I was with some people I know and one of them decided to share Rice Purity Scores. Most of theirs were around 50-70, and mine was 98. One of my friends had 99. It was kind of weird, but it was nice to know I'm not the only one. There's probably plenty of people around you dealing with the same thing.",
      "author": "og_math_memes",
      "created": 1632865609,
      "upvotes": 1,
      "replies": {
        "heov0da": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heov0da/",
          "text": "See I'm 73 but have none of the sex stuff on there. My friends are like 40s, 50s, and early 60s.",
          "author": "OkSherbert4977",
          "created": 1632893621,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hen5xtm": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen5xtm/",
      "text": "Pretty easy, anybody pressure for sex is a redflag. You just need to cut them off. Find the one that wants to get to know you.",
      "author": "Ashamed-Sandwich8518",
      "created": 1632863263,
      "upvotes": 1,
      "replies": {}
    },
    "hen4mm2": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen4mm2/",
      "text": "Well if you want to avoid hookups you're going to have to actually go on dates. That means asking people out or getting your friends to tell someone to ask you out. You should start doing this now, but give it a month and cuffing season starts and you'll be in an even better position.",
      "author": "Quantum_Aurora",
      "created": 1632862724,
      "upvotes": 1,
      "replies": {}
    },
    "hen44cy": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen44cy/",
      "text": "You seem like a good person. Avoid hookup culture at all costs. It mentally ruins people. Do not listen to those saying to engage in hook ups.",
      "author": "MiZiSTiK",
      "created": 1632862519,
      "upvotes": 2,
      "replies": {}
    },
    "hen1p7n": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen1p7n/",
      "text": "I can assure not everyone is looking to hook up but the people who are looking for something real just aren't as open about it",
      "author": "CaprioPeter",
      "created": 1632861516,
      "upvotes": 1,
      "replies": {}
    },
    "hen1b08": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen1b08/",
      "text": "(20+ F) I just recently graduated this year and I can definitely feel your pain. I so badly want a genuine relationship with no hookups or leading me on just to sleep with me and dump me, type of dynamics. \n\nIn college I had finally went on Bumble one day and met this amazing guy who I thought was everything I could want in a man, but when I met him in real life I felt almost no attraction and got turned off from how pushy he was about saying I’m the love of his life, etc. I had never kissed anyone in my life and I was like 20yrs old at that time. He went in for a peck and I was frozen with my eyes wide open. I realize I just couldn’t love him as much as he loved me and broke it off the next day. He was my first ever “boyfriend” (he asked me to be official with him that night and I agreed only because I was overwhelmed by him). He wasn’t a dude looking for hookups or anything, but going through that taught me something about myself. I needed to stop playing up the idea of ✨Relationships✨ and start to be honest with myself. I needed to be 100% honest with any guy that I date and tell them what I’m looking for and my comfort levels. I don’t want a fast paced relationship where someone’s asking to marry me after 3 months or a guy who only want to sleep and dump me, etc. My advice is to be true to yourself and don’t give in and settle for a relationship just to be in one. If a guy asks you out, get to know him and have an honest conversation. Me and my date from that day had a deep conversation about what we wanted and we both had some of the same boundaries and some differences that we would’ve needed to work out. Being honest is necessary in a relationship.\n\nMaybe you’re feeling “left behind” or “rushed” to be in a relationship. We all desire it, but we have to do what’s best for us in this moment in time. I haven’t dated since that last guy, because I realized that I have a long time to lol for someone or for someone to find me. I’m only in my early 20s and will definitely be going through so many different stages of my life right now. Maybe my future husband is the man who will sit next to me in my next job? Maybe something crazy will happen and I’ll be sent to Singapore and I’ll find him there? Who knows! All I know is that I don’t want to settle for a relationship I don’t want. And the only way to escape that is to keep moving forward and waiting till things feel right. There are plenty of men in the world and many of them are looking for serious relationships, but maybe you just haven’t met them yet. And out of that group there will definitely be a man you’re meant to be with. Don’t lose hope and just push through. Maybe you’ll look back and see that it was worth it. Sorry for the mega rant, but clearly I’ve thought about this issue a lot bc I’m having that same struggles lol.",
      "author": "Attackonfeelingz",
      "created": 1632861346,
      "upvotes": 2,
      "replies": {}
    },
    "hemwr3n": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemwr3n/",
      "text": "Get on tinder and look. Trust me it’s out there, I found my fiancé in college on tinder. You’ll have to sort through some people, but people are out there looking for the same thing.",
      "author": "Conservationforhire",
      "created": 1632859260,
      "upvotes": 0,
      "replies": {
        "heotu1r": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heotu1r/",
          "text": "I've had some horrifying experiences on that app, a bit nervous to try it out again :/",
          "author": "OkSherbert4977",
          "created": 1632892805,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hemwotv": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemwotv/",
      "text": "You literally said all I Wanna do is have a relationship for a few months that is not far from just hooking up in my opinion",
      "author": "Material-Zone4685",
      "created": 1632859231,
      "upvotes": 1,
      "replies": {
        "heov6kq": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heov6kq/",
          "text": "Because realistically my first relationship will only be that long due to experience...and the fact that I'm in college. Inevitably it could go on longer and become years but I just don't think that's gonna happen for my very first relationship...but who knows. Each relationship & friendship is a new experience.",
          "author": "OkSherbert4977",
          "created": 1632893738,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hemwe4l": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemwe4l/",
      "text": "I understand it can be tough to be around hookup culture especially since college normalizes it. But college is really about finding yourself. Some people do that by experimenting sexually or with drugs, but you do not need those things to be happy. In fact, the most important thing is focusing on yourself.\n\nI am currently in a long distance relationship, so at times, I feel alone. While it sucks to be in a LDR, it has really helped me to develop who I am as a person and grow as an individual. Growing separately has made my relationship with my partner stronger. I know I am currently in a relationship and you said you don’t have experience with romance, but I feel like this could also be useful information for you too. Just think: right now, your future partner is growing themself so that when the time comes to be with you, they are their best selves. That is what is most important in the end. The goal is finding someone that will value you.\n\nI know it may feel difficult to see those around you in relationships, but rushing into something for the sake of having “experience” is not worth it.\n\n— First off, heartbreak does not need to be from a romantic partner, it can be from friendships or really just any loss, so heartbreak will come with time as long as you have people that you care about in your life.\n\n— Secondly, ignore what others around you are doing. Most of the time people are just figuring life out, so it does not mean they are doing life correctly. Just because people around you are participating in the norms of the surrounding culture, does not make it right. There truly is no right way to live life and sometimes you just need to hop along for the ride.\n\nIn the end, you most likely cannot escape hookup culture. The college atmosphere especially surrounds you in it. You just have to be able stick to what you know will be good for you in the end: Meaningless relationships just to say you have gained “experience” or developing a deep connection with someone that you can spend the rest of your life with. Don’t rush things and make sure you find yourself in the process.\n\nTDLR: Focus on you and the rest will come. Ignore what others are doing and do what is best for you.",
      "author": "coolchickstar",
      "created": 1632859094,
      "upvotes": 2,
      "replies": {}
    },
    "hemuii7": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemuii7/",
      "text": "I'm in a similar boat, as much as you may feel like the only one, know that there are a few of us :) Make sure not to drop your standards out of desperation! I've gone on a few dates because I was lonely but really didn't like the people right off the bat. Absolutely not worth it.  I also tried dating apps in college, and while I honestly met some good friends off them, I think it's way more fun to meet someone organically. Hasn't happened for me yet, but personally I just try to talk to people in my classes, and join clubs. Try not to let people make you feel bad! Everyone experiences things at their own pace. I used to feel insecure but I know my time will come, and yours will too!",
      "author": "butterflybeans",
      "created": 1632858231,
      "upvotes": 1,
      "replies": {}
    },
    "hemtjh5": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemtjh5/",
      "text": "College is mostly about hookups. Apps such as Tinder is known for hookups.",
      "author": "Basic85",
      "created": 1632857837,
      "upvotes": 1,
      "replies": {}
    },
    "hemq1ww": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemq1ww/",
      "text": "I usually don't date 19 year olds, I just wine and dine them then fuck them and repeat once in a while.",
      "author": "i_went_to_gradschool",
      "created": 1632856417,
      "upvotes": -2,
      "replies": {
        "heosvam": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heosvam/",
          "text": "uhh…congrats?",
          "author": "readytofly68",
          "created": 1632892137,
          "upvotes": 1,
          "replies": {}
        },
        "heotvz4": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heotvz4/",
          "text": "Your point?",
          "author": "OkSherbert4977",
          "created": 1632892840,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hemnvl2": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemnvl2/",
      "text": "hookups are big where i’m at too, but there are a ton of people who aren’t really into it. make friends that are good people, and remember that good people know good people. they’ll likely introduce you to people who are similar to you and who knows what will happen there",
      "author": "cacklinrooster",
      "created": 1632855525,
      "upvotes": 1,
      "replies": {}
    },
    "hemmidl": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemmidl/",
      "text": "Its not a race, just go at your own pace, meet that special someone and enjoy. My only advice would be try to be little more open to an idea of meeting people ( actually having meaningful conversations ) and more confidante in your self, arter that it should basiclly work it self out. Although cant really say for certain because Ive never been in a relation ship ( 20M ), but Im pretty sure thats because I lacked those 2 things, mostly confidance. Just open up while staying true to your self.",
      "author": "NinjaBarrel",
      "created": 1632854969,
      "upvotes": 1,
      "replies": {
        "heovvim": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heovvim/",
          "text": "I'm really confident & I'm very good at talking to people....but I think people turn me down for a few reasons:\n\n1. I'm too confident & I'm very smart...a common theme I find with the girls I know who get guys super easily is that they act dumb. The way to get guy at my age is basically by acting like you don't know what they're talking about so they can explain it to you. You nod your head and look all dreamy eyed the whole time he speaks. So many people I know have told me this trick. I didn't believe it at first, until I tried it. It worked! A guy in turn liked me for the very first time in my life. Unfortinately, I'm not like that at all & I'm not gonna pretend to be.\n\n2. They get scared off by the fact that I've never been in a relationship or had much of any dating experience. I try not to answer questions about my dating history but when it comes up & I answer people generally get really turned off because they think that I'll be like their first highschool girlfriend that was clingy and ended badly.\n\nThe first one is definitely a difficult one for me. I think for me, I know I'm beautiful and smart and a great person and I don't need anybody to tell me otherwise. But I do want somebody who knows themself like I do to be my partner in crime y'know? I just want somebody think of me as important...much like anybody would want.",
          "author": "OkSherbert4977",
          "created": 1632894227,
          "upvotes": 2,
          "replies": {
            "hep45ps": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hep45ps/",
              "text": "Well all the things you pointed out is more of their problem than yours. I mean, I could go off on a rant explaining why are they in a wrong and why you should absolutly not change, but you said you were smart so I guess you already know all of that. \n\nAlso about not being in relationship once before 20 is nothinf that uncommon ( just read this thread lol ). So I would say you mostly met dumb,imature, insecure and now that is making you second guess your self. \n\nI CAN ASSURE YOU, there are guys who like smart girls and well....better is to say we dislike dumb girls with passion. For me personaly, I want a girl with whom I can be on equal grounds with, to tease each other, and enjoy each others company. First time i met girl who was all smart but teasy as well my mind was blown, I was unaware how intersting it can be just to talk to girls. ( you could maybe call this seduction ? Im not sure. ).\n\nNow, you could maybe try good old seduction, act dumb for first few minutes, than tease with smarts, than again dumb than again smarts ( I think you get the point ). This would show oposite sex who are into dumb girls and too scared off by smart ones that you are willing to play the game but not to change your self. Also know that if they dont want you just because your are confidante and smart, than they dont deserve you dear and that shouldnt even bother you. You will find your special someone who will love you for who you are ( those are rare but you said you dont want hookups, so wait and play thr game ). \n\nBut also know this. Dumb girls is the ones they want to have sex with, the smart ones are the ones they want to have an actual relationship. Its very insuferable to be constantly arouns dumb people, and rarely who can withstand it. So again if you are turned down because you show some spunk and fighting spirit, they never wanted a relationship in a first place. \n\nSorry for a longer post. But people our age are very fragile at this point and I though you needed to hear that you should never lower your self to some level just to please another. I wish you all of the best, and find that someone!",
              "author": "NinjaBarrel",
              "created": 1632900753,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hemh41a": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemh41a/",
      "text": "Best way is to focus on what you like. Have a fun hobby or just say no and spend time with people you enjoy being around.",
      "author": "Asian_Bootleg",
      "created": 1632852738,
      "upvotes": 1,
      "replies": {}
    },
    "hemetn3": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemetn3/",
      "text": "get a job",
      "author": "noogiey",
      "created": 1632851778,
      "upvotes": -2,
      "replies": {}
    },
    "hemcjqe": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemcjqe/",
      "text": "https://www.reddit.com/r/Republican/comments/ptblzx/my_english_class_is_having_a_whole_unit_about_the/?utm_medium=android_app&utm_source=share\n\nThat's probably why, if I had to take a gander.",
      "author": "Tennessean_Vamoose",
      "created": 1632850841,
      "upvotes": 15,
      "replies": {
        "hengmgt": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hengmgt/",
          "text": "Oh no, not pronouns in English class! *Would you think of the children!*",
          "author": "deprimada",
          "created": 1632867974,
          "upvotes": 9,
          "replies": {
            "henjbtt": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henjbtt/",
              "text": "This is why when answering an advice post, I always get a feel for the person writing it. One never knows what sorta' kooky gold they can find.",
              "author": "Tennessean_Vamoose",
              "created": 1632869228,
              "upvotes": 7,
              "replies": {
                "henmy7q": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henmy7q/",
                  "text": "I knew they were dripping in conservatism. You can just see the not so subtle slut shaming. Also that bs story in their post history about how they were supposedly shamed for looking like a virgin. $10 they were actually being all high and mighty about their stance and got rightfully dragged for it.",
                  "author": "deprimada",
                  "created": 1632870910,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hema3qv": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hema3qv/",
      "text": "The reality is hookup culture is a cancer and a result of a decadent society increasingly without God… I feel bad for any non-Christians trying to date other non-Christians, must be very hard lol.",
      "author": "MissNibbatoro",
      "created": 1632849834,
      "upvotes": -3,
      "replies": {
        "heoimbv": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoimbv/",
          "text": "You realize that plenty of secularists/non believers want an actual relationship and not just sex right? You also realize that as long as they don’t hurt others that people are within their rights to do as they please without being labeled degenerate?",
          "author": "DueYogurt9",
          "created": 1632886020,
          "upvotes": 3,
          "replies": {
            "heq06df": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heq06df/",
              "text": "> plenty want an actual relationship\n\nI suppose yeah there’s gonna be exceptions. Y’all are just sacks of meat and love is just a chemical reaction idk why yall would really want/have the capacity for a meaningful relationship and children\n\n> people are within their rights to do as they please without being labeled degenerate \n\nI never even said that but idc I think u can judge people for any aspect of their lives they have control over",
              "author": "MissNibbatoro",
              "created": 1632923341,
              "upvotes": 1,
              "replies": {
                "heqkky7": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heqkky7/",
                  "text": ">Y’all are just sacks of meat and love is just a chemical reaction idk why yall would really want/have the capacity for a meaningful relationship and children\n\nWho are sacks of meat? And how does this limit ones capacity of desire for a relationship and/or kids?\n\n\\> I never even said that\n\nI should have said decadent rather than degenerate.",
                  "author": "DueYogurt9",
                  "created": 1632931902,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hem9rnp": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem9rnp/",
      "text": "Have you considered religion",
      "author": "the_eddy",
      "created": 1632849697,
      "upvotes": -2,
      "replies": {
        "heou3ng": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heou3ng/",
          "text": "Lol yeah. Maybe I'll start now. I'll be celibate not out of my own choice & die without any experience.",
          "author": "OkSherbert4977",
          "created": 1632892983,
          "upvotes": 2,
          "replies": {
            "hepos1h": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hepos1h/",
              "text": "No I mean find a husband through a religious community, I’d recommend Catholicism but as long as it isn’t one of the murdery ones or the hippie ones you’ll be fine",
              "author": "the_eddy",
              "created": 1632917472,
              "upvotes": 1,
              "replies": {
                "heqzrhc": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heqzrhc/",
                  "text": "I'm Catholic but I just know deep in my heart that this will end in divorce if I marry in a snap.",
                  "author": "OkSherbert4977",
                  "created": 1632937984,
                  "upvotes": 2,
                  "replies": {
                    "heqzysb": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heqzysb/",
                      "text": "Well I would recommend trying to meet someone at mass, or maybe coffee and donuts after, a marriage which shares core values about the world is far more likely to succeed",
                      "author": "the_eddy",
                      "created": 1632938068,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hem9hzs": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem9hzs/",
      "text": "So, I’m not in college, but I feel the same way, I’ve always wanted a relationship, but I’ve never found someone who wanted the same, never even been apart of anything with anyone, granted I’m still young and have college to experience when I decide to go, but it’s just a very odd thing nowadays, not even sure I want one with all the risks nowadays involved in relationships.",
      "author": "HelperYamamoto",
      "created": 1632849590,
      "upvotes": 1,
      "replies": {}
    },
    "hem9ev1": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem9ev1/",
      "text": "In your late 20’s. By that age, you should meet women who are a little bit more mature, and know what they want.",
      "author": "GaLaXY_N7",
      "created": 1632849553,
      "upvotes": 0,
      "replies": {}
    },
    "hem95hc": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem95hc/",
      "text": "Don’t hookup for no reason. If you make it clear to a guy you don’t want to just hookup, but then he sticks around, then he’s worth considering.",
      "author": "Captainfatfoot",
      "created": 1632849447,
      "upvotes": 1,
      "replies": {}
    },
    "hem8mp1": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem8mp1/",
      "text": "Don't hookup...",
      "author": "mrqueezy",
      "created": 1632849235,
      "upvotes": 1,
      "replies": {}
    },
    "hem74of": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem74of/",
      "text": "Plenty of people aren't into hookup culture. The best way to avoid it is to not hookup with people, the ones who just want a casual hookup will get the picture. It will obviously take longer to find a relationship than find a hookup - not necessarily because no one is into relationships any more, but because people are naturally way more selective about who they enter a relationship with as they are going to want to make sure they are compatible with the other person - so don't be too hard on yourself if you don't find a relationship straight away. Just remember, there's nothing wrong with not partaking in hookup culture, and there is nothing wrong with partaking in it either - it's just about finding your own personal boundaries and enforcing them!",
      "author": "KittenSample",
      "created": 1632848625,
      "upvotes": 1,
      "replies": {}
    },
    "hem47bp": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem47bp/",
      "text": "Not everyone is interested in hookups. I personally can't do it. I also don't have meaningless relationships. There is no point to me. If I get into a relationship with someone it's because I have feelings for them and I want to commit myself to them and see us both grow together. Later on, we might grow apart but that's just a part of life. \n\nLike some others have said, DO NOT enter into a relationship just because you're desperate to be in one. It will never last and won't be an accurate representation of a healthy loving committed relationship (like what you would have in marriage hopefully). \n\nYou're only a freshman and you have a TON of time to gain experience before marriage. Focus on doing what you love, join a club, try new things and strive to be a better you. People interested in you will naturally gravitate towards you and you'll do the same for people who interest you.",
      "author": "Cerenya",
      "created": 1632847429,
      "upvotes": 1,
      "replies": {}
    },
    "hem06k8": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem06k8/",
      "text": "SNL monologue with Steve Martin: Thank you. How do you like the show so far? Okay, we’re havin’ some fun out here tonight, I guess, huh? [laughs] You know, a lot of people come to me, they say, Steve, you’re a ramblin’ guy, um, you must meet a lot of girls on the road. I’d just like to dispel that rumor. Uh, it’s kind of a myth about entertainers, uh, you know, you travel around from town to town, one night at a time and, you know, you don’t have time to meet anybody and, uh, I’m not into that one night thing, you know? I think a person should get to know someone and even be in love with them before you use and degrade them.",
      "author": "vicemagnet",
      "created": 1632845778,
      "upvotes": 2,
      "replies": {}
    },
    "helw342": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helw342/",
      "text": "I sort of relate to this, I'm 22 and have had no experiences whatsoever",
      "author": "thathomeboyoverthere",
      "created": 1632844098,
      "upvotes": 2,
      "replies": {}
    },
    "helw2gt": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helw2gt/",
      "text": "You’re not alone! I’m 19 and have never dated either. I can relate with a lot of what you wrote in this post. One thing that helps is to make friends who are supportive of you. If your friends belittle you because you haven’t had a relationship yet, get better friends. You deserve people who care about you.\n\nAs a freshman, it’s early enough in the year that it should be easy to find new people. Join clubs, talk to people in your dorms and classes. You will find other people who are like you and who don’t tear you down for your insecurities.",
      "author": "quasar_1618",
      "created": 1632844091,
      "upvotes": 1,
      "replies": {}
    },
    "helv5qg": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helv5qg/",
      "text": "I mean I’m pretty sure the majority of college aged kids would rather date than hook up but since it’s kinda the expectation of “college culture” it keeps being the more common of the two outcomes",
      "author": "charlesdickinsideme",
      "created": 1632843720,
      "upvotes": 1,
      "replies": {}
    },
    "helu9cr": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helu9cr/",
      "text": "This will sound stupid but straight up, just don't hook up if you dont want to. The ONLY people who judge you about that are the ones that peaked in HS and still bully people for the most menial bullshit, and you don't want to be around that crowd regardless. If people are only interested for sex, just say you arent and in my experience most people back off, if not make friends to have your back but trust me, its not hard to avoid that culture if you dont want to be in it.",
      "author": "AnnaMak",
      "created": 1632843348,
      "upvotes": 3,
      "replies": {}
    },
    "heltnt7": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heltnt7/",
      "text": "You say escape as if someone was \"chasing\" you and making you do something you don't want.",
      "author": "RageA333",
      "created": 1632843102,
      "upvotes": -3,
      "replies": {
        "heou0c0": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heou0c0/",
          "text": "It's a metaphor for peer pressure.",
          "author": "OkSherbert4977",
          "created": 1632892921,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "heltdco": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heltdco/",
      "text": "If you like podcasts Hidden Brain has an episode called Just Sex that talks specifically about how hookup culture is bullshit. It’s worth a listen.",
      "author": "way_pats",
      "created": 1632842982,
      "upvotes": 1,
      "replies": {}
    },
    "helqqxq": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helqqxq/",
      "text": "Just hop on a dating app and say you're only looking for relationships, you'll get like 100 matches",
      "author": "human-potato_hybrid",
      "created": 1632841890,
      "upvotes": -1,
      "replies": {
        "heotz55": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heotz55/",
          "text": "Yeah but then there's the issue of not being face to face and meeting up with suspicious strangers. I've been on a few dates with them and they were horrifying.",
          "author": "OkSherbert4977",
          "created": 1632892898,
          "upvotes": 1,
          "replies": {
            "heoy015": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoy015/",
              "text": "Make sure you text people for a few days before meeting them, and don't be too selective when swiping. You want to try for guys that aren't getting a whole lot of attention, but at the same time seem like good, well adjusted people.",
              "author": "human-potato_hybrid",
              "created": 1632895752,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "helq11u": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helq11u/",
      "text": "I’m pretty much in the same boat as you. I’m 19 and never had a girlfriend. I’ve fooled around a little bit with kissing and what not but I’ve never *done the deed* honestly I’ve just learned to wait and the right person will come around. I got tired of chasing and being rejected so for now I just focus on being a better version of myself everyday and someone will notice that",
      "author": "brysonhamersky",
      "created": 1632841585,
      "upvotes": 2,
      "replies": {}
    },
    "helo4jn": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helo4jn/",
      "text": "I know it’s probably not the answer you’re looking for, but hookup culture has always and likely will always be part of the college experience/lifestyle. Solely because of the setup; your years at college are likely the first and last time in your life that you will be surrounded by that many people of a similar age range in such close proximity with such little supervision. And apps like Tinder, which despite being advertised as a “dating” app, make seeking out hookups/casual relationships that much easier. So in this regard, since it will always surround you to some degree, there’s no *escaping* it. The most you can do is simply refuse to partake in it. \n\nThis certainly isn’t to say that you’re the only one on your campus not interested in the hookup scene. Far from it. There are hundreds if not thousands of other individuals at your school alone who feel and think exact same way as you. In my case, I knew it was there, but was never overly interested.\n\nRegarding a relationship, I’d agree with what u/nataliazm indicated; it’s better to wait and naturally meet someone you’d like to be in a relationship with than to pursue a relationship for the sake of being in a relationship. Otherwise, you’re sort of putting the chicken before the egg, so to speak. While there are a lot of positives associated with healthy relationships, there are also hardships, as people indicated. They require a lot of time, effort, and work to remain equally beneficial to both people.",
      "author": "bakedpotatowcheezpls",
      "created": 1632840775,
      "upvotes": 12,
      "replies": {}
    },
    "helnhm7": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helnhm7/",
      "text": "feeling exactly the same way!\n18f never properly dated have made out but nth further and ppl r always suprised by it!",
      "author": "trackxdreams",
      "created": 1632840508,
      "upvotes": 1,
      "replies": {}
    },
    "heln42o": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heln42o/",
      "text": "What you are seeing with your friends  is immaturity. I'm not saying they are wrong to experiment. That's not my business to tell them how to navigate their lives. But, that's how it appears to me. That these are young people off to college and on their own for perhaps their first time. And, they are experimenting sexually and possibly rebelling against their upbringing.\n\nBut, there are plenty of people your age that are looking for the same things you are, and there will, probably, be even more of them after freshman year.\n\nDon't let other people dictate what you should be looking for in a relationship, and pay no mind to what people think of your \"inexperience.\" It's none of their business, and it's nothing to be ashamed of.",
      "author": "peppyunicorn",
      "created": 1632840346,
      "upvotes": 3,
      "replies": {
        "hemzq3h": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemzq3h/",
          "text": "I don’t know if I would call it immaturity, different people just have different relationships to their sexuality. Some people, like op, need to be in a committed monogamous relationship with someone to engage in sexual activity while others don’t need to have a strong emotional connection to have sex. Neither approach is better or worse then the other.",
          "author": "SlickBlaster",
          "created": 1632860582,
          "upvotes": 1,
          "replies": {
            "hen3638": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen3638/",
              "text": "I was not saying anything about some people being polyamorous or not needing an emotional bond to have intercourse. I'm not saying there's anything wrong with experimenting either. In fact, I think I said the opposite. I was reacting to entire description of the behavior not just the sex part. And, I can't really speak about specific people I don't know. I can only say what I think it sounds like. \n\nI've been a freshman before. People sometimes use the opportunity to \"go wild.\" A lot of them quite frankly don't know who they are and a lot of them are having a late rebellion phase. A lot of freshman go into their sophomore year having a better understanding of themselves and more focused on what they want out of life. And a lot of these students, who get more into partying and sexual escapades, fail or drop out. I've seen it over and over. That's what this situation sounds like to me.",
              "author": "peppyunicorn",
              "created": 1632862127,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "heljdt2": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heljdt2/",
      "text": "just gotta hold out till you get away from college and meet people wherever you're going in the \"real world\"",
      "author": "jamdemp",
      "created": 1632838746,
      "upvotes": 1,
      "replies": {}
    },
    "helgfer": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helgfer/",
      "text": "It's okay. Do not try to force into any relationship. Whatever's supposed to happen will happen.\n\nI am almost 23 yo dude, and haven't been in a relationship ever.",
      "author": "panzerboye",
      "created": 1632837415,
      "upvotes": 30,
      "replies": {}
    },
    "helfpop": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helfpop/",
      "text": "20M, I just got out of a long relationship last year, and I'm at a new school now. It can be incredibly hard to get to know people overall. I understand your plight, i would try to start by literally just talking to anyone\nWhether it be someone in class or in a club or something!",
      "author": "AdultVirgin24",
      "created": 1632837092,
      "upvotes": 2,
      "replies": {}
    },
    "helfki8": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helfki8/",
      "text": "Yo, I'm a 22 male and I haven't done any of that. Even when I'm 25 I might not even able to hold hands :(",
      "author": "sakibaraki",
      "created": 1632837029,
      "upvotes": 12,
      "replies": {
        "henp4qs": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henp4qs/",
          "text": "Keep your chin up. As a male, as you get older and more experienced, you become much more desirable of a partner. Graduate college, get a decent job, you start to look a lot more put together.\n\nEven if you're clumsy romantically/sexually due to inexperience in that area, for some that can be more of an endearing trait or something for them to help you work through.",
          "author": "darkapplepolisher",
          "created": 1632871933,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "helf776": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helf776/",
      "text": "[deleted]",
      "author": null,
      "created": 1632836863,
      "upvotes": -1,
      "replies": {
        "helhodb": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helhodb/",
          "text": "It’s cope. Her body wants sex.",
          "author": "EvilBob_RapePants_",
          "created": 1632837982,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "helediu": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helediu/",
      "text": "I'm 18 and have a girlfriend of almost 3 years. Just fuck some random dudes the relationship isn't worth the loss of time.",
      "author": "Chemical_Chain_7234",
      "created": 1632836484,
      "upvotes": -8,
      "replies": {}
    },
    "hele0ck": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hele0ck/",
      "text": "I'm in a very similar situation. I'm 18M and I kind of want a relationship. I just feel like I want the experience, y'know? Like I want to have it under my belt even if it doesn't work out so that I know what I'm getting into later. So I decided to download Tinder and put in my bio \"looking for something real.\" 4 days later I'm going out with this girl who's also interested in a relationship. So I guess my advice would be to download a dating app like Tinder. You'd just have to filter out all the dudes looking for a hookup. Or of course, you could always ask someone out irl. Good luck, I'm sure you'll find what you're looking for.",
      "author": "matthewmoore7314",
      "created": 1632836313,
      "upvotes": 2,
      "replies": {}
    },
    "helbskb": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helbskb/",
      "text": "Never having dated at 19 is totally normal! Don’t let those other people tear you down. My advice would be to work on building solid friendships with people that you could see yourself dating first. It gives you a chance to see what kind of person they are, and if there’s a foundation of friendship it’s a lot less likely to be a hookup situation. I’d recommend joining a club at your college to meet people. Good luck!!",
      "author": "jennathebean",
      "created": 1632835270,
      "upvotes": 144,
      "replies": {}
    },
    "helawml": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helawml/",
      "text": "The people you hang out with is the best way to stay away from this trend imo. Don’t do shit you don’t want to do because you feel pressured and if necessary change the people you hang out with if they don’t share the same set of goals/values as you. Before Covid hit, I’d an email alert about sexual assault reports almost daily. If there are any ASU students here they can probably confirm this.",
      "author": "Entry_Murky",
      "created": 1632834842,
      "upvotes": 3,
      "replies": {}
    },
    "helaldc": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helaldc/",
      "text": "(Im 22 and fresh out of college) The best things always come when you aren’t looking for them. After desperately falling in short stupid “relationships” I caught on that these girls honestly just want to have sex. The relationship is kinda a muse to keep me goin. I was honestly like you an chasing my wife an blindly listening to bullshit words being told to me so I’d fall submissive an literally do what they want. An after a while I learned that sex isn’t everything so I cut the 🍆 out and gave them none! Shortly after things would fall apart and I end up single falling into the same cycle. Sadly lost my virginity to some abusive bitch who spent her 18-24 years of life grooming me when I was 13 so now I live with that everyday an think it’s why I have never found anything special an have been used until Luckily after spending months focusing on myself, going to the gym, finding things that I truly liked and enjoyed doing; I found a wonderful women who I grew a relationship with. We spent months talking about shared pasts, interests, blah blah blah. Started as friends and have been together since. I never intended on ever meeting this women. But somehow my soulmate found me ! Told me she doesn’t care about my past an only cares about NOW! Because that’s when we living.",
      "author": "OVOborn",
      "created": 1632834683,
      "upvotes": 14,
      "replies": {
        "helamkr": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helamkr/",
          "text": "It’s a lot but I hope this helps you feel better",
          "author": "OVOborn",
          "created": 1632834701,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hel9cws": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel9cws/",
      "text": "Hey miss, I just want to encourage you that you've gotten so far without the hookup culture and it's great. I would prefer you take your time to fall in love and even hope to God that your first love remains your only love. You'll have all the right clues to knowing it's the right person including the fact that the person won't be all about your body and sex but about knowing all there is to know about you and sharing about his life without restraints. Don't forget to celebrate your single life moments as much as you would celebrate your relationship moments with someone. College might make you feel pressured but please do your best to wait for the right person! Cheers!",
      "author": "hoblifer",
      "created": 1632834057,
      "upvotes": 3,
      "replies": {}
    },
    "hel8jt9": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel8jt9/",
      "text": "Wait until you are out of school. College is fast-paced regardless, plus you aren't behind by that much. There are many more people that have died alone than you have lived alone.",
      "author": "youareaweirdo___",
      "created": 1632833639,
      "upvotes": 2,
      "replies": {}
    },
    "hel7te8": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel7te8/",
      "text": "Don’t force it, the best things happen when you aren’t looking. Many also don’t believe in hookups. My personal opinion is that you should hold out to share those experiences with someone with whom you share a deep intimate connection with, not just some random person at a party…..having tasted both fruits, sharing something like that with someone you truly love and care about feels much better and seeds an even deeper connection than wasting your first experiences with someone you don’t care about and who is essentially using you for some personal pleasure. If I have learned anything from my life experiences, it’s that it’s not about you. It’s about that other person and doing something to please them. I don’t give a shit about what I feel, I want to make them have a good time and the other person should do the same so it creates a symbiotic relationship of mutual enjoyment and pleasure. Most likely a hookup will not do that for you. After ending a 2 year relationship with the love of my life who we both experienced everything together for the first time and then thinking that random hookups will make me happy after we split made me realize how important that connection is…..there was no feeling, there was no love, and there was no passion. There was no point of doing it anymore and from that moment on I realized what type of person I am and it’s not the hookup type. I also realized that there is nothing more In this world that made me happier than her, and I would do anything to have her be mine again, forever…..\nSorry to go on this rant but I promise you, everything happens for a reason, yes it may suck that you have not gotten to experience intimate things with someone else yet but don’t force it. Like I said before, the best things happen when you aren’t expecting it. And I promise you, coming from a guy, the things you said are desirable traits, at least in my own opinion. It shows that you value yourself and show value to intimate activities. So hang in there, use my mistakes as a lesson of what not to do. Or completely ignore what I said and make your own choice, whatever you choose, Just make certain that it’s the right one for you and no one else. Don’t let the “pressure of college” persuade you to change your values, take hold and don’t let go. Good things are on the horizon, there is someone out there for you who feels the same and will be everything you could ever want and more, and you will thank yourself for waiting on a relationship to explore the beauty of intimacy.",
      "author": "kylewardbro",
      "created": 1632833260,
      "upvotes": 23,
      "replies": {
        "hery99o": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hery99o/",
          "text": ">Good things are on the horizon, there is someone out there for you who feels the same and will be everything you could ever want and more, and you will thank yourself for waiting on a relationship to explore the beauty of intimacy.\n\nThis is a bit besides the point of the post, but while what you write is exactly what I desire, I worry that making one wrong step somewhere in life could make me miss the opportunity of meeting that person. What if I don't take that class? What if I don't go on that outing with my friends? And in the process pass by the person who could become the love of my life?",
          "author": "DueYogurt9",
          "created": 1632952204,
          "upvotes": 1,
          "replies": {
            "hes0d75": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hes0d75/",
              "text": "The biggest thing I have learned is to not live on what-if’s. What if I wake up today and slip and break my neck. What if i get diagnosed with cancer tomorrow, what if my ex comes back into my life. I have spend so much time in my life worrying about what if’s and trying to read the future but you will drive yourself insane. The future is scary, it’s uncertain and you don’t know what will happen. But you need to see the beauty in that. I never thought I’d meet that one special person but things just lined up and worked. I promise you, life has a very weird way of working. I am unaware on your religious beliefs but I can certainly tell you something that has gotten me through the rough times. “Everything happens for a reason”, you may not like the outcome but when one door closes another door opens. I often am placed on your shoes as well. I wonder what will happen with my relationship mainly, you read my post and understand my situation a bit and genuinely I am kind of lost without her. Yesterday would have been our 3 year anniversary and I still made sure to text her and she responded well. I hope that one day we will fix it because I truly believe in my heart and soul that she was the only woman for me and that we were meant to be together. Could that be my young mind grabbing onto the first love? Maybe, But i know what I want and even though it hurts sometimes, I fight for it. I constantly question whether we will end up together or if she will fade into another chapter of my life. I am kept up at night by the thought that I will never meet someone like her again and I will never find someone to love like her and it’s terrifying. You and I are not so different, so if I were you, I’d start living day by day, don’t worry about the future, don’t feel like something will or won’t happen. Be there for yourself, love yourself, be the best version of you, for you, and not for anyone else and I promise you something good will happen. Don’t force it, just live in the moment and love life. Everything happens for a reason, it is your job to decipher that reason and play the game of life. So instead of giving yourself anxiety about what could happen tomorrow, be happy for today, love today, love your neighbor and love life. Because I promise you, the only way things have worked for me, is when I wasn’t expecting it, and that’s the truth and blessing that many folks overlook.",
              "author": "kylewardbro",
              "created": 1632953152,
              "upvotes": 2,
              "replies": {
                "hes87p4": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hes87p4/",
                  "text": "I’m not religious but I hear you.",
                  "author": "DueYogurt9",
                  "created": 1632956834,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hfdcwin": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hfdcwin/",
              "text": "[removed]",
              "author": null,
              "created": 1633366696,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hel7nng": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel7nng/",
      "text": "Hookups always seemed over rated to me, there no connection or love its only about getting your rocks off which is something you can probably do better with your hand anyway. Make sure you don't feel pressured into hooking up either, your time will come to find a person for you just wait, make the first move if you have to. Things will work out, just give it time",
      "author": "creativejoe4",
      "created": 1632833174,
      "upvotes": 15,
      "replies": {
        "heohk5u": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heohk5u/",
          "text": "Are you my long lost clone?",
          "author": "DueYogurt9",
          "created": 1632885454,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hel6bd5": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel6bd5/",
      "text": "If I were you, I'd wait until you're older for a relationship. Both of you will be more mature and you won't regret missing out on single life. I got married at 23 and I still think that was too young.",
      "author": "Ph03n1x_5",
      "created": 1632832440,
      "upvotes": 9,
      "replies": {
        "hemq5ma": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemq5ma/",
          "text": "I want to get married in my late 20s, early 30s. I'm not gonna wait around for my future spouse to appear, and marry the first person I see. I need experience to actually get to that point",
          "author": "OkSherbert4977",
          "created": 1632856460,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hel5y9j": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel5y9j/",
      "text": "Hey! If you find a guy your interested in just be honest. Tell them you aren't looking for a hook up and would love to get to know them more. If they don't respect that then you know they don't want what you want. The best thing to do is when you find someone you like, just be honest about yourself and what you are looking for. It saves you heartbreak and time invested and they also know what you are comfortable with. Don't feel like everyone out there is just going crazy in college. Everyone is at different stages and it's perfectly okay you are wanting to experiment with relationships and love and not just looking for sex. When you find a guy you like and are comfortable with just let them know you haven't really done anything before and if they respect you they won't pressure you and will be okay with taking things at your pace. Remember before anything else, you want someone who RESPCTS and ACKNOWLEDGES your needs at ANY AGE.",
      "author": "Dreaminofwallstreet",
      "created": 1632832236,
      "upvotes": 67,
      "replies": {}
    },
    "hel5pgz": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel5pgz/",
      "text": "I'm like the male counterpart to this, I'd much rather have a relationship than a few meaningless hookups with someone.",
      "author": "ZC1028",
      "created": 1632832098,
      "upvotes": 139,
      "replies": {
        "hemfo4y": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemfo4y/",
          "text": "Now kiss",
          "author": "CodyS1998",
          "created": 1632852134,
          "upvotes": 84,
          "replies": {}
        },
        "hempl2c": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hempl2c/",
          "text": "I've had a few of opportunities to hookup with people. One in particular during highschool. But I refuse to do something just to get my rocks off for a few moments with someone I hardly know y'know? It's cheap and I don't look at my body or an intimate experience like that as cheap.",
          "author": "OkSherbert4977",
          "created": 1632856227,
          "upvotes": 35,
          "replies": {
            "hemryw9": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemryw9/",
              "text": "The way I look at it is like, if I get horny, I can just take care of it myself, and the horny goes away. It sucks not having intimacy, but a hookup is only temporary anyway. What I truly want is an equal, a partner in crime, a companion for life. Basically the lyrics of Apricot Princess.",
              "author": "alapleno",
              "created": 1632857202,
              "upvotes": 17,
              "replies": {
                "heohb1p": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heohb1p/",
                  "text": "You and I both lol",
                  "author": "DueYogurt9",
                  "created": 1632885321,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hemg1p1": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemg1p1/",
          "text": "Same. If I really wanted just sex there are countless ways of doing that.",
          "author": "Orangutanion",
          "created": 1632852294,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hel5o3a": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel5o3a/",
      "text": "20M and I relate with you a lot. Don’t a crazy amount of experience, but I’m still craving intimacy. But I’m not a one night stand person at all, I really don’t like hookup culture, I think it’s so damaging. I’ve only had one major crush on a person in college but haven’t ended up with her.  I want someone to do everything with, but not gonna cut corners.",
      "author": "Honest_Man_76",
      "created": 1632832077,
      "upvotes": 263,
      "replies": {
        "helh925": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helh925/",
          "text": "Why do you feel it is damaging?",
          "author": "EvilBob_RapePants_",
          "created": 1632837789,
          "upvotes": -14,
          "replies": {
            "helvlrg": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helvlrg/",
              "text": "Some people get attached easily and become emotionally invest once they hook up with someone. It’s damaging because many people don’t even realize this internally about themselves and keep on hooking up and ultimately damage themselves mentally along the way. Logically, people hook up to have fun and satisfy sexual desire. Some people aren’t like that yet they still hook up b/c that’s what everyone is doing, they think that it’s the norm, and they aren’t sure about their true feelings which become apparent AFTER the hookup and now they feel damaged.",
              "author": "MakeHerUnderstand",
              "created": 1632843901,
              "upvotes": 90,
              "replies": {
                "heme9it": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heme9it/",
                  "text": "I've had some friends with benefits in the past, but am currently in a monogamous relationship. I've learned that it's vital to establish what both people want or expect from the other before you get intimate.\n\nThere's nothing wrong with hookups, as long you establish beforehand that it's just a hookup without expectations or future commitment, and that both partners understand and are okay with that.",
                  "author": "bee5sea6",
                  "created": 1632851545,
                  "upvotes": 27,
                  "replies": {}
                },
                "hemoxrt": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemoxrt/",
                  "text": "Spoke my mind right there. A lot of people here tell me to just get it over with and hookup with someone...because once you do it then it will come easy. But the thing is I don't want to do that and I'm not gonna give my body to anyone who just wants me for a transaction. Yeah, I'm a lover....and no I'm not gonna traumatize myself for thrill seeking. Never done it and I will continue to seek out something a little more long term.",
                  "author": "OkSherbert4977",
                  "created": 1632855962,
                  "upvotes": 20,
                  "replies": {
                    "hen0o95": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen0o95/",
                      "text": "Yea, not everyone is the same in terms with viewing hook up as a fun no attachment ordeal. Our brains all wired differently, so you should do what you think is best for you. Just cause Kevin has a blast hooking up with a new chick every night doesn’t make it the same for you or everyone else.",
                      "author": "MakeHerUnderstand",
                      "created": 1632861046,
                      "upvotes": 7,
                      "replies": {
                        "hfezi37": {
                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hfezi37/",
                          "text": "Hello, my name is Kevin. I do enjoy this.",
                          "author": "Potential-Avocado598",
                          "created": 1633389309,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "hen2jcb": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen2jcb/",
                      "text": "Just take your time. The person you are looking for will find you. Dont get into that dating, hookup ratrace. Wait and you will be rewarded.",
                      "author": "Late-Painter-2805",
                      "created": 1632861871,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "hen4v9b": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen4v9b/",
                      "text": "I think you’re spot on and you are totally in your right mind to stick to your guns on this one. It is your preference, don’t let anyone change your mind unless that change comes from within. I’m here to testify that there are perfectly “normal” guys out there who don’t just want to hook up. Be patient, and patience will probably reward you. If someone does try to hook up with you but you like them too, make them wait. Literally. You are within your rights to do so, and their response will show their character. \n\nOn the flip, you can’t really plan to be in a relationship for just a few months. Unless the other party is very clear that they want exactly that and nothing more, someone is bound to get more attached and things could easily get pretty messy if you just arbitrarily try and end it. Plus, IMO having a sort of weird arbitrary time limit will really put a damper on getting to know that person and letting one another “in” so to speak. I wouldn’t do it that way. It’s too “technical,” like some sort of a practice run. Too much thinking, not enough doing. \n\nThere are other people who are in the same boat as you, too. I was when I was a freshman three years ago. For both relationships I have been in, I made the mistake of “forcing” something that should not have been. That’s what happens when you put pressure on yourself to make something happen. So my advice is to *let something happen*. Put yourself in a position to meet the right kind of people. I don’t know your ilk, but if I wanted a relationship that didn’t start off with a hookup I probably wouldn’t go straight to big ‘ol parties looking for someone to date. You might find someone else there like you…but for a more dramatic example…would you go to a strip club looking for guys/gals that weren’t horny? I wouldn’t. \n\nPeople in college do a pretty good job of self-selecting. Put yourself around people with similar interests! Open yourself up, take little leaps if you find someone you like…let them know you’re interested in subtle ways. That can be as simple as making a point of talking to them daily. Sit next to them on purpose. Little things like that. \n\nRelationships are really complex. On a deep level they bring out our unresolved issues and insecurities, likewise in the people we date. It’s a really awesome experience, but be ready to learn a lot, set boundaries in a kind way, communicate like never before, and trust in a whole host of new ways.\n\nSorry for the long response, but that’s my two cents!",
                      "author": "Helllo_Man",
                      "created": 1632862822,
                      "upvotes": 5,
                      "replies": {
                        "her0va1": {
                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/her0va1/",
                          "text": "I should have made clear: few months, few years, few decades....I don't care...but realistically my first relationship will only last a few months. Of course I won't say that, but realistically it's probable. And I want to learn. I'm an actor & an empath so I like to take experiences: no matter good or bad...and utilize that in my performances. I don't really look at any experience as a bad thing.",
                          "author": "OkSherbert4977",
                          "created": 1632938440,
                          "upvotes": 2,
                          "replies": {
                            "her16t5": {
                              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/her16t5/",
                              "text": "Experience def isn’t bad — there really is no such thing as a bad learning experience and I like your outlook on that. My first relationship actually lasted almost a year, you never know!",
                              "author": "Helllo_Man",
                              "created": 1632938576,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "henkfz1": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henkfz1/",
                      "text": "As someone who’s had a few FWB/hookup/situationships, it doesn’t get easier lmao. Each time I still feel super attached and heartbroken when they don’t want to continue things romantically and I caught feelings.",
                      "author": "cigarettedaydreams27",
                      "created": 1632869741,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "helibje": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helibje/",
              "text": "I’m not OP but it might be damaging if you actually like the person you’re hooking up with. If there are truly no strings attached I don’t think it’s damaging at all. It’s just not for me personally.",
              "author": "Sonic13128",
              "created": 1632838273,
              "upvotes": 29,
              "replies": {
                "helvaxm": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helvaxm/",
                  "text": "You should probably underline and italicize that last sentence",
                  "author": "kissywall",
                  "created": 1632843779,
                  "upvotes": -11,
                  "replies": {}
                }
              }
            },
            "hen665b": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen665b/",
              "text": "Hook up culture can make you feel very insecure lol. It could end up like an addiction. Jump from one person to another.",
              "author": "Ashamed-Sandwich8518",
              "created": 1632863363,
              "upvotes": 4,
              "replies": {
                "heobwlw": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heobwlw/",
                  "text": "Interesting - I guess I have been lucky to have avoided these issues when hooking up.",
                  "author": "EvilBob_RapePants_",
                  "created": 1632882643,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "heovcwd": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heovcwd/",
              "text": "I'll start off by prefacing that my view of intimate relationships has to do with seeking to find someone that you want to marry. That mindset alone probably puts us in very different camps of worldviews, given that's not how most people see dating/hooking up today.\n\nWhen you are hooking up and having intimate relations with people with who you don't have any intention of creating a long-term connection with you weaken the bonds that can be created between yourself and your future spouse later on in marriage. Even without marriage as a goal, it diminishes the importance and satisfaction of making it to these relationship milestones with long-term love interests, because you are making sexual and intimate encounters a regular occurrence with random individuals. \n\nI totally agree with the feeling that hooking up cheapens yourself/the experience. It may feel good in the moment, but the cost is less meaningful/fulfilling connections later.",
              "author": "ParkertheLarker",
              "created": 1632893864,
              "upvotes": 1,
              "replies": {
                "heozn54": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heozn54/",
                  "text": "I disagree. I have had unique and special moments with the girls I’ve been with, even if they were only temporary experiences/feelings.",
                  "author": "EvilBob_RapePants_",
                  "created": 1632897026,
                  "upvotes": 1,
                  "replies": {
                    "hep27z7": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hep27z7/",
                      "text": "I didn't say you **can't** have satisfying and meaningful experiences while hooking up. Simply that the more you normalize those encounters, *the less special/unique more permanent bonds may feel later on.* Sex is obviously a very powerful and fulfilling experience, otherwise, it wouldn't be so popular :)\n\nThere's a decent amount of research going into marital happiness and its relationship to sexual activity prior to marriage. \n\n`\"Americans who have only ever slept with their spouses are most likely to report being in a “very happy” marriage. Meanwhile, the lowest odds of marital happiness—about 13 percentage points lower than the one-partner women—belong to women who have had six to 10 sexual partners in their lives. For men, there’s still a dip in marital satisfaction after one partner, but it’s never as low as it gets for women\"` Source: [Atlantic Article](https://www.theatlantic.com/health/archive/2018/10/sexual-partners-and-marital-happiness/573493/)\n\nAt the end of the day though, we all have our own life goals and preferences. One's personal standards and background play a big role in determining what is acceptable/fulfilling for them. Long-term joy comes from different life experiences for all of us, so it comes down to discovering what that is for you personally and then staying true to it.",
                      "author": "ParkertheLarker",
                      "created": 1632899113,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hel52j9": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel52j9/",
      "text": "dont have sex, theres more important things to do",
      "author": "unseen_erniie",
      "created": 1632831734,
      "upvotes": -7,
      "replies": {}
    },
    "hekvw5t": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekvw5t/",
      "text": "Remember- don’t get into a relationship with someone because you want a relationship. Do it because you want a relationship with that specific person.",
      "author": "nataliazm",
      "created": 1632825647,
      "upvotes": 1614,
      "replies": {
        "helcc3v": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helcc3v/",
          "text": "This. Seriously, don't make this mistake",
          "author": "DonnyFisto",
          "created": 1632835529,
          "upvotes": 283,
          "replies": {
            "heoz289": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoz289/",
              "text": "Made this mistake twice over 2 years…. Paid the price. Feel like you wasted potential time to find the one you really want to be with, plus you get a nice heartbreak",
              "author": "daytime_on",
              "created": 1632896566,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "helhyj8": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helhyj8/",
          "text": "Sad I can only upvote this once.",
          "author": "TodayIKickedAHippo",
          "created": 1632838110,
          "upvotes": 90,
          "replies": {}
        },
        "hemdocp": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemdocp/",
          "text": "Made this mistake and ended up with an abuser, don’t.",
          "author": "dogwheeze",
          "created": 1632851305,
          "upvotes": 31,
          "replies": {}
        },
        "helqb13": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helqb13/",
          "text": "And because it's utterly miserable trying to break up with someone after you've committed to a relationship.",
          "author": "Gauntlets28",
          "created": 1632841703,
          "upvotes": 77,
          "replies": {
            "hem1s6f": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hem1s6f/",
              "text": "And it's even worse when the other person really likes you but you don't as much",
              "author": "kadxar",
              "created": 1632846435,
              "upvotes": 65,
              "replies": {}
            }
          }
        },
        "henc4me": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henc4me/",
          "text": "Literally so many people make this mistake. I remember about half the people I went to hs with had a relationship by the end of the fall semester. I don’t think a single one of the couples is together anymore. People enter relationships in the beginning of college just because it’s a lot easier than it was in hs",
          "author": "hippityhoppflop",
          "created": 1632865948,
          "upvotes": 14,
          "replies": {
            "henrgvh": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henrgvh/",
              "text": "This is the 21st century, you don't need to approach relationships like Hasidic Jews; you don't need to date for the purpose of getting married. Breaking up is unfortunate but just an inevitable part of life.",
              "author": "WaddleD",
              "created": 1632873028,
              "upvotes": 1,
              "replies": {
                "hep095t": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hep095t/",
                  "text": "I agree with you that you can date without it expecting to be long-term! But that’s not really what I was talking about here",
                  "author": "hippityhoppflop",
                  "created": 1632897512,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "hemqt4k": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemqt4k/",
          "text": "Needed to see this, thanks",
          "author": "alapleno",
          "created": 1632856728,
          "upvotes": 9,
          "replies": {}
        },
        "heorb5j": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heorb5j/",
          "text": "Even though that's true, it's much easier said than done, and not nearly as logical to someone who has never been in a relationship before. When you're hungry, you don't care about eating unhealthy food. You just want to eat, you are desperate for a filled stomach.",
          "author": "Fearless-Physics",
          "created": 1632891107,
          "upvotes": 5,
          "replies": {}
        },
        "her2chu": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/her2chu/",
          "text": "Holy shit. Say that louder for the people in the back.",
          "author": "PikaDicc",
          "created": 1632939058,
          "upvotes": 2,
          "replies": {}
        },
        "hemdn7e": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hemdn7e/",
          "text": "Well I'm going to be the devil's advocate and say that having a relationship for the sake of having a relationship is a good way to practice for future adult life. Definitely only do it if you have the time and energy though.",
          "author": "WaddleD",
          "created": 1632851292,
          "upvotes": 3,
          "replies": {
            "hen7ync": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hen7ync/",
              "text": "That’s really not fair to the other person.",
              "author": "deprimada",
              "created": 1632864127,
              "upvotes": 33,
              "replies": {
                "hennwp7": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hennwp7/",
                  "text": "It is if it's honest and mutually beneficial. As common of a goal as it can be, it's not unreasonable either.",
                  "author": "darkapplepolisher",
                  "created": 1632871353,
                  "upvotes": -4,
                  "replies": {}
                }
              }
            },
            "henoc1q": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/henoc1q/",
              "text": "It's so shitty to the other person.",
              "author": "IaniteThePirate",
              "created": 1632871556,
              "upvotes": 9,
              "replies": {}
            },
            "heosryh": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heosryh/",
              "text": "everybody thumbs down let’s get it to negatives",
              "author": "triforcebae",
              "created": 1632892074,
              "upvotes": 0,
              "replies": {
                "heot0jl": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heot0jl/",
                  "text": "bet",
                  "author": "WaddleD",
                  "created": 1632892236,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hekpyq1": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekpyq1/",
      "text": "Honey, I am about to turn 19 and I haven't done anything either so you are not alone. Escaping hookup culture is all trials and fails. Why don't you just try to ask a guy out that you find cute. Maybe you can even use dating apps and make it clear that you are looking for romantic partner. Some people will definelty try to hookup with you but you can always just refuse it. Don't let yourself feel pressured by people that want to have sex with you.",
      "author": "Itchy_Word_1523",
      "created": 1632820645,
      "upvotes": 90,
      "replies": {}
    },
    "hekp9t0": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekp9t0/",
      "text": "[removed]",
      "author": null,
      "created": 1632819998,
      "upvotes": -58,
      "replies": {
        "hekqf7q": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekqf7q/",
          "text": "horrible advice",
          "author": "noremaxrevaew",
          "created": 1632821058,
          "upvotes": 27,
          "replies": {
            "hekqtcv": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekqtcv/",
              "text": "Why?",
              "author": "AlienDogfromOcean0_0",
              "created": 1632821414,
              "upvotes": -13,
              "replies": {}
            }
          }
        },
        "hekpqh2": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekpqh2/",
          "text": "Wtf is wrong with you...",
          "author": "Itchy_Word_1523",
          "created": 1632820434,
          "upvotes": 19,
          "replies": {
            "hekq9eq": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekq9eq/",
              "text": "You want me to lie and tell her to go get herpes?",
              "author": "AlienDogfromOcean0_0",
              "created": 1632820912,
              "upvotes": -26,
              "replies": {
                "hekqhz1": {
                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekqhz1/",
                  "text": "First of all even if she was hooking up that dosent eman she will get herpes  or anything like that.\n\nSecond she has more then 10 fucking years to find somebody to love.",
                  "author": "Itchy_Word_1523",
                  "created": 1632821127,
                  "upvotes": 18,
                  "replies": {
                    "hekr868": {
                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekr868/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1632821769,
                      "upvotes": -14,
                      "replies": {
                        "hekreog": {
                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekreog/",
                          "text": "So i should listen to a man on YouTube talking about women's dating issues...\n\nNot only that but your 20s don't have to be the best part of your life. You are really fucking messed up if you believe anything some guy on YouTube says.",
                          "author": "Itchy_Word_1523",
                          "created": 1632821922,
                          "upvotes": 19,
                          "replies": {
                            "hekrvym": {
                              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekrvym/",
                              "text": "It can't hurt for you to be open minded.",
                              "author": "AlienDogfromOcean0_0",
                              "created": 1632822335,
                              "upvotes": -5,
                              "replies": {}
                            }
                          }
                        },
                        "hel5fh2": {
                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel5fh2/",
                          "text": "Incel type beat",
                          "author": "evrythingburns",
                          "created": 1632831941,
                          "upvotes": 5,
                          "replies": {
                            "heobg6j": {
                              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heobg6j/",
                              "text": "Coach Greg Adams isn't an incel. He was married and says he has relationships now and then with women.",
                              "author": "AlienDogfromOcean0_0",
                              "created": 1632882428,
                              "upvotes": 1,
                              "replies": {
                                "heogytp": {
                                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heogytp/",
                                  "text": "Oh, my bad, he's a misogynist. Like that's any better lmao",
                                  "author": "evrythingburns",
                                  "created": 1632885144,
                                  "upvotes": 1,
                                  "replies": {
                                    "heompv4": {
                                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heompv4/",
                                      "text": "He says that he likes women and does some shows telling the good points about women. You should watch his show for a while to research his beliefs.",
                                      "author": "AlienDogfromOcean0_0",
                                      "created": 1632888311,
                                      "upvotes": 1,
                                      "replies": {
                                        "hfrzvhj": {
                                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hfrzvhj/",
                                          "text": "As a note, I’m a woman. I read an excerpt from The Free Agent and it’s seems like a decent book. Of course it’s important for everyone to be independent and find peace within themselves etc. But saying that a woman’s values decreases as she gets older is misogynistic and degrading. Reducing a woman to her physical appearance doesn’t sound like a guy who “likes” or respect women at all. So if that’s the kind of things that he advocates for then I’m not really interested in learning more. He doesn’t seem to have my best interests at heart. Thanks for the recommendation though",
                                          "author": "evrythingburns",
                                          "created": 1633641217,
                                          "upvotes": 1,
                                          "replies": {
                                            "hftdsmj": {
                                              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hftdsmj/",
                                              "text": "He's using the statistics for the claims he makes. The statistics show that women make a certain amount of money during her 20s-early 30s.  It's the opposite for men as they start to make their most amount of money as they hit age 40+. Also, the other reason a woman loses value as she gets older is she gets past the point of being able to provide children. Men can usually get a woman pregnant at almost any age. Coach Greg Adams is talking about much more than a woman's appearance when it comes to a woman's value. Ask you mother to read his two books and see what she thinks because I think she'll agree with much of what he says.",
                                              "author": "AlienDogfromOcean0_0",
                                              "created": 1633665638,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "heoqafy": {
                                      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heoqafy/",
                                      "text": "You might like his book called The Free Agent Lifestyle. It has some good points about the reality of marriage these days.",
                                      "author": "AlienDogfromOcean0_0",
                                      "created": 1632890462,
                                      "upvotes": 1,
                                      "replies": {
                                        "hfrzxje": {
                                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hfrzxje/",
                                          "text": "I have some time before I start worrying about marriage. Lol",
                                          "author": "evrythingburns",
                                          "created": 1633641242,
                                          "upvotes": 1,
                                          "replies": {
                                            "hfte5e8": {
                                              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hfte5e8/",
                                              "text": "Time is going to go so fast that when you're around 40 you're going to look back and today will seem to have passed very fast. Just keep preparing yourself now because the next 10 years are going to be some of the most important years of your life since as you age you're not going to have the same drive you have when you're in your 20s. Some of the most important decisions I made were between the age of 18-25 because they had a huge impact on where I'm at today.",
                                              "author": "AlienDogfromOcean0_0",
                                              "created": 1633665850,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hel2oc2": {
                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hel2oc2/",
                          "text": ">...you see a woman loses value as she gets older and man gains value in general.\n\nWhy should I take advice from a person who sees me as property?",
                          "author": "0278",
                          "created": 1632830304,
                          "upvotes": 18,
                          "replies": {}
                        },
                        "hekrked": {
                          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekrked/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1632822058,
                          "upvotes": -10,
                          "replies": {
                            "heks4fg": {
                              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/heks4fg/",
                              "text": "Yes she knows because she's had the life experience to tell you what's up. People who've been divorced have a 70% chance of divorce if they get married a second time. That's why I think it was really cool of coach Greg Adams to give some advice to women your age on making the right choices now so you can be successful as you get older because his channel is mostly geared towards men. I really think it'll help for you to look up his advice for women on youtube and it won't hurt you to listen for 10 minutes.",
                              "author": "AlienDogfromOcean0_0",
                              "created": 1632822537,
                              "upvotes": -12,
                              "replies": {
                                "helm69z": {
                                  "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helm69z/",
                                  "text": "The problem is that if you're measuring life by the amount of success you have, you should've already been successful before the age of 30, so that you don't have to have the bias of nitpicking only successful people after the age of 30. You keep recommending greg adams, the guy that vowed to walk away from women but can't seem to walk away from women's stances?",
                                  "author": "youareaweirdo___",
                                  "created": 1632839946,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hekosty": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekosty/",
      "text": "Do you even really want a relationship? What do you feel that's missing from yourself that can be found in others? These experiences?\n\nJust start asking questions, a feeling of missing out on something can stem from anywhere, and it's important to try and discover where it's coming from in you. Doing this before getting into any experimental action will help you discover if the actions you're taking are actually healthy for you or you coping with something unconsciously that happened in the past.",
      "author": "novelfanatic",
      "created": 1632819555,
      "upvotes": -14,
      "replies": {
        "hekrboi": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hekrboi/",
          "text": "My answers here: I do want a relationship, I as a human being desire a relationship. I genuinely would like to be loved for a change. I love myself, and I would like somebody to share my life with for a while. Yeah of course there's the fear that I'm missing out...but my bigger fear is that I will continue to be told: \"Just wait. Relationships aren't worth it. Love & work on yourself. You'll find somebody eventually...\" And then I'll be 30, desiring children, and won't even know how to even pursue a guy...or I'll get stuck with some guy and won't know how to get out of it because I didn't have experience to begin with. I mean man, I suffer from depression and a big factor to it is the fact that I have been by myself for nearly 2 decades of my life. The literal point of life is to love, why should I be denying my own anatomical & biological needs & desires? I'm alone & it sucks and I don't want to have one night stands. Friends don't cure your intimate desires.",
          "author": "OkSherbert4977",
          "created": 1632821850,
          "upvotes": 23,
          "replies": {
            "helbx46": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/helbx46/",
              "text": "Yea I think you put it really well. It's definitely hard a s a girl to make the first moves, but I'd say just go for it :) talk to someone casually, and try to make the moves to make it more than that, like meeting up socially or hanging out together. I wish u the best of luck :)\n\nAnd as a guy, we are basically oblivious to read any signs lol so u may have to make it pretty obvious that you wanna get to know a guy better",
              "author": "_xAdamsRLx_",
              "created": 1632835329,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hfez7cl": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hfez7cl/",
      "text": "I wanted a relationship and was quite ugly for a while (I'm a 20 year old man in college). I hit the gym and got hot. Finally got a gf. It's fun, but only if you like that person a lot. It's a lot of time and mental energy. Enjoy being the single and the adventures that come along with it. It's really not that big of a deal until you meet the right someone, and a bad relationship can be very very draining. Go out and do an activity you like. That'll help you meet men who like the same things you do.",
      "author": "Potential-Avocado598",
      "created": 1633389158,
      "upvotes": 2,
      "replies": {}
    },
    "hevzy6y": {
      "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hevzy6y/",
      "text": "Threesomes in the shower, is that something that actually happens outside porn",
      "author": "sovietbot1922",
      "created": 1633030716,
      "upvotes": 1,
      "replies": {
        "hewze52": {
          "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hewze52/",
          "text": "Apparently it's popular among freshmen in college 😞",
          "author": "OkSherbert4977",
          "created": 1633046947,
          "upvotes": 1,
          "replies": {
            "hf6a39c": {
              "link": "/r/college/comments/px25sg/19f_how_can_i_escape_hookup_culture/hf6a39c/",
              "text": "Wow. Sex was popular at mine of course, but not threesomes i dont think",
              "author": "sovietbot1922",
              "created": 1633226615,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634055473
}