{"sid": "a360w2", "link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/", "title:": "remember to back up all of your work, kids!", "text": "so my hard drive just died on me and I was working on a 10-page paper that was all on Microsoft Word and now I have to write an entire 10-page research paper tonight :))) \n\nI've already tried emailing my professor (no response at the time of posting this), but I get the feeling it's going to sound like a thinly veiled excuse for not doing my paper so I'm just speedwriting and researching with hella tears in my eyes\n\nupdate uno - (a) **I do usually use Google Drive, I just was in a place w no Internet and I didn't have offline mode on so I resorted to Word.** and (b) my professor responded. no dice. if I want full credit, it needs to be submitted tomorrow. I kind of knew this would happen, but ah well. goodbye world", "author": "wheres-the-avocados", "created": 1543964669, "retrieved": 1632947903, "over_18": false, "upvotes": 691, "upvote_ratio": 0.98, "comments": {"eb6nt6s": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb6nt6s/", "text": "Google One is super cheap and you can set up Google Backup and Sync on your computer and it will act like a Dropbox folder", "author": "njdevilsfan24", "created": 1544060861, "upvotes": 0}, "eb5so1t": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb5so1t/", "text": "JUST USE GIT, EVEN IF YOU’RE NOT A COMP SCI MAJOR", "author": null, "created": 1544039006, "upvotes": 1}, "eb5iwez": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb5iwez/", "text": "USB flash drive is what I use. I save one copy to my laptop and then a second copy to my flash drive. It’s also easier for transporting information to college rather than carrying around my laptop.", "author": null, "created": 1544032756, "upvotes": 1}, "eb59gd5": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb59gd5/", "text": "did your friend post this to the college snapchat story? i swear i saw a snap with a girl in the same exact situation. anyways rip hopefully your professor is forgiving 😥", "author": "laurdawg_", "created": 1544026108, "upvotes": 1}, "eb535bn": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb535bn/", "text": "I had nearly the exact same thing happen to me. I know your pain", "author": "KingSawyer18", "created": 1544021389, "upvotes": 1}, "eb51fjw": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb51fjw/", "text": "If any of you are in computer science, it is absolutely worth it to put in the time to learn a version control system like git. Not only does it make it trivial to back up your work to an external location, but if you fuck up you can go back to almost any point in your project. \n\nIt could also work for regular papers, but it would be a little overkill to use it for that. ", "author": "cemanresu", "created": 1544019959, "upvotes": 1}, "eb4vzks": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4vzks/", "text": "I’m sure a paid account OneDrive is given to you via office 365, I suggest using that and word will auto save, and keep a cloud copy. I wouldn’t use a free service like google docs to store documents... when a service is free you are the product, not the customer. ", "author": "iLikeAppleStuff", "created": 1544014670, "upvotes": 1}, "eb4sc4x": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4sc4x/", "text": "That’s why I prefer using cloud services like Word with a offices account or google docs.", "author": null, "created": 1544010034, "upvotes": 1}, "eb4p8bq": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4p8bq/", "text": "Holy shit, the same thing literally just happened to me last week. I had to do a rough draft and turn it in for points, but my laptop just crashed and everything was basically lost. I know how it feels!", "author": "ThornberryE", "created": 1544005094, "upvotes": 1}, "eb4ibll": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4ibll/", "text": "Tip for Mac owners: \nI pay $3 a month for 200GB of iCloud storage and have my desktop and documents folder set to automatically be uploaded to iCloud. Not only does this automatically backup all my school files, I can also access these via the Files app on my phone. Awesome feature that's saved my ass more than once. ", "author": "ASV731", "created": 1543993390, "upvotes": 2}, "eb4gtnc": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4gtnc/", "text": "What a nightmare; just made me realize that since I have everything for school in OneDrive, I never work on anything without having an internet connection so all my stuff is always in the cloud. This is because I'm always at home where I have wifi which is where I do all of my school stuff.", "author": "Evariste-Lovelace", "created": 1543991257, "upvotes": 2}, "eb4fgzs": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4fgzs/", "text": "That’s why you use Google docs . And make copies of it onto your phone or iPad or other device. I believe Docs can be used in offline mode", "author": "vmketta", "created": 1543989649, "upvotes": 1}, "eb4fadt": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4fadt/", "text": "Last week everything I loved was stolen from me including my laptop, backpack, and teacher bag (going to school for elementary ed) and every single lesson that was due in 48 hours was in that bag. Make a backup for your backup. Email yourself everything. ", "author": "heytheresh1thead", "created": 1543989448, "upvotes": 4}, "eb4dxzg": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4dxzg/", "text": "It's probably not very difficult to learn an automatic way of getting things saved but I have never done so. Traditionally, I only back things up at the end of the semester/year (depends on how depressing the semester is)...my Google Drive now feels very big (70+ GB) after five years (we have recorded lectures here). During semester backups have been incidental when I attach them in emails for the purposes of working on other computers. My original email account is now basically only used by me to send attachments of work to. It's possible I have sent these emails at the end of a day's work before but I can't recall.\n\nThis last semester I did have some trouble as I was using a data stick due to doing a lot of work in a wifi free environment on the computer. As a result, for a few weeks I wasn't sending my emails as usual in all circumstance because, hey, I had the data stick. Some of the files got corrupted and turned into y's. This was fun as one such file was an assignment due that same day (in the end, I just didn't do the last question... it was fortuitously the sort of assignment which isn't massively time consuming). \n\n", "author": "FrameworkisDigimon", "created": 1543988015, "upvotes": 1}, "eb4bus4": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4bus4/", "text": "Good luck my friend, you’ll make it. ", "author": "SebRev99", "created": 1543985838, "upvotes": 1}, "eb4bo2n": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4bo2n/", "text": "Same thing had happened to me. I just dealt with it and moved on.", "author": null, "created": 1543985655, "upvotes": 1}, "eb4bizn": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4bizn/", "text": "Google docs", "author": "not_its_father", "created": 1543985518, "upvotes": 1}, "eb4b5a4": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4b5a4/", "text": "All my good vibes to you my friend. I hope you can speedrun that shit and ace it!\n\nThis happened to me but while I was rendering a 3d animation in Maya. Could do nothing but cry for an hour. ", "author": "fachomuchacho", "created": 1543985153, "upvotes": 1}, "eb4b3pp": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4b3pp/", "text": "Not that it will help you feel better, but I will be pulling an all-nighter attempting the same.  Best of luck to you!! You've got this. ", "author": "Shanzpalmer", "created": 1543985111, "upvotes": 1}, "eb4a5xy": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb4a5xy/", "text": "Honestly Google Docs has gotten good enough at this point to be a decent replacement for Word. Some of its features are slightly better in fact, such as the equation feature I think. No worries about losing something with drive. ", "author": "xthatguy339x", "created": 1543984234, "upvotes": 1}, "eb49vrh": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb49vrh/", "text": "That sucks man. Save your papers on a flash drive.  Or just keep saving them.  ", "author": "favnh2011", "created": 1543983954, "upvotes": 1}, "eb49eqy": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb49eqy/", "text": "I remember how a girl in my multimedia class took pictures of her work on her phone. (Files like Photoshop and illustrator). I asked her why won't she just back it up on a separate flash drive. She said - oh, right\nSecond year of multimedia. It hit me hard.", "author": "timmy_42", "created": 1543983484, "upvotes": 5}, "eb48i9z": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb48i9z/", "text": "Use one drive. Thank me later. Shit has saved me so many times.", "author": "Str8OuttaLumbridge", "created": 1543982657, "upvotes": 1}, "eb48595": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb48595/", "text": "I’m so sorry man! It’s going to be incredibly hard but you already know the sources and where to find materials. \n\nWhen you turn in the paper or email the paper. \n\nAsk your professor if you can turn in a better copy because you didn’t feel like you misunderstood the direction of the paper. \n\nBut just plow material on it, go in and tos support, add a ton of detail anywhere you can, time, places, impacts, connections, what are they trying to say, why are they saying it that way, what about them, \n\nYou got this! ", "author": null, "created": 1543982316, "upvotes": 1}, "eb47spx": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb47spx/", "text": "I mean, you could also bring in your dead harddrive as proof...lol", "author": "phiraeth", "created": 1543981997, "upvotes": 0}, "eb47iul": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb47iul/", "text": "I tell all of my students to save their documents into the cloud in one way or another. That way it can always be accessed and you never have to worry about losing data (but also save it on your device). Having it in a physical place and the cloud is a good way to make sure no problems.", "author": "VerbalThermodynamics", "created": 1543981754, "upvotes": 1}, "eb45o8v": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb45o8v/", "text": "I'm so sorry. That sucks. Good luck with your paper. Hopefully you can find your previous sources, and have an idea of what you wrote before.. good luck!", "author": "HeuristicValise", "created": 1543980148, "upvotes": 3}, "eb45dyq": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb45dyq/", "text": "This is honestly my worst nightmare....good luck to you!!!", "author": "phs150", "created": 1543979916, "upvotes": 11}, "eb458ta": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb458ta/", "text": "Could try booting of a usb from a distro of linux , sometimes in my experience linux has been able to grab files windows couldn't get from a almost dead hard drive.", "author": "WeStandUnited5009", "created": 1543979798, "upvotes": 3}, "eb44eb4": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb44eb4/", "text": " Been in your shoes before. If worse comes to worst what I always did was write whatever the fuck you need to, THEN find a source for it. Professors don’t have the time to individually check every source anyways. The articles at the bottom of Wikipedia pages are great for this", "author": null, "created": 1543979099, "upvotes": 6}, "eb44e13": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb44e13/", "text": "Yes! Do this! Google doc works great for this as are outlook email accounts which have Microsoft OneDrive. Or change your preferences on Microsoft word to auto save your document every minute.", "author": "20121619", "created": 1543979093, "upvotes": 6}, "eb42g9o": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb42g9o/", "text": "I email copies of my work to myself and I have it all in a separate folder. Sucks when computers fuck up. Had a girl in one of my classes whose laptop crapped itself halfway through the class and it had the only copies of her assignments on it, including the one that was due two hours after the class finished.", "author": "unlucky_black_cat", "created": 1543977548, "upvotes": 15}, "eb42g3z": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb42g3z/", "text": "Google docs. It's a hard lesson to learn, but i never do any writing assignments without it anymore. Let's just say, ive shed quite a few tears over lost work in the past..  ", "author": "pikachuomg", "created": 1543977545, "upvotes": 20}, "eb3tqmq": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb3tqmq/", "text": "Hopefully you had a draft? If anything it won't take nearly as long as the first time you wrote it because you already know what to say.", "author": null, "created": 1543970387, "upvotes": 40}, "eb3rybx": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb3rybx/", "text": "I only ever save papers on my flash drive. Makes these situations less anxiety inducing.", "author": "divineInsanity3", "created": 1543968901, "upvotes": 48}, "eb3ri1o": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb3ri1o/", "text": "[https://www.hendrix.edu/HelpDesk/Frequently\\_Asked\\_Questions/How\\_To\\_Recover\\_Unsaved\\_Microsoft\\_Office\\_Excel,\\_Word,\\_or\\_PowerPoint\\_Files\\_Closed\\_Before\\_Saving/](https://www.hendrix.edu/HelpDesk/Frequently_Asked_Questions/How_To_Recover_Unsaved_Microsoft_Office_Excel,_Word,_or_PowerPoint_Files_Closed_Before_Saving/)\n\n&#x200B;\n\nTry this...", "author": "Boolien", "created": 1543968529, "upvotes": 52}, "eb3pyfh": {"link": "/r/college/comments/a360w2/remember_to_back_up_all_of_your_work_kids/eb3pyfh/", "text": "Feelsbadman . Next time I recommend using google docs because it saves constantly. \n\nGood luck and Godspeed with your paper!", "author": "Govno4", "created": 1543967252, "upvotes": 282}}}