{
  "sid": "pwer9e",
  "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/",
  "title:": "How to study for physics? This class is going to ruin my GPA",
  "text": "Hello everyone.\n\nPhysics has always been my toughest subject. I just never could make sense of it conceptually. I managed to do well in high school through memorization\n\nBut now I'll I'm taking college level physics (algebra based). I can't make sense of this stuff, I try but my brain just can't grasp it. My first quiz is this Friday. The dread is hitting me now with how I am definitely not gonna pass.\n\nThis class is gonna ruin my GPA. And it's required for my graduate schools; the subject is not relevant but to assess your \"problem solving skills.\" God damn it, I've aced every other upper level science class but now physics is holding me back.\n\nAnyways, what do you all recommend to help? Any popular youtubers, or services? I don't care about money at this point I just want a B+ or higher.\n\nThank you",
  "author": "__shadowwalker__",
  "created": 1632740853,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hei7abu": {
      "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/hei7abu/",
      "text": "One bad grade literally can not ruin your GPA.",
      "author": "TheRightSideOfDumb",
      "created": 1632770309,
      "upvotes": 1,
      "replies": {
        "heis2ng": {
          "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/heis2ng/",
          "text": "It would \"ruin\" my science GPA that programs look at. I'll have a total of about 8 science classes so a C can easily weigh it down. And then I still have to retake it\n\n(My major is psychology. If I were a bio major it wouldn't have as much of an impact but yeah).",
          "author": "__shadowwalker__",
          "created": 1632779840,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hegld7y": {
      "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/hegld7y/",
      "text": "Physics major here. It’s not that hard if you have a good foundation in math and are good at solving word problems. In fact the majority of Physics tests are nothing but over fancy worded word problems meant to give you irrelevant information and for you to “translate” what conditions your given to solve it. \n\nBesides the standard going over problems in the book, rewriting your notes to make the content stick, etc. you might want to see if the tutoring center at your school maybe has copies of previous years tests and quizzes to solve to get more practice of what the real thing might be. You can also search online too for tests to practice with (of course make sure you also have the answers too so you can see if you were were close). Once you have been “exposed” enough to the fancy language, it should be a lot easier and build your confidence once you take the real test.\n\nEDIT- if it’s any consolation and I don’t mean you should rely on this 100% to give yourself an excuse to just skim by but most physics courses (even the entry level ones) do have a generous curve given how they are known to be hard. But that depends on the professor, class average, etc.",
      "author": "XenOz3r0xT",
      "created": 1632743077,
      "upvotes": 3,
      "replies": {
        "heisn9h": {
          "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/heisn9h/",
          "text": "Thank you!\n\nI will definitely focus on practice problems. I just have to get past the notes part that I do not understand, so that i know how to approach the problems to begin with. I heard of people solving backwards through the solutions so I'll try that, as you said I'll just need a lot of problem with worked out solutions.\n\nAnd he does not curve because he said his exams resemble our practice problems very well so if we put in the effort we would be able to get the grades we want. He just left out the part where \"unless u suck at physics\" haha but thank you your comment helped!!\n\n> In fact the majority of Physics tests are nothing but over fancy worded word problems meant to give you irrelevant information and for you to “translate” what conditions your given to solve it. \n\nYes I noticed this overwhelms me. The long story problems and I'm like damn it what do they want! But I'll start doing the reverse problem/solution thing and try to connect the dots",
          "author": "__shadowwalker__",
          "created": 1632780131,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hegkjgp": {
      "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/hegkjgp/",
      "text": "Learning physics is like learning to play soccer/football, or learning to play the piano: you can’t learn it by reading about it, you have to learn it by *doing* it. \n\nDo all the HW. Redo all the problems from class. If you have a study guide or practice test, do those problems. Do other random problems from the book. When you’re doing a problem, copy it onto a blank sheet of paper, close your book and notes, and solve it. Get as far as you can before opening the book. If you’ve opened the book, finish your work, summarize in your head what steps you took, then copy the problem onto a new sheet of paper and try again. Repeat until you can solve it in test-like conditions, then move on to another problem. \n\nI also recommend study groups, going to the free tutor, the prof’s or TA’s office hours, Khan Academy, and “The Cartoon Guide to Physics”.",
      "author": "AceyAceyAcey",
      "created": 1632742546,
      "upvotes": 10,
      "replies": {
        "heiszp9": {
          "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/heiszp9/",
          "text": "Thank you so much!\n\nIf the notes are simply giving me a foundation so they're not gibberish, but I still don't understand them, do you think it would still be possible to learn through problems/solutions? I'll definitely check out your recommendations if I can't tonight. Thank you!",
          "author": "__shadowwalker__",
          "created": 1632780291,
          "upvotes": 2,
          "replies": {
            "hejho5z": {
              "link": "/r/college/comments/pwer9e/how_to_study_for_physics_this_class_is_going_to/hejho5z/",
              "text": "Notes and the textbook are for concepts (the ideas, the reason why you do things, the meaning of formulae), and if your tests/quizzes are going to be conceptual then go this route, drawing concept maps of the vocabulary words, and look up practice multiple choice and conceptual questions. Doing problems is necessary if your test is going to involve solving problems. If the test is both (like the one I’m giving my algebra physics class on Monday), then do both.",
              "author": "AceyAceyAcey",
              "created": 1632791965,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634050727
}