{
  "sid": "qcdwcf",
  "link": "/r/college/comments/qcdwcf/am_i_making_a_horrible_decision_by_switching/",
  "title:": "Am I making a horrible decision by switching schools?",
  "text": "Hello! I am 24 years old. I’m currently attending American Public University in which I have 21 credits, I’m a little under half-way to an AAS. At APU I’m currently paying $285 a credit hour and still need about 36 credits give or take. I go all online. I work full-time. I recently decided to switch to a local community college in my state that’s A) MUCH cheaper ($100 a credit hour) and B) would be in person. Here’s the deal, the local school will only take 3 credit hours in transfer (one class). So I’d be restarting my AAS from the beginning. The way I worked out the cost, money wise it would cost about to same whether I finish at APU or start at local. I’m married, but one aspect I’m kind of excited for with the local college is actually going to school in-person again. I feel like I learn better in a classroom setting and being that I’m married and work full-time, I don’t have much time for outside socialization. I have friends at work but I don’t really have many friends outside of work. Am I making a really dumb decision by basically throwing away the last year and a half I’ve spent at APU? Just need some thoughts.",
  "author": "HILLxHXUSE",
  "created": 1634772344,
  "updated": 1634849283,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhfcvbh": {
      "link": "/r/college/comments/qcdwcf/am_i_making_a_horrible_decision_by_switching/hhfcvbh/",
      "text": "For the reasons you pointed out it could be worth swapping. \n\nIf it would cost the same long term for you to finish at APU vs restarting at the local CC, the main thing to consider is time. \n\nIs starting over from scratch going to put pressure on you and your marriage? How does your spouse feel about the change? \n\nIn person CC is really great because you meet all kinds of people and there are usually tutoring centers for getting help with your work. \n\nI guess, what is your goal? Do you care about the experience along the way or the end goal of the degree?",
      "author": "GueroSuave",
      "created": 1634772550,
      "upvotes": 2,
      "replies": {}
    },
    "hhftvds": {
      "link": "/r/college/comments/qcdwcf/am_i_making_a_horrible_decision_by_switching/hhftvds/",
      "text": "Ik you can’t transfer app classes to cc, but could you transfer cc classes to apu?",
      "author": "tollersis",
      "created": 1634780367,
      "upvotes": 1,
      "replies": {}
    }
  }
}