{
  "sid": "q702yt",
  "link": "/r/college/comments/q702yt/how_do_you_cope_with_getting_a_much_lower_mark/",
  "title:": "how do you cope with getting a much lower mark than you thought on a midterm?",
  "text": "so I wrote my first in person midterm in over a year last week and felt like I got around high 60s, maybe low 70s, got my grade back today and I got 54%, I'm feeling like an abject failure right now and like I'm just not going to do well in the course at all going forward, how do I stop myself from spiraling and not listen to the urge to drop out right now?",
  "author": "meeseekstodie137",
  "created": 1634087006,
  "updated": 1634583357,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfgbu9": {
      "link": "/r/college/comments/q702yt/how_do_you_cope_with_getting_a_much_lower_mark/hgfgbu9/",
      "text": "When I got 32% on a midterm I talked to my lecturer about it and moved on. You can’t  change it now so try not to worry about it. Just work hard on not failing the next one.",
      "author": "skippy5433",
      "created": 1634088063,
      "upvotes": 1,
      "replies": {}
    },
    "hgfmwdb": {
      "link": "/r/college/comments/q702yt/how_do_you_cope_with_getting_a_much_lower_mark/hgfmwdb/",
      "text": "Calculus 1 the first time I took it in spring 2018 I got 30% on midterm 1 and midterm 2 it was awful considering I took AP calculus bc 3 years before, but I got a 3 in the AP calculus bc exam. To be honest, I never understood much calculus in the AP class due to the fact that it was high school level. I later withdrew from all classes.\n\nI did retake it the following autumn quarter 2018 to get a higher score/grade.\n\nHow I coped? I didn't but later found out calculus was an intp personality type.",
      "author": "Cylinder126",
      "created": 1634091114,
      "upvotes": 1,
      "replies": {
        "hggej5y": {
          "link": "/r/college/comments/q702yt/how_do_you_cope_with_getting_a_much_lower_mark/hggej5y/",
          "text": "I just googled intp personality type and enjoyed reading about it, thank you for that.",
          "author": "Chaz_Delicious",
          "created": 1634107456,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hggdzw5": {
      "link": "/r/college/comments/q702yt/how_do_you_cope_with_getting_a_much_lower_mark/hggdzw5/",
      "text": "It's one midterm.  And your grade was only a bit lower than what you expected. It's not like you were expecting an A and got a D. Don't let this bother you too much, just study harder/smarter  for the next one and recover.",
      "author": "time2trouble",
      "created": 1634107031,
      "upvotes": 1,
      "replies": {}
    }
  }
}