{"sid": "gy4gpv", "link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/", "title:": "Don't stop exercising, kids!", "text": "Hey all you fresh-eyed 17 and 18 year olds, heed this warning because I didn't when I was your age. \n\nDo NOT stop exercising once you get into college. I did a good job of this the first two years myself but then got a girlfriend, classes got harder, and I let myself stop exercising. I am 6'2\" ~165 and have been since I was a freshman, turns out that your physique truly has nothing to do with your stamina, strength, what have you.\n\nThis message is doubly as important if you're attending zoom Univeristy the first semester as you're REALLY not going to go anywhere. Learn discipline now and maintain it cause it is a lot harder to get back 4 years down the road!", "author": "TheWriter28", "created": 1591497816, "retrieved": 1632801594, "over_18": false, "upvotes": 1976, "upvote_ratio": 0.99, "comments": {"ftrfep6": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftrfep6/", "text": "Just came back from a 2 mile run around my local park to this. It's amazing how much your health and mood improves after a good workout. Even if it's something as little as a jog down your street or around your block, you'll feel a different. There's just something about getting that fresh air and your body moving...", "author": "Giantsgiants", "created": 1591926986, "upvotes": 1}, "ftcf3lx": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftcf3lx/", "text": "Get a pull up bar in your dorm / house / apartment / etc.. rip 5 on your way in and out. Easy and on the way, might not be much but at least it’s something", "author": "mcquago", "created": 1591596899, "upvotes": 2}, "ftce4o1": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftce4o1/", "text": "Just graduate lol", "author": "AnusAnalyzer69420", "created": 1591596108, "upvotes": 1}, "ftc594n": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftc594n/", "text": "My advice is to strongly time manage yourself, and don't overeat, or if you're like me, and slow at school or a procrastinator, start off with just to do lists to not stress yourself out too much, then start adding time slots once your routine doesn't feel like a \"chore\" or at least exercise on the weekends. I think time management is extremely important in college, or work towards a goal and then reward yourself. I'm trying to get back into swimming again (started off at the wrong time since I'm stuck indoors lol) because it's a lot more funnier than running on a treadmill, so another thing, do exercises that you're more interested in and more likely to put effort in as well. I'm really hoping I'll finally lose weight at some point. Sorry this was long, good luck.", "author": "fluffyball63", "created": 1591589365, "upvotes": 2}, "ftbzfyg": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftbzfyg/", "text": "I gained almost 80 pounds my first year out of high school. My college had a bakery on campus and I still thought my metabolism would save me.", "author": "AudioBoss", "created": 1591585422, "upvotes": 2}, "ftbvkeo": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftbvkeo/", "text": "Also you can get fat off over eating regardless of exercise compensating for it.  Weight gain doesn’t just pop up suddenly, treat it like a pot of water slowly increasing to book temperature.", "author": "Darcynator1780", "created": 1591582944, "upvotes": 0}, "ftblik5": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftblik5/", "text": "This is accurate, especially if you just got out of high school. I did a sport all 4 years and didn’t realize how much practicing every day kept me in shape. First semester of college gave me a gut lol", "author": "kenny_lolz", "created": 1591576867, "upvotes": 1}, "ftbl2ln": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftbl2ln/", "text": "This is such good advice. Not only to stay in shape, but for mental health as well. For those that are doing zoom classes or online classes it can be very hard on your mental health.", "author": "ClassyHotMess", "created": 1591576609, "upvotes": 1}, "ftbinul": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftbinul/", "text": "I gained 50 lbs during this quarantine. I feel it.", "author": "ohgirlfitup", "created": 1591575184, "upvotes": 1}, "ftb8aot": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftb8aot/", "text": "Hahahahaa yeah I gained about 40 pounds in my first year of college. Still struggling to wear that off. I'm 6'3\" too lol jumped from 190-230 real quick", "author": "ChocPineapple", "created": 1591569239, "upvotes": 2}, "ftb3s21": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftb3s21/", "text": "I like following the PopSugar Fitness videos a few times a week. There’s a lot to choose from, and they’re super fun and pretty short (20-30 minutes).", "author": "CupcakesWolf", "created": 1591566757, "upvotes": 2}, "ftb1iwr": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftb1iwr/", "text": "Just gonna throw this out there but Sydney Cummings on Youtube is Amazing (for girls and guys) and will absolutely whip you right into shape. Lots of it is HIIT and strength training, I’m 20 and in the best shape of my life from doing her workouts every day the past two months. It’s none of that “Tiny Waist in 2 Weeks” Chloe Ting bullshit, just about improvement and accountability and determination", "author": "ahof8191", "created": 1591565528, "upvotes": 2}, "ftasl9p": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftasl9p/", "text": "21 and I feel weak sometimes. Started doing moderate exercising here and there between studying. Really keeps you not feeling like shit. Would recommend", "author": "imagineer_17", "created": 1591560684, "upvotes": 3}, "ftaqq3h": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftaqq3h/", "text": "I just graduated but i have gained so much weight in the last 2 years because of harder courses and because of getting a boyfriend", "author": "True14216", "created": 1591559679, "upvotes": 2}, "ftal93f": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftal93f/", "text": "I got a job with UPS and lift boxes for 6 hours. I’ve been getting good!!", "author": "jeebus224", "created": 1591556684, "upvotes": 1}, "ftaemq8": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ftaemq8/", "text": "Thank you since I needed this!! I am going on walk today :)", "author": "happysupersushi", "created": 1591553075, "upvotes": 2}, "fta6oc3": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/fta6oc3/", "text": "Dancers rise up!!!", "author": "lovejilly7", "created": 1591548874, "upvotes": 1}, "fta6jt8": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/fta6jt8/", "text": "Honestly this is the most underrated advice for college. It’s easy to say oh I don’t have time today and you don’t exercise and then you do it again and soon enough you stop exercising entirely and have a hard time getting back into it. I was relatively semi-fit in high school but now I’ve lost a lot of the gains I had in high school and have gotten a decent gut. Starting good habits early will help you keep them. Exercising is also a great mood booster and stress reliever which is clutch in college.", "author": "420CurryGod", "created": 1591548806, "upvotes": 2}, "fta526x": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/fta526x/", "text": "Excercise improves sleep, reduces anxiety, helps concentration, makes you more attractive, making your nipples harder and last longer, etc. There is no good reason to ever skip out on a morning workout.", "author": "BigNaisu0__0", "created": 1591548008, "upvotes": 2}, "ft9wquz": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9wquz/", "text": "Dude yeah when college was in-person I was averaging 1.5 miles a day of walking and eating only when I could find time so I weighed around 115 pounds. Now that I’ve been sedentary for months due to COVID and have more time to eat I’m well over 130. I started running again and have been trying to do 1.5 miles + pushups + sit ups + planking + small weights.", "author": "peterisfrosty1", "created": 1591543432, "upvotes": 1}, "ft9wni4": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9wni4/", "text": "Working out, at least for me, has numerous benefits on my education. Exercising allows you to have more energy throughout the day, and that energy can easily be turned into focus and motivation for classes. I find that jogging 1-2 times a day did so much for my physical and mental health, I highly recommend it", "author": "SuperCoolCas", "created": 1591543380, "upvotes": 1}, "ft9q46m": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9q46m/", "text": "I, too, and 6’2” and 165 lbs and thank you for this.", "author": "ImrusAero", "created": 1591539498, "upvotes": 2}, "ft9o676": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9o676/", "text": "Just a tip in case you do get behind- don't underestimate the power of a scale. I had gained 20 lbs. after three semesters, then I started weighing myself as soon as I woke up and recording it on a chart. Then I adjusted my diet and saw what was working, and what didn't. \n\nIt turned out skipping breakfast did nothing, but replacing lunch with a salad and only drinking water and unsweet tea had me losing 4 lbs. a week. If I didn't have a scale to see trends, I wouldn't have known what worked and what didn't. \n\nWithin just a few weeks, I managed to lose 20 lbs. without any change to my exercise routine besides weekly 20 mile bike rides. \n\nSo, remember kids: weigh yourself in the morning so you can see if what you're doing is actually working.", "author": "Dj_White_Gold", "created": 1591538249, "upvotes": 3}, "ft9mcgi": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9mcgi/", "text": "Before college I was a RUNNER. I mean 10 miles a day. Freshman year, I ran maybe 20 miles the whole YEAR. The only reason I didn’t run was because I was in a new city and didn’t know where to run. I finally worked the guts up to just go run through the residential side of the town, and now I run every day when I’m at school. I’ll never get that time back from that first year. I could’ve been happier mentally, physically, and socially. But I blew it because I was worried about being embarrassed.", "author": null, "created": 1591536999, "upvotes": 3}, "ft9lvkh": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9lvkh/", "text": "i'm 20 and I'm just starting to get into exercising. It's not too late guys", "author": "TheGuyMain", "created": 1591536683, "upvotes": 3}, "ft9g9g6": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9g9g6/", "text": "What helped me was scheduling time exercise! There’s a million things that could take priority over getting a workout in, like studying, but when you purposefully make time for exercise, it forces you to prioritize it. Maybe not relevant now, but group exercise was really helpful for me in my fitness journey.", "author": "FriendlyContrarian", "created": 1591532471, "upvotes": 1}, "ft9f8bx": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9f8bx/", "text": "Yep! Generally maintaining your health physically AND mentally (very interconnected) is super important. The “Freshman 15” can also be the 15 pounds LOST because you can’t manage anxiety. Speaking to personal experience :-)", "author": "hellyabruther", "created": 1591531597, "upvotes": 2}, "ft9duuf": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9duuf/", "text": "i remember having a freshman -30 rather than the usual freshman 15. but it was an unhealthy loss of weight; the food at my former college often gave students food poisoning, or it was just the same dishes over and over and over so we would get bored and just not eat that day. \n\nif you are going to workout for weight reduction, please try to do whatever you can to make sure it's lost in a healthy way (and if your school makes shitty food, have the entire student body tell them in hopes they will do better). a lot of our students had this problem with the food, and nobody should be losing weight solely because their institution can't provide excellent dining options.", "author": "kateblazed", "created": 1591530379, "upvotes": 2}, "ft9d9nw": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9d9nw/", "text": "Or just eat right?\nExercise has very little to do with long term lean-ness. (-120 lbs, maintained over a year, also in senior year, I barely work out other than walking)", "author": "ryanmaneo", "created": 1591529846, "upvotes": 2}, "ft9cjjq": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft9cjjq/", "text": "My campus was so hilly that not exercising was impossible. We had more stairs outside leading to places than inside.", "author": "abnormallyme", "created": 1591529181, "upvotes": 1}, "ft999vr": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft999vr/", "text": "I haven't excersised much since 15 and I just got a job riding a bike and I'm very excited to get some more stamina once this stops hurting like hell !", "author": "robthelobster", "created": 1591525924, "upvotes": 5}, "ft8zjke": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8zjke/", "text": "I did not really peak in high school so I’m trying my best in college to be healthy and work out a bunch. This is just my first year so I really hope I can keep it up all 4 years", "author": "Louhoo98", "created": 1591515921, "upvotes": 1}, "ft8xpxt": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8xpxt/", "text": "Can't stop when you never started in the first place", "author": "KING_COVID", "created": 1591514142, "upvotes": 18}, "ft8xf3n": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8xf3n/", "text": "Don't stop exercising, and there's never a bad time to start exercising! You can always work on your physique and diet. :)", "author": "havingfun89", "created": 1591513851, "upvotes": 3}, "ft8vuqn": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8vuqn/", "text": "Gyms being closed right now has made me so lazy. I really can’t find any motivation to workout.", "author": "oliviabenson9", "created": 1591512380, "upvotes": 1}, "ft8te7e": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8te7e/", "text": "Yes. Exercise is good. I should do more.", "author": "NefariousSerendipity", "created": 1591510186, "upvotes": 5}, "ft8tal2": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8tal2/", "text": "I actually didn't exercise even before college, other than doing Tai Chi & Just Dance on-and-off. Do you have any tips for getting back on track (or just starting at all)?", "author": null, "created": 1591510100, "upvotes": 3}, "ft8t0bl": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8t0bl/", "text": "and to think I was planning on on exercising when I got into college", "author": "chilicheesedoggo", "created": 1591509852, "upvotes": 9}, "ft8sjbo": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8sjbo/", "text": "I need to start working out again.", "author": "iamsojellyofu", "created": 1591509444, "upvotes": 3}, "ft8sj7y": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8sj7y/", "text": "Wow it was the opposite for me lol. I was 205\npounds and 5 feet 11 inches at the end of senior year in high school. I have finished my second year now and I’m 175 pounds(not ideal) and 6 foot 1 inch.", "author": "VTDMAN7", "created": 1591509442, "upvotes": 5}, "ft8shk3": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8shk3/", "text": "i completely agree! but i also want to point out that it's never too late to start. lots of people find out or realize really late in life how beneficial it can be to train your mind and body to work out, but it still tends to benefit the person! as long as you are motivated and find the right mentality, your health will continue to grow :) best of luck to everyone!", "author": "roseflame54", "created": 1591509404, "upvotes": 3}, "ft8rzf7": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8rzf7/", "text": "Dam I'm 20 going 2 year college soon and I'm 110 pounds i was 145 muscle 5,6 height. Thanks tho ima keep going", "author": "ilovetoons", "created": 1591508980, "upvotes": 1}, "ft8ri8h": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8ri8h/", "text": "I haven’t completely stopped working out but my strength endurance has definitely reduced. I use to run over 2 miles and now I find it hard catching my breath after half a mile.", "author": "FMG_99", "created": 1591508583, "upvotes": 3}, "ft8r3i0": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8r3i0/", "text": "Also exercise can be fun and a great way to give your brain a break! Don’t think you have to run laps or do push-ups or something. The first two semesters I took self defense and then recently I try to swim at the pool. With zoom I’ve been trying to stand at my desk as I do work and doing some basic home exercises.", "author": "Mail540", "created": 1591508251, "upvotes": 19}, "ft8qi1m": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8qi1m/", "text": "So true. I'm an 18 y/o college freshman and I've been so consumed with school lately, that I don't workout as much as I used to. There's so much more to life than grades and health is top priority.", "author": "Bk_Grizzly", "created": 1591507776, "upvotes": 3}, "ft8qfw2": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8qfw2/", "text": "So true about the physique bit, I’ve been 180 lbs since the end of high school, kept fit most of college but got injured during senior year and pretty much stopped exercising. I look the exact same, I’m still lean and I weigh the same but I tried to go on a run the other day and I just couldn’t, my tendons are all tight, and my stamina is gone. I couldn’t go for more than 8 minutes at a time.", "author": "Quinntexistential", "created": 1591507729, "upvotes": 2}, "ft8qe1n": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8qe1n/", "text": "I agree.\n\nPersonally I love working out, looking good and being strong, so I never had a problem with working out.\n\nMy tip would be not to force yourself to do hard training, but to find exercises that you like and turn working out into a hoby. To my mind a better long-term strategy to work out a bit every day tham to do hard exercises 3 times a week.\n\nP. S. During the quarantine I've became the strongest form of myself in a long time, because of zoom lectures I am able to plan my time better and have more energy at the end of the day.", "author": "D_Leshen", "created": 1591507687, "upvotes": 39}, "ft8ptv9": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8ptv9/", "text": "For some motivation, I was 280lbs in August and over the school year I dropped my weight to 220lbs. All it took was a little discipline in what i ate and working out a few hours a week.", "author": "BigSnugs", "created": 1591507236, "upvotes": 39}, "ft8p8wp": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8p8wp/", "text": "Remember that the majority of weight loss is dependent upon a good diet! It's very easy to put on weight if you aren't watching your caloric intake, and it's very hard to combat an excessive caloric intake with exercise!", "author": "anxiousrosee", "created": 1591506780, "upvotes": 147}, "ft8p4n8": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8p4n8/", "text": "guys look up zyzz on youtube and this guy will inspire you to workout for the rest of your life", "author": "suicidalmoms", "created": 1591506687, "upvotes": 13}, "ft8kry0": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8kry0/", "text": "theres a ton of ten minute workout videos online - chloe ting is really popular and has amazing workouts. no equipement needed and everyone can find ten minutes for the most part. a little is better than nothing", "author": "ISurrealDreamsI", "created": 1591503549, "upvotes": 94}, "ft8ka59": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8ka59/", "text": "Agree with this, at the end of my senior year I was 6’0 180 lbs. Ending this freshman year I am now 220 lbs. Don’t stop exercising and try to get in the gym at least 3x a week.", "author": "_OhNo_PistolMeat", "created": 1591503200, "upvotes": 106}, "ft8k69w": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8k69w/", "text": "I suck at continuing to work out. I can’t tell you how many times I would go to the rec center for a day, and then not go again for months. Even during quarantine, I worked out one day in March. Haven’t worked out since.", "author": "microfsxpilot", "created": 1591503124, "upvotes": 28}, "ft8jda8": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8jda8/", "text": "And remember, even if you're in your 20's, it's not too late! 💪", "author": "AkwardlyAlive", "created": 1591502581, "upvotes": 375}, "ft8gcaq": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8gcaq/", "text": "It’s easy too. Go with friends either early in the morning or at night at the rec center. You can play basketball with strangers.", "author": "wetcornbread", "created": 1591500598, "upvotes": 2}, "ft8dpva": {"link": "/r/college/comments/gy4gpv/dont_stop_exercising_kids/ft8dpva/", "text": "I agree with this. Last fall semester (junior year) I was totally consumed by school and other extracurriculars. I stopped working out basically and ate like shit. Gained about 15-20 pounds in 4 months. Your health is way more important than school.", "author": null, "created": 1591498907, "upvotes": 554}}}