{"sid": "pt7lf6", "link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/", "title:": "It has been the worst week of my life.", "text": "On Monday I got into a car accident. I was coming home from school and as I was getting off the highway, this guy rear ended me. It was pretty minor, the back of my car is dented but nothing major is broken, and I have whiplash. However, I’m not sure if this guy even has insurance, he didnt even have a license, so I cannot seek medical attention until the accident report comes in (which takes 3-5 days). If he doesn’t have insurance we might have to sue him. But if he does have insurance I have to file a claim in order to get medical insurance. \n\nOn top of that, my classes have been really busy and hard. I’ve been really stressed out as I am still trying to get adjusted and all of the assignments I have due I do not understand them at all. I haven’t told any of my professors that I was in an accident because I feel like they would not care. None of them accept late work and attendance is mandatory. I have at least 4 hours of class everyday and Monday through Thursdays I’m on campus for 12 hours (which is another story.) \n\nSo I am really stressed and I have no time to get medical treatment or deal with the trauma. Because I’m still waiting for the report, I’m in pain, and everyday I have to drive to school, I cannot relax.  Last night I was driving home at 8:30 pm and this guy tailgated me in the dark, windy neighborhood for 20 minutes straight. \n\nI don’t know how I can deal right now. I am so stressed and behind.", "author": "denver_rose", "created": 1632317484, "retrieved": 1632946168, "over_18": false, "upvotes": 144, "upvote_ratio": 0.96, "comments": {"hdy761m": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdy761m/", "text": "Consider calling your insurance company to verify if you actually have to wait five days before you seek medical attention and if they are saying that is the policy ask them 'what if I need medical care now' and I'm sure there is some loophole they will help you with.", "author": "nikkiemt", "created": 1632394617, "upvotes": 1}, "hdxr0l8": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdxr0l8/", "text": "I would see if your school has any type of student assistance center that could help you.  Also, your university may have a health center that could help. Definitely email your profs and your adviser with pics of  your car and explain that you are having a lot of pain and are trying to figure out how not to fall behind. Send the number of the police report as well, I'd you can.", "author": "daveymars13", "created": 1632380278, "upvotes": 2}, "hdx8vfu": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdx8vfu/", "text": "Go seek medical treatment now. \n\nIf you don’t go within 14 days, your PIP won’t cover it (if you have first party PIP anyways). Your agents wrong.", "author": "Mchaitea", "created": 1632367988, "upvotes": 2}, "hdx1jt6": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdx1jt6/", "text": "On top of what everyone else has been saying, email your professors about the crash. It couldn't hurt to do so", "author": "miekolpham", "created": 1632364162, "upvotes": 5}, "hdwtiao": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdwtiao/", "text": "In the exact same boat. Got rear ended on Friday and this week of school has absolutely sucked between the whiplash and extra work piled on.", "author": "ColtonJK", "created": 1632360245, "upvotes": 3}, "hdw5rkv": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdw5rkv/", "text": "Today on my way to school I hydroplaned into an enbankment went airborne did a 180 and slammed into the side of said enbankment now my car is rattling and the clutch no longer works", "author": "bald_butte", "created": 1632349132, "upvotes": 4}, "hdvwcj5": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdvwcj5/", "text": "Your health comes first over everything.", "author": "ardaggozen", "created": 1632341162, "upvotes": 12}, "hdvu8xq": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdvu8xq/", "text": "Our education system has taught us that attendance and meeting deadlines is more important than ones overall health. Fuck that. Goto hospital or clinic get treated. Take some rest.", "author": "NonameideaonlyF", "created": 1632340000, "upvotes": 20}, "hdv8qzb": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdv8qzb/", "text": ">so I cannot seek medical attention until the accident report comes in\n\nWho told you that?\n\nGO TO THE HOSPITAL **NOW**", "author": "delebojr", "created": 1632331342, "upvotes": 47}, "hdud6ql": {"link": "/r/college/comments/pt7lf6/it_has_been_the_worst_week_of_my_life/hdud6ql/", "text": "I'm unclear on why you need to wait to get medical attention. If you are in pain following a collision you should 100% get looked at ASAP. Worry about the insurance stuff later.", "author": "biggreen10", "created": 1632318189, "upvotes": 122}}}