{"sid": "k0g5n6", "link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/", "title:": "I am realizing now that I was never an “idiot” I just never did my classwork in high school.", "text": "Now that I actually do my assignments in college I am getting all A’s and B’s. Who would’ve thought lol.", "author": "tonicblitz", "created": 1606259770, "retrieved": 1632802657, "over_18": false, "upvotes": 729, "upvote_ratio": 0.99, "comments": {"gdmsv0y": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdmsv0y/", "text": "Same here! The way I look at it, you went to high school because you had to. You go to college because you want/need to", "author": "detergentdata", "created": 1606370351, "upvotes": 2}, "gdlca1s": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdlca1s/", "text": "Same thing happened to me. I had undiagnosed/untreated depression in high school that made me just not try or care. And I thought it was because I was stupid. But I’ve gotten almost all As in college and I’m gonna graduate with honors. It’s all about working hard IMO, very little to do with natural intelligence.", "author": null, "created": 1606338552, "upvotes": 3}, "gdjphgj": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdjphgj/", "text": "Completely relate to this. I almost failed high school and even stayed back a year in 7th grade. Now I have my masters degree", "author": "xdeannabanana", "created": 1606306420, "upvotes": 3}, "gdjjsa4": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdjjsa4/", "text": "Idiocy is as it does. People can only judge your intelligence by your actions, and knowledge is a big component. It doesn’t matter how smart someone is if they’ve nothing to show for it. \n\nSo perhaps it is more accurate to say you were an idiot, but you overcame your idiocy.", "author": "CalmingVisionary", "created": 1606300776, "upvotes": 5}, "gdjh56y": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdjh56y/", "text": "In high school my GPA was a 1. something. I almost wanted to buy my transcript recently just so I could laugh at it.", "author": "Fatcat-Kappa", "created": 1606298014, "upvotes": 6}, "gdje9tl": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdje9tl/", "text": "I felt this. It wasn’t until senior year that I got my shit together and graduated with a 4.0 but it was too late by then lol. However I’m in my second year of college still holding strong with a 3.9!", "author": "ClNNABABE", "created": 1606295126, "upvotes": 3}, "gdjbpqa": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdjbpqa/", "text": "Same here graduated with a 2.5 gpa couple years ago now I get 3.5-4.0s", "author": "MoneyManMase", "created": 1606292673, "upvotes": 5}, "gdj7rj5": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdj7rj5/", "text": "This is precisely my situation and why I don’t go to college, I don’t like school lol", "author": "Tkl071924", "created": 1606289164, "upvotes": 3}, "gdj5e4s": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdj5e4s/", "text": "What year are you in? Ive been an A-B student since HS and but senior year classes kicked my ass this semester", "author": null, "created": 1606287205, "upvotes": 12}, "gdiybw7": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdiybw7/", "text": "This is actually me. I sometimes would do my homework and then just not care enough to bring it to school and actually submit it. I came into college thinking that I was so stupid because my grades were shit in high school, but now that I actually put effort into my work, it's definitely paid off. And people always say that freshman will have a shock when their grades are lower than in high school, but they rarely think about the situation where it could be the opposite", "author": "GP915", "created": 1606281950, "upvotes": 10}, "gdiwopp": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdiwopp/", "text": "Me in 9th grade: I suck  \n\n\nMe in 10th grade who solved his math homework: Ok I am not so bad  \n\n\nMe in 11th grade: Holy shit I am actually smart  \n\n\nMe in 12th grade: Wow.\n\n&#x200B;\n\nMe in Uni first year: Nope I am dumb  \n\n\nMe in second year: Ok I am not so bad  \n\n\nIf this cycle continues likes this I am about to score like a god in my last year", "author": "Algok2001", "created": 1606280851, "upvotes": 30}, "gdimo7y": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdimo7y/", "text": "Some people still don't get this....\"I know I was absent half the semester, and missed most of the homework assignments, and didn't do the last essay, and turned the first essay in 2 weeks late...but is there any way I can still earn an A, like extra credit?\"", "author": "orangeblackteal", "created": 1606274639, "upvotes": 27}, "gdiefmv": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdiefmv/", "text": "Yup same, I have a 4.0 rn, and it’s because I got nothing else to cuz of covid. I’m hoping that I can transfer to a higher ranked college next year, but I kind of regret that I never did any work in hs lol. However, at the same time, I had many good memories with friends cuz we all fucked around and didn’t do shit", "author": "Strawberry500", "created": 1606270003, "upvotes": 7}, "gdi8kwt": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdi8kwt/", "text": "High School in the US is just a giant state-funded daycare center, excluding private schools which you directly pay for. College is where you truly see if that kid in high school is an actual intellectual or just someone who can just regurgitate information for a standardized test. I wish you well in college, sounds like you have your priorities in order.", "author": "Discarded1066", "created": 1606266800, "upvotes": 60}, "gdi0eb3": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdi0eb3/", "text": "College is what made me realize that I *am* an idiot, but only by high school standards.\n\nI could do assignments in 20 minutes, study for half an hour the night before tests, and pull essentially effortless A's in high school honors classes. If I gave my high school level A effort I'd have a GPA below 3 right now. But I started working harder to meet the challenge.", "author": null, "created": 1606262322, "upvotes": 163}, "gdhynfu": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdhynfu/", "text": "I feel like the structure of college is better too. I felt like I had way too much homework in high school . I also feel like I’m learning better than I ever did even for subjects I have no interest in.", "author": "moomunch", "created": 1606261381, "upvotes": 217}, "gdhxkcd": {"link": "/r/college/comments/k0g5n6/i_am_realizing_now_that_i_was_never_an_idiot_i/gdhxkcd/", "text": "[deleted]", "author": null, "created": 1606260800, "upvotes": 118}}}