{
  "sid": "qxkh93",
  "link": "/r/college/comments/qxkh93/grades/",
  "title:": "Grades",
  "text": "I literally can’t get above a B+ in my classes. It makes me so frustrated because I want to go to law school but how am I supposed to get into law school with a 3.1 gpa?? (First semester of college at Fordham University btw) a b- is a 2.67 and it kills me because In high school a b- was about a 3.0 :/ idk what to do. I’ve been to office hours, I study for my tests but I can’t seem to do well on essays and such. Fordham also has a thing for grade inflation where professors only have a certain amount of As they can give…",
  "author": "Fataliens",
  "created": 1637341217,
  "updated": 1637395776,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hl9x0ts": {
      "link": "/r/college/comments/qxkh93/grades/hl9x0ts/",
      "text": "Hard one. Either retake some of the classes, transfer to a different school or switch your major",
      "author": "speed700",
      "created": 1637341378,
      "upvotes": 3,
      "replies": {}
    },
    "hla35ei": {
      "link": "/r/college/comments/qxkh93/grades/hla35ei/",
      "text": "Take some “easy” classes to pump up your grade along with your harder classes. Art classes, physical education, any entry level classes. You can try community college (either dual With your current university or transfer) to avoid going in debt. You need at least a 3.2 and a 3.5 to be competitive to get into law school",
      "author": "DramaQueen100",
      "created": 1637343774,
      "upvotes": 1,
      "replies": {}
    },
    "hlc5rpd": {
      "link": "/r/college/comments/qxkh93/grades/hlc5rpd/",
      "text": "It's your first semester. This is fairly normal because college is qualitatively harder than high school for a lot of students, and you need to adapt your approach. Work on your learning strategies. Figure out what works for you on this level (it's probably not the same as high school but trying harder). Watch your grades improve over time.",
      "author": "lucianbelew",
      "created": 1637374209,
      "upvotes": 1,
      "replies": {
        "hlcuvpl": {
          "link": "/r/college/comments/qxkh93/grades/hlcuvpl/",
          "text": "Thanks :)",
          "author": "Fataliens",
          "created": 1637388244,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}