{
  "sid": "mr37rc",
  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/",
  "title:": "Called a professor's bluff about him not responding to my questions through email and now I think I've poked the bear too much...",
  "text": "Essentially I'm in an online course in upper level science. Lots of questions for this course, but that's not surprising given the level of information. The professor prefers emails and it is laid out in the syllabus that emailing him is best, and that he will respond within 24 hours. He also encourages emails with questions often so I feel no shame for emailing him once a week or so with specific questions. Of the seven emails I've sent over the last 12 weeks, he has responded to 2.\n\nHis past students and current have complained that he does not respond in a timely manner, if at all. I only noticed this AFTER I decided to take the class. \n\nWe ended up having a test due on a Sunday over a section we had not covered yet and wouldn't open until the following day. I emailed him Saturday to confirm (it opened Friday, so Saturday was not short notice) and he didn't respond. Sunday, no response either. I ended up reaching out individually to my classmates and they confirmed that they couldn't see the new module open for the test either. I even had one say he never responds to her emails and she emailed him, too.\n\nEveryone kind of bombed that test. And on Monday I decided to email him and tag the dept head. I asked what the best way to communicate with him would be, what I can do to get him to respond to me in at least 48 hours, and what exactly we should have done about the test.\n\nHe responded very angrily with \"you should check your junk email box, because I've responded to EVERY email you've sent me\".\n\nOkay, buddy. Now that I've lit a fire under your ass, this is the response?\n\nOf course my junk email box was not full. I even have this professor in my contacts for this reason alone because I thought that was a possibility at one point. So I decided to play an idiot and tag the IT desk on the thread. \n\nI asked IT to check my mailbox and settings, and they gave me the all-clear. They reached out to him and tagged me in the emails for a week straight until he responded:\n\n\"Yes I have been receiving her emails. In fact, I'll be emailing her later tonight.\"\n\nIT responded with, \"We need to see screenshots of the sent emails to confirm there isn't an issue with your mailbox, because we have had other complaints.\"\n\nIn between the week that it took him to respond to the email with IT, his department head got ahold of me and gave me a sob story about how overworked and underpaid and how budget cuts are causing issues with response times, and that he encourages me to continue asking questions but with patience. \n\nOhhhhhhh, so it IS an issue of \"I'm too busy.\" Okay. Why did he have to lie about my junk email? I would have rather just been told to keep trying/I'm busy and I'm sorry. But no.\n\nAt this point, I'm waiting for the dreaded email he alluded to sending tonight. I feel threatened. I feel like I cornered someone and called their bluff and now it's about to explode in my face.\n\nWhat do I do?\n\nEdit: I ended up contacting the dean again and sent the screenshot of his \"threatening\" email. I never received an email last night from him. At this point I expressed how I feel threatened and how I have \"poked the bear\" and just don't want to pursue this issue any longer. Clearly this guy has bit off more than he could chew if he can't respond to any emails from any of his students. For those of you actually defending this guy, I suspect you're overworked and underpaid professors as well. Just know that it is your job to teach and you are failing miserably as an educator AND as an adult in this modern age if you can't sit down for 3 minutes and respond to an email within 72 hours. Ever wonder why your students keep emailing you and your inbox is so full? It's because you're a shit teacher.",
  "author": "NoSite3062",
  "created": 1618444517,
  "over_18": false,
  "upvotes": 1751,
  "upvote_ratio": 0.98,
  "comments": {
    "gwyx8ni": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gwyx8ni/",
      "text": "Late, but use ratemyprofessors to pick classes unless you have no choice. If so, sometimes life sucks.",
      "author": "MaxIgnition",
      "created": 1620174987,
      "upvotes": 3,
      "replies": {}
    },
    "gun4r5q": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun4r5q/",
      "text": "Okay, so your professor is absolutely wack in this situation. His aggression is completely uncalled for, and whatever went on with that test is wack too. \n\nBut your edit is just nuts and shows a crazy disconnect. It’s not “3 minutes to respond to an email”, it’s “hours of responding to hundreds of emails, many of which might require me to go look something up or research the answer”. You’re right, it *is* their job to teach, not to be a human email machine. You should expect to get responses, yeah, but have a little perspective.",
      "author": "Xystem4",
      "created": 1618516205,
      "upvotes": 2,
      "replies": {
        "gun7460": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun7460/",
          "text": "Fair enough. I mainly just wanted to vent because there are a nice chunk of people on this thread defending his behavior. Apologies - and I know it's longer than 3 minutes. But the thought rings true regardless. I used to work as a TA in a course many years ago. At a state school as well. We were given time to set office hours of our own and were told to utilize that time to respond to emails and questions. So I know this could be the case for my professor and he chooses not to do so.",
          "author": "NoSite3062",
          "created": 1618517215,
          "upvotes": 2,
          "replies": {
            "gunrapl": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gunrapl/",
              "text": "I think it’s mostly just the one person defending them all over the place... most profs here agree with you and are on your side!",
              "author": "officially_anxious",
              "created": 1618526394,
              "upvotes": 2,
              "replies": {
                "gunt9nc": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gunt9nc/",
                  "text": "I'm seeing about 3 or 4 and then a couple defending their own email policies, which is totally not relevant to the situation.",
                  "author": "CrimsonQuill157",
                  "created": 1618527387,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gun3cij": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun3cij/",
      "text": "Professors crying in your comments lol",
      "author": "Big-_D",
      "created": 1618515612,
      "upvotes": 6,
      "replies": {}
    },
    "gumzfgr": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumzfgr/",
      "text": ">Just know that it is your job to teach and you are failing miserably as an educator AND as an adult in this modern age if you can't sit down for 3 minutes and respond to an email within 72 hours. Ever wonder why your students keep emailing you and your inbox is so full? It's because you're a shit teacher.\n\nDepends. This \"professor,\" who sounds like a contract instructor, is not doing very well at their job. That's for sure. You're definitely a thorn in his side, but I doubt they'll retaliate in any meaningful way. If they're truly that strapped for time they don't have time to engage in petty games with students who are simply trying to complete course requirements.\n\nThat said, at the end of term I get about a dozen emails a day from students with some of the most fucking asinine questions, and they just aren't a priority. I had one student email me last week asking me to \"confirm\" that the official exam schedule was correct, and that our exam is in fact when it says it is. I had other students email me about needing an abstract, when I've said, in class, *twice*, and on the course syllabus, that it's not necessary. \n\nSo your statement depends in large part on the nature of the emails. What you're talking about is very valid and the prof should have done a better job at figuring this shit out. That's on him. But from our perspective, there are shit students alongside shit teachers. And they outnumber them 50 to 1.",
      "author": "purple_ombudsman",
      "created": 1618513928,
      "upvotes": 3,
      "replies": {
        "gun1j7a": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun1j7a/",
          "text": "I totally get that. But my questions are not asinine. I have asked about particular formulas/answers that were marked incorrectly that I had to show up to a physical office hour for a confirmation that I was right and I would get points back. Something so simple an email would have sufficed. Things like, can you explain why this is necessary when your lecture contradicts this completely? I'm not making this up - I simply had questions that required clarification. But I get that. Some people straight up don't read or refer to their syllabus and I sympathize with you.\n\nEdit: I am totally okay with being considered a shit student if me being \"lawful good\" in these situations earns me that title. I'm just following my syllabus.",
          "author": "NoSite3062",
          "created": 1618514822,
          "upvotes": 2,
          "replies": {
            "gun32oz": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun32oz/",
              "text": "No no, I wasn't calling you a shit student. I'm just saying that if a prof doesn't answer all their emails, or in a timely manner, it doesn't mean they're a shit teacher. Because most of the time the answers are in the course syllabus.\n\nYour instructor dropped the ball here, unquestionably.",
              "author": "purple_ombudsman",
              "created": 1618515494,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "guq5crm": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guq5crm/",
          "text": "My e-mail policy has been: First, try to answer the question yourself. If you need help, read the assignment sheet, and then read the syllabus. If that doesn't answer the question, ask a classmate, and if after asking two classmates you still don't have an answer, e-mail me.\n\n\"When is the paper due?\" ...All the god damn time.",
          "author": "bl1y",
          "created": 1618582237,
          "upvotes": 1,
          "replies": {
            "guq6cgv": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guq6cgv/",
              "text": "I make a note of that at the start of every class. I write down detailed instructions to *all* of my assignments in my syllabus. They have access to *all* of their assignment guidelines the entire year.\n\n\"Everything you need to know about everything is in the course outline. Before sending questions, please read the syllabus/assignment guidelines.\"\n\n\"What do you want for this assignment?\" \"Look at the course outline.\"\n\n\"How do I begin this assignment?\"\n\n\"Look at the course outline.\"\n\n\"Where are the questions I....\"\n\n\"Course. Outline.\"\n\nWe need to figure out a way to make it the centrepiece of nearly every conversation. I want to frame it and put it on the wall of the classrooms I teach in so I can just begin pointing to it every 30 seconds. I get that students get stressed out and flustered, but I fail to understand how undergraduates' memories can be *that* goldfish-like.",
              "author": "purple_ombudsman",
              "created": 1618582692,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gumt8a8": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumt8a8/",
      "text": "Absolutely legendary edit, good job OP",
      "author": "TheLongJon",
      "created": 1618511185,
      "upvotes": 6,
      "replies": {}
    },
    "gumrnsu": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumrnsu/",
      "text": "My syllabus says I reply to emails within 24 hours, but it also says I don’t answer emails in the evening or on the weekend, between Thursday afternoon and Monday morning, but that I’ll respond to an email sent past 5pm on Thursday by 5pm on Monday, since that would be 24 hours during the designated time. This week I was sick on Monday, so I would not have had to answer any emails from Thursday at 5pm until Tuesday at 5pm. Unfortunate, but sometimes the times shake out that way.\n\nHowever, as long as I’m grading that weekend, or I see an urgent message come through, I’ll reply to a message even on the weekend. I just don’t guarantee things I’m not 100% sure I’ll do. It’s always better to pleasantly surprise someone who isn’t expecting something than to disappoint someone by not meeting a promise, even if both people are delivering the same result.\n\nLike, if I tell you I don’t respond to emails on the weekend but I respond on Sunday night at 7pm, you’re more likely to be happy with that than somebody who tells you they will email you by Friday at noon and they take until Sunday at 6pm to do it. Unexpected surprise is better than the disappointment of not fulfilling an expectation.",
      "author": "chrisrayn",
      "created": 1618510506,
      "upvotes": 3,
      "replies": {
        "gumrx65": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumrx65/",
          "text": "I don't think the timing of what you're talking about is what's going on in my situation. I respect what you do and agree that timing is weird. This guy takes anywhere from 3 days to a week. This was the first email chain I started on the weekend and knew I probably wouldn't get a response. It just happened to be the straw that broke the camel's back. Even during the week my instructor doesn't respond.",
          "author": "NoSite3062",
          "created": 1618510618,
          "upvotes": 8,
          "replies": {
            "gumsh5g": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumsh5g/",
              "text": "I’m not defending him at all. I’m just telling you my policies so they they will stand as what Hopefully an acceptable policy would be. It’s not acceptable to wait so long to answer emails.\n\nIn your situation, I likely would have answered the email on Sunday, about an hour after receiving it, but didn’t have to respond, technically, until Tuesday at 5pm, as per my syllabus. He should have emailed sooner.",
              "author": "chrisrayn",
              "created": 1618510859,
              "upvotes": 3,
              "replies": {
                "gumwsf8": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumwsf8/",
                  "text": "I totally understand. Keep being a good educator, and thank you for your perspective on this regardless.",
                  "author": "NoSite3062",
                  "created": 1618512752,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gumqgyk": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumqgyk/",
      "text": "Any prof in this thread excusing this guy needs to give their head a shake (the \"It's not our job to answer emails!\" argument is particular lunacy). Answering emails is not my favourite part of the job, don't get me wrong. I had 300+ students this term and there were times I wanted to scream and hurl my laptop across the room so that Outlook would stop pinging every two minutes. \n\nTeaching is part of the job. Responding to student questions is part of teaching. If you don't want to do it via email, establish another reliable and accessible way to do it. The prof in this case made a major error, then doubled down and got nasty. If he's tenured he won't get anywhere near the reprimand he deserves, which is a pity.",
      "author": "alimck476",
      "created": 1618509985,
      "upvotes": 23,
      "replies": {
        "gumrm45": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumrm45/",
          "text": "Thanks for being a good educator. I agree, it must suck. And I sympathize. But it is okay to admit to be busy, overworked, underpaid. It's not okay to place blame on me and lie. What kind of an adult does that?",
          "author": "NoSite3062",
          "created": 1618510486,
          "upvotes": 11,
          "replies": {
            "gun7p1s": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun7p1s/",
              "text": "It was absolutely not okay to be dishonest. You know, I've missed emails from students - it happens - but the sensible response is to apologize, provide the needed information (if it's still needed), or work to fix whatever issues you've caused by not being responsive if the situation's snowballed. \n\nSome professors, sadly, are overprotective of their \"authority\".",
              "author": "alimck476",
              "created": 1618517469,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "gumpstk": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumpstk/",
      "text": "Professor here. He has no excuse. This is ridiculous. My department chair would have my head for this. I’m guessing he took on more classes than he should have for some reason (maybe the DC’s fault) but his response sucks. Sorry you’re having to deal with this.\n\nI hope the dean has something useful for you.",
      "author": "Nerobus",
      "created": 1618509693,
      "upvotes": 16,
      "replies": {}
    },
    "gumlgsm": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumlgsm/",
      "text": "It’s funny that the people who can determine the amount of work given to students can say they are overworked. I’m not saying teaching and being a teacher is easy but there is defiantly ways to manage this. As well as most students are in the same situation of being overworked and underpaid in terms of grade!",
      "author": null,
      "created": 1618507824,
      "upvotes": 6,
      "replies": {}
    },
    "gumk9qj": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumk9qj/",
      "text": "God... Reminds me of one of my professors from last semester. He too had this BS policy about emailing him. He would never respond. I kept being a dock about it since he always encouraged questions, but never seemed to answer anything during Zoom (he never had time, so he would tell us to just email him).\n\nHe kinda got annoyed with me at one point and threatened to report me for interfering with class time, because I always brought it up that he never responded to emails and I want the only one. Other classmates also had the same problem. His solution was to just chat block and mute everyone on Zoom.\n\nWithout going too much further, it ended up turning into a giant shit storm by the end of the semester that involved most of the class which forced him to just curve the entire grade (due to his negligence and department oversight). I went from a D- to a B by the end of the semester due to that curve, but holy shit did it feel like I was in a pitch black cave without a fucking light source. This too was an upper level engineering/science class.",
      "author": "SpectreInTheShadows",
      "created": 1618507305,
      "upvotes": 4,
      "replies": {}
    },
    "gumj1ix": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumj1ix/",
      "text": "You’re a pro at this and I’m jealous of your problem solving skills. You gonna go far in life. And I don’t think he can do shit to retaliate.",
      "author": "legalalyen",
      "created": 1618506776,
      "upvotes": 5,
      "replies": {}
    },
    "gumf2lm": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumf2lm/",
      "text": "[deleted]",
      "author": null,
      "created": 1618505069,
      "upvotes": 4,
      "replies": {
        "gun4qt0": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun4qt0/",
          "text": "Every field has at least some shitty people. But I think being over worked and underpaid is a big part of the problem. It’s a lot more likely someone will be a jerk if they’re stressed, miserable, and behind in all their deadlines.",
          "author": "Thunderplant",
          "created": 1618516201,
          "upvotes": 6,
          "replies": {
            "guqigo5": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guqigo5/",
              "text": "[deleted]",
              "author": null,
              "created": 1618587953,
              "upvotes": 1,
              "replies": {
                "gus8ljc": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gus8ljc/",
                  "text": "Probably because so many students these days are like the OP and are entitled, thinking that paying tuition grants them a degree when it only grants them the opportunity to earn a degree.\n\nThe amount of college students who their professors “teachers” and act like college is high school is sad.",
                  "author": "AstuteYetIgnored",
                  "created": 1618616666,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gumep3m": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumep3m/",
      "text": "Does your campus have Accessibility/Disability/Counseling services? Contact them as they are **the best** liaison to have in your corner fighting your fight w you. They won't let you get bullied like that. Yes, teachers are under stress too, but that is no reason to lie to a student or anyone. Hope it works out. Sorry if none of this helps",
      "author": null,
      "created": 1618504905,
      "upvotes": 5,
      "replies": {}
    },
    "gum8h6g": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gum8h6g/",
      "text": "the email issue is one thing. the testing on material never taught? another thing that OP needs to bring up to the department head. OP also should get as many of her classmates to email the dept head about that as well. Do not let the professor get away with that bullshit when its all of your grades on the line. \"Im busy\" isnt a valid excuse. Theyre paid salary to account for overtime and any work that NEEDS to be done and that includes responding to students emails.",
      "author": "Cerenya",
      "created": 1618502196,
      "upvotes": 15,
      "replies": {}
    },
    "gum7o71": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gum7o71/",
      "text": "Wait we're allowed to complain if professors aren't answering our emails? Lol",
      "author": "zeropointninerepeat",
      "created": 1618501854,
      "upvotes": 7,
      "replies": {}
    },
    "gulx2da": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulx2da/",
      "text": "You’re paying to attend that university. They should be  addressing your needs as a student to ensure you are successful. Who the fuck cares if he sends a nasty email- that’s the least of your worries. He needs to get his ass in gear and teach. I have no problem (after all other avenues are exhausted) sending emails or calling the supervisors of the professors failing to answer my questions.",
      "author": "no_more_lines",
      "created": 1618497190,
      "upvotes": 10,
      "replies": {}
    },
    "gulvj6l": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulvj6l/",
      "text": "I don't have advice but wow amazing job! wish I had the confidence to do something like that haha good for you",
      "author": "NotThatGirl217",
      "created": 1618496492,
      "upvotes": 3,
      "replies": {}
    },
    "gulr139": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulr139/",
      "text": "Lol poke them all the way to the dean's office.",
      "author": "Odogonmc",
      "created": 1618494358,
      "upvotes": 6,
      "replies": {}
    },
    "gulnyyr": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulnyyr/",
      "text": "So many replies here are so fucking disgusting.\n\nWhy do some of y’all think that professors should be held to a completely different standard of professionalism (way more lenient for some reason) than students?",
      "author": "FeLoNy111",
      "created": 1618492801,
      "upvotes": 19,
      "replies": {
        "gulw4gt": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulw4gt/",
          "text": "THANK YOU. I genuinely don't understand why people expect so much professionalism from students (who are not yet professionals btw) and don't expect the same from professors (who ARE professionals).\n\nStop with the double standards. If my prof f*cks me over like this one did with the test, then I'm going to escalate if I need to.",
          "author": "gpgc_kitkat",
          "created": 1618496762,
          "upvotes": 12,
          "replies": {
            "gulxx0d": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulxx0d/",
              "text": "There’s an argument to be made that the professor shouldn’t have to respond on weekends in this case; I disagree with it since they set a precedent that an important assignment must be done on a weekend but it’s reasonable.\n\nI’m mostly irritated by the straight up lying and passive aggressiveness to a student. Not acceptable regardless of the scenario.\n\nFurthermore they didn’t follow their own syllabus about emails being an effective means of contact. Imagine r/Professors if a student said a means of contact was effective and then the student ghosted them AND if a student didn’t follow the syllabus lmao",
              "author": "FeLoNy111",
              "created": 1618497575,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "gulikfp": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulikfp/",
      "text": "This post and all the comments winding OP is insane to me. Having an assignment due on a Sunday is not the best, but responding to emails on the weekend should never be the expectation regardless. If your professor isn’t responding to email, rather than escalating to the dept chair, why not go to office hours talk, talk to him after class, or talk to the TA (this is the first place you should be going for content questions anyway). This is so entitled. God. I am so glad that I will be done with my TAing responsibilities this semester. \n\nI also want to say that it is not that I think there is never a case for escalating. I had an instructor in under grad who was a senior PhD student teaching their own class. They regularly did not show up to class without emailing. Students in the class decided to report the issue after they did not show up the day of the exam.",
      "author": "romantic_itch",
      "created": 1618489728,
      "upvotes": -11,
      "replies": {
        "gulv1g4": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulv1g4/",
          "text": "I think the answer here is that there are no office hours, no class, and no TA, and the only method of contact offered by the professor was email.\n\nI understand that professors aren't teachers and that it's abnormal to expect responses on weekends. But imo if you don't want to answer emails on a Sunday, then you shouldn't schedule an exam for a Sunday.",
          "author": "Nihil_esque",
          "created": 1618496267,
          "upvotes": 7,
          "replies": {}
        },
        "gulvpgc": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulvpgc/",
          "text": "The case for escalating is that they were not taught material covered on an exam because the prof didn't open it. It's honestly not even the emails to me",
          "author": "gpgc_kitkat",
          "created": 1618496571,
          "upvotes": 6,
          "replies": {}
        },
        "gull30e": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gull30e/",
          "text": "I do agree with you about the entitlement of OP, however this is a fully online class with no regular class sessions so there really would be no way to reach this professor otherwise. But, I personally have never taken an online class because I expected the professors would be more inaccessible. I would never expect a response from any professor on weekends, much less one I’d never even met personally. The biggest challenge with online courses is not having the interaction with the professor that you would have in a remote or in person class. \n\nTL;DR I would spend my time getting help from someone who isn’t the professor rather than escalating.",
          "author": "roganwriter",
          "created": 1618491222,
          "upvotes": -1,
          "replies": {
            "guludsj": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guludsj/",
              "text": "> Personally I would have never taken an online class\n\nBoy I have news for you",
              "author": "Nihil_esque",
              "created": 1618495966,
              "upvotes": 11,
              "replies": {
                "gulv6jf": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulv6jf/",
                  "text": "Allow me to clarify, at my university we had distinct types of classes: in person, online, and remote. \n\nIn person classes are self-explanatory \n\nRemote classes are basically in person classes that are conducted remotely because of the pandemic, you meet with your professor at scheduled times and they conduct the class over a virtual conferencing software. \n\nOnline classes are classes where you are given all of the work at the beginning of the semester as well as a couple of deadlines and then expected to complete the coursework by the end of semester. You don’t meet or communicate with the professor regularly. These were what online only students took at my university and they were online before the pandemic. After the pandemic, the school had more of these offered and extended them to students who previously would’ve only had in person classes. \n\nFrom the way OP described this class, I assumed it was the latter, where communication with the professor is not really an expectation, not a remote class, where I would expect the professor to be way more responsive.",
                  "author": "roganwriter",
                  "created": 1618496332,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gulg4em": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulg4em/",
      "text": "You did not do anything wrong, it was him who didn't do his work. If he ever says anything, just be polite, but stand your ground",
      "author": "Farkhast",
      "created": 1618488174,
      "upvotes": 5,
      "replies": {}
    },
    "gulbgrh": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulbgrh/",
      "text": "Wth kind of department head covers for that... take this shit to your dean",
      "author": "csupernova",
      "created": 1618484716,
      "upvotes": 50,
      "replies": {}
    },
    "gulag99": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulag99/",
      "text": "Reminds me of when a student asked a professor in front of the whole class if she received her email, the professor answers \"Yes, I did\" the student then responds \"I never sent you an email\"\n\nThe rest of the class: 👁👄👁\n\nCaught the bitch ass liar",
      "author": "Jeffotato",
      "created": 1618483838,
      "upvotes": 18,
      "replies": {}
    },
    "gul3vmm": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul3vmm/",
      "text": "That guy sounds like a narcissist. The threat you’re feeling is the impending narcissistic explosion. He is going to be mad at you for you not swallowing his abuse. \n\nDo NOT let him make you feel like you did anything wrong. Narcissists aim to not only abuse, but convince you that you deserve it. Fuck him and the horse he rode in on. \n\nNo rec letter or networking opportunity is worth abandoning yourself and your dignity + self worth. Stand up for yourself.",
      "author": "sovereignlight_cafe",
      "created": 1618477373,
      "upvotes": 1,
      "replies": {
        "gul4a5y": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul4a5y/",
          "text": "This guy sounds like an adjunct who is barely holding it together working three different jobs because the universities are only offering $2000 per course.",
          "author": "bl1y",
          "created": 1618477793,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gul3ozh": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul3ozh/",
      "text": "Please give us an update on what he says and what ends up happening ultimately the rest of the course wit him!",
      "author": "smiggie_ballzy",
      "created": 1618477181,
      "upvotes": 2,
      "replies": {}
    },
    "gul319u": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul319u/",
      "text": "As a low-level admin, I appreciate your advocacy. I truly want and need to know when faculty members need redirection.",
      "author": "forgetnameagain",
      "created": 1618476513,
      "upvotes": 11,
      "replies": {}
    },
    "gukrf4y": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukrf4y/",
      "text": "What college do you go to? Just so I can avoid it sounds like everyone dgaf",
      "author": "Napkinboy2000",
      "created": 1618465655,
      "upvotes": 3,
      "replies": {}
    },
    "gukqy99": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukqy99/",
      "text": "hell yeah dont be intimidated, unless you're trying to get a grade bump you are being totally honest and are in the right with good intentions.",
      "author": "Leeerrrooyyyjennkins",
      "created": 1618465271,
      "upvotes": 3,
      "replies": {}
    },
    "gukq7xj": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukq7xj/",
      "text": "Well, he’s a fucking asshole. You did everything he told you down to a T. Even better? You asked your peers if they were going through the same thing, then the department head, and then IT. You made the right choice, people are just annoying like that.",
      "author": "thatone_sidehoe",
      "created": 1618464695,
      "upvotes": 11,
      "replies": {}
    },
    "gukm53p": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukm53p/",
      "text": "Wow bro. If this is how you deal with people now you’re in for a rude awakening in the real world.",
      "author": "logoyahoo",
      "created": 1618461628,
      "upvotes": -26,
      "replies": {
        "guknpps": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guknpps/",
          "text": "If gross incompetence is the status quo I should’ve painted the ceiling a decade ago.",
          "author": "Simply_Cosmic",
          "created": 1618462779,
          "upvotes": 23,
          "replies": {}
        },
        "guks1lk": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guks1lk/",
          "text": "Yeah man. Just keep your head down and let people shit on you. And if someone in a position of power does something wrong, make sure they're never accountable. Thats totally what you do in the real world",
          "author": "teddybearbrutality",
          "created": 1618466172,
          "upvotes": 13,
          "replies": {
            "gukw7hd": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukw7hd/",
              "text": "Or, continue this slash and burn approach to effectively influencing others and 60 years from now you can ponder why you never got those grades, jobs, promotions you thought you deserved. You may think now that you won this battle but this style of solving problems won’t win the war.",
              "author": "logoyahoo",
              "created": 1618469797,
              "upvotes": -14,
              "replies": {}
            }
          }
        },
        "gukuj2t": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukuj2t/",
          "text": "This attitude is exactly why the \"real world\" is such a shit show.",
          "author": "IosefaL",
          "created": 1618468291,
          "upvotes": 12,
          "replies": {
            "gukw9zx": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukw9zx/",
              "text": "Nah. The world is already how it is. You can hate the game but at least learn how to play it.",
              "author": "logoyahoo",
              "created": 1618469860,
              "upvotes": -17,
              "replies": {
                "gumlboj": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumlboj/",
                  "text": "Thanks for saying the quiet part out loud, now we all know you're just a jackass.",
                  "author": "HailToTheMeta",
                  "created": 1618507763,
                  "upvotes": 4,
                  "replies": {
                    "gun3co7": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun3co7/",
                      "text": "Don’t hate the playa. Hate the game.",
                      "author": "logoyahoo",
                      "created": 1618515614,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gukltl2": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukltl2/",
      "text": "You emailed him sat, and were upset you didn’t get an email by Sunday? Then Monday escalated it?\n\nI think that’s kind of nuts, even with a test due Sunday. \n\nAlso curious - can you not ask these questions before, during , or after class, or during an office hour? \n\nIf you’re not getting responses by email, I don’t get why keep doing it that way.",
      "author": "PianoConcertoNo2",
      "created": 1618461401,
      "upvotes": 4,
      "replies": {
        "guknug8": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guknug8/",
          "text": "Read above. It's an online course. No class time, no office hours. Primary contact is email. I'm a professor and I agree with the student here. This is unacceptable.",
          "author": "Lexjude",
          "created": 1618462876,
          "upvotes": 45,
          "replies": {}
        },
        "gukolnu": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukolnu/",
          "text": "A module covered on the test wasn't opened until Friday, and the test was on Sunday. In that situation the student doesn't have a choice but to work over the weekend, and if you ever put anyone, whether a student or a subordinate at work, in that position, you better be ready to accept responsibility for that by making yourself available. \n\nIf my boss asks me to work on stuff overtime during the weekend, I damn well won't feel guilty about pinging him on a Saturday. Similarly, if I was to ever make a coworker work overtime during the weekend, I'd make sure I was available to support them.",
          "author": "cemanresu",
          "created": 1618463448,
          "upvotes": 42,
          "replies": {
            "gumz7yb": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumz7yb/",
              "text": "To me it reads like the test was due on Sunday but the module for it wasn't even set to open until Monday, the day after the test. I have had teachers do things like this by  mistake but they've always corrected it quickly because they actually check their email.",
              "author": "herestoshuttingup",
              "created": 1618513835,
              "upvotes": 5,
              "replies": {}
            },
            "gul1jj8": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul1jj8/",
              "text": ">  you better be ready to accept responsibility for that by making yourself available.\n\n\"You better be ready\", ok, what if I'm not? Profs don't have any responsibility to be \"available\" to students in this regard. If they are, it's a nice gesture from them. If not, tough luck.",
              "author": "BeautyAndGlamour",
              "created": 1618474961,
              "upvotes": -20,
              "replies": {
                "gulzwxe": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulzwxe/",
                  "text": "I’m sorry but that’s just an awful take lol",
                  "author": "PlowDaddyMilk",
                  "created": 1618498477,
                  "upvotes": 11,
                  "replies": {}
                },
                "gunsfke": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gunsfke/",
                  "text": "The professor assigned a test on a module he failed to unlock, then when students tried to warn him via his preferred contact method, failed to respond and took no responsibility for the module or his emails. If you think that's ok, I feel so sorry for your students.",
                  "author": "CrimsonQuill157",
                  "created": 1618526969,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gukjyly": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukjyly/",
      "text": "[deleted]",
      "author": null,
      "created": 1618460123,
      "upvotes": 6,
      "replies": {
        "gul1kyd": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul1kyd/",
          "text": ">  A professor's job is to respond to emails and help their students\n\nIt's not our job at all. But most of us do it anyway because we care.",
          "author": "BeautyAndGlamour",
          "created": 1618475002,
          "upvotes": -6,
          "replies": {
            "guo2lo9": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guo2lo9/",
              "text": "[deleted]",
              "author": null,
              "created": 1618532174,
              "upvotes": 1,
              "replies": {
                "guoxjwy": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guoxjwy/",
                  "text": "I respond to all my emails and go out of my way to help students and make sure they pass, so stfu",
                  "author": "BeautyAndGlamour",
                  "created": 1618549841,
                  "upvotes": 0,
                  "replies": {}
                },
                "gus7yew": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gus7yew/",
                  "text": "Just say you’re a dependent student who needs to be hand held.\n\nEdit:\n\nLooks like i upset the childish college students who lack a sense of accountability.",
                  "author": "AstuteYetIgnored",
                  "created": 1618616324,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            },
            "gulki6z": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulki6z/",
              "text": "This is it exactly, I think a lot of college students expect professors to have the same level of involvement as teachers when that isn’t the case. The job description is similar but different. That’s why I’ve always been grateful to professors who made themselves available for the students but I never expected it. Especially outside normal business hours.",
              "author": "roganwriter",
              "created": 1618490891,
              "upvotes": -8,
              "replies": {}
            }
          }
        },
        "gus80hc": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gus80hc/",
          "text": "That’s not a professor’s job. You’re confusing college with high school.",
          "author": "AstuteYetIgnored",
          "created": 1618616354,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gukj9kc": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukj9kc/",
      "text": "I’m sorry you’re going through this. My son had a teacher like this in high school. She crushed his spirit, his love for the field, his drive to fight for what he deserves. \n\nShe belittled him when he would ask why he wasn’t given credit for assignments he turned in. (At the end of the year she claimed her email didn’t work so she didn’t get any messages or assignments?). she badmouthed him to the rest of the teachers. His GPA took a nosedive. \n\nI understand that teachers are human. Nobody is perfect. But if a professor messes up, they should own it, not blame the student. \n\nSource: this teacher was my coworker so I saw it with my own eyes.",
      "author": "inflewants",
      "created": 1618459663,
      "upvotes": 34,
      "replies": {
        "gulwxub": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulwxub/",
          "text": "Not only should the teacher have ‘owned’ the situation...she should have been held accountable.  What damage!  To the child, gpa, future, etc.  so sad smh\n\nJust saying, if someone was this unresponsive in corporate America and tried to push back on the client... ha!  Heads would roll and they’d be out the door (&appropriately so).\n\nSo mad we are, in general, having to tell our kids who have an obvious negligent situation to deal with it and be quiet bc it can affect you later in your school/uni career.",
          "author": "gaelsinuo",
          "created": 1618497133,
          "upvotes": 13,
          "replies": {
            "guq4kz2": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guq4kz2/",
              "text": "Yes!  And I think some teachers don’t really realize that just because a student is nearly 6’ tall and looks like an adult, they are really just 15 year olds. These are formative years.",
              "author": "inflewants",
              "created": 1618581885,
              "upvotes": 4,
              "replies": {
                "guq65dz": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guq65dz/",
                  "text": "Agreed but in this uni situation the professor was found not to have checked emails (that were confirmed sent by the IT Dept), the students didn’t have all the work to prepare for exam, the profs supervisor is making excuses, etc etc ad nauseam.  This student may potentially seek a higher education (med, law, etc) which is extremely competitive and a grade not reflective of the students knowledge (bc of lack of instruction) is abominable.\nStudents are told to be quiet bc one never knows how this will affect them down the line?  That is true if they speak up or not!  It’s sad that kids have this pressure heaped upon them bc a person can’t fulfill their job requirements.\n\nThis is a clear cut and proved case of prof negligence... imho",
                  "author": "gaelsinuo",
                  "created": 1618582602,
                  "upvotes": 3,
                  "replies": {
                    "gurfug8": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gurfug8/",
                      "text": "I agree, it is awful! And to think how much money students pay to be treated this way. Schools at all levels (elem- university) seem to always back their employee. Students have very little recourse.",
                      "author": "inflewants",
                      "created": 1618602626,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gumfehx": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumfehx/",
          "text": "Why not go to the principal?",
          "author": "thecommuteguy",
          "created": 1618505211,
          "upvotes": 5,
          "replies": {
            "guq7bo1": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guq7bo1/",
              "text": "Well, I wasn’t really expecting it. My son had gotten all As up til this point,  10th grade. I wasn’t really involved with his grades because he was driven and handled it himself. \n\nI would ask him how it was going and he was reluctant to talk about it. Once he opened up a little, I encouraged him to talk with the teacher again. But her responses were so off the wall that I assumed there was miscommunication. \n\nWorking at the school, I talked with other students in the class. The males all had similar stories. Another mom and I discussed the situation. That mom had actually emailed the teacher repeatedly but was ghosted. \n\nBut our sons were SCARED. The teacher would threaten them. She would say “all the teachers have discussed this.... “  When I met with her, she even did this to me. I can’t explain it but she was clear that if we caused trouble she would ruin them. \n\nThe boys were in a specialized curriculum and the students had a small group of teachers for the entire four years. The ones involved\n are cold and aloof; The rest are wonderful. \n\nI eventually did go to the principal. She was upset about the situation. She said she had received similar treatment from the teacher but it was out of her hands. \n\nThat particular teacher was gone at the end of the year but the damage was done. \n\nIt really stinks.",
              "author": "inflewants",
              "created": 1618583128,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gukj8q8": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukj8q8/",
      "text": "Good for you for speaking  up. Your not the only one having issues  with his lack of email  response.. don't be worried about nothing. You have every right to be upset/concerned.  If hes offended  or anything..that's  on him. You did No wrong. The department  head  giving yiu the son story  is bs!! If you need to go to the dean of your school, or whoever  is above the department  head. This is unacceptable. They are taking your tuition  money. So you deserve  an email  from your professors  in a timely  manner. The budget cuts aren't your fault. Don't accept  thst bs excuse.  Good job standing  up to this nonsense. Best of luck to you.",
      "author": "LegendkillahQB",
      "created": 1618459647,
      "upvotes": 19,
      "replies": {
        "gul9xxc": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul9xxc/",
          "text": "Agreed and S/he not only deserves an email in a timely fashion BUT THE MATERIAL they are being tested on.  Let’s not forget the missing chapter.  Totally unbelievable",
          "author": "gaelsinuo",
          "created": 1618483388,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gukiyxb": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukiyxb/",
      "text": "Screw that go to Dean of students you its the department heads job to step in. You pay for a service and should not have a bad test because he can't get it together. You need to keep moving up until someone deals with this issues. We pay too much money to be screwed over from someone \"too busy\" to work. Budget cuts do not effect a professor answering emails or being involved in their classes.",
      "author": "Dreaminofwallstreet",
      "created": 1618459472,
      "upvotes": 3,
      "replies": {}
    },
    "gukhmxp": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukhmxp/",
      "text": "I assume he was not responding to emails sent during the work week too? Generally speaking, no one answers emails on the weekend, so if you sent one on Saturday the best you could hope for was end of day Monday.\n\nIs he an adjunct? I'm surprised we would lie to you about the junk mail responses. If you were my student, I would just tell you to ask questions during office hours, as I don't have time to answer weekly emails.",
      "author": "TheProfessorsCat",
      "created": 1618458641,
      "upvotes": 43,
      "replies": {
        "gukqgyf": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukqgyf/",
          "text": "I believe they mentioned that they’ve sent 7 emails over the past 3 months and gotten a response to two. I’m surprised about the misleading response too? maybe they genuinely thought they replied to them. the prof did say that email is their preferred method of contact.",
          "author": "dildoswagginsjr",
          "created": 1618464891,
          "upvotes": 21,
          "replies": {
            "gukqlkv": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukqlkv/",
              "text": "Yeah, I can't imagine anyone in their right mind saying that e-mail is their preferred method of contact. That's why I thought it might have been an adjunct. Absolute lunacy.",
              "author": "TheProfessorsCat",
              "created": 1618464991,
              "upvotes": 9,
              "replies": {
                "gukqvdl": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukqvdl/",
                  "text": "it might be a department thing for my major, but all of my professors (except the adjunct lol) prefer/are best with email as a form of contact. \n\nI have one guy who does office hours one by one, so I’m just sitting in the zoom waiting room until he’s done with the other students. terrible way to do it if you’re not going to reply to emails, but whatever I guess.",
                  "author": "dildoswagginsjr",
                  "created": 1618465208,
                  "upvotes": 17,
                  "replies": {
                    "gukr5hc": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukr5hc/",
                      "text": "The advantage of office hours are that they compartmentalize communication. If you use e-mail, it's possible to have to spend several hours writing responses each day. Though, I must say, I don't like the 1 on 1 style of office hours -- I let several students talk to me at once as they often have similar questions. I treat zoom like I would my regular office hours: a 2 hour window each week to stop by and chat.",
                      "author": "TheProfessorsCat",
                      "created": 1618465435,
                      "upvotes": 5,
                      "replies": {
                        "gulw1nj": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulw1nj/",
                          "text": "a lot of times I can come to office hours and not say anything because the other students’ questions were mine as well. I don’t like it either, especially online because you have no idea how many people are in front of you",
                          "author": "dildoswagginsjr",
                          "created": 1618496726,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gumyxjv": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumyxjv/",
          "text": "I mean, if you're not going to answer emails over the weekend, don't make important work due on a Sunday. If the weekend is a boundary you want to set as a professor, you have to respect that for students as well. Instructors should be available the day that important work is due.",
          "author": "theglasstadpole",
          "created": 1618513707,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gukdw3r": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukdw3r/",
      "text": "[removed]",
      "author": null,
      "created": 1618456416,
      "upvotes": 1,
      "replies": {}
    },
    "gujwx5c": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gujwx5c/",
      "text": "Kudos to you. Just act professionally if you need to reach out to him again. He's not doing his job properly if he's not staying in touch. End of the semester, give him a negative review on websites such as ratemyprofessors.com and through the school (they have teaching evaluations at the end of the semester where I am). I unfortunately have a  professor who kind of vanished near the start of the term until our first exam came around and none of us could reach him either lmao... and he's done the same a few weeks at a time since. He had set certain things to unlock on blackboard on their own and we just had to do everything in each new section weekly so I guess he thought he could chill and we'd be fine on our own. He's a cool dude though just terrible in staying in touch. It's probably the same situation on your end. He probably set up for certain things to unlock on certain dates and something messed up for a section. The sucky part is that he's not attempting to make things right and gaslighting you over it. It's happened a few times for us when things went wrong, but when we finally got a response my professor usually extended those assignments to give us a chance to redo them.",
      "author": "sasiamovnoa",
      "created": 1618447387,
      "upvotes": 134,
      "replies": {
        "gujxkzr": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gujxkzr/",
          "text": "Gaslighting - I love that you mentioned that. He has done this to me so much. Like really, why am I feeling crazy for an email every other week about specific questions, not just general stuff or \"please bro help me with my grade\". I've even gone through and checked my junk mailbox several times AFTER the fact because he made me second-guess myself so much. Gaslighting in educational and professional environments happens so often.",
          "author": "NoSite3062",
          "created": 1618447731,
          "upvotes": 94,
          "replies": {
            "guk06rm": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guk06rm/",
              "text": "it's definitely what he's doing to you. hopefully you'll be able to finish the semester alright despite dealing with all that. during this pandemic, when most classes are online, it's important to stay connected in order to discuss issues, ask questions, or clarify something. it's our only mode of communication. we can't just waltz into their office during their office hours. not responding during the timeslot they told you they would is unprofessional and rude.",
              "author": "sasiamovnoa",
              "created": 1618449085,
              "upvotes": 19,
              "replies": {}
            },
            "gumypvn": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumypvn/",
              "text": "The only reason your questions would be unreasonable is if the class has GAs or TAs with a recitation to handle these kinds of questions.",
              "author": "raz-0",
              "created": 1618513613,
              "upvotes": 3,
              "replies": {
                "gun1m19": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun1m19/",
                  "text": "I agree - if I had a TA I'd be asking them. But we don't.",
                  "author": "NoSite3062",
                  "created": 1618514856,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gujs2cw": {
      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gujs2cw/",
      "text": "Honestly? Good for you. You followed your professors instructions, he failed to follow through on his own end of the bargain, and lied when he got caught. \n\nPosts like these make me extra thankful for the wonderful professors I have. I hope everything works out as best as possible for everyone involved.",
      "author": "spicyprions",
      "created": 1618444900,
      "upvotes": 1160,
      "replies": {
        "gujsnn2": {
          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gujsnn2/",
          "text": "I have already reached out to the dean of the arts and sciences, but she never got back to me.",
          "author": "NoSite3062",
          "created": 1618445210,
          "upvotes": 290,
          "replies": {
            "gulbnls": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulbnls/",
              "text": "Professor here. You might have gone too high up for your appeal. The professor's direct supervisor would be the department chair.",
              "author": "raspberry-squirrel",
              "created": 1618484877,
              "upvotes": 96,
              "replies": {
                "gule5n5": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gule5n5/",
                  "text": "Is the department chair another name for the department head or is it different? Because the department head already has been in contact and made excuses for the professor.",
                  "author": "CrimsonQuill157",
                  "created": 1618486804,
                  "upvotes": 36,
                  "replies": {
                    "gulji0l": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulji0l/",
                      "text": "they are generally the same person/position but sometimes there are both a dept head and a dept chair. but you are correct that she most likely has already contacted the highest rank within the dept and the dean would be the next best step. op if you see this email your dean again. and if you have admin services figure out who to contact. you are doing the right thing stoke that fire.",
                      "author": "snekhoe",
                      "created": 1618490294,
                      "upvotes": 29,
                      "replies": {
                        "gumn61j": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumn61j/",
                          "text": "professor here- any good dean will not deal with this- this is a departmental issue and it should stay at that level. the department head gives all annual reviews to faculty not the dean so any issue that needs to be addressed will be addressed at the department level. The level of animosity you will create in this incredibly heated situation will only intensify if you continuous cc a Dean.\n\nwhat you should do is find out how to appeal grades in the course using the provided student handbook. the grade appeal process typically goes to the instructor who may reject it and then you often have the ability to appeal their decision to the department head. This would be the point in which you involve the department head/chair. Then they can objectively look at the details of the course and the emails you sent as well as that faculty members response and make a decision. \n\nLastly, i will also say- did any of your questions include things like: i looked here and here for the answer to the question and this is what i found, i am still confused about this xyz aspect? That type of effort on a students part is what i will generally prioritize in responding to b/c it shows me they engaged with the material FIRST and then came to me when there were still issues.",
                          "author": "Dremd07",
                          "created": 1618508560,
                          "upvotes": 5,
                          "replies": {
                            "gumsjan": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumsjan/",
                              "text": "100% my emails were regarding \"Prof, you mentioned in the vid how to find xyz, and at 12 minute mark you even say this isn't an important factor. But your test question says my answer is not correct regarding something you made clear wasn't important. Can you help me understand?\"\n\nI am not sending BS questions or anything like that. I am reluctant to even discuss this with the dept. head as he was the one who said they are overworked, underpaid, and basically proved this whole situation was a fat lie and neither of us have junk mailbox issues. I'm afraid if I contact him, it will only get worse.",
                              "author": "NoSite3062",
                              "created": 1618510883,
                              "upvotes": 11,
                              "replies": {
                                "gunsj54": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gunsj54/",
                                  "text": "So I think the thing about that is there isn’t really a question there to be answered.  It reads more like, I didn’t study this bc you said it wasn’t an important issue but I got it wrong so now explain why I got it wrong.  I totally agree it’s annoying to say this isn’t important and then write a question on it. That’s misleading as a teacher to some degree, but what you are asking for is not a clarification of content but a justification of why they asked a question which they don’t really owe you. To be fair, if it was covered in the material in any way then it’s important to some degree. Often adding questions like that helps differentiate between the A+ student who studies it regardless and the B+ student who’s focuses on the important material, but not All the material. I know that’s a super annoying answer, but I can say I add questions to exams I on,y expect about 5% of students to get right because that’s how you differentiate between performance in the class. I also to be fair ensure that 70% of the questions about 90% of students should get right because that sets my internal threshold of whether you understand the content or not. If a student is scoring below a 70 and most everyon is getting those questions right then clearly it’s likely they shouldnt pass the class bc they can’t demonstrate mastery of the material. \nTLDR your questions come off as nit picky and don’t ask to clarify a concept they are asking for justification.",
                                  "author": "Dremd07",
                                  "created": 1618527017,
                                  "upvotes": 0,
                                  "replies": {
                                    "gunzet1": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gunzet1/",
                                      "text": "Yeah that's a crappy answer. I don't care pedantic they thought his question was, it's still a professor's job to answer the student who has a question about his class. They might claim they're underpaid which could be true but students certainly don't underpay for classes and if they don't want the job, they should go do something else. It isn't that hard to take 2 minutes to answer an email.",
                                      "author": "MamaAvalon",
                                      "created": 1618530518,
                                      "upvotes": 6,
                                      "replies": {
                                        "gupjydi": {
                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gupjydi/",
                                          "text": "But what kind of answer did they want? That’s my point. It’s a very vague question. They just say help me understand? Understand what? Why the question was asked? Why they got it wrong? What part they got wrong? All the person did was point out they got something wrong bc they didn’t think it was important per the instructor. Which is definitely as I said crappy from the instructors stand point but they didn’t actually ask a pointed question at all. It’s like the most annoying possible way to ask a question and is so passive aggressive in its approach. Just come out and say: can you explain this part of question 8 that I got wrong?  The whole part they included about why they didn’t do something bc at minute 12 they were told it wasn’t important is just there to try to passively say you shouldn’t have asked this question. What’s the intent of the email? Bc it reads like the intent is to try to point out it’s a bad question rather than understand what they got wrong",
                                          "author": "Dremd07",
                                          "created": 1618569716,
                                          "upvotes": 2,
                                          "replies": {
                                            "guq55gf": {
                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guq55gf/",
                                              "text": "If the instructor didn't understand what the student was asking, they would email back asking a clarifying question or setting up an appointment for the student to call and discuss as it's too complex to answer by email. Not simply ignore the person's question because they don't want to answer it. That's unprofessional. The question seems perfectly clear to me - if something isn't important and you're getting it wrong on a test and losing points for it, the clearly it actually IS important. A professor should never really say something they're teaching is \"not important\" anyway - if not, why are they even teaching it? The correct answer would be to clarify \"Yes, you're right. When I said X isn't important what I mean is that it's not as important as Y but it is a consideration and you should know how to find it so maybe I phrased that wrong. For more information on how to find X properly, go to Z resource or look at section ABC in the book\" etc.",
                                              "author": "MamaAvalon",
                                              "created": 1618582143,
                                              "upvotes": 4,
                                              "replies": {}
                                            },
                                            "gusseoa": {
                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gusseoa/",
                                              "text": "Even saying, \"As per the syllabus/the expectations I laid out on the first day/etc students are expected to study everything mentioned in classes and be prepared for anything from class to show up on an exam\" is better than not sending an email at all, especially if students were specifically told to reach out by email. I think that's more the point OP is trying to make.",
                                              "author": "author124",
                                              "created": 1618627501,
                                              "upvotes": 5,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gumkiz5": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumkiz5/",
                  "text": "I have already contacted the department head. They gave me the sob story about how overworked they are.",
                  "author": "NoSite3062",
                  "created": 1618507417,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            },
            "gukvqmb": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukvqmb/",
              "text": "Have you checked your junk mail? /s",
              "author": "lettuce03",
              "created": 1618469372,
              "upvotes": 19,
              "replies": {
                "gumlp2q": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumlp2q/",
                  "text": "Daily at this point 😅",
                  "author": "NoSite3062",
                  "created": 1618507924,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "guki8y7": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guki8y7/",
              "text": "So you might think you can 'win' this fight, but what is the point?  You're not going to get this guy fired or even reprimanded.  All you're going to do is make sure people are annoyed with you.   Reddit has this weird fixation with 'technically being correct is the best correct' but in a real, human scenario, all you're going to do is look bad for very little gain.",
              "author": "autopoietic_hegemony",
              "created": 1618459021,
              "upvotes": 68,
              "replies": {
                "gukz3cf": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukz3cf/",
                  "text": "I disagree. I say OP is being completely reasonable. A lot of university officials I’ve spoken with have been only too happy to tell me about bureaucratic red tape whenever I don’t perfectly follow their arbitrary procedures.",
                  "author": "A_Stunted_Snail",
                  "created": 1618472505,
                  "upvotes": 85,
                  "replies": {
                    "gul0e5x": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul0e5x/",
                      "text": "I think that's missing the point. Reasonable or not, pissing off the professor and department is a bad move and is not worth it.\n\nOP should let this go. Preferably even apologize.",
                      "author": "BeautyAndGlamour",
                      "created": 1618473793,
                      "upvotes": -43,
                      "replies": {
                        "gul3nai": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul3nai/",
                          "text": "Apologize for being abused? Really? No.",
                          "author": "sovereignlight_cafe",
                          "created": 1618477134,
                          "upvotes": 41,
                          "replies": {
                            "guleqi8": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guleqi8/",
                              "text": "Not responding to emails = abuse?",
                              "author": "BeautyAndGlamour",
                              "created": 1618487223,
                              "upvotes": -6,
                              "replies": {
                                "gull4a3": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gull4a3/",
                                  "text": "OP probably failed a test that the prof seemingly set up as impossible to pass, and OP is more than likely paying thousands for the privilege, then getting neglected by a gas-lighting professor when trying to rectify the situation. I understand the word abuse makes some people uncomfortable, but there are varying levels and you don’t need to be getting whipped with your step-dad’s belt to fall into the category of being abused. OP is being financially abused and is a victim of gas-lighting, for sure.",
                                  "author": "MsTruCrime",
                                  "created": 1618491243,
                                  "upvotes": 29,
                                  "replies": {}
                                },
                                "guljdkk": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guljdkk/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1618490220,
                                  "upvotes": -16,
                                  "replies": {
                                    "guljx8l": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guljx8l/",
                                      "text": "Really, all this time spent pursuing this course of sticking it to the professor could’ve been spent getting answers and resources from somewhere else. College isn’t like high school where the professor is expected to handle everything. In a perfect world that would be the case but sometimes you have professors who don’t. So as an adult, you have to figure out a resolution for yourself sometimes because escalating an issue is likely not to do anything.",
                                      "author": "roganwriter",
                                      "created": 1618490549,
                                      "upvotes": -17,
                                      "replies": {
                                        "gulrqye": {
                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulrqye/",
                                          "text": "I mean the professor is expected to open the module in an online class where students gain the information. The issue here is that OP should be focusing more on the fact that the entire class failed because they were not taught the information on the test than the emails.",
                                          "author": "gpgc_kitkat",
                                          "created": 1618494706,
                                          "upvotes": 13,
                                          "replies": {
                                            "gulvgln": {
                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulvgln/",
                                              "text": "That’s a good point.",
                                              "author": "roganwriter",
                                              "created": 1618496458,
                                              "upvotes": 6,
                                              "replies": {}
                                            },
                                            "gun0tbj": {
                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun0tbj/",
                                              "text": "Which the OP tried to clarify before the test *via email.*",
                                              "author": "CrimsonQuill157",
                                              "created": 1618514521,
                                              "upvotes": 2,
                                              "replies": {
                                                "gun12a0": {
                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun12a0/",
                                                  "text": "Right but I'm saying that shouldn't be the sole focus of the escalation as much as the test issue should be",
                                                  "author": "gpgc_kitkat",
                                                  "created": 1618514625,
                                                  "upvotes": -1,
                                                  "replies": {
                                                    "gun3sb2": {
                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gun3sb2/",
                                                      "text": "However, there would have been no escalation, had the prof been checking his/her email, because at that point, the prof would’ve been able to rectify the situation by going online and clicking a button, or checking a box, to unlock the learning module in question. It is unethical to test students (college, high school, elementary, etc) on material you have not taught or made accessible.",
                                                      "author": "MsTruCrime",
                                                      "created": 1618515800,
                                                      "upvotes": 0,
                                                      "replies": {
                                                        "guo4f2l": {
                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guo4f2l/",
                                                          "text": "The last sentence is literally my whole point, that is what the escalation is about. Whether or not the prof checked is email is a moot point bc it shouldn't have been an issue he needed to check his email about in the first place.\n\nI also understand that most profs don't check emails on the weekends bc they have lives. If the module had been unlocked when it was supposed to be the emails would not matter.\n\nTherefore the real issue here is the module and test not the email. The emails are a separate issue that don't really warrant escalation.",
                                                          "author": "gpgc_kitkat",
                                                          "created": 1618533120,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "guo5zho": {
                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guo5zho/",
                                                              "text": "Agree to disagree. I think the email is the bigger deal cuz I’m a teacher, and I know how easy it is to forget to check a box or click the unlock icon in the online learning platform after spending 3 hours of non-contracted time lesson planning, digitizing, and uploading every freaking weekend. So, it’s easy to make a small mistake like that, you know, being human and all. I also know my admin would be very forgiving of that mistake and understand it was an oversight on my part after it had been graciously brought to my attention. My admin would not, however, be very forgiving of me ignoring all of my emails for days on end, ESPECIALLY if said emails contained important information which could include the simple solution to not failing an entire class on a test, by the click of a button. So, you see, the whole thing could have been avoided had the professor simply checked the email, which he/she is most certainly contracted to do throughout the school day, at least once.",
                                                              "author": "MsTruCrime",
                                                              "created": 1618533933,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "guo6brs": {
                                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guo6brs/",
                                                                  "text": "Also as a teacher, my admin tend to be more forgiving about missing emails than they are about not teaching an entire unit and my class failing a test. Guess it depends on the uni",
                                                                  "author": "gpgc_kitkat",
                                                                  "created": 1618534114,
                                                                  "upvotes": 1,
                                                                  "replies": {}
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "gul7ku1": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul7ku1/",
                              "text": "It's the way of the world. Save your battles for when you actually have some leverage.",
                              "author": "BeautyAndGlamour",
                              "created": 1618481127,
                              "upvotes": -17,
                              "replies": {}
                            }
                          }
                        },
                        "gummrge": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gummrge/",
                          "text": "You sound like you may be an educator and a jaded one at that. Good luck in your endeavors and I hope to god you know the quote “People will forget what you said, people will forget what you did, but people will never forget how you made them feel.”\n\nBecause this is one of those situations. Grow up and respond to emails as best as you can. It's an email for Christ's sake.",
                          "author": "NoSite3062",
                          "created": 1618508384,
                          "upvotes": 10,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gul5j1p": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul5j1p/",
                  "text": "No no no.  Assuming this is America that schooling is costing OP an *obscene* amount of money, it's not unreasonable at all to demand the actual education that you're potentially going tens or hundreds of thousands into debt for.",
                  "author": "Darkdoomwewew",
                  "created": 1618479085,
                  "upvotes": 72,
                  "replies": {
                    "gul788q": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul788q/",
                      "text": "That's not really what this seems to be about, tbh.",
                      "author": "autopoietic_hegemony",
                      "created": 1618480787,
                      "upvotes": -9,
                      "replies": {
                        "gumz0b4": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumz0b4/",
                          "text": "OPs entire class failed a test because this teacher didn't bother to open up the lesson or communicate about why a test was being given before the lesson - that's exactly what this is about.",
                          "author": "Darkdoomwewew",
                          "created": 1618513742,
                          "upvotes": 6,
                          "replies": {
                            "gumzzoo": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumzzoo/",
                              "text": "That's what it SHOULD be about, but that's not what the OP initially made it about.",
                              "author": "autopoietic_hegemony",
                              "created": 1618514176,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gukyqrr": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukyqrr/",
                  "text": "Could also be bad OP is applying for any kind of grad program... never know if someone at the admissions office knows this prof and asks if they ever had OP in their class and well... that’s not gonna go well. Small chance but it’s a small world.",
                  "author": "DSJ0ne0f0ne",
                  "created": 1618472165,
                  "upvotes": 6,
                  "replies": {
                    "gul1rai": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul1rai/",
                      "text": "This is the thing. It is a *very* small world if you're in academia. Students must realize that their job interview begins the first day of college.",
                      "author": "BeautyAndGlamour",
                      "created": 1618475184,
                      "upvotes": -9,
                      "replies": {
                        "gul3oks": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul3oks/",
                          "text": "Networking is not worth making yourself into someone’s doormat. This student was completely within his right.",
                          "author": "sovereignlight_cafe",
                          "created": 1618477171,
                          "upvotes": 30,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gukhs38": {
              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukhs38/",
              "text": "Why would you escalate this? You are going to burn all of your bridges.",
              "author": "TheProfessorsCat",
              "created": 1618458730,
              "upvotes": -12,
              "replies": {
                "gul06wu": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul06wu/",
                  "text": "I like how burning bridges is the result of calling out a professor for not doing their job.",
                  "author": null,
                  "created": 1618473592,
                  "upvotes": 38,
                  "replies": {
                    "gul0rrz": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul0rrz/",
                      "text": "Some bridges aren’t meant to be kept anyway!",
                      "author": "tired_chemist99",
                      "created": 1618474171,
                      "upvotes": 19,
                      "replies": {}
                    },
                    "gul0lkd": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul0lkd/",
                      "text": "Answering e-mails is not our job. Obviously, the professor in this case set themselves up for failure by claiming it was, but we have no obligation to communicate with students via e-mail.\n\nBurning bridges in this case is raising the issue to the entire university. People talk and the student is going to develop a reputation as a bad egg. Also, if they ever need a letter of recommendation, they may find it difficult.\n\nThere's a lot of times in life where a co-worker/boss is failing to live up to their responsibilities but it isn't always wise to make a fuss.",
                      "author": "TheProfessorsCat",
                      "created": 1618473996,
                      "upvotes": -5,
                      "replies": {
                        "gulmhh4": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulmhh4/",
                          "text": "It’s not like they can walk onto campus during office hours and ask for help. A lot of campuses are still virtual, professors aren’t even on campus. This is what a majority of students are facing right now. If the professor says “email me for help” then they need to respond to emails.",
                          "author": "BamSlamThankYouSir",
                          "created": 1618492003,
                          "upvotes": 16,
                          "replies": {}
                        },
                        "gul3bm2": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul3bm2/",
                          "text": "What is your job then? I don't know what you all do, but I had a professor who would never answer questions in class, say email him, & then never respond. Answering questions is the one thing that is worth paying money for, most all of my \"education\" is textbooks I can get for free & professors uploads to youtube. If a prof doesnt answer students, I don't see what their job in relation to teaching is besides creating assignments & tests.",
                          "author": "Gamerz1818",
                          "created": 1618476801,
                          "upvotes": 33,
                          "replies": {
                            "guldkm0": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guldkm0/",
                              "text": "My PIs jobs include:\n\n - Second-in-command for the department (endowed chair), so he sits in on everything the department head sits in on\n\n - Head of taskforce for COVID, in charge of closing and reopening the department for ~200 research staff and postgraduate students\n\n - Lecturer and supervisor for a few courses each year\n\n - Supervisor to at least 4 PhD students across 2 countries\n\n - External examiner for 1-2 PhDs each year. Usually in other countries, has to travel to sit in on vivas and review theses that are a few hundred pages long.\n\n - Reviewer for major journals, usually has 3-4 papers reviewed at any time.\n\n - Funding proposal reviews\n\n - Various scientific and astronomical committees, usually large-scale ones like for the entirety of the EU or the entirety of the US\n\n - A few media interviews anytime something big happens in astronomy\n\n - Any major conferences, usually in other countries. He might be chairing a panel, or giving an invited talk, or he simply needs to go to help advertise our work and drum up interest in hiring us (his students who are soon to graduate)\n\n - Teaching a group of academics/postgrads QFT\n\n - Preparing papers for discussion in journal clubs\n\n - Other tidbits, like organising talks for weekly seminars, giving talks at other universities/departments, organising visiting scholars who have expertise to help our group, advertising and hiring for postdoctoral positions, securing funding for all members of the group, managing our data storage needs (100's of TB), helping potential students apply and reviewing the research proposals, and answering emails (of which he gets 100's-1000's per day)\n\n - And I haven't even mentioned: doing his own research, writing his own papers, and completing the review process for them\n\nI honestly don't know how he's even alive. I would self-combust if I had that much work to do and that many people relying on me completely. If he fails at nearly any part of his job then there are serious repercussions for the people below him. Sometimes I cancel our weekly meetings because he looks like he's going to die. But if I have a serious issue and need his input ASAP, he'll drop whatever he can to help out.\n\nHe takes teaching very seriously, so a big workload is not an excuse to be a shitty lecturer. Just an example of how much work your lecturers can have, and that they're not just sitting around twiddling their thumbs between your classes.",
                              "author": "officially_anxious",
                              "created": 1618486384,
                              "upvotes": 12,
                              "replies": {}
                            },
                            "gul4xkm": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul4xkm/",
                              "text": "you do realize that most professors conduct research right?",
                              "author": null,
                              "created": 1618478468,
                              "upvotes": -2,
                              "replies": {
                                "guleac8": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guleac8/",
                                  "text": "Then they shouldn't tell students to email them. End of story.",
                                  "author": "CrimsonQuill157",
                                  "created": 1618486901,
                                  "upvotes": 17,
                                  "replies": {}
                                }
                              }
                            },
                            "gul6u4h": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul6u4h/",
                              "text": "Thanks for asking. I'm happy to answer this. So, the job of professors is threefold: research, teaching, and service. Usually, they are in that order in terms of priority.\n\nResearch is our biggest responsibility, and that means either running a lab, doing fieldwork, or archival research. We spend a lot of our time writing articles for journals, publishing books, or presenting at conferences. Importantly, this is our main criterion for promotion and securing tenure.\n\nTeaching is teaching a couple of classes each quarter, designing classes, and holding office hours.\n\nThe third component is service which is essentially serving on committees, university governance, and in administrative roles.",
                              "author": "TheProfessorsCat",
                              "created": 1618480391,
                              "upvotes": -3,
                              "replies": {
                                "gum4g4i": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gum4g4i/",
                                  "text": "\"Research is our biggest responsibility\" the students can tell, and that's why we make complaints like this thread....daily a lot of us are quite literally paying our last cent for some education, and to be very clearly treated as second best after paying a lot of money to the school is frustrating and complaint worthy. This may not be the professors individual fault that their own promotion hinges on putting the students 2nd, but it is a frustrating system that's for sure.",
                                  "author": "bundaya",
                                  "created": 1618500468,
                                  "upvotes": 10,
                                  "replies": {}
                                },
                                "gulx0wz": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulx0wz/",
                                  "text": "Yeah, I know & enjoy a couple professors from each category as their main role. I actually somehow ended up in a graduate student club & met one of my future teaching professors in a friendly role. I'm learning more about their experiences. It's just if I'm paying so much to learn something, I need someone to answer questions & teach well. Most classes so far have had TA's, but my one class in mind was horrible & I didn't learn much. If there's no TA, I'd expect a professor to help students.",
                                  "author": "Gamerz1818",
                                  "created": 1618497172,
                                  "upvotes": 7,
                                  "replies": {}
                                },
                                "gulgrhw": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulgrhw/",
                                  "text": "And if a professor tells students to email them with questions, answering emails then becomes part of the teaching aspect of the job. How does that not make sense? Students can only use the avenues of communication given to them; if they're told they can email, they're going to email and expect a response, *because that's what they were told to do.*",
                                  "author": "author124",
                                  "created": 1618488599,
                                  "upvotes": 21,
                                  "replies": {
                                    "guljz6s": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guljz6s/",
                                      "text": "And as a big addendum to this, rhe prof's immediate response was to lie and deflect blame away. \n\nI think OP is perfectly reasonable, especially considering that the test everyone bombed could have dire financial consequences if it tanks his GPA.",
                                      "author": "musashisamurai",
                                      "created": 1618490582,
                                      "upvotes": 14,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gukk4cx": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukk4cx/",
                  "text": "I can't speak for this person, but I'd personally be willing to burn bridges if it meant the professor would be held accountable and thus reply to emails for students taking the class in the future. I might have to suffer, but maybe if I try hard enough I can make the world a better place for the students after me. \n\nI'm aware this probably sounds stupid to you, but I've done this before, and it was worth it 1000%.",
                  "author": "twentyoneastronauts",
                  "created": 1618460228,
                  "upvotes": 84,
                  "replies": {
                    "guklwiv": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guklwiv/",
                      "text": "Definitely. I'm all about burning bridges if you're doing the right thing. I couldn't care less about what profs think of me, if you're gonna screw the class, I'm gonna do what I can to make it right. Profs hold their students futures in their hands, profs with no passion hurt their students. It's not just \"ah shucks, I forgot\", it's \"I totally tanked the grade of everyone in that class, stunting their opportunities\".\n\nUsually what I do if my peers and I are getting screwed, is post all of my notes, practice questions I've written, and all of the strategies I'll be using on exams. After that, I encourage everyone who didn't get decent resources to complain. It's not much, and it probably doesn't even make a difference, but if I can just make their life just a little bit harder, that's a victory. I have no patience for profs letting their students down and sabotaging their success. Education is supposed to be the closest thing we have to a meritocracy, screwing the people who worked hard to get here is a crime.",
                      "author": "ItsReallyVega",
                      "created": 1618461459,
                      "upvotes": 45,
                      "replies": {
                        "gukqgb0": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukqgb0/",
                          "text": "What do you mean by \"resources\"? Faculty don't owe students practice exams, homework help, e-mail assistance, or tutoring. This isn't high school, anymore; students at research institutions are supposed to be capable, independent, self-learners. What do you think students did back before e-mail? They came to office hours.\n\nTeaching is only 1/3 of what we do, and we aren't promoted for good teaching or student success. If all the students love you, maybe you can win a feel-good reward. If you publish lots, you get promoted.",
                          "author": "TheProfessorsCat",
                          "created": 1618464878,
                          "upvotes": -30,
                          "replies": {
                            "gukr4on": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukr4on/",
                              "text": "We know how students learn. Practice exams and study questions dramatically increase student success. Do what works. \n\nLook towards Dr. Scott Freeman's work revising the UW undergraduate biology program. An elite institution recognized that the \"midterm and a final\" grading structure is biased against low income students and minorities. How did they go about fixing such an issue? Reading quizzes, practice exams, affirmation statements, and study questions. Student success should matter to you, and these are not costly methods to help students become successful.",
                              "author": "ItsReallyVega",
                              "created": 1618465417,
                              "upvotes": 27,
                              "replies": {
                                "gukxpmi": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukxpmi/",
                                  "text": "Op-ed by Dr. Freeman, if this interests you, give it a read.\n\nhttps://www.insidehighered.com/views/2020/09/02/lecturing-disadvantages-underrepresented-minority-and-low-income-students-opinion?mkt_tok=eyJpIjoiWm1JMk56ZGpaV1JoWkdSbCIsInQiOiI4UnpKclJ1MkQrY05cL1pxb3loM0JURUpaSWtxYjg5MHpQUEx4WERWMnZMQmNINDJBZFFKTVFJbHo4VnFoQUlnTWI0T2hZZlhyMVkydnVKQ2cwaWFnVlludzhUeTVLdSs4cDNjTGxcL2hlZ1FVWjRtYWJNbExGaUsxcyttMng4QXdmIn0%3D\n\nAfter this, investigate his research\n\nhttps://youtu.be/hzrCl5RW_Uo\n\nIt's worth it I promise.",
                                  "author": "ItsReallyVega",
                                  "created": 1618471187,
                                  "upvotes": 4,
                                  "replies": {
                                    "guky6rs": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guky6rs/",
                                      "text": "u/TheProfessorsCat",
                                      "author": "ItsReallyVega",
                                      "created": 1618471638,
                                      "upvotes": 2,
                                      "replies": {
                                        "gukyry1": {
                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukyry1/",
                                          "text": "So, I read the article. What it's advocating for in its call to decrease lecture time and replace it with active learning is essentially a \"flipped classroom,\" a teaching paradigm that's been around for 20+ years. Guess who introduced this to their department a decade ago? Yep.",
                                          "author": "TheProfessorsCat",
                                          "created": 1618472195,
                                          "upvotes": 1,
                                          "replies": {
                                            "gukzcny": {
                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukzcny/",
                                              "text": "Not only that. Freeman also advocates for peer graded weekly practice exams and pre-class reading quizzes. This is in Freeman's research in 2011 \"Increased Structure and Active Learning Reduce the Achievement Gap in Introductory Biology\".\n\nMy source on this, is I took this exact course at a (lowly) community college as a part of ongoing research (UW faculty taught). I was provided pre-exams, practice questions, and reading quizzes. We performed at par with our University of Washington counterparts on the exact same exams at the same times.",
                                              "author": "ItsReallyVega",
                                              "created": 1618472760,
                                              "upvotes": 3,
                                              "replies": {
                                                "gukzzdv": {
                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukzzdv/",
                                                  "text": "None of that surprises me, but I suspect one thing that you aren't aware of, having not taught before, is that it can be very difficult to implement the flipped classroom.\n\nOne of the reasons it works well is that it forces students to do work. Under the traditional lecture/homework model, students are exposed to lectures but often neglect their homework. With a flipped classroom, they are forced to work in class, and then the lectures are more easily watched at home.\n\nBut there is a huge issue: students hate it. 90% of students absolutely despise being made to work in class. Everyone knows it produces better outcomes but students are their own worst enemies. They will drop the class when they learn its flipped classroom and join another \"easier\" course.\n\nThere's also a growing trend for students to avoid doing the work in class because it makes them \"nervous,\" of they have other accommodations through the disability office. In these cases, the students do neither the work in class nor watch the lectures at home. \n\nI'm heading out for dinner now, so I can't continue this conversation further, but believe me when I tell you that teaching is vastly more complicated than you are making it out to be.",
                                                  "author": "TheProfessorsCat",
                                                  "created": 1618473380,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "gul0wgn": {
                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul0wgn/",
                                                      "text": "It does work, and it can be tough I'm sure, but the issue is that you know using auxiliary resources outside of the classroom works, and you don't implement them. If you do flipped classroom, awesome, I'm really happy to hear it. However, the auxiliary resources are core to this process. The practice exams and study questions are part of what helps to reduce the divide. You seemed concerned that this would reduce critical thinking ability, but that's just not true. Equity is the goal and this is how we achieve it. For someone who seems like they want to throw their students to the wolves, it seems like you know what the right thing to do is. I can only speak from my experience, but my cohort greatly appreciated the structure of our class. I never had my classroom structure explained to me, but the metacognition of knowing \"this is made to support me\" helped me to love the coursework.\n\nI appreciate the reasonable discourse, for what it's worth I don't think you're a jackass. I want to see this sort of course structure become the norm, but when I saw your first reply, it was the antithesis of a supportive professor. If you are as aware of the data as you appear to be, your students will thank you for doing right by them when it's implemented. I actually really disliked my UW prof as a personality, but I greatly appreciated the course because of how it's helped me succeed in STEM. I'm not sure that your cynicism towards students is fair, but I can't speak to how a few bad apples can kill your interest in teaching, I'm sure it's not a fun job.",
                                                      "author": "ItsReallyVega",
                                                      "created": 1618474308,
                                                      "upvotes": 6,
                                                      "replies": {
                                                        "gulcpcv": {
                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulcpcv/",
                                                          "text": ">If you are as aware of the data as you appear to be, your students will thank you for doing right by them when it's implemented.\n\nUnfortunately, they won't. They will hate the professor with a burning rage so strong that they want to destroy the professor's life. They will complain to all levels of admin and will trash the evals so severely that any adjunct would not be rehired. Many of your professors are adjuncts, with no job security and pretty dependent on getting good reviews. They have every reason to give easy A's and no reason to challenge students, unless they want to lose their job as an educator. The students hate flipped classrooms (I hated them too and still hate them now) and will **NEVER** thank the professor. Absolutely *never*.",
                                                          "author": "officially_anxious",
                                                          "created": 1618485724,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "gulebdb": {
                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulebdb/",
                                                              "text": "Sorry if this is an ignorant question, but is it common practice to explain to purpose of flipped classrooms? Once I came upon Dr. Freeman's research, I fell head over heels for the method. It's really a sort of class structure where you have to do your best and trust the process, if you don't trust the process you feel suspicious of the amount of work you're doing (without realizing how effective your learning has been). When there's data in front of you that says \"this is hard, but you'll all get better grades\", it's like, \"guys what are you doing? This is a good deal for you\". Sure it's cognitive effort, but your grades improve, your competency improves, and it's condensed into the same amount of study time. Maybe I'm naive to believe that other students think this way, or even care at all, but I can't imagine that anyone would stare a gift horse in the mouth like that.\n\nRegardless, I apologize for misjudging student responses. I remember when I was a worse student, feeling pretty dejected about academics as whole, and I'm sure I was tough to work with similar to some of your students.",
                                                              "author": "ItsReallyVega",
                                                              "created": 1618486922,
                                                              "upvotes": 2,
                                                              "replies": {
                                                                "gulevri": {
                                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulevri/",
                                                                  "text": "Yeah, every professor I ever had explained the reasons why they were doing certain things. They explained why we had quizzes to do in class and would even show us the evidence from previous years for how students did if they completed e.g. the homework, the labs, the quizzes. We knew that people did better in flipped classrooms. Doesn't change how much anyone hated it. Didn't change how viciously we reviewed the class. \"Better grades\" and \"better understanding\" are long-term things. Our intense discomfort **every single day of the year** was much more immediate and impactful. The stress, the illness, students crying in the professor's office, even suicide attempts. Flipped classrooms are generally discriminatory against students will illness or disability because you can't adapt in-class material much. Doesn't feel like much of a gift horse when you have to pay for it.",
                                                                  "author": "officially_anxious",
                                                                  "created": 1618487327,
                                                                  "upvotes": 3,
                                                                  "replies": {
                                                                    "gulfzk8": {
                                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulfzk8/",
                                                                      "text": "This is such a radically different experience from what I had. My class covered a large volume of material very quickly, but at no point did it ever feel unmanageable. It felt like I was improving as a student at the same rate that the material got harder, even as a working student. I loved my flipped classroom, it was stressful sometimes, but always within reason. Speaking with my cohort, this was the common perception. I'd do it again for sure. I'm snickering at my upper division courses right now because of how tame they are by comparison, the content is scaled down as if they expect that the entire class is incapable of studying well (I don't really know if that's true because of COVID, maybe they aren't, I don't know). I can accept that we're outliers, or that there is some difference in the presentation of material or literal course content that changed our perception. That's unfortunate to hear though, I didn't know they had that sort of reputation. I don't think it has to be miserable.",
                                                                      "author": "ItsReallyVega",
                                                                      "created": 1618488083,
                                                                      "upvotes": 1,
                                                                      "replies": {
                                                                        "gulgw1m": {
                                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulgw1m/",
                                                                          "text": "No, I think you're just an outlier. Very few people enjoy flipped classrooms, they're known to be very stressful for students, and they're known to be discriminatory towards underprivileged students. You can't properly honour most disability accommodations through the flipped classroom model, so it's simply not an option for most diverse classes. Your class may be rather privileged if they didn't come up against those issues.",
                                                                          "author": "officially_anxious",
                                                                          "created": 1618488682,
                                                                          "upvotes": 4,
                                                                          "replies": {
                                                                            "gulh3jg": {
                                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulh3jg/",
                                                                              "text": "No we did, and we did our best to resolve them together. The whole point of Freeman's high structure classroom was to reduce bias against underprivileged students. We're an impoverished area with a lot of crime, that was likely part of why our CC was selected.",
                                                                              "author": "ItsReallyVega",
                                                                              "created": 1618488818,
                                                                              "upvotes": 1,
                                                                              "replies": {
                                                                                "gulj32d": {
                                                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulj32d/",
                                                                                  "text": ">The whole point of Freeman's high structure classroom was to reduce bias against underprivileged students.\n\nAnd yet it does nothing except introduce bias for disabled students. There are many situations where a flipped classroom is not going to work and is going to do more harm to the population. It's not a real solution, it's just another tool. It absolutely should not become the norm just as lecturing should not be the norm.",
                                                                                  "author": "officially_anxious",
                                                                                  "created": 1618490045,
                                                                                  "upvotes": 2,
                                                                                  "replies": {
                                                                                    "gulk91t": {
                                                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulk91t/",
                                                                                      "text": "Our disabled students were well supported. A variety of folks with mental health challenges and physical disabilities were helped in any way they asked for really. Our class was mostly turn/talk and clicker questions, with frontloaded studying and practice exams/questions after class. No one was asked to present, anyone with anxiety disorders could sit out or work with a small group outside of the classroom. ADHD folks only really ever asked for extra exam time, and felt they could keep up well with small group assignments or clicker questions. People with test anxiety could take their exams in the testing center earlier or later in the day by a few hours, and got extra time. The clicker questions were so low risk that there was basically nothing to lose (most of the points were participation). Never was anyone singled out during class. Those with physical disabilities got accommodations like someone to write for them if needed, to take notes, work through problems verbally, etc.. There was an open, variable credit problem session for extra help, and people could use it as a financial aid gap filler by increasing their credit count. It was supportive in a lot of ways, definitely more than I'm mentioning here.",
                                                                                      "author": "ItsReallyVega",
                                                                                      "created": 1618490741,
                                                                                      "upvotes": 1,
                                                                                      "replies": {
                                                                                        "gulkslg": {
                                                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulkslg/",
                                                                                          "text": "But those aren't a part of the flipped classroom and can be implement in non-flipped settings. It's normal for lecture courses to give practice exams and practice quizzes, except they do them outside of class time. How are you going to give a disabled student extra time on a quiz without disrupting other students **or** outing them for having disability accommodations? They can't go sit the quiz in another room because they'll miss out on stuff after the rest of the class finishes. And it's just not right for you to say that there is nothing to lose for low-point quizzes. Those are points. They matter to people. Just because it adds up to 5% doesn't make it \"nothing\", especially when some people are forced to lose almost all of that. You're capping disabled students' grades and physically preventing them from achieving >95%.\n\nPlus, extra time doesn't even work for quizzes. 1.5 time on a 5 minute quiz is still impossible for someone with schizophrenia. All you're doing is punishing the student for being ill. Even if you made the quizzes worth nothing, you're forcing that student to fail at a task and there is absolutely nothing they can ever do to succeed. That's cruel and wrong. I'm talking from personal experience of being the disabled person - don't tell me that it works for disabled students, because it just doesn't.",
                                                                                          "author": "officially_anxious",
                                                                                          "created": 1618491056,
                                                                                          "upvotes": 3,
                                                                                          "replies": {
                                                                                            "gull4x5": {
                                                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gull4x5/",
                                                                                              "text": "Our practice exams and quizzes were outside of class. There were no in-class quizzes or practice exams, only scheduled exams for credit (like normal). All practice exams and quizzes were to be done at home. Clicker questions were 100 points participation, 50 points credit, with ~400+ questions per quarter. All in teams.",
                                                                                              "author": "ItsReallyVega",
                                                                                              "created": 1618491253,
                                                                                              "upvotes": 1,
                                                                                              "replies": {
                                                                                                "gullajf": {
                                                                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gullajf/",
                                                                                                  "text": "That's not a flipped classroom then, it's a standard lecture course.\n\nFlipped classrooms have you do most of the coursework during the class and then watch lectures in your own time. You do the quizzes in class. You do practice exams in class. You do clicker questions (**this is literally a quiz**) in class.",
                                                                                                  "author": "officially_anxious",
                                                                                                  "created": 1618491343,
                                                                                                  "upvotes": 2,
                                                                                                  "replies": {
                                                                                                    "gulleu1": {
                                                                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulleu1/",
                                                                                                      "text": "The active recall integration and turn/talk is what a flipped classroom usually means, or at least the way it's described by Freeman.",
                                                                                                      "author": "ItsReallyVega",
                                                                                                      "created": 1618491409,
                                                                                                      "upvotes": 0,
                                                                                                      "replies": {
                                                                                                        "gullmuv": {
                                                                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gullmuv/",
                                                                                                          "text": "No, it really isn't. That's what people commonly understand to be a regular lecture course. Freeman is way off-base on that one. I don't care how he or other experts in the field of pedagogy use the term, it only matters what the general understanding of actual lecturers is. Your average professor defines flipped classroom as *flipping the classroom structure 180deg*.\n\nWhat you've described is a stock-standard lecture course, not a flipped classroom. Nearly 100% of classes in Australia already run like that, it's not special, it's not new, it's not rare or uncommon. It's the standard.",
                                                                                                          "author": "officially_anxious",
                                                                                                          "created": 1618491535,
                                                                                                          "upvotes": 2,
                                                                                                          "replies": {
                                                                                                            "gullr2x": {
                                                                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gullr2x/",
                                                                                                              "text": "Sorry, look to my comment to my comment. Our learning was primarily outside of class, which is the dominant reason why it was called flipped.",
                                                                                                              "author": "ItsReallyVega",
                                                                                                              "created": 1618491602,
                                                                                                              "upvotes": 1,
                                                                                                              "replies": {
                                                                                                                "gulluwo": {
                                                                                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulluwo/",
                                                                                                                  "text": "???? That's how a normal class works!\n\nYou go to lecture and then you do the assignments, quizzes, readings, watch recordings, practice questions etc on your own time. How do you think normal classes work?\n\nTo \"flip\" the normal class structure you literally switch all of those around. The work you do at home becomes work done in class and the lectures are left to be done at home.",
                                                                                                                  "author": "officially_anxious",
                                                                                                                  "created": 1618491661,
                                                                                                                  "upvotes": 3,
                                                                                                                  "replies": {
                                                                                                                    "gulm5pp": {
                                                                                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulm5pp/",
                                                                                                                      "text": "No lol. We did the readings, we did the reading quiz, then we went to class while we did clickers, then we did practice questions. Lecture was not where our information came from, and it was only for review. By the time you got to class, you needed to know basically 80%+ of the material already to understand what was going on, and it was the expectation that you did. \n\nIt was essentially like flipped classroom but analog. Without lecture videos (replaced by reading the text), but small amounts of review to compensate. It does not fit perfectly on the scaffold of \"flipped\"",
                                                                                                                      "author": "ItsReallyVega",
                                                                                                                      "created": 1618491828,
                                                                                                                      "upvotes": 1,
                                                                                                                      "replies": {
                                                                                                                        "gulmj9x": {
                                                                                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulmj9x/",
                                                                                                                          "text": "And that's exactly what I'm saying is bad!\n\nYou're asking disabled students to perform in public and under timed conditions. Even if you don't know what they get right or wrong, *they know*. They feel the shame of not being able to get anything correct. They feel the shame of not being able to even *understand* the question under that pressure, let alone answer it. And it's not something we can study for. It's not about a lack of preparation, it is a physical ailment that makes the task impossible.\n\nAlso, standard lecture classes in the humanities typically have pre-lecture readings to do. Still not a flipped classroom.",
                                                                                                                          "author": "officially_anxious",
                                                                                                                          "created": 1618492031,
                                                                                                                          "upvotes": 2,
                                                                                                                          "replies": {}
                                                                                                                        }
                                                                                                                      }
                                                                                                                    }
                                                                                                                  }
                                                                                                                }
                                                                                                              }
                                                                                                            }
                                                                                                          }
                                                                                                        },
                                                                                                        "gullnbb": {
                                                                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gullnbb/",
                                                                                                          "text": "Also, as I mentioned, most of our work was frontloaded. When we got to class we knew the material already from readings, it was a review seminar with clicker questions basically.",
                                                                                                          "author": "ItsReallyVega",
                                                                                                          "created": 1618491542,
                                                                                                          "upvotes": 1,
                                                                                                          "replies": {
                                                                                                            "gulm788": {
                                                                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulm788/",
                                                                                                              "text": "Clicker questions are quizzes. Even if you make them worth nothing, even if you do them in teams, even if it's optional, you're shaming and embarrassing disabled students who can't show their knowledge in that setting and that's cruel.",
                                                                                                              "author": "officially_anxious",
                                                                                                              "created": 1618491851,
                                                                                                              "upvotes": 2,
                                                                                                              "replies": {
                                                                                                                "gulmxwq": {
                                                                                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulmxwq/",
                                                                                                                  "text": "I really did not know anyone with that experience, even with disabilities. I don't really know what to do with that. Examinations are much more biased, this way at least people can learn from their peers and be forced to collaborate and make study groups. If the argument is that all of academia is biased against those with disabilities, I absolutely agree. If the argument is that this model is worse for disabled students, I strongly disagree. I don't know that clicker questions are a source of shame for anyone. I'm not certain of the requirements for those with disabilities, but I'm aware that these clickers could be done at home (usually for partial credit, but I see no reason that they could not be provided to disabled students at home for full credit). We had a few assignments given to us that way. These are flexible circumstances, I don't think the fact that I don't have immediate answers for you is any cause for alarm, I'm not the pioneer of this model, just a product of it.",
                                                                                                                  "author": "ItsReallyVega",
                                                                                                                  "created": 1618492253,
                                                                                                                  "upvotes": 1,
                                                                                                                  "replies": {
                                                                                                                    "gulnh7a": {
                                                                                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulnh7a/",
                                                                                                                      "text": "Dude, I'm literally right here, a disabled student who has experienced flipped classrooms. They're discriminatory. Clickers are shit and were a huge source of shame. Being exempted from those things was a source of shame too because then I was being outed to my class.\n\nDon't try to invalidate my experiences or talk on behalf of people with disabilities when you don't have experience of it. All you know is what you have **assumed** about your disabled peers, and yet you don't even know who those people were because we often try to keep it a secret. And you can't complain about disability-related issues to your peers when the disability is a secret to those peers.\n\nI'm also a product of the model and it did irreparable harm.",
                                                                                                                      "author": "officially_anxious",
                                                                                                                      "created": 1618492540,
                                                                                                                      "upvotes": 2,
                                                                                                                      "replies": {
                                                                                                                        "gulof0d": {
                                                                                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulof0d/",
                                                                                                                          "text": "Jesus dude. I get that you don't like flipped classrooms, but I really think this is something else you haven't been exposed to. I can't fix your experiences retroactively or make them better, what I'm telling you is that this model is flexible and helps people to succeed. This is a very dramatic response to the exploration of ideas for DEI, ideas that are working to promote student success. This model exists because teachers want to help students, for that reason, disability barriers are a welcome challenge to it. In pursuit of equity, this is the best we got right now, and it will be iterated to help as many people as possible. I think it's a difficult decision to make to sacrifice the success of low SES students, women, first generation, and minority students, just so that all vulnerable populations can be screwed in the same way. What we have now is a step-forward with many steps to go. At very least, this addresses many disparities in stem, which is a laudable goal",
                                                                                                                          "author": "ItsReallyVega",
                                                                                                                          "created": 1618493029,
                                                                                                                          "upvotes": 1,
                                                                                                                          "replies": {}
                                                                                                                        }
                                                                                                                      }
                                                                                                                    },
                                                                                                                    "guvmrf9": {
                                                                                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guvmrf9/",
                                                                                                                      "text": "As someone who works in higher ed disability accommodations - clicker quizzes are very much basically discrimination against those with disabilities. It doesn't give extended time to those that qualify for it. It doesn't allow for students with physical limitations to even use the devices. If you have to give an alternative exam completely to those students it's basically a violation of their civil rights. Universal design rejects this method.",
                                                                                                                      "author": "veanell",
                                                                                                                      "created": 1618681238,
                                                                                                                      "upvotes": 0,
                                                                                                                      "replies": {
                                                                                                                        "guw5047": {
                                                                                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guw5047/",
                                                                                                                          "text": "As someone with a disability, I didn't need extra time. I don't like the perception that people with disabilities are completely incapable of taking literally a few clicker questions without falling apart. If you can use a computer, you can use clickers. If you can't use a computer, I don't know how reasonable it is to expect to succeed in college. Like I said, if the argument is that the whole system is against disabled students, then yeah. Do you think time and a half magically fixes anything? You know it doesn't. Learning better is the best thing you can do for people. Becoming more competent is an empowering force that increases confidence and ability, even if it's a \"time crunch\" of only having 5 or so minutes to answer one of 400 questions in a quarter (1/8th of a point). If your disability is so severe that bombing a few clicker questions will crush you, then the whole examination structure of academia will destroy you. Clickers provide immediate feedback and a mechanism by which competence can be measured and confidence can be established. If you fail, well, it looks like you need to study. If you fail, and you have a learning disability, now you know exactly how hard you need to work to keep up with your class. You can bomb now or on the exam. If you bomb the exam, you only need a few of those to completely end your days as an academic.",
                                                                                                                          "author": "ItsReallyVega",
                                                                                                                          "created": 1618689235,
                                                                                                                          "upvotes": 0,
                                                                                                                          "replies": {
                                                                                                                            "guw6vum": {
                                                                                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guw6vum/",
                                                                                                                              "text": "Basically, I think teachers should do what's best for us. I don't care if you hate it, or it makes you uncomfortable. I didn't like it at first, but now I love it. I love that I feel like an expert on my material, and that I was offered the opportunity to grow. It is leagues ahead of the lecture/exam model, because that model sets people up to fail. Becoming a learner, using my own active strategies, and bringing that experience into the rest of my academic career, I'm doing better than I ever thought I could. We're not dainty people, I find that so frustrating to even hear.",
                                                                                                                              "author": "ItsReallyVega",
                                                                                                                              "created": 1618689866,
                                                                                                                              "upvotes": 1,
                                                                                                                              "replies": {
                                                                                                                                "guyz8en": {
                                                                                                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guyz8en/",
                                                                                                                                  "text": "I never thought you were. Accommodations are not because you are special. They are there to even the playing ground. If you don't need them good for you. You are not everyone.",
                                                                                                                                  "author": "veanell",
                                                                                                                                  "created": 1618755988,
                                                                                                                                  "upvotes": 1,
                                                                                                                                  "replies": {}
                                                                                                                                }
                                                                                                                              }
                                                                                                                            },
                                                                                                                            "guyz03z": {
                                                                                                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guyz03z/",
                                                                                                                              "text": "I think you are subscribing to the idea that you understand all disabilities. I have seen people that have to use devices to type with their mouths or or voice activated because they cannot use their hands. This doesn't make them less capable, but it does make clicker quizzes basically impossible. \n\nI have seen individuals with dyslexia take clicker quizzes without extended time and fail just because they couldn't process the question in time.\n\nIndividuals with visual impairment and hearing impairment are also hugely impacted. If visually impaired they have to wait for the professor to verbalize the question and answers which is automatically going to give them less time than anyone else in class. For hearing impaired students in a music class I had to deal with, they had to wait for it to be translated by their ASL interpreter.\n\nThis isn't about studying and not trying hard enough. Yes, there are individual accommodations that can happen to help these stduents... they all basically amount to extra time. I fail to see how clickers help with anything other than attendance.\n\nUniversal Design means designing a course in which the above scenarios are taken into account at the beginning. That means no clickers in my book. They are at this point old technology and expensive for students. I think we can do better.",
                                                                                                                              "author": "veanell",
                                                                                                                              "created": 1618755869,
                                                                                                                              "upvotes": 1,
                                                                                                                              "replies": {}
                                                                                                                            }
                                                                                                                          }
                                                                                                                        }
                                                                                                                      }
                                                                                                                    }
                                                                                                                  }
                                                                                                                }
                                                                                                              }
                                                                                                            }
                                                                                                          }
                                                                                                        }
                                                                                                      }
                                                                                                    }
                                                                                                  }
                                                                                                }
                                                                                              }
                                                                                            }
                                                                                          }
                                                                                        }
                                                                                      }
                                                                                    }
                                                                                  }
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    },
                                                    "gulsfto": {
                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulsfto/",
                                                      "text": "Idk every student I've had in a flipped classroom has absolutely loved it bc they didn't have as much homework to do outside of class. But maybe that's because basically every class at my uni is flipped and not traditional so we're used to it.",
                                                      "author": "gpgc_kitkat",
                                                      "created": 1618495038,
                                                      "upvotes": 2,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                },
                                "gukrgrt": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukrgrt/",
                                  "text": "Those methods cost a tremendous amount of time. It really depends on the size of the class and the number of TAs that one has assigned for a given course. \n\nMost professors, myself included, don't have the bandwidth to commit more than 20 hours a week to our teaching. Hell, I'm lucky if I can manage that. We have other priorities that are much more critical to whether or not we remain employed or promoted.",
                                  "author": "TheProfessorsCat",
                                  "created": 1618465692,
                                  "upvotes": -11,
                                  "replies": {
                                    "guksiu1": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guksiu1/",
                                      "text": "The biggest issue I have with this, is that your gunning for a promotion kills young talent at the door. Poor kids and minorities are disproportionately harmed by not being provided resources. These are kids who are working harder than their peers, face obstacles they've never had to, and are getting nothing for it. Because a one-time compilation of resources is gonna end your career. I don't honestly know why you teach at all.",
                                      "author": "ItsReallyVega",
                                      "created": 1618466572,
                                      "upvotes": 18,
                                      "replies": {
                                        "guktbsr": {
                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guktbsr/",
                                          "text": "I teach because it's part of the job but, admittedly, research is my passion. Most of us don't get into it for teaching, you know. The idea of the university is that students have the opportunity to work with and learn from world-class researchers who are experts in their respective fields. \n\nI enjoy working with students, bringing them into the lab and helping them become successful scientists. I do not enjoy requests for tutoring in organic chemistry. \n\nIf you can't pass organic chemistry you either aren't \"young talent\" or need to spend a couple years at community college. \n\nMost universities have tons of programs designed to provide tutoring and foster communities for disadvantaged students, which I encourage students to take full advantage of. Faculty are already overworked; we can't be responsible for correcting a life-time of deprivation, just as we aren't mental health counsellors. \n\nStudents such as yourself have wildly inappropriate ideas of what faculty do and what we should do. We are not your counsellor, your Mom, your tutor, etc. The university is designed to provide those resources and students need to proactively seek them out.",
                                          "author": "TheProfessorsCat",
                                          "created": 1618467245,
                                          "upvotes": -17,
                                          "replies": {
                                            "guku06v": {
                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guku06v/",
                                              "text": "Your exact structure is what hurts students. Kids who work to pay the bills will not show up to office hours. Kids who work are predominantly poor and/or minority students without established wealth to put themselves through college. This is the precise reasoning that STEM is white. \n\nNo one is asking for you to their mom, or their counselor, or their tutor. They're just hoping you'll do right by them, and right now you're not. I'm familiar with tutoring resources for underprivileged kids, but they just don't cut it. You can know everything on an exam, and get steamrolled by cryptic language and non-standardized language. There is no replacement for practice exam or study questions. Like I said, I don't care how hard you're working, it takes a 40 minutes MAX to construct a practice exam. Volume doesn't matter. There are not any excuses good enough that make it acceptable to withhold resources from students. You're a scientist first and foremost, so do what the data tells you to do.",
                                              "author": "ItsReallyVega",
                                              "created": 1618467830,
                                              "upvotes": 13,
                                              "replies": {
                                                "gukuvo5": {
                                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukuvo5/",
                                                  "text": "Cryptic language and non-standardized language? What on earth are you on about? You mean terminology -- as in knowing the discipline specific words for things? Yeah, that matters. \n\nPart of evaluation is determining whether students can creatively apply knowledge to new problem sets. I can tell that what you want are practice tests that provide similar or identical problems to the exam. I imagine that if the exam didn't match the practice, you would likely be one to complain.  \n\nThe textbooks I use are full of practice problems for students, but I don't reproduce the test for them as rehearsal. Part of the evaluation is the ability to think critically and apply knowledge to new problems.\n\nAnd that is current with trends in scientific pedagogy, by the way, so you don't need to tell me to follow the data.",
                                                  "author": "TheProfessorsCat",
                                                  "created": 1618468597,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "gukvk2o": {
                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukvk2o/",
                                                      "text": "I'm aware there's a difference between necessary jargon and non-standard language. Biased language in examination is what I'm talking about, and I'm sure you're aware of it.\n\nPractice problems in books are great, what's even better is study questions and practice exams. The trends in pedagogy are that study questions and practice exams are effective ways of reducing class divide and will raise the capability of all students. Rehearsal from practice exams is excellent, every med school uses NBME test banks. Every LSAT, MCAT, PMAT, DAT test taker takes a practice exam. Everyone one of them likely scores higher for having done so. Practice exams do not reduce their ability to think critically, but raised their base level of capability. This is the zone of proximal development. Frankly, we are not using more effective techniques in undergraduate courses for synthesis, than we are in our graduate programs. The way you think is dated, it is the idea that learning should be painful, but this is simply not the case. Being pro-student is not anti-learning, you're just giving students the resources to help themselves.",
                                                      "author": "ItsReallyVega",
                                                      "created": 1618469208,
                                                      "upvotes": 8,
                                                      "replies": {}
                                                    },
                                                    "gukwlkz": {
                                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukwlkz/",
                                                      "text": "[deleted]",
                                                      "author": null,
                                                      "created": 1618470159,
                                                      "upvotes": 9,
                                                      "replies": {
                                                        "gukxcmb": {
                                                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukxcmb/",
                                                          "text": "1.) That's not how funding works. Because of indirect costs, the university actually makes money by having me employed. In other words, I bring in more money than I cost from both public and private granting agencies.\n\n2.) For a lot of reasons that I'm not going to get into here, the free market is not  motivated to fund a lot of excellent research, even if it's in the public interest.",
                                                          "author": "TheProfessorsCat",
                                                          "created": 1618470848,
                                                          "upvotes": 2,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            },
                                            "gumkp25": {
                                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumkp25/",
                                              "text": "You are an insanely patronizing individual.",
                                              "author": "HailToTheMeta",
                                              "created": 1618507490,
                                              "upvotes": 0,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "gukrvoh": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukrvoh/",
                                      "text": "If UW as a premier R1 university can do this, there's no reason not to. Practice exams and study questions are a one-time investment (maybe with a few yearly revisions) you can get by recycling old exams and providing a key. It has nothing to do with the volume of students.\n\nAnswering student questions? Sure, office hours are fine, better yet, record them since it's COVID and post them for the students who missed it because they have to work. Now you don't have to answer redundant questions. For everything else, answer questions yourself or turf it to the TA.",
                                      "author": "ItsReallyVega",
                                      "created": 1618466033,
                                      "upvotes": 7,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "guvm8ku": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guvm8ku/",
                      "text": "Except they won't be... I would bet money on the professor not being held accountable.",
                      "author": "veanell",
                      "created": 1618681004,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gukptyj": {
                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukptyj/",
                      "text": "I guess it sounds stupid to me because it's not really actionable. There are no requirements for faculty to answer e-mails. If anything, the only thing the professor will be told is not to set unrealistic communication standards in the syllabus, and to advise students to come to office hours instead of e-mailing. \n\nWe get so many e-mails that no one can really keep up. My syllabi say \"I will try to respond to your e-mails within a week, but students are advised to attend office hours if they have questions or concerns.\"\n\nEdit: You're a grad student? How do you not already know this?",
                      "author": "TheProfessorsCat",
                      "created": 1618464393,
                      "upvotes": -13,
                      "replies": {
                        "guku36s": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guku36s/",
                          "text": "Sweet fuck I hope I never get a class with you. 🤢",
                          "author": "DemonicSippyCup",
                          "created": 1618467903,
                          "upvotes": 27,
                          "replies": {
                            "gukvgwq": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukvgwq/",
                              "text": "I'm fine being the bad guy if it shows students what the responsibilities of faculty actually are.  The irony is that I'm one of the \"nice\" faculty in my department, but the entitlement here is pretty thick and I think students need to be told how things work.",
                              "author": "TheProfessorsCat",
                              "created": 1618469129,
                              "upvotes": -8,
                              "replies": {
                                "gukzgn0": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukzgn0/",
                                  "text": "In 5 years as a student at a UK university I think the longest it ever took one of my professors to respond to an email during term time was 3 days. Most were within 24 hours - even if that was just to say that they would get back to me asap and to remind them if they didn't within X time frame.\n\nAlso how do you expect online only student to attend office hours??? Or to attend if they have other classes then??? They'd email you to set an appointment, obviously.",
                                  "author": "confusingpatterns",
                                  "created": 1618472872,
                                  "upvotes": 13,
                                  "replies": {
                                    "gul07t6": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gul07t6/",
                                      "text": "I have pre-set zoom office hours that are held at the same address/time each week for students to chat with me. If that time doesn't work for them they can e-mail to set up an appointment. Those kinds of e-mails are quick to deal with. The e-mails that are a drag are when students are \"concerned,\" asking complicated questions, or grade-grubbing. All of that is better done in person (on zoom).",
                                      "author": "TheProfessorsCat",
                                      "created": 1618473616,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                },
                                "gulck9q": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulck9q/",
                                  "text": "It’s sad to think that students wanting a properly formatted class is considered “entitlement” The students were tested on material that was not covered and the professor was inaccessible. I don’t see why students should get flack for being rightfully angry.",
                                  "author": "jujube0",
                                  "created": 1618485615,
                                  "upvotes": 11,
                                  "replies": {}
                                },
                                "gukyyx4": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukyyx4/",
                                  "text": "You’ve probably have a ton of emails like you’ve claim that you could’ve gone to and had the decency to respond to instead of spending the past 2 hours arguing with a bunch of college kids for absolutely no reason whatsoever as neither you nor them would change anything.",
                                  "author": "ElPerc",
                                  "created": 1618472387,
                                  "upvotes": 18,
                                  "replies": {
                                    "gukzapi": {
                                      "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gukzapi/",
                                      "text": "So, the funny thing about office hours is that often no one bothers to make use of them. It's not quite enough time to do any serious work so one ends up wiling away their time arguing with college kids on reddit...\n\nI'm actually on top of my e-mail right now (and pretty proud of it.) But I'm working at a lab out of country and only teaching a boutique class to grad students at the moment, so it's really a very light load.",
                                      "author": "TheProfessorsCat",
                                      "created": 1618472706,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "guluort": {
                              "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guluort/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1618496108,
                              "upvotes": -2,
                              "replies": {
                                "gumyha6": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumyha6/",
                                  "text": "Wanting study materials for a test unlocked for viewing is not \"having your hand held\".",
                                  "author": "herestoshuttingup",
                                  "created": 1618513507,
                                  "upvotes": 3,
                                  "replies": {}
                                },
                                "gum0xzy": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gum0xzy/",
                                  "text": "It's more that he clearly hates teaching and is still doing so. If you don't want to help people succeed, don't be in the position.",
                                  "author": "DemonicSippyCup",
                                  "created": 1618498934,
                                  "upvotes": 4,
                                  "replies": {}
                                },
                                "gum7caf": {
                                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gum7caf/",
                                  "text": "professors refusing to do their job is abusing my wallet and time",
                                  "author": "Plat_4_Beat_Faker",
                                  "created": 1618501716,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "guku76o": {
                          "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/guku76o/",
                          "text": "To be quite honest I think a lot of students have misconceptions about what professors do and what their role is as a student. My classmates complain all the time about professors.",
                          "author": "Snaxia",
                          "created": 1618467999,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gulrw74": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gulrw74/",
                  "text": "Because the entire class failed a test due to the teacher not opening modules and not reading emails about it.",
                  "author": "gpgc_kitkat",
                  "created": 1618494777,
                  "upvotes": 4,
                  "replies": {}
                },
                "gumx8qb": {
                  "link": "/r/college/comments/mr37rc/called_a_professors_bluff_about_him_not/gumx8qb/",
                  "text": "I am full aware of how networking works - but he is not a part of my major whatsoever and I refuse to be a part of a group of adults who are this shitty.",
                  "author": "NoSite3062",
                  "created": 1618512951,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634056694
}