{
  "sid": "qfu893",
  "link": "/r/college/comments/qfu893/should_i_drop_out/",
  "title:": "Should I drop out?",
  "text": "I’m at Uc Davis and this is my first quarter and I honestly didn’t do any research on the school or what it was about I just chose to come here because my parents would be proud that I got into a good school. I’m so confused about college In general and I’ve been taking different classes and nothing at this school Interests me. It’s also way to far and I commute so it’s a struggle to come here all the time and I don’t work yet due to citizenship issues so paying for gas will be an issue. I’ve looked at a college near me (literally a 5 minutes drive from where I live) and it has was Im looking for. I did research and i think it’s the right choice for me. Davis on the other hand doesn’t have what I’m looking for. Im looking to drop and go to community for 2 years and then transfer to the college I want to be at and finish my degree. Should I drop now and transfer to community college.",
  "author": "Academic-Associate52",
  "created": 1635207514,
  "updated": 1635302614,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "hi1z21s": {
      "link": "/r/college/comments/qfu893/should_i_drop_out/hi1z21s/",
      "text": "Dude don’t feel like you’re obligated to do what your parents would be proud of, do what works for you and figure out what you want. Be happy, don’t sacrifice your experience for what you think they’d be proud of.",
      "author": "RedTourms",
      "created": 1635207928,
      "upvotes": 7,
      "replies": {}
    },
    "hi2p5bm": {
      "link": "/r/college/comments/qfu893/should_i_drop_out/hi2p5bm/",
      "text": "You're still very early in your academic career, so I'd say do some damage control now before things get out of hand. Community colleges are often overlooked, but they're less expensive and sometimes can provide as good or even better education than a school in the UC group. Nothing wrong with going to a community college and then transferring.",
      "author": "kawaii_ninja",
      "created": 1635220655,
      "upvotes": 1,
      "replies": {
        "hi2wm3i": {
          "link": "/r/college/comments/qfu893/should_i_drop_out/hi2wm3i/",
          "text": "Thank you so much. Really needed some validation before going through with it you know. Lol. I think I’m making a good choice I just worry my parents will be upset but I have a feeling this is for the best.",
          "author": "Academic-Associate52",
          "created": 1635225501,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}