{"sid": "pvs157", "link": "/r/college/comments/pvs157/have_you_changed/", "title:": "Have you changed?", "text": "Have you changed are you the same since starting college? Question posed for Sophmores and up.", "author": "diarreahquestion", "created": 1632655599, "retrieved": 1632800234, "over_18": false, "upvotes": 21, "upvote_ratio": 0.97, "comments": {"hefqot0": {"link": "/r/college/comments/pvs157/have_you_changed/hefqot0/", "text": "Oh yes college has helped me tremendously in my growth journey! It helped me really solidify what I want in life and broaden my horizon. It also helped me build more confidence in acknowledging my strengths and that I shouldn’t be afraid of advancing educationally and career wise. I never had much confidence in my abilities to succeed in an higher education environment but looking at my GPA and my grades, I absolutely can! Plus English is my second language and German my first, so I am very proud of myself for doing all this in an language that is foreign to me. I moved to the US just about 7 years ago. I’m in my thirties and would have never thought that I would be going to college. In Germany we have vocational programs for specific careers so someone doesn’t really need to go to a university. Currently I am pursuing my BBA in HR management and after that I plan to attend law school. But we will see where life takes me.", "author": "lastqueen86", "created": 1632717411, "upvotes": 1}, "heeu12z": {"link": "/r/college/comments/pvs157/have_you_changed/heeu12z/", "text": "Yes. In many ways for the better. \n\nI can say for sure im a happier person, im able to get the mental help i need and actually not want to die (majority of the time, but getting better). Im more confident in myself and will stand up for myself more. I know my worth and its a lot more than i ever gave myself before. I know that while i have been dealt a shitty hand, i know i can pick and choose the cards to use to work towards a better one. I know it's not just me against everyone, that there are people that care about me and not just what i could do for them/give them. \n\nI know i have a temper and im working on that, but i also know that temper isnt always a bad thing. I know i have a lot of self harming tendencies (not physically, but others) and im working on those. \n\nI know a lot of things about me that freshman me didn't know, but she learned throughout the years. From that learning i have changed.", "author": "BMOEevee", "created": 1632700594, "upvotes": 1}, "heeiwwp": {"link": "/r/college/comments/pvs157/have_you_changed/heeiwwp/", "text": "Absolutely. I've learned a lot about how I learn and retain information and a lot of social skills and how to interact with people.", "author": "NinjaLorian", "created": 1632695278, "upvotes": 2}, "hedzu47": {"link": "/r/college/comments/pvs157/have_you_changed/hedzu47/", "text": "Yes. I have grown a lot and take school way more seriously. I put my education first over money and friends. I save more. I also way less naive about the world; experiencing a pandemic & the death of my coworkers have changed my perspective about life. I try not to take granted of the life I have.", "author": "denver_rose", "created": 1632687032, "upvotes": 1}, "hed8t9t": {"link": "/r/college/comments/pvs157/have_you_changed/hed8t9t/", "text": "I would sure hope everyone changes during college, because oh god anyone who’s as mature as a college freshman their entire life terrifies me lol.\n\nPersonally I think I’ve changed a lot, and for the better! Growing up I dealt with a fairly problematic home life (my parents tried to raise me and my siblings, but in a lot of ways they just sucked at it lol) and I felt like a complete outcast in school, which over time created some serious mental health issues that weren’t being treated because I didn’t have anyone I felt safe confiding to.\n\nSo I went into college my freshman year with virtually no friends or family I felt like I could rely on, and with severe anxiety to boot. Not the best way to kick things off, I’d say. But I knew I was only going to start college once, so I told myself that no matter what I was gonna force myself to talk to people and to talk to people as much as I physically could. \n\nI registered for my college’s marching band over the summer, which gave me ten or so days of me and a hundred-something other people dying in 95 degree heat from 9 am to 10 pm during band camp before classes started. The first couple days, I was barely talking to anyone. I didn’t quite click with the people in my section, and I didn’t get much of a chance to talk to others in the band because we were just so busy all the time. I started feeling the same sort of despair I had always felt. \n\nBut one night I was talking to one of the other freshmen, and he mentioned that a lot of the others had already exchanged numbers. Ordinarily I would think something along the lines of “well, fuck, everyone is already hitting it off, I guess I’m just not meant to have friends” and go off to have a breakdown in my room (or something to that effect, oof), but I knew this was my best chance to start talking to people outside of my section, so I asked him if he could add my number to the group chat they had going, and that’s how I started talking to the best friends I’ve ever had. Once I had that friend group, I started to build up enough confidence that my social awkwardness melted away (well enough of it at least, I’m not a social butterfly by any means and I’m fine with that lol). \n\nThe mental health issues that had built up to that point absolutely did *not* go away on their own, but I felt comfortable enough to open up to my two closest friends about it, and I started a long and painful journey to work on my mental health. A lot of mistakes were made, and friendships were tested in ways that very many aren’t, but my friends were too important to me and I was too important to my friends not to keep working on myself, so I’m at a point now where my mental health is fairly good (but by no means perfect!) and I’m comfortable enough to spend time alone, with friends, or being outgoing with new people, whatever the circumstances call for in the moment. I even managed to rekindle a friendship from high school that I value immensely, and I feel somewhat closer to my dad and my brothers than before (although my mom is still being held back by mental health issues of her own, so a lot of work is still needed for that particular relationship).\n\nMy life has improved immensely since I started college two years ago. Now I just have to hope it keeps getting better after I graduate lol.", "author": "RoyalSloth", "created": 1632676316, "upvotes": 3}, "hed7v2s": {"link": "/r/college/comments/pvs157/have_you_changed/hed7v2s/", "text": "Yes,", "author": "Rickysmalls1010-", "created": 1632675930, "upvotes": 5}, "hed3y5m": {"link": "/r/college/comments/pvs157/have_you_changed/hed3y5m/", "text": "Well yeah, changing your mindset and broadening your understanding of the world is pretty much what college is supposed to be helping you do. Part of it is transitioning into adulthood, part of it's experiencing new things and people and cultures, part of it's figuring out who you really are away from home.", "author": "sashathebrit", "created": 1632674260, "upvotes": 6}, "hecepav": {"link": "/r/college/comments/pvs157/have_you_changed/hecepav/", "text": "I’m almost 30 so I’ve probably done all the changing I’m gonna do as a person. I will continue to be determined and do my best on everything I try. It’s different for the old farts that are students. Unless you have habits that you would like to change, you probably won’t change much during college. There are always things I could improve on. I’d like to be able to do math by the time this is all over 😂 but I don’t think im gonna change much as a person if any.", "author": "Coffeeislife1119", "created": 1632663154, "upvotes": 9}, "hec23b5": {"link": "/r/college/comments/pvs157/have_you_changed/hec23b5/", "text": "Whats your refference point? Changed since kindergarden or changed since entering college? I changed a lot, and if you are looking to improve yourself and be a structured person you will keep changing throughout college.", "author": "dedslooth", "created": 1632655737, "upvotes": 0}}}