{
  "sid": "qn8evt",
  "link": "/r/college/comments/qn8evt/why_do_i_feel_like_this/",
  "title:": "Why do I feel like this?",
  "text": " I am a 4th year (final year) male engineering student currently in my seventh semester.Covid-19 hit during the latter half of my 4th semester. Being from a third world country the lockdown lasted for like 9 months and college never fully re-opened. I go to college about 2800km (1740mi) away, in the same country and going there always involves a significant amount of planning as the tickets are expensive .So, since March 2020 I have been to college only once for a span of 1 month. I was in a student team prior to COVID and didn't have a social life. My day would involve 15-16 hours of project work and the rest studies, either at the library or in my room, where I would see my roommate absent many a times because he was out having fun. I thought to myself I would slog my ass off and when I complete my project I would get a social life. This didn't happen as I was forced to return back to home and spend almost 3 semesters at home. My parents are strict and won't let me go back unless it was absolutely necessary. Also, they won't let me get an apartment outside campus and they insist on me living inside campus hostel where everyone needs to be inside before 10 p.m. .My batchmates on the other hand are comfortably living outside campus and having fun. All my friends also are moving out, even if I go to campus i'll literally be alone with 0 friends.I wish I had made friends with outgoing people instead of the ones I have now who either eat or sleep or study all day. I understand that my father is financially constrained and even if he can afford that lodging outside campus, my conscience won't let him pay that much. I wish I had either that economic privilege or no conscience. I stopped checking social media because every time I scroll through it I see my classmates actually having fun and doing things with their life, growing as people, having new experiences. Whereas I sit on my computer all day watching lectures, getting fat (gained 20kgs ever since lockdown began) and jacking off to porn. Sometimes I feel it was a waste going so far to study and spending so much money on a college education when I could have had the same near my house. I haven't grown as a person still the same child I was two years back whereas others have grown so much. \"4 best years of your life\", all I can say is that if that is true I haven't achieved anything other than a slightly above average GPA and a few extra curricular accolades. My friends are getting placed in companies, some have started earning money already whereas I decided to do masters and right now am in the process of applying for colleges.My friends are getting into relationships third or fourth for some and don't even have the balls to tell the person I like that I like her. Does anyone of you also feel worthless and that you are the same person you were 4 years ago ,just with some added depression.",
  "author": "FaceSharp7316",
  "created": 1636109123,
  "updated": 1636136975,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {}
}