{"sid": "pvkjcg", "link": "/r/college/comments/pvkjcg/is_my_education_worth_sacrificing_my_mental_health/", "title:": "Is my education worth sacrificing my mental health?", "text": "I am currently enrolled at a highly ranked university, but I am beyond unhappy. I have gone out, socialized with so many people from around the school, always tried to do something new, yet I still feel so unhappy and actually depressed at my school. I want to transfer to another school because I had visited there before and I know I would be genuinely happy there, but it is not known to be a good school per say. My mom says I can’t transfer because I’d be going to a worse school and it’s like she isn’t thinking about my actual happiness whatsoever. I am so lost in what to do I’ve started filling out my transfer application already without telling her because I just don’t believe it’s worth being THIS miserable at a school I pay so much for, when I can be genuinely happy and still study hard at another (although worse) school.", "author": "thomasisfat779", "created": 1632621791, "retrieved": 1632800270, "over_18": false, "upvotes": 9, "upvote_ratio": 0.85, "comments": {"heaq5xx": {"link": "/r/college/comments/pvkjcg/is_my_education_worth_sacrificing_my_mental_health/heaq5xx/", "text": "No, it’s not worth it. I had to transfer from a highly ranked school to a local state university for my physical health, and let me tell you: the whole “better and worse” school narrative is mostly BS. It’s all about what you make it, and it’s great if you can save money in the process.\n\nThe only advantage the highly ranked school had was a prestigious name and more academically rigorous classes. However, the education at the state school is pretty good too, and I have a lot more time and opportunities because I am not doing class work 24/7. I’m able to swim, work in jobs related to my field, relax, take care of my mental health, make connections, and do research. In fact, I think my resume from this school will look more impressive than the prestigious school because I have more hands-on experience. The best part is that I’m paying $8000 a year instead of $70,000 a year.", "author": "Snoo-68096", "created": 1632623368, "upvotes": 7}, "heapoi6": {"link": "/r/college/comments/pvkjcg/is_my_education_worth_sacrificing_my_mental_health/heapoi6/", "text": "100%\nMental health is more important than education", "author": "Many-Committee5176", "created": 1632623134, "upvotes": 3}}}