{"sid": "dtelro", "link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/", "title:": "How do you not let your grades affect your confidence/self-worth?", "text": "Okay, so i've been feeling really down lately. Feeling more useless than usual and my confidence is going downhill. I was never like this before. I used to be very opinionated and is not afraid to speak up. But lately, i can't even have myself suggest things even in group works where i usually lead most of the time. I can't even study in libraries. Because i dont want to look dumb to people while im trying to watch tutorial vids in youtube.\n\nEdit: I didn't expect this too blow up at all. I've read all your comments and i'm really thankful for everybody who replied. It will take some time, but i will try to practice the mindset that most of you have suggested. Thanks guys!", "author": null, "created": 1573215276, "retrieved": 1632947841, "over_18": false, "upvotes": 756, "upvote_ratio": 0.98, "comments": {"f7jwpts": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f7jwpts/", "text": "Good grades will help you with 2 things. Landing your first job out of college and graduate school. If you're not interested in graduate school, doesn't matter. It will limit the number of jobs available to you, but if you're smart about your job search you'll find your way around that. Focus your job hunt on companies where you know someone that works there. Makes a big difference. Once you have some job experience your GPA becomes irrelevant. Do great at your first job and the rest of your career will go just fine.\n\nI graduated with a 2.9 in Computer Engineering. I'm 6 years out of college and now make 155k a year plus benefits. No one has asked for it since my first job after college (I've had 5).\n\nMy only regret is that if I wanted to go back and do law school my GPA will affect what kind of school I can get into.", "author": "bladernr1", "created": 1573788458, "upvotes": 1}, "f6z2pj3": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6z2pj3/", "text": "I've gone through that. Frankly, don't let those grades keep your confidence down. Just do your best . Whenever you feel like not studying ,study forcefully at that time. By forcefully I mean just open up your books or notes and start reading and writing. Even if you get bad grades (highly unlikely after this), just remember u gave ur best effort. Keep your confidence up and try again. There's no test in the world which u can't crack if ur persistent enough . Have a great day!", "author": "zearoawp", "created": 1573307327, "upvotes": 1}, "f6yaxyo": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6yaxyo/", "text": "Your grades are a direct reflection of your personal abilities. Maybe school just isn't for you, go get a job at McDanks and work your way up to manager, if your personal abilities qualify of course! /s", "author": "enclavedzn", "created": 1573273160, "upvotes": 1}, "f6y9o52": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6y9o52/", "text": "Well just always get good grades and let your confidence skyrocket", "author": "noel4759", "created": 1573271980, "upvotes": 0}, "f6y8wst": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6y8wst/", "text": "It's about knowing yourself and what your strengths and weaknesses are. For me, I knew math was always going to be my weakest subject, but I told myself \" C is okay, but let's try to get that B!\". In other subjects I knew I could succeed I strive for A because I know I'm more than capable to do so", "author": "Jantzen123", "created": 1573271299, "upvotes": 1}, "f6y2zrg": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6y2zrg/", "text": "Having good grades does not mean that you are better, or smarter than others, A couple of straight A's doesn't mean anything to employers after school. There's nothing wrong with watching tutorial videos on youtube, people do it all the time. Honestly GPA doesn't really matter much after school, you can still go to grad school with a 3.0 gpa, or a 2.8 gpa. Excel in other things besides the classroom.", "author": "Carloverguy20", "created": 1573266116, "upvotes": 1}, "f6xyual": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xyual/", "text": "Dude, I legit failed my first college math class and I'm a math major. I was so down that I considered dropping out because I thought I was too dumb for college. I realized I was just overwhelmed and needed to chill and take on less of a load.   \nI began with not trying to keep up with the Joneses because I realized I wanted to take 6 classes like my friends but our majors were different difficulty levels.  Then, I got over the idea I was dumb and that I just needed to watch those pearson videos and Khan academy vids and I stopped gaf. \n\nI took the class the following semester and got an A and somehow my confidence went up with it and I've been doing well since then. I even tutor math now haha... so it was a complete 180. \n\nSo, keep your head up and adjust to what you can handle, never compare yourself, and don't worry about those around you. Plus, enjoy it all, sometimes I take a step back and I'm glad I enjoyed the process and everything I learned. I'm also a mentor now at school and I always share with newcomers the importance of pacing yourself and setting yourself up for success. Next semester is my last one and I have two easy A electives left with 2 difficult 4000 classes. It's good if you can ask seniors or alumni what the most difficult classes will be in order to save easy A classes to take with them.   \n\n\nGood Luck and remember...\n\n# \"Everybody is a Genius. But If You Judge a Fish by Its Ability to Climb a Tree, It Will Live Its Whole Life Believing that It is Stupid\"", "author": "Vickywog", "created": 1573262560, "upvotes": 1}, "f6xs34c": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xs34c/", "text": "There's many reasons people aren't ashamed of there grades have decent ones. \nDifferent teachers, different grading systems.\nSome people can't complete homework or projects but only have good grades because of how sMerT they are. Others can be vice versa. Like myself, one person has an advantage of one thing and they let themselves slack off on everything else. I know that I'm sMeRt, grades just show your work ethic.", "author": "jinksalexis", "created": 1573256942, "upvotes": 1}, "f6xs2do": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xs2do/", "text": "I've never thought about my grades much unless they drop below a B. What I care about is whether I am learning or not.  If your learning and trying your best and passing your classes then your succeding", "author": null, "created": 1573256926, "upvotes": 1}, "f6xqtmj": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xqtmj/", "text": "Ayyyy, fellow person here who feels the same way haha! We'll get through this :)", "author": "ReachandCrackTheSky", "created": 1573255968, "upvotes": 1}, "f6xo5bi": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xo5bi/", "text": "if i studied for the test and I scored bad then I feel bad however if I didn't study for it and got bad grades i don't care because it was expected.", "author": "Algok2001", "created": 1573253947, "upvotes": 1}, "f6xl25j": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xl25j/", "text": "Having been a TA at a top university, IMO\n\n1. Grades reflect how well you can perform on the tasks that you are getting graded on. No more, no less. They certainly don't reflect your ability and competence. Do not tie your grades to your self worth. The most important thing is to understand what you are being asked to do\n\n2. Once it is clear what the professor wants you to do to get a good grade, for most courses it's about putting the effort in. Go talk to the TAs, Professor, your peers if you don't understand something, but you need to put the effort in. You will start seeing the results soon 😊 all the best!", "author": "kesh_kala", "created": 1573251761, "upvotes": 2}, "f6xkxzq": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xkxzq/", "text": "Pro tip: don't check them", "author": "thestickersontheback", "created": 1573251695, "upvotes": 1}, "f6xkmim": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xkmim/", "text": "I already nearly flunked out of high school so my expectations are much lower", "author": "puffy-jacket", "created": 1573251505, "upvotes": 1}, "f6xjumy": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xjumy/", "text": "catch me watching how to do dimensional analysis and pre-algebra @ the library... in the second year of my sciences degree.\n\n^(fun fact: i don't know how to factor equations weeee)", "author": "EliosPeaches", "created": 1573251039, "upvotes": 1}, "f6xinl1": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xinl1/", "text": "Same here I feel inferior and stupid too", "author": null, "created": 1573250337, "upvotes": 1}, "f6xhzwy": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xhzwy/", "text": "Believe in something greater then yourself. I believe in chasity so believing in chasity humbles me. You are not your grades. You are you. Yes, you are you.", "author": "zxzlilqqzxz", "created": 1573249961, "upvotes": 1}, "f6xfxh1": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6xfxh1/", "text": "I always think of grades being 1 tool in your tool chest. If you have 1 weak tool and good everything else it is still a good toolchest", "author": "UnderageBaller", "created": 1573248776, "upvotes": 1}, "f6x8v0q": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6x8v0q/", "text": "Nobody becomes head engineer by being better at math than everyone else. No one becomes CEO because they did better in business foundations 101. Success in your career field depends on what you know, but also how you act. Grades become a small part of your person. Focus on improving your leadership ability and other personal attributes.", "author": "nbahungboi", "created": 1573244664, "upvotes": 1}, "f6x8tn1": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6x8tn1/", "text": "You are not alone my bro. What I do is I usually fail the first exam because I don’t really try(idk why).\n\nI use that D or F as motivation and as a goal to get the A next exam.\n\nNot suggesting this in anyway.\n\nMy point is to find a purpose within, and don’t worry too much about grades. Enjoy the ride baby", "author": "TellMetheCost", "created": 1573244639, "upvotes": 1}, "f6x6dhp": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6x6dhp/", "text": "get As", "author": null, "created": 1573242991, "upvotes": 3}, "f6x4cyd": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6x4cyd/", "text": "When I meet adults(30+ let's say), I meet a lot of successful people who did mediocre in school and a lot of unsuccessful people who constantly harp on what school they went to or how good they were at this or that. This is not to say that doing worse in school means doing better in life. The difference is some people look at school as everything, they treat their gpa like a it’s a direct correlation to their future salary. Successful people talk about school as a stepping stone and as just one way to educate yourself. Your whole like you should be growing and learning, not just your first 22 years. And having a great GPA is worth very little if your hope is to just stumble into something. Make a plan for life and make school a part of it, not all of it.", "author": "Wynn_lynch", "created": 1573241662, "upvotes": 1}, "f6x3cye": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6x3cye/", "text": "At the end of the day. Its a letter. Or a number. Or both. For me its both. I choose to see the bigger picture. At the end of the day. When you stand and look at it. It isnt the most prevalent thing. It never should be. You should care but never to the extent of emotional ruin. Don't let a letter or number control you. You're much stronger.", "author": "lilj2018812", "created": 1573241004, "upvotes": 1}, "f6x1wxn": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6x1wxn/", "text": "I don't \nMy self worth is zero \nCan u guess what my grades are?\nNot good", "author": "JazzlikeSpinach3", "created": 1573240066, "upvotes": 1}, "f6x03sv": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6x03sv/", "text": "Do you remember what you got as a final grade in sixth grade math ? I doubt it. In 10 years you won’t remember this either!", "author": "brianjc87", "created": 1573238866, "upvotes": 1}, "f6wyxzh": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wyxzh/", "text": "I was the same way.  I had a 4.0 in CC, then just shy of a 3.7 in a four year college and my GPA was my identity.  Now I'm finishing up college and talking to graduate advisers for graduate school.  I hear the same story from each one of them: \"GRE and GPAs don't mean anything to us.\"  All they look for is at least a 3.0 when it comes to grades.  At my internships, my grades didn't matter either.  What matters is your adaptability and knowledge of what you want to pursue after college.  I'd suggest branching out and enriching yourself with an internship or club activities where you can market yourself.  IMO this is where your value in your field of study shows.  And youtube tutorial videos are the way to go!", "author": "allthingsfish", "created": 1573238089, "upvotes": 2}, "f6wy1ed": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wy1ed/", "text": "Blame the professor ez W", "author": null, "created": 1573237484, "upvotes": 1}, "f6wurs9": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wurs9/", "text": "You have to realize that everyone has a different approach to learning. I learned this the hard way because I was to proud to ask for help when needed. There was one semester where I failed every single midterm and it made me feel worthless. The way I got out of that funk was by approaching my professors and asking for advice. Every single one of them helped me and made me realize I wasn't dumb just got into a bad situation. Keep your chin up and keep grinding.", "author": "jmarin18", "created": 1573235332, "upvotes": 1}, "f6wtjxb": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wtjxb/", "text": "Grades and even an entire class, is really only the presentation of ONE professor. One professor who may not be teaching worth a shit. My self worth doesn’t hinge on one person unless I’m drunk at a bar", "author": null, "created": 1573234532, "upvotes": 1}, "f6wtclk": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wtclk/", "text": "Ask yourself, \"Will it matter in five years? Ten?\" That's what my grandmother always says.", "author": "Fitz_Henry", "created": 1573234400, "upvotes": 1}, "f6ws6w8": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6ws6w8/", "text": "GPA matters, up to a point. For example, a comp sci student with a mediocre GPA can get an awesome job if they have lots of projects under their belt. A comp sci student with a stellar GPA, but no projects or any experience, would surprisingly have a hard time finding a job. \n\nThe end goal should be to prove to employers that you have the skills, and GPA is only one of the many indications of a candidate's ability.", "author": null, "created": 1573233653, "upvotes": 1}, "f6wptbg": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wptbg/", "text": "I know the feeling. I've already struggled with being all down, but now that my grades are dropping I feel like I am too. Sometimes you just have to keep pushing through it (at least that's what I do). Take some time to enjoy yourself. I know I don't do that often because I'm so caught up in my homework and school life. Don't let others get to you either because you are trying to better your future and if they are there they should have that in common. Try finding people to help support you too. I know this sounds silly but I have a friend that I met in college and they help push me in the right direction. Hang in there and you always have us to help you through this. At least I consider this group like that lol.", "author": "Mzspyte", "created": 1573232121, "upvotes": 1}, "f6wngso": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wngso/", "text": "Realize college is temporary and see that a lot of people get jobs on who they know instead of what they know", "author": "LaidLacefront", "created": 1573230607, "upvotes": 1}, "f6wms4d": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wms4d/", "text": "Grades are a reflection of how much time and effort you put into academics. That’s it.", "author": "Xiscis", "created": 1573230163, "upvotes": 1}, "f6wlzo8": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wlzo8/", "text": "Before an exam", "author": "ameenbusiness666", "created": 1573229655, "upvotes": 1}, "f6wlge3": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wlge3/", "text": "Grades are merely a reflection of your ability to remember and recite information. I suck at tests even if I fully understand the information on them. What really matters is that you put the effort in and that you make your college experience as fulfilling as possible. Don’t just laze around or skip class (not saying that you do) and then complain about grades. I feel good when I know I put effort into studying as least.", "author": "saveme-shinigami", "created": 1573229306, "upvotes": 1}, "f6wl9sh": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wl9sh/", "text": "Get better grades", "author": "TinyRevolution2", "created": 1573229183, "upvotes": -1}, "f6wkih7": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wkih7/", "text": "Your grades are on you, but you shouldn't interpret them as demoralizing and a reflection of your intelligence. If it's based on tests, think about it as room for improvement and try something you haven't yet to study. In terms of homework, just commit yourself as much as you can. I'd argue that college is all about your mindset.", "author": "TooMuchRspct4Women", "created": 1573228679, "upvotes": 2}, "f6wkhlo": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wkhlo/", "text": "This is what Ive been through last month. I was trying so hard yet I still failed a lot of exams. It affected my confidence a lot and I was constantly blaming my self. But then I realized that really, grades can't define you. Your effort and intelligence cannot be  measured by numbers. The mindset that helped me was thinking that I did my best, and no matter what the results, it's just a figure. Move on, and continue doing your best. If ever you feel down, just focus on yourself and remember that you did what you can at the fullest of your abilities.", "author": "jlcabs27", "created": 1573228663, "upvotes": 2}, "f6wjzo0": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wjzo0/", "text": "It's hard.  It's all about confidence.  This is why stupid people succeed.", "author": null, "created": 1573228340, "upvotes": 4}, "f6wjyhy": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wjyhy/", "text": "Understanding the fact that if you failed out right now you could still find a decent paying job working with your hands. College has never been the only answer. Society just wants you to believe that", "author": "KALI_YUNA", "created": 1573228319, "upvotes": 2}, "f6wjd2o": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wjd2o/", "text": "By being unhealthily perfectionistic and trying to get As on everything", "author": "ParanormalPurple", "created": 1573227934, "upvotes": 5}, "f6wis22": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wis22/", "text": "Depending on your major and employer, grades may not matter. Also, go to the library and watch the videos if you need to. Who cares if you look dumb. You paid tuition. You need to learn. Why should you not be able to do it? I went through 9 years of university schooling. Unless your blasting porn or really good movie, no one will really pay attention to you. They'll just ignore it as someone trying to study.", "author": "PasstheySoysauce", "created": 1573227552, "upvotes": 3}, "f6winbb": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6winbb/", "text": "Someone once told me that school is a measure of work ethic, not intelligence. That has stuck with me for a long time. Now, that may change as you get toward higher levels of education of course, but you seriously should not worry about looking stupid. School is a place for people to learn. You literally go into school with zero knowledge of some of the subjects your learning. Maybe the first time you've even been introduced to some subject or concept. Give yourself some credit, buckle down the hatches and grind. If you dont understand a concept, get a tutor or friend to explain it to you pedantically if need be. There is no shame in not understanding a concept, lord knows I'm not the brightest crayon in the box. That can be easily forgiven. It is a problem though, if your not willing to put in the work. That cannot be so easily forgiven. Good luck to you🙏", "author": "thothpethific92", "created": 1573227465, "upvotes": 10}, "f6whxrt": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6whxrt/", "text": "Lots of therapy", "author": "trunks111", "created": 1573226992, "upvotes": 0}, "f6wgqjn": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wgqjn/", "text": "I've been feeling the same way, this is going to be my worst semester grade wise. Calculus has been kicking me in the ass because I have a rather icky foundation in earlier maths- the worst feeling it studying so hard and then still getting a sub par grade lol.\n\nI go to a top uni too which I think makes it worse because I always feel like the people around me are doing so well and it makes me feel dumb as hell. I just wanted to let you know that you're not alone man. It's just important to remember that your grades really don't affect or represent who you are as a person, they're numbers that are important but everyone is going to have their strengths in weaknesses- what really matters is that you're trying and still willing to put in the effort to do your best even if the end results aren't as good as you had hoped.", "author": "Peanut_ButterPenguin", "created": 1573226173, "upvotes": 5}, "f6wfx7x": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wfx7x/", "text": "It's just college. You're in it for the degree, and spending God knows how much money to do so. It doesn't pay to worry about what other people are thinking. Just do the schoolwork, pass the classes, and graduate.", "author": "The_Southstrider", "created": 1573225606, "upvotes": 21}, "f6wdzb8": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wdzb8/", "text": "Lol me", "author": null, "created": 1573224241, "upvotes": 2}, "f6wd3ia": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wd3ia/", "text": "The chances that anyone in 10 years is going to care about your GPA are really slim. You aren't going to go around at 30 telling people, \"Hey, I had a 3.8 in college!\". Don't stress about it. Just keep putting in the effort and learn the stuff. The point is to get a degree and get a job, not everyone can have a 4.0, but honestly, it doesn't matter.", "author": "Dont_Blink__", "created": 1573223592, "upvotes": 4}, "f6wbbe4": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6wbbe4/", "text": "I'm a C(2.7gpa) average student, got an internship last summer based on my ability to code, not GPA. They paid me $30/hour that's more than my sister makes as a full time salaried employee. I now have 2 job offers for 80k+, not based on my GPA, but based on my ability to code during interviews.\n\nGrades are meaningless(imo), especially for someone like me with adhd and a learning disability. Yes, there are a lot of companies who've rejected me based on it, but there are so many other places that don't care, so why should it bother you?", "author": "GennaroIsGod", "created": 1573222241, "upvotes": 90}, "f6w9ptg": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6w9ptg/", "text": "Most freshman have this problem when they first go to college. They don’t realize the work load they’ll have compared to their easy life in HS. This is especially worse when you go to a top university, not because it might be harder, but rather you are only comparing yourself to high achieving people. \n\nJust know that you aren’t alone in your freshman struggle, and that things will get better. College is not only a place to get educated, but also a place to grow as a person. You will learn that things aren’t easy, and that you have to take care of everything yourself, even yourself. \n\n“Don’t compare yourself to the success of others, compare yourself to who you were yesterday” - Jordan Peterson \nEveryday try and grow as a person, no matter how little that maybe. Live your best life because you only got one.", "author": "Send_Help_Pls_", "created": 1573220948, "upvotes": 19}, "f6w97hu": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6w97hu/", "text": "The two are completely and utterly separate. My grades are not a reflection of who I am as a person or how I deserve to be treated. If I do well, that's great, but that doesn't make my self-worth higher. If I do poorly, I am no lesser as a person.\n\nConfidence and self-worth should come from a purely internal place, otherwise you'd never grow in the face of adversity. \n\nGrades are an ongoing process, not a final judgement on your intelligence. Depending on the test, it is more a measure of your test taking ability. Even A students fail sometimes.\n\nI consider myself a good student and study for tests and even I fail. It's just a sign that you aren't working efficiently, not unintelligently. Not sure if that helps, but that's my two cents.", "author": "nomnomr", "created": 1573220528, "upvotes": 39}, "f6w6y2v": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6w6y2v/", "text": "I believe everyone learns at their own pace. I found that when I was still majoring in maths everyone around me was able to grasp concepts quicker than I could so it was a little demotivating and I felt the same as you. So rather than focus on the grades, I focused on the learning. Sometimes I did need to watch a tutorial or yt video here and there but everytime I felt a spark where I slowly began to connect dots between the concepts presented I felt boosts in confidence and think hey that wasn't so bad. So my suggestion is to not worry to much about the grades, sure it's nice to get that A but in the end it's how much you yourself can take away and apply it. I mean, in the long run, the end game is to find a job right? If you try your best and look back and say hey, I went from not knowing to being able to understand it! You shouldn't underestimate yourself! You're doing great. Believe it.", "author": "Addicted2PixieDust", "created": 1573218519, "upvotes": 24}, "f6w4qj7": {"link": "/r/college/comments/dtelro/how_do_you_not_let_your_grades_affect_your/f6w4qj7/", "text": "Just remember that your grades are not a reflection of your personal abilities. There are many other factors that affect your grades, one major one being the prof -- professors don't all have the same expectations and, as a result, they grade differently. Some profs didn't intend to ever teach, they're employed for research and teaching is a requirement they have to do, so they might grade you differently than the prof who really wants to help you learn, grow, and develop your skills.\n\nYou are not the only factor when it comes to your grades. Yes, you choose your classes, and yes, you will have your own academic strengths and weaknesses, but the grade is not 100% on you. So when you remember that, it's easier to remain confident. Just don't let that keep you from continuing to work at it (don't start slacking just because you think the prof is grading you too harshly -- if you think the prof is grading you too harshly, speak to the prof and determine their expectations).", "author": "xPadawanRyan", "created": 1573216326, "upvotes": 249}}}