{
  "sid": "qmvljl",
  "link": "/r/college/comments/qmvljl/help_me_decide_my_major/",
  "title:": "Help me decide my major!",
  "text": "Warning: This is a long thread.\n\n&#x200B;\n\nHey, I’m a 19yo male who needs help deciding his major.\n\nFirst of all, you should know that last year I was at my first year of college studying CS and I hated it ( I’m not really the typical CS guy, I love going out, partying and doing sports, since I didn’t get along with my colleagues since they didn’t have the same hobbies/ interests as mine and I was mostly alone while being stuck at home during weekdays because of classes and weekends due to regulations, I ended up getting depressed and I didn’t have any joy in attending classes which resulted in me failing some and having no desire of continuing).\n\nFast forward to September this year I have to choose a new degree( still a bit depressed at this point but not as much), I opt for industrial engineering but I didn’t get in, which ended in me studying CS again but this time at a better qualified college( best in my country) and currently I am liking it but I’m not loving it like I think you should love your degree, it’s alright.\n\n&#x200B;\n\nNow I’ll tell you about my interests and possible majors/careers.\n\n&#x200B;\n\n1st option - Majoring In CS \n\nNegative -\n\nprobably not enjoying college that much and probably the job too, I don’t really like the ideia of staying behind a screen in pjs all day every day. \n\nPositive - Having a salary that will qualify me as ‘rich’ in my country’s standards in a few years, living a wealthier lifestyle than my acquaintances, have a flexible work schedule and having the possibility of working abroad (e.g. the US).\n\nP.S this was my first choice mostly due to the salary and due to always being influenced to be a engineer even though I have never had that love to build things and etc.\n\n&#x200B;\n\n2nd Option - Double Minor In Business and Law \n\nNegative - This degree is only available at a private school which will make tuition 7x more expensive, never been a fan of reading and interpreting text in high school which could make law very hard and this would be my third time entering college, so will only finish it when I’m 25.\n\nPositive - Even though I never had the entrepreneurial mind set of creating products like most business major attendees, I always enjoyed finding optimal ways to make things faster, cheaper, better, etc ( hence why I had chosen industrial engineering) and marketing, dealing with problems that come with running a business, basically everything about running a business except creating the product and law because I love people and mostly helping people, if it was for me I would be friends with everyone and I always saw lawyer as a good and respected job where people always dress very classy which is something I would like to do latter in life( I know you don’t need to be a lawyer to dress classy, but you don’t see mechanics pulling up in suits because it just isn’t appropriate).\n\n&#x200B;\n\n3rd and Last - Pilot\n\nNegatives - Going to the air force and living in a military base away from home and friends for a minimum of 10 years OR paying a lot more money than I can afford to go to private flight school. ( 5 years of college here is about 5 minimum wages in public college whilst 2 years of this private college is about 100 minimum wages) and again wasting 2 years of my life. Not having a schedule and not spending time with family and friends. Salary could be very low or very high, it all depends which job I land and job availability is not really a certitude.\n\nPositives - This was my childhood dream, I don’t really miss people as cold hearted as this could sound it’s the truth, and I always thought about traveling the world and learning about different languages and cultures. \n\nI know no one will decide for me but give your take on the subject.\n\nP.S a friend of mine suggested doing CS and then getting a pilot course with the money I’ve earned which is not a bad ideia but will be done at around 30yo\n\nI live in Portugal, Europe if it somehow helps.",
  "author": "Altruistic_Lock_9686",
  "created": 1636062572,
  "updated": 1636137342,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjcqpnr": {
      "link": "/r/college/comments/qmvljl/help_me_decide_my_major/hjcqpnr/",
      "text": "I would say if you're liking CS more than before right now, it would be good if you could push through and get that degree. Like you said, it gives you a good career outlook and could potentially allow you to pursue other interests later on. Don't think about what age you'll be when you finish. Would you rather be 30 and be a pilot with a CS degree, or be 30 and *not* be a pilot with a CS degree?",
      "author": "NoDryHands",
      "created": 1636071310,
      "upvotes": 1,
      "replies": {}
    }
  }
}