{
  "sid": "qvwepm",
  "link": "/r/college/comments/qvwepm/how_do_i_convince_my_prof_to_change_my_grade_from/",
  "title:": "how do i convince my prof to change my grade from his class i ended up not going to?",
  "text": "so i took his class in spring 2021, but the class structure was so confusing, so i ended up dropping that class. unfortunately, my request did not go through for some reason, hence, now i have an FW on his class for “not showing up” and doing the work (this class was pure online and no zoom meetings nor office hours). i emailed him about it and he said, “well only if you attended class” ?? i stopped attending that class two weeks prior the deadline of dropping class with a “w”. i’m panicking about this bc how will this affect my transcript? i go to a community college in california and i plan to transfer to either uc or csu (or even that one private school i’m eyeing at). i need help. any advices are welcome. thanks!!",
  "author": "No-Ambassador238",
  "created": 1637144982,
  "updated": 1637181235,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hkzbp2r": {
      "link": "/r/college/comments/qvwepm/how_do_i_convince_my_prof_to_change_my_grade_from/hkzbp2r/",
      "text": "Sometimes the most painful lessons are the ones we learn from the most meaningfully.  \n\nDropping or Withdrawing from a class is a big deal. At $300/credit or so, that is a $1-2,000 decision.  \n\nThis experience will probably help you follow-up and check to confirm such activities complete successfully in the future.  \n\nFrom the professor's perspective, you didn't withdraw from the course.  \n\nI'd engage whoever you worked with to drop the class and see if they have any records or evidence of the action and see if it can be fixed from their end, or if evidence can be provided to the professor to help convince them to make the change.",
      "author": "VA_Network_Nerd",
      "created": 1637152788,
      "upvotes": 3,
      "replies": {
        "hkzc8f5": {
          "link": "/r/college/comments/qvwepm/how_do_i_convince_my_prof_to_change_my_grade_from/hkzc8f5/",
          "text": "I see. In our school, they actually allow students who took classes from Spring 2020-Spring 2021 to make changes in their grades. From F or NP, and FW to W, because of Covid (I’m wildly guessing bc of the pandemic, some students don’t have the same equal privileges regarding academics: e.g., laptop, etc.) but yeah. I’ll try to contact counseling dept again. The last time I set up an appointment they just told me to fill up the form but never said where to send nor what to do.",
          "author": "No-Ambassador238",
          "created": 1637153101,
          "upvotes": 1,
          "replies": {
            "hkzdxbz": {
              "link": "/r/college/comments/qvwepm/how_do_i_convince_my_prof_to_change_my_grade_from/hkzdxbz/",
              "text": "the lesson here is to follow up and follow up again until you have 100% confirmation. \n\nyou’ll likely need to take the class again to show that you worked to replace the W, but check if you’d transfer school accepts duplicates first.",
              "author": "feedmechickentendies",
              "created": 1637154069,
              "upvotes": 3,
              "replies": {
                "hkze2ja": {
                  "link": "/r/college/comments/qvwepm/how_do_i_convince_my_prof_to_change_my_grade_from/hkze2ja/",
                  "text": "That’s a great advice. Thank you so much!\n\nIdk if I’ll be willing to retake the class as I switched majors lol. But I’ll try to see what I can do!",
                  "author": "No-Ambassador238",
                  "created": 1637154151,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}