{"sid": "l6bbrp", "link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/", "title:": "Unless it’s in your major or required, don’t deal with bad professors", "text": "I made the mistake of taking a class with a really rude professor. Not going to get into details, but they were very rude on the first day, and I did not like the class environment at all. I should’ve checked the rate my prof website. \n\nI realized I’m doing online learning in the middle of the pandemic, why am I going to take an elective class with a bad teacher? I dropped the class, I’ll just take a different class next semester. Don’t be afraid to do this, this is your education. Get the most out of it, take classes that will benefit you.", "author": null, "created": 1611772544, "retrieved": 1632947187, "over_18": false, "upvotes": 1515, "upvote_ratio": 0.98, "comments": {"gl4keh3": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl4keh3/", "text": "Yesss this is so true! I've had lots of friends who go to awesome universities but they deal with some of the worst professors. I don't understand why they would pay so much for this one class just for the professor to be so bad. I wouldn't put up with a class like that even though I go to a community college and pay a quarter of what they do. Sometimes you do need to suck it up when that professor is the only option but overall it is your money and your education. I also had a psych professor who was rated badly on rate my professor but I had none of the problems with her that were stated on the website. Sometimes I feel like you have to take rmp with a grain of salt but if you have a professor you can't stand, sometimes it best to leave and just accept that the class wasn't a good fit for you.", "author": "plaiddiebaddies", "created": 1611858422, "upvotes": 2}, "gl4a81g": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl4a81g/", "text": "Agree!", "author": "Firebro999", "created": 1611854286, "upvotes": 1}, "gl44uaq": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl44uaq/", "text": " \n\n!RemindMe 2 years", "author": "ambitiousvanilla_", "created": 1611852605, "upvotes": 1}, "gl44rdw": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl44rdw/", "text": "!RemindMe 1 year", "author": "ambitiousvanilla_", "created": 1611852579, "upvotes": 1}, "gl44q2f": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl44q2f/", "text": "!RemindMe 8 months", "author": "ambitiousvanilla_", "created": 1611852568, "upvotes": 1}, "gl3cxwi": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl3cxwi/", "text": "Also in addition:  \nJust because you enjoyed a professor pre-pandemic, they may not do well teaching in an online environment and it's okay to drop them if their online class is managed poorly.", "author": "AdmireableOven", "created": 1611844354, "upvotes": 3}, "gl37jd4": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl37jd4/", "text": "What makes a professor “rude”? Genuinely asking.", "author": "kierabs", "created": 1611842616, "upvotes": 2}, "gl214lh": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl214lh/", "text": "Straight up, if it's not required, don't take it unless you're passionate about it (and even then have a backup). You may be able to take another class to fulfill a major requirement.", "author": "Welpmart", "created": 1611813606, "upvotes": 2}, "gl1vf79": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl1vf79/", "text": "While I agree with this advice, I was in a similar situation and watched as the class thinned down from 25 students to half a dozen people right at the drop deadline. I decided to stick it out. He was tough, and I worked my ass off for the grade, but every class after that was an absolute breeze because he prepared me for anything. \n\nNow when I come across a professor like that I just think \"oh, one of those,\" and get to work.", "author": "SoberHaySeed", "created": 1611810191, "upvotes": 2}, "gl1r5is": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl1r5is/", "text": "Yes. I needed an elective credit this semester so I took intro to neuroscience because I’m a psyc major and most of the science classes I took were stupid and unrelated to my major (i.e. poultry science). There was only one class and the prof’s RMP reviews were bad saying the class was hard, but I figured I’d give him a chance, because usually if I enjoy the subject enough I can still do well despite the difficulty. \n\nFirst day of class, I knew I was in trouble because he had a VERY thick accent. Add the fact that zoom audio quality sucks, and I could only make out about one word per sentence.The next class he went into lecturing. His slides were everywhere and there was just about no text on them so I had no idea what was going on. It was at that point I said screw it and dropped. Much happier now that I’m in a different class :)", "author": "antiquewatermelon", "created": 1611807851, "upvotes": 2}, "gl1qjbs": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl1qjbs/", "text": "I second this. I narrowly avoided this mistake with an English professor (who was so strict that you had to take notes a certain way or fail the class) and got a much better professor.", "author": "arlomilano", "created": 1611807522, "upvotes": 2}, "gl1od0u": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl1od0u/", "text": "Same here. I had one class with a professor that berated her students in class (pre-COVID) and I dropped it the same day.", "author": "topofthefirstpage", "created": 1611806386, "upvotes": 1}, "gl1kc00": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl1kc00/", "text": "Yeah I wish I've had an option with some of my nursing college classes faculty.  Some people just don't belong in education.", "author": "TheVoidWithout", "created": 1611804384, "upvotes": 2}, "gl1jplq": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl1jplq/", "text": "I have to take an Econ class as a general requirement even tho my major isn’t Econ. There were two professors for the class I was looking at but only one fit into my schedule. Looked on Rate My Professor and this one professor had awful reviews. Even tho I want to get the general Ed requirement done, I decided to not take the class and see if I could get the other professor next semester. Plus I found another class I need that I have enjoyed so far.", "author": "earthxtone00", "created": 1611804098, "upvotes": 1}, "gl1iw1n": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl1iw1n/", "text": "This reminds of an English professor I have when I was at community college. At the beginning of the semester she was really nice but as it progress her attitude got worse and worse. She would give us lots of homework which would take hours to complete and if we didn't follow her outline she would make us do the homework again. Her overall attitude was horrendous which made it difficult to ask questions which made you feel stupid and I dropped the class. If only I had use rate my professor I could have saved so much time.", "author": "MegaPokes", "created": 1611803712, "upvotes": 0}, "gl18f91": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl18f91/", "text": "Amen! At the end of the day, the promise of a better tomorrow isn't worth the loss of quality of today. College stress is understandable; discomfort and rudeness is not.", "author": "ohterribleheartt", "created": 1611798968, "upvotes": 0}, "gl164f8": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl164f8/", "text": "RMP only works to a certain point. Your pretty much out of luck once you get to upper division major courses, where there may be only one section. But until then, RMP is a good way to make academic life a little more bearable.", "author": "bills165", "created": 1611797951, "upvotes": 3}, "gl12rkg": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl12rkg/", "text": "Is it just me or is every history professor an incompetent wack job? \n\nGlad I'm only a history minor", "author": "Smitty_Jarrett", "created": 1611796520, "upvotes": 2}, "gl11a8k": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl11a8k/", "text": "I think the \"required\" part is a thing that will hang up a lot of people. \n\nI cant really wait another year just to take one class when there is a solid chance it would be taught by the exact same professor", "author": null, "created": 1611795916, "upvotes": 5}, "gl0vmxi": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0vmxi/", "text": "this. i literally had the SAME issue with my ANT 101 class and dropped it the next day. thankfully i came in with many college credits to suffice dropping one 3 credit class. so important to be able to have competent professors during this online school period", "author": "stressinglucy", "created": 1611793946, "upvotes": 2}, "gl0prcq": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0prcq/", "text": "ALWAYS use \"rate my professor\" to cherry pick your professors for each of your classes. I never realized how much of a difference good professors made until now. I spent way too much time studying per week last semester in Chemistry due to a mediocre professor, and now this semester I barely study because the  new professor knows how to actually teach the material in a way that sticks without much studying. Same goes for the rest of my classes. A good, non-stressful semester depends heavily on your professors", "author": "FerThePro", "created": 1611791829, "upvotes": 5}, "gl0ojfu": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0ojfu/", "text": "imagine not using rate my professor OmegaLul, however I also have an experience with a chem teacher my freshman year when there was another open who was much nicer and totally doable. This happens to most people at least once, it teaches us to use this website.", "author": "Katzue", "created": 1611791352, "upvotes": 1}, "gl0ia5q": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0ia5q/", "text": "The one and only class I've ever dropped due to bad environment was a Calculus 1 class. On the very first day the professor went over the syllabus with us and I asked a question on something that didn't seem clear when we got to the end. Her response was a condescending \"We went over this already, learn to read or learn to listen.\" \n\nDropped the class that night. Math is my worst subject, and I can get upset when I don't understand something even with effort, I need to be able to trust people to go to them for help, not be condescended to and treated like an idiot. Was able to take that class the next semester with a much more patient professor, thank God for community college. There were two other professors at that college that I wouldn't wish on my absolute worst enemy, but their classes were easier and time-sensitive, so I stuck around. \n\n(One had a thing against white people and people calling him on some of his absolutely ludicrous claims, and the other had a thing against \"the youth\" and liked to publicly name and shame students in front of the class or dock points for asking clarifying questions, despite never actually teaching us the material.)", "author": "Marayla", "created": 1611788663, "upvotes": 11}, "gl0hjg6": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0hjg6/", "text": "Even if it is in your major and required see if there are other options such as a practicum or credited internship! That's what I did when I encountered a horrid professor.", "author": "Kuandtity", "created": 1611788359, "upvotes": 3}, "gl0h0d9": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0h0d9/", "text": "I just did this. For my accounting degree I had to fulfill a tax course, corporate or personal. I did corporate last semester so it was fulfilled. Decided to take personal tax this semester. Now I didn’t know who would be teaching it until later into my break but found out the professor has a 2/5 on rate my professor and a 17% would take again rating. I decided to drop it, my tax requirement is fulfilled and I’m gonna take this semester easy with only 4 classes.", "author": "munderhill22", "created": 1611788143, "upvotes": 5}, "gl0fs79": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0fs79/", "text": "Or just don't go to class and do it from the book if you can manage.", "author": "fnybny", "created": 1611787657, "upvotes": -2}, "gl0f9oy": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0f9oy/", "text": "I changed my major because of a bad professor that I would have had to deal with for my whole career there. Then I found out he’s retiring that next semester, but I liked the major better, so I kept it.", "author": "kwickedbonesc", "created": 1611787456, "upvotes": 0}, "gl0dmzt": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0dmzt/", "text": "Same goes for difficult classes. I was on the verge of failing a class my first semester but was so ashamed to drop I kept trying and thought I could pass. I tanked the final and now that grade is just weighing on my GPA. I don’t need the class and I’m really not sure why I was put into it by my AA. (Of course I didn’t find out I didn’t need it until after) after a few semesters I’ve resurrected my GPA but still mad I have a fat E for no reason. A W would look a lot better.", "author": "peachyypeachh", "created": 1611786802, "upvotes": 6}, "gl0d13v": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0d13v/", "text": "I agree with this. Its your money, why would you waste your money? If its a required class, that's a different story and you might be SOL. At my uni, we had 2 weeks to drop the class without effecting # of withdraws we had (Texas has a limit of 6 drops (counts if after the census date) for your entire college career, even at different uni's). So if after a few classes if you don't like the prof, see about switching or taking the class the next semester. \n\nThough, I would recommend taking RatemyProfessor with a grain of salt. I found that they are a bit like reviews on amazon, you're only going to get a response from people who are sufficiently motivated to do so, good or bad. So you'll end up with skewed information. \n\nMy university has professor evaluations available through academic affairs. that would provide feedback from students and any comments they had on that professor. Check to see if your institution has this as well, its a pretty good resource and at least at my uni the evaluation was \"required\" to see the end of the year grade. So you'll get a lot more responses and a realistic expectation of how the professor is, along with course load.", "author": "MyGoddamnFeet", "created": 1611786557, "upvotes": 12}, "gl0cblc": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl0cblc/", "text": "Rate My Professor is an absolute necessity. I honestly don’t understand why anyone would sign up for a course without checking the professor rating first.", "author": "randomassname0120", "created": 1611786272, "upvotes": 86}, "gl082l7": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl082l7/", "text": "My major requires us to take professional communications (literally a speech class). I signed up for it this semester and the professor was really rude. She wanted us to buy her $100 textbook. And there was a ridiculous amount of homework, quizzes, and exams. For a speech class that has nothing to do with my major? Hell no. I dropped the class and I’ll just take it with a better professor in the summer", "author": "microfsxpilot", "created": 1611784579, "upvotes": 12}, "gl06lox": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl06lox/", "text": "After a bad professor or two, I never took a class till I checked rate my professor.", "author": "lrwalters1", "created": 1611784007, "upvotes": 6}, "gl05a3k": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl05a3k/", "text": "Professor here, I 100% agree with you. There are some real jerks on campus. If you don’t have to, don’t deal with them. If by the time they are tenured they are a jerk then it’s a lost cause unless they do something so incredibly egregious that admin has to fire them for cause. You made the right choice. Sorry part of your educational experience was tainted by a turd.", "author": "tactful-dan", "created": 1611783494, "upvotes": 21}, "gl04tf8": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl04tf8/", "text": "I should of done this with my first professor but sadly I had what was called a “double class.” Where it was 2 teachers that intertwined their teachings and I had to take both or drop both, not in between. \n\nSo I ended up failing his class but somehow managed to pass the other class.  I dropped out of that particulate college after going through horrible anxiety, bullying and much more. I waited for 5 years to go back to a different college and it was the best decision ever. I used RMP and found ones I could weed through and take with a different professor. RMP has been a huge lifesaver ever since.", "author": "TAJobReviewer", "created": 1611783310, "upvotes": 2}, "gl038mv": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl038mv/", "text": "I usually stick with classes unless I know the professor’s style will be so bad I can’t get a good grade. But this semester I literally put classes on my schedule, got in and checked out the syllabi, and if I didn’t like it just dropped them.", "author": "OmegaBornAndRaised", "created": 1611782697, "upvotes": 17}, "gl02nai": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl02nai/", "text": "Sometimes you can learn from a professor that you don’t like - I had one whose teaching style I HATED, but stuck with it, and ended up learning a lot. Had another professor whose class I hated but had to take, and what I learned was that I could dislike something and get through it. Then I had one that I dropped the class, moved on, and never looked back. That was also the right choice.", "author": "Felixir-the-Cat", "created": 1611782459, "upvotes": 15}, "gl02mb4": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl02mb4/", "text": "Sometimes you can learn from a professor that you don’t like - I had one whose teaching style I HATED, but stuck with it, and ended up learning a lot. Had another professor whose class I hated but had to take, and what I learned was that I could dislike something and get through it. Then I had one that I dropped the class, moved on, and never looked back. That was also the right choice.", "author": "Felixir-the-Cat", "created": 1611782448, "upvotes": 171}, "gl013e5": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gl013e5/", "text": "Did that on my first day of freshman year. Didn't like the classes or professors so changed my entire schedule and went undecided. Best decision I have ever made and I loved last semester and am liking this one so far.", "author": "Affenballe", "created": 1611781829, "upvotes": 46}, "gkzzt86": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gkzzt86/", "text": "I posted something similar and hard professors team up on me and say “who hurt you” while they post on r/professors all day gatekeeping your college experience. \n\nTheir generations neglect shouldn’t be allowed to be perpetuated.", "author": "OH-Kelly-DOH-Kelly", "created": 1611781342, "upvotes": 66}, "gkzqgbc": {"link": "/r/college/comments/l6bbrp/unless_its_in_your_major_or_required_dont_deal/gkzqgbc/", "text": "Good for you! Like you said for a class that for your major it's sometimes unavoidable. But there is always going to the department head or the dean if there really is something terribly wrong. \nHopefully you were able to find a better replacement class and move on!?", "author": "elocinkrob", "created": 1611777765, "upvotes": 259}}}