{
  "sid": "qgfogm",
  "link": "/r/college/comments/qgfogm/i_want_to_drop_out/",
  "title:": "I want to drop out",
  "text": "I'm a freshman in college and I want to drop out. From the first day I got here I haven't been having a very good time, which makes me really sad, considering I was really excited and ready to start college. I realized that I have no idea what I want to major in and I feel like all of my classes are a waste of time. I've been so stressed out about this that I've had trouble making friends because I can't focus on anything other than my future. I just received a B- on a paper, which is the worst grade I've ever gotten on a paper by far, and I feel like I'm going to fail all of my classes. I knew college was going to be harder than high school, but I didn't expect it to be so overwhelming in every way. I feel so lucky to have this experience, and I like the school in general, but I'm not sure I'm smart enough to go to the school that I do and I'm sick of being overwhelmed. I call my parents all the time, and they say to at least stick it out for the semester, but that's getting really difficult, and even if I don't return next semester, I don't know what I'll do. Overall, this is just a rant, but should I drop out? Should I keep going?",
  "author": "Worldly_Cranberry694",
  "created": 1635280791,
  "updated": 1635302392,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi69732": {
      "link": "/r/college/comments/qgfogm/i_want_to_drop_out/hi69732/",
      "text": "I would talk to a counsellor. It seems like there's a big disconnect between your reality (getting a B- on a paper) and your perception of it (going to fail all your classes). B- is a solid grade and gives every indication that you'll pass.\n\nAssuming they can provide techniques to help manage your anxiety, I would stick out the semester. Pretty much any degree you eventually complete will require some electives outside of your major, so the courses that you finish now will still count for something, even if you take some time off after this to regroup and figure out what you actually want to do.",
      "author": "Dunyazad",
      "created": 1635287060,
      "upvotes": 2,
      "replies": {}
    }
  }
}