{
  "sid": "qfj2r3",
  "link": "/r/college/comments/qfj2r3/lonely_college_freshman_read_this/",
  "title:": "Lonely college freshman read this",
  "text": "I have been at my university for more than 2 months now. Living on campus, freshman dorms, probably so easy to meet friends right. \n\nWell yeah, but no. If you’re like me and introverted, 0 friends. I have met 0 friends and have nobody to hangout with, I eat alone every single meal, but it’s partially by choice. I could just ask my acquaintances to hangout with me but I feel too awkward doing so, and I tbh wouldn’t be that excited to hangout with them and they have their groups now. Also the events, I don’t want to go to football games and other events alone so… I just never go. \n\nBut given that, I still feel hopeless and depressed every single morning I wake up. Why haven’t I made any friends? Everyone on snapchat and instagram made friends, even the weird ones from high school have their friends… What’s wrong with me? \n\nI am the weird one now. I try to just say I don’t give a fuck, and focus on working out and playing instruments, but to face facts I am really just missing out on the dorm social life. Every day it’s just as impossible to make friends as it was yesterday, or even more impossible because now groups are starting to form. \n\nNow I just see people with friends on campus (90% of yall) and wonder what it’s like. Partying on weekends, making memories with people, meeting new people, going off campus to different restaurants or clubs. \n\nI feel like I just squandered my opportunities for friends by being introverted the first few days, now it’s feels just impossible. I feel inherently unapproachable, socially awkward as fuck, and just a loser. \n\nSo if you are a lonely freshman you’re not alone.",
  "author": "earthquakejake03",
  "created": 1635175283,
  "updated": 1636185934,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi0czfl": {
      "link": "/r/college/comments/qfj2r3/lonely_college_freshman_read_this/hi0czfl/",
      "text": "I was once a lonely freshman too. I transferred colleges and am now as happy as ever. I finally made genuine friends and meet people that are similar to me all the time. I was never the problem, it was my environment. I wish it didn’t take me until my junior year to realize that.",
      "author": "rynpickles",
      "created": 1635183380,
      "upvotes": 1,
      "replies": {
        "hi0ek56": {
          "link": "/r/college/comments/qfj2r3/lonely_college_freshman_read_this/hi0ek56/",
          "text": "I’m in a music tech program specific to this school so if I transfer I lose all those credits :/ \n\nAlso I am def the problem. And i have to wait till I’m a junior to transfer anyway",
          "author": "earthquakejake03",
          "created": 1635184024,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi19hef": {
      "link": "/r/college/comments/qfj2r3/lonely_college_freshman_read_this/hi19hef/",
      "text": "> Also the events, I don’t want to go to football games and other events alone so… I just never go. \n\njust go. I know it sounds like ass, but that's prob your best chance. Idk about football games, because that isn't a thing here - but other stuff can def be used to build friendships. I made most of my friends in college by just having labs with them and/or tagging along for food/dinner even if I don't know them super well. I'm rather introverted aswell, but it's plunge you'll have to take.",
      "author": "Lksaar",
      "created": 1635196473,
      "upvotes": 3,
      "replies": {}
    },
    "hi18wit": {
      "link": "/r/college/comments/qfj2r3/lonely_college_freshman_read_this/hi18wit/",
      "text": "Yea im struggling too to make friends. It doesn’t help that my ex dumped me 3 days before I started college. And that she goes to the same college and I see her all the time with her friends while I eat alone. But I have been pushing my normally introverted self to make new friends",
      "author": "Impressive-Win903",
      "created": 1635196230,
      "upvotes": 2,
      "replies": {}
    },
    "hi1895j": {
      "link": "/r/college/comments/qfj2r3/lonely_college_freshman_read_this/hi1895j/",
      "text": "dude,same. I made a post here about the same exact thing a few days ago, it's in my post history. I'm wholly in the same boat as you. I was introverted (im not even an introvert) a little at the beginning 2 months ago as well and know people as acquaintances, but don't have a friend group , people to eat lunch with, or people to hang out with on weekends. I'm not incapable of making friends either, but I've never experienced this loneliness before and it really hits you all at once. if you want, dm me and maybe we can talk! there are probably things we can do to fix this, hopefully this isn't permanent. im going to try to keep my door open, try to be even more so friendly with anyone i meet, and go to more club meetings and everything like that. im really sorry you (and i) are going through this, it sucks to no end. hopefully we can find our people soon. sending you well wishes and the best of luck.\n\nedit: man just re read your post and this just spot-on describes my college experience. literally word by word, I could have written this.",
      "author": "turnpip",
      "created": 1635195961,
      "upvotes": 1,
      "replies": {}
    },
    "hi23gqx": {
      "link": "/r/college/comments/qfj2r3/lonely_college_freshman_read_this/hi23gqx/",
      "text": "[removed]",
      "author": null,
      "created": 1635209936,
      "upvotes": 1,
      "replies": {}
    }
  }
}