{
  "sid": "qfn8cy",
  "link": "/r/college/comments/qfn8cy/help_me_moving_from_computer_science_to_nursing/",
  "title:": "HELP ME: Moving from Computer Science to Nursing",
  "text": "Hello,\n\nI am a freshman at UW - La Crosse and I am thinking about taking a different career path. I have started to look more into the Computer Science degree requirements, talking with my professors about potential jobs and talking with my roommate who is also in the Computer Science program. After doing that research and talking to those people, I don't think it's for me. That being said, I have always had business thrown down my throat by my Dad because he is a very successful businessman, but a pretty shit Dad.\n\nI have always been interested in the medical community, helping people, and having a real connection with people. I think nursing has that's why I am thinking about choosing this path. I have accepted a job at a local retirement home where I will be dipping my feet into the field before earning my CNA license during the 2022 summer. \n\nWith all that being said, I am still stuck at a crossroads of what to do. I don't know if I should really pursue this or if I should just listen to my dad's advice and just stay in Computer Science. Regardless of my decision of either staying at my University or transferring to a different one, I would be in the same town with my girlfriend and so many friends that I have made here.\n\nI guess my questions are: \n\nWhat should I do in your opinion?\n\nWhat are the pros/cons of nursing?\n\nIs it crazy that I never thought of this before now?\n\nAdvice from a current or former nursing student?\n\n&#x200B;\n\nI know this may seem pretty scatterbrained because I am sure it is LOL. I look forward to hearing from you guys :)",
  "author": "Big_Importance6729",
  "created": 1635186899,
  "updated": 1635302764,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi0m345": {
      "link": "/r/college/comments/qfn8cy/help_me_moving_from_computer_science_to_nursing/hi0m345/",
      "text": "If nursing is what you want to do then that's what you should do, you should live the life you want and not the life your parents want. The market for nurses is also pretty good, it's almost certain you'll get a job that pays decent money.",
      "author": "cowfishAreReal",
      "created": 1635187098,
      "upvotes": 1,
      "replies": {
        "hi0nv2d": {
          "link": "/r/college/comments/qfn8cy/help_me_moving_from_computer_science_to_nursing/hi0nv2d/",
          "text": "I completely agree with you and what you said makes total sense. I appreciate the response :)",
          "author": "Big_Importance6729",
          "created": 1635187821,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi0wqod": {
      "link": "/r/college/comments/qfn8cy/help_me_moving_from_computer_science_to_nursing/hi0wqod/",
      "text": "I’m a former nursing student now majoring in computer science.\n\nIf you have a passion for nursing, do it. It has a great career outlook and job prospective. \n\nDon’t listen to your parents because it’s ultimately your life. You’re in control of your future.",
      "author": "kizeltine",
      "created": 1635191334,
      "upvotes": 1,
      "replies": {}
    }
  }
}