{"sid": "ptieug", "link": "/r/college/comments/ptieug/my_university_is_trying_to_charge_me_out_of_state/", "title:": "My university is trying to charge me out of state tuition because of a degree I pursued over 10 years ago. They can’t do this can they?", "text": "Apparently you cannot exceed a certain number of attempted undergraduate hours in order to pay in state tuition. I pursued an associates degree in music right out of high school. It was like a vocational school and not a traditional accredited university. They told me that none of the classes I took there transfer. But now they are trying to count the classes I took there as attempted hours so they can charge me out of state tuition. They can’t be serious. I was completely different person then. That degree has absolutely nothing to do with the degree I’m pursuing today.", "author": "gtrman571", "created": 1632352892, "retrieved": 1632946383, "over_18": false, "upvotes": 2, "upvote_ratio": 0.67, "comments": {"hdwquic": {"link": "/r/college/comments/ptieug/my_university_is_trying_to_charge_me_out_of_state/hdwquic/", "text": "Yes. Yes they can.   \nSec. 54.014.  TUITION FOR REPEATED OR EXCESSIVE UNDERGRADUATE HOURS.  (a)  An institution of higher education may charge a resident undergraduate student tuition at a higher rate than the rate charged to other resident undergraduate students, not to exceed the rate charged to nonresident undergraduate students, if before the semester or other academic session begins the student has previously attempted a number of semester credit hours for courses taken at any institution of higher education while classified as a resident student for tuition purposes that exceeds the number of semester credit hours required for completion of the degree program in which the student is enrolled by at least:\n\n(1)  for an associate degree program, 15 hours; or\n\n(2)  for a baccalaureate degree program, 30 hours.\n\n   \n  \nIt goes on, but the salient part that could help you is here: \nThe Texas Higher Education Coordinating Board shall adopt a rule that exempts a resident undergraduate student from this subsection if the student enrolls in a course that is the same as or substantially similar to a course that the student previously completed, solely as a result of a hardship **or other good cause.**      \n  \nThe language you posted in your auxiliary reply uses words like \"could be at risk\". Talk with your financial aid about appealing that and if needed, talk with the board.  \n  \nHere's a link to that code by the way: https://statutes.capitol.texas.gov/Docs/ED/htm/ED.54.htm", "author": "Oplatki", "created": 1632358975, "upvotes": 5}, "hdweje5": {"link": "/r/college/comments/ptieug/my_university_is_trying_to_charge_me_out_of_state/hdweje5/", "text": "This doesn’t make sense. Being charged out of state vs. in state tuition is all about your residency status not attempted credits. Now if they’re charging you underclassman vs. upperclassman vs. graduate school tuition for attempted credits is different", "author": "Concerned-23", "created": 1632353100, "upvotes": 8}}}