{
  "sid": "q7pgxa",
  "link": "/r/college/comments/q7pgxa/i_want_to_dropout/",
  "title:": "I want to dropout",
  "text": "Hey everyone. I'm currently a freshman in college majoring in computer science. \n\nI have no idea what I want to do in life. The plan was that I would go to grad school and get my doctorates in comp sci. I do want to do that, but I don't see my self actually going through with it. The reason being is that I have no motivation to. I know for a fact that I can do it (not to sound egotistical or anything; I just know that I'm capable of doing it). The only thing that is keeping me in college is that I don't want to disappoint my parents, let myself down for not sticking through/ wasting all of my hard work that I did getting into college, and the fact that I would like to live a comfortable life (family and I are currently dirt poor lol). \n\nCollege doesn't make me happy. I would rather spend my time doing things that I personally deem as important. Things that make me happy such as painting, writing books and poetry, creating songs, coding videogames, etc. I really don't know what to do. I'm falling behind on assignments, not because they're hard but because I have no motivation to complete them. \n\nAnyone in my situation find a way out I guess? I'm guessing the overall majority will say to stay in college, but I would like to hear your personal experiences/stories. Thank you.",
  "author": "bad_vibes_2021",
  "created": 1634175102,
  "updated": 1634252177,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hgk8f0h": {
      "link": "/r/college/comments/q7pgxa/i_want_to_dropout/hgk8f0h/",
      "text": "I’m in comp science too, you have to have the mindset of “getting it over with” because once you’re done. That’s it, you don’t have to deal with the bs anymore. I hate college but it increases my job/internship opportunities and allows you to network. It’s the only reason why I’m here and I’m in my mid 20s almost a jr. Honestly it’s best to get it over with now so you can be financially free sooner. Better than working a shit job with shit pay. At least it can be something tolerable\n\nI’d suggest getting into some hobbies that aren’t “TOO” time consuming like mmos or rpgs to help you decompress from time to time.",
      "author": "ThatOneTy",
      "created": 1634176791,
      "upvotes": 4,
      "replies": {}
    },
    "hgk5zgc": {
      "link": "/r/college/comments/q7pgxa/i_want_to_dropout/hgk5zgc/",
      "text": "Hey Comp sci major here too. I realized halfway through my freshman year I wasn’t ready for college. Not everyone is ready right away after high school and that’s okay. I took a year off and worked on myself and then went back. Maybe that would be an option for you. \n\nI would take time to way the pros and cons of both staying and leaving school. That helped me when I was trying to figure out what to do. \n\nI hope this helps. Good luck in whatever you choose to do.",
      "author": "Ambitious_Mark_9346",
      "created": 1634175613,
      "upvotes": 6,
      "replies": {}
    },
    "hgk69hh": {
      "link": "/r/college/comments/q7pgxa/i_want_to_dropout/hgk69hh/",
      "text": "Hope my situation gives a little motavation, but it's you who can only make that decision.  \nI graduated high school and saw I could make $$$ and not have to worry about college.  Taking the time off, I felt it would make me happy, but ended up making me miserable.  I wanted to go into IT but had no motivation too because I had \"Other\" things making me happy at the time. Now at 30yrs old(yes it took that long to realize what I really wanted) I'm pursuing it. I'm almost done with my BS and wished I had done it sooner.  Dont make my mistake to only follow the same path you started years B4. \n\nIf your pursuing CS because it is a hot market for it; that's a mistake. This may be the reason for the lack of motivation.\n\nIf you truly want to take time to focus on who YOU are, then go for it.  At the end your fam will still be your fam and it's you who has to live with your choice. Don't let anyone elses feelings discourage you from what you truly want to do!",
      "author": "Coco0423",
      "created": 1634175749,
      "upvotes": 2,
      "replies": {}
    },
    "hgkavps": {
      "link": "/r/college/comments/q7pgxa/i_want_to_dropout/hgkavps/",
      "text": "I feel the same, freshmen majoring in computing in the arts (computers science + art classes). I dont have any freinds here, I literally talk to no one, i just got a new room mate after the first one left and I have not said a single word other than hello since he moved in. My classes are hard, im not failing but im far from doing all that well. Im not really all that smart at all, the only reason I ever did well in highschool is because, most of classes were easy pass fail classes and the teachers did'nt care. I have very little time for hobbies or things I enjoy. All I feel is stress, anxiety, lonliness, and depression every day that im here and im getting to the point where im not gonna be able to take it anymore. My advice to you is, to ask yourself if college actually makes you miserable rather than just not making you happy and also, to try to think of the things that are enjoyable, join clubs meet people. If you try all that and you still hate it there and you are not enthusiastic about your future than if I were you I consider other options.",
      "author": "skedadadle_skadoodle",
      "created": 1634178000,
      "upvotes": 2,
      "replies": {}
    },
    "hgkj8yw": {
      "link": "/r/college/comments/q7pgxa/i_want_to_dropout/hgkj8yw/",
      "text": "I haven't even finished a full semester and I've had the idea of dropping out in the back of my mind. I did my college apps last minute not really knowing what I was doing. I kind of just went to college bc it seems like the right thing to do once you graduate high school. Gen ed classes are where I have no motivation for.",
      "author": "jessicalfoley",
      "created": 1634182217,
      "upvotes": 2,
      "replies": {}
    },
    "hgkogj1": {
      "link": "/r/college/comments/q7pgxa/i_want_to_dropout/hgkogj1/",
      "text": ">I would rather spend my time doing things that I personally deem as important. Things that make me happy such as painting, writing books and poetry, creating songs, coding videogames, etc.\n\nThats all well and good but how are you going to support yourself? Whats the pay that you can realistically get in your area and will it cover rent and all expenses? Is there opportunity for upward mobility? You dont need to finish college but you do need some kind of plan",
      "author": "taybay462",
      "created": 1634185201,
      "upvotes": 1,
      "replies": {}
    },
    "hgkx58a": {
      "link": "/r/college/comments/q7pgxa/i_want_to_dropout/hgkx58a/",
      "text": "Hey, \n\nJust keep in mind, *everyone* is gonna do their PhD when they start college. Just like *everyone* was gonna get a college scholarships in sports freshman year of high school. \n\nThe point being, it’s okay if you start out with one set of goals and that changes while you’re in college. Everyone’s do, except for the kids who have been dead set on what they wanna do from age 15. Even they do sometimes. \n\nYou should probably try to find something which you want to apply yourself in. I’m an engineering major, and I apply myself because there’s nothing I want more in this world than to be an engineer. When I was a biology major, I did ten times the complaining and one tenth the work. \n\nMaybe part of your problem is you don’t actually love computer science, and that’s okay. What are you interested in? Mathematics? Physics? Chemistry? Coding? Medicine? Start asking really broad questions like those, and then begin to ask which majors have more of what you like. Then look at what careers you can get with each major. Suddenly after that the puzzle starts coming together a little bit. \n\nI started college wanting to be a chemist, then a doctor, then a professor, then a lawyer, and finally an engineer. It’s the only thing I’ve ever stuck with but it took me two years to find it. Don’t sweat it so much, you’ll figure it out. Even if it’s dropping out and going to trade school I guarantee you it’ll be okay.",
      "author": "cody_d_baker",
      "created": 1634191054,
      "upvotes": 1,
      "replies": {}
    }
  }
}