{
  "sid": "i1cxth",
  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/",
  "title:": "Thinking about taking a year off?",
  "text": "CC dept chair / faculty here. Enrollment is way down, understandably. I am fully aware of the reasons why students are reluctant to go back to school. Believe me, no one is happy with this situation. Teachers hate it, admin is sleepless trying to figure out problems they didn't know existed. And of course, as always, students are the ones stuck in the middle. \n\nHere's one issue, though. Next year, let's say all is well and campuses open up. If everyone from fall 2020 waits to go back in fall 2021, there's not enough seats in the world to handle that capacity. Classes will fill immediately, and many students will be SOL. If you are already on a degree plan, take whatever classes you need to stay on it. Don't wait. Forfeiting your spot and having to re-enroll or worse, having to re-apply, is going to really set you back. At my school, our returning students (who lived through our emergency spring classes moved online) came back for fall quickly. They know it's not as bad as what people may think. \n\nIf you're a new college student, take online classes. It sucks, we're all aware it sucks. We're trying to offer both asynchronous and synchronous online classes to help meet student needs. If you find yourself not engaging with the course, reach out to the instructor. Teachers, well, we're often not aware there's an issue until someone brings it up. So bring it up. Remember that college teachers are subject matter experts, we're not pedagogy experts. \n\nDo what you need to do, take care of yourselves and don't put more pressure and anxiety on yourself. This is a temporary, albeit long, problem we're all working through. My hope for all of you is that you still attain your educational and career goals despite living in a global pandemic. Colleges are trying to help. It's not perfect, but it's still there.",
  "author": "acm2033",
  "created": 1596220681,
  "over_18": false,
  "upvotes": 854,
  "upvote_ratio": 0.93,
  "comments": {
    "fzzzvcp": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzzvcp/",
      "text": "Finished community college in the spring heading into a university now (stony brook), Still moving forward at full pace but this whole shit sucks\n\n\nI honestly miss campus life a bit, being there from 8am to 9pm, starbucks religiously, living in the library for days at a time. It's not the same doing it in my bedroom at 33 with my parents hanging out down the hall. I miss the quiet spaces on campus and also I [[[[[[[LOVE]]]]]]] seeing grounds that are meticulously maintained. Something about the scenery does it for me (NY)",
      "author": "DDP886",
      "created": 1596300943,
      "upvotes": 2,
      "replies": {}
    },
    "fzzyndz": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzyndz/",
      "text": "Since when is it the responsibility of the students who are paying thousands or tens of thousands of dollars and going into debt to account for the awful response of their college? Imagine going into so much debt it follows you for decades for some fuck to say \"guys just go into debt for your shit online classes or you won't get them next year\" is pretty fucking pathetic in my opinion, why would anyone pay to be told that?\n\nAlso I would like to add \"students coming back because they realize it's not that bad\" is utter bullshit, you can't just widely state \"the students know better.\" When they for sure fucking do not know better. I guess I'm just confused as to why it's the students responsibility to respond to the ineptitude of their administration. Why should we be the ones handling the aftermath of \"not having open classes in the spring semester\" as if it's somehow the responsibility of the people going into debt to also plan for the admins sake or the college's sake.\n\nIf OP could prove any of the statements they made maybe I'd be a little more convinced.",
      "author": "Darthtrong",
      "created": 1596300309,
      "upvotes": 3,
      "replies": {}
    },
    "fzzuftb": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzuftb/",
      "text": "I took a gap year before coronavirus, I had a good experience, but I wrote [this](https://www.reddit.com/r/college/comments/i1u8or/things_to_be_aware_of_before_taking_a_gap_year/) post about the downsides of taking a gap year and why it might be a particularly bad idea this year. There are a lot of financial, educational, social considerations in taking one",
      "author": "BudgetPin9585",
      "created": 1596298078,
      "upvotes": 2,
      "replies": {}
    },
    "fzziqy1": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzziqy1/",
      "text": "Thank you for giving this perspective. I have been telling my cousin to wait until fall 2021, but now I might look into the local CC with her for some of her generals.",
      "author": "Shownkindness",
      "created": 1596292226,
      "upvotes": 2,
      "replies": {}
    },
    "fzzgli2": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzgli2/",
      "text": "That’s also why 2025 is going to be a crazy year for graduation — so many people.",
      "author": "officiakimkardashian",
      "created": 1596290942,
      "upvotes": 3,
      "replies": {}
    },
    "fzz1qjn": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzz1qjn/",
      "text": "Ive seen the same stupid advice telling people to take a year off. Thank god not everyone has the same view. Like i understand taking a year off to travel but to sit at home waiting, to avoid using online classes christ.",
      "author": "astonaidan",
      "created": 1596278780,
      "upvotes": 2,
      "replies": {}
    },
    "fzyosc0": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyosc0/",
      "text": "I got an internship offer related to my field..and i am an upcoming junior who goes to pennstate (huge ass campus). I dont know what to do in this case. All my classes are online except chem lab (hybrid) but after my internship experience this summer, i dont even want to go to grad school. I kinda want to transfer my school and do PharmD instead of biochem. What should i do in this case? Take a year off and do internship and think/plan my future? Or just go back to school and graduate asap?",
      "author": "hannah_gg",
      "created": 1596265282,
      "upvotes": 2,
      "replies": {
        "fzyq3fm": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyq3fm/",
          "text": "[deleted]",
          "author": null,
          "created": 1596266531,
          "upvotes": 1,
          "replies": {
            "fzyq4ho": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyq4ho/",
              "text": "Can you explain why?",
              "author": "hannah_gg",
              "created": 1596266560,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fzyi6r3": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyi6r3/",
      "text": "This is good advice, thank you",
      "author": "adalaza",
      "created": 1596259502,
      "upvotes": 1,
      "replies": {}
    },
    "fzyfpls": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyfpls/",
      "text": "Begone admin! \n\nI mostly kid but tbh I don’t care and don’t want to hear any manipulative stories from college admin who are only prioritizing money. The whole system is a joke.",
      "author": "peterisfrosty1",
      "created": 1596257578,
      "upvotes": 7,
      "replies": {}
    },
    "fzy79w8": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy79w8/",
      "text": "My daughter is a sophomore this year. One of the reasons she enrolled in university was for the on campus experience, including talking with her professors, the chance to explore her career options and intern, and yes, to socialize since she is shy and introverted and only recently came out as queer so she was just starting to explore life with that identity. She’s not getting any of those experiences sitting in her room in front of a screen, and has to a big tuition anyway. I’m devastated at what she is missing out on.",
      "author": "Janknitz",
      "created": 1596251799,
      "upvotes": 3,
      "replies": {}
    },
    "fzy30hh": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy30hh/",
      "text": "Look into grants offered for COVID as well. I got laid off I immediately took a full course load and was eligible for a grant that covered the cost of class (I’m at a CC). As a workaholic, I think those classes kept me sane during the shut down. It gave my day structure. I would definitely recommend staying online if it works for you and your situation.",
      "author": "FitLotus",
      "created": 1596249119,
      "upvotes": 2,
      "replies": {}
    },
    "fzy2buu": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy2buu/",
      "text": "Thank you for making this post as a faculty member, it makes students like me feel a little less stupid about choosing to go to college during a time like this. If you're posting here, you clearly care about this learning generation, and that means a lot. Thank you again.\n\nEDIT: 69th comment, *nice*",
      "author": "ChristopherJngs",
      "created": 1596248709,
      "upvotes": 3,
      "replies": {
        "fzyjer6": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyjer6/",
          "text": "A lot of us younger professors had to weather the 2008 recession by sticking in school.  Of course, the pandemic on top of things complicates it all, but we've seen how economic downturns drive people back to school, and next year might just be overloaded in terms of enrollment because of that.  And I'm guessing tuition will be hiked next year because a lot of schools froze tuition this coming year, so get it cheaper while you can!",
          "author": "dontbothertoknock",
          "created": 1596260498,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fzxy49v": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxy49v/",
      "text": "Ever since we’ve been online it’s been a terrible experience for me. It’s sucks because this could go on for who knows how long",
      "author": "PatrickEmerem",
      "created": 1596246155,
      "upvotes": 4,
      "replies": {}
    },
    "fzxdvd2": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxdvd2/",
      "text": "As someone who graduated this past May I would say that I did not feel like I learned much once class went online, and the tuition I paid for \"campus amenities\" was no longer benefitting me. Many of my professors from previous years barely knew how to use blackboard and I'm so glad I was not in their classes when COVID hit. In my experience the value of college in my last semester was not even remotely equivalent to the value of my first 7. That's just my opinion though",
      "author": "Thor8453",
      "created": 1596235610,
      "upvotes": 9,
      "replies": {}
    },
    "fzx99ov": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx99ov/",
      "text": "If you care about quality of education I would take this with a grain of salt. Sure, it makes sense if you’re just trying to get your degree. But if you’ll be studying in a bad home situation, won’t have access to facilities relevant to your major, and/or don’t think the actual education you’re receiving is as worthwhile online, then take a year off. Do something more meaningful with your time. \n\nIt’s not a rat race to get your degree and get into the workforce, make the decision that gets you the best education possible.",
      "author": "McNuggets33",
      "created": 1596234015,
      "upvotes": 32,
      "replies": {}
    },
    "fzx95yk": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx95yk/",
      "text": "I'm not paying $20k to to live in a dorm that I may be kicked out of, risking my families health by people who don't take it seriously, or wasting time on inadequate classes.",
      "author": "1kiki09",
      "created": 1596233982,
      "upvotes": 11,
      "replies": {}
    },
    "fzx6eok": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx6eok/",
      "text": "[deleted]",
      "author": null,
      "created": 1596233039,
      "upvotes": 21,
      "replies": {
        "fzxple6": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxple6/",
          "text": "I have to take my hardest major classes all together this fall. All of them involve field work. If we go online I'm gonna miss out on vital experience for my degree and not do nearly as well.",
          "author": "Zerobeastly",
          "created": 1596241273,
          "upvotes": 8,
          "replies": {
            "fzxq2vo": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxq2vo/",
              "text": "Yeah, and the colleges that are doing partial in-person will likely shut down and go online again within the first month back. Sorry you're in such a crappy situation regardless.",
              "author": "uhhMelvinDoo",
              "created": 1596241518,
              "upvotes": 7,
              "replies": {}
            },
            "fzziklb": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzziklb/",
              "text": "Could you maybe email a professor? If you are close to one of the prof in your major maybe they would be willing to still do the field work. Maybe not to the extent that you normally would get but maybe a smaller scale project. Taking that extra initiative might help with LORs if you plan for grad school too or on the job hunt.",
              "author": "Shownkindness",
              "created": 1596292129,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fzx5rd1": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx5rd1/",
      "text": "do yourself a favor and take a gap hear",
      "author": "grubbycoolo",
      "created": 1596232822,
      "upvotes": -6,
      "replies": {
        "g007tw0": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g007tw0/",
          "text": "Okay, I won’t listen to anyone for a year!",
          "author": "Jsmith4523",
          "created": 1596304812,
          "upvotes": 2,
          "replies": {
            "g00egio": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g00egio/",
              "text": "why? continuing to educate yourself is the best thing you can do",
              "author": "grubbycoolo",
              "created": 1596307869,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fzx568j": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx568j/",
      "text": "A problem with taking a year off is that sometimes it ends up being more, and eventually it is hard to get back into college. At least that's what I personally experienced.",
      "author": "TheLazyPanda",
      "created": 1596232626,
      "upvotes": 9,
      "replies": {}
    },
    "fzx4x93": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx4x93/",
      "text": "I don’t mind the online classes idk why everyone’s buggin. Like yeah it sucks but I want to graduate early or on time. No delays. No breaks. Burnout coming soon.",
      "author": "imagineer_17",
      "created": 1596232543,
      "upvotes": 5,
      "replies": {}
    },
    "fzx2q32": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx2q32/",
      "text": "CC tutor / adjunct / lecturer and administrator of 10 years here. \n\n> there's not enough seats in the world to handle that capacity. \n\nI'm skeptical about this take.\n\nI've seen plenty of autumn terms with sudden high enrollments. Departments simply hire more adjuncts (who are cheap and eager to leap into the wood chipper for a pittance and the false promise of a long-term contract) and increase loads for existing faculty. As we see faculty being squeezed now, they have no leverage to refuse.\n\nWhat's stopping colleges from doing the same thing F21? Or, they can hire back all the adjuncts they're cutting now or hire all the fresh PhDs. \n\nColleges will be ecstatic to make up their lost profit. There's no way they'll let that business opportunity pass them up.",
      "author": "brownidegurl",
      "created": 1596231831,
      "upvotes": 3,
      "replies": {
        "fzxt47t": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxt47t/",
          "text": "Prof here, not sure what state you’re in but my state has a 2+ year hiring freeze in place in response to COVID. My understanding is that this applies to hiring adjuncts as well so we won’t be able to hire for any kind of huge rebound enrollment in F21.",
          "author": "ArchMagoo",
          "created": 1596243187,
          "upvotes": 8,
          "replies": {
            "fzyhsf2": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyhsf2/",
              "text": "Illinois representing. We've had a \"hiring freeze\" for the past 3-4 years at most of my school and that hasn't ever applied to adjuncts. We're still hiring them for the fall.",
              "author": "brownidegurl",
              "created": 1596259183,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fzwxhvd": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwxhvd/",
      "text": "I took one class this summer semester. All online. The workload was like taking 3 classes online. It was annoying, but the professor made time for us every week. I didn't need any help, but it still sucked ass. I cannot fathom what hell awaits us in the fall. May there be mercy on us all going to school in fall.",
      "author": "swollemolle",
      "created": 1596230236,
      "upvotes": 16,
      "replies": {
        "fzx0tzi": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx0tzi/",
          "text": "Summer classes are often shorter and more condensed than regular classes which is probably why you had such a heavy workload. Hopefully fall classes will be better.",
          "author": "imgonnawingit",
          "created": 1596231245,
          "upvotes": 25,
          "replies": {}
        },
        "fzxpeyp": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxpeyp/",
          "text": "I go to a smaller school where most classes have on time slot and are only offered in either fall or spring.\n\nI'm a senior and my classes ended up where I will be taking the hardest, most hands on classes of my entire undergrad career this semester. \n\nIf everything goes online I think I might be utterly fucked.",
          "author": "Zerobeastly",
          "created": 1596241184,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "fzwwvj9": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwwvj9/",
      "text": "So now not only are school tuition rates not decreasing for the online course delivery, but now we're essentially being blackmailed by universities saying if we don't go back then we won't have a spot next year...",
      "author": "yobatman12",
      "created": 1596230053,
      "upvotes": 8,
      "replies": {}
    },
    "fzwwcvd": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwwcvd/",
      "text": "Alum from a 4-year uni here. You're post is interesting and something I haven't really considered...renewed interest in college if/when covid-19 situation is scaled back. For a student who wants to take a break, taking 1 or 2 classes to continue registration, is probably a good idea. Also keeps the degree plan the same.\n\n>Colleges are trying to help. It's not perfect, but it's still there.\n\nThis is the part you lose me on. From what I've seen from the university I went to, they are fumbling, big time. Their key strategy is asking every student to sign a pledge, it essentially says don't come to campus if you're sick. Easier said than done. When someone asked during a town hall how attendance & make-up would be handled, the provost responded with: it will be up to each student to coordinate with each professor. At least when I was in school, they were EXTREMELY rigid about certain aspects of the courses (such as no make-up tests, for any reason).\n\nHow can a student agree, in good conscience, to stay home if they are sick when the university won't support them in making up the associated course work?",
      "author": "monkeyman88956",
      "created": 1596229914,
      "upvotes": 58,
      "replies": {
        "fzx0gym": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx0gym/",
          "text": "Op is from a community college and from what I've seen, community colleges have cared more about their students than universities this year.",
          "author": "imgonnawingit",
          "created": 1596231135,
          "upvotes": 54,
          "replies": {
            "fzx695v": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx695v/",
              "text": "Also my SO is an adjunct at a CC, though her class has been online only for many years. So it is relatively unaffected, though with enrollment in person classes cut way back, they may have a full time prof teach her section, so she may be out of a part time job.",
              "author": "monkeyman88956",
              "created": 1596232986,
              "upvotes": 15,
              "replies": {}
            },
            "fzx5wee": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx5wee/",
              "text": "Agreed. It was a general comment. Made hoping OP will think of the challenges students in his department face if they are trying to prevent spread. Which it sounds like they are trying to think of these things.",
              "author": "monkeyman88956",
              "created": 1596232865,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "fzwv1se": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwv1se/",
      "text": "What if I am only planning on taking a semester off and still taking one class online through a community college? I not a big fan of online classes, despite having taken a few, but I currently have a bit of flexibility as I was already intending on taking a fifth year with the ability to take an internship on semester in there (just now I won't have that flexibility). Its too late for me renege on my decision, as I have already notified my school and my scholarship foundation (I have a full tuition + housing scholarship). I was going to take this semester to do some self learning and work on things that could help me get future internships and such. I know there is a chance that spring semester will be roughly the same as this fall, but I'll deal with it if it comes to that. I did give up my spot in two classes where I got instructors that I wanted, so that kind of sucked, but I can hopefully try to get them next semester.",
      "author": "M477M4NN",
      "created": 1596229545,
      "upvotes": 6,
      "replies": {}
    },
    "fzwucyo": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwucyo/",
      "text": "A lot of people don't realize that when you stop going to school, it can be SUPER hard to start back up. A lot of the kids I see who are deferring are sadly never actually going to step foot on a college campus again.\n\nTaking the minimum class load, easy classes, and maybe a CLEP Exam. Transfer to a close by/cheaper School. Find a school that fits what you like. But don't stop!\n\nA bad semester is worth more than no degree at all!",
      "author": "Javret",
      "created": 1596229317,
      "upvotes": 8,
      "replies": {}
    },
    "fzwt2au": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwt2au/",
      "text": "Be wary of your financial aid! Just remember that!",
      "author": "Unreal_Ncash",
      "created": 1596228697,
      "upvotes": 66,
      "replies": {
        "fzwxqcj": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwxqcj/",
          "text": "Literally the only reason I’m doing full time next semester lol.",
          "author": "trigonometroy",
          "created": 1596230310,
          "upvotes": 26,
          "replies": {}
        },
        "fzxxmuw": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxxmuw/",
          "text": "*wary",
          "author": "geoffsauer",
          "created": 1596245868,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "fzwsz46": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwsz46/",
      "text": "then hire more instructors, jesus christ",
      "author": "eilig",
      "created": 1596228652,
      "upvotes": 6,
      "replies": {
        "fzxoa4h": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxoa4h/",
          "text": "It's a screwed from the top down kind of thing. Most schools aren't able to do that and they are really just worried about survival. Since they are screwed, they screw you too. If we had a coordinated national response, all of this would be a non-issue. We are all screwed from the very top.\n\nThat being said, you will find that some schools are much more \"screw for the top down\" than others. I hear about some places hiring more admin while cutting teachers, but I also hear about a lot of places cutting admin's budget and salaries first. Here is hoping we all have a good choice in this eventually, and get to go to a good school, job, country, etc where people are valued more than the budget.",
          "author": "real-nobody",
          "created": 1596240613,
          "upvotes": 11,
          "replies": {
            "fzxoy10": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxoy10/",
              "text": "Yup. Some schools choose to go the “welp, nothing we can do” route, others actually give a shit. I know it’s more complicated than simply demanding they pay more people a living wage (because that’s such a horrible demand apparently) in order to solve the problem that would be solved by it, but even if it’s “not possible” because too many at the top are overpaid and funding for those that hold the place together is lacking for various reasons, that doesn’t mean it shouldn’t be demanded. OP’s words read as if they’re talking down on a bunch of people whose fault it absolutely isn’t, and I purposefully chose not to meet them with a level-headed response.",
              "author": "eilig",
              "created": 1596240947,
              "upvotes": 2,
              "replies": {
                "fzzub35": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzub35/",
                  "text": "I get where you are coming from a little more now.\n\nAlso, on the \"hire more instructors\" bit, wouldn't it be nice if there was a massively oversaturated pool of candidates to hire from? (For anyone not aware, there very much is at the phd level). So much in the US education system, every level, needs to change. I'm not going to blame one particular party in this comment, including the educators. I'm just saying it sucks. All of it.",
                  "author": "real-nobody",
                  "created": 1596298006,
                  "upvotes": 4,
                  "replies": {
                    "fzzudip": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzudip/",
                      "text": "Yes. Absolutely.",
                      "author": "eilig",
                      "created": 1596298042,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fzx8gnz": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx8gnz/",
          "text": "If it were only that easy. Universities and CCs are at the mercy of tight or non existent budgets, which just means overloading the existing faculty.",
          "author": "ArchMagoo",
          "created": 1596233740,
          "upvotes": 1,
          "replies": {
            "fzx8n9f": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx8n9f/",
              "text": "I am aware. No one should be forced to compromise the experience they wanted though.",
              "author": "eilig",
              "created": 1596233804,
              "upvotes": -2,
              "replies": {
                "fzxf07n": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxf07n/",
                  "text": "Are universities supposed to just build new buildings for those classes? This is completely unreasonable.",
                  "author": "EatMyTracers",
                  "created": 1596236133,
                  "upvotes": 4,
                  "replies": {
                    "fzxf406": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxf406/",
                      "text": "They charge a single student the price of a small house in a low cost of living area to attend. It’s not unreasonable.",
                      "author": "eilig",
                      "created": 1596236183,
                      "upvotes": 2,
                      "replies": {
                        "fzxkw8h": {
                          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxkw8h/",
                          "text": "Then it sounds like you should contact university and CC administrations and state legislatures to complain about your loss of experience since individual departments have zero control over anything related to budgets, facilities, and hiring.",
                          "author": "ArchMagoo",
                          "created": 1596238952,
                          "upvotes": 2,
                          "replies": {
                            "fzxnlu2": {
                              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxnlu2/",
                              "text": "No shit. I’m aware this isn’t the talk to Betsy DeVos personally forum. It isn’t the “your advice as a department chair at a CC is the only valid advice” forum either. My experience is fine. I’m not talking about myself.",
                              "author": "eilig",
                              "created": 1596240274,
                              "upvotes": 0,
                              "replies": {
                                "fzxsru7": {
                                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxsru7/",
                                  "text": "I interpreted your “just hire more people” response to a department chair’s post to mean you don’t understand how that process in higher ed works, that, as a chair, it is out of his/her control. Otherwise I figured you wouldn’t have said it. And I also interpreted your “college experience” as applying to you since you didn’t indicate otherwise. Either way, the same point remains. It isn’t as easy as hire more people and build more buildings. The points in the original post are valid. Higher education will need years to recover from this and it will be at the expense of the students and overworked faculty. The only people to blame are boards of directors, local, state, and federal governments.",
                                  "author": "ArchMagoo",
                                  "created": 1596242982,
                                  "upvotes": 3,
                                  "replies": {
                                    "fzxta24": {
                                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxta24/",
                                      "text": "Those are indeed the people I blame, as per my other responses on the thread.",
                                      "author": "eilig",
                                      "created": 1596243282,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fzxlhjc": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxlhjc/",
                      "text": "I agree. It’s easy for people who do not work in higher ed to school higher ed on how to “fix” their problems.\nAs faculty and chairs, we are aware of the problems. We fight tooth and nail to fix them. We are stopped by boards, administrators, local and state politics, and the never ending assault on higher ed. It’s not as easy as “hire more people and build more buildings.” There is so much red tape there that it either 1) never happens or 2) takes two years to get approved.",
                      "author": "ArchMagoo",
                      "created": 1596239239,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fzwsgq8": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwsgq8/",
      "text": "I would say it really depends. As someone who graduated in spring I have a pretty different take on it. Especially given a lot of schools' administrators really don't care about their students right now, they care about their bottom line above all. I've seen too many predatory housing contracts put out by schools (among other notices) to believe anything else.\n\nMost students rely on service jobs while in college and for many they also rely on them after they graduate until they get something better, and the service industry has been completely decimated by COVID. If you're a freshman this year (and honestly most sophomores with a ton of pre-reqs left) and you have to take out loans, go to a community college closer to home and then live at home while taking classes. Its not glamorous, but you're not getting the on-campus experience anyway so why pay for it. Especially, if you can, continue at your high school job, again it sucks but there's no reason to give it up since you will struggle to have any employment at this point.\n\nIf you're a senior, just finish. It sucks that this is how your last year will be spent (I know I defended my thesis the Friday before everything closed) but you're in a place with few options. Internships, fellowships, and other ways that you could spend the time have all but disappeared at this point and the ones that still exist have gotten super competitive. You will also be much better off with a degree than just being able to put \"some college\" on your employment applications, especially since you have to start paying back your loans 6 months after the end of the last semester you were in college.\n\nIf you're a sophomore or junior and you're in your major it really depends on what you are comfortable with. If you have loans and you can't afford to start paying them back right now, then you have to continue on with education no matter what. Even if you go part time, keep those loans in deferral status so you don't get hit with payments that you can't make. If you default on the loans, you won't be able to go back until you get the loans out of default. If you could start paying back your loans or you don't have any loans then do whatever you feel comfortable with. If you don't like online or hybrid classes, then take time off or take the fewest courses you need to stay enrolled and that won't mess up your degree plan too badly. The reality as I see it that schools are going to have to adjust the number of course sections in a year or two, or whenever COVID ends and enrollment goes back, or students just won't go back anyway. Most schools rely on adjuncts anyway so they can pretty quickly and easily add a section here and there no problem.",
      "author": "squirrel8296",
      "created": 1596228391,
      "upvotes": 35,
      "replies": {
        "fzx5d2n": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx5d2n/",
          "text": "The thing is though, everyone's situation is different based on major. I'm a senior in a very hands on film production program. Filming a senior thesis in my apartment with nothing but my own equipment and 2 roommates is far different than the film sets of 20-30 crew members I usually see. \n\nWe're not really paying for the degree, we're paying for the school's resources that are now unavailable to us. I'm going online this semester since my classes can transition well enough, but for my last semester I might not just want to \"finish up\" if it means filming a home video as the culmination of my college career.",
          "author": "discodolphin1",
          "created": 1596232691,
          "upvotes": 25,
          "replies": {
            "fzx7ilo": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx7ilo/",
              "text": "And I get that it not ideal... but just know that if you take time off and default on your loans you will have to pay out of pocket for the rest of your credits unless your school takes pity on you and gives you a scholarship (which probably won’t happen) or you pay enough off on the loans to get out of default.",
              "author": "squirrel8296",
              "created": 1596233420,
              "upvotes": 9,
              "replies": {}
            },
            "fzyr230": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyr230/",
              "text": "I am a film major as well (my school's program is a lot smaller though lol) and I feel you. I actually decided to transfer colleges and change my degree, because while I love dealing with cameras and the creative aspects of filmmaking, I don't feel like it is the degree for me because I don't want to work on film sets the rest of my life. I don't know what I want to do, but love technology, so when I transfer colleges, my new degree will be Applications and Database Management. Huge difference in majors, but might as well use the pandemic as an opportunity to try something new out, since I refuse to live on campus this fall anyways. If I stuck with my major at current college, I would be force to live on campus, which I don't believe is the right call for me. Film is not easily transferable to an online degree either, so it came down to changing majors at current school, or changing majors and switching schools, so I went with the latter.",
              "author": "SuperDogBoo",
              "created": 1596267483,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "fzwrb6e": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwrb6e/",
      "text": "Would this apply to people withdrawing from their current Uni’s and going to CC for a year? I was literally gonna withdraw from my Uni today and now I’m confused as to what to do :(( I thought it would be smart to save money this year",
      "author": "bobbyjoemamma",
      "created": 1596227856,
      "upvotes": 7,
      "replies": {
        "fzwt0pv": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwt0pv/",
          "text": "If you are in the US this might be a smart move. Acceptance rates of uni from a cc is higher than those from a highschool. But you need to do research on what cc classes are transferable to your uni. Since classes are all online now, it makes alot of sense. Talk to both your cc and uni counselors to get an idea on the pros and cons though. Good luck!",
          "author": "Heliomecon",
          "created": 1596228675,
          "upvotes": 8,
          "replies": {}
        },
        "fzwtd1q": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwtd1q/",
          "text": "Are you a freshman? If you are, I would go to CC. In terms of actual knowledge/work, most state universities are not that much better class wise. You might ass well do prereqs at CC, especially considering that the main benefits of Universities will be pretty much gone (clubs/sports/greek life/research, etc.)",
          "author": null,
          "created": 1596228839,
          "upvotes": 14,
          "replies": {
            "fzwvjd8": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwvjd8/",
              "text": "I taught as an adjunct at a state university, as an adjunct at 2 community colleges, and now full time at a community college. I taught the gen ed classes exactly the same everywhere I taught. Given how many classes are taught by adjuncts everywhere (and the SAME adjuncts in any given region), you really are getting a comparable education for the gen eds.",
              "author": null,
              "created": 1596229674,
              "upvotes": 12,
              "replies": {
                "fzwyi4v": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwyi4v/",
                  "text": "Yup. I am a junior rn. I did a couple classes at a CC and then two years at a well known school to get the college experience. The classes were not that drastic in terms of quality. Only difference is I blew 40k. TBF, I was able to join clubs/do the whole sorority thing. But if that is not available.. what is the point?",
                  "author": null,
                  "created": 1596230554,
                  "upvotes": 5,
                  "replies": {
                    "fzx67aq": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx67aq/",
                      "text": "The college experience isn't always great for everyone anyways. I went to a major party school (Big 10) for my freshman year and it turned out I didn't even like or want the typical college experience. I hated living in the dorms, I hated frat parties (and house parties at this particular school) For my sophomore year, I transferred to an urban state university (still R1) instead, and moved into a major city, and had a way better experience. I got to live as an adult still, but go to more chill parties and live the whole city lifestyle instead of frat party lifestyle. The cost was less for tuition and WAY less for rent because of the area the school was in.  (It wasn't exactly a \"safe\" neighborhood, but it was amazingly affordable).",
                      "author": null,
                      "created": 1596232968,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fzwu1tj": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwu1tj/",
              "text": "I am a freshman and thank you for reassuring me! I’m gonna go ahead and withdraw today",
              "author": "bobbyjoemamma",
              "created": 1596229187,
              "upvotes": 3,
              "replies": {
                "fzwzi94": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwzi94/",
                  "text": "You'll probably have smaller class sizes too which is nice.",
                  "author": "imgonnawingit",
                  "created": 1596230856,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "fzwt56f": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwt56f/",
          "text": "It’s always smart to save money. Go to a community college for as long as it’ll count towards your degree. You won’t care that you got to party with college friends when you were 19 once you see your loans tripple in size because of interest.",
          "author": "eilig",
          "created": 1596228738,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzwqoxf": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwqoxf/",
      "text": "That’s a good point, I never thought about that. I’ll make sure I enroll as soon as I can.",
      "author": "fufe25",
      "created": 1596227546,
      "upvotes": 2,
      "replies": {}
    },
    "fzwpoo7": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwpoo7/",
      "text": "Also...it will be hard to get a good job *during a pandemic*. This is the ideal time to go to school and work towards a degree.",
      "author": "Cantelope_Whisperer",
      "created": 1596227085,
      "upvotes": 200,
      "replies": {
        "fzwsumf": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwsumf/",
          "text": "While that is true, its important to keep in mind the impact of this pandemic on the job market will likely extend pass when the country returns to a more normal routine. Industries will be bootstrapped, opportunities might not necessarily be there.",
          "author": "LilRomenHuhn",
          "created": 1596228588,
          "upvotes": 84,
          "replies": {
            "fzwt76j": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwt76j/",
              "text": "great time to add a master’s degree to your plans!",
              "author": "eilig",
              "created": 1596228763,
              "upvotes": 60,
              "replies": {
                "fzwv10t": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwv10t/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1596229539,
                  "upvotes": 30,
                  "replies": {
                    "fzxyvvk": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxyvvk/",
                      "text": "Wait, so being a grad assistant is like them paying you to go to grad school? Or just partially eliminating potential debt?",
                      "author": "mental_dissonance",
                      "created": 1596246610,
                      "upvotes": 10,
                      "replies": {
                        "fzyiqq7": {
                          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyiqq7/",
                          "text": "If you go into the sciences (and some other fields), you get paid to get your PhD.  That's how I weathered 2008.\n\nOne of the best places to be during an economic downturn is safely ensconced in school.",
                          "author": "dontbothertoknock",
                          "created": 1596259948,
                          "upvotes": 16,
                          "replies": {}
                        },
                        "fzyhlik": {
                          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyhlik/",
                          "text": "Not all grad assistant is debt free. I attended an MBA program and I was a Grad assistant, and I still have debt. Grad assistant position helps pay for your tuition.",
                          "author": "blm4lyfe",
                          "created": 1596259029,
                          "upvotes": 10,
                          "replies": {
                            "g023wdn": {
                              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g023wdn/",
                              "text": "Hey can I ask you a few questions regarding being a grad assistant for MBA because I want to do that",
                              "author": "azhan0011",
                              "created": 1596344306,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "fzzbcgm": {
                          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzbcgm/",
                          "text": "It depends on the school and appointment, but typically you get free school and a stipend (I think the average is around 15k/year in the US). \n\nHere was my deal going for my M.A. in Literature: I had two \"appointments\" that I would do for Fall and Winter and I got for two years (since it was for an MA program). Each appointment could be filled by one of the following: teaching freshman comp (I or II), TA-ing a large lecture class, or working in the writing center. They would also sometimes have special appointments as needed (working in other areas of the department or on projects that were needed). \n\nI got 100% tuition covered and a living stipend. The pay is generally shit, but if you wrap in the tuition and the experience you are getting, it was absolutely worth it. Also, as a GA, you tend to be more a part of the department, so I built really strong relationships with the faculty and other GAs. \n\nA couple notes about this: \n1) These tend to be available for more academic degrees. There aren't many GA positions floating around for MBA programs. The more freshman classes your department teaches (math, English, etc), the more positions are out there. In many sciences, there are also research and lab positions. \n \n2) GA positions are rarer for master's degrees than PhDs. If your degree has a PhD, chances are all the positions are going to them. I specifically chose my school in part because they didn't offer a PhD, and I wanted a GA position for my Master's. \n \n3) For many programs, and depending on what you want to do with the degree after, a lot of people would say you shouldn't get a graduate degree if you don't get a GA position - basically, make them pay for it. This isn't true of all situations (like a Master's in Social Work, MBA, or if you already have a good job), but is a good idea if you are looking at going into higher ed or a really competitive field. The logic behind this is that if you aren't competitive enough to get a GA position, you likely aren't going to get a job in the field. And you are learning so much in the GA position and getting so many experiences from it that graduates without that often can't compete against those that did have GA positions. So, it's worth it to shop around for grad school nationwide and find the school that will pay for you to go.",
                          "author": null,
                          "created": 1596287443,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fzx057b": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx057b/",
                  "text": "Yessss!  I'm doing a 5 year BS/MS program in data science and computer science with a double major in statistics, and I'm hoping to go into Machine Learning.   My thoughts are that if a lot of students take gap years or drop out to work, there will be less new ML experts than usual and thus more demand",
                  "author": "False-Fisherman",
                  "created": 1596231044,
                  "upvotes": 19,
                  "replies": {
                    "fzyu6bf": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyu6bf/",
                      "text": "Either way there will be demand. It is a great career choice.",
                      "author": "Cantelope_Whisperer",
                      "created": 1596270681,
                      "upvotes": 2,
                      "replies": {
                        "fzzzzdo": {
                          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzzzdo/",
                          "text": "Hard to get into tho",
                          "author": "False-Fisherman",
                          "created": 1596300999,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fzxombc": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxombc/",
          "text": "I feel like my degrees going to be worth less as the majority of core classes I have to take this semester require in-person labs and field experience. If tgat gets cancelled and we go full online, the most important classes of my degree will be reduced to shells of what theyre suppose to be.",
          "author": "Zerobeastly",
          "created": 1596240779,
          "upvotes": 8,
          "replies": {
            "fzxrus3": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxrus3/",
              "text": "What major?",
              "author": "Cantelope_Whisperer",
              "created": 1596242433,
              "upvotes": 2,
              "replies": {
                "fzy9v76": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy9v76/",
                  "text": "Fisheries and Wildlife.\n\nWe were suppose to go to Gulf Coast for coastal ecology and Georgia for forest management. Theyre the two biggest trips of the major and both last a week but neither are happening for me and it really sucks.\n\nAnother awful thing is I spent three years doing a side program where you go to ton of leadership/financial security/mental health/volunteer etc. events and if you do every event the next summer you get a free trip to Washington DC and San Francisco where you do a ton of stuff all paid for by the school.\n\nI had finished my interview for it and was already confirmed to go. Thats what I would have done this summer.\n\nSeniors aren't allowed to go because it has to be while your enrolled. So fuck me I guess. All I got was a \"Sorry guys its cancelled\" email. Three years of sitting through optional seminars and volunteering.\n\nThat and my first internship at a place I *love* was gonna start a week after that trip. Cancelled.\n\nA lot of my friends had the same issue. One was enrolled in a night class dpring semester to prepare for their trip to South America this summer. Cancelled, but she took the class so no money back.\n\nAnother was meant to do a semester in JAPAN. He was so fucking excited. Cancelled a week before his departure. \n\nSorry for the rant, this all just fucking sucks so much. I worked so hard in my major and was so damn excited for the Gulf Coast and Georgia. They're the thing people in my major look forward too. And all the time I spent to go on that amazing fully paid trip. And the past three months I could of been getting experience doing something I adore.\n\nShit makes me wanna cry.",
                  "author": "Zerobeastly",
                  "created": 1596253506,
                  "upvotes": 7,
                  "replies": {
                    "fzysdyc": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzysdyc/",
                      "text": "Oh. That is a really rough major to be in right now. I can see that.",
                      "author": "Cantelope_Whisperer",
                      "created": 1596268825,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g0008qt": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g0008qt/",
              "text": "I'm an environmental engineering major and feel the same.",
              "author": null,
              "created": 1596301132,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fzzljs2": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzljs2/",
          "text": "the pandemic is probably the only reason I am returning to school to finish my degree.",
          "author": "Steve_Bread",
          "created": 1596293698,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fzwphb1": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwphb1/",
      "text": "As usual, take this with a heavy grain of *varies from school to school*.\n\nIf your school isn’t taking the steps it needs to, to ensure your success this upcoming year/semester, taking a semester off is always better than failing a semester’s worth of classes. \n\nNone of our reddit posts can make a decision for you, talk to your family and advisors before making any important decisions.\n\nIf you can confidently say you can handle this semester, you should probably stay enrolled. If not, then don’t listen to us about it.",
      "author": "Xystem4",
      "created": 1596226981,
      "upvotes": 513,
      "replies": {
        "fzwrmfl": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwrmfl/",
          "text": "could barely handle my online classes last semester but if i don’t start least try this semester i already know that i’m going to find some excuse to keep away from school",
          "author": "JesusRocksSocks",
          "created": 1596228002,
          "upvotes": 86,
          "replies": {}
        },
        "fzwrutj": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwrutj/",
          "text": ">taking a semester off is always better than failing a semester’s worth of classes\n\nTell this to my mom. I kinda want to take a year off to focus on something on side, learn something else and try to get a full time good paid job, but she thinks its easy to finish uni. It's a fucking drag man, they fucked us so hard with the online courses and exams now, they made them 3 times harder than physical exams. I mean, I didnt fail that much in winter's semester but summer one is fucking hell. And im not the only one.",
          "author": "Klokikus",
          "created": 1596228094,
          "upvotes": 41,
          "replies": {
            "fzwymz3": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwymz3/",
              "text": "A full time good paying job, especially without a degree, is almost going to be impossible to find at the moment. Not saying you need a degree for a job but the options are going to be severely limited. Imo, shutdowns are going to happen again making jobs even more difficult to find.",
              "author": "SaltyKrew",
              "created": 1596230591,
              "upvotes": 57,
              "replies": {
                "fzy34ht": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy34ht/",
                  "text": "> Imo, shutdowns are going to happen again making jobs even more difficult to find.\n\nYou're not wrong, but all the more important to get ahead of that curve and lock in a secure job ahead of time.\n\nThe smart course of action is to job hunt now, and if a good opportunity presents itself, seize it. Otherwise, college will always be there as a backup plan.\n\nIronically, I started grad school a year ago because I couldn't find the ideal job with my BS right away. And in the middle of this crisis is when I find a fantastic job that's easily convinced me to drop out of college.\n\nI agree that it'll likely be that much harder without any degree, but it's still worth a shot.",
                  "author": "darkapplepolisher",
                  "created": 1596249186,
                  "upvotes": 8,
                  "replies": {
                    "g00nlo1": {
                      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g00nlo1/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1596312528,
                      "upvotes": 4,
                      "replies": {
                        "g01ctq8": {
                          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g01ctq8/",
                          "text": "I explicitly acknowledged this in my very last sentence:\n\n\"I agree that it'll likely be that much harder without any degree, but it's still worth a shot.\"",
                          "author": "darkapplepolisher",
                          "created": 1596326933,
                          "upvotes": 2,
                          "replies": {
                            "g01djdp": {
                              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g01djdp/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1596327365,
                              "upvotes": 2,
                              "replies": {
                                "g04kc30": {
                                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/g04kc30/",
                                  "text": ">requires no prior education or preparation\n\nThat's a silly parameter. If you make it ~1-3 years into earning a college degree and still have no prior education or preparation beyond what you did in high school, you're behind the curve. There's absolutely no reason to not have *any* marketable skills by that point. Fix that.\n\n>starts pay at $40k\n\nAlso a bit overly demanding. Maybe it might make sense for high CoL areas like the Bay Area or something like that (can't speak to the job market in those areas, either). Being able to get by on ~$25-$30k/yr *starting* is a lot more sensible, especially at such an entry level position where there are some solid early promotion opportunities.\n\n>what kind of full-time secure job\n\nRight off the top of my head, decent full-time careers that I've seen **first-hand** that take people on with unfinished college degrees:\n\nAdministrative workers, secretaries, and sales representatives - just gotta have the people skills and gusto to succeed\n\nProgrammers - just make sure you have a solid programming portfolio\n\nMost things IT - knock out some quick certifications if you need to and have the knack for it. I expect that IT is only even more in demand due to all the changes needing to be made to accommodate distance work.\n\nTechnicians/operators - I've most commonly seen it from engineering school dropouts that built up their hands-on experience on their own time",
                                  "author": "darkapplepolisher",
                                  "created": 1596392270,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fzwz6g8": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwz6g8/",
                  "text": "I dont even intend to look for a good paying job now, but next year in 2 years max.",
                  "author": "Klokikus",
                  "created": 1596230755,
                  "upvotes": -6,
                  "replies": {}
                }
              }
            },
            "fzx94c7": {
              "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx94c7/",
              "text": "I see relative comments to this frequently on here, and I find it peculiar. For me personally, I study so much better at home, and my grades went from a B average to an A average because of online. It does suck that they made your exams more difficult, but do you think there's room to grow in the \"studying in a new environment\" area?",
              "author": "WCPitt",
              "created": 1596233967,
              "upvotes": 19,
              "replies": {
                "fzz1w3k": {
                  "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzz1w3k/",
                  "text": "Wouldnt make a difference to be honest. The thing is online classes suck cause we are from home, when we are in classroom its really different, the atmosphere, you have more concentration and you are \"forced\" to stay there and listen. When Im home and listen to classes it sucks, the audio lags too, the method just doesnt work here.",
                  "author": "Klokikus",
                  "created": 1596278945,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fzwroh1": {
          "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwroh1/",
          "text": "Great comment. That is all",
          "author": "Legalize_Sun_Chips",
          "created": 1596228025,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fzwohrn": {
      "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwohrn/",
      "text": "As a student, I wholeheartedly agree with this. If ur financially not okay, cut down on some classes but whatever u do, don't unenroll. Keep at it and the virus is bad, yes. But with proper hygiene protocols, we can get through this.",
      "author": "mint1025",
      "created": 1596226472,
      "upvotes": 16,
      "replies": {}
    }
  },
  "updated": 1634051956
}