{
  "sid": "ptxkai",
  "link": "/r/college/comments/ptxkai/proctoru_questions_i_need_a_mirror/",
  "title:": "ProctorU questions. I need a mirror.",
  "text": "I’m currently taking Physical Geology (GLY2010C) and my first exam is coming up. We have to use proctorU to monitor our sessions while we test. \n\nWhen I looked at the rules and recommendations it stated that I needed to bring a reflective surface (like a mirror) with me into the room I plan on testing in. I asked the proctorU chat if there was any requirements about the mirror (how big, where it is, etc) but the person I chatted with simply told me “you need a reflective surface” over and over without answer the question. \n\nHave y’all dealt with the mirror requirement? What size worked? How did you position it? I’m sorry to ask stupid questions but ProctorU is no help and I don’t want the session terminated for stupid shit.",
  "author": "SCOTUS17",
  "created": 1632410550,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdzki41": {
      "link": "/r/college/comments/ptxkai/proctoru_questions_i_need_a_mirror/hdzki41/",
      "text": "When I had to use ProctorU, I had questioned this. You basically just need to show that there is nothing on your computer around your webcam, so anything that would clearly prove that would work. I’m pretty sure because I wasn’t given clear directions ahead of time that they offered the option of the back of a cd or dvd. \n\nThis is after having you physically turn with the computer (or webcam if you have a desktop) and scanning the entire room so the can make sure you have nothing posted to cheat. It’s an incredibly annoying process",
      "author": "ld2009_39",
      "created": 1632418067,
      "upvotes": 1,
      "replies": {
        "hdzq63h": {
          "link": "/r/college/comments/ptxkai/proctoru_questions_i_need_a_mirror/hdzq63h/",
          "text": "It’s pretty aggravating. But so is life.  Thanks for the help you’ve given me. It had seemed (due to my professors instructions) that I needed the mirror to in use the entire time I was taking the exam. With your answer and some google searches I understand it now! \n\nAny other ProctorU tips? Sorry, it’s my first time having to test with it.",
          "author": "SCOTUS17",
          "created": 1632420393,
          "upvotes": 1,
          "replies": {
            "hdzr98z": {
              "link": "/r/college/comments/ptxkai/proctoru_questions_i_need_a_mirror/hdzr98z/",
              "text": "It’s been a while, but I think just make sure to follow all their directions. Make sure there isn’t anyone coming into the room or talking, just so there aren’t any issues.",
              "author": "ld2009_39",
              "created": 1632420848,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdz4k7q": {
      "link": "/r/college/comments/ptxkai/proctoru_questions_i_need_a_mirror/hdz4k7q/",
      "text": "Uhh wtf? If I were you I wouldn't let that shit slide. I would simply tell them that I have to do homework on the go because I don't have a stable home to do my homework in. If proctoru wants to fight that I would gladly bring it up to the president and the dean. If they wouldn't help me I would take it further.\n\nProctoru can fuck off.",
      "author": null,
      "created": 1632411484,
      "upvotes": 3,
      "replies": {
        "hdzgy3c": {
          "link": "/r/college/comments/ptxkai/proctoru_questions_i_need_a_mirror/hdzgy3c/",
          "text": "You should also go to congress and to the newspapers.",
          "author": "TheRightSideOfDumb",
          "created": 1632416606,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634055981
}