{
  "sid": "qbn7mg",
  "link": "/r/college/comments/qbn7mg/living_with_girlfriend/",
  "title:": "Living with Girlfriend?",
  "text": "I'm struggling with a choice, do I live with my girlfriend of 6 years, or do I live with three other teammates of mine on the hockey team. I'm a productive guy and i know being with my girlfriend would be better, and I want that. However, with the hockey guys the location is within walking distance to my classes and could be fun. Not sure what to do thats why I'm on reddit.",
  "author": "Dudeman989898",
  "created": 1634684218,
  "updated": 1634750297,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhamdaf": {
      "link": "/r/college/comments/qbn7mg/living_with_girlfriend/hhamdaf/",
      "text": "Can you still be productive living with your teammates?  If you don’t think it’ll be detrimental to your academics, I would 100% stay with your teammates. Fun, close to campus, save you time and possibly closer to study areas on days teammates are rowdy. \n\nLet’s say your gf is the one. I think having a little bit of distance and allowing yourself the experiences of roommate’s, etc would benefit long-term. 10 years from now, are you okay with “I wished I had spent every year during college with my gf” or “I wished I had taken the time to branch out and enjoy college a little with roommate bonding, etc?”",
      "author": "TwoSuns168",
      "created": 1634684908,
      "upvotes": 7,
      "replies": {
        "hhanv4y": {
          "link": "/r/college/comments/qbn7mg/living_with_girlfriend/hhanv4y/",
          "text": "Yeah thats what I've been thinking, got my whole life to live with the girlfriend.",
          "author": "Dudeman989898",
          "created": 1634685615,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhamef0": {
      "link": "/r/college/comments/qbn7mg/living_with_girlfriend/hhamef0/",
      "text": "If it were me, I’d live with the girlfriend. That’s a pretty long relationship. And it seems like a good move to do. You’ll spend time with your team probably a lot when you practice & play games and are on the road, but you might not spend as much with your gf. I think living with your team might exacerbate that a little more. Idk tho, idk you at all or anything about your thoughts here in this matter, just spewing hypotheticals haha. That’d be where my head would be at tho. Teammates do sound more fun tho. Sounds like a recipe for parties & good times.",
      "author": "pekkalacd",
      "created": 1634684923,
      "upvotes": 5,
      "replies": {}
    },
    "hhaouhm": {
      "link": "/r/college/comments/qbn7mg/living_with_girlfriend/hhaouhm/",
      "text": "You have your whole life to live with your girlfriend, and only a few years to live with your best friends",
      "author": "spinchrecall",
      "created": 1634686069,
      "upvotes": 3,
      "replies": {}
    },
    "hhapkzx": {
      "link": "/r/college/comments/qbn7mg/living_with_girlfriend/hhapkzx/",
      "text": "[removed]",
      "author": null,
      "created": 1634686407,
      "upvotes": 1,
      "replies": {}
    },
    "hhary9t": {
      "link": "/r/college/comments/qbn7mg/living_with_girlfriend/hhary9t/",
      "text": "Roommate bonding is nothing to the longterm friends you'll make in your desired field of work. Sure both your girlfriend and roommates can provide a space to work, but which one is more beneficial to the longterm?",
      "author": "kadoochie",
      "created": 1634687487,
      "upvotes": 1,
      "replies": {}
    }
  }
}