{
  "sid": "q5mfdq",
  "link": "/r/college/comments/q5mfdq/question_pertaining_on_how_financial_aid_work_in/",
  "title:": "Question pertaining on how financial aid work in collage.",
  "text": "This is probably not the right subreddit to ask this question but I'm asking this because i have no one else to ask and have no clue of how it works and was hoping to get some information from someone that have done it in the past.\n\n\nI recently applied FASFA for 2022-23 and it has already been a week since i have done it. In the application, i specified three collages that I’m planning on going. I haven’t heard anything back from any of the schools and from fafsa yet and i do not know how long the process would take as this is my first time doing this therefore, my question is:\n\nWhat are the next steps in the process? Does the school’s financial aid office notify me individually whether I’m eligible for aid or not? Do i have to reach out to the school’s financial aid office to discuss about my eligibility? Also on the EFC it says \"000512\"what does that number represent ? Is it like a copayment that i have to pay in order to get an aid from the government? In addition, at the bottom of the email confirmation it says: Based on the eligibility criteria you may be eligible for the following:\n\n\nPell Grant Estimate - $5,945.00 \nDirect Stafford Loan Estimate - $9,500\n\nDoes the amount specified in the pell grant is that the amount that the government is willing to pay for my tuition(AKA free money)? I'm assuming the second one is how much loan i could qualify for but i could be wrong. \n\n\nAnyone here experienced in this, please give me a breakdown of how everything works from the submitting the application to finally getting approved for aid to pay for collage. \n\n\n\nAny words would be appreciated.\n\n\n\nThanks in Advance.",
  "author": "bossmanseventyseven",
  "created": 1633919973,
  "updated": 1634083043,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hg6mx2t": {
      "link": "/r/college/comments/q5mfdq/question_pertaining_on_how_financial_aid_work_in/hg6mx2t/",
      "text": "You likely won't get financial aid packages until about February, so don't fret.\n\nThe EFC stands for estimated family contribution, or how much the government thinks you and your family should pay towards your education.\n\nYou're correct about Pell Grants and Stafford Loans. Grants are free money, and Stafford Loans are direct from the government and have to be paid back.\n\nKeep in mind that those are only estimates and don't factor in fin aid the school itself will offer.",
      "author": "mrbmi513",
      "created": 1633920557,
      "upvotes": 2,
      "replies": {}
    }
  }
}