{"sid": "i5eu35", "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/", "title:": "My college just said all campus facilities will be closed, and off campus students are discouraged from using their apartments", "text": "I have a lease for this upcoming school year, now all campus facilities shut down meaning I won’t have a job and little reason to even be there\n\nSo my school just announced that instead of running a hybrid model and having campus facilities open everything will be remote, and there will be no access to dining halls or any campus facilities. This leaves me with little reason to go to my college town. I’m really lost on what I should do regarding my lease, as it feels like a huge waste of money paying 700+ each month for a place I don’t even need. The place does allow subletting, and I think my roommate is still staying. Any advice on what I should do?", "author": "SoakaTheCorka", "created": 1596810632, "retrieved": 1632947743, "over_18": false, "upvotes": 875, "upvote_ratio": 0.99, "comments": {"g0u2l9j": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0u2l9j/", "text": "I am in a similar predicament however my immunocompromised parents do not trust covid-19 tests/and will never let me go back home/visit till the virus is \"over\" or at least subsided.   \n\n\nA couple of weeks ago I signed a lease for an apartment next to our campus in hopes of using campus facilities. :(", "author": "mintroselily", "created": 1596927014, "upvotes": 1}, "g0reou3": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0reou3/", "text": "If you and your roommate each pay separately on your own leases you could just straight up leave - basically accepting eviction and just not pay. Not an amazing option but it is an option. They could report you to credit agencies though.", "author": "GennaroIsGod", "created": 1596862619, "upvotes": 2}, "g0radxw": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0radxw/", "text": "What state? I’m afraid!", "author": null, "created": 1596859612, "upvotes": 1}, "g0qpv3o": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qpv3o/", "text": "I would recommend subletting, if you break lease it could cost you the rest of the leases rent so I'd be careful", "author": "Skoboviik", "created": 1596847509, "upvotes": 2}, "g0qjwi2": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qjwi2/", "text": "That’s why I waited the day before the due date to finalize my classes", "author": "TxHerrmann", "created": 1596844206, "upvotes": 1}, "g0qjjrb": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qjjrb/", "text": "As far as your landlord is concerned your lease has nothing to do with the school. You signed a contract to rent an apartment. Whether you need to be there or not isn’t really relevant. It’s like leasing an apartment, but being gone on travel for work 95% of the time. It blows, blame the state and the pandemic? Some might find it easier to get school work done away from home even if it is all remote.", "author": "worried_alum", "created": 1596844011, "upvotes": 7}, "g0qigip": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qigip/", "text": "It might be good to be on your own and focus on school. No matter your home life, if your Roomate is still going why not? It’s strange timesc", "author": "komdothedragon96", "created": 1596843419, "upvotes": 2}, "g0qh6fm": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qh6fm/", "text": "When did you sign the lease?", "author": "DusLurkMaster", "created": 1596842732, "upvotes": 2}, "g0q6hy8": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q6hy8/", "text": "I was THIS close to just letting myself get evicted from my student housing apartment. I got lucky that a friend of one of my roommates wanted to live with her.", "author": "Idrahaje", "created": 1596837124, "upvotes": 6}, "g0q2fre": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q2fre/", "text": "A fellow UMasser I see. I’m staying in my off campus room. I love the town of Amherst, it’s my home and permanent address now! I’m sure a lot of your off campus friends will be back and fun times will be had. get away from the family for a while!", "author": null, "created": 1596835090, "upvotes": 12}, "g0pzsss": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pzsss/", "text": "Get some of your tuition back if they are going ll remote ad just try to rent it out or see if landlord makes an exception cause Covid-19", "author": "alexrider003", "created": 1596833884, "upvotes": 2}, "g0pwu63": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pwu63/", "text": "Bait and switch! Classes were supposed to start for me in 10 days and they just flipped them all virtual a couple days ago. I signed a 13 month lease on 8/1. Bullshit. I’ve gone through all of the stages of grief in the last 6 days hahaha", "author": "merrycrasmass", "created": 1596832435, "upvotes": 22}, "g0pq8w0": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pq8w0/", "text": "UMass? Yeah that email caused quite a bit of stress for my friends in off-campus housing", "author": "official_prabhu", "created": 1596829263, "upvotes": 13}, "g0po754": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0po754/", "text": "Is there not a break clause in your lease? Worth reading through your residence contract. You may lose any rent you've already paid and maybe a deposit but it's better than nothing.\n\nUsually there is if you withdraw from the course within 14 days of the start date, at least in the UK.", "author": "Elastichedgehog", "created": 1596828293, "upvotes": 6}, "g0pljw6": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pljw6/", "text": "IMHO, if coronavirus spread is to be stopped, there would have to be a way to break student housing leases. At my school, nearly everyone besides freshman lives in student apartments unaffiliated with apartments. Regardless if classes are in person or not, asking a kid to pay $800 a month and not live there and have fun is unrealistic. It almost seems moot if classes are in person or online, if kids have apartments they have to pay for they will go.\n\nIt's nearly impossible to break student leases where I go to school, and who's going to sublet knowing classes will be online?", "author": "blackwhitetiger", "created": 1596827044, "upvotes": 19}, "g0plg2x": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0plg2x/", "text": "I hate that schools are waiting so last minute to announce this stuff. I had to give like 2 months notice about whether I’d be renewing my lease for September.", "author": "TheConcerningEx", "created": 1596826992, "upvotes": 75}, "g0pihue": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pihue/", "text": "If your college has apply for the covid relief aid to help reimburse your money loss. It is nonsense that these colleges are waiting until the last second to make this call.", "author": "kello-bello", "created": 1596825579, "upvotes": 79}, "g0pg26g": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pg26g/", "text": "UMASS ?", "author": "ezaf_winter", "created": 1596824439, "upvotes": 86}, "g0pczid": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pczid/", "text": "I would try to get a subleaser for the fall semester. There are probably going to be quite a few on-campus students who'll be interested either because they have jobs in the area or they just can't study at home. You may have to be willing to give them a bargain on rent though because a ton of people will also be looking for a subleaser.", "author": "BigHeartBigShy", "created": 1596822990, "upvotes": 28}, "g0p56yt": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0p56yt/", "text": "Maybe see if you can break the lease. May cost a little bit but it would be far cheaper over the long run. Maybe the landlord will show a little mercy and not charge (not likely, but possible).", "author": null, "created": 1596819425, "upvotes": 407}, "g0oy0fc": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0oy0fc/", "text": "What state is this?", "author": "PillowsTheGreatWay", "created": 1596816057, "upvotes": 35}, "g0olzj8": {"link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0olzj8/", "text": "[deleted]", "author": null, "created": 1596810922, "upvotes": 56}}}