{
  "sid": "qprwb7",
  "link": "/r/college/comments/qprwb7/constant_cycle_of_wanting_to_drop_transfer_or/",
  "title:": "Constant cycle of wanting to drop, transfer, or just stay here",
  "text": "It’s like mood swings. I got here 3 months ago and I’ve never been happy here. In fact miserable. \nIt’s a maritime college (small school) so it’s pretty boring. I heard from friends that seem to be having the time of their lives.\nI consider transferring but I don’t know if I could bring myself to do it. My college of choice would be decided based on who I know that goes there, which I know you’re not supposed to do. I can’t help it, it would even be subconscious if I tried, I’m sure.\nThat isn’t even a problem if I can’t find another major… I’ve spent hours scrolling through many colleges websites looking at undergrad programs and nothing interests me.\nMy friend said he’s doing computer science, so he can do contract work and not have to work that often. The ONLY reason I came to a maritime school was to work as little as possible. If you don’t know a lot of the jobs are rotational… 2weeks on/off. 6 months vacation sounds pretty nice right?\nBut why bother with all this school when I can just go straight to working on tugs. But what if I don’t like it? Then I’m fucked, no college degree, nothing.\nThe only thing that I’m passionate about is music and art. But I would never major in that.\nThe only major that truly interests me is psychology/philosophy. I think about how the mind works all the time. I love dreams and psychedelic experiences. \nYet… if I did psychology, where would I do it? Also, what the fuck would I do afterwards? I can’t name one psychology/philosophy job besides “psychologist” which sounds boring and “philosophy teacher.”\nFuck.\nEdit: I also took psychology in high school and it was one of my least favorite classes. Can’t remember one thing I learned and fucked around the entire year. But I’m really into how the mind works, it interests me just thinking about my current situation and why I’m thinking the way I am.",
  "author": "303ormore",
  "created": 1636419344,
  "updated": 1636655299,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hjxt14p": {
      "link": "/r/college/comments/qprwb7/constant_cycle_of_wanting_to_drop_transfer_or/hjxt14p/",
      "text": "It’s not easy in them streets without that piece of paper you pampered white boy",
      "author": "MutedInvestigator847",
      "created": 1636468187,
      "upvotes": 1,
      "replies": {}
    }
  }
}