{
  "sid": "qoa26h",
  "link": "/r/college/comments/qoa26h/should_i_study_accounting_at_university/",
  "title:": "Should I study accounting at university?",
  "text": "I’m thinking about degree choices and there are so many pros to getting an accounting degree however I know for a fact I do not want to be an accountant but I know that accounting knowledge is very important in the business world. I hope to own my own company someday (in fashion or real estate). However I’m worried that accounting is very dull and tedious, lacks creativity and I’ll just be miserable for 3/4 years when I could be doing a more creative business course like marketing. There are more pros to accounting than marketing tho so idk if I should just suck it up and get it done and then reap the benefits of doing so",
  "author": "kayavix",
  "created": 1636235165,
  "updated": 1636655820,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hjm6duw": {
      "link": "/r/college/comments/qoa26h/should_i_study_accounting_at_university/hjm6duw/",
      "text": "I don’t think there’s anything wrong with getting a marketing degree. Maybe there’s not as many jobs or as high of earning potential but there still definitely are plenty of jobs and earning potential. Your happiness also matters. As long as you aren’t getting a degree with virtually no or very few job outcomes. I think marketing is okay.",
      "author": "ilikecacti2",
      "created": 1636244112,
      "upvotes": 2,
      "replies": {
        "hjmkse4": {
          "link": "/r/college/comments/qoa26h/should_i_study_accounting_at_university/hjmkse4/",
          "text": "I mean I was surprised that someone with a marketing major would actually get a job, since my dad often looks down on that major and say that easier majors don't get jobs.",
          "author": "malarkeyasian",
          "created": 1636250999,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjn740e": {
      "link": "/r/college/comments/qoa26h/should_i_study_accounting_at_university/hjn740e/",
      "text": "No",
      "author": "ilovedasha",
      "created": 1636263680,
      "upvotes": 1,
      "replies": {}
    },
    "hjoxdaw": {
      "link": "/r/college/comments/qoa26h/should_i_study_accounting_at_university/hjoxdaw/",
      "text": "If you want to own your own company someday, you should have a basic understanding of accounting. Marketing and Business degrees require the basic financial accounting course and finance. Even if you outsource the accounting in your future company, understanding how finance works to show how your company is doing is essential. \n\nYou can always minor in accounting? But again - if you do Marketing, you'll have to take a basic accounting course, so that may be sufficient for your goals.",
      "author": "metalheadplanner",
      "created": 1636303632,
      "upvotes": 1,
      "replies": {}
    }
  }
}