{"sid": "i1cxth", "link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/", "title:": "Thinking about taking a year off?", "text": "CC dept chair / faculty here. Enrollment is way down, understandably. I am fully aware of the reasons why students are reluctant to go back to school. Believe me, no one is happy with this situation. Teachers hate it, admin is sleepless trying to figure out problems they didn't know existed. And of course, as always, students are the ones stuck in the middle. \n\nHere's one issue, though. Next year, let's say all is well and campuses open up. If everyone from fall 2020 waits to go back in fall 2021, there's not enough seats in the world to handle that capacity. Classes will fill immediately, and many students will be SOL. If you are already on a degree plan, take whatever classes you need to stay on it. Don't wait. Forfeiting your spot and having to re-enroll or worse, having to re-apply, is going to really set you back. At my school, our returning students (who lived through our emergency spring classes moved online) came back for fall quickly. They know it's not as bad as what people may think. \n\nIf you're a new college student, take online classes. It sucks, we're all aware it sucks. We're trying to offer both asynchronous and synchronous online classes to help meet student needs. If you find yourself not engaging with the course, reach out to the instructor. Teachers, well, we're often not aware there's an issue until someone brings it up. So bring it up. Remember that college teachers are subject matter experts, we're not pedagogy experts. \n\nDo what you need to do, take care of yourselves and don't put more pressure and anxiety on yourself. This is a temporary, albeit long, problem we're all working through. My hope for all of you is that you still attain your educational and career goals despite living in a global pandemic. Colleges are trying to help. It's not perfect, but it's still there.", "author": "acm2033", "created": 1596220681, "retrieved": 1632802547, "over_18": false, "upvotes": 854, "upvote_ratio": 0.93, "comments": {"fzzzvcp": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzzvcp/", "text": "Finished community college in the spring heading into a university now (stony brook), Still moving forward at full pace but this whole shit sucks\n\n\nI honestly miss campus life a bit, being there from 8am to 9pm, starbucks religiously, living in the library for days at a time. It's not the same doing it in my bedroom at 33 with my parents hanging out down the hall. I miss the quiet spaces on campus and also I [[[[[[[LOVE]]]]]]] seeing grounds that are meticulously maintained. Something about the scenery does it for me (NY)", "author": "DDP886", "created": 1596300943, "upvotes": 2}, "fzzyndz": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzyndz/", "text": "Since when is it the responsibility of the students who are paying thousands or tens of thousands of dollars and going into debt to account for the awful response of their college? Imagine going into so much debt it follows you for decades for some fuck to say \"guys just go into debt for your shit online classes or you won't get them next year\" is pretty fucking pathetic in my opinion, why would anyone pay to be told that?\n\nAlso I would like to add \"students coming back because they realize it's not that bad\" is utter bullshit, you can't just widely state \"the students know better.\" When they for sure fucking do not know better. I guess I'm just confused as to why it's the students responsibility to respond to the ineptitude of their administration. Why should we be the ones handling the aftermath of \"not having open classes in the spring semester\" as if it's somehow the responsibility of the people going into debt to also plan for the admins sake or the college's sake.\n\nIf OP could prove any of the statements they made maybe I'd be a little more convinced.", "author": "Darthtrong", "created": 1596300309, "upvotes": 4}, "fzzuftb": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzuftb/", "text": "I took a gap year before coronavirus, I had a good experience, but I wrote [this](https://www.reddit.com/r/college/comments/i1u8or/things_to_be_aware_of_before_taking_a_gap_year/) post about the downsides of taking a gap year and why it might be a particularly bad idea this year. There are a lot of financial, educational, social considerations in taking one", "author": "BudgetPin9585", "created": 1596298078, "upvotes": 2}, "fzziqy1": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzziqy1/", "text": "Thank you for giving this perspective. I have been telling my cousin to wait until fall 2021, but now I might look into the local CC with her for some of her generals.", "author": "Shownkindness", "created": 1596292226, "upvotes": 2}, "fzzgli2": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzzgli2/", "text": "That’s also why 2025 is going to be a crazy year for graduation — so many people.", "author": "officiakimkardashian", "created": 1596290942, "upvotes": 3}, "fzz1qjn": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzz1qjn/", "text": "Ive seen the same stupid advice telling people to take a year off. Thank god not everyone has the same view. Like i understand taking a year off to travel but to sit at home waiting, to avoid using online classes christ.", "author": "astonaidan", "created": 1596278780, "upvotes": 4}, "fzyosc0": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyosc0/", "text": "I got an internship offer related to my field..and i am an upcoming junior who goes to pennstate (huge ass campus). I dont know what to do in this case. All my classes are online except chem lab (hybrid) but after my internship experience this summer, i dont even want to go to grad school. I kinda want to transfer my school and do PharmD instead of biochem. What should i do in this case? Take a year off and do internship and think/plan my future? Or just go back to school and graduate asap?", "author": "hannah_gg", "created": 1596265282, "upvotes": 2}, "fzyi6r3": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyi6r3/", "text": "This is good advice, thank you", "author": "adalaza", "created": 1596259502, "upvotes": 1}, "fzyfpls": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzyfpls/", "text": "Begone admin! \n\nI mostly kid but tbh I don’t care and don’t want to hear any manipulative stories from college admin who are only prioritizing money. The whole system is a joke.", "author": "peterisfrosty1", "created": 1596257578, "upvotes": 8}, "fzy79w8": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy79w8/", "text": "My daughter is a sophomore this year. One of the reasons she enrolled in university was for the on campus experience, including talking with her professors, the chance to explore her career options and intern, and yes, to socialize since she is shy and introverted and only recently came out as queer so she was just starting to explore life with that identity. She’s not getting any of those experiences sitting in her room in front of a screen, and has to a big tuition anyway. I’m devastated at what she is missing out on.", "author": "Janknitz", "created": 1596251799, "upvotes": 4}, "fzy30hh": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy30hh/", "text": "Look into grants offered for COVID as well. I got laid off I immediately took a full course load and was eligible for a grant that covered the cost of class (I’m at a CC). As a workaholic, I think those classes kept me sane during the shut down. It gave my day structure. I would definitely recommend staying online if it works for you and your situation.", "author": "FitLotus", "created": 1596249119, "upvotes": 2}, "fzy2buu": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzy2buu/", "text": "Thank you for making this post as a faculty member, it makes students like me feel a little less stupid about choosing to go to college during a time like this. If you're posting here, you clearly care about this learning generation, and that means a lot. Thank you again.\n\nEDIT: 69th comment, *nice*", "author": "ChristopherJngs", "created": 1596248709, "upvotes": 3}, "fzxy49v": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxy49v/", "text": "Ever since we’ve been online it’s been a terrible experience for me. It’s sucks because this could go on for who knows how long", "author": "PatrickEmerem", "created": 1596246155, "upvotes": 2}, "fzxdvd2": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzxdvd2/", "text": "As someone who graduated this past May I would say that I did not feel like I learned much once class went online, and the tuition I paid for \"campus amenities\" was no longer benefitting me. Many of my professors from previous years barely knew how to use blackboard and I'm so glad I was not in their classes when COVID hit. In my experience the value of college in my last semester was not even remotely equivalent to the value of my first 7. That's just my opinion though", "author": "Thor8453", "created": 1596235610, "upvotes": 9}, "fzx99ov": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx99ov/", "text": "If you care about quality of education I would take this with a grain of salt. Sure, it makes sense if you’re just trying to get your degree. But if you’ll be studying in a bad home situation, won’t have access to facilities relevant to your major, and/or don’t think the actual education you’re receiving is as worthwhile online, then take a year off. Do something more meaningful with your time. \n\nIt’s not a rat race to get your degree and get into the workforce, make the decision that gets you the best education possible.", "author": "McNuggets33", "created": 1596234015, "upvotes": 33}, "fzx95yk": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx95yk/", "text": "I'm not paying $20k to to live in a dorm that I may be kicked out of, risking my families health by people who don't take it seriously, or wasting time on inadequate classes.", "author": "1kiki09", "created": 1596233982, "upvotes": 10}, "fzx6eok": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx6eok/", "text": "[deleted]", "author": null, "created": 1596233039, "upvotes": 20}, "fzx5rd1": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx5rd1/", "text": "do yourself a favor and take a gap hear", "author": "grubbycoolo", "created": 1596232822, "upvotes": -5}, "fzx568j": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx568j/", "text": "A problem with taking a year off is that sometimes it ends up being more, and eventually it is hard to get back into college. At least that's what I personally experienced.", "author": "TheLazyPanda", "created": 1596232626, "upvotes": 10}, "fzx4x93": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx4x93/", "text": "I don’t mind the online classes idk why everyone’s buggin. Like yeah it sucks but I want to graduate early or on time. No delays. No breaks. Burnout coming soon.", "author": "imagineer_17", "created": 1596232543, "upvotes": 6}, "fzx2q32": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzx2q32/", "text": "CC tutor / adjunct / lecturer and administrator of 10 years here. \n\n> there's not enough seats in the world to handle that capacity. \n\nI'm skeptical about this take.\n\nI've seen plenty of autumn terms with sudden high enrollments. Departments simply hire more adjuncts (who are cheap and eager to leap into the wood chipper for a pittance and the false promise of a long-term contract) and increase loads for existing faculty. As we see faculty being squeezed now, they have no leverage to refuse.\n\nWhat's stopping colleges from doing the same thing F21? Or, they can hire back all the adjuncts they're cutting now or hire all the fresh PhDs. \n\nColleges will be ecstatic to make up their lost profit. There's no way they'll let that business opportunity pass them up.", "author": "brownidegurl", "created": 1596231831, "upvotes": 5}, "fzwxhvd": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwxhvd/", "text": "I took one class this summer semester. All online. The workload was like taking 3 classes online. It was annoying, but the professor made time for us every week. I didn't need any help, but it still sucked ass. I cannot fathom what hell awaits us in the fall. May there be mercy on us all going to school in fall.", "author": "swollemolle", "created": 1596230236, "upvotes": 16}, "fzwwvj9": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwwvj9/", "text": "So now not only are school tuition rates not decreasing for the online course delivery, but now we're essentially being blackmailed by universities saying if we don't go back then we won't have a spot next year...", "author": "yobatman12", "created": 1596230053, "upvotes": 8}, "fzwwcvd": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwwcvd/", "text": "Alum from a 4-year uni here. You're post is interesting and something I haven't really considered...renewed interest in college if/when covid-19 situation is scaled back. For a student who wants to take a break, taking 1 or 2 classes to continue registration, is probably a good idea. Also keeps the degree plan the same.\n\n>Colleges are trying to help. It's not perfect, but it's still there.\n\nThis is the part you lose me on. From what I've seen from the university I went to, they are fumbling, big time. Their key strategy is asking every student to sign a pledge, it essentially says don't come to campus if you're sick. Easier said than done. When someone asked during a town hall how attendance & make-up would be handled, the provost responded with: it will be up to each student to coordinate with each professor. At least when I was in school, they were EXTREMELY rigid about certain aspects of the courses (such as no make-up tests, for any reason).\n\nHow can a student agree, in good conscience, to stay home if they are sick when the university won't support them in making up the associated course work?", "author": "monkeyman88956", "created": 1596229914, "upvotes": 58}, "fzwv1se": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwv1se/", "text": "What if I am only planning on taking a semester off and still taking one class online through a community college? I not a big fan of online classes, despite having taken a few, but I currently have a bit of flexibility as I was already intending on taking a fifth year with the ability to take an internship on semester in there (just now I won't have that flexibility). Its too late for me renege on my decision, as I have already notified my school and my scholarship foundation (I have a full tuition + housing scholarship). I was going to take this semester to do some self learning and work on things that could help me get future internships and such. I know there is a chance that spring semester will be roughly the same as this fall, but I'll deal with it if it comes to that. I did give up my spot in two classes where I got instructors that I wanted, so that kind of sucked, but I can hopefully try to get them next semester.", "author": "M477M4NN", "created": 1596229545, "upvotes": 8}, "fzwucyo": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwucyo/", "text": "A lot of people don't realize that when you stop going to school, it can be SUPER hard to start back up. A lot of the kids I see who are deferring are sadly never actually going to step foot on a college campus again.\n\nTaking the minimum class load, easy classes, and maybe a CLEP Exam. Transfer to a close by/cheaper School. Find a school that fits what you like. But don't stop!\n\nA bad semester is worth more than no degree at all!", "author": "Javret", "created": 1596229317, "upvotes": 9}, "fzwt2au": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwt2au/", "text": "Be wary of your financial aid! Just remember that!", "author": "Unreal_Ncash", "created": 1596228697, "upvotes": 66}, "fzwsz46": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwsz46/", "text": "then hire more instructors, jesus christ", "author": "eilig", "created": 1596228652, "upvotes": 5}, "fzwsgq8": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwsgq8/", "text": "I would say it really depends. As someone who graduated in spring I have a pretty different take on it. Especially given a lot of schools' administrators really don't care about their students right now, they care about their bottom line above all. I've seen too many predatory housing contracts put out by schools (among other notices) to believe anything else.\n\nMost students rely on service jobs while in college and for many they also rely on them after they graduate until they get something better, and the service industry has been completely decimated by COVID. If you're a freshman this year (and honestly most sophomores with a ton of pre-reqs left) and you have to take out loans, go to a community college closer to home and then live at home while taking classes. Its not glamorous, but you're not getting the on-campus experience anyway so why pay for it. Especially, if you can, continue at your high school job, again it sucks but there's no reason to give it up since you will struggle to have any employment at this point.\n\nIf you're a senior, just finish. It sucks that this is how your last year will be spent (I know I defended my thesis the Friday before everything closed) but you're in a place with few options. Internships, fellowships, and other ways that you could spend the time have all but disappeared at this point and the ones that still exist have gotten super competitive. You will also be much better off with a degree than just being able to put \"some college\" on your employment applications, especially since you have to start paying back your loans 6 months after the end of the last semester you were in college.\n\nIf you're a sophomore or junior and you're in your major it really depends on what you are comfortable with. If you have loans and you can't afford to start paying them back right now, then you have to continue on with education no matter what. Even if you go part time, keep those loans in deferral status so you don't get hit with payments that you can't make. If you default on the loans, you won't be able to go back until you get the loans out of default. If you could start paying back your loans or you don't have any loans then do whatever you feel comfortable with. If you don't like online or hybrid classes, then take time off or take the fewest courses you need to stay enrolled and that won't mess up your degree plan too badly. The reality as I see it that schools are going to have to adjust the number of course sections in a year or two, or whenever COVID ends and enrollment goes back, or students just won't go back anyway. Most schools rely on adjuncts anyway so they can pretty quickly and easily add a section here and there no problem.", "author": "squirrel8296", "created": 1596228391, "upvotes": 35}, "fzwrb6e": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwrb6e/", "text": "Would this apply to people withdrawing from their current Uni’s and going to CC for a year? I was literally gonna withdraw from my Uni today and now I’m confused as to what to do :(( I thought it would be smart to save money this year", "author": "bobbyjoemamma", "created": 1596227856, "upvotes": 7}, "fzwqoxf": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwqoxf/", "text": "That’s a good point, I never thought about that. I’ll make sure I enroll as soon as I can.", "author": "fufe25", "created": 1596227546, "upvotes": 2}, "fzwpoo7": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwpoo7/", "text": "Also...it will be hard to get a good job *during a pandemic*. This is the ideal time to go to school and work towards a degree.", "author": "Cantelope_Whisperer", "created": 1596227085, "upvotes": 201}, "fzwphb1": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwphb1/", "text": "As usual, take this with a heavy grain of *varies from school to school*.\n\nIf your school isn’t taking the steps it needs to, to ensure your success this upcoming year/semester, taking a semester off is always better than failing a semester’s worth of classes. \n\nNone of our reddit posts can make a decision for you, talk to your family and advisors before making any important decisions.\n\nIf you can confidently say you can handle this semester, you should probably stay enrolled. If not, then don’t listen to us about it.", "author": "Xystem4", "created": 1596226981, "upvotes": 516}, "fzwohrn": {"link": "/r/college/comments/i1cxth/thinking_about_taking_a_year_off/fzwohrn/", "text": "As a student, I wholeheartedly agree with this. If ur financially not okay, cut down on some classes but whatever u do, don't unenroll. Keep at it and the virus is bad, yes. But with proper hygiene protocols, we can get through this.", "author": "mint1025", "created": 1596226472, "upvotes": 15}}}