{"sid": "ptx2j9", "link": "/r/college/comments/ptx2j9/people_who_graduated_with_a_gpa_less_than_30_why/", "title:": "People who graduated with a GPA less than 3.0, why don't you just get a second bachelor's degree to get a second chance of success in life??", "text": "I understand that this is not a good option at times but you can graduate college with like a 2.3 GPA or something. Most employers and grad schools will look at that GPA and your chances of success are very low. If you take a second bachelor's degree, your old credits will transfer into the new one and it will take two years to complete the second bachelor's degree. Any thoughts?", "author": "Journeyman-3444", "created": 1632409162, "retrieved": 1632800838, "over_18": false, "upvotes": 0, "upvote_ratio": 0.18, "comments": {"hdzob9n": {"link": "/r/college/comments/ptx2j9/people_who_graduated_with_a_gpa_less_than_30_why/hdzob9n/", "text": "This is absurd. Even if you want to get into a PhD program, which in general are much more picky about GPA than employers, you could successfully do so by retaking just the relevant undergrad courses and then \"leveling up\" by getting a master's degree.  \n\nUsually to get a second bachelor's, most schools require that your major is in a different area than your first degree and if you want a career in what your first degree is in then obviously getting a second bachelor's won't be of much help. In all seriousness, most people who are in the situation you described either 1) get a job despite their bad GPA, 2) get a master's to demonstrate that while they started out weak, they eventually learned the relevant material and then built on it, or 3) realize that they suck at what they initially wanted to do and change careers. \n\nWith regards to the latter, even this group usually just takes relevant prerequisites plus a masters for the new career instead of getting a second undergrad degree. Why waste time on an undergrad degree when getting a master's is often quicker and worth more on the market?", "author": "HumanDrinkingTea", "created": 1632419622, "upvotes": 2}, "hdzgq4b": {"link": "/r/college/comments/ptx2j9/people_who_graduated_with_a_gpa_less_than_30_why/hdzgq4b/", "text": "1) It is really expensive and you are also not working full time at the same time.  SO it costs you money in 2 ways\n\n2) if you did not do particularly well then many places won't accept you or your credits.\n\n3) If you couldn't figure out how to college in 4 years, what makes you think another 4 years would be better.\n\n4) Your entire academic history in all classes schools and major is what people see, not just the last 2 years", "author": "TheRightSideOfDumb", "created": 1632416517, "upvotes": 1}, "hdzbc4z": {"link": "/r/college/comments/ptx2j9/people_who_graduated_with_a_gpa_less_than_30_why/hdzbc4z/", "text": "Uh, it depends on the industry you’re trying to work in. I know in tech, almost nobody cares and even if they did, Bootcamp/self taught grads/certs gainer aren’t going to find any jobs if that was the case.", "author": "VLRNON", "created": 1632414320, "upvotes": 1}, "hdz4ttw": {"link": "/r/college/comments/ptx2j9/people_who_graduated_with_a_gpa_less_than_30_why/hdz4ttw/", "text": "Lmao what? Dude you don't need a second degree to be succesfull in life 🤣🤣🤣 im a year away from finishing my criminology degree and I make more money than my parents via my online business.\n\nThis really is just a silly ass question. For one money is a factor, two not everyone has the time, three people need to take care of real life shit first before education.", "author": null, "created": 1632411596, "upvotes": 2}, "hdz1k6a": {"link": "/r/college/comments/ptx2j9/people_who_graduated_with_a_gpa_less_than_30_why/hdz1k6a/", "text": "GPA doesn't always matter after college. It matters if you're going to grad school, applying for some internships, and sometimes for your first job after you graduate, but once you have solid work experience your GPA is rarely an issue. \n\nFor most people, the cost and time associated with getting a second degree just because their GPA was low isn't going to be worth it.", "author": "hemehime", "created": 1632410223, "upvotes": 4}}}