{
  "sid": "pr2t42",
  "link": "/r/college/comments/pr2t42/considering_changing_my_major_or_dropping_out/",
  "title:": "Considering changing my major or dropping out completely due to advanced math",
  "text": "Hey all. I'm majoring in computer science and well, it's not what I thought it was.\n\nI knew I'd have to do some degree of math. That's fine, I thought. School has always come really easy to me. I never really had to try or study so when I started to take my Calculus 1 class, well I was in for a treat. \n\nI'm not sure what to do. I'm struggling really hard in Calc 1 and it could just be because of the professor/method of teaching but I just can't get it. I've heard calculus 2, discrete math, linear algebra, and differential equations are all extremely difficult and I don't know that I'm up to the task.\n\nThe reason I chose computer science is because I'm not sure what I'll end up wanting to do and computer science seems to be a very generic degree for pretty much anything in the tech field. \n\nIs there a degree I can switch to that maybe won't be so math intensive? Or am I overhyping the difficulty of these classes? Should I just drop out?",
  "author": "IceIceKoala",
  "created": 1632033141,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hdjys5p": {
      "link": "/r/college/comments/pr2t42/considering_changing_my_major_or_dropping_out/hdjys5p/",
      "text": "I think you could as a method of last resort switch to IT/MIS/CIS in a business school and not have to take as many math classes. But yeah, computer science will generally have calculus, discrete math, linear algebra, CS theory, algorithms, and maybe statistics as part of the curriculum.",
      "author": "postmaloneismediocre",
      "created": 1632112102,
      "upvotes": 1,
      "replies": {}
    },
    "hdhabz5": {
      "link": "/r/college/comments/pr2t42/considering_changing_my_major_or_dropping_out/hdhabz5/",
      "text": "Yo homie I’m in computer engineering at Purdue in calc 3. you can do it. I think they mean conceptually hard as in the idea of what a derivative and integrals mean rather than actually applying them. Imagine the first time you were learning algebra it was hard but then you just got used to that way of math, calc is the same thing. It’s really hard at first but once you grasp the idea of what it’s trying to achieve you get used to working with it and Calc 2 and 3 make even more sense. They’re still hard as balls ngl but so is programming and so is physics. If you like computer science you probably have the capability to understand these things. What about the calc is hard is it the memorizing of equations and symbols or is it more of the purpose of each equation and why they exist? A big thing that helped my understanding of a derivative and how it came from the difference quotient was my calc AB teacher explaining everything, so teaching could be an issue too.",
      "author": "onjahbrooo",
      "created": 1632069221,
      "upvotes": 1,
      "replies": {}
    },
    "hdfsc6f": {
      "link": "/r/college/comments/pr2t42/considering_changing_my_major_or_dropping_out/hdfsc6f/",
      "text": "Well, computer science is closest to math compared to all the other sciences (it is in the same branch of formal sciences). I wouldn't feel too bad dropping out, most CS students drop out simply because it's not what they expect. CS enrollees tend to think they'll learn about how computers work a bit, and mostly how to program. In reality you tend to learn about the science of computation and the consequences of teaching math to a rock. Seriously, math is EVERYTHING in computers. \n\nI'm not telling you this to scare you. I'm a CS major too and I really, REALLY love it. But you need to evaluate your relationship to math. Do you dislike math because it doesn't come naturally to you? Have you always struggled with it? Or do you dislike it because it has just become difficult? In college, you will study A LOT more. It's not unheard of to get real horrible grades your first semester, since it stops being so much about your natural intelligence and common sense abilities and more about your studying aptitude. So I wouldn't catch yourself short and just drop out, unless you realize that's what you want to do.\n\nTry to study, get tutoring, get help, that's my advice to you. See if you can really succeed in math if you try. If you can, then great! No real reason to drop out, it was just a studying issue. \n\nBut if you just have a bad taste for math, don't like it, don't think it's cool (which is so strange to me. In Calc 1 one of the first things we did was prove that acceleration was just a derivative of a derivative and that made me cum myself), then it seems like you got some soul searching to do. If I didn't know what I'd want to do, I'd probably take a wide variety of classes everywhere, to try to see what piques my interest. You really don't want to go through the motions and get a degree in just whatever. Try to see what you would be okay with learning about or doing for the next 40 years of your life. And if it is genuinely nothing, then it's fine to switch majors to something that will just make you money. Or to drop out and just do a trade. But do yourself the courtesy of doing a lil soul searching first, atleast for your first year. :)",
      "author": null,
      "created": 1632037674,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634054360
}