{
  "sid": "qf6cuq",
  "link": "/r/college/comments/qf6cuq/did_i_fuck_up/",
  "title:": "Did I fuck up?",
  "text": "I’m a biology major freshman at a local college. I’ve always loved animals and thought they were interesting and wanted studying them and helping them to be my life but actually making it to college I’m worried it’s not for me. \n\nI don’t know if I’m not scientifically minded or if I’m just lazy but I’m really finding a hard time to stay motivated to try and my grades show it. Is changing majors after bombing your *first ever* semester in college generally frowned upon? I’m deeply worried my extremely poor performance in my first semester is going to bar me from future success in academics, or alternatively if changing majors will even help me.",
  "author": "JoeMcBob1st",
  "created": 1635126502,
  "updated": 1635184191,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhxqunf": {
      "link": "/r/college/comments/qf6cuq/did_i_fuck_up/hhxqunf/",
      "text": "Don't worry many people nearly bomb/ or bomb their first semester. The reason is there is huge jump in expectations between high school and college. It usually takes at least 1 semester to adapt to it.\n\nMyself I nearly bombed my first semester. Got through with a C and a C+ on my problematic classes. The C was actually 49.3% of the mark and it was bumped up. The other C+ was down to failing half of the paper, then somehow making it back in the remaining 45% with high marks.",
      "author": "Impressive-Name5129",
      "created": 1635126949,
      "upvotes": 1,
      "replies": {}
    },
    "hhxsboq": {
      "link": "/r/college/comments/qf6cuq/did_i_fuck_up/hhxsboq/",
      "text": "If you truly want to see if you like a profession, try to get an internship or just a preview like a shadow week or something.\nEveryone bombs the first semester just try to make up for it with better grades, some colleges even let you retake classes",
      "author": "Geek_is_my_chic",
      "created": 1635127711,
      "upvotes": 1,
      "replies": {}
    }
  }
}