{
  "sid": "qiuc7y",
  "link": "/r/college/comments/qiuc7y/should_i_drop_this_class/",
  "title:": "Should I drop this class?",
  "text": "So I’m majoring in computer science but I chose a history class as one of my classes. I chose history because I like it but I realized there’s no point in me taking it. I can’t switch into any other classes. Should I drop it? I’ll appreciate a fast answer since the last day I can drop this class without a W is 11/03/21.",
  "author": "Aggressive_Top_6949",
  "created": 1635569811,
  "updated": 1635779813,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "him5e4o": {
      "link": "/r/college/comments/qiuc7y/should_i_drop_this_class/him5e4o/",
      "text": "If it’s an easy class keep it as a GPA booster. If it’s taking up time that you could be using for more important classes then drop it.",
      "author": "InevitableDog5338",
      "created": 1635576224,
      "upvotes": 2,
      "replies": {}
    },
    "hilz6u7": {
      "link": "/r/college/comments/qiuc7y/should_i_drop_this_class/hilz6u7/",
      "text": "I think it would depend on whether it counts to your total credits or not. From my experience, I’m assuming you need 120 credits to graduate. Every credit hour you take counts for those 120. If it doesn’t fill a distribution, and the rest of your distributions don’t reach your total credits in order to graduate, then I’d say maybe keep it. If it’s not a horrible class then it’s beneficial for graduation and completing your total credit hours needed to graduate. Hope this helps!",
      "author": "runnerbytennis",
      "created": 1635571706,
      "upvotes": 1,
      "replies": {}
    },
    "hilzbj0": {
      "link": "/r/college/comments/qiuc7y/should_i_drop_this_class/hilzbj0/",
      "text": "Consider some of these questions: \n\n- If you have some scholarship requiring a certain number of credit hours, would that affect it? \n\n- Does the history class fulfill any university requirements for graduation? \n\n- Do you need a GPA boost? And if so, would this class give you that - meaning, could you guarantee a good grade in this class? \n\n- Would taking this class potentially cause you to spill into your excess credit hours in the future, based on your current mapping status? \n\n- Are you overloaded with your other CS courses? \n\nIf it were me, I would drop it. But that’s also because I ended up taking MULTIPLE uneccessary courses and am now exceeding my credits so I’m paying a lot of money for my classes now. I know you’re in a time crunch, but if possible, you could always talk to an advisor and see what they say. \n\nHopefully this helps a little!",
      "author": "alwaystrivenprosper",
      "created": 1635571796,
      "upvotes": 1,
      "replies": {}
    }
  }
}