{
  "sid": "q537qw",
  "link": "/r/college/comments/q537qw/i_feel_like_the_lameno_fun_person_at_college/",
  "title:": "I feel like the lame/no fun person at college",
  "text": "Currently I’m writing this because it’s 2am and I’m still up even thought it’s a Saturday night. I had intended to go to bed at 10:30 because I had a busy week both school and sports wise and wanted to catch up on sleep. But that clearly didn’t happen and now I’m past the point of tiredness and just consumed 4000+ calories of crap in 2 hours. \n\nAnyways I had a math test and research project I’ve been worried about this weekend so I turned down an invite to a sports game and basically went to the library after practice. People are out and about having fun at parties and going out with friends and hanging out in the common space. \n\nI try to socialize every once in a while but I end up getting frustrated that I’m still awake. My teamates are meanwhile getting very drunk and clearly not worried about effect on sleep schedule, so why can’t I just have a good time (not meaning partying, not quite my thing) with friends or other teammates? Is there anyone else like me at college?",
  "author": "ejsfsc07",
  "created": 1633850182,
  "updated": 1634083063,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "hg36rep": {
      "link": "/r/college/comments/q537qw/i_feel_like_the_lameno_fun_person_at_college/hg36rep/",
      "text": "Hangovers last 3 days at worst but your results on that math test will be with you for the rest of the semester.",
      "author": "LandoSyztem",
      "created": 1633860819,
      "upvotes": 7,
      "replies": {
        "hg4xctc": {
          "link": "/r/college/comments/q537qw/i_feel_like_the_lameno_fun_person_at_college/hg4xctc/",
          "text": "Im still a rookie with partying, but damn! How drunk do you have to get to have a 3-day hangover?",
          "author": "RedJuicy713",
          "created": 1633892698,
          "upvotes": 3,
          "replies": {
            "hg4yxl6": {
              "link": "/r/college/comments/q537qw/i_feel_like_the_lameno_fun_person_at_college/hg4yxl6/",
              "text": "Poor fucking decisions. If I had to do it all again I'd set my goal to get nicely buzzed every time I drank and go no further.",
              "author": "LandoSyztem",
              "created": 1633893347,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hg3x6th": {
      "link": "/r/college/comments/q537qw/i_feel_like_the_lameno_fun_person_at_college/hg3x6th/",
      "text": "Setting up priorities doesn't mean you're a lame person. You can't just sacrifice your time for a few hours of fun instead of studying for your math test which could have an impact on your future. So if you have something important to do, do that first. You will always get the opportunity to socialize and have fun every here and then.",
      "author": "ZuhairZat",
      "created": 1633877204,
      "upvotes": 2,
      "replies": {}
    }
  }
}