{"sid": "ps4pam", "link": "/r/college/comments/ps4pam/im_trying_to_resign_as_president_of_a_club/", "title:": "I'm trying to resign as President of a club", "text": "Hi, I'm president of the Rugby club at my school, but I been burnt out from just a few weeks back at school. My exec doesn't want to pull their load, the coaches complain to me when something out of my control like the school not providing them with parking passes and such, the school administration doesn't fix their website and complains to us why we haven't done anything. and etc. The role was assign to me rather than me being voted in and I was the only time willing at the time to take the responsibility with the expectation that I would not be doing the task of the other roles. I tried to push the exec board to work but they are pretty much headless chicken at this point. On top of all this, I recently haven't been finding the sport as fun as I used too. I was to resign but I'm not sure how. There is someone who can easily fill in my role when I leave I just don't know how to explain to him that I'm done.", "author": "Fine-Scarcity9173", "created": 1632174659, "retrieved": 1632801359, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"hdnsmfh": {"link": "/r/college/comments/ps4pam/im_trying_to_resign_as_president_of_a_club/hdnsmfh/", "text": "Whoever would be filling your role go and talk to him tell him how you’re feeling in the fact that you can no longer do the job talk to him and make sure he can actually handle it and then talk to your exact and the coaches and let them know you’re resigning just if you need to type up something formal and resign if people keep calling you about some thing and phone number as politely and professionally as possible that you were no longer the president of the club and that so-and-so has taken over the position but talk to the guy that would be taking over for you first he needs to know why he’s taking over and you need to make sure that he can actually handle it and that he is aware he is taking over don’t just drop in his lap That level of responsibility just tossed onto another person without even a polite warning or an explanation as to the fact you can’t handle the position and your schoolwork and that you feel burned out", "author": "pygmypuffonacid", "created": 1632184820, "upvotes": 2}}}