{
  "sid": "qj2xi8",
  "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/",
  "title:": "Can I get paid the same money if I get a bachelor's degree at a college vs. a university?",
  "text": "I know this depends on the career path, so I'm going for technology, STEM, computer science. My current school doesn't offer a computer science degree but they offer other ones that are similar, the university I had in mind offers a computer science degree. How important is it to get a computer science degree specifically and why? Can't I just get another technology based degree and still get the same or similar paying job?",
  "author": "Ph03n1x_5",
  "created": 1635605148,
  "updated": 1635779791,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hinwwz6": {
      "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinwwz6/",
      "text": "[deleted]",
      "author": null,
      "created": 1635613972,
      "upvotes": 6,
      "replies": {
        "hioc5vp": {
          "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hioc5vp/",
          "text": "Ok let me explain. So in my state we have \"state colleges\" which are basically community college but also offer trade school programs, certificates, and bachelor's degrees. Then we have \"state universities\" that offer bachelor's and master's degrees. I know it's confusing to hear the term \"state college\" and not immediately think \"oh yea that's a university\". At this point I really don't care if I do computer science or underwater basket weaving lol. As long as I can just get a job already and not take a million prerequisites I'm good.",
          "author": "Ph03n1x_5",
          "created": 1635620312,
          "upvotes": 2,
          "replies": {
            "hioeny1": {
              "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hioeny1/",
              "text": "any four year program will have you taking “a million” pre reqs. Pretty much every college degree could be an associates degree without having to take gen ed’s. You’ll just have to deal with it if you want a bachelors.",
              "author": "rynpickles",
              "created": 1635621368,
              "upvotes": 3,
              "replies": {
                "hioowx2": {
                  "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hioowx2/",
                  "text": "I talked to my advisor the other day and they told me that only the computer science program at that specific university has prerequisites but if I just did a bachelor's degree at the same school I'm at now then there wouldn't be any prerequisites besides the regular A.A. which I'm almost done with.",
                  "author": "Ph03n1x_5",
                  "created": 1635625897,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hincpxl": {
      "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hincpxl/",
      "text": "Maybe.  \n\nIt depends on the career specifics.",
      "author": "VA_Network_Nerd",
      "created": 1635605340,
      "upvotes": 2,
      "replies": {
        "hindi26": {
          "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hindi26/",
          "text": "So I'd be ok with just about any computer job that pays well and isn't super complicated",
          "author": "Ph03n1x_5",
          "created": 1635605694,
          "upvotes": 1,
          "replies": {
            "hinf8zp": {
              "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinf8zp/",
              "text": "> So I'd be ok with just about any computer job that pays well and isn't super complicated  \n\nI encourage you to spend more time learning about the career field, so you can narrow in on some kinds of job roles that you think you'd be a good fit for.  \n\nThis will help you choose the educational path that best aligns to that career destination.  \n\nComputer Science is never a wrong decision, but it may be overly-theoretical, and frankly, overly-difficult than is necessary for many job roles.  \n\n\nPersonally, I find most Information Systems degree programs to be a good balance of academic subjects & practical experiences.  \n\nIf you need some resources to help explore some career concepts, you might come ask in /r/ITCareerQuestions",
              "author": "VA_Network_Nerd",
              "created": 1635606485,
              "upvotes": 3,
              "replies": {
                "hinhpo3": {
                  "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinhpo3/",
                  "text": "Is computer science really that hard? I heard IT is easier but it doesn't pay as much since engineers and cyber security is in demand right now. I find it very difficult to choose a career based on the job description because I'm my experience that has been very wrong. Like all the jobs that say \"fast paced environment\" and it's only like that on the weekends and holidays.",
                  "author": "Ph03n1x_5",
                  "created": 1635607594,
                  "upvotes": 1,
                  "replies": {
                    "hint4mi": {
                      "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hint4mi/",
                      "text": "Yes CS is extremely hard if you’re not great at math. An IT degree might pay less initially but will get extremely close to a CS degree’s pay. Two of my friends are making $70k while in college, both IT majors. You can do almost anything in the tech industry with an IT/IS degree. You can be an engineer, cybersecurity analyst, software developer, etc. with either degree, but you might be limited to less math intensive jobs(software engineering jobs involving math, data engineering, anything with machine learning/AI is probably out of reach without a CS degree).",
                      "author": "evasiveshag",
                      "created": 1635612406,
                      "upvotes": 3,
                      "replies": {
                        "hiobowx": {
                          "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hiobowx/",
                          "text": "Oh well maths aren't too bad it's just science I hate but I can probably get through it",
                          "author": "Ph03n1x_5",
                          "created": 1635620121,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hinw43g": {
      "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinw43g/",
      "text": "The only value a college brings is a piece of paper that is still required by a lot of companies and networking. If you go to a good school, recruiters from big tech companies will come to your school to recruit. Go to LinkedIn and look where alumni from your program and college work.",
      "author": "elsa_the_swede",
      "created": 1635613649,
      "upvotes": 1,
      "replies": {
        "hiobtey": {
          "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hiobtey/",
          "text": ">If you go to a good school, recruiters from big tech companies will come to your school to recruit.\n\nYea that sounds like a university thing....",
          "author": "Ph03n1x_5",
          "created": 1635620172,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hinflwr": {
      "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinflwr/",
      "text": "College is a scam and you are going for the piece of paper. Yes it matters where that paper is from. So a university will look better for jobs that care about status whereas a community college will look better for those interested in the learning process. \nAt the end of the day all that matters is that you get to know people in the field because connections are the key and you gain experience so that you have already done the job by the time you are hired.",
      "author": "Bunnyentendre",
      "created": 1635606649,
      "upvotes": -5,
      "replies": {
        "hinjd5g": {
          "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinjd5g/",
          "text": "> College is a scam and you are going for the piece of paper.  \n\nI'll agree that college isn't the right path to a career for everyone or for every career.  \nI'll also agree that too many people choose the wrong college or university for the wrong reasons.  \n\nBut I do not agree that college (or university) is a scam at all.  \n\n> Yes it matters where that paper is from  \n\nI'll agree that **some** career fields or industries care about the pedigree of the institution or the quality of the education, and therefore only recruit from specific institutions.  \n\nBut the number of employers or industries in which this is a serious concern is a really small percentage of all career options for recent graduates.  \n\nFor the vast, overwhelming majority of employers, I believe the following is true:  \n\n\nThere are over 4,000 colleges + universities in the US.  \n\nFrom an employer perspective they can all be divided into 4 categories:  \n\n* Universally and industry recognized elite institutions known to produce exceptionally well prepared graduates.  \n - This is probably about 100 schools.  \n\n* Institutions known to be absolute dogshit.  \n - This is probably 25 schools or so.  \n\n* Universities & Institutions that the employer/interviewer has a personal connection with.  \n - Hey, my brother went to that school.  \n - I've got a niece who went there...  \n - This is probably 25 or so schools.  \n\n* All other universities.  \n - Never heard of it, but I'm sure it's fine.  \n - This is over 3,000 schools.  \n\n\n> So a university will look better for jobs that care about status whereas a community college will look better for those interested in the learning process.  \n\nI don't agree with your word-choices here, but I think I agree with the general sentiment.  \n\nDifferent employers have different priorities regarding the level of and quality of education in their applicants.  \n\n\n> At the end of the day all that matters is that you get to know people in the field because connections are the key and you gain experience so that you have already done the job by the time you are hired.  \n\nI will also agree that too many people underestimate the value or importance of a good people-network.  \n\nA large university with a large, strong Alumni Network can be a powerful tool.  \n\nHere is a simple example of this:  \n\n[University of Texas at Austin 2014 Commencement Address - Admiral William H. McRaven](https://www.youtube.com/watch?v=pxBQLFLei70)  \n\nThat is a video of Remarks by Naval Adm. William H. McRaven, BJ '77, ninth commander of U.S.Special Operations Command, Texas Exes Life Member, and Distinguished Alumnus.  \n\nAny member of that Admiral's command could throw the University of Texas Hook-em Horns at him and immediately establish the connection of having shared the University of Texas experience. Now that by itself isn't going to get you promoted or anything like that, but it might get you that 30 second window you need to open a door of opportunity.  \n\nThat's the power of a people-network.",
          "author": "VA_Network_Nerd",
          "created": 1635608312,
          "upvotes": 6,
          "replies": {}
        },
        "hinic3v": {
          "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinic3v/",
          "text": "So essentially what you're saying is that unless I live in some high class liberal area that I can make $50k even if I get a bachelor's degree at a college. Right?",
          "author": "Ph03n1x_5",
          "created": 1635607868,
          "upvotes": 1,
          "replies": {
            "hinmaek": {
              "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hinmaek/",
              "text": "No I’m saying that with or without college of any kind you can make $50k if you gain the correct knowledge, experience, and people-networking. It is up to you to decide who you want to work for and what they value. Then do what you need to meet those values.",
              "author": "Bunnyentendre",
              "created": 1635609536,
              "upvotes": -2,
              "replies": {
                "hiobk4f": {
                  "link": "/r/college/comments/qj2xi8/can_i_get_paid_the_same_money_if_i_get_a/hiobk4f/",
                  "text": "I mean sure, just like I've heard that you can make alot of money in sales. But you have to have the personality for networking. I consider myself an introvert, so naturally I hate jobs that prioritize social skills over job skills. Also I just do school online and work, and obviously nobody in the retail/food service industry has a background in anything technology related.",
                  "author": "Ph03n1x_5",
                  "created": 1635620067,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}