{
  "sid": "q2cuyg",
  "link": "/r/college/comments/q2cuyg/plagiarism_and_plagiarism_checkers/",
  "title:": "Plagiarism and plagiarism checkers",
  "text": "Do your colleges allow u to check for plagiarism yourself? My college is saying that we shouldn’t worry about plagiarism if we’ve written it ourself and cited correctly but the profs use checkers once we submit it. What’s the point of them checking it if we can’t check our own work ourselves? And it’s so unclear whether some of these checkers store our work or no, so even if I try to use one myself it might show up as plagiarised when my prof checks it. What do you guys do? Any recommendations?",
  "author": "Aggravating-Help4277",
  "created": 1633493645,
  "updated": 1634083763,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hfkh7gg": {
      "link": "/r/college/comments/q2cuyg/plagiarism_and_plagiarism_checkers/hfkh7gg/",
      "text": "They use checkers that compare it to a database from other works. They are checking to see if you directly stole work without citing it. There really shouldn't be a need for you to check for plagiarism, but online checkers work if you are paranoid. The online checkers do not store your work without permission.\n\nI don't use plagiarism checkers because as long as you didn't plagiarize there is no need for them. Incorrect citations is not plagiarism, so the worst that will happen is point off for formating errors, which the plagiarism checker won't catch anyway.",
      "author": "needhelpne2020",
      "created": 1633495042,
      "upvotes": 7,
      "replies": {}
    },
    "hfkh3h8": {
      "link": "/r/college/comments/q2cuyg/plagiarism_and_plagiarism_checkers/hfkh3h8/",
      "text": "What do I do? I don’t plagiarize. \n\nMy professors use vericite and I’ve never had an issue just not plagiarizing and citing sources properly.",
      "author": "ilikecacti2",
      "created": 1633494970,
      "upvotes": 3,
      "replies": {}
    },
    "hfkhy0o": {
      "link": "/r/college/comments/q2cuyg/plagiarism_and_plagiarism_checkers/hfkhy0o/",
      "text": "If you just write the paper yourself and don't steal other peoples words very easy not to plagiarize. I don't know why this is difficult",
      "author": "TragicalKingdom",
      "created": 1633495520,
      "upvotes": 4,
      "replies": {}
    },
    "hfkhx9j": {
      "link": "/r/college/comments/q2cuyg/plagiarism_and_plagiarism_checkers/hfkhx9j/",
      "text": "I just write the paper and turn it in and don't think twice about it. I see these posts all the time and I don't really understand what youre so worried about. I mean, you really think someone wrote with exactly the same words as you?",
      "author": "Red-Stoner",
      "created": 1633495507,
      "upvotes": 3,
      "replies": {}
    },
    "hfkts9n": {
      "link": "/r/college/comments/q2cuyg/plagiarism_and_plagiarism_checkers/hfkts9n/",
      "text": "...why do you need to check your own paper, which you yourself wrote (unless you've paid someone else to write it, in which case you absolutely plagiarised) when you, ostensibly, know if you actually plagiarised or not?",
      "author": "sashathebrit",
      "created": 1633504380,
      "upvotes": 3,
      "replies": {}
    },
    "hfkytma": {
      "link": "/r/college/comments/q2cuyg/plagiarism_and_plagiarism_checkers/hfkytma/",
      "text": "My school used Turn It In and we are not able to see our work after it’s been submitted and graded. Anything over 27% is unacceptable. Funny enough, my latest assignment got a 34% because it found the same links and question phrases from other sources. \n\nBut really, plagiarism shouldn’t be an issue if you are paraphrasing or quoting outside sources properly, and citing them. With most of the work being your own thoughts and ideas.",
      "author": "kizeltine",
      "created": 1633509019,
      "upvotes": 2,
      "replies": {}
    }
  }
}