{
  "sid": "qp4pm4",
  "link": "/r/college/comments/qp4pm4/have_i_completely_screwed_myself_over/",
  "title:": "Have I completely screwed myself over?",
  "text": "So I'm an 18 year old college freshman and I feel like I've fucked myself over entirely. Starting off, I've always been a huge procrastinator and was never really an organized person. During high school throughout all 4 years I would always be behind on work, failing multiple class throughout the year. Then being able to pull them all up whenever the final grades for the semester came out. Long story short, I also feel like I lost who I was in high school. Somewhere along the lines I lost my passion, will, and I felt as if I was living for nothing. I thought going to college would change me and give me something to strive for, but now it's even worse. I let my procrastination get the best of me and I just feel apathetic towards everything. I'm pretty sure I'm failing 5/7 classes and I just haven't been here mentally. To anyone whose been in the same boat, or anyone with more college experience, is it possible for me to pull myself up from bombing a semester? Will I get kicked out of college? If I do good next semester will I be alright? Will I even have an opportunity next semester?",
  "author": "lxnejay",
  "created": 1636341043,
  "updated": 1636655390,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hjrotlb": {
      "link": "/r/college/comments/qp4pm4/have_i_completely_screwed_myself_over/hjrotlb/",
      "text": "Well first of all 7 classes is probably waaaaay too much. I will take maximum five if I have no choice, but try to stick to 2-3. Maybe a lighter workload would lessen the stress. \n\nThat way you’ll have more time for self care, studying and homework, a job, volunteering, socializing etc. All of which btw could make life in general more pleasant. \n\nYour college might have a counseling center that offers free counseling for students. Maybe a counselor could help you with time management and whatever else you have going on. \n\nHave you ever been diagnosed with anything? Depression, ADHD etc.? If so (or if you haven’t and want to get diagnosed) then you could talk to your school’s disability center. Depending on what you need, you could get extra time on exams and other accommodations that could help. (For real though I literally couldn’t pass a college math course until I was diagnosed with ADHD and all I did was have unlimited time on tests and I’ve gotten Bs in math classes ever since 😊)\n\nBut most importantly……\n\nTalk to your academic advisor!!! *So* important!! They will tell you how to deal with failing classes and if you’ll be put on academic probation or whatever. You won’t be kicked out though.\n\nGood luck",
      "author": "laniebug235",
      "created": 1636346812,
      "upvotes": 6,
      "replies": {}
    },
    "hjrj3sj": {
      "link": "/r/college/comments/qp4pm4/have_i_completely_screwed_myself_over/hjrj3sj/",
      "text": "There are huge differences between college and high school. Grades are not the average between 2 semesters. The grade you get at the end of the semester is the grade you get for that class. Each class is self contained. If you are struggling I would recommend you speak with an academic counselor at your school. Their whole job is to work with you to find a path to graduation. You need to put in the work. No one will hold your hand. No one will send a letter to your parents. You will just fail that class and might be required to retake it. Too many fails (usually 2 or 3) in the same class often bars you from taking it again. \n\nRemember, college isn't free. You are paying for it either out of pocket, through loans, or grants. Money spent on a class is money gone. You don't get a refund after week 2 in most colleges. You're paying for a seat in that class whether you show up and turn in the work or not. \n\nI once had a programming teacher tell me that he could see on his instructor computer what his students were doing on the student computers and half of them were always watching YouTube videos instead of listening to his lectures. Those were the most expensive videos those students have ever watched because they were wasting paid-for class time dicking around. He said \"it's not my job to force my students to show up or pay attention. My job is to deliver the lecture, grade assignments, and help students who are trying but struggling.\" So long as the slackers weren't being disruptive to others he let them do as they pleased with the time they paid for with him.\n\nYou are there to be a student. That's your job. Treat it like it.",
      "author": "Comipa47",
      "created": 1636343634,
      "upvotes": 3,
      "replies": {}
    },
    "hjrqb4m": {
      "link": "/r/college/comments/qp4pm4/have_i_completely_screwed_myself_over/hjrqb4m/",
      "text": "Take 2-3 classes and go to tutoring/ learning center in you school to help you those classes. I never heard of freshman taking that much classes in one semester.",
      "author": "Competitive-Ninja449",
      "created": 1636347741,
      "upvotes": 2,
      "replies": {
        "hjsf4qd": {
          "link": "/r/college/comments/qp4pm4/have_i_completely_screwed_myself_over/hjsf4qd/",
          "text": "It's possible to have 7 classes and only 17 credit hours. S/o bio students in choir",
          "author": "youareaweirdo___",
          "created": 1636367794,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjri752": {
      "link": "/r/college/comments/qp4pm4/have_i_completely_screwed_myself_over/hjri752/",
      "text": "Go check in with a doctor. You might have depression, adhd, or a dozen of other possible problems that could cause this behavior that can be fixed with treatment. It's possible with help you can save this semester, but even if this semester is a wash, you'll have what you need for next semester to go better.",
      "author": "SouthernRhubarb",
      "created": 1636343161,
      "upvotes": 1,
      "replies": {}
    }
  }
}