{
  "sid": "qx16ic",
  "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/",
  "title:": "UPDATE: My teacher has reported my supposed cheating to the Academic Honor Board",
  "text": "[Read the first part of my situation here](https://www.reddit.com/r/college/comments/qwial9/my_teacher_accused_me_of_cheating_on_a_test/?utm_source=share&utm_medium=web2x&context=3)\n\nSo I just got an email from the Academic Honor Board that my teacher reported my violation, which leads me to believe that I did not do good enough on my retake of that part of the test to convince him that I was not looking at answers during the original test.\n\nSo now I have 2 options:\n\n1. Admit that I cheated (which I did not) and have an individual meeting with the Dean of the College as a learning experience and I get an automatic F on one of 4 tests in the course\n2. Dispute the claim, and have to go through a hearing with the board to evaluate my professor's report, supporting documentation, and allow me to share my account. If the hearing decides I'm innocent there are no further consequences but if it decides I'm guilty (remember, still not) I either still get an F on the test and get to stay, or more likely I get expelled from the course and there is an F on my transcript.\n\nThe obvious choice would be to go with the hearing, but I feel like the evidence is piling up against me and if they decide that I'm guilty after the hearing where I supposedly lied about not cheating my punishment is going to be even more severe. What should I do?",
  "author": "osrpokerchamp",
  "created": 1637273965,
  "updated": 1637353717,
  "over_18": false,
  "upvotes": 155,
  "upvote_ratio": 0.99,
  "comments": {
    "hl6fxsl": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl6fxsl/",
      "text": "Unless you ACTUALLY cheated, and it sounds like you didn't... Dispute it. Don't let them steam roll you.",
      "author": "SouthernRhubarb",
      "created": 1637274282,
      "upvotes": 315,
      "replies": {
        "hl6n4vj": {
          "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl6n4vj/",
          "text": "Agreed",
          "author": "KW01328",
          "created": 1637277351,
          "upvotes": 31,
          "replies": {}
        }
      }
    },
    "hl7dyla": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl7dyla/",
      "text": "If you didn't cheat, you need to dispute it. Any documentation of academic dishonesty can come back to seriously haunt you. The allegation that the professor made against you is serious and can derail your career. If I were in your shoes I'd: \n\n1.) Get a doctors note that documents that you have anxiety. People who have been falsely accused fail polygraphs all the time, it makes sense that you would be nervous under duress. \n\n2.) Demand to have all future exams proctored by a neutral 3rd party. If he accused you once because you moved a chair, he'll do it again. \n\n3.) Explain your situation to the dean and anyone who asks. If he thought you were cheating during the exam, he should've come up to you and asked to see what was in your lap/pocket/etc. \"Acting nervous/guilty/etc.\" isn't a valid reason to accuse anyone.",
      "author": "Valkyeriia",
      "created": 1637289588,
      "upvotes": 181,
      "replies": {}
    },
    "hl6ybiv": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl6ybiv/",
      "text": "Dont confess is you're innocent. They need to prove you cheated. Bring that black pencil case of yours",
      "author": "GoldRequest",
      "created": 1637282378,
      "upvotes": 70,
      "replies": {}
    },
    "hl7u269": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl7u269/",
      "text": "If you didn’t cheat dispute, If you did accept",
      "author": "Lifedeather",
      "created": 1637297327,
      "upvotes": 45,
      "replies": {}
    },
    "hl839e5": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl839e5/",
      "text": "Dispute it 100%. The professor’s “evidence” is weak af and you don’t deserve this. Stand up for yourself and tell it exactly how it happened when you’re at the hearing! Most likely they’re gonna throw this out because there’s just no concrete evidence",
      "author": "lemonadesun",
      "created": 1637302804,
      "upvotes": 30,
      "replies": {}
    },
    "hl7xxas": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl7xxas/",
      "text": "If you are at a state school, find out your rights. Typically they are more robust than at private universities. Also, be very careful in how you communicate with the university now. Treat them as you would if you were a defendant and them a prosecutor. If you can afford it and think it is worth the time, hire an educational lawyer. Most of all though, don’t admit anything you didn’t do!",
      "author": "Agua_Fresca_Cuh",
      "created": 1637299521,
      "upvotes": 20,
      "replies": {}
    },
    "hl9itt6": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl9itt6/",
      "text": "Professor here - I deal with A LOT of academic dishonesty.  I surprising amount.  So, when I see “another case,” I follow the university process.  It can be super frustrating.  Here is the thing, though.  Once in while - I make a mistake by assessing something as a violation that wasn’t.  I try hard not to make mistakes because of how shattering it can be to be falsely accused. Still, I am human and, sometimes, I’m wrong.\n\nWhen I am wrong, then I go to the university to explain my mistake and to clean up the student’s record.  Of course, I also apologize to the student.  My advice below assumes that you are dealing with a reasonable instructor. \n\nIf you have not already made your case to your professor, do so now. Explain your position and explain how you got to the exam answers without cheating. If you do this in person, also follow up with a summary email. \n\nIf the violation stands, then it is necessary to go with option 2. A violation of the university‘s academic integrity policy has to be provable. I’ve had many cases where I suspected that a student was violating the policy. I did not report these because I had nothing provable. Thinking that someone saw a phone or that someone was looking at notes is different than something that is provable.\n\nOne of the reasons why it’s so important to challenge this is that most universities operate on a sliding scale for disciplining academic integrity violations. Often, a first violation is an F on the assignment. A second violation might be something like an F in the course and a third violation is expulsion from the University. So, as you can imagine, it’s best to avoid even one violation if this is possible.\n\nOf course, if you go through the hearing process, and things are still unfavorable, then there probably is also an appeal process. Be sure to take the process all the way to the end as much as you can.",
      "author": "Bayareaone",
      "created": 1637335723,
      "upvotes": 6,
      "replies": {}
    },
    "hl8dw17": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl8dw17/",
      "text": "You say the evidence is piling up like what evidence if you didn’t cheat.",
      "author": "Xen0Coke",
      "created": 1637310489,
      "upvotes": 24,
      "replies": {
        "hl8fgnv": {
          "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl8fgnv/",
          "text": "Yeah that's wat I was wondering.",
          "author": "Forever_ForLove",
          "created": 1637311795,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hl97i2v": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl97i2v/",
      "text": "If you didn’t cheat, dispute it no matter what, if you did cheat, then come clean and admit it, there is really no game you could play around, the best action is just telling them the truth",
      "author": "coolrider2010",
      "created": 1637330681,
      "upvotes": 5,
      "replies": {}
    },
    "hl8gemf": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl8gemf/",
      "text": "Dude did you cheat pr not…?",
      "author": "SelectionMM",
      "created": 1637312593,
      "upvotes": 9,
      "replies": {}
    },
    "hl6py8w": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl6py8w/",
      "text": "Sounds like you probably cheated and don’t wanna admit it. If you really didn’t cheat though, then you shouldn’t be worried here and go through with the dispute.",
      "author": "fennishing",
      "created": 1637278585,
      "upvotes": 23,
      "replies": {}
    },
    "hl96om2": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl96om2/",
      "text": "How is there evidence stacking up against you if you didn’t cheat?",
      "author": "AP_Feeder",
      "created": 1637330286,
      "upvotes": 3,
      "replies": {}
    },
    "hl96lrb": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl96lrb/",
      "text": "How are your other grades? If bad that hurts you. If good that helps you.",
      "author": "allthecoffeesDP",
      "created": 1637330248,
      "upvotes": 1,
      "replies": {}
    },
    "hl8w6x9": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl8w6x9/",
      "text": "He seems to have no evidence of you actually cheating other than his speculation because you were rolling around in your seat, which isn’t enough. You definitely need to dispute this. Professor sounds like a complete ass for assuming you were, he clearly has no actual evidence. The board should throw this out. \n\nMaybe your parents can call and talk to your school. I know your not a minor, but maybe having a older adult talk to them about your situation may help as they may not take a young adult seriously.",
      "author": "thestar1818",
      "created": 1637324612,
      "upvotes": -2,
      "replies": {
        "hl9hb2k": {
          "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl9hb2k/",
          "text": "Odds are school won’t talk to parents. As an adult this is a difficult thing but they should stand up for themselves and explain the situation it’ll get dropped(if cheating didn’t happen). I believe legally universities aren’t allowed to give parents any info since the student is an adult.",
          "author": "gdowner22",
          "created": 1637335082,
          "upvotes": 2,
          "replies": {
            "hl9n2id": {
              "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hl9n2id/",
              "text": "Yes they will, if the parent is authorized by the student. I guess your saying it’s childish to do so. Nothing wrong with having parental support  for someone who is 18-22 year old because typically they know more than we do, schools can’t bully a grown adult whose  experienced life like they can a young adult.",
              "author": "thestar1818",
              "created": 1637337443,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hlab4i7": {
      "link": "/r/college/comments/qx16ic/update_my_teacher_has_reported_my_supposed/hlab4i7/",
      "text": "Prof is going to flunk you anyway even if you win, but win anyway.",
      "author": "NashGuy14",
      "created": 1637346845,
      "upvotes": 1,
      "replies": {}
    }
  }
}