{
  "sid": "qivi58",
  "link": "/r/college/comments/qivi58/double_major_and_double_minor/",
  "title:": "Double major and double minor",
  "text": "Hello all, I will try and keep this short\n\nI’m currently a sophomore and I am double majoring in Management Information Systems and Business Analytics. I also am minoring in sport management and getting a certificate in financial programming. I just checked our catalogs and the finance minor will only require one more class, and it’s something I want to take and learn about (equity and option valuation). I can easily add that to the other minor, the certificate, and the double majors, all while still graduating in 4 years. All of these are related, and most of the classes fulfill requirements for the other majors/minors so it’s pretty easy. I also took a semester worth of dual-enrollment classes in high school. \n\nMy questions are: would having too many majors/minors be a problem? Will employers see any issues with it, possibly doing more harm to me than good? MIS, Business Analytics, Finance and Financial Programming are all closely related so I think those make sense. I wanted to get the sport management minor because I am interested in working in the sport industry for analytics or possibly business development, so I added that for my interests and also to learn more about the industry. \n\nEssentially I am asking, would havIng a MIS/Business Analytics double major, Finance/Sport Management double minor, and Financial Programming certificate be problematic? \n\nTL;DR - Two majors, two minors and a certificate, all in related subjects that I am interested in with no added cost or time. Good/bad idea?",
  "author": "umfan14",
  "created": 1635574887,
  "updated": 1635779796,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "himarbo": {
      "link": "/r/college/comments/qivi58/double_major_and_double_minor/himarbo/",
      "text": "It’s not problematic but it’s kinda over the top. You usually want to do things that don’t over lap as much. They should supplement each other. \n\nExamples: double majoring in international affairs and french or social work with a minor in child welfare. \n\nJust because you CAN add a minor doesn’t mean you need to. Like you said all of these things are already related so you are going to have to take classes in them anyway to satisfy your majors, so I really can’t see it being that impressive on a resume. I could add a neuroscience minor to my degree but i’m not because it’s already implied i’m familiar in the topic due to my majors.",
      "author": "rynpickles",
      "created": 1635580480,
      "upvotes": 2,
      "replies": {
        "hinjs71": {
          "link": "/r/college/comments/qivi58/double_major_and_double_minor/hinjs71/",
          "text": "Thanks for the response! I understand what you’re saying that makes a lot of sense. The only one I wanted for resume purposes was the sport management one, but other than that I’m just genuinely interested in learning the others. My thought process was that if I want to take the stock valuation class anyways, wouldn’t it make sense to declare a finance minor, rather than just take the class? I just want to make the most out of my time here and learn as much as I can, while making sure nothing will hurt me. Thanks again!",
          "author": "umfan14",
          "created": 1635608487,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "himak81": {
      "link": "/r/college/comments/qivi58/double_major_and_double_minor/himak81/",
      "text": "Since 3 are closely related and 1 will likely be relevant to the type of jobs you might apply to anyway, I don't think it would reflect negatively. If they were all in completely different fields, some people might think that you're a bit indecisive and unsure of what you want to do (but that's probably only places like med school tbh). If you can manage it, then I say go for it. Good luck!",
      "author": "NoDryHands",
      "created": 1635580324,
      "upvotes": 1,
      "replies": {
        "hink6x4": {
          "link": "/r/college/comments/qivi58/double_major_and_double_minor/hink6x4/",
          "text": "Appreciate the response! I think I might do it, I was just worried about the indecisiveness part. Since I’m taking the classes anyways I think it makes sense to add the minor. I’m am sure on what I want to do so maybe if I’m asked in an interview or anything I can explain why I did it. Thanks!",
          "author": "umfan14",
          "created": 1635608657,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}