{
  "sid": "qn05el",
  "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/",
  "title:": "Why are people so stingy with their notes?",
  "text": "I’m not sure if it’s just in my college or if it’s like this everywhere but why are people so apprehensive about sharing notes? I’ve been in 2 classes where we have an independent student discord (no professor monitoring) and whenever someone asks for notes no one replies. I’ve posted notes a couple times, it takes like 3 mins to snap a few pics.\n\nIt’s really not that hard, do people not wanna do it cuz “I had to suffer thru class, I’m not gonna help you cuz you didn’t suffer” cuz that’s kinda petty, it doesn’t take anything away to share notes. It’d make more sense to pool together notes so we can pick up where there’s holes in each other’s learning, work together and beat the system.\n\nIdk I’m just wondering what the mindset is, it’s very minor I just get really perplexed as to why people do the things they do",
  "author": "sgb1446",
  "created": 1636075917,
  "updated": 1636136991,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.7,
  "comments": {
    "hjd9y86": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd9y86/",
      "text": "I’m in a class with optional attendance, half go and half don’t. If you don’t make a conscious effort to attend class and try to obtain some information, I’m not going to just give you the highlights of it all by giving you my notes. If you want information, come to class and obtain it. No one spoon feeds me the key concepts, I learn that by going to class. I’m not going to give someone notes just because they don’t want to go to class, cause news flash, no one wants to go.",
      "author": "Midwestniceish",
      "created": 1636079965,
      "upvotes": 47,
      "replies": {
        "hjdb19f": {
          "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdb19f/",
          "text": "Fair enough, I think I just got a soft spot for slackers cuz I almost failed high school lol. I’m in college now and am pretty on top of things, but if I can help someone get one over on the system I’m all for it, I just had no clue other people thought like this, nothing wrong with it, makes sense",
          "author": "sgb1446",
          "created": 1636080485,
          "upvotes": -13,
          "replies": {
            "hjf7wo7": {
              "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjf7wo7/",
              "text": "It's not really helping them \"Get one over on the system\". If they get a job in that field they won't have the knowledge required and it will make everyone else with that degree  from your university seem that much worse. If they're going to skip class on purpose then they can at least study the material instead of cramming notes for an exam.",
              "author": "LordofDsnuts",
              "created": 1636124423,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "hjd5odu": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd5odu/",
      "text": "Because then they complain anyway. What’s that say? You misspelled this and your handwriting is too messy. The people that ask for notes also never show up to class. I only give notes to people who I’m actually friends with or I’m getting something out of it like notes for another class.",
      "author": "Kirbylover16",
      "created": 1636077952,
      "upvotes": 45,
      "replies": {
        "hjd6fls": {
          "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd6fls/",
          "text": "Oh if they’re gonna ask me questions and shit they’re out of luck, they’re gonna have to fill in the gaps",
          "author": "sgb1446",
          "created": 1636078307,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hjdhosh": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdhosh/",
      "text": "People who ask me for notes think that \n\nA) they’ll get an A if they use them (and thus want to depend their grade on me)\nB) they can take advantage of me so they don’t have to go to class\nC) Will keep asking me for things and favors and pushing it.\n\nIt’s a pain in the ass, even to snap a photo. That being said, if you tell me ahead of time you’re sick and need it, no problemo. Not every week and not for no reason though.",
      "author": "rain6304",
      "created": 1636083877,
      "upvotes": 12,
      "replies": {}
    },
    "hjd2cxk": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd2cxk/",
      "text": "I've been the person withholding notes before. Generally, I refuse when I see the student hasn't contributed anything to the notes pool or homework answers/help. You get what you put in—if it's nothing and you expect your classmates to pick up your slack, you're shit out of luck.",
      "author": "HorrorDisk8",
      "created": 1636076438,
      "upvotes": 27,
      "replies": {
        "hjd3b71": {
          "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd3b71/",
          "text": "I feel it lol, I guess I got a different philosophy. I’m not gonna work harder for someone to slack, but if I can help someone slack without messing my side of the fence up I’m gonna help them. I want everyone to be able to slack as much as possible",
          "author": "sgb1446",
          "created": 1636076858,
          "upvotes": 5,
          "replies": {
            "hjd3s5l": {
              "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd3s5l/",
              "text": "I resent students who bring nothing to the table and expect others to carry them. I'm more about fairness than maximizing slack off behavior, but I've also been a TA for a couple of years and had the pleasure of failing students who fucked over their groups in terms of effort and have brought that to my personal academics.",
              "author": "HorrorDisk8",
              "created": 1636077071,
              "upvotes": 14,
              "replies": {
                "hjd41sc": {
                  "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd41sc/",
                  "text": "Oh slacking off in a group project is different to me, someone slacking off in one of those=more work for me to do, I don’t have any sympathy there. Just for things that don’t hurt me I don’t care about",
                  "author": "sgb1446",
                  "created": 1636077195,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            },
            "hjdg9qv": {
              "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdg9qv/",
              "text": ">I want everyone to be able to slack as much as possible\n\nThats a pretty weird minset honestly. Are going to college just to check a box? Youre paying thousands of dollars to be there and presumably have some level of interest in your major. Its just so foreign to me to actively try to do as little work as possible",
              "author": "taybay462",
              "created": 1636083142,
              "upvotes": 9,
              "replies": {
                "hjdoxlm": {
                  "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdoxlm/",
                  "text": "Nope, went to college to work hard and better my life cuz my life was going nowhere, however I really don’t care if others slack off and if I can slack off every once and a while and not impact my grade I’m gonna do it. I personally don’t believe in doing work for the sake of work",
                  "author": "sgb1446",
                  "created": 1636088208,
                  "upvotes": 0,
                  "replies": {}
                },
                "hjdpkhm": {
                  "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdpkhm/",
                  "text": "I slacked off a lot more in prerequisite classes, if it was something of no use to me like biology you bet I’m gonna find a way to do as little work as possible, if it’s my PSY courses (my major) then I try as much as possible, but if someone else doesn’t wanna care about that course they can have my notes",
                  "author": "sgb1446",
                  "created": 1636088620,
                  "upvotes": 0,
                  "replies": {
                    "hjf41va": {
                      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjf41va/",
                      "text": "Biology is pretty important for the study of psychology actually. Because almost every element of the body links back to the brain. The broader you know about how the body works the better you’re at applying those concepts in psychology. Believe it or not, almost every class has something that will contribute to your major. Even english, because it helps you write better journal articles and research.",
                      "author": "Psycho-Stud",
                      "created": 1636122897,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjdf633": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdf633/",
      "text": "Some are scared of possible academic integrity violations",
      "author": "GoldRequest",
      "created": 1636082565,
      "upvotes": 29,
      "replies": {
        "hjdgc9q": {
          "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdgc9q/",
          "text": "That too, like if they answer a question with the same wording from your notes and you also use similar wording",
          "author": "taybay462",
          "created": 1636083178,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hjdgcfj": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdgcfj/",
      "text": "My notes feel very personal to me since I write dumb stuff on them besides the material to help me assimilate the readings/lectures.  I once made a mistake of sharing my notes to someone in my English and I remember I have written weird stuff on it. That same classmate gave me a  look when she gave me back the notes lol.",
      "author": "iamsojellyofu",
      "created": 1636083180,
      "upvotes": 4,
      "replies": {}
    },
    "hje15ab": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hje15ab/",
      "text": "What do you mean beat the system? The institute isn't like some evil cartoon villain, they are designed to be passable. Yes some are just insufferable to go through but that's life. \nI don't mind sharing and studying together but it's much different when you can see a slacker a mile away",
      "author": "timemaninjail",
      "created": 1636097857,
      "upvotes": 5,
      "replies": {}
    },
    "hjd54rw": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd54rw/",
      "text": "Personally i’m not in any class groupmes/snapchat/discord’s bc I refuse to get caught up in a cheating scandal but I will always share my notes to table mates and they do the same for me when I miss lecture.",
      "author": "rynpickles",
      "created": 1636077700,
      "upvotes": 8,
      "replies": {
        "hjd6kgc": {
          "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjd6kgc/",
          "text": "Very valid, I created a discord account that doesn’t have my name at all attached to it for that reason, people are bold in my class for keeping their name on it",
          "author": "sgb1446",
          "created": 1636078371,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjdg76m": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdg76m/",
      "text": "I help in my groupme sometimes but I’ve also taken 2-4 hours to handwrite notes and spent a whole day typing notes. If I notice someone continuously asking for notes and they haven’t put in the same amount of work as me I’d be hesitant. But if it’s like a mutual relationship where they share back in worth that’s fair. Nobody wants to be the idiot that gets taken advantage of and does all the work with nothing in return",
      "author": "SubjectEmu996",
      "created": 1636083106,
      "upvotes": 2,
      "replies": {}
    },
    "hjf73oy": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjf73oy/",
      "text": "I only give my notes to the people I know are actually putting in their best effort, and usually those kinds of people only ask for specific things. It is a courtesy that I would want to be given to me if I happen to miss something in class or need extra help on a certain concept.",
      "author": "JupiterRocket",
      "created": 1636124103,
      "upvotes": 2,
      "replies": {}
    },
    "hjfozqz": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjfozqz/",
      "text": "Depends on the person and what the notes will be used on. If it's just notes based on what the prof says then I don't care. However, if my notes can be used for quizzes/exams then no way will I give them over. Not gonna risk being accused of helping someone cheat.\n\nAnd also, I have never given a stranger stuff over discord unless I heard their voice/seen their face to ensure they weren't a TA/Professor. It's just to be safe of any traps, cuz I know in pretty much all discords I've been in there has always been a TA/Prof account lurking.",
      "author": "LeadingYogurtcloset8",
      "created": 1636131041,
      "upvotes": 1,
      "replies": {}
    },
    "hjdg4x3": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdg4x3/",
      "text": "I am very quick to ask people if theyd like me to send them my notes once I make a friend in the class. But, if someone I dont know asks for them, I decline. I dunno it just rubs me the wrong way. Not bragging but this is relevant, I take very good notes and reading other peoples notes has never helped me, so I wouldnt be interested in an exchange. It just feels like Im being used if a stranger asked me for something thay I spent a ton of time on, especially since in my experience theyve never asked to send their own... because they dont have their own and are trying to take a shortcut. Which is fine, i'm just not going to participate in that",
      "author": "taybay462",
      "created": 1636083073,
      "upvotes": 1,
      "replies": {}
    },
    "hjdja8w": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdja8w/",
      "text": "I think its more of a \"I dont want to put in that much more effort for something extra with no benefit",
      "author": "guy_with-thumbs",
      "created": 1636084762,
      "upvotes": 1,
      "replies": {}
    },
    "hjdjvii": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjdjvii/",
      "text": "People take advantage of you if you share notes lol. It happened in high school and it almost happened again in college",
      "author": "lani500yea",
      "created": 1636085096,
      "upvotes": 1,
      "replies": {}
    },
    "hje6jj0": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hje6jj0/",
      "text": "if the student asking for it has missed one, or even a couple classes due to genuine problems i don’t mind giving my notes\n\nbut if they’re just looking for an easy way out, i’m not gonna be giving away something i spent my time on",
      "author": "chin-muffin",
      "created": 1636102797,
      "upvotes": 1,
      "replies": {}
    },
    "hjepqa0": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjepqa0/",
      "text": "Because we don’t want lazy non-note takers to succeed",
      "author": "yetiman3511",
      "created": 1636116396,
      "upvotes": 1,
      "replies": {}
    },
    "hjeuc0n": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjeuc0n/",
      "text": "If someone consistently asks for notes and rarely attends class/doesn’t pay attention in class, I don’t share my notes. I totally understand what you’re saying about pooling notes together to fill in the gaps, but if someone doesn’t show interest in actually putting in the work in class, pooling notes isn’t going to be helpful anyway. College is about maturing and doing what you need to do for your future. Not going to class (which you’re paying for by the way) and relying on the notes of other people is, in my opinion, not very mature",
      "author": "jakell4748",
      "created": 1636118661,
      "upvotes": 1,
      "replies": {}
    },
    "hjf2wld": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjf2wld/",
      "text": "[removed]",
      "author": null,
      "created": 1636122438,
      "upvotes": 1,
      "replies": {}
    },
    "hjfk0pl": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjfk0pl/",
      "text": "Personally, I put in a lot of effort into looking through all the content in the chapter including worksheets and projects, and neatly summarise them into my notes. This is a very draining process and these notes become very precious to me. They also tend to be a product of active listening when the teacher talks about what is going to be tested. As such, when other students have absolutely no reason to not take their own notes, I refrain from giving mine because I think they deserve it. Definitely sounding mean here, but if they don't give a damn about their studies then clearly I won't, too.",
      "author": "Academic_Credit6232",
      "created": 1636129145,
      "upvotes": 1,
      "replies": {}
    },
    "hjfq0cx": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hjfq0cx/",
      "text": "Idk I've never been one to be stingy. If I can help, happy to. I had a couple classes where the whole lecture class (maybe around 100 ish students) would contribute to a group study guide for exams. It was super nice. Then I had other classes where people were stingy with notes.\n\nEditing to add: it's not harming me in any way to help others out. They still have to study and retain information and it's not extra work for me to let them take pictures of the notes",
      "author": "Peachy_Pastel",
      "created": 1636131436,
      "upvotes": 1,
      "replies": {}
    },
    "hje6hlc": {
      "link": "/r/college/comments/qn05el/why_are_people_so_stingy_with_their_notes/hje6hlc/",
      "text": "There is no reason not to give someone your notes. People sometimes miss lectures and you can never tell if they genuinely couldn't come to some lectures or are slacking off. Everyone gives their notes to friends but are apprehensive about giving them to strangers which I find selfish. Being socially incompetent shouldn't fuck over your academic success so I try to help people as much as possible.",
      "author": "Neat-Substance69",
      "created": 1636102746,
      "upvotes": -1,
      "replies": {}
    }
  }
}