{"sid": "pwlrwl", "link": "/r/college/comments/pwlrwl/switching_major_to_computer_science/", "title:": "Switching Major to Computer Science.", "text": "I am currently a sophomore studying business management but I am feeling very unfulfilled and bored with my major. \n\nI have thought about switching my major to Computer Science. I have started taking some free online courses including CS50 at Harvard. I’m really into the subject but I am worried if I enter the field it may become too hard. \n\nCould someone give a guide of what to expect if I changed my major to computer science", "author": "MrPizzaguy32", "created": 1632763062, "retrieved": 1632945561, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hejw8yc": {"link": "/r/college/comments/pwlrwl/switching_major_to_computer_science/hejw8yc/", "text": "If you've enjoyed those online courses, I would suggest switching to computer science. The computer science curricula at most colleges is a mixture of math and programming. So the programming you've already done has probably given you a good foundation, and the electives you take for a CS degree will be using programming in order to solve problems in computer science. For instance, you might take a class on natural language processing, where you learn about the theory and math behind how computers can understand human speech, and then your assignments will probably be implementing some algorithms or creating a program that utilizes that theory. Common topics for CS classes include operating systems, compilers, AI, machine learning, computer vision, user interfaces, etc. Then you will have to take some foundational math and computer science theory classes, most likely including data structures, algorithms, discrete math, calculus, linear algebra, etc.\n\nComputer science is a very versatile subject, so you'll be able to pursue many different careers effectively if you have a CS degree, including software development (obviously), IT, database administration, data science, sales engineering, UX design, etc. I would definitely recommend making the jump if you feel unfulfilled with your business degree.", "author": "postmaloneismediocre", "created": 1632798858, "upvotes": 1}, "hei5451": {"link": "/r/college/comments/pwlrwl/switching_major_to_computer_science/hei5451/", "text": "As someone who came into my uni as a biochemistry freshman with 100% no coding background, I can safely say that switching to computer science my sophomore year had made me happier than ever. I had similar concerns about difficulty or lack of experience and took a class needed for the major over the summer to test it out and I enjoyed it so decided to switch. It might have helped that being a stem major i was already accustomed to rigid studying expectations/requirements. \n\nIf your reasoning are due to fear of lack of knowledge or difficulty, I say go for it if you’re genuinely open to working towards it. To me it’s similar to learning a new language and required logic and problem solving rather than just memorization. The classes are meant to build up your skills as a computer scientist starting from the ground up, so you don’t have to worry about prior knowledge, you just gotta put in the work.", "author": "CoffeePrincess_", "created": 1632769305, "upvotes": 1}, "hehs88a": {"link": "/r/college/comments/pwlrwl/switching_major_to_computer_science/hehs88a/", "text": "You will do programming and math.  Is that what you are expecting?  The programming will become complex, and the math will become quite abstract.  You will need a decent work ethic to succeed.  If you have an analytical, logical mind it can be a lot of fun.", "author": null, "created": 1632763473, "upvotes": 1}}}