{
  "sid": "czw2s3",
  "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/",
  "title:": "My Roommate Keeps bringing over a guy and it’s too much now..",
  "text": "Okay so to basically sum up how this started, the first time she brought him over was apparently to do some kind of interview thing for one of her classes and she had asked me to leave, but it was more along the lines of “yeah, you’re going to have to get out soon”. I didn’t care at first since I was going out to eat with some kids on my floor in my dorm, but when I got back to the room at 2am he was still there..asleep on her bed. \n\nI didn’t exactly shrug it off and expressed my concerns hoping I wouldn’t have to have another situation like that...until the next day when she brings him over again while I’m trying to help a friend with some chemistry work and guess what, he slept over again. This is two times she’s brought him over without letting me know and with no time to prepare I couldn’t find the right time to go shower or get changed. I told her once again if she could let me know when she is bringing people over. She said ok.\n\nTonight though.. I walk in and see him shirtless getting a massage from one of her friends while they talk about having a threesome but she said she wouldn’t because she’s una loyal relationship. I was hoping they would leave after watching the movie so I could finish my work but..they’re sleeping over and this is now the 3rd time in a row that she has let this happen without telling me ahead of time that she was having people over, sleeping over at that. And now there is a shirtless guy that I’m not exactly comfortable with because I don’t know him in our shared room and another girl in the room as well. I’m fed up with it and I don’t know where to go from here. \n\ntl;dr: Roommate brings random guy over 3rd time in a row without telling me in advance. He always ends up sleeping over.\n\nEdit: Thank you everyone for giving me some advice on to what I should do. I’ll start talking to her about it.",
  "author": "mongreo",
  "created": 1567658240,
  "over_18": false,
  "upvotes": 604,
  "upvote_ratio": 0.99,
  "comments": {
    "ez8q63u": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez8q63u/",
      "text": "Did you sign an agreement with your roommate about rooming policy between you and her, and if so, did you both agree on the lines of sexual conduct?",
      "author": "SnowballRedd",
      "created": 1567753530,
      "upvotes": 1,
      "replies": {}
    },
    "ez8q3z3": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez8q3z3/",
      "text": "Tried sleep goggles and ear plugs?\n\nIf you have, it's time to get tough.",
      "author": "SnowballRedd",
      "created": 1567753447,
      "upvotes": 1,
      "replies": {}
    },
    "ez8eavp": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez8eavp/",
      "text": "sounds like you’re a pussy, must be the life of the party huh",
      "author": null,
      "created": 1567740929,
      "upvotes": 1,
      "replies": {}
    },
    "ez7iqc3": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez7iqc3/",
      "text": "I know the feeling.",
      "author": "andracmat",
      "created": 1567724231,
      "upvotes": 1,
      "replies": {}
    },
    "ez6npmb": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez6npmb/",
      "text": "Eventually I just said fuck it and would walk in and go to bed no matter what they were doing. I talked to my roommate about it and they started going over to her room more, sometimes I think people just need a gentle nudge",
      "author": "Insectshelf3",
      "created": 1567713814,
      "upvotes": 1,
      "replies": {}
    },
    "ez6jkq8": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez6jkq8/",
      "text": "My previous roommates and I had a general rule of thumb; if someone was coming over, let the other know. Sounds like you guys have a breakdown in communication, I'd recommend you attempt to confront her in a calm, yet firm manner and talk about the overnight guest situation. If you have already, or if you feel unsafe doing so, definitely talk to your RA about it to help you with it. She may just genuinely be clueless and oblivious to your privacy.",
      "author": null,
      "created": 1567712809,
      "upvotes": 1,
      "replies": {}
    },
    "ez5yvle": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5yvle/",
      "text": "Are you me? This is happening to me too and I'm not positive how to handle it. It hasn't been multiple nights for me but the whispering and giggling was awful the one night it happened",
      "author": "ms640",
      "created": 1567707009,
      "upvotes": 3,
      "replies": {}
    },
    "ez5y76c": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5y76c/",
      "text": "Im in the exact same situation but with a guy roommate. Shell walk in whenever and even did it in the morning like 8:00 am and stays till midnight",
      "author": "Bradd72",
      "created": 1567706741,
      "upvotes": 1,
      "replies": {}
    },
    "ez5y6wc": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5y6wc/",
      "text": "You live in a shared space. Have a conversation and compromise.",
      "author": "snoboy8999",
      "created": 1567706738,
      "upvotes": 1,
      "replies": {}
    },
    "ez5y0sf": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5y0sf/",
      "text": "must be fun for the guy LMAOOO",
      "author": "tha_oz",
      "created": 1567706676,
      "upvotes": 2,
      "replies": {}
    },
    "ez5t7oc": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5t7oc/",
      "text": "Change roommates, just hope it’s not too late. I can’t tell you how to do that since it’s different for each college but trust me, if they’re doing this now it will only continue",
      "author": "JoJo10Smith",
      "created": 1567704676,
      "upvotes": 2,
      "replies": {}
    },
    "ez5ss1z": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5ss1z/",
      "text": "Immediately tell the RA. Don’t wait around to talk to your roommate again. She has already proven that she does not respect you or is willing to compromise. Immediately tell the RA right now; either by texting or banging on her door. I had the same issues with my previous roommates; except she was bringing different boys on different nights and bringing drugs/alcohol into the room AND smoking in the room. I had spoken to her several times, but she didn’t listen so I immediately involved my RA and the housing manager. It resulted in her leaving voluntarily because I kept arguing with her. Tell the RA. Don’t put up with any “let’s talk this out with our feelings” bullshit. Fuck that. Have it in writing that she keeps violating your space and wishes, and if she keeps it up just go straight to the Dean of the School and the Housing manager. Don’t feel like it’s escalating anything; it’s not. You have as much right to privacy and comfortable living as she does. Otherwise, two can play that game. How about you bring over friends to sleep over? Have them sleep over on the floors and next to her bed. Get them half-naked. Do this for a week straight. But first and foremost talk to the RA IMMEDIATELY AND MAKE SURE SHE/HE DOES THEIR JOBS BECAUSE MINES SURE AS HELL DIDN’T.",
      "author": "WhotheWhatWhatt",
      "created": 1567704445,
      "upvotes": 3,
      "replies": {}
    },
    "ez5q56g": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5q56g/",
      "text": "I'm an RA this year and not only should you talk to them, but fill out ba roommate agreement form if your school has one",
      "author": "crazedturtle77",
      "created": 1567702966,
      "upvotes": 1,
      "replies": {}
    },
    "ez5po4d": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5po4d/",
      "text": "This kinds of things are the reason why a roommate contract is important. if you make this clear in a contract then it is less likely to happen and if it does you can take that bitch to court.",
      "author": "Speedracer98",
      "created": 1567702734,
      "upvotes": 1,
      "replies": {}
    },
    "ez5jbfy": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5jbfy/",
      "text": "Yeah in those situations, you need to just have a discussion with your RA. Your roommate doesn’t care about your space",
      "author": "mikayla_rivera",
      "created": 1567700276,
      "upvotes": 1,
      "replies": {}
    },
    "ez5j68c": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5j68c/",
      "text": "I went through a similar experience my first year, except my roommate at the time is my best friend since middle school. I’m not a very confrontational person and we never had a big fight before till after that experience. I would definitely talk with her and lay down some rules, and if it happens again talk with your RA! I didn’t do anything until it was too late because I had friends who told me I shouldn’t interfere with her new “love” (I introduced her to her now-bf who happened to live upstairs and eventually slept over our room and have make out sessions when they thought I was asleep).",
      "author": "R253",
      "created": 1567700219,
      "upvotes": 1,
      "replies": {}
    },
    "ez5c6bk": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5c6bk/",
      "text": "Damn. looking back, I got super lucky with my roomate. Mitch, if youre reading this you were the man",
      "author": null,
      "created": 1567697957,
      "upvotes": 3,
      "replies": {}
    },
    "ez5awf8": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5awf8/",
      "text": "Also if a RA doesn't change the behavior, go the the housing director. They have a say in what is and isn't allowed and bring authority to the situation. Or get a single room. I have a single room accommodation because of horrible past roommates as well as being anxious and irritable to careless roommates.",
      "author": "REBEL_INDIAN_91",
      "created": 1567697508,
      "upvotes": 1,
      "replies": {}
    },
    "ez56peu": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez56peu/",
      "text": "Your being a pushover and she doesn't expect you to put up a fight because of it. Some people just aren't nice and don't respond much to reasonable requests. You need to be more direct.\n\nEither start making her leave the room when you are studying with someone (taste of her medicine) or tell the RA. Or just dont leave the room and assume they are bluffing and will go somewhere else.",
      "author": null,
      "created": 1567696335,
      "upvotes": 3,
      "replies": {}
    },
    "ez50ch7": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez50ch7/",
      "text": "I have my own bedroom room within a four person suite and I still wouldn't do that, let alone if I was sharing my sleeping space with another person. Honestly just go to the ra if she wants to be dismissive about it.",
      "author": "logsandsmogs",
      "created": 1567694754,
      "upvotes": 2,
      "replies": {}
    },
    "ez4wnjh": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4wnjh/",
      "text": "If you've expressed that you're not comfortable with it and your roommate keeps disregarding your sentiment, you should definitely speak to an RA about it. The fact that she blatantly keeps doing it after you talked about it to her shows that there is no respect there.",
      "author": "Captain_Kaiflow",
      "created": 1567693195,
      "upvotes": 1,
      "replies": {}
    },
    "ez4uvp8": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4uvp8/",
      "text": "I had the exact same thing happen to me freshman year. It was beyond frustrating, I felt unwelcome in the room, and it was uncomfortable! My advice is to talk to your RA ASAP about the issue, make ground rules with your roommate (when guests can come over, if they need to ask, and how long/late can they stay).",
      "author": null,
      "created": 1567692426,
      "upvotes": 6,
      "replies": {}
    },
    "ez4tnbo": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4tnbo/",
      "text": "How is there so many reasonable people around but everyone manages to get roommates from hell?",
      "author": "iamnotajeww",
      "created": 1567691934,
      "upvotes": 44,
      "replies": {
        "ez55kic": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez55kic/",
          "text": "I guess it’s because some people start showing their true colors after some time :/ it’s really shitty",
          "author": "mongreo",
          "created": 1567695935,
          "upvotes": 21,
          "replies": {
            "ez5jqbx": {
              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5jqbx/",
              "text": "My roommate seemed like a decent roommate when I first met him. The last few nights he’s been taking on the phone and watching shitty sitcoms until 5am. I don’t think he’s gone to class this week either.",
              "author": "iamnotajeww",
              "created": 1567700446,
              "upvotes": 12,
              "replies": {
                "ez6zune": {
                  "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez6zune/",
                  "text": "Mine seemed really cool and reasonable too but all he does is play cs:go in his room all day. I don't think he ever goes out. It's kinda annoying.",
                  "author": "GrapesofGatsby",
                  "created": 1567717126,
                  "upvotes": 3,
                  "replies": {
                    "ez717zc": {
                      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez717zc/",
                      "text": "All night as well? If it’s just during the day I don’t see why it would be annoying.",
                      "author": "iamnotajeww",
                      "created": 1567717606,
                      "upvotes": 1,
                      "replies": {
                        "ez73aut": {
                          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez73aut/",
                          "text": "Yeah, like all day. I can hear him talking pretty much 90% of the time I'm home. I'd like to have the place to myself occasionally even if it's just for a couple hours. He just locks himself in his room and never leaves. I wish he'd step out every once in a while.",
                          "author": "GrapesofGatsby",
                          "created": 1567718363,
                          "upvotes": 3,
                          "replies": {
                            "ez7dl4j": {
                              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez7dl4j/",
                              "text": "Fair enough I didn’t realize the scope of it.",
                              "author": "iamnotajeww",
                              "created": 1567722182,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ez615st": {
              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez615st/",
              "text": "Some people see college as a way to get out from under their parents authority, and don't consider that just cause their parents aren't there to scold them doesn't mean that they can get away with being an asshole.",
              "author": "Razgriz01",
              "created": 1567707888,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "ez4t1hc": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4t1hc/",
      "text": "It blows my mind that you guys have to share rooms in the US. I honestly couldn't do it.\n\nIt seems you've already been given some good advice, good luck and I hope you sort it.",
      "author": "Elastichedgehog",
      "created": 1567691695,
      "upvotes": 6,
      "replies": {
        "ez5d1xj": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5d1xj/",
          "text": "If you are absoloutly against having roomates, there are always workarounds, though they cost more money. I do think the system works though cause If I didnt have a roomate I would have been a lot more anti-social and played a lot more videogames.",
          "author": null,
          "created": 1567698212,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ez4mfb3": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4mfb3/",
      "text": "> she said she wouldn’t because she’s una loyal relationship\n\nSo the guy has slept over twice, but she's in a \"loyal\" relationship?",
      "author": "wolf2600",
      "created": 1567689051,
      "upvotes": 12,
      "replies": {
        "ez6gu45": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez6gu45/",
          "text": "Think that was the friend saying that",
          "author": "xMichaelLetsGo",
          "created": 1567712100,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ez4maiz": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4maiz/",
      "text": "Invest in some melatonin and ear plugs. Shitty roommates won’t go away after college. It’s unfortunate but your sleep is priority especially as a student and sometimes you won’t be able to convince your roommate to be a decent human being.",
      "author": null,
      "created": 1567688985,
      "upvotes": -3,
      "replies": {
        "ez4rln3": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4rln3/",
          "text": "That’s why they need to go to the RA and report them",
          "author": null,
          "created": 1567691125,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ez4l3xd": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4l3xd/",
      "text": "Don't you just love people? I'd go report it to the RA and if that doesn't work, head on up to collegiate housing. You're paying to live there.",
      "author": "NoChannel1",
      "created": 1567688494,
      "upvotes": 5,
      "replies": {}
    },
    "ez4kpeu": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4kpeu/",
      "text": "my roomate has this girl sleeping in his bed since the day we moved in 😂 as long as they’re not intimate while they know I’m coming back to the room idrc",
      "author": "amsterdams30193",
      "created": 1567688324,
      "upvotes": 1,
      "replies": {}
    },
    "ez4geql": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4geql/",
      "text": "After reading this I kinda feel glad that I live in a quad where you can't bring anyone over cause it would feel awkward af with so many roommates around",
      "author": "ZeCookieMunsta",
      "created": 1567686461,
      "upvotes": 4,
      "replies": {
        "ez4kbz5": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4kbz5/",
          "text": "I lived in a quad last year. This doesn’t check out",
          "author": "immobilyzed",
          "created": 1567688165,
          "upvotes": 6,
          "replies": {
            "ez4tu1b": {
              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4tu1b/",
              "text": "I mean, not everyone's gonna have the same experience but I definitely feel as if it is less with quads relatively speaking",
              "author": "ZeCookieMunsta",
              "created": 1567692008,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ez4evgi": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4evgi/",
      "text": "Skip the \"talking it over\" which isnt going to work. Start blasting music repeatedly when they are over",
      "author": null,
      "created": 1567685771,
      "upvotes": 23,
      "replies": {
        "ez4t4tq": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4t4tq/",
          "text": "Add strobe lights and you've got a solid plan.",
          "author": "nooutlaw4me",
          "created": 1567691733,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "ez46ped": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez46ped/",
      "text": "Talk to your roommate, maybe you guys can revisit the rules you made, assuming you made them. If you don’t have anything written down now would be a good time to do so. When you get to the part about guests mention why you don’t want an overnight guest every night. Say something like “if I ever have a boyfriend I will give you a warning if he’s coming over and I will ask if he can spend the night early in the day.” This opens the door for her to respond with something similar. If she doesn’t agree to this it’s a good time to get the RA involved.",
      "author": "anonymous_gam",
      "created": 1567681917,
      "upvotes": 10,
      "replies": {}
    },
    "ez3y99p": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez3y99p/",
      "text": "Rooming in college is extremely random. The best thing to do is set firm boundaries from the start, and if you both agree and then they disrespect them, you should bring in a third party like residential operations or the RA in to mediate. Lots of people move out from their initial room, and that's okay. Remember that college is stressful as it is, so experiencing inconveniences inside your room will make the journey even more stressful!",
      "author": "SirMandelbrot",
      "created": 1567677661,
      "upvotes": 83,
      "replies": {}
    },
    "ez3ia7g": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez3ia7g/",
      "text": "It would be worth checking your university's housing policy as well. Although it's 2019 and universities aren't as strict as they were in previous years/decades about visitation policies, some explicitly ban cohabitation.",
      "author": "BourbonCoug",
      "created": 1567667764,
      "upvotes": 97,
      "replies": {
        "ez4n0gv": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4n0gv/",
          "text": "Yes, this - at my university you're not allowed to have guests sleep over more than two nights in a row. Having someone sleep over three times in a row is a violation of the guest policy.",
          "author": "Comrox",
          "created": 1567689282,
          "upvotes": 53,
          "replies": {
            "ez4wk0b": {
              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4wk0b/",
              "text": "At mine you could have them over for as long as you like as long as they get no complaints.",
              "author": "SirMandelbrot",
              "created": 1567693149,
              "upvotes": 9,
              "replies": {
                "ez4xwlv": {
                  "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4xwlv/",
                  "text": "Every university is different.",
                  "author": "Comrox",
                  "created": 1567693783,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            },
            "ez4xg52": {
              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4xg52/",
              "text": "Same with mine. My girlfriend lived with me for a semester lol. The RAs thought she lived there after a certain point. Her and I didn’t really have a choice though.",
              "author": "Quacky1k",
              "created": 1567693576,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ez3evzl": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez3evzl/",
      "text": "IF she's shrugged it off each time, she doesn't respect you. \n\nWelcome to having roommates in college. \n\nI would go to your RA tomorrow and ask her/him if you can change roommates or get a single for the semester. \n\nIt may honestly be better. I have a feeling this is only going to escalate. Best get out now. \n\nMaybe even room with one of the people who you are friends with whom you mentioned that you were getting something to eat with. \n\n&#x200B;\n\nI've had terrible experiences with roommates my first two years. I started living alone after my second semester junior year and I prefer it.",
      "author": null,
      "created": 1567666106,
      "upvotes": 197,
      "replies": {}
    },
    "ez3a6nn": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez3a6nn/",
      "text": "It may be helpful to see if she will be willing to have a 1-on-1 conversation with you first about the situation. I would try this first since maybe your roommate isn’t aware that she’s being inconsiderate to you and talking it over may help resolve things.\n\nIf she just shrugs off your request and still continues to do it (based on what this post is suggesting), then I would start talking to your RA about the situation. The RA should be able to help out any of their residents with any concerns that arise especially those to roommate problems.\n\nYou may also need to talk to higher authority if your RA also just shrugs it off, but I only suggest that as a last resort. It sucks that you are currently in this situation, but at least you want to do something about it and that’s a good start. I wish you the best of luck cause you got this!",
      "author": "ranych",
      "created": 1567663587,
      "upvotes": 36,
      "replies": {
        "ez472jx": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez472jx/",
          "text": "I’m going to have a conversation with her about it later when her friends aren’t there so there is no drama. If she doesn’t comply then I’ll just speak to my RA. Thanks for the advice.",
          "author": "mongreo",
          "created": 1567682130,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "ez2y86d": {
      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez2y86d/",
      "text": "If you've expressed your concerns to her and still haven't been acknowledged, bring in the RA to mediate.",
      "author": "mrbmi513",
      "created": 1567659387,
      "upvotes": 573,
      "replies": {
        "ez31833": {
          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez31833/",
          "text": "That’s what I’ll have to try in the morning. Right now I’m trying to sleep through the giggling and talking..",
          "author": "mongreo",
          "created": 1567660059,
          "upvotes": 241,
          "replies": {
            "ez3z52a": {
              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez3z52a/",
              "text": "I've been through the same thing. My first year at college I had an absolutely awful roommate who one night brought over her dude.\n\nThey thought I was sleeping and I heard her whisper \"no it's okay (x) is asleep\" and then started making out... As if me being asleep changed anything. I don't want you to fuck underneath me in our bunk bed for god's sake.\n\nDefinitely take it to the RA",
              "author": null,
              "created": 1567678088,
              "upvotes": 158,
              "replies": {
                "ez5d9r2": {
                  "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5d9r2/",
                  "text": "See I'm such a bitch I would flat out say \"No, I'm not I can hear every gross thing tiny dick boy is doing to you down there.\" \n\nIt would both ruin the mood, and make my point.",
                  "author": "dabeeisme",
                  "created": 1567698255,
                  "upvotes": 68,
                  "replies": {
                    "ez5pl7w": {
                      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5pl7w/",
                      "text": "Be careful wit this one because he could very well whip it out on you just to show proof.",
                      "author": "Chi-Cam",
                      "created": 1567702696,
                      "upvotes": 13,
                      "replies": {
                        "ez5pp1z": {
                          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez5pp1z/",
                          "text": "Yeah, it's not good advice at all. It's what would probably come out of my mouth though. This wonderful limited filter of mine.",
                          "author": "dabeeisme",
                          "created": 1567702746,
                          "upvotes": 13,
                          "replies": {}
                        },
                        "ez6gzvx": {
                          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez6gzvx/",
                          "text": "\\*plomp\\*",
                          "author": "_34_",
                          "created": 1567712147,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ez4rf75": {
                  "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez4rf75/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1567691053,
                  "upvotes": 10,
                  "replies": {
                    "ez53043": {
                      "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez53043/",
                      "text": "Reminds me of this scene from how I met your mother\n\nhttps://youtu.be/VV8sLJJdS04",
                      "author": "LordBrackets",
                      "created": 1567695392,
                      "upvotes": 3,
                      "replies": {
                        "ez56dl5": {
                          "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez56dl5/",
                          "text": "Reminds me of this [scene](https://media1.tenor.com/images/4ca5608f39c274a4db0faecb8e451bd5/tenor.gif?itemid=14869868) from deadpool 2",
                          "author": null,
                          "created": 1567696219,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "ez6gjq2": {
              "link": "/r/college/comments/czw2s3/my_roommate_keeps_bringing_over_a_guy_and_its_too/ez6gjq2/",
              "text": "Most campus housing and even off-campus housing if it's sponsored by the school will all have terms in the lease specifying no guests between x and y hours. Definitely look into the lease and talk to the housing managers.",
              "author": "Cormandragon",
              "created": 1567711993,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634056048
}