{"sid": "a1i7vq", "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/", "title:": "I’m about to answer every one of your questions", "text": "• Talk to your professor\n\n• Talk to your guidance counselor / academic advisor\n\n• Talk to your parents\n\n• Talk to a therapist\n\n• Talk to Google\n\n90% of the questions we get on this sub can be answered by following any of the points I just listed.\n\nObviously we are here to help, but we don’t know everything about your current situation. Most of us are college students just like you. But the people I just listed? It’s their job to help you.\n", "author": "Relevated", "created": 1543504846, "retrieved": 1632802108, "over_18": false, "upvotes": 1109, "upvote_ratio": 0.92, "comments": {"eaq737v": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq737v/", "text": "You can all help us improve the content of r/college by using the \"Report\" feature.  If you see a post or comment that seems to violate one of our sub rules (among them being \"ask your professor/read the paperwork/do your own research\"), please report it.  You have a team of moderators who look at every report made and will happily remove content that isn't helpful.  We cull as much as we can, but often times we just miss stuff.", "author": "ecklesweb", "created": 1543511817, "upvotes": 1}, "eas7fhi": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eas7fhi/", "text": "Here’s a thought: if you don’t like what people post in a thread, leave the thread.\n\nYeah, some may post silly and ridiculous questions on here, but isn’t that the point of Reddit in general?\n\nMost, keyword “most,” advisors do not know shit, nor do they really care about every single student. Do you know how many students they are responsible for? It’s nearly impossible for them to effectively help every student, especially at schools with a huge student body. Not all professors are helpful either and they definitely do not have the time to guide every student who comes their way.\n\nIt’s hard to know everyone’s parent situation. “Talk to your parents” is not an option for everyone for numerous reasons.  Some parents simply don’t care/support their child when they go to college and other parents may know absolutely nothing about higher education whatsoever. \n\nCertainly, Google can provide answers to some questions, but not all of them. What’s wrong with seeking some input from actual college students who generally experience the same situations in one way or another? Just because someone asks for the advice of strangers, doesn’t mean that they’re going to do that 100%. Besides, what’s the difference between listening to an answer created on Google by whoever and someone who actually goes to or went to college?\n\nNot everyone can afford to see a therapist. Yes, some schools do provide students with someone to speak to along those lines, but it’s not easily accessible for everyone at every school. Some require separate payments. Some require a bunch of sessions. Just because someone had a bad day and posted about it on Reddit, doesn’t mean they need to see a therapist. \n\nEverything is different for everyone. Sometimes, we just like to have others to talk to who experienced or who are experiencing similar situations. ", "author": "eternal_blackness17", "created": 1543581541, "upvotes": 2}, "earm249": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earm249/", "text": "You forgot roommates and chegg", "author": "sm2016", "created": 1543552110, "upvotes": 2}, "earajp8": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earajp8/", "text": "\\>Talk to a therapist   \n\nLook at mr moneybags over here", "author": "destructor_rph", "created": 1543542304, "upvotes": -1}, "eara9m5": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eara9m5/", "text": "I would also like to add:\n\nLearn to write a resume.  Learn to write a resume to cater to xxx job requirments.\n\nDon't expect an internship to be handed to you.  Put yourself out there, temp agency, volunteer.  Something.  Even as a marketing major you can make up some flyers for a food bank with a map and hours.  Even if you have to work for peanuts at first.\n\nLEARN TO MANAGE YOUR MONEY.\n\nGO TO CLASS.\n\nIf you find your self in a major that is way over your head, back out.  \n\nIf this is your 5th, 6th, or even 7th attempt at (example) Calculus or upper division Physics....change majors.  Not every job at there requires Calculus.  Not everyone is good at that kind of math/science.  Not everyone is good at English, History, or theater.\n\nIf your parents demand you attend a certain school and/or earn a certain degree- pay for college yourself.  Get the degree you want, not what they want.\n\nMany, many jobs only require an Assoicates degree to be successful.  \n\nDon't let money or status dictate your major.  Yes, earning enough money to support yourself is great.  But if your in a major just because you might end up earning $110,000 a year and your failing half your classes and your miserable, it's not worth it.\n\nYes you will have to go into debt to afford college.  But be smart.  Virtually no degree is worth graduating $100K in the hole.\n\nPsychology majors and Liberal Arts Majors are still needed.  People do still hire them.\n\nDon't assume the minute you earn you undergrad means your done learning.  Never stop improving your skills.", "author": null, "created": 1543542049, "upvotes": 6}, "ear7pdk": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear7pdk/", "text": "If i stumbled across this sub, before i decided to go to college, i would've probably noped out. I mean everybody there hates you, professors make you fail classes, weirdos actually try to start conversations with you and much worse... Ugghh", "author": "baRRaccudax", "created": 1543539799, "upvotes": 2}, "ear6th9": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear6th9/", "text": "You forgot \"search the sub.\" \n\nMany questions can be answered by reading past relevant threads. ", "author": "Comrox", "created": 1543539007, "upvotes": 2}, "eaqwwlt": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqwwlt/", "text": "I’ve done all those things, but r/college is full of people going threw the exact thing I am. As crammed as my schedule is and fearful my classmates are to admit they are crushed.  This thread is a great reminder that I’m not alone in needing 7 sources of help. \n\nThat’s what r/college is for. ", "author": null, "created": 1543530588, "upvotes": 3}, "eaqsg70": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqsg70/", "text": "Also for the therapist one- most colleges have psychologists there to help you manage stress and anxiety because it’s so common for college students!! ", "author": "audphin", "created": 1543527139, "upvotes": 2}, "eaqsevt": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqsevt/", "text": "Well that can be attributed to most subreddits with the exception of the first two. You act like you just solved all problems in the world lol", "author": "Nullveer", "created": 1543527112, "upvotes": 3}, "eaqp536": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqp536/", "text": "Also, talk to your RA and/or the people above them.", "author": "Diddy_8D", "created": 1543524656, "upvotes": 1}, "eaqo279": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqo279/", "text": "Therapy is a waste of time and money.", "author": "send_me_them_tits_", "created": 1543523864, "upvotes": -5}, "eaqg2ie": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqg2ie/", "text": "Don't talk to your advisor (at least if you're undergrad), I've never had one that knew the first thing about what was best for me. Or even cared to know. Just look at your degree plan, and plot it out yourself.", "author": "redzilla500", "created": 1543518043, "upvotes": 1}, "eaqba3p": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqba3p/", "text": "A lot of student handbooks are free online for everyone and have details specific to the school, especially regarding scholarships, degrees, disciplinary issues, and other  topics. ", "author": null, "created": 1543514695, "upvotes": 2}, "eaq8wze": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq8wze/", "text": "Also read the shit you're given to read.", "author": "SweetBabyBeelz", "created": 1543513103, "upvotes": 7}, "eaq7jja": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq7jja/", "text": "Eh. A lot of questions are hard to find on google, but also don't necessarily warrant a professor or advisors attention. That's the point of this sub. Obviously there are some that are just bad questions (what should I major in?), though.", "author": "MetallicGray", "created": 1543512136, "upvotes": 4}, "eaq778j": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq778j/", "text": "You forgot \"talk to your roommate\"", "author": "fffw001", "created": 1543511894, "upvotes": 11}, "eaq5g4v": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq5g4v/", "text": "But, what major should I pick? When should I change my major? What school is teh bestest?  How do I get a job during/after school?\n\nThese are the questions that I need strangers to answer for me.", "author": "Inactive_Account", "created": 1543510656, "upvotes": 56}, "eaq4olu": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq4olu/", "text": "I think a lot of people tend to trust the advice from their peers more than from advisors or counselors, because advisors don't really have any incentive to be honest. They work for the university, so it makes sense for them to simply say whatever benefits the university, not the student.\n", "author": null, "created": 1543510110, "upvotes": 47}, "eaq3o55": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq3o55/", "text": "• Talk to your roommate. Just be a normal human being and communicate.", "author": "Vincent_Soprillo", "created": 1543509388, "upvotes": 181}, "eaq2fxp": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq2fxp/", "text": "Reminds me of how 99% of threads on legaladvice eventually come around to \"maybe you should talk to a lawyer?\"", "author": "ElegantTobacco", "created": 1543508502, "upvotes": 508}, "eaq245q": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq245q/", "text": "Financial aid office too.", "author": "wolf2600", "created": 1543508267, "upvotes": 12}, "eaq0f8y": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq0f8y/", "text": "This is such good advice. I have went to my guidance counselor with all of my simple and complicated questions, they seriously know everything. And when they dont, Google does 😅", "author": "-imnotunique-", "created": 1543507048, "upvotes": 19}, "eaq08hw": {"link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq08hw/", "text": "Stackoverflow is great too. ", "author": "BaoZaker", "created": 1543506918, "upvotes": 209}}}