{"sid": "ftuc3h", "link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/", "title:": "Does anyone else get headaches from staring at a computer screen to long? How do you combat this?", "text": "I'm taking 19 credit hours currently which is an okay work load for me, however since everything has been moved online due to covid-19 I have been suffering from headaches due to my lectures being on zoom as well as the majority of my homework. \n\nAfter sitting through online lectures all morning and on some days throughout the afternoon I have a hard time doing my homework afterwards because my head is already killing me. Is there any way to prevent this from happening? I want to do my homework but I've been putting it off because the eye strain and headaches are driving me nuts. I have been able to do the homework that's on paper but otherwise I'm worthless right now.\n\nEDIT: I did not expect this post to blow up this much. Thanks y'all for the advice I will definitely put it to good use, and Hopefully it will help out others who have encountered similar issues during these tough times. Best of luck!", "author": "anon_throwaway13579", "created": 1585860814, "retrieved": 1632802089, "over_18": false, "upvotes": 1154, "upvote_ratio": 0.99, "comments": {"fmbrzus": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmbrzus/", "text": "I take a nap", "author": "KrumpusInTheChimney", "created": 1585932136, "upvotes": 2}, "fmaz83l": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmaz83l/", "text": "Use artificial tears to avoid dry eyes. Dry eyes can be the result of staring at screen too much and personally I get a headache whenever my eyes are dry.", "author": "shayankb", "created": 1585913502, "upvotes": 1}, "fmat8o8": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmat8o8/", "text": "I aslo support the idea of 20 20 20 rule. Not only I get  headaches, but also my eyes ache so much. Focusing on the far field of view and then on a short field of view really helps.", "author": "Kate_Katy", "created": 1585906914, "upvotes": 1}, "fmaoe9p": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmaoe9p/", "text": "I’ve seen blue light filters and the 20 20 rule just on a quick scroll through, but if it’s a fixed workplace, desktop computer with a typical monitor, I’ve heard a normal run of white LEDs with the 3m backing mounted to the back of your monitor so it’s shining on the wall can help to reduce eye strain. Something about it being a softer transition from an active light source? Don’t quote me on this as it’s a tip that’s off the top of my head from several years ago when I started spending more time on my computer for work and school.", "author": "OGDergon", "created": 1585901454, "upvotes": 1}, "fmanceh": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmanceh/", "text": " lots of water and my blue light glasses help me tbh", "author": "porkandnoodles", "created": 1585900287, "upvotes": 1}, "fmamky4": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmamky4/", "text": "I got some blue light filtering glasses. Particularly useful for avoiding headaches during all nighters.", "author": "Daedalus0x00", "created": 1585899470, "upvotes": 1}, "fmamf6n": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmamf6n/", "text": "It is important to take breaks. Look at something green outside the window. Also, perhaps your computer has a \"reader mode\" setting which should be less harsh on the eyes.", "author": "snailwiz", "created": 1585899303, "upvotes": 1}, "fmaluwm": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmaluwm/", "text": "Every  10-15 minutes get up, stretch for just a little, look trough the window and sit back.   \nDOWNLOAD F.LUX. Especially during the nights, sitting on blue screen is a way to kill your eyes. If you are on a laptop, its even worse. Much worse. Especially on an older screen. And by much worse i'd go with like 7-8 times worse.   \nLights on during the nights and late days unless the room is really well lit.\n\nThis is probably all you need.", "author": "ClutchMeister69", "created": 1585898701, "upvotes": 1}, "fmaldv5": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmaldv5/", "text": "I mentioned this to my eye dr during a visit and she did a quick test for tension in eye muscles. Essentially it came down to my eyes having difficulty focusing and ended up giving me headaches. Apparently there are reading glasses/lenses made just for this.", "author": "Hermes85", "created": 1585898197, "upvotes": 1}, "fmakm0y": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmakm0y/", "text": "No but for school work I use my gaming PC which has a blue light filter in the monitor I got so that might have something to do with it, however I had this real shitty lamp that was that ultra bright almost blue light, got rid of it because I had headaches everyday and my eyes felt like they were on fire", "author": "NorthernLaw", "created": 1585897395, "upvotes": 1}, "fmakkh7": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmakkh7/", "text": "I totally get this! I’ve found that +1 reading glasses (you can get them on amazon, although not sure about right now) really reduce the strain you get from looking at blue light. Agree with the people who said to look at something else once in a while and take breaks if you can! Also, if you have a blue light filter on your computer or something like night mode, make sure to try turning that on. If not, lower the brightness all the way. I hope you find something that works for you! Take care :D", "author": "sensitivetheswan", "created": 1585897351, "upvotes": 2}, "fmajgqy": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmajgqy/", "text": "Turn on night light/night mode and then reduce the brightness level from there", "author": "Melon-Kolly", "created": 1585896230, "upvotes": 2}, "fmagtxh": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmagtxh/", "text": "I went to the eye doctor because of frequent behind-the-eyes migraines---thought I needed glasses. The doctor just told me to use eye drops every 4 hours. Works like a miracle. Apparently we blink less when screen staring.", "author": "partysloth0", "created": 1585893673, "upvotes": 1}, "fmafzry": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmafzry/", "text": "I'm super sorry if this stuff has been said before, but\n1- windows dark theme is very nice\n2- I'm assuming you use chrome. there are a ton of extensions that add a dark theme to common websites like Google and YouTube\n2.5- there's some extensions that will invert the colors on websites, and they usually look pretty nice. really good for reading long articles and stuff\n3- if you wear glasses, ask about a blue-light filter being built into them. you really don't notice it's there, but it helps out a ton. they also make glasses that add a yellow tint if you don't normally wear glasses. they usually look pretty goofy, but they do help\n4- enable night light or whatever computer os your using's blue light filter. that helps out the most. your eyes just aren't made to staring at that harsh, blue light for that long period of time 5- eye drops and staying super hydrated are key 6- not sure where your budget is, but if it allows for it, invest in a monitor! seeing things on a bigger screen has really helped out with my eye strain (especially with my Excel courses. Excel on a laptop screen usually hurt my eyes). you can honestly find really decent ~24\" ones for 80-100 dollars. I would get a 1080p monitor. 720p makes the text too blurry imo", "author": "memebr0ker", "created": 1585892890, "upvotes": 2}, "fmafodd": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmafodd/", "text": "Cries in computer science.", "author": "glegori", "created": 1585892601, "upvotes": 1}, "fmadahm": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmadahm/", "text": "I didn’t see anyone else say this yet, so don’t forget to stay hydrated. If you’re on a screen for a long period of time you might forget to drink water. Keep a bottle/glass of water by your side and chug it every now and then.", "author": "GyroBallMetagross", "created": 1585890470, "upvotes": 1}, "fmabxzz": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmabxzz/", "text": "get up and take a break every 45 minutes to an hour. sitting for so long on a computer is horrible, standing up and going to the bathroom or just walking into a different room for a few minutes helps a ton with getting the strain off your eyes and the rest of your bidet from sitting for so long", "author": "carminehk", "created": 1585889324, "upvotes": 1}, "fmaagvs": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmaagvs/", "text": "I know it's been said but night light, I permanently keep it on at about 60% effect, after a week you get so used to it, it hurts your eyes using Google when it turns off because pure white is very harsh on the eyes", "author": "TheDarkSwann", "created": 1585888131, "upvotes": 1}, "fmaaa8l": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fmaaa8l/", "text": "I got UV Light protection on my prescriptions glasses >5 years ago and it is AMAZING! If you live in a snowy state I also recommend getting them as they help prevent ‘snow blindness’.", "author": "cinthylo", "created": 1585887979, "upvotes": 1}, "fma93tj": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma93tj/", "text": "I get migraines. I got some yellow tinted blue light filter glasses and haven’t had any problems since. One of the best purchases of my life considering I use computers most the day for work.", "author": "Jsteph262", "created": 1585887052, "upvotes": 1}, "fma8hn0": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma8hn0/", "text": "Try blue light blocking glasses. I have migraines and this helps a lot.", "author": null, "created": 1585886574, "upvotes": 1}, "fma8fwx": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma8fwx/", "text": "Look for you computer display/monitor settings and see if it has a blue light filter (your phone has this option too!) \n\nThe blue light filter reduces blue light, which can irritate a lot of people's eyes after a while.", "author": "PotOfGreed98", "created": 1585886537, "upvotes": 1}, "fma7gdw": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma7gdw/", "text": "turn down the display brightness. wear sunglasses. take breaks every 20mins. try listening to the lecture audio without looking at the screen (or look minimally if you need to see an equation or something)", "author": "Speedracer98", "created": 1585885793, "upvotes": 2}, "fma5p3u": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma5p3u/", "text": "If it’s available to you once the corona madness is “over”, I recommend seeing an eye doctor to get tested. You may need prescription glasses / contacts.", "author": "futongbo", "created": 1585884484, "upvotes": 2}, "fma47k4": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma47k4/", "text": "Yes, it happens to me.  Take a break, and stay hydrated.", "author": null, "created": 1585883407, "upvotes": 1}, "fma37v6": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma37v6/", "text": "blue light protection glasses.", "author": "Zelera", "created": 1585882706, "upvotes": 1}, "fma28ll": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma28ll/", "text": "Use a blue light fliter on a higher setting 24/7", "author": "asian25black25", "created": 1585882023, "upvotes": 1}, "fma21zo": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma21zo/", "text": "Your eye muscles relax when looking at a far thing and contract when trying to look at a close thing. That's why people are telling you about that 20-20-20 rule. \n\nNow for brightness, download F.lux\nIt can reduce the blue light coming from the screen which makes it easier on the eyes.", "author": "Relrik", "created": 1585881897, "upvotes": 1}, "fma023j": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fma023j/", "text": "It may be time for reading glasses.", "author": "im_not_really_batman", "created": 1585880525, "upvotes": 1}, "fm9zyj6": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9zyj6/", "text": "Oh is that what it is? I’ve also been getting headaches recently but that would explain it", "author": "dogfobia", "created": 1585880456, "upvotes": 2}, "fm9zusb": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9zusb/", "text": "Sounds like you need glasses and get blue light glass installed in them aswell. Now 12+hours a day will be no prob for the eyes atleast.", "author": "vikto000", "created": 1585880384, "upvotes": 1}, "fm9zpbd": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9zpbd/", "text": "If you can invest a little money Felix Gray glasses have helped me a lot with the same issue. Full time developer here", "author": "adeebabbas", "created": 1585880280, "upvotes": 1}, "fm9zlvo": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9zlvo/", "text": "Try some blue-light blocking glasses. Or even migraine glasses. Or even sunglasses. It sounds stupid but it works.", "author": "arlomilano", "created": 1585880219, "upvotes": 1}, "fm9yyxu": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9yyxu/", "text": "I'll throw this in, you might try reading glasses with a very low correction value. (And can get them with the blue-light blocking tint built in). If you are having to strain your eyes even a tiny bit to read the screen that can add up to a lot of tension by the end of day.", "author": "trailmix_pprof", "created": 1585879782, "upvotes": 2}, "fm9yrkc": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9yrkc/", "text": "Posture may also be a factor. Look up computer use neck stretches, b/c there's a good chance tight neck muscles are increasing pressure on nerves", "author": "IReallyNeedANewName", "created": 1585879643, "upvotes": 1}, "fm9y166": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9y166/", "text": "I'm going to break from what everyone else is saying and say, make sure your seating position and monitor height are comfortable.\n\nIf you're stressing the muscles in your neck, they pull at the muscle/skin/nerves etc that go over your head and can trigger a headache. If it feels like it goes across your head from one side to the other, it's almost certainly how you're sitting that's the problem. Adjust your chair to where you can sit comfortable. Lumbar and head supports can help.\n\nIf you have pain in the back of your head, your monitor is probably too high or too low and you're straining the muscles up the back of your neck and head. You'll feel it from the point where your neck and skull meet upward to the top of your head.\n\nEye strain etc. you'll feel more in the front of your head, then listen to everyone else.\n\nAlso a cold compress can help.\n\nTake more breaks, stretch, walk around a bit etc. It'll help a lot.", "author": "random_dent", "created": 1585879149, "upvotes": 16}, "fm9y123": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9y123/", "text": "Heroin.", "author": "WeedIronMoneyNTheUSA", "created": 1585879147, "upvotes": 2}, "fm9xont": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9xont/", "text": "- I wear glasses — blue light filter on my glasses\n\n- Blue light filter on my phone (iOS night shift always turned on) + blue light screen protector (protector prolly isn’t doing shit)\n\n- f.lux at work — everyone in my office makes fun of me for it (I use it at a specific setting all day instead of it changing)\n\n- redshift at home — cuz linux\n\n- brightness on all of my monitors and phone is turned down as low as I can deal with\n\n- used to turn down TV’s brightness but I turn it up now for that theater experience. Movie theaters and 3 hour or so TV binging still give me headaches and eye strain. Music is more my thing anyways", "author": "PM_ME_YOUR_STOCKPIX", "created": 1585878919, "upvotes": 1}, "fm9x962": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9x962/", "text": "Make sure your posture is proper. Stretch your neck and shoulders everyday. I always thought my headaches were caused by computer light, but then I started stretching my neck and found my headaches went away after a week.", "author": null, "created": 1585878636, "upvotes": 1}, "fm9x4om": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9x4om/", "text": "1. Blue light filter\n2. Less brightness\n3. Neck position\n4. Shoulder position\n5. Reduce tension", "author": "implicit_feelings", "created": 1585878556, "upvotes": 2}, "fm9vsbj": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9vsbj/", "text": "I got glasses bc after spending hours doing my homework online last semester my literal eyeballs would hurt and driving back home would be really bad. They didn't cost too much, only $20 and they have helped SO much. Good investment. I'm also using the night light on windows 🤷‍♀️", "author": "engineer_thiz", "created": 1585877689, "upvotes": 2}, "fm9usho": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9usho/", "text": "Higher resolution monitor helped me. I didn’t have it too bad with my really old 720p monitor and I upgraded to a ultrawide 2k monitor and I can sit infront for 8 hours and then I feel headache. Def like some sort of filter glasses or put a whole filter wrap screen!", "author": "dankha", "created": 1585877048, "upvotes": 1}, "fm9unkp": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9unkp/", "text": "Ever tried blue light glasses?", "author": "Shay_the_Ent", "created": 1585876959, "upvotes": 1}, "fm9ugeu": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9ugeu/", "text": "This happened to me my sophomore year, it turns out I needed prescription glasses because I would get tension headaches from subtly squinting. The blue light filter ones are okay but they feel like more of a fad than a helpful tool.", "author": "Naugtae", "created": 1585876830, "upvotes": 3}, "fm9txq2": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9txq2/", "text": "I keep my computer and tablet screen brightness every low and use dark mode and etc. Take breaks.", "author": "Carmen_Ech", "created": 1585876498, "upvotes": 1}, "fm9rdcu": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9rdcu/", "text": "Glasses with a blue light protector help.", "author": "isa-boy", "created": 1585874844, "upvotes": 1}, "fm9r9iw": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9r9iw/", "text": "Everything everyone else said about blue light filters but also make sure to move around a bit. It can just be moving your neck or massaging your neck but it can help!", "author": "mintaurus", "created": 1585874776, "upvotes": 1}, "fm9qvig": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9qvig/", "text": "I have an eye condition so I get eye strain. \n\nI make sure I take breaks every 30 mins where I'm not looking at my screen", "author": "nickthatknack", "created": 1585874526, "upvotes": 1}, "fm9pgtk": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9pgtk/", "text": "Wear Blue light glasses", "author": "blondedAZ", "created": 1585873634, "upvotes": 1}, "fm9p4w3": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9p4w3/", "text": "Soak some of those dry makeup remover pads in milk and put them over your eyes for ten minutes", "author": "livieluv", "created": 1585873422, "upvotes": 1}, "fm9p14z": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9p14z/", "text": "Honestly, blue light glasses are pretty cheap on Amazon if you would be willing to invest in something to help you in the long-term. But, if you would prefer to try other options that's fine too so some computers have a blue light filter and that can help.", "author": "madshacks", "created": 1585873357, "upvotes": 1}, "fm9p13d": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9p13d/", "text": " This is definitely why I’ve been getting more headaches ever since I came home", "author": "John_m33", "created": 1585873356, "upvotes": 2}, "fm9ozmz": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9ozmz/", "text": "Not easily available for everyone, but Blue Light Glasses work wonders. I had a blue light filter added to my regular subscription and have been fine since.", "author": "wolfman616", "created": 1585873330, "upvotes": 1}, "fm9o5pd": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9o5pd/", "text": "If things get really bad, you might want to look into software that reads texts aloud. I get a free subscription from my school. Yours might offer something simuler. You could also try using an e ink tablet or kindle.", "author": "imgonnawingit", "created": 1585872812, "upvotes": 2}, "fm9nvvf": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9nvvf/", "text": "I purchased a pair of blue light glasses and they have worked wonders for my eyes. Last semester finals was the first time where I didn’t have to take consistent breaks to keep my eyes and head from exploding thanks to the glasses", "author": "johnsson330", "created": 1585872638, "upvotes": 1}, "fm9nuyc": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9nuyc/", "text": "I bought some blue light glasses, and that helped a lot.\n\nTake breaks from staring at the screen. Go outside in your yard and walk around (if you have a yard).\n\nI’ve found though that after you fix the eye strain problem you begin having pain from shit posture.", "author": "TooFarFromComfort", "created": 1585872621, "upvotes": 1}, "fm9n6rs": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9n6rs/", "text": "My glasses have a blue light filter so that helps me.", "author": "JoeJoe1492", "created": 1585872198, "upvotes": 1}, "fm9mmgm": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9mmgm/", "text": "Not to beat a dead horse but look into blue light filtering glasses. They’re fairly cheap on Amazon and make a world of difference! Just try to work in some time to use a screen without them so your eyes don’t become completely dependent on them", "author": "RadicalRoland", "created": 1585871867, "upvotes": 1}, "fm9miet": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9miet/", "text": "I used to have the same problem as you! Here's how I solved mine:\n\n1. Download f.lux (free app just like the windows built-in blue light filter, but I find this better)\n2. You may have dry-eyes, get dry-eye drops from Walmart\n3. Blink often!!!!!\n4. Study in pomodoro sessions, and take rest from the screen. This is the concept behind 20-20-20 rule but I find this more practical and easy to remember!\n5. I find a privacy screen filter (they are a bit pricey on Amazon) also help me at work to reduce eyestrain.\n6. Avoid using cellphones as much possible (because of the small screen real estate)\n7. Use DARK MODE on every single website/app you visit!!!! There are extensions and apps to make whatever you want (be it your email client, web browser, social media, websites, apps, anything) into DARK MODE!!", "author": "HomonculusHunter", "created": 1585871803, "upvotes": 11}, "fm9lwx1": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9lwx1/", "text": "Blue light filter....... Amazon sells blue light glasses for about $15\n\ntry to \"unfocus\" your eyes by not staring at any screen (phone too) for about 10 minutes after each class", "author": "Redd889", "created": 1585871449, "upvotes": 1}, "fm9ldfp": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9ldfp/", "text": "Tape ice cubes to your eyes and jack off. Works for me every time.", "author": "Possible-height", "created": 1585871119, "upvotes": -4}, "fm9l8fh": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9l8fh/", "text": "Turn on the nightlight feature on your computer and use dark mode. It helps me significantly", "author": "Bubba_Lou_22", "created": 1585871034, "upvotes": 3}, "fm9l4wf": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9l4wf/", "text": "Try using f.lux. This app help reduces and filters blue lights from your monitor.  \n\n[https://justgetflux.com/](https://justgetflux.com/)", "author": "Mikado_Lee", "created": 1585870973, "upvotes": 49}, "fm9iqqe": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9iqqe/", "text": "I have glasses that have lenses that cancel out “blue light” which is apparently the type of light that computers or screens give off which can give you headaches, I’ve never had problems with headaches, but reviews are mixed on whether blue light cancelling glasses actually work.", "author": "CompetitiveNarwhal5", "created": 1585869566, "upvotes": 6}, "fm9hbnr": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9hbnr/", "text": "i do too & i don't have answers", "author": "chilicheesedoggo", "created": 1585868740, "upvotes": 7}, "fm9gh9x": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9gh9x/", "text": "How old is the screen you are using? Some screens have pretty bad flicker which is the worst for eye strain.", "author": "hzumbru1", "created": 1585868248, "upvotes": 11}, "fm9ddzg": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9ddzg/", "text": "Def recommend getting blue light glasses. I used to get frequent headaches and they stopped as soon as I got my glasses!", "author": "abokadogirl", "created": 1585866455, "upvotes": 55}, "fm9d29y": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm9d29y/", "text": "Use your computer in a well lit room, helps reduce eye strain.", "author": "Yankeeclipper17", "created": 1585866269, "upvotes": 23}, "fm95skv": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm95skv/", "text": "I have a few friends who are like art majors who focus on like digital art. They bought special classes that help with the light computers emit. They say they help a lot", "author": "night2016", "created": 1585862252, "upvotes": 12}, "fm94ajw": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm94ajw/", "text": "If you have a blue light filter on your computer (Windows has one built in, not sure about mac), try using it at night.", "author": "mrbmi513", "created": 1585861445, "upvotes": 166}, "fm938ni": {"link": "/r/college/comments/ftuc3h/does_anyone_else_get_headaches_from_staring_at_a/fm938ni/", "text": "20 20 20 rule.\n\nEvery 20 minutes look at something 20 feet or further away for 20 or more seconds.", "author": "simmelianben", "created": 1585860876, "upvotes": 515}}}