{
  "sid": "qfz9yp",
  "link": "/r/college/comments/qfz9yp/long_story_in_my_4th_year_of_college_and_im_lost/",
  "title:": "*LONG STORY* In my 4th year of college and I'm lost as hell. Any advice?",
  "text": "I started college Fall 2018,\n\nat this local school I was a Biology Major for 1 year with hopes on getting into physical therapy school after I completed my bachelors. I had a 3.0 GPA after that 1 year. \n\nI ended up transferring after that 1 year to a state school 6 hours away that originally rejected my first application out of highschool so I could get that \"college experience\". \n\nWhile I was away at this second school, still a bio major completing classes, during my nightly facetimes with my mom she persuaded me to try and become a nurse and drop my PT route. i'll admit I don't remember if I brought up the topic or she did because the work at the new school was indeed difficult but the conversation happened nonetheless. \n\nWhat she was saying over the phone was making sense at the time (the pay is extremely good, you're only in school for 2 years) etc and I took the idea and ran with it. Her and my uncle are both nurses so it seemed like a good idea in hindsight. I ended up changing my major to intended nursing and switched my whole schedule that Fall 2019. I ended up completely flunking almost all of my nursing classes and held a 1.3 GPA for that semester. \n\nI told my parents this and they suggested I try to retake the classes, and see if I would do better. I kind of had no choice as I didn't want the F's to ruin my GPA so I retook them and ended up getting better grades. This was also around the same time COVID started. So I finished the rest of that semester at home ONLINE. Which ended May 2020. During that summer I told my parents that I would not be returning back to that school because I did not enjoy my time there. Had no friends, barely went out and was severely depressed. \n\nI ended up transferring again for my 3rd time to a nursing school by my house. This school I started Fall 2020 and ended up getting academically dismissed May 2021. This school was not the best to say the very least, but at the end of the day it was my fault because I clearly didn't put in enough work. \n\nNow we're here in Fall 2021, my 4th time transferring. Now at the school I went to originally out of Highschool and I'm currently a Information systems major. I'm extremely behind in my graduation date becasue of all the transferring I did, and I'm still not sure if this is for me. I'm taking some of the lower level classes and I'm already struggling in intro to computer science, you could say it's a lack of effort but it really just doesn't intrest me. School in general, college to be exacvt doesn't interest me and I only enrolled in this out of highschool becasue it's a norm in my culture and for my parents. I was expected to go, we didn't have a talk or anything. \n\nSo my question is, I'm a 21 year old 4th year college student who has a bunch of pre reqs done for different majors but nothing geared towards a specific major what should I do? Any advice? My goal in highschool was to become a sports physical therapist. Which involved a 4 year degree + 4 years grad school. That is what fascinated me, but now that I am in college, my mindset has changed on just graduating with a decent major and getting by everyday.\n\nI'm discovering the possibility of completing a PTA program because that is something I can very well see myself doing as a career but it's like I'm in my 4th year of school and I wasted all this time, why not try to graduate?",
  "author": "lights6969",
  "created": 1635225241,
  "updated": 1635302522,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hi2y51u": {
      "link": "/r/college/comments/qfz9yp/long_story_in_my_4th_year_of_college_and_im_lost/hi2y51u/",
      "text": "First I’m sorry to hear this!  Second, don’t worry seriously college is not the end all be all, just a stepping stone.  Third, you might want to connect with some people who can probably help you think through these issues who have done PT or sports medicine if that’s what you’re into.  LinkedIn has a bunch of resources to help!  You can also talk to people in the field who are wanting to mentor and advise.  For example, consider talking to this person in sports medicine (works for St Louis Cardinals!) who helps folks who are trying to figure out career steps etc..[link](https://www.qalbaq.com/consultant-public-profile/SportsPerfMedNutr)",
      "author": "MetaBrains",
      "created": 1635226606,
      "upvotes": 1,
      "replies": {}
    },
    "hi50dj6": {
      "link": "/r/college/comments/qfz9yp/long_story_in_my_4th_year_of_college_and_im_lost/hi50dj6/",
      "text": "1. You sound like a grass-is-greener type of guy. Stop \"seeing\" yourself doing well in a particular field and go actually shadow some of these medical professions you claim to be enamored with. Every single thing you've mentioned comes with a mega truck ton of bullshit you're not going to see at the pretty and heavily sanitized front office. Figure out whether it's something you can live with before you waste more years chasing something that's just going to disappoint you *again* because, surprise, grass is grass, and your expectations (fantasies) were unrealistic.\n\n2. Once you choose something, COMMIT to it. If you don't like college, get certified to become some type of tech. You won't make much, but at least you'll be making *something* as you waffle around trying to sort yourself out. Stop dipping your toes in a thousand pools and commit to ONE goal, then stick to it until you've a) accomplished the goal or b) failed so horribly that the task set before you is utterly unfeasible, at which point you write it off, walk away, and never look back. And then you pick a new goal and commit to that, and you rinse and repeat until you've accomplished something concrete, doesn't matter how big or how small. Anything is better than what you've done so far, which is to try everything and finish nothing.\n\n3. When I say commit, I mean it. There is a difference between a 1.3 and a 2.3 GPA. A 2.3 tells me you tried and stumbled. A 1.3 tells me you did fuck-all as a student. A 1.3 is less than what one of my classmates got after he became addicted to online gaming and skipped every class and every exam after the midterm in favor of verbally abusing twelve-year-olds. Get your shit together and a) spend actual time on your education and b) spend that time EFFECTIVELY. So many people talk about how they studied for 10+ hours each day, and 9.9 of those hours are spent on Facebook and Instagram, while the last 0.1 is spent passively watching YouTube videos as words percolate uselessly between two ears.\n\n4. Stop worrying about how much time you've spent in school. You fucked up, it happens, learn from your mistakes and move on. When you're in your 20s, you can afford to think in terms of goals instead of time. Pick a goal, and spend as much time as you need (not want, *need*) to accomplish it, pat yourself on the back when it's done, and then pick the next great goal in life and commit to *that*.",
      "author": "Altruistic-Shoe-6817",
      "created": 1635269294,
      "upvotes": 1,
      "replies": {
        "hi57ykg": {
          "link": "/r/college/comments/qfz9yp/long_story_in_my_4th_year_of_college_and_im_lost/hi57ykg/",
          "text": "Thank you for this, I needed to hear this.",
          "author": "lights6969",
          "created": 1635272285,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}