{
  "sid": "qqlj0b",
  "link": "/r/college/comments/qqlj0b/college_is_crushing_me_and_limiting_my/",
  "title:": "College is crushing me and limiting my opportunities. I badly need advice",
  "text": "So, for about 5 years now, after a ton of work experience, I've been on the path to try to become a doctor. I really want to research the brain and give people treatments, diagnose people, or even possibly become a neurologist. If I get to med school and like something like ED medicine, I'd give that a shot, too.\n\nIn my CC, I became an active leader/community member. I made a diversity position at the SGA and created a community service group. Together, we've logged a few thousand hours, primarily working with the unhoused. In my early 20s, I was unhoused.\n\nAfter that, I became a registrar in the ER (in 2020), and volunteered over the summer, signing people up to get their covid shots and assisting as a \"third hand\" for nurses. I've had a lot of one-on-one patient experience.\n\nHowever, I feel like I am at a crossroads. Nothing is looking good for any med school application. I have several W's in CC, all for different reasons.\n\nI came out of CC with a 3.8. In my 4 yr, despite my best efforts, last semester I got a 3.2. This was after I sacrificed all of my free time, and dropped o-chem for the first time. I incurred more W's (up to 6 now) and my GPA is sinking. I'm on track for a 2-point-something, despite the fact that I'm throwing everything I have at these classes.\n\nI've transferred in and I'm technically a \"junior\" about to become a \"senior\" next semester. I don't have any research and I haven't even met with a pre-med advisor. They have a \"mandatory seminar\" you must attend before you can see somebody. The next seminar is in December.\n\nI do very well in bio and psych but extremely poorly in math. My degree has a lot of math and chemistry requirements. Supposedly physics is required for med school, too. I can get C's in these classes but I can't make the A's I need to be a competitive candidate. These classes are all huge and taught very poorly and are extremely unforgiving. If you miss a class, it affects your grade. I commute, so its not always easy for me to be on campus. I made the mistake of coming to my state flagship university. It is not a commuter's campus, and it is not transfer or non-trad friendly. Looking at the demographics, only 4% of their students are transfers.\n\nI don't have any research experience like I'm supposed to have. I'm tempted to switch to psych, but if I wanted to go to grad school, I would have had some hours down for research by now. I'm so swamped with my overwhelming studies that I can't even fathom trying to shove anything else into my schedule right now.  I even quit my ER job, which I loved. \n\nEvery bit of my free time is at use in school. I don't exercise anymore, I rarely sleep right. My mental health is on a sharp and horrible decline. I need to ask questions one-on-one, and that is just so impossible in a class full of hundreds. I need more tutoring help. Free tutoring isn't available here. I'm running out of money and options. When I try to teach myself in things like math or o-chem, I get the first step wrong and everything else is wrong. If I just had the answer and someone to reach out to, I could do better.\n\nWe also have groupmes in the classes and Idk what good they are. I will ask for help or notes and get crickets in response. Idk if its just a premed culture thing. People have cliques and groups. Because I'm older, and non-trad, I find myself on the outside of them, nearly everytime.\n\nThe other day I mentioned my age to a couple of students in passing. Like, people I spoke to for weeks, I mentioned my age, and they got weird and distant (I'm 28). I also recently made the mistake of telling someone my age in the first couple of exchanges, and told me the age gap was \"too weird\" for us to be friends.\n\nI just feel fundamentally rejected by this place.  I hate it here. I just feel awful. I don't want to spend another day here. I feel like this place has taken so much away from me; way more than its given me.",
  "author": "mindvarious2",
  "created": 1636516574,
  "updated": 1636655170,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "hk167c8": {
      "link": "/r/college/comments/qqlj0b/college_is_crushing_me_and_limiting_my/hk167c8/",
      "text": "Fuck them dude, there’s nothing wrong w being non traditional. Soooo many people at my school are. In fact I think it shows you have your shit together. Maybe seek an alternate route like PT or PA. I was on the med school track for a hot sec but these days it’s gets harder and harder and I didn’t think it was worth the mental sacrifice. Pm if u wanna talk :)",
      "author": "negchek56",
      "created": 1636519986,
      "upvotes": 5,
      "replies": {}
    },
    "hk18w4m": {
      "link": "/r/college/comments/qqlj0b/college_is_crushing_me_and_limiting_my/hk18w4m/",
      "text": "It sounds like you REALLY need a break. My advice is to take next semester off, establish healthy routines you can continue after you are back taking classes, and investigate all the resources available (how is it possible that a flagship university doesn’t offer tutoring?)\n\nIf you can’t sleep right, you are not going to be able to accomplish your goals. It also makes it difficult to gain the perspective you are seeking.",
      "author": "cajunsoul",
      "created": 1636521579,
      "upvotes": 3,
      "replies": {}
    },
    "hk19jfd": {
      "link": "/r/college/comments/qqlj0b/college_is_crushing_me_and_limiting_my/hk19jfd/",
      "text": "You aren't old, but if you are at a flagship school it may feel like it. I'm 37 and have no issue making friends Then again, I don't care what other people think and I wasn't at school to make friends to begin with. Also, our school was more of a commuter campus that is transforming into a traditional campus. So, we still have a decent number of students who are  23+ and starting or even a little older and returning for grad school.\n\nI don't know what to tell you about your academics. I'm in CS and never graduated high school, so math was a struggle as well. I mean, I got good grades in most classes but I'd spend more time on my math class than all others combined. I also used a few subscription services that really seemed to help.\n\nI find it odd that your state's major university doesn't have free tutoring. My CC had free tutoring and so does my university. Like, you would expect a major school to offer that at a minimum. I've also found groupme hit and miss. It is usually a place for all of us to vent about how we're all on the verge of failing, but I rarely see people actually discussing coursework.\n\nIs there a way you can drop to part-time and still work at the ER? That would give you time to focus on the classes you are taking. Are you taking summer classes? Can you transfer in classes still? If so, look at taking math at a CC. Do you check professor ratings on ratemyprofessor? I've found it invaluable when I've actually been able to select between professors.",
      "author": "ILikeGoldAndShowers",
      "created": 1636521979,
      "upvotes": 3,
      "replies": {
        "hk3mpvz": {
          "link": "/r/college/comments/qqlj0b/college_is_crushing_me_and_limiting_my/hk3mpvz/",
          "text": "Unfortunately, dropping to part-time isn’t necessarily something this school endorses or condones. I dropped to part-time midway through last semester and my financial aid package was revised and only covered a fraction of what it needed to. In regards to quitting my ER job, I was supplemental, so they have a limit on the amount of supplemental people any department can hire. I’ve also already quit. \n\nI think being a part of a commuter campus and a non-commuter one makes a big difference. I’ve been to a 4 year that’s commuter-based and a CC that’s commuter based and I naively anticipated this school to be the same way.\n\nWhen 40,000 people walk to their classes, the streets are flooded with walkers, scooters, busses and bikes and it’s extremely stressful. You can move an inch a minute, and no matter how early I arrive, I’m almost always late. My friends (not attendees here) who occasionally pick me up and drop me off are in cussing rage fits after driving within a mile from the campus. The campus is huge, and walking from my designated parking lot to my classes can take 30, 40 minutes on top of it all. I can also pay for parking and have a 5 min walk. That costs 5/hr and $20 total, per day, for five days, every day, all day. That’s an extra 400 dollars a month just to park close to your classes. That’s how commuters are treated here. Otherwise, I park in a parking lot that is wrapped up in several dorms, and not even maps can help me at that point. \n\nI cannot emphasize how much I’m not here to make friends. But this school clearly believes in the power of working in groups. The people at the top of their class are always the ones who sit in the study rooms in groups of 5 or 6 and share dorms together. And if you don’t gel, you’ll have a hard time here. \n\nI’ve done most of those suggestions and I feel like most avenues are exhausted. RMP, yes, but there’s only 2 available profs that teach the class  and they have a 10% “would take again” rate.\n\nThis place is really a dumpster fire.",
          "author": "mindvarious2",
          "created": 1636569667,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk2xc97": {
      "link": "/r/college/comments/qqlj0b/college_is_crushing_me_and_limiting_my/hk2xc97/",
      "text": "Have you considered alternate routes, like EMS, nurse practitioner, or physician assistant? NPs and PAs diagnose and treat individuals, kind of like doctors do.",
      "author": "Comprehensive-Ad3963",
      "created": 1636559808,
      "upvotes": 1,
      "replies": {}
    }
  }
}