{"sid": "lc06q7", "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/", "title:": "Anyone Else Baffled by Your Classmates Inability To Write?", "text": "Seriously. My classmates don’t use citations, and if they do, they use them wrong. These are seniors. Some of them also have a large amount of errors in their posts. Sometimes I think I do so well on writing assignments just because in comparison to my classmates, me doing the bare minimum or slightly above it is considered “excellent” by professors. Of course, I don’t mind the good grades. The lack of writing skills just baffles me.", "author": "haveagreatday97", "created": 1612391285, "retrieved": 1632803124, "over_18": false, "upvotes": 543, "upvote_ratio": 0.97, "comments": {"gm5jcl7": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm5jcl7/", "text": "Yes. Whenever there's peer review, I've noticed only about 10% or fewer of my classmates have high quality submissions. It seems a remaining equal amount have serviceable submissions, i.e., bare minimum with minor errors, or blatantly poor ones. I'm thankful I've never had to do group work, even if that sounds harsh.", "author": "Crocnoc", "created": 1612554955, "upvotes": 1}, "gm2au2k": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2au2k/", "text": "Many people seem to respond to significant adversity with apathy, so people that aren’t good at language naturally will likely stop progressing early on.", "author": "slamweiss", "created": 1612488805, "upvotes": 1}, "gm1rdf0": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1rdf0/", "text": "Me, an engineer with very poor writing ability, yeah I hate how my classmates can't write <.<; >.>", "author": "poonGopher6969", "created": 1612479670, "upvotes": 1}, "gm1l7wg": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1l7wg/", "text": "“More better.”", "author": "cjmeigsy018", "created": 1612476960, "upvotes": 1}, "gm18p72": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm18p72/", "text": "Having somewhat of a sentence structure is rare", "author": "Budgetgitarr", "created": 1612471848, "upvotes": 1}, "gm0zr1g": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0zr1g/", "text": "Missing. Possessive.", "author": "hyperforce", "created": 1612468246, "upvotes": 1}, "gm0wz5s": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0wz5s/", "text": "My abortive attempt to enter academia in English began with a year as a graduate teaching assistant with two sections of English Comp 101 and 102 at a state university. I was shocked at how poorly the majority of the students wrote. With many of them, it wasn't even a matter of \"this needs some editing.\" There just wasn't much solid prose and coherent thought to begin to work with. It was sad. And quite frankly, being an absolute lover of writing and reading I was unable to bridge the gap and figure out how to communicate to them. It was so frustrating.", "author": "KSTornadoGirl", "created": 1612467123, "upvotes": 2}, "gm0tynl": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0tynl/", "text": "Yea. I feel the exact same. I barely put any effort into my writing and excel and people older than me still don’t know what first person and passive language are. It tests my patience everyday lol", "author": "Lucyfur1234", "created": 1612465915, "upvotes": 1}, "gm0hsr1": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0hsr1/", "text": "I just want to clear the air that I went to a shit school in a shit town in a shit state and if people don't know how to write at the bare minimum acceptable level, that's probably their own fucking fault. All you have to do in school is just pay the fuck attention for a few hours and you'll be okay. It does not take a 10,000 IQ genius to be able to construct a fucking sentence without sounding like a complete buffoon. We all whine about the education system in the US which absolutely has its faults, but for fuck's sake, it really isn't THAT bad.", "author": null, "created": 1612461170, "upvotes": 2}, "gm0fyhm": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0fyhm/", "text": "The best is when you have to peer review each other's work. It's fucking laughable. Maybe later I'll link to some screenshots of the comments my peers gave me on my paper. They can't even capitalize a fucking \"I\" and they're trying to \"fix\" my proper grammar. Usually people realize my writing skills are far superior than theirs and they'll say they have nothing to critique. But every now and then some dumb bitch will come in with an exaggerated opinion of themselves.\n\nTrue story: My sentence was \"Maxfield continues that the information we cling to regarding health is largely based on societal expectations, not solely on scientific data.\" Now I'm sure I made some minute error somewhere that some English wizard can correct. But this fucking idiot highlighted it and said \"I feel like this is another run on sentence.\" Hey, at least that person could spell and use a period for that one particular note!", "author": null, "created": 1612460452, "upvotes": 1}, "gm0e3xk": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0e3xk/", "text": "I can forgive someone for being bad at writing; written language is, after all, very unnatural, and wasn't a mode of expression in the ancestral environment. In the Paleolithic visual art (e.g. cave paintings and sculptures), singing, dancing, drama, music, and speaking were all prominent aspects of life.\n\nThe issue we have is that most of the people who can't write can't paint, sculpt, sing, act, play a musical instrument, or dance well either! A key, if not the key, goal of education is for the student to become at least some of these arts, these fundamental and primordial forms of expressing what it is to be human, and we are falling far short of that goal.\n\nFor that reason alone it's entirely fair to say that the education most people get is very poor.", "author": "AdamasNemesis", "created": 1612459728, "upvotes": 1}, "gm03o59": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm03o59/", "text": "I’m more worried about the people that can’t form a complete sentence during class discussion tbh. Worse English than actual ESL people that have to consciously think about their word order", "author": null, "created": 1612455726, "upvotes": 1}, "glzztxm": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzztxm/", "text": "I'm a US student in the UK and I'm genuinely surprised that the education system here doesn't seem to teach basic citation. We had a group project and I had to tell people to do citations by hand instead of using the automatic generators because the automatic generators were coming up with different results...", "author": "birdpictures897", "created": 1612454203, "upvotes": 1}, "glzxgjy": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzxgjy/", "text": "Absolutely. Every group writing project I’ve worked on in my time in college, my peers have written horribly. And I know I’m a pretty decent writer so I’m not expecting everything to be great, but my classmates write like 7th graders in a remedial English class. \n\nWhen I was in middle school and high school I always thought that all the emphasis on writing was nuts because this stuff was common sense, but now I realize that it’s not. \n\nIt makes me wonder how these kids made it though the mandatory English classes at my college. There’s no way those students should have actually passed with the skills they put on display.", "author": "Ms_Digglesworth", "created": 1612453254, "upvotes": 1}, "glzwqbw": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzwqbw/", "text": "There’s a few students in some of my classes who love writing things like “today I am writing about” or “the prompt says *blank* so I am going to argue that”. I have to legit close my laptop and do something else because I get so frustrated by the fact that I can’t even read their writing the entire way through.", "author": "hailiesandersl", "created": 1612452954, "upvotes": 2}, "glzuiui": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzuiui/", "text": "If you want help with writing, I've set up a Discord server just for that: https://discord.gg/ZQKbYXptEP\n\nI'd been teaching writing for 6 years until my classes got cancelled due to covid-induced low enrollment. So, now I have a new hobby.\n\nI'm still building out lessons, but while that's going on you can also get some individual advice.", "author": "bl1y", "created": 1612452027, "upvotes": 4}, "glzuaki": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzuaki/", "text": "I was shocked as a creative writing minor how many creative writing and English majors didn’t know how to write worth shit. Stories that didn’t make logical sense, run-on sentences, grammatical errors so bad I had to decipher what they were trying to say. A big flaw in those classes for me is that you get most feedback through peer review because most of the time I’d get paired with people who would read my story and say shit like “sounds good” or “perfect” when I want real feedback that helps me make it better, meanwhile I’ve tried really hard to nicely tell them their entire story is trash. \n\nI also had that happen in a class where we made online portfolios. The ones I had to review had barely any information to the point where I wasn’t sure if they even had any skills or what career they were actually going for, and then my portfolio got “wow that’s so good!” And all I wanted was an opinion that would actually help me.", "author": "kienarra", "created": 1612451927, "upvotes": 1}, "glzt9pv": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzt9pv/", "text": "My boyfriend is in his fourth year as a history major where he almost exclusively writes papers.. he said there are some people in his current classes where he has no idea how they even got through their English 1100.", "author": "peachyypeachh", "created": 1612451474, "upvotes": 2}, "glzt2q5": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzt2q5/", "text": "Yep. I took the CLEP for English Comp I and II so I'm a pretty decent writer.\n\nBut, I also am (was? I graduated last May) a Computer Science major. Holy fuck did all those little baby guys act like writing a paper was going to kill them. The amount of them that put off classes with a slight writing component until their last semester was baffling to me.\n\nI remember in one of my last semesters in one of my 4000 level CS classes there was a group project for a huge research paper that spanned half the semester, and the groups were premade. I had already signed myself away to writing the whole god damn 20 page paper by myself, until I got matched with one of the most attentative guys who asked the most questions in the class and one of the only girls other than me in the class as well. Her track was STEM education, one of the only people in the CS school with that specific track.\n\nWe killed the paper and our professor was super proud of us. I was so glad I didn't have to do everything. We brainstormed and decided the guy who was the most passionate about the class and project should organize us, he did, and then none of us slacked off.\n\nThat never happened again for any other group project or paper I had, but it was such a breath of fresh air compared to the shit that happens normally.", "author": "eternaforest", "created": 1612451389, "upvotes": 2}, "glzruoo": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzruoo/", "text": "Lol during my undergrad, somebody turned in their 40 page project and forgot the references.", "author": "Nerdlinger42", "created": 1612450844, "upvotes": 2}, "glzrbvm": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzrbvm/", "text": "I'm a sophomore in polisci and I've peer reviewed papers from freshmen, sophomores, and juniors and other than a few exceptions pretty much all the papers I've read by fellow classmates have completely lacked any soul or finesse. The language is typically drier than the Sahara. The topics are usually boring and overdone when open-ended assignments allow for creativity. And structurally papers are typically so canned they put spam to shame.\n\nI think a combination of apathy, a lack in writing classes through high school, and a general disdain for reading books that has persisted through the last two generations are to blame.", "author": "Fedora200", "created": 1612450613, "upvotes": 2}, "glzql17": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzql17/", "text": "Whose fault do you think that is? Often times, lack of writing skills is associated with being from a lower-income, diverse/minority area where English is often a second language. Not saying that they have to be in that situation, but you can't blame people for resources and knowledge that was never given to them.", "author": "VexingMalice", "created": 1612450282, "upvotes": 0}, "glzo444": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzo444/", "text": "will never forget the time i had to do a peer review of some dude's civil war paper in one of my history classes and the only way he was able to get up to the minimum page count was to insert whole ass blocks of blank space at various points in the paper, and there were all sorts of weird formatting errors like some text shadow effect on the first two or three pages. he also included a page-long quote from a primary source in a paper where we were only supposed to use secondary sources... big brain shit", "author": "sangyourrefrain", "created": 1612449164, "upvotes": 5}, "glznrqv": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glznrqv/", "text": "Wait- senior as in college?! I really thought this sort of crap ended by freshman year. I'm in highschool rn and most of my class still thinks research=pasting a question word-by-word as it appears in the assignment onto google.", "author": "Hector_Martinez04", "created": 1612449002, "upvotes": 2}, "glzlg2y": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzlg2y/", "text": "No, but I am baffled by my own inablity to write.", "author": "Puzzleheaded-Ear-426", "created": 1612447856, "upvotes": 3}, "glzkraj": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzkraj/", "text": "And somehow they let these people out of English 1. Like what’s the point of making us take English classes if people still can’t write afterwords?", "author": "NeonRose222", "created": 1612447508, "upvotes": 5}, "glzkbuf": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzkbuf/", "text": "Same. When I email professors or go to their office hours about term papers they are either surprised I'm showing up at all even though they say it's mandatory or are simply delighted.\n\nI tell them about my topic, thesis and the structure of the paper. They always love the idea and then warn me I should include secondary literature and not just analyze.\n\nDUH. That is so obvious to me that I don't even mention it. Like, I have already picked out 10+ relevant scholarly articles/books. Don't worry. I even have an MLA style list. I just don't bring it up because it's a given. I was seriously surprised about both my great marks and the fact that my peers apparently can't write even though they literally teach us left and right.\n\nNow, I do it for fun. I watch their horror grow bigger and bigger as I talk and before they can ask the dreadful secondary material question I present them with my flawless list. You should see their faces LIGHT UP! Best entertainment.", "author": null, "created": 1612447286, "upvotes": 3}, "glzi874": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzi874/", "text": "Professors aren't allowed to fail many students, so they just get let through.  You would truly have to be an idiot to not be able to graduate from uni nowadays.", "author": "fnybny", "created": 1612446156, "upvotes": 4}, "glzhzzb": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzhzzb/", "text": "It’s like somehow they made it through high school without at LEAST MLA format not being drilled into their brains", "author": "headyslabs", "created": 1612446031, "upvotes": 6}, "glzat06": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzat06/", "text": "I was in this group project once. Part of the project was to write a short essay about what we learned.\n\nThe grammar in the essay was so horrendous that I spent an hour editing the whole thing so we would actually pass.", "author": "nonconformistnugget", "created": 1612441475, "upvotes": 5}, "glyvs0e": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyvs0e/", "text": "I think I realized this whenever I would help my sister out with writing. She's graduating HS this year, and I'm two years ahead of her (for reference). I helped her to redo her college applications, and man were they in rough shape. She was reluctant to do it, but my mom prodded her to let me. After I was gone making extensive changes, my mom asked, \"so what do you think now?\" My sister responded, \"yeah, it's actually really good.\" \n\nI find the biggest issue within essays and responses is that people have the idea, but they either never flush them out, or continue it. You can't expect this great idea to have two sentences, make it a paragraph were you fully develop your point. \n\n I've been told my writing is really good by various professors and I credit it all to my English teacher in HS, who I had for two years. Every paper I submitted would get ripped apart, and for the first year I never earned more than a 70% on any of them. \n\nWhenever I proof read things for friends or classmates, it just hurts. Its like I'm looking at an extremely rough draft of a paper, not a finalized copy. Incomplete thoughts and sentences, sentences that either add nothing or drift off to never be completed... stuff like that.\n\nI think at the end of the day, the problem stems from horrendous lack of proper education in English wiring skills in general. A lot of my HS classes in English were focused on reading and the language used... not so much how the sentence was structured or even how to write.", "author": "DoorBuster2", "created": 1612428543, "upvotes": 6}, "glys10q": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glys10q/", "text": "Yes and no. On one hand, it's wild when you get into an upper-level course (or any college course) and see that students study with the basics of writing. On the other, writing is a skill. If a student isn't taught a skill when they're in K-12, if they get in programs where they can get by without being pushed to improve their writing, if no one teaches them the importance of effective written communication, then of course they will write poorly. Besides that, I think there are plenty of people who want to write well but don't know what good writing *is* because they were never given instruction on that beyond the surface level stuff, which they then brush off as \"I'm just not a good writer.\"", "author": "torgoboi", "created": 1612425295, "upvotes": 7}, "glyo7sg": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyo7sg/", "text": "YES... And it almost gives me *major* imposter syndrome? Classmates talk about the amount of prep and studying they do for either actual papers or for exams with essay questions, meanwhile I'm a procrastinator who has never been much of an intense study-er or prep-er but then I always manage to get out loud compliments on my writing... and during high school I always figured I just have a knack for writing and it was cool to be recognized... now, I am also a college senior and definitely get a similar sense of: \n\n>Sometimes I think I do so well on writing assignments just because in comparison to my classmates, me doing the bare minimum or slightly above it is considered “excellent” by professors.\n\nI did a discussion post for a reading that I barely skimmed and my professor left a comment about my answers being \"incredibly thorough and profound,\" and after reading what some of my other classmates wrote, I can see how my ability to coast on just decent writing makes me seem so profound when I personally feel like I'm barely skating by... \n\nI mean maybe we don't give ourselves enough credit,  being an effective communicator can often be the factor that makes someone decide on you over the dud with a fluffy resume. Go us✌😅", "author": null, "created": 1612422148, "upvotes": 12}, "glymfm5": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glymfm5/", "text": "Higher ed really did a great job of showing me that I am actually a step or two in front of the masses in terms of those types of skills. I didn’t believe it, I figured people were just blowing smoke to make me feel good, but no— mfs really be walking around out here thinking this type of writing is okay for adults. And also that things like meeting deadlines are mostly negotiable and that you can get everything you want doing the bare minimum and that not doing your work is okay if you are sad and don’t feel like it. Embarrassing.", "author": "Jasmotron3k", "created": 1612420802, "upvotes": 28}, "glyky6b": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyky6b/", "text": "As an international student and second language English speaker, I'm baffled at how bad people are at English when they've been born into it", "author": "CrazyTechq", "created": 1612419738, "upvotes": 11}, "glyhn2j": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyhn2j/", "text": "Honestly, no. It's hard to teach high schoolers about citations and other advanced concepts when you get kids in 11th grade that can't even read a full paragraph. By the college level, it is assumed that you have a strong educational background and already have mastered these concepts. If you go to a school like I did with very low teacher retention rates and literacy rates below 20%, it is very easy to get stuck behind the rest of your peers in college.\n\nPlus, it isn't taught in college classes because its assumed students already have in-depth knowledge of these concepts. So students think they don't need to learn these concepts because they have never needed to before and most professors are lenient with grammar. (excluding english professors and those that teach majors that require a high-level of writing skills)", "author": "WhiteFarila", "created": 1612417504, "upvotes": 0}, "glyh5zt": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyh5zt/", "text": "Ummm I was in a Comp II class and compared to the other students I was the reason why my prof didn’t lost their sanity because I stg everyone was illiterate 😭😭. Like it got to the point where the prof had to make a PowerPoint for the class about HOMOPHONES.... yes you read correctly, a college comp II class needed guidance on the difference between things like “they’re, there and their”. I was shocked 😭💀.", "author": "Mhoover0108", "created": 1612417201, "upvotes": 3}, "glydxra": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glydxra/", "text": "I’m a graduate student and I agree. I’m working on my MA in History which makes it worse considering it is a very writing intensive field.", "author": "X-iomania077", "created": 1612415226, "upvotes": 1}, "gly3a34": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly3a34/", "text": "This post reminded me of a few semesters ago I was peer-reading some papers for a (senior level!) Evolution course. While both papers had some glaring errors that made me go ???, one of the papers was literally 90% plagiarized word for word. I could instantly tell because the writing in the introduction was so poor then suddenly all these fancy terms and phrases appeared. It took me 5 seconds to find the plagiarized information. I was baffled, I was sure it had to be a plant to get students to bring it to the professor’s attention. But no, a real COLLEGE SENIOR did that. It still baffles me today. (And then, at the final presentation, the student’s presentation narration was also almost word for word from their original sources. How did they get away with that?)", "author": "ElephantsRTasty", "created": 1612409340, "upvotes": 13}, "gly04oo": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly04oo/", "text": "Yep happens at least once a semester. The worst part is when some professors feel the need to then teach them how to do write. Like spending lecture time going over what is at best English 101 material in a upper level philosophy class (for example) is not a good use of anyone’s time. The only ones that should get away with this are international students and even then it’s still sad.", "author": "OmegaBornAndRaised", "created": 1612407753, "upvotes": 27}, "gly01th": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly01th/", "text": "I think it's largely a testament to the quality of some (many?) high schools... basic grammar, punctuation, sentence structure, proficiency in at least one common citation style, etc. should be in any students' back pocket well before college. I'm grateful to have attended a hs with a great English program, but there's certainly a disparity between the better and poorer funded high schools across the U.S.  \n\nAlso, some just scrape by on truly the bare minimum skills", "author": "bucs2013", "created": 1612407713, "upvotes": 66}, "glxwj62": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxwj62/", "text": "Lol premeds.", "author": "leeeelihkvgbv", "created": 1612405991, "upvotes": 1}, "glxvn4m": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxvn4m/", "text": "[deleted]", "author": null, "created": 1612405555, "upvotes": 6}, "glxpz0t": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxpz0t/", "text": "Like every day I am and I still don't get it. I'm guessing it's either a lack of proofreading on their part or they're just plain, simple not good at English", "author": "jamayonaiz", "created": 1612402766, "upvotes": 5}, "glxpffi": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxpffi/", "text": "I have actually noticed this and specifically thought \"how are you even passing any classes at this point?\" At this point we are all taking graduate level courses or damn near close to them. I remember doing a \"peer review\" a couple years ago on a rough draft of a paper and the person's paper I ended up peer reviewing was so horrid (not to mention had a total of zero citations) that the whole thing ended up being marked up. I felt bad but looking back I'm glad I took the time to really review it and I genuinely hope to this day it helped them even just a little.", "author": "OmieBloomie", "created": 1612402497, "upvotes": 95}, "glxi3yr": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxi3yr/", "text": "[removed]", "author": null, "created": 1612398888, "upvotes": 6}, "glxcgg9": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxcgg9/", "text": "I hope they teach all this in college, I haven't had many essay based assignments in hs..", "author": "warlockAES", "created": 1612396126, "upvotes": 9}, "glxawxe": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxawxe/", "text": "Yes it baffles me, and it got me in trouble with academic integrity once with a group project. \n\nYou always have to be the one to personally go behind all of your group mates and make sure that your project isn’t going to get the whole group a zero. \n\nIt’s like trying to do a college level project with 4 12 year olds honestly.", "author": "ilikecacti2", "created": 1612395379, "upvotes": 200}, "glx348w": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glx348w/", "text": "A lot of high schools don't teach this, and when you get to college, professors say \"you should know this already, you're in college!\" Ugh been there for sure. If you're lucky you'll get an engaged professor who is willing to actually explain this stuff. Librarians are awesome resources for citation help, too ... but most students don't know they can ask.", "author": "NashiPearl", "created": 1612391779, "upvotes": 28}, "glx2jck": {"link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glx2jck/", "text": "Yeah and I assume they are all freshmen tbh. \n\nA lot of STEM majors suck at writing since it’s not required. Writing is just like any other skill, it must be practiced.", "author": "Steakhuntt", "created": 1612391515, "upvotes": 105}}}