{
  "sid": "q1kvh9",
  "link": "/r/college/comments/q1kvh9/does_studying_design_major_make_you_stupid/",
  "title:": "Does studying design major make you stupid?",
  "text": "This toxic doctor on the reddit literally told me that \"oh you are studying design in college? It's not a rocket science or stem major so that means you must be not intelligent! \" some people need to just shut the fuck up. Just becuase you are studying a certain subject does not make you any less smarter than other majors. Creativity and genius go hand in hand and design has its own decipline and reuqires level of altitude and skills to become expert. Term Genius still applies to artists and designers becuase have you heard of  vincent van gogh and Steve  jobs? Design requires intelligent. this bish doesnt know what she is talking about just becuase shes a doctor and has been only stuck in hospital studying natural science and never got out of ER to see the real world. I hate people like this. Makes my stomach flipped and im so infuriated by this woman's ignorance and her stupid thought process tbat makes just not want to pursue design anymore.",
  "author": "Specific-Situation-1",
  "created": 1633399130,
  "updated": 1634084182,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.56,
  "comments": {
    "hffk8ay": {
      "link": "/r/college/comments/q1kvh9/does_studying_design_major_make_you_stupid/hffk8ay/",
      "text": "People that have that type of thinking more than likely they haven't really been in a working environment that requires the collaboration with a design team. I had the opportunity to work at this R&D center for an appliance company and worked with an Industrial Design Intern. It was honestly insane how much projects she was having to collaborate on for some of the senior engineers.",
      "author": "Traaaaaaaaap",
      "created": 1633399786,
      "upvotes": 5,
      "replies": {
        "hffkhb7": {
          "link": "/r/college/comments/q1kvh9/does_studying_design_major_make_you_stupid/hffkhb7/",
          "text": "Whats your point",
          "author": "Specific-Situation-1",
          "created": 1633399911,
          "upvotes": -4,
          "replies": {
            "hffl3bp": {
              "link": "/r/college/comments/q1kvh9/does_studying_design_major_make_you_stupid/hffl3bp/",
              "text": "It is a necessary discipline?",
              "author": "Traaaaaaaaap",
              "created": 1633400219,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hffm7fh": {
      "link": "/r/college/comments/q1kvh9/does_studying_design_major_make_you_stupid/hffm7fh/",
      "text": "It is so frustrating. Accounting comes easy to me. But when it comes to anything creative or artistic, my brain does not function and I can’t do it. She sounds like a someone who needs to hop down her high horse. Just like me, she definitely has no idea what actually goes into your major. (Definitely not an excuse)",
      "author": "coraline_button_",
      "created": 1633400770,
      "upvotes": 2,
      "replies": {}
    },
    "hfi9yy6": {
      "link": "/r/college/comments/q1kvh9/does_studying_design_major_make_you_stupid/hfi9yy6/",
      "text": "The doctor sounds like a an envious idiot. Ignore idiots like that at all costs. It's not the 1930s. There are other job options beside being a doctor or lawyer. Whoever doesn't get that is an uncultured slob who needs to acquaint themselves with the real world.",
      "author": "LarryLongBalls_",
      "created": 1633457544,
      "upvotes": 1,
      "replies": {}
    }
  }
}