{
  "sid": "qxtxhp",
  "link": "/r/college/comments/qxtxhp/whats_your_favorite_way_to_use_flashcards/",
  "title:": "What's your favorite way to use flashcards?",
  "text": "I've been using Quizlet for as long as I can remember, but decided I wanted to try using real paper flashcards after listening to a bunch of smart people talk about how they prefer using real cards. So, other than the obvious use of term/definition for key terms, what are some of everyone's favorite ways to use flashcards? And have you found any benefits of using real flashcards as opposed to Quizlet?",
  "author": "duffingtonbear",
  "created": 1637369581,
  "updated": 1637689550,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlc1c4y": {
      "link": "/r/college/comments/qxtxhp/whats_your_favorite_way_to_use_flashcards/hlc1c4y/",
      "text": "_After listening to a bunch of smart people_\n\nThat shouldn't be your motivator to try a new studying technique imo. If they really are people with above average IQ, they learn in a completely different way that might now be efficient for you. If you're doing well with what you're currently doing I would just stick to that. Also, Quizlet is not that different from flashcards",
      "author": "Undesirable_11",
      "created": 1637372121,
      "upvotes": 3,
      "replies": {
        "hlc4yz2": {
          "link": "/r/college/comments/qxtxhp/whats_your_favorite_way_to_use_flashcards/hlc4yz2/",
          "text": "Well I understand where you're coming from, but at the same time, isn't it reasonable to try out and adopt other study styles? I'm not saying it'll work for me 100%, but I think it's fair that I'm curious in what they do and why they do it.\n\nThanks for the insight about quizlet being pretty similar to flashcards!",
          "author": "duffingtonbear",
          "created": 1637373827,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hlcklff": {
      "link": "/r/college/comments/qxtxhp/whats_your_favorite_way_to_use_flashcards/hlcklff/",
      "text": "You can try Anki, which allows you to add spaced repetition to your studying. It helps you review cards more efficiently. This is on the computer though.\n\nFor paper flashcards: When learning terms, I sometimes try to learn flashcards in smaller groups rather than going though all of them at once. So I’ll learn the first five, then the next five, then review then ten together, then the next five, review those 15, etc. \n\nIt’s important to use active recall rather than just reviewing flashcards. You’ll learn more when you try to retrieve the information from your memory and then check the card than when you just flip them over and read them",
      "author": "idontcareaboutttt",
      "created": 1637381917,
      "upvotes": 1,
      "replies": {}
    }
  }
}