{
  "sid": "qn1lxd",
  "link": "/r/college/comments/qn1lxd/did_you_have_to_change_friends_after_school/",
  "title:": "Did you have to change friends after school?",
  "text": "I am in college in my late 20ties. I have had friends over the years and met them in diffrent circumstances. some of my close friends just became so ignorant that I do not know if we will actually survive. And it surprises me because one of them is a medical professional. \n\nMy problem is that they believe in almost every conspiracy theory, for example 5G, vaccines that this is no longer just an issue of different opinion but we can not have a healthy conversation anymore about certain things. After studying biology and physics and getting more rounded on elementary knowledge I am VERY bummed that I came across this issue with people.   \n\n\nI am friends with them because they are good people, we enjoy spending time together etc. There is no question I don't love them but I am a person of science and I can not just nod my head to some issues where I see it damaging to them and them making fool of themselves. Like I try to protect them from misinformation, but they are not wanting to learn and they end up living in unnecessary stress.   \n\n\nWhat is your experience?",
  "author": "Professional_Mine2",
  "created": 1636080695,
  "updated": 1636137153,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjdlqc6": {
      "link": "/r/college/comments/qn1lxd/did_you_have_to_change_friends_after_school/hjdlqc6/",
      "text": "Yes",
      "author": "kdrdr3amz",
      "created": 1636086197,
      "upvotes": 2,
      "replies": {}
    },
    "hje0cui": {
      "link": "/r/college/comments/qn1lxd/did_you_have_to_change_friends_after_school/hje0cui/",
      "text": "Simple, stay as long as you can. Like anything in life you can't control the things around you. You will meet people who will share more common ground and befriend much more easily. The only thing is to look back about the good things. It's actually incredibly rare to have life long friends, and so you will have to look at it as a impasse. Maybe you guys might connect again, it's not a bad thing.",
      "author": "timemaninjail",
      "created": 1636097155,
      "upvotes": 2,
      "replies": {
        "hje0omw": {
          "link": "/r/college/comments/qn1lxd/did_you_have_to_change_friends_after_school/hje0omw/",
          "text": "Yeah, I have few lifelong friends. And it is the worst when some of them become like this. Some of the girls enter some weird controlling phase and \"I always have to be right\" phase. Modesty and being humble i guess goes away with age. Sadly, we just don't always grow together. We lack some core common interests and principles sometimes or maybe I am unable to accept the fact that I will differ with people.",
          "author": "Professional_Mine2",
          "created": 1636097445,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}