{
  "sid": "qpfse0",
  "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/",
  "title:": "Guilt when not doing schoolwork?",
  "text": "Does anybody else feel guilty when your not doing school work or something \"productive\". Ever since I started college when I try to do something I used to enjoy like playi ng a gamd or watching a movie I just feel guilty. I feel like evergone else is being a productive a good person and an excellent member of society. And im nust being a lazy peice of shit who never deservered anything. Does anypne else feel similarly?",
  "author": "skedadadle_skadoodle",
  "created": 1636384806,
  "updated": 1636655289,
  "over_18": false,
  "upvotes": 52,
  "upvote_ratio": 0.98,
  "comments": {
    "hjtt5mw": {
      "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hjtt5mw/",
      "text": "Yup, it has taken a lot of the joy from my life this semester",
      "author": "FigBar_",
      "created": 1636393059,
      "upvotes": 14,
      "replies": {
        "hjtydms": {
          "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hjtydms/",
          "text": "Yeah, college kinda sucks.",
          "author": "skedadadle_skadoodle",
          "created": 1636395186,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hju98jy": {
      "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hju98jy/",
      "text": "I’ve actually been working past this. It’s about realizing we all have our own paths and we will get there one way or the other",
      "author": "Bai619",
      "created": 1636399554,
      "upvotes": 4,
      "replies": {}
    },
    "hjvk8ng": {
      "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hjvk8ng/",
      "text": "Welp the obligatory: \"I thought it was just me\". I don't even have a hard major (this semester, only one hard class: anatomy and physiology) and I even fell into this trap when I had a ridiculously easy semester.\n\nIt just sucks because I know that the smart kids don't even have to sacrifice this amount of free time. I know some Ivy Leaguer is having the time of his life partying at a frat while also studying physics.\n\nI have continually tried to make an effort to at least make time - even though I fall back into old habits a lot. I try to set aside time (at least 30 minutes to an hour) and just do something fun. Because I like to call this \"overstudying\" where all you do is study, so much so that you don't even retain all the information because it all blurs together.\n\nTake a break and make time, just start in increments. Watch a sitcom episode (not a YouTube video) that doesn't have any continuity to any previous episode just to test the waters. Try to do this once you hit a slump in studying activity.\n\nAlso external stimuli is absolutely a thing. Go to a different room, your brain will still be on study mode if you stay there and prevent you from enjoying your allotted time.\n\nI know it sounds counterintuitive to not do work, but studying all the time is not the way to go. At the very least, do not skip out on parties or hanging out with friends if you are invited. Have a social life and a study life, learn to balance it.",
      "author": "Athragio",
      "created": 1636419233,
      "upvotes": 3,
      "replies": {}
    },
    "hjxhw66": {
      "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hjxhw66/",
      "text": "It’s hard, but you’ve got to work to kick that guilt, I struggle with it, but self care is incredibly important, especially in college because it’s so tough. To keep sane, you have to spend time with friends, or play a game, or watch movies. Work work work, is simply not the way human brains are meant to function. Breaks are just as productive as doing class work : ) and you are not lazy or unprofessional for doing so!",
      "author": "ogilviup",
      "created": 1636462505,
      "upvotes": 2,
      "replies": {}
    },
    "hjvlw6w": {
      "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hjvlw6w/",
      "text": "I feel the same all the time",
      "author": "Miguel7-",
      "created": 1636419996,
      "upvotes": 1,
      "replies": {}
    },
    "hjvo3xl": {
      "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hjvo3xl/",
      "text": "Only if its during my free time and I havent yet done schoolwork that day. If you put in some hours of decent effort, there should be no reason you feel guilty for relaxing",
      "author": "taybay462",
      "created": 1636421016,
      "upvotes": 1,
      "replies": {}
    },
    "hjvmedb": {
      "link": "/r/college/comments/qpfse0/guilt_when_not_doing_schoolwork/hjvmedb/",
      "text": "No. Out of 7.8 billion people among thousands of years, you’re the only one to ever have this feeling. \nBitterness aside, yes- it’s a common feeling associated with procrastination. Google it to find out more.",
      "author": "Unexpectedarthur",
      "created": 1636420234,
      "upvotes": 0,
      "replies": {}
    }
  }
}