{
  "sid": "qh4ty4",
  "link": "/r/college/comments/qh4ty4/should_i_graduate_this_spring_or_stay_at_my/",
  "title:": "Should I graduate this spring or stay at my workplace.",
  "text": "I've been in college for 5 years, and supported myself all the way through. I have to have a degree to get certified in my chosen career.\n\nThe job I have currently is in my field, but an assistant position. I have to have an assistant position for at least a year to be able to take an exam to get certified. I've only worked there 6 months.\n\nMy bf said he'd support me my last semester of college, since it will be insane on credit hours and he wants to see me actually live my life instead of me just working and going to school full time while living alone. Like I'm TIRED forreal. I know that with senior level bio classes in-person again, there is no way I can balance both work and school the next semester.\n\nTo do that tho I would have to quit my job before the year mark, but I'd graduate on time. If I keep the job I can hit the required mark, but it will take another year to graduate. Which should I choose? What would you choose?",
  "author": "JessicaPopplewell49",
  "created": 1635363842,
  "updated": 1635457059,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiaobdk": {
      "link": "/r/college/comments/qh4ty4/should_i_graduate_this_spring_or_stay_at_my/hiaobdk/",
      "text": "Nah fam just work instead, you probably going earn more if you just do that instead. Taking a year off or sum of college ain’t much different. You can alway go back anytime also.😈",
      "author": "Necessary_Ant6728",
      "created": 1635368060,
      "upvotes": 2,
      "replies": {
        "hiaquub": {
          "link": "/r/college/comments/qh4ty4/should_i_graduate_this_spring_or_stay_at_my/hiaquub/",
          "text": "I have to get a degree to make big girl money tho lol. Rn I making just enough to survive.",
          "author": "JessicaPopplewell49",
          "created": 1635369061,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}