{
  "sid": "pxyg2x",
  "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/",
  "title:": "How long is a 3-4 minute speech",
  "text": "I have a college speech due about movies. Any tips on the intro, and how long should it be? Tysm",
  "author": "whenshithitsthefan2",
  "created": 1632931251,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.71,
  "comments": {
    "heqtxq4": {
      "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqtxq4/",
      "text": "About 3-4 minutes",
      "author": "TheUnadvisedGuy",
      "created": 1632935622,
      "upvotes": 18,
      "replies": {
        "hequlbs": {
          "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/hequlbs/",
          "text": "I was kinda talking about the word count lmaoo",
          "author": "whenshithitsthefan2",
          "created": 1632935892,
          "upvotes": 9,
          "replies": {
            "heqvcy3": {
              "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqvcy3/",
              "text": "It depends how fast you talk",
              "author": "LordofDsnuts",
              "created": 1632936201,
              "upvotes": 23,
              "replies": {}
            }
          }
        }
      }
    },
    "heqqdne": {
      "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqqdne/",
      "text": "Just around 400 words. I would highly recommend writing it and practicing, though, because depending on how fast you deliver your words, it could easily go above or below the time constraints. Practice with a timer, see if you need to add anything to reach 3 minutes or maybe even just talk slower, and shoot for that 400 words or so and you should hit it, no trouble.",
      "author": "FutabaSakuroach",
      "created": 1632934190,
      "upvotes": 1,
      "replies": {
        "hequhj9": {
          "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/hequhj9/",
          "text": "Do u have any tips about the intro? The prompt is: \n\nYour All-Time Favorite Movie – Sometimes it is tough to just pick one, but take on the challenge. Why is this film at the top of your list? Given the fact that we may or may not all have seen the film, you will need to recap the story and tell us a bit about the characters. Pictures can help set the scene and introduce the characters as you talk about how you relate to them.\n\nTysm",
          "author": "whenshithitsthefan2",
          "created": 1632935850,
          "upvotes": 2,
          "replies": {
            "heqwn09": {
              "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqwn09/",
              "text": "No problem! So, for a speech like this, you'll want to pick out your topic. Once you know what movie you're talking about, I'd move forward with a loose structure that's like:\n\n-Greet the audience (\"hello everyone, I'm [name] and today I'm going to be talking to you about my favorite movie...\") and state what movie you'll be talking about\n-talk about the premise of the movie and some of the basic plot points (I would avoid bringing up any major spoilers or plot twists—just talking about the basic \"what is the movie about\" is enough)\n-if the plot is your favorite thing, you can transition into that from your introduction (\"and that's exactly why I like the movie so much—the plot is done really well/the story is super interesting/etc.\"). If not, you can spin it as \"but that's not why I like this movie so much. The main reason I like it is [reason].\"\n-from there, elaborate on that reason. Maybe you think the characters are really well done, or there was a major plot twist that you absolutely loved. Maybe it's an action movie and you think they choreographed the fight scenes really well, or they used music really well. Once you have the general reason laid out, you can elaborate and say \"especially during one particular scene, where [describe the scene]\". \n\nYou don't need to overthink the intro. It's enough to greet your audience and jump right into saying \"this is my favorite movie, it's about this, and here's why\".\n\nGood luck on your speech! I maybe gave a little more than you were asking for, but I hope it helps!",
              "author": "FutabaSakuroach",
              "created": 1632936714,
              "upvotes": 3,
              "replies": {
                "heqyne3": {
                  "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqyne3/",
                  "text": "Thank you so much, this literally helps me a lot, and thank you for being detailed, imma go use this to help me now lol, I hope u have a good day",
                  "author": "whenshithitsthefan2",
                  "created": 1632937532,
                  "upvotes": 1,
                  "replies": {
                    "heqzau2": {
                      "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqzau2/",
                      "text": "Of course, no problem! Best of luck on your assignment!",
                      "author": "FutabaSakuroach",
                      "created": 1632937798,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "heqln0x": {
      "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqln0x/",
      "text": "Honestly you can just BS for 3-4 minutes of speech, that’s not really hard. Just make sure you aren’t reading a script.",
      "author": "Spicybooiii",
      "created": 1632932327,
      "upvotes": 0,
      "replies": {}
    },
    "heqkfmv": {
      "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/heqkfmv/",
      "text": "[removed]",
      "author": null,
      "created": 1632931841,
      "upvotes": 1,
      "replies": {}
    },
    "hetbj79": {
      "link": "/r/college/comments/pxyg2x/how_long_is_a_34_minute_speech/hetbj79/",
      "text": "Write a paragraph and record yourself speaking it in your typical cadence, and then multiply that to see how many words you need to fill the time\n\nAlso note that most people speed up when they’re nervous and the words will go faster than you expect- so aim for 4 minutes rather than 3.",
      "author": "Silverdragon701",
      "created": 1632976487,
      "upvotes": 0,
      "replies": {}
    }
  },
  "updated": 1634051359
}