{
  "sid": "q4fdjr",
  "link": "/r/college/comments/q4fdjr/i_started_my_2nd_year_of_university_and_no_friend/",
  "title:": "I started my 2nd year of university and no friend group or special friendship. Afraid to end uni with no friends. Can you help me?",
  "text": " I started my university with online classes and entered later(2nd phase);I met some people but after the semester they were just someone to say hi.\n\n I'm in open course and I only have a common subject - were most of us meet people of the same course. The thing is: people of my course have more subjects together and they end up getting together (forming small groups, etc) and I have always different people! I do not have the meet people by \"friends of friends\" that much + those formed groups are intimidating for me. \n\nMaybe I'm making drama because I only started my real college experience this week but I'm afraid to not make friends because I changed a lot and majority of the friendships of hight school do not serve me anymore. People say that college is the best time to make friends/boyfriend and I don't want to miss it. I hope my second week of college gets better or I will just be anxious about it ( I have so many group works planned... let's see!)\n\n\nToday I did an activity and met so many people! But will they be potential friends or just someone to say hi? I've cried thinking about it (because I'm afraid to not make friendships in college).\n\nCan you help me? I will appreciate it\n\n(Sorry for my English)",
  "author": "Frequent-Candidate42",
  "created": 1633759486,
  "updated": 1634083135,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hfyesti": {
      "link": "/r/college/comments/q4fdjr/i_started_my_2nd_year_of_university_and_no_friend/hfyesti/",
      "text": "Not sure if this helps or not, but I graduated friendless. Not everyone finds their group in college. It’s not always guaranteed. \n\nI wouldn’t stress out about it too much. For the people you say hi to, if you share a class, ask about homework/whatever else to get any kind of connection going then just go from there.\n\nTry not to overthink it. Just introduce yourself to more people and talk about surface level things (classes, sports, etc).",
      "author": "BjornReborn",
      "created": 1633763678,
      "upvotes": 1,
      "replies": {}
    },
    "hfyrldr": {
      "link": "/r/college/comments/q4fdjr/i_started_my_2nd_year_of_university_and_no_friend/hfyrldr/",
      "text": "Join some clubs that you’re interested in.  At my school, some clubs are so tight-knit that even the alumni stay involved! (Social dance and the space club mostly, lol.)\n\nIf you can’t handle the time commitment (which is super valid btw, no need to overcommit), then make friends with people in your major. This will be easier once you specialize more and your classes go from, say, 300 people in freshman Chemistry to 10 people in Intermediate Sanskrit (or whatever). Also, freshman year isn’t the last chance to make friends; maybe 25% of my friends from college are people I met freshman year, but then again I‘m pretty introverted.  There definitely were people who stuck with their freshman clique all 4 years, but you don’t necessarily need to.  Good luck, have fun, enjoy campus!!!",
      "author": "civis_romanus",
      "created": 1633773764,
      "upvotes": 1,
      "replies": {}
    },
    "hfz2vsb": {
      "link": "/r/college/comments/q4fdjr/i_started_my_2nd_year_of_university_and_no_friend/hfz2vsb/",
      "text": "What's that saying.... Rome wasn't built in a day?",
      "author": "Awkward_Mail_2786",
      "created": 1633782066,
      "upvotes": 1,
      "replies": {}
    }
  }
}