{
  "sid": "q3wtfm",
  "link": "/r/college/comments/q3wtfm/starting_college_at_the_age_of_25_for_people_who/",
  "title:": "Starting college at the age of 25! For people who are in the same boat, what has your experience been like so far?",
  "text": "I am actually really excited to start my college journey at this age!\n\n**Some questions for you:**\n\nProfessors: How do your older students compare to your younger students? Who do you prefer teaching more and why?\n\nOther non-trad students: How has your experience been so far? Would you say it has been more difficult or less difficult compared to how you think it would have been at a younger age? I am hoping my life experience will help me out a lot here, and the drive to actually learn the material instead of just wanting to pass. The biggest challenge will definitely be working full time and going to school full time, but luckily I have 3 days off each week (I work four 10-hour shifts) to dedicate to schoolwork in addition to a few hours each day.\n\nYounger students: How do you feel about the older students in your classes?\n\n&#x200B;\n\n**Some background about me:** I graduated high school in 2014 with a 3.75 GPA in the top 10% of my class. While in high school, I was constantly torn between criminal justice and psychology and was originally planning on becoming a Forensic Psychologist. I pretty much had a full ride scholarship to a local university to obtain my bachelor's in psychology and possibly double major with criminal justice. HOWEVER...The registrars were extremely rude and unhelpful and I was honestly fed up with school at that point, and decided \"I'll just take a year off.\" One year turned into 7.5 and here I am lol. The good thing from this experience however, is I learned I didn't want to pursue that career path after all and I'm glad I hadn't wasted time and money for a degree I would end up not using.\n\nI worked in the psychiatric field for 5 years, doing anything from direct care/nursing assistant to working my way up as a Rehabilitation Teacher where I was responsible for getting our forensic population competent to stand trial. Unfortunately, this did not pay well at all so I decided to become a Correctional Officer. I did that for about a year and a half, working an 11 on 3 off 12 hour overnight schedule so I could save up money to move across the country from Texas to Washington state to be surrounded by nature and the ocean.\n\nI've always been passionate about the ocean and forests, but Texas obviously wasn't well known for them lol. I did a lot of self-reflection and realized something: We only live this life once, so why not learn everything I possibly can about something I am actually interested in? I always thought a Marine Biologist would be such a cool profession, but it always seemed like something you would dream about as a child like becoming an Astronaut.\n\nI realized I was the only person holding me back and that anything is possible. For the past couple of months, I have been working diligently to prepare myself for college in Spring of 2022. I was officially accepted to the University of Alaska Southeast as a Marine Biology major and I couldn't be more excited! I am currently living in Oregon, where I will be doing the first two years online to get my general education out of the way, and when we move to Alaska in 2 years I will be able to complete the rest of my degree in person since they have amazing field work opportunities for these classes! Upon completion of my bachelor's degree, I want to achieve a master's so I can learn as much as possible and give myself better job opportunities! \n\nBy the way, I just wanted to add I'm not going into this profession for the money. My fiancé and I are minimalists with a savings plan and somewhat financial freedom. I know the job market is a well-known problem for Marine Biology majors, but I am in it for the life experience and the marine mammals! :)",
  "author": "xxMandi_Mausoleumxx",
  "created": 1633696429,
  "updated": 1634083241,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hfur168": {
      "link": "/r/college/comments/q3wtfm/starting_college_at_the_age_of_25_for_people_who/hfur168/",
      "text": "The difference between a 25 and 18 year old is next to nothing. And you might as well be the same age as a 22 year old.\n\nIf you want any real advice, you aren't terribly nontraditional in terms of age. What will set you apart will be the few jobs you have had and the excitement and focus coming into school. Professors will appreciate that. Other students may look up to you for having had a job or two and your dedication. \n\nBut you may also get this weird idea in your head that being somewhat competent, living a comfortable and easy going life, and having a few jobs at the age of 25 makes you some worldly and seasoned nontraditional student. No one will even notice your age by your looks, and it will be annoying if you start acting like you ooze maturity.\n\nIf anything, just be very careful about the work thing. Is it necessary to work so many hours?\n\nIf it is, best of luck. If it isn't, and you begin to feel the stress or like you are missing out in classes, drop hours.\n\nIf I was you, I would literally drop that down to like 20 hours a week and tell your employer why (give at least 2 weeks notice, preferably more), and say you will take on more if you feel fit. You may, and in that case you can add more hours. And you may not, in which case you will be very thankful you already took care of dropping hours prior to studies.",
      "author": "NeedEvolution",
      "created": 1633701010,
      "upvotes": 3,
      "replies": {}
    },
    "hfw04j2": {
      "link": "/r/college/comments/q3wtfm/starting_college_at_the_age_of_25_for_people_who/hfw04j2/",
      "text": "as a student most students can’t tell how old other students are. some people j naturally look older and younger so unless u tell ppl they probs won’t notice or care\n\nhonestly a lot of the traditional students do look up to and ask help from mature students as they seem to be more focused and able to comprehend the material better.",
      "author": "trackxdreams",
      "created": 1633720136,
      "upvotes": 2,
      "replies": {}
    },
    "hfuvwtn": {
      "link": "/r/college/comments/q3wtfm/starting_college_at_the_age_of_25_for_people_who/hfuvwtn/",
      "text": "I started college at 26 and currently working full time for the government. It’s rough managing both and you will miss out on a lot. I’ve decided next year I’m only taking a single class or two because my career is more important than college. I feel you will have to make that decision at some point to either pick your career or school. As for being older, no one really cares.",
      "author": "Spicybooiii",
      "created": 1633703238,
      "upvotes": 1,
      "replies": {}
    }
  }
}