{
  "sid": "9apkwk",
  "link": "/r/college/comments/9apkwk/dont_be_that_kid/",
  "title:": "Don't be that kid",
  "text": "You know who I'm talking about.\n\nThe one who asks questions because he likes to hear is own voice and has nothing to do with the focused material. \n\nThe guy who asks the question not due to genuine confusion, but just to show the class that he read ahead.\n\nThere's a time and place for everything and I encourage enthusiasm for the material, but dont fucking interrupt the professor 5 times during the class with questions about shit you saw on a YouTube video. \n\nSorry, I'm a little jaded today. ",
  "author": "EvoVz",
  "created": 1535381586,
  "over_18": false,
  "upvotes": 1406,
  "upvote_ratio": 0.97,
  "comments": {
    "e4xqmdl": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xqmdl/",
      "text": "r/CollegeRant",
      "author": "ecklesweb",
      "created": 1535402007,
      "upvotes": 1
    },
    "eat01my": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/eat01my/",
      "text": "Ughhh there’s someone like this in my quantum physics class and every time he opens his mouth I feel a migraine coming on ",
      "author": "kiichimatsu",
      "created": 1543604838,
      "upvotes": 1,
      "replies": {}
    },
    "e63nxkp": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e63nxkp/",
      "text": "I’m always particular about my questions. If I get something a lot quicker than others, I try to not make that obvious so that they feel left out in not knowing. \n\nPeople who do what you described are genuine assholes looking to impress nobody.",
      "author": null,
      "created": 1537138592,
      "upvotes": 1,
      "replies": {}
    },
    "e58s7c9": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e58s7c9/",
      "text": "It's mostly a freshman thing if you ask me. They grow out of it.",
      "author": "kierkegaard1855",
      "created": 1535850849,
      "upvotes": 1,
      "replies": {}
    },
    "e52x6lh": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e52x6lh/",
      "text": "Not gonna lie, I’m probably “that kid”.  When I ask a million questions, it usually has to do with the subject matter, but in a weird way.  I ask a million questions because I wanna know.  But I quickly realized, doing so was kinda selfish and should be kept in e-mails.  \nFor example, I had a cosmology class and would ask every physics question possible concerning the topic he was on.  Wasn’t always irrelevant.  But not necessary for everyone to know.  ",
      "author": null,
      "created": 1535605797,
      "upvotes": 2,
      "replies": {
        "e52zhq4": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e52zhq4/",
          "text": "You're not the guy, my friend. You are someone who is confused and is courageous enough to ask about it when you should, which is during class. \n\nYou are not who I described above",
          "author": "EvoVz",
          "created": 1535609546,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e4zve2q": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4zve2q/",
      "text": "How do you know if you're that kid or not? ",
      "author": null,
      "created": 1535488922,
      "upvotes": 2,
      "replies": {
        "e5014w6": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e5014w6/",
          "text": "Social awareness",
          "author": "EvoVz",
          "created": 1535493932,
          "upvotes": 2,
          "replies": {
            "e5050gu": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e5050gu/",
              "text": "non answer",
              "author": null,
              "created": 1535497543,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e5013qk": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e5013qk/",
          "text": "Oh fuck",
          "author": "EvoVz",
          "created": 1535493901,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e4zu3py": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4zu3py/",
      "text": "This guy in my government class is e x a c t l y like this and just... loves hearing himself talk. And kissing up to the professor. And he sits right next to me 🙃.",
      "author": "HolidayAardvark",
      "created": 1535487836,
      "upvotes": 2,
      "replies": {}
    },
    "e4z6zfi": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4z6zfi/",
      "text": "Update: He is in my Physics class too. Fml",
      "author": "EvoVz",
      "created": 1535468175,
      "upvotes": 3,
      "replies": {}
    },
    "e4z1w96": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4z1w96/",
      "text": "Oh my god this kid in my acoustics class right now. We get it you've taken calculus, you're not the only one. We aren't even doing derivatives or integrals and no one is impressed you know those words.\n\nE: He's also the only person in the class who doesn't raise his hand and will just start talking because what he has to say is so important. The third day and the teacher starting ignoring him.",
      "author": "Bomcom",
      "created": 1535463377,
      "upvotes": 1,
      "replies": {}
    },
    "e4ywgh7": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4ywgh7/",
      "text": "Sucks I know one of each in my class. ",
      "author": null,
      "created": 1535456940,
      "upvotes": 1,
      "replies": {}
    },
    "e4yh4re": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yh4re/",
      "text": "TO BE FRANK, I'd prefer that over a completely dead, apathetic class, which is all too common in my major. Sorry, just me.",
      "author": "TheAverageJo",
      "created": 1535428890,
      "upvotes": 4,
      "replies": {
        "e4yzdfr": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yzdfr/",
          "text": "Just as bad I would say",
          "author": "EvoVz",
          "created": 1535460644,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e4yef8y": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yef8y/",
      "text": "Only had one of those kids once and it only happened once. First class of an intro to psychology class and he kept making some joke about siths dealing in absolutes",
      "author": "Jah-Eazy",
      "created": 1535425711,
      "upvotes": 2,
      "replies": {}
    },
    "e4y2572": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y2572/",
      "text": "Amen.\n\nBut as someone that some people might call \"that kid\" - it's not always me liking to hear my own voice.\n\nFor me to truly understand a concept I have be able to explain it in my own words. Luckily for me just about all of my teachers seem to get that and were happy to take the questions. If I'm not saying much at all in a class it's either because I'm not at all interested (very rare!) or I'm totally lost and have written up that session for homework. (Google until I find an explanation I can understand (AKA how i got through calculus 2))",
      "author": "Diabeetush",
      "created": 1535412840,
      "upvotes": 2,
      "replies": {}
    },
    "e4xxy4c": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xxy4c/",
      "text": "had a kid rant about how he hates Microsoft for like 10 minutes in my software apps class lmao",
      "author": "AeroRL",
      "created": 1535408591,
      "upvotes": 7,
      "replies": {}
    },
    "e4xxx1i": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xxx1i/",
      "text": "Not the exact same thing, but a guy in my class today asked the professor multiple times if the powerpoints would be posted online. The professor kept giving the same answer, yes, but not until a while after the lecture had already been given.\n\nThen when the professor showed us a slide on a PowerPoint with information about a quiz on the metric system, the same guy asked \"how am I supposed to get that information before the quiz if it's not posted online? The  metric system might be different on different websites\" \n\nPeople had to tell him to write it down. 🤦‍♀️And the professor told him the metric system is always the same. 😒",
      "author": "Robin1762",
      "created": 1535408562,
      "upvotes": 6,
      "replies": {}
    },
    "e4xvm9h": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xvm9h/",
      "text": " My friend today had a a girl in her bio class ask a question regarding cold temperature and her nipples ",
      "author": null,
      "created": 1535406290,
      "upvotes": 7,
      "replies": {}
    },
    "e4xu1pn": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xu1pn/",
      "text": "So, if I’m hearing this right, you want people like me, whose IQ is well beyond that of an average professor, to not ask a question that has more to do with exalting myself than furthering the actual conversation? That reminds me of the time I was dead lifting about six hunny and these girls were like “oh my God what a champ” and then my 13 inch dong fell out. ",
      "author": "yahwell",
      "created": 1535404884,
      "upvotes": 10,
      "replies": {}
    },
    "e4xt3qx": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xt3qx/",
      "text": "When n=1\n\n“Well, my experience is different from what we read because...”\n\nI don’t want to hear your stupid life story. Keep it to yourself or save it for office hours. ",
      "author": "pacg",
      "created": 1535404056,
      "upvotes": 4,
      "replies": {}
    },
    "e4xlnib": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xlnib/",
      "text": "What about asking a question due to curiousity about something the professor said?",
      "author": "Idrahaje",
      "created": 1535397902,
      "upvotes": 3,
      "replies": {
        "e4y4qpj": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y4qpj/",
          "text": "Most students are fine with questions and discussions that are on topic. It's those droning questions that turn into an irrelevant story that are annoying.",
          "author": "notleonardodicaprio",
          "created": 1535415557,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e4xkza6": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xkza6/",
      "text": "Let me go for a Counterpoint. I have been a professor and a student. During my studentship I was one who spoke a lot in class. I know for a fact it annoyed some students. But I paid a lot of money to get all I could out of those classes, and what may have appeared to some as me just wanting to hear the sound of my own voice was really me filling in the gaps in my own knowledge and bouncing ideas off of an expert. Instead of worrying about what other students do and how other students look in class, try and get as much as you can out of class. If the outspoken student is ruining that, that is one thing and is worth addressing either to the student or prof. But generally in my experience this is not the case, and quieter students are odten either shy, unprepared, or not willing to put themselves out there, which isn't helpful anymore than it is helpful for someone to interrupt with trivial stuff all the time.  ",
      "author": "Reggaepocalypse",
      "created": 1535397350,
      "upvotes": 21,
      "replies": {
        "e4xuoox": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xuoox/",
          "text": "Thank you for sharing. I wrote the post with peak annoyance so it may have come off a little bitchy. I agree that not asking questions and not being outspoken will not solve a students problems. I'm hitting more on conversational type questions a student asks during valuable class time or just to confirm a topic that he clearly read or is knowledgable on",
          "author": "EvoVz",
          "created": 1535405447,
          "upvotes": 13,
          "replies": {}
        },
        "e5nmq8u": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e5nmq8u/",
          "text": "finally someone said it! thank you.",
          "author": "thatsmooddude",
          "created": 1536481957,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e4xksrb": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xksrb/",
      "text": "Let’s not forget those who ask questions that only relate to their situation, making the rest of the room listen to a lengthy answer that is not applicable to the lesson or anyone else for that matter. \nNo, Tracy, this is not a good time to ask if you can eat cheese because you have 10 allergies. ",
      "author": "IvanaTwinkle",
      "created": 1535397194,
      "upvotes": 11,
      "replies": {}
    },
    "e4xk1cu": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xk1cu/",
      "text": "This is at least a quarter of every poli sci class",
      "author": "YIRS",
      "created": 1535396528,
      "upvotes": 12,
      "replies": {}
    },
    "e4xg8ad": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xg8ad/",
      "text": "Shit that's me\n\n&#x200B;",
      "author": "Dictorclef",
      "created": 1535393117,
      "upvotes": 18,
      "replies": {
        "e4xravu": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xravu/",
          "text": "At least someone acknowledges this behavior! This is ok because now you can work on it lol. It is quite annoying for the rest of the class. ",
          "author": "zzzrecruit",
          "created": 1535402567,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "e4xg49y": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xg49y/",
      "text": "I'm not a kid at all, but this is my semester back at school (2nd semester back because took all online classes over the summer), and I'm taking it really serious this time around.\n\nTo what extent is asking too many questions would make me a douche? I'm not going to change my habits regardless I'm just curious",
      "author": "noogiey",
      "created": 1535393024,
      "upvotes": 4,
      "replies": {
        "e4z57q2": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4z57q2/",
          "text": "Asking normal, on topic questions to help your understanding is fine. What's not fine is asking nit-picky questions that don't contribute to the class and just try to show everyone how smart you are.",
          "author": "Greens271",
          "created": 1535466567,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e4xf7ga": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xf7ga/",
      "text": "I loved my undergrad professors who would blatantly ask whatever topic they were going on about related to the course material. As a liberal arts school, it was encouraged to relate non-course material. But there was ALWAYS at least one person who couldn’t relate it back and we’d waste 30+ minutes because, “I’ll make my point in a second.”",
      "author": null,
      "created": 1535392266,
      "upvotes": 5,
      "replies": {
        "e4yhhaf": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yhhaf/",
          "text": "Lol once some kid did that and found a way to relate beard shaving to the theology lecture lol.\n\nThe professor asked him how his story fit our religious discussion and the student explained that the beard can represent all the heaviness/sin/stress in our lives and how shaving it is like how some people repent or ask forgiveness or meditate or whatever. It was the most interesting discussion ever lol",
          "author": "musiclovermina",
          "created": 1535429338,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e4xf2cw": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xf2cw/",
      "text": "I had a guy who was a biology major in my philosophy class who thought he was a genius. Just asked dumb questions and argued with the professor. (I dropped the class in part because of this, despite being excited about the material..but mainly because it ended at 9PM and I had to drive home for an hour after that, but this kid pushed me over the edge for a 2 hour discussion class)\n\nOnly he didn't relate to the material. He just tried to outwit the professor. We were discussing Foucault (what the class was about) and he made a joke about dropping soap whike we were talking about punishment then asked how we know killing babies is wrong trying to be clever.\n\nThe professor said \"I hope you're not seriously asking that, but if you are, there's no need for you to take this class because you're seriously fucked up.\"\n\nI hope that dude dropped the class. If not I pity all the people in it.",
      "author": null,
      "created": 1535392148,
      "upvotes": 14,
      "replies": {}
    },
    "e4xeczh": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xeczh/",
      "text": "\"Professor, I know this is an art course, but I'd like to take this time to ask you about your views on socialism.\"\n\nThere's almost always at least one kid per semester that tries to gravitate the lecture to politics. No clue why.",
      "author": null,
      "created": 1535391542,
      "upvotes": 109,
      "replies": {
        "e4xkp8g": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xkp8g/",
          "text": "[deleted]",
          "author": null,
          "created": 1535397107,
          "upvotes": 15,
          "replies": {
            "e4xl1jl": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xl1jl/",
              "text": "Politics have been especially touchy on college campuses since the start of the 2016 election. Which side of the aisle is more prevalent among the students and faculty depends entirely on the school and location. ",
              "author": null,
              "created": 1535397401,
              "upvotes": 24,
              "replies": {}
            }
          }
        }
      }
    },
    "e4xcwpg": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xcwpg/",
      "text": "I’m currently on Reddit because that exact kid won’t stop asking off topic questions in this history class ",
      "author": "xFaro",
      "created": 1535390288,
      "upvotes": 6,
      "replies": {
        "e4xp4rl": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xp4rl/",
          "text": "Same ",
          "author": null,
          "created": 1535400779,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e4xcuem": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xcuem/",
      "text": "In this one class I had someone would ask a question and essentially answer their own question. It always kept us from being done early",
      "author": "THISisKROD13",
      "created": 1535390233,
      "upvotes": 5,
      "replies": {}
    },
    "e4xcqb4": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xcqb4/",
      "text": "\"There's always someone who shits in the apple pie!\"- terrible movie reference ",
      "author": "Redd889",
      "created": 1535390132,
      "upvotes": 1,
      "replies": {}
    },
    "e4xcft5": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xcft5/",
      "text": "[deleted]",
      "author": null,
      "created": 1535389872,
      "upvotes": 26,
      "replies": {
        "e4xuavd": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xuavd/",
          "text": "This is literally the kid in my class",
          "author": "EvoVz",
          "created": 1535405110,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "e4xc31v": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xc31v/",
      "text": "I wish this could be announced at the beginning of every lecture without discouraging students with real questions to raise their hand. It is so disruptive and annoying. Yes, we know you're smart on this topic. But nobody cares. We're here to learn about the material and the professor is here to teach it; not to awe in your knowledge.  \n",
      "author": "VanLaux",
      "created": 1535389562,
      "upvotes": 17,
      "replies": {
        "e4xubup": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xubup/",
          "text": "My thoughts exactly",
          "author": "EvoVz",
          "created": 1535405134,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e4xbffc": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xbffc/",
      "text": "There was always that one kid who would ask the nutrition professor if rolling their own tobacco makes it safe. And goes into specfic detail to argue about why it’s safe. With a dietician.",
      "author": "Burritoassasain",
      "created": 1535388990,
      "upvotes": 17,
      "replies": {}
    },
    "e4xbcy7": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xbcy7/",
      "text": "I always end up sitting behind the sociology major who's the class bobblehead. Nodding and shaking her head with loud grunts of agreement or disagreement depending on the lecture. ",
      "author": "JamesDaquiri",
      "created": 1535388931,
      "upvotes": 19,
      "replies": {
        "e4yhuy5": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yhuy5/",
          "text": "Ah fuck, that's me! I don't make any noise and I'm not a sociology major, but I'm definitely the bobblehead nodding along. I also have overactive eyebrows, but no one can see that but the Professor, unless they turn around.",
          "author": "SomeBroadYouDontKnow",
          "created": 1535429828,
          "upvotes": 7,
          "replies": {
            "e4yhvwf": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yhvwf/",
              "text": "The important thing is you're not a sociology major ",
              "author": "JamesDaquiri",
              "created": 1535429862,
              "upvotes": 4,
              "replies": {
                "e4yjmeu": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yjmeu/",
                  "text": "And here I was on Craigslist looking for a guy who knows how to swap out necks.",
                  "author": "SomeBroadYouDontKnow",
                  "created": 1535432287,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e4xb5wb": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xb5wb/",
      "text": "Back in my first year of college there were two kids like this in my intro to astronomy class. They'd go off of each other which just made it so much worse.",
      "author": "TheGayWildGoose",
      "created": 1535388766,
      "upvotes": 14,
      "replies": {}
    },
    "e4xavi3": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xavi3/",
      "text": "Have two classes with a person doing that shit in each. My one professor openly rolled her eyes at them and cut them off. ",
      "author": "deadwlkn",
      "created": 1535388518,
      "upvotes": 182,
      "replies": {
        "e4xckwm": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xckwm/",
          "text": "I appreciate the crap out of profs who will shut these kids up.    \n\nThere was one girl that I had in a few classes (intro classes that had to be taken in sequence, so a lot of people ended up in a few classes over a few sems). There was one prof who shut her up, but it was the second time he had her in a class. It took toooooo long",
          "author": "drelisa",
          "created": 1535389998,
          "upvotes": 103,
          "replies": {}
        }
      }
    },
    "e4x9lic": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x9lic/",
      "text": "seems like you saw that kid.",
      "author": "Dart-Feld",
      "created": 1535387405,
      "upvotes": 1,
      "replies": {}
    },
    "e4x89v9": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x89v9/",
      "text": "Always that one guy who tries to start a debate on communism in biology class or some shit. ",
      "author": "BattlefieldNiblet",
      "created": 1535386243,
      "upvotes": 621,
      "replies": {
        "e4xejc9": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xejc9/",
          "text": "\"And now if you'll look to the powerpoint, you'll see that the axon is-\"\n\n#\"THE HOLODOMOR WAS CAPITALIST PROPAGANDA!\"",
          "author": null,
          "created": 1535391694,
          "upvotes": 181,
          "replies": {}
        },
        "e4xfln7": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xfln7/",
          "text": "Or people ranting about Trump in a pre 1800's history class... ",
          "author": "touchtime1337",
          "created": 1535392593,
          "upvotes": 114,
          "replies": {
            "e4xg0be": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xg0be/",
              "text": "Or bringing up “Islamic terrorism” in a theology class. Yeesh.",
              "author": null,
              "created": 1535392929,
              "upvotes": 89,
              "replies": {
                "e4xkppq": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xkppq/",
                  "text": "Well jihad is a theological concept...",
                  "author": "Reggaepocalypse",
                  "created": 1535397119,
                  "upvotes": 70,
                  "replies": {
                    "e4xlnur": {
                      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xlnur/",
                      "text": "Jihad is completely different (from a theological standpoint) than what it is being practiced as today...just a heads up",
                      "author": "adeebabbas",
                      "created": 1535397911,
                      "upvotes": -6,
                      "replies": {
                        "e4xmzs5": {
                          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xmzs5/",
                          "text": ">In classical Islamic law, the term often refers to armed struggle against unbelievers\n\nhttps://en.m.wikipedia.org/wiki/Jihad\n\nTwo citations?\n\nYes, it has many meanings in different contexts. I mean, we also have a war on drugs and “battle with ourselves.” That doesn’t mean those words lose their classical meaning.",
                          "author": null,
                          "created": 1535399022,
                          "upvotes": 29,
                          "replies": {
                            "e4xnwgk": {
                              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xnwgk/",
                              "text": "There's actually difference in interpretations too between different sects (primarily shias and sunnis). In Shias, it's not necessarily related to actual physical violence.\n\"The sigh of the sorrowful for the wrong done us is an act of praise (tasbih) [of God], his sorrow for us is an act of worship, and his keeping of our secret is a struggle (jihad) in the way of God\" -- Ja'far al-Sadiq (6th Shia Imam).\nI do get your point as other sects of muslims have taken it to a completely different interpretation. I guess that's the reason why Shias are in minority and are attacked by almost all the terror organisation in the middle east. ",
                              "author": "adeebabbas",
                              "created": 1535399768,
                              "upvotes": 15,
                              "replies": {
                                "e4xta6q": {
                                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xta6q/",
                                  "text": "It’s like literature class: there are no right or wrong interpretations, as long as you base it in the text!   :(",
                                  "author": "unchartedd",
                                  "created": 1535404210,
                                  "upvotes": 3,
                                  "replies": {
                                    "e4xu8yt": {
                                      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xu8yt/",
                                      "text": "I might still disagree because the terrorists ignore other large parts of the text....but idk if it's related to religion or personal interests of local war lords and stuff.",
                                      "author": "adeebabbas",
                                      "created": 1535405063,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "e4xn09d": {
                              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xn09d/",
                              "text": "Non-Mobile link: https://en.wikipedia.org/wiki/Jihad\n***\n^HelperBot ^v1.1 ^/r/HelperBot_ ^I ^am ^a ^bot. ^Please ^message ^/u/swim1929 ^with ^any ^feedback ^and/or ^hate. ^Counter: ^208493",
                              "author": "HelperBot_",
                              "created": 1535399033,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "e5faznz": {
                              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e5faznz/",
                              "text": "Wikipedia lmao",
                              "author": "verktyg",
                              "created": 1536137453,
                              "upvotes": 1,
                              "replies": {
                                "e5fpj15": {
                                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e5fpj15/",
                                  "text": "You don’t know what “two citations” means?",
                                  "author": null,
                                  "created": 1536158126,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e4y1wi9": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y1wi9/",
                  "text": "It depends on the book/class really.\n\nSome classes are strictly theology by the book and culture of the times. Some theology classes goes over modern issues/beliefs surrounding religions.\n\nFrankly, I think going into the modern views/interpretations of religions and their internal/external issues is the right way for a theology class to go. Islamic terrorism is a definite issue today that should at least be discussed. Same with Christianity and acceptance of homosexuality (lots of disagreement even within the Christian community!).",
                  "author": "Diabeetush",
                  "created": 1535412593,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "e4xl78i": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xl78i/",
              "text": "Literally never seen this. Not even pro-Trump stuff. Really it's the fringe politics people that are the most vocal. The college tankies and the ever-so-edgy \"race realists\" are the most vocal, at least in my experience.",
              "author": null,
              "created": 1535397530,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "e4zk40m": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4zk40m/",
          "text": "Had a nut who went off about abortion in an ecology class. We were talking about coral reefs ",
          "author": null,
          "created": 1535479421,
          "upvotes": 8,
          "replies": {}
        },
        "e4z5fn9": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4z5fn9/",
          "text": "Literally me my junior year of high school lol",
          "author": "Miracow",
          "created": 1535466770,
          "upvotes": 7,
          "replies": {}
        },
        "e4xp1t9": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xp1t9/",
          "text": "SJW- HOW DARE YOU ASSUME THE ANIMAL'S GENDER\n\nProf- Uh, you can see the anatomy, this is clearly a male\n\nSJW- YOU AND YOUR \\[expletive\\] PATRIARCHY! \\*storms out of class\\*",
          "author": "FockerXC",
          "created": 1535400715,
          "upvotes": -39,
          "replies": {
            "e4xv74d": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xv74d/",
              "text": "No one is like that",
              "author": "Chiiwa",
              "created": 1535405912,
              "upvotes": 62,
              "replies": {
                "eauhsyo": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/eauhsyo/",
                  "text": "In his head they are ",
                  "author": "jimboe1234",
                  "created": 1543660867,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e4x89ff": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x89ff/",
      "text": "My worst is the kid who asks a question along the lines of what the professor just explained. \"So 2 plus 3 equals 5, and this is why.....\"\n\n30 seconds later,\n\n\"Wait why does 2 plus 3 equal 5?\"",
      "author": "UnfurnishedPanama",
      "created": 1535386232,
      "upvotes": 29,
      "replies": {}
    },
    "e4x7yi6": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x7yi6/",
      "text": "I do like the kid who answers the questions tho. Especially in a class that has a lot of participation...I'll just sit there and zone out. Lol",
      "author": "Anders-94",
      "created": 1535385960,
      "upvotes": 105,
      "replies": {
        "e4xf6tr": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xf6tr/",
          "text": "I'm that kid because no one answers and I don't like sitting in awkward silence forever while the professor asks us how to conjugate wissen.",
          "author": null,
          "created": 1535392251,
          "upvotes": 86,
          "replies": {
            "e4y673l": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y673l/",
              "text": "Thank you for your service. ",
              "author": "spectrem",
              "created": 1535417062,
              "upvotes": 16,
              "replies": {}
            },
            "e4yqy9u": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yqy9u/",
              "text": "This was me in a physics class of about 60 people. Literally no one answered questions ever except me and the guy sitting next to me. I've tried not answering and letting other people answer, but it's just the most awkward silence ever and then the professor starts looking at me with these pleading eyes and I have to answer. They weren't hard questions. Probably something she literally said the answer to not even 1 minute prior, but nobody ever answered.\n\nBack in school, they had those popsicle sticks with the names on them. Probably not practical in college with all the people who cut, but I'm sure someone has made an app somewhere where people can log in and the teacher can use it to randomly call on someone. They could even use it for attendance and participation points.\n\nEven pointing at someone and saying: \"Hey you! Yeah you, answer this question!\" Would be better than just putting it out to the group and hoping someone would answer.",
              "author": "peregrin5",
              "created": 1535446305,
              "upvotes": 15,
              "replies": {}
            },
            "e4yj9hp": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yj9hp/",
              "text": "This. Although the teachers eventually tell you to stop answering so you get to spend 5m in dead silence",
              "author": "malversation2",
              "created": 1535431736,
              "upvotes": 2,
              "replies": {}
            },
            "e4ybxmp": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4ybxmp/",
              "text": "I feel this. Every compsci class. Every damn day",
              "author": "justbarkli",
              "created": 1535422960,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e4y4jwy": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y4jwy/",
          "text": "Almost every seminar-style class I've been in, there are only like 5 kids who participate all semester. For fuck's sake, don't take a seminar course if you're not going to talk. ",
          "author": "notleonardodicaprio",
          "created": 1535415363,
          "upvotes": 5,
          "replies": {
            "e50utsk": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e50utsk/",
              "text": "There's people who rather listen, personally I come up with questions in my head to ask after class. ",
              "author": "Anders-94",
              "created": 1535527446,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "e4x7qem": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x7qem/",
      "text": "Had this dude last year. He was clearly smart and interested in whatever but the questions weren't about stuff we were studying or would need for that course generally. A few people picked up on it and called him out on it and he wasn't too happy with that ",
      "author": "Merpedy",
      "created": 1535385758,
      "upvotes": 18,
      "replies": {}
    },
    "e4x7dib": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x7dib/",
      "text": "there’s this one dude in my English class, and whenever we’re having class discussions, he’ll just absolutely hijack any and all discussion and nobody else will have any opportunity to say anything at all\n\nquite annoying ",
      "author": null,
      "created": 1535385438,
      "upvotes": 57,
      "replies": {
        "e4xexuh": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xexuh/",
          "text": "I dealt with that kid in high school AND college. Seriously, small town with liberal arts colleges, at least half the students went to one or the other. This guy thought he was such hot shit in high school and wouldn’t let anyone else speak, or would speak over them when he disagreed. Fast forward to senior year of undergrad, we happen to be in the same non-major course together. He starts debating (over a question that the answer was right in front of us in our textbook). The professor let it happen and then responded with, “would anyone else like a chance to speak on this topic since we got a lengthy, and incorrect, response from a peer.” DON’T be that person, please. ",
          "author": null,
          "created": 1535392040,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "e4x68bu": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x68bu/",
      "text": "\"That kid\" wouldn't exist if he or she would only take five minutes to read the syllabus and stayed on topic.",
      "author": null,
      "created": 1535384423,
      "upvotes": 11,
      "replies": {}
    },
    "e4x5knw": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x5knw/",
      "text": "Also, usually the same person: don't be the person to sit in office hours with the professor when you don't have any specific questions. I am so fucking serious there was a line of 20 people outside this professors door one time and this one kid everyone knew about was in there trying to get brownie points with the professor. I ended up never being able to use office hours for that class. ",
      "author": "chevybow",
      "created": 1535383827,
      "upvotes": 120,
      "replies": {
        "e4xvq8a": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xvq8a/",
          "text": "I was in a small class and the prof actually seemed kind of sad and desperate for people to come because no one did. She even told people to come if they just wanted to discuss random stuff. I probably should've taken her up on the offer but I didn't need help with anything and couldn't be bothered. :(",
          "author": "Chiiwa",
          "created": 1535406390,
          "upvotes": 24,
          "replies": {}
        },
        "e4x6b7n": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x6b7n/",
          "text": "The professor probably hates that kid too.",
          "author": null,
          "created": 1535384495,
          "upvotes": 83,
          "replies": {
            "e4x6voa": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x6voa/",
              "text": "Oh I guarantee it ",
              "author": null,
              "created": 1535385002,
              "upvotes": 29,
              "replies": {}
            }
          }
        },
        "e4xi93z": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xi93z/",
          "text": "[deleted]",
          "author": null,
          "created": 1535394870,
          "upvotes": 9,
          "replies": {
            "e4xrzoa": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xrzoa/",
              "text": "Maybe. Sometimes people want a tiny bit of privacy when talking about their work and their courses, so your presence during the entire time either makes things very uncomfortable for others, or it just straight up prevents them from attending. They're not likely to say \"no, I need you to leave\". Imagine going to the trouble of attending office hours, hoping to catch just a few minutes to talk about your grades, and then finding out you'll have to organise a separate time because one kid just refuses to leave the room. \n\nI would never stay in my supervisor's office without having a question for them. There are other conversations he needs to have that I have no right to listen to. There is work he needs to mark that I have no right to see. Professors cannot (under regular circumstances) close the door of their office if a student is in there, so the door being open doesn't mean that discussions are public. ",
              "author": "NoxiousQuadrumvirate",
              "created": 1535403127,
              "upvotes": 33,
              "replies": {
                "e4xu8x6": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xu8x6/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1535405062,
                  "upvotes": -12,
                  "replies": {
                    "e4xuxed": {
                      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xuxed/",
                      "text": "I can understand that you're in a tough spot, but you have to see that that behaviour can be problematic for other people. Some students just aren't going to want you there whilst they're asking about the course content. \n\nYou can say that you asked them if it was okay or that you were happy to leave if they'd told you to, but that's just paying lip service to the problem. There are so many students here anxious over what they'll wear to class, how they're supposed to say hello to someone, and how office hours are even supposed to work. You can't reasonably expect them to stand in front of you and the professor and directly ask you to leave. It's a very confronting experience for someone who is so private they don't want you there to begin with. \n\nYeah, they should probably organise a separate time, but if their question will only take 30 seconds then it'd be nice for them to be able to slip in and out without needing to go through that rigmarole. Office hours are also not usually just for your class and not just for your work. They are a promise that the professor will be in their office, for *anyone* to talk to.\n\nYou usually share that time with all years, all courses, all graduates, and also all faculty. If that time was truly like another class then it's a different case and can't really be discussed as \"office hours\". ",
                      "author": "NoxiousQuadrumvirate",
                      "created": 1535405665,
                      "upvotes": 23,
                      "replies": {
                        "e4y0plb": {
                          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y0plb/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1535411375,
                          "upvotes": 1,
                          "replies": {
                            "e4y1zai": {
                              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y1zai/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1535412672,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "e4xzt57": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xzt57/",
              "text": "[deleted]",
              "author": null,
              "created": 1535410454,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "e4y8o9h": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y8o9h/",
          "text": "Lol sorry that was probably my brother",
          "author": "musiclovermina",
          "created": 1535419631,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e4x49dj": {
      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x49dj/",
      "text": "Lol theres at least one of those people you have to deal with every semester. Idk how people can have so little self awareness and not realise they arent impressing anyone, just annoying them ",
      "author": null,
      "created": 1535382646,
      "upvotes": 274,
      "replies": {
        "e4x91lb": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x91lb/",
          "text": "Honestly self-awareness is a skill a *ton* of people lack generally speaking.",
          "author": null,
          "created": 1535386926,
          "upvotes": 103,
          "replies": {
            "e4xfrtn": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xfrtn/",
              "text": "How would one learn to be self aware? ",
              "author": null,
              "created": 1535392735,
              "upvotes": 8,
              "replies": {
                "e4xifxl": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xifxl/",
                  "text": "Nice try skynet",
                  "author": null,
                  "created": 1535395085,
                  "upvotes": 56,
                  "replies": {}
                },
                "egiig25": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/egiig25/",
                  "text": "Meditation",
                  "author": "jppdan",
                  "created": 1550211036,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "e4x9swg": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x9swg/",
          "text": "I remember a guy some years ago who would mouth off and thought he was hot shit.  There was a presentation where business attire was mandatory and he just showed up in a t-shirt because he thought it didn't matter.  He wasn't allowed to do his presentation.  I hope he got a zero but he probably turned in his work and got partial credit.",
          "author": "alien6",
          "created": 1535387587,
          "upvotes": 32,
          "replies": {
            "e4xoqkw": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xoqkw/",
              "text": "Damn what an asshole. Sheesh it doesn't take much effort to throw on a white shirt and a blazer, I had to do it like weekly in my major. Why people can't just follow simple directions like everyone else baffles me.",
              "author": null,
              "created": 1535400469,
              "upvotes": 11,
              "replies": {
                "e4yh2f0": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yh2f0/",
                  "text": "Eh, yes and no. I took a different Professor this semester specifically because I heard the one I would originally have taken has a class requirement of dressing up once a week and I heard this Professor specifies that women aren't dressed up unless they're in heals.\n\nI walk 30 minutes to class every day. That's not happening in heals. Even if I packed heals, the walk can still be pretty sweaty (especially on hot days with 30lbs of supplies strapped to my back) and I wouldn't want to lose out on points for not looking \"put together\" due to a sweaty walk.\n\nNow, once or twice is no big deal, and I agree this kid should've been docked for not meeting that requirement, but having to do that regularly often means more than the jacket blazer combo for half of the population. ",
                  "author": "SomeBroadYouDontKnow",
                  "created": 1535428811,
                  "upvotes": 8,
                  "replies": {
                    "e4ykyi4": {
                      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4ykyi4/",
                      "text": "Someone saying that women *must* wear heels to be wearing proper business attire is a problem and you should almost certainly be reporting that. Flats should always be an available alternative. ",
                      "author": "NoxiousQuadrumvirate",
                      "created": 1535434368,
                      "upvotes": 19,
                      "replies": {
                        "e4z6mi0": {
                          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4z6mi0/",
                          "text": "I responded to the other comment mentioning this is a title IX violation-- if I filed a complaint, would it be taken seriously by someone who didn't take the class themselves and only heard it from someone who did?\n\nI have the girl's number who *did* take the class and told me about it (because, like I said above, I just picked another Professor when I heard this) so even if I can't file the complaint myself, there's still a possibility of getting it taken care of. I didn't even know it was such a big deal, because I figured \"if a job can require women to wear heals, a professor probably can too.\" So I just figured it was an extra inconvenience for commuters who walk, but if it's as serious as the responses are saying, it's absolutely something worth bringing to the attention of higher ups.",
                          "author": "SomeBroadYouDontKnow",
                          "created": 1535467858,
                          "upvotes": 7,
                          "replies": {
                            "e50dy3j": {
                              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e50dy3j/",
                              "text": "Honestly, a job shouldn’t require heels either as that becomes an employment law issue. \n\nThis entire situation stinks of an Title IX violation and should be reported to your student affairs office immediately. ",
                              "author": "MarkB1997",
                              "created": 1535506145,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "edsmj9o": {
                              "link": "/r/college/comments/9apkwk/dont_be_that_kid/edsmj9o/",
                              "text": ">if I filed a complaint, would it be taken seriously by someone who didn't take the class themselves and only heard it from someone who did?\n\nI know I am late, but I just want to say that --You do not have to be party to a crime in order to report one--",
                              "author": null,
                              "created": 1547203895,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "e4yxw1p": {
                      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yxw1p/",
                      "text": "Are you in the USA? I'm pretty sure that's a Title IX violation. The professor has no logical basis to dictate that women must wear heels to pass the class.",
                      "author": "usskawaii",
                      "created": 1535458869,
                      "upvotes": 6,
                      "replies": {
                        "e4z5pvz": {
                          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4z5pvz/",
                          "text": "Is it really?! Damn. I had no idea.\n\nCan I still report it if I ended up taking a different class? I heard this when I was picking classes way back in the spring semester and just decided to go with someone else, so I'm afraid that if I do report it that it would just be hearsay because I didn't hear it from that Professor directly and it's, I hate to say it, effectively a rumor.\n\nHonestly, I don't even remember the Professor's name, but I do remember who told me and I have her number, so it'd be pretty easy to ask her to remind me what the Professor's name was-- or, if it wouldn't be a valid complaint coming from me, it would be coming from her because she took the class... though she definitely strikes me as one of those people who doesn't like to make waves (but maybe she had a classmate who doesn't mind).",
                          "author": "SomeBroadYouDontKnow",
                          "created": 1535467029,
                          "upvotes": 3,
                          "replies": {
                            "e4zsx57": {
                              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4zsx57/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1535486839,
                              "upvotes": 3,
                              "replies": {
                                "e509py7": {
                                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e509py7/",
                                  "text": "Okay, that's good to know. I get along fairly well with the head of the department, so maybe I'll just pop my head in tomorrow and say \"I heard this from another student last semester and while I can't personally verify it, it might be something worth taking a closer look at.\" \n\nI'm pretty comfortable being honest with him and I think he's proactive enough to, at minimum, have a talk with the Professor or bring it to the right people (if he's not the person).\n\nThanks for the info, by the way.",
                                  "author": "SomeBroadYouDontKnow",
                                  "created": 1535502023,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "e4yy3os": {
                      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4yy3os/",
                      "text": "I will say that in the professional world you likely get a leg up on every male. I constantly have to wear blazers and every day slacks and a button down, women who show up to meetings are usually just wearing \"regular\" clothes that at least in the summer allow them to breathe a lot easier. Until I can wear nice shorts to work I refuse to feel bad about the wage gap! We need more focus on the pants gap! ",
                      "author": null,
                      "created": 1535459133,
                      "upvotes": 1,
                      "replies": {
                        "e4z4ku9": {
                          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4z4ku9/",
                          "text": "Yeah, I definitely look forward to that. I'll be moving back home to the frozen hell hole (Wisconsin) I crawled out of after graduation 😂 so even if I do walk to work, it won't be nearly as sweaty and I likely won't need a backpack. But I'll most likely have much more flexibility for seasonable wear than my male counterparts.\n\nBut I agree shorts can look quite nice on men. I don't know why it's seen as unprofessional. I used to work at a very small men's designer boutique and in the summer, the guys would wear shorts and they always looked dressed up (ironically, I was always in a hoodie because my \"office\" had the a/c in it) the job didn't require dressing up, but I suppose the men felt that if they were wearing what we sell, they were like walking models for the product... But, anyway, they would wear loafers and white or khaki shorts with usually an Oxford collar, sometimes a sweater. They all looked like they were going to a yacht party or something. Definitely changed my perception of what \"dressed up\" can mean in the men's department.\n\nBut if we're bringing up pants inequality, let's talk pockets 😉 we need pants equality all around!",
                          "author": "SomeBroadYouDontKnow",
                          "created": 1535465978,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "e4xtxho": {
              "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4xtxho/",
              "text": "I had a professor suck up in my group once. When it came time for presentation we got to choose the attire and he was adamant we wear suits. I said I didn’t think we needed to get that dressed up but he was persistent and the other guy didn’t care. Presentation day comes, the other groups are wearing dress shirts and ties, the two guys in my group show up wearing slacks and blazers, and I’m the only one in the class wearing a full suit. If you insist on wearing suits you should know slacks and a blazer isn’t a fucking suit. ",
              "author": "A_Hendo",
              "created": 1535404780,
              "upvotes": 6,
              "replies": {
                "e4y54og": {
                  "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y54og/",
                  "text": "What did they wear under the blazers?  I need to know because otherwise I'm just going to imagine them shirtless underneath.",
                  "author": "alien6",
                  "created": 1535415953,
                  "upvotes": 2,
                  "replies": {
                    "e4y5hba": {
                      "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4y5hba/",
                      "text": "Dress shirts and ties, but you can imagine them shirtless if you want. ",
                      "author": "A_Hendo",
                      "created": 1535416318,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "e4x9lx5": {
          "link": "/r/college/comments/9apkwk/dont_be_that_kid/e4x9lx5/",
          "text": "Hey to be fair, when I used to be that guy, I didn't know it was that annoying. I knew most people didn't care, but I wasn't trying to annoy ",
          "author": "jparevalo27",
          "created": 1535387416,
          "upvotes": 13,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054340
}