{
  "sid": "q3dl5k",
  "link": "/r/college/comments/q3dl5k/i_want_to_drop_out_of_college/",
  "title:": "I want to drop out of college",
  "text": "I‘m a freshman five weeks into college and i can’t motivate myself to do anything. I‘m struggling because I know i should take advantage of all the opportunities my college is offering (its a top three LAC) but i just don’t care about any of my classes. I‘m just getting more and more stressed and depressed especially when i think about that after the 4 years of stress and work i will graduate into a new world that’s just more work and stress. Everyone told me that college is so much better than high school, but it’s the same social and academic stress. I just want to be in my room and never come out again.\n\nThinking about the fact that my future will be me stressing about stuff i dont care about is just making me hopeless. Why even bother?\n\nI just lie around meditating about life trying to get a better perspective on life and college but the more time i waste i just become more and more depressed and stressed about school work. Even if i drop out i wouldn’t know what to do because i just dont care about anything. Can someone give me tips on how to motivate myself and be more productive?",
  "author": "lightgazer_c137",
  "created": 1633626278,
  "updated": 1634083602,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfroi0o": {
      "link": "/r/college/comments/q3dl5k/i_want_to_drop_out_of_college/hfroi0o/",
      "text": "Hook up with college counseling. They will help you decide if it is worth it to grind out the semester or pull out of classes. It sounds like a gap year might be in order for you.\n\nIf you are in the US and are in a top-three liberal arts college, you can expect intense amounts of stress, and I imagine you had to juggle a thousand things to get accepted there to begin with. Those schools set you up for stressful graduate school experiences and stressful careers. Doesn't really have to be like that. Yeah, if you want to make 300k you can expect a life of stress. But there are alternative paths that aren't cutthroat.",
      "author": "bugzapper09",
      "created": 1633636411,
      "upvotes": 1,
      "replies": {}
    },
    "hfr4pzc": {
      "link": "/r/college/comments/q3dl5k/i_want_to_drop_out_of_college/hfr4pzc/",
      "text": "Ask your RA for the student services mental health line. It sounds like you’ll need some help getting out of the spiral. \n\nYou just need to reach out.",
      "author": "MomfromAlderaan",
      "created": 1633628241,
      "upvotes": 0,
      "replies": {}
    }
  }
}