{"sid": "ba54ng", "link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/", "title:": "Weed use among students makes me incompatible", "text": "This is a problem I've been dealing with for a while now. Although weed was common in highschool, it seems like every single person on campus smokes weed or takes some form of THC. While I've smoked weed before, I disassociate really badly and it isn't a good experience. So I don't smoke, and don't plan on it\n\nUnfortunately, weed culture makes up a lot of what people do socially. This leads to me being an outlier, and being really different from most students. I've struggled to find friends or dates where it doesn't end up with them trying to get high. \n\nDoes anyone have any advice for me, or experiences they can share with me so I know I'm not the only one who doesn't smoke? ", "author": null, "created": 1554562756, "retrieved": 1632948189, "over_18": false, "upvotes": 574, "upvote_ratio": 0.93, "comments": {"ekg605o": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekg605o/", "text": "I smoke, but I totally get this. My roommate and I used to be really good friends and she smokes everyday in the apartment. The smell is literally etched in my brain now. It wafts into my room randomly and she is so inconsiderate about it. Next year will be so much better just because my apartment won’t smell so damn bad. It has also changed her entire friend group and the way she acts.\n\nYou will find your people. There are good people that smoke who won’t do it around you and enjoy time with you without it.  And you’ll find those that don’t smoke at all and treat you nicely. Living with this girl I’ve realized her personality has gone to shit because she can’t even walk to class sober without it. She got an internship this summer and STILL won’t stop doing it. She’s about to get drug tested and screwed and then wish she didn’t do it all the time.", "author": "frenchfried5", "created": 1554784951, "upvotes": 1}, "ekbfpr0": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekbfpr0/", "text": "I don't know what college you go to, but I don't imagine everyone does, employers seem to always screen for weed so it seems unlikely everyone is smokes", "author": "Nick_ThePrick_Diaz", "created": 1554649930, "upvotes": 1}, "ekb109r": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekb109r/", "text": "Depends on the crowd you surround yourself with. I use to be friends with lots of smokers and then I moved away to a non legal state and it’s much more enjoyable not being surrounded by constant drug use.  Started fresh with a new location, not having any friends or knowing anybody. Maybe surround yourself with more like minded people who have the same goals as yourself.", "author": null, "created": 1554633611, "upvotes": 1}, "ekb081m": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekb081m/", "text": "It sounds like you have more of a problem with others smoking than they do with you not smoking.\n\nFor a long time I didnt smoke weed at all, and when I would go hang with friends who smoked, they would hand me the weed and I would just pass it to the next person. It was never an issue for me, or any of the other people I know who didn't want to smoke. \n\nSo, is the issue that they wont accept you not smoking, or you not accepting that they smoke when you don't want to?", "author": "He11scythe", "created": 1554632208, "upvotes": 1}, "ekax1pf": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekax1pf/", "text": "Go hang out where people are smoking weed and just have a beer or a coke instead.  I don't think anyone would care!", "author": "fnybny", "created": 1554626209, "upvotes": 1}, "ekapdms": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekapdms/", "text": "I’m pretty much in the same situation as you lol. ", "author": null, "created": 1554614140, "upvotes": 2}, "ekao195": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekao195/", "text": "Unless they're pressuring you into doing it, what's the problem? You go out, eat something and at the end of the day they smoke and you don't. What's the issue here? ", "author": "Freestyled_It", "created": 1554612546, "upvotes": 2}, "ekakl2w": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekakl2w/", "text": "as a stoner at a state school i wish i could relate everyone here just wants to drink all the time", "author": null, "created": 1554608864, "upvotes": 1}, "ekajymq": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekajymq/", "text": "Hey OP, in regards to disassociation, I can relate 100%, and there is nothing wrong with not smoking weed (I’ve stopped and am happier for it). Keep in mind that stress, depression, and anxiety are all things that might trigger that horrible feeling. Remember that your body is just trying to keep you alive — flight or fight mode when it feels the need to. Going to the gym (seriously, you’re body needs to release some energy), eating healthier, and trying to be in better touch with yourself and your happiness are all things that will help you tremendously.\n\nCollege can be incredibly stressful, remember that nothing is worth your physical and mental health, so take care of yourself first.\n\nGood luck.", "author": "cumbomb", "created": 1554608245, "upvotes": 2}, "ekaic1m": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekaic1m/", "text": "Just hang around anyway “more for you” type shit ", "author": "boombotser", "created": 1554606691, "upvotes": 2}, "ekai4p7": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ekai4p7/", "text": "My freshman year most of my friends all smoked or ate edibles. I did this as well until I had an interview for a job and they said that they drug test and all that stuff. So I stopped doing anything like that, i still hung out with them and even went with them when they went to smoke but I would smoke a black & mild, use a vape, or just sit there and chill with them. ", "author": "creed_1", "created": 1554606506, "upvotes": 2}, "eka9sil": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka9sil/", "text": "I was a somewhat a heavy smoker, edible consumer and even vaped. It was nothing but my own downfall academically, socially, spiritually and just damaging overall to me. I had no success or aspirations and the thc only had a temporary escape and my problems just compiled more and more. Few of my friends partake in cannabis on campus and swear by how “productive “ they feel but in actuality there’s more than meets the eye; it’s just a facade they put on to show. Apart from medically using it and only if it needs to be used to treat symptoms or sicknesses; thc isn’t socially acceptable to me at all because I’ve seen both sides to it and neither are good or beneficial. \n\nKeep it up! Don’t fall under pressure. One doesn’t need to be under the influence of substances in order to be happy, content or successful. Where there’s a will; there’s a way. \n\nI’ve never been happier and at peace since I’ve quit cannabis and all other forms of intoxicants.  ", "author": "NotoriousAkber", "created": 1554599357, "upvotes": 4}, "eka8unl": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka8unl/", "text": "Question- does it bother you if other people are high around you? Like a left out feeling?", "author": "otakukyx", "created": 1554598561, "upvotes": 2}, "eka7yx5": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka7yx5/", "text": "i love weed, smoke everyday and for real i dont care if someone else does or doesnt, as long as theya cool person we cool", "author": "Miikeymt", "created": 1554597821, "upvotes": 2}, "eka5g0z": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka5g0z/", "text": "My best friend and roommate is staunchly against smoking or drinking while me and my housemate frequently indulge. We never pressure him to join us and as a result, he loves hanging with us while we get crossed and play videogames, listen to music, or whatever. I think you just need to find a group of friends who either don't smoke also or are totally chill with you hanging with them while they smoke if you're cool with that.", "author": "Brownie_McBrown_Face", "created": 1554595795, "upvotes": 2}, "eka59l6": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka59l6/", "text": "I used to just follow around my friends who’d smoke and never actually hit that damn thing. Worked for me.", "author": "Fallsalot2", "created": 1554595647, "upvotes": 1}, "eka4qmz": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka4qmz/", "text": "I feel this. I'm not against weed morally, but as someone who doesn't smoke it gets annoying. ", "author": "byorderofthe", "created": 1554595190, "upvotes": 2}, "eka1jld": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka1jld/", "text": "Stay to yourself. Read books. Try psychedelics. Think about the world. Exercise and stay healthy. Meditate. Do yoga. Know yourself. It is very difficult but that's how college life is. I'm in the same spot as u. Good luck. ", "author": null, "created": 1554592431, "upvotes": 3}, "eka1idq": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka1idq/", "text": "Ehhhh really it's been easy for me to ignore. I think most smokers respect other people's wishes to not participate a lot more than you think. Its kinda like casual drinking imo. I drink, some of my friends don't. Some of my friends smoke, I don't. We're there to have a good time and watch anime and play video games, bitch about life n such.", "author": "hiemsparadoxa", "created": 1554592400, "upvotes": 1}, "eka0cb9": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/eka0cb9/", "text": "Just say you don't smoke no one will think of you any differently ", "author": "hi_my_name_is_venus", "created": 1554591358, "upvotes": 3}, "ek9zz0t": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9zz0t/", "text": "Choose your career over peer pressure", "author": "bloatedinsect", "created": 1554591037, "upvotes": 2}, "ek9yp3n": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9yp3n/", "text": "The social ones tend to be the smokers and party goers. To be honest, 6 years until college, I have still YET to hang out with anyone I've met there. ", "author": "Patrol720", "created": 1554589944, "upvotes": 2}, "ek9yp14": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9yp14/", "text": "Whenever someone is smoking around me I have to get up and leave, don't want to fail a urinalysis.", "author": "Nullveer", "created": 1554589942, "upvotes": 1}, "ek9x2kn": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9x2kn/", "text": "I don't actively avoid weed, I'm just no longer interested in it. I used to smoke regularly, but now I might smoke once or twice a year at most despite it being fully legal here (Canada).Mostly, weed makes me very anxious so it's not fun. I drink socially. As in, I have 1-3 drinks once in a while. Average of one drink a month.  \n\nI just don't have a problem with other people's use unless I see it as a problem, I guess. They can smoke weed and I just hang out and don't. Nobody cares. I go to bars sober and restaurants or just have one or two drinks. If other people have more, that's cool. I just don't.  \n\nOther than that, seek hobbies that don't involve or centre around intoxicants. Athletics, some sort of craft, book club, etc. Something that helps you get to know yourself and meet more people. ", "author": null, "created": 1554588496, "upvotes": 3}, "ek9wx9q": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9wx9q/", "text": "i dont smoke that shit either but, if it means i gotta do it to have friends, then fuck those friends. but real talk, you're not the one who's different here. just gotta find folks like your own.", "author": "BozScraggs", "created": 1554588363, "upvotes": 1}, "ek9wbno": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9wbno/", "text": "That and drinking. Kinda sucks that people don't want to \"have fun\" without getting intoxicated. I don't care that people drink/smoke, I care that they don't want to spend time with friends without doing one of those.\n\nI highly recommend joining a club sport if possible. Most of the time, it's hard to be good at a sport while high, plus athletes *usually* make healthy choices, thus you'll have fewer people that smoke a lot. I personally find cycling to be a GREAT sport for this. You can socialize on rides, have tonnes of fun going to races and racing, etc.\n\nI feel your pain though. It's just socially acceptable in college life to drink/smoke a lot. Just don't feel pressured to do any of it or hang out with people that pressure you to, that fucking sucks.", "author": "_BearHawk", "created": 1554587836, "upvotes": 3}, "ek9vtlu": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9vtlu/", "text": "I do not smoke anymore but a lot of people around me do however they also don’t pressure me to smoke and we still hang out high or not. ", "author": "sadxtortion", "created": 1554587392, "upvotes": 2}, "ek9v2t9": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9v2t9/", "text": "Are you 21 yet?", "author": "BroncoNuggets", "created": 1554586753, "upvotes": 1}, "ek9uflx": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9uflx/", "text": "i don’t smoke. i did once and hated every part of it, so i have no desire to ever try it again. that hasn’t impacted how many friends i have at all though, and i’m good friends with people all across the spectrum of use (and opinions on use, for that matter). i’ve never felt pressured to smoke and for the most part, people don’t try to smoke around me or while we’re hanging out. if people aren’t interested in doing stuff with you because you don’t smoke, then yeah don’t hang out with those people but also? if it’s an activity they enjoy every now and then and you immediately don’t want to be friends with them because of that, that’s kind of an asshole move. the majority of people who smoke have other personality traits and interests that it’s fucked up to ignore just because they smoke sometimes. \n\ni will say i’ve never actually gotten along with addicts, but that’s a separate issue. ", "author": "pinerowan", "created": 1554586202, "upvotes": 4}, "ek9u4bv": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9u4bv/", "text": "So my understanding of this is that you just haven’t had an experience that makes you enjoy smoking, and that’s okay. \n\nNo one should force you, I smoke daily and I hang with people who don’t smoke daily. They all know and are aware of my habits but I wouldn’t dare impose or force them. \n\nMajority of the stuff you’ll find on a college campus is bullshit that no one knows what strain is what. Some give me headaches, some give me anxiety, some make me so mellow and hungry. You probably think it’s a more important social factor than it really is :) and if people make you feel weird about, fuck em ", "author": "LandlockedGum", "created": 1554585929, "upvotes": 1}, "ek9sfox": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9sfox/", "text": "I don’t use or get high myself for many reasons. \n\nI’ve never really met anyone that would get offended when I said I didn’t want to because I wasn’t trying to take away their high. They’re cool about it and if you’re friends with people that do smoke they’ll be cool about it around you. A few friends of mine know I’m not keen on it and don’t really want to be around them when they do just on personal preference. They get high at other times and never make me feel like I’m hindering their good time or that they don’t want to be around me because I don’t get high. It’s really about finding a good group of people that are nice and chill and don’t make you feel uncomfortable. I went through a few friends before I found a good group so just get out there and don’t be afraid to step away if they aren’t the kind of person you want around yourself. ", "author": "dlm16b", "created": 1554584474, "upvotes": 2}, "ek9sb5y": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9sb5y/", "text": "My bf smokes nightly and my friends usually do whenever we get together. But I don’t because I am guaranteed to have a panic attack and that’s not fun for anyone. My bf was there when I had my first and worst panic attack from it, where I thought I was literally going crazy and thought I was going to actually die if I closed my eyes. That was probably the worst experience of my life. So he’s super understanding. My friends don’t really care either. I miss doing it because it used to be fun, but it’s whatever. You definitely shouldn’t feel like an outcast because of it", "author": "cattinthehatt", "created": 1554584364, "upvotes": 5}, "ek9ri0c": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9ri0c/", "text": "We have a couple of people in our circle that don’t smoke and they seem to get along fine ", "author": "thecomeric", "created": 1554583663, "upvotes": 2}, "ek9qutb": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9qutb/", "text": "You’re not crazy: not smoking weed can make it hard to find friends and dating prospects. I’ve been clean for almost 7 years (basically from the time weed started becoming more legalized, go figure). I feel your pain. \n\nFirst of all: be upfront about the fact that you don’t smoke weed AND that you don’t like being around it. It can feel awkward as hell, but it cuts down on you getting close to people who only get high, or don’t want to hang out with people who don’t get high. All of my dating profiles say it in the first few sentences. \n\nCheck out the clubs at your college, look up local meetups (like meetup.com, Facebook events, etc) geared towards sober fun, bring a friend who also doesn’t smoke along to activities that make it easy for you to be outgoing, basically start getting more creative with the way you meet people. The internet is your friend, there are lots of apps and websites geared towards people getting together for fun these days. Don’t despair. We’re out there, and some of us are even in enrolled in school lol. ", "author": "Drealjas", "created": 1554583122, "upvotes": 3}, "ek9q1xq": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9q1xq/", "text": "Its easier to meet people that smoke because they are more social. Theres a lot of people that dont, but they are also generally harder to encounter because they are less social.", "author": "MemesEngineer", "created": 1554582438, "upvotes": 4}, "ek9p7is": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9p7is/", "text": "Yeah I know how you feel. I don’t care for smoking OR drinking (19f). I just created a Tinder account with that in my bio and still had 99+ likes... I don’t think all of them read it lol\n\nI don’t care if my friends do, and most of them don’t, but I find it unattractive in a partner.", "author": "Shamm-Wow", "created": 1554581691, "upvotes": 2}, "ek9ohq9": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9ohq9/", "text": "There’s plenty of people that don’t smoke.  More than not.  Keep looking and don’t be so judgey of the people who do it. ", "author": "NiceGuyAbe", "created": 1554581065, "upvotes": 2}, "ek9n1og": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9n1og/", "text": "I don't smoke marijuana, don't drink or do drugs, and don't smoke cigarettes. I'm always sober. The people I live with don't go to school, don't have jobs or responsibilities, so they smoke all the time. It reeks near my room. ", "author": null, "created": 1554579822, "upvotes": 0}, "ek9lmhe": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9lmhe/", "text": "join chess club, they probably dont smoke weed", "author": "monkeyburrito411", "created": 1554578603, "upvotes": 2}, "ek9l28o": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9l28o/", "text": "This is kind of backwards from my experience. Ive always seen it as everyone drinks, but smoking is much less common. Maybe it's just a regional thing. ", "author": "andrew_c_r", "created": 1554578129, "upvotes": 2}, "ek9kmbx": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9kmbx/", "text": "This is absurd. No one is forcing you to smoke. I don't smoke either while the vast majority of my friends do. We still have a great time hanging and shooting the shit. You're allowed to say no, in fact people will respect you for it (and appreciate that you're not mooching their bud)", "author": "RedditForTheBetter", "created": 1554577748, "upvotes": 2}, "ek9kb7q": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9kb7q/", "text": "THIS HAPPENS TO ME TOOOOO", "author": "billysus", "created": 1554577486, "upvotes": 4}, "ek9k2ll": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9k2ll/", "text": "Just start going heavy with the booze when they smoke", "author": "sethb44", "created": 1554577290, "upvotes": 1}, "ek9jvvo": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9jvvo/", "text": "[deleted]", "author": null, "created": 1554577149, "upvotes": 9}, "ek9jcu8": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9jcu8/", "text": "I've been sober for 20 years and can assure you that the vast majority of people don't use drugs. However your current social landscape consists of a higher percentage of people who do. You're in the major of the world but the minority of your current social diaspora. It will be fine. ", "author": "ikilledtupac", "created": 1554576732, "upvotes": 7}, "ek9ixwe": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9ixwe/", "text": "I don’t smoke and it does not affect me that others do. I still hangout with people that smoke and still have a great time... I just usually have some wine or something instead. I’ve had plenty of joints and pipes passed to me and I just pass it along, usually no one mentions it and if they do, I just say it makes me paranoid and the story ends there.  From my experience, no one cares if you don’t smoke as long as you don’t act weird about it. Just be yourself, no one really cares and if they do, it’s immature of them. ", "author": "zteststatistic_girl", "created": 1554576413, "upvotes": 5}, "ek9ih0y": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9ih0y/", "text": "If i ever smoke it’s only one hit with my boyfriend. Weed makes me anxious (like call 911 anxious...which i seriously did one time) but the cartridges my boyfriend has are ok for me and i feel comfortable if i get anxious near him. I actually really don’t think smoking copious amounts of weed daily should be normalized (unless it’s for a chronic disease). \n\nI actually take CBD oil and it is literally like taking a low dose of lorazepam. Helps my anxiety a lot ", "author": "jewlious_seizure", "created": 1554576063, "upvotes": 2}, "ek9i5j0": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9i5j0/", "text": "Most stoners don't really care if everyone is high while they're all hanging out, ffs they'll probably forget if you just joke around with them for awhile.", "author": "M3ninist", "created": 1554575815, "upvotes": 3}, "ek9i35n": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9i35n/", "text": "It actually really sucks how pervasive it is. Most of my friends from college/high school don't smoke so we just hang out and play board games or whatever. I do however have a good friend who smokes a lot and I hang out with him and his friend group. They always want to go smoke at least once while we're hanging out, and 2-3 times we've just ended up with like 10 people crammed into one guy's bedroom while they pass the bong around. It sucks cause I'm just standing there while they're all talking about getting high, the whole thing is kinda repulsive to me. Sometimes I just take the L and leave, straight up, cause it's not really fun anymore. \n\nOn a personal basis, I think it's fine to just communicate what you want to do or open up that you don't like it. In a bigger group you don't really have a say so you just have to deal with it. I think if you search for athletic people/high achieving students they'll probably be less into it (but I don't know the stats so it could just be the opposite). For me personally I don't wanna smoke weed because it's just self-destructive after putting so much effort into fitness, but I do drink sometimes and I'm open to edibles. Those are good alternatives, but doesn't really solve the root issue that you feel bored when people just wanna smoke weed. \n\nProbably the best course of action is to join a club or something where they have a plan to do something active/not involving weed by nature. Like a hiking club, or a sports team, or just something that does organized and planned activities. The people in those groups will likely be weed smokers but they probably won't be smoking at those events, at the very least. ", "author": "LiarVonCakely", "created": 1554575764, "upvotes": 13}, "ek9hyyk": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9hyyk/", "text": "I also don't like weed, since it makes me dizzy, but I'll still hang out with all of my friends while they smoke.", "author": "Quantum_Aurora", "created": 1554575678, "upvotes": 1}, "ek9hr0f": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9hr0f/", "text": "In my experience, people who smoke won’t pressure you to smoke and have no problem hanging with people who don’t want to smoke. In the beginning, you might feel out of place, but just hang in there, you’ll find people you can bond with outside of weed and have a good time. And how others have mentioned, you can always hangout with people who are high without yourself partaking in it :) ", "author": "stingray14", "created": 1554575514, "upvotes": 2}, "ek9hl2v": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9hl2v/", "text": "I don’t smoke or drink, but I’m pretty good friends with many people who do (and many people who don’t.) My secret is that I only disapprove of ME smoking or drinking. Everyone else can do what they want.", "author": "TheManicMonocle", "created": 1554575389, "upvotes": 1}, "ek9gab2": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9gab2/", "text": "I promise you not everyone smokes. You will find a group of people that don't. And if you have friends that do, they should respect your boundaries and not smoke around you. The smell of weed makes me ill and I stay away from smoke in general due to health problems. I have never had issue telling people straight up I can't handle weed and to please not smoke around me and they've never been dicks about it.", "author": "bubblegumpandabear", "created": 1554574404, "upvotes": 1}, "ek9g6w2": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9g6w2/", "text": "Now change \"weed\" for \"alcohol\" and try again. College is a shit show one way or another. If they're not drunk and killing/raping each other, then they are high and eating a lot of chips. Maybe you should rethink \"weed culture\" and realize its waaaaay better than what's been going on on campuses with alcohol for decades.", "author": "QCisCake", "created": 1554574335, "upvotes": -7}, "ek9ftkn": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9ftkn/", "text": "There is definitely a culture around smoking weed. So many social events can lead to it or maybe it’s just friends trying to pressure you. But I can guarantee you that you’ll find people just like you. People who not only don’t smoke weed but who also share similar interests. It may feel impossible but they’re out there. ", "author": "zman2pointo", "created": 1554574065, "upvotes": 2}, "ek9fo7v": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9fo7v/", "text": "I am leaving a career in law enforcement and going back to school to be an engineer. I know the feeling about disassociating from the pot culture. I don't have a problem, per se, with the legal use of marijuana... I just don't like the smell or smoke. I also loathe the intellectual complex a lot of weed enthusiasts seem to have. Everyone is a fucking pharmacist.\n\nAnyway, I wouldn't feel too bad about it. Not everyone smokes. If it bothers you that much to be around people that smoke as it does me, find people that don't smoke. There are majors that attract smokers, and there are majors that attract the opposite. Find a CJ or Law major. Medical might be a good one, but maybe not! \n\nNo matter what you do you will have to accept that it is not going away.\n\nEdit: I honestly don't see the reason why I am being down voted other than I struck a nerve with the pharmacist bit. To those of you that were offended by that... Life is not going to be easy for you.", "author": null, "created": 1554573955, "upvotes": 5}, "ek9fcw3": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9fcw3/", "text": "I can't smoke because of my asthma, but I know people on my campus do because the dorm hallways will sometimes smell like weed.", "author": "SmileyDev", "created": 1554573729, "upvotes": 1}, "ek9euqq": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9euqq/", "text": "I don’t know what your financial and school situation is, but I’ve been more successful living off campus with roommates who are friends. \n\nYou can control what happens around you a lot easier. I hope this helps. ", "author": "almost_BurtMacklin", "created": 1554573368, "upvotes": 1}, "ek9enjf": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9enjf/", "text": "Join a club lmao ", "author": "4TOOMANYTABS", "created": 1554573224, "upvotes": 1}, "ek9emm2": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9emm2/", "text": "I smoke and personally stoners are super welcoming and really don’t care if you smoke or not, other than the fact that all they do is talk about weed. So if your fine chilling w people who talk about smoking a lot then it’s not a problem that you don’t. Nobody is going to be upset you don’t smoke, your just saving them weed lol", "author": "treclays", "created": 1554573206, "upvotes": 3}, "ek9eh12": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9eh12/", "text": "I don’t smoke, I don’t drink. Never have never will. As long as you stay true to yourself with your values, people with similar values will find you. ", "author": "UnknownAccountant", "created": 1554573096, "upvotes": 1}, "ek9dyge": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9dyge/", "text": "I’m the same way but with drinking instead. My body’s allergic to alcohol so I get really flustered after just a few sips. It sucks when friends ask if I wanna drink with them and I gotta turn them down. But so far I’ve never been somewhere where people leave me out just because I don’t want to drink. My advice: people who peer pressure you into doing something you don’t want to do are not your friends. They are not putting your preferences first. ", "author": "haidamn", "created": 1554572725, "upvotes": 11}, "ek9drew": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9drew/", "text": "Find clubs that focus on something you're interested in. Even if they also smoke weed, they'll probably spend a fair amount of time on the activity. ", "author": "DreadPiratesRobert", "created": 1554572587, "upvotes": 1}, "ek9dgho": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9dgho/", "text": "Trust me, not everyone smokes. Join some clubs, I'm sure you'll find students who don't smoke. ", "author": "anxiouscamper", "created": 1554572377, "upvotes": 117}, "ek9df51": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9df51/", "text": "[deleted]", "author": null, "created": 1554572351, "upvotes": -1}, "ek9cp5p": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9cp5p/", "text": "Where were you all when I felt alone because everyone I knew smoked? No I've tried a bit and I don't care for it any more. I'd never do it while Im in school or dealing with a lot of important business. I'm not saying im a smoker, but I can't change what people are addicted to. ", "author": "nirv-ash", "created": 1554571836, "upvotes": 1}, "ek9bty4": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9bty4/", "text": "Every college campus you go to will have plenty of people who smoke, plenty of people who don't smoke, and plenty of people who smoke but don't care if everyone around them does. You just have to find the right people; there's such a variety you'll settle into finding friends who you'll enjoy hanging out with and will accept that you don't smoke.", "author": null, "created": 1554571230, "upvotes": 54}, "ek9b2la": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9b2la/", "text": "Almost everyone I’m around smokes. I did it a lot in high school but I told myself to forget what people think if I say no to it in college", "author": "KnowThat205", "created": 1554570709, "upvotes": 1}, "ek9b2hm": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9b2hm/", "text": "Im sorry you feel this way and want you to know that people who smoke (myself included) don't judge you for not smoking! I definitely don't speak for all smokers but I always respect people's decisions on the matter. On the flip side, I sometimes find it hard to make friends with people who are non-smokers because I often feel like they see smoking as a part of my personality, rather than an activity I like doing. If people who smoke are isolating or not being friendly towards you just because you don't smoke, they're probably not people you want to be friends with anyway. ", "author": "chunsterr", "created": 1554570707, "upvotes": 22}, "ek9avwg": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek9avwg/", "text": "i’m sure not everyone smokes on your campus! You just need to make friends with the right people. ", "author": "EdhelGaladhrim", "created": 1554570580, "upvotes": 12}, "ek99xfn": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek99xfn/", "text": "Hard life lesson the smokers won't enjoy here:\n\nPot smells fucking terrible. It gets in your clothes and everywhere in your house.\n\nWhen you try getting a job after college, most employers will make you take a piss test.  If you pass and then go back to using it, they send you for another.\n\nThere are far too many negatives associated to it.  You ever notice that people in high earning jobs tend not to smoke pot?  And people in the service industry use it constantly? ", "author": "Inactive_Account", "created": 1554569907, "upvotes": 5}, "ek99h77": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek99h77/", "text": "This happened to me last year but with cigarettes ", "author": "sorgon1", "created": 1554569599, "upvotes": 1}, "ek993zo": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek993zo/", "text": "You can’t change what other people do, but you can definitely stand up for what you believe in. Since you’re in college, I’m assuming you’re an adult, like most of your fellow students. You don’t owe anyone an explanation and if people don’t like your personal preferences- too bad. If you don’t like marijuana, that’s totally fine. ", "author": "dopaminesnake", "created": 1554569346, "upvotes": 22}, "ek990so": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek990so/", "text": "I have the same issue with dissociating if I smoke. The only time I do is if I’m with my boyfriend, because if I start to dissociate he’s there to calm me down. I also feel that disconnect and I wish I could relate with other people at my school. It seems like all anyone ever wants to do is smoke and hang out, and I always feel weird telling people that I don’t. ", "author": "katmoonstone", "created": 1554569283, "upvotes": 6}, "ek98uio": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek98uio/", "text": "what school? is it legal in that state?", "author": "rjpusheddawkins", "created": 1554569160, "upvotes": 1}, "ek94h5n": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek94h5n/", "text": "I don’t smoke either but majority of my friends do including my 3 roommates. Not everyone in college smokes, it just so happens that everyone you’ve met smokes. When I was in a dorm, everyone I met there and became friends with smoked. They never pressured me into smoking and when they asked I would always just say it wasn’t my thing cause it honestly isn’t. \n\nI honestly hangout with my roommates when they’re high and I’m not. We all just sit around, eat, and hangout. And believe me, there’s ALWAYS people out there who don’t smoke. It just happens to be that the more social people smoke. ", "author": "xxmarshiexx", "created": 1554565920, "upvotes": 434}, "ek944hh": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek944hh/", "text": "meanwhile I feel like an outcast for smoking so much 👽👽", "author": "A_Wizard1717", "created": 1554565659, "upvotes": 13}, "ek92upv": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek92upv/", "text": "You're not alone: I also feel like an outcast compared to all my peers because I don't smoke.", "author": "ReachandCrackTheSky", "created": 1554564685, "upvotes": 15}, "ek91vpq": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek91vpq/", "text": "Hi! I don’t smoke at school (I have shit I need to do and it used to get in the way) so I understand the idea that everyone does smoke. I actually have a friend who has the same type of ‘symptoms’ as you. She doesn’t like smoking because it gives her bad anxiety and a bunch of other stuff. I don’t have much advice for you, but I can say that there are people who are in the same boat as you! You’re not alone in feeling like this at all. ", "author": "emsadsm", "created": 1554563892, "upvotes": 82}, "ek90qkn": {"link": "/r/college/comments/ba54ng/weed_use_among_students_makes_me_incompatible/ek90qkn/", "text": "I’m on the same boat and my dorm REEKS 24/7 because it seems everyone else does it", "author": null, "created": 1554562934, "upvotes": 86}}}