{
  "sid": "qw7gvf",
  "link": "/r/college/comments/qw7gvf/whats_the_craziest_thing_academically_youve/",
  "title:": "What's the craziest thing, academically, you've pulled in college?",
  "text": "How did you defy the odds? How did you manage to pull your GPA out of the gutter the Spring before graduation? How did you get a 20 page essay done the night before? Craziest all nighters? \n\nI need to get a 95 or above on my Calculus 3 final to pass the class or I'm fucked beyond belief, but the good news is I have a month to study. I feel like I need to hear other damn near miracles people pulled in college to get the confidence to do this fucker. \n\nWhat did you do to defy the odds?",
  "author": "Figurative_Retard",
  "created": 1637178865,
  "updated": 1637180959,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hl13r67": {
      "link": "/r/college/comments/qw7gvf/whats_the_craziest_thing_academically_youve/hl13r67/",
      "text": "I have 24 hours to write a 3600 word assignment worth 60% of my grade. Fml.",
      "author": "withmeth",
      "created": 1637179952,
      "upvotes": 1,
      "replies": {}
    },
    "hl1670k": {
      "link": "/r/college/comments/qw7gvf/whats_the_craziest_thing_academically_youve/hl1670k/",
      "text": "I wrote my capstone paper in 40 hours AFTER the deadline (I procrastinated so hard I waited until after the deadline to request/receive a 48 hour extension to \"make some further revisions\" but really I hadn't written a single word yet). I mass meal prepped in like 2 hours and then went to the library (my laptop had died that week) and sat at a desktop to write the entire thing in 40 hours. I got an A lmao. \n\n&#x200B;\n\nI also turned a semester of all Bs into all As by asking the profs if I could get bumped up and they all said yes. All 4. I was so scared by my luck I was sure something bad would happen soon.",
      "author": "yuzucchan",
      "created": 1637180922,
      "upvotes": 1,
      "replies": {}
    }
  }
}