{
  "sid": "q7tx2t",
  "link": "/r/college/comments/q7tx2t/want_to_switch_majors_from_computer_science_but/",
  "title:": "Want to switch majors from Computer Science but parent is stuck on AI absolutely replacing a lot of the jobs in 10+ years. What should I do?",
  "text": "I'm in my first quarter of college majoring in Computer Science, in which I came in with credits from Dual Enrollment I had in high school and I've already taken 3 CS courses. I'm currently in my 4th class of CS and  looking at in right now, I'm not so invested in Computer Science being something I want to do for the rest of my life.\n\nI can admit with the fact that I'm only 18, I'm very (very) dumb, I don't know what I want, and don't know much about the \"real world\". Going to college was really the only option for me presented by my parents (going to College in general is a blessing anyway), as if I wanted to delay and get a job, explore what I want, and \"get some real world experience\", I'd have to go ahead and find an apartment cause I wasn't going to be living at the house according to them (Which is valid).\n\nIn High-School doing Dual Enrollment, my father essentially only gave me the options of doing STEM majors, which is valid considering how fast AI is rapidly increasing everyday. Though as I've gone through and I've experienced the classes, I just can't see myself doing Computer Science for the rest of my life. Now I know STEM is more than computer science, but I don't know if I'm set on any other STEM majors either if I'm being completely honest. While I still plan to try to explore what I want and won't switch my major completely till I find \"my calling in life\" (lol), my dad says I'm going to be making a huge mistake if I do anything other than STEM and I'll realize that in 10+ years \"when AI has completely taken over most jobs\". My dad's no slouch though, as he has 4 degrees and is currently getting a PhD in Law at the University of Washington as we speak, so my dad is very knowledgeable. I guess you could say I'm a hard-headed 18 year old since I'm getting advice from someone like my dad, yet am asking strangers on Reddit questions about what I should do with my life. (Feel free to tell me that I'm an idiot in the comments, gotta accept reality, am I right?)\n\nI'm still technically in my first year of college, so I have some time to figure stuff out without falling behind. Should I try to stick it out in a major that I'm not completely interested in (and STEM in general) or take other classes and explore what I truly want to do?\n\n&#x200B;\n\nTLDR: Should I stay with my STEM major (CS) because of rapidly advancing A.I or try to explore other majors to see what I want to actually do in life?",
  "author": "___koren___",
  "created": 1634192464,
  "updated": 1634252176,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgm24hv": {
      "link": "/r/college/comments/q7tx2t/want_to_switch_majors_from_computer_science_but/hgm24hv/",
      "text": "Computer Science is a field of study, NOT a career or vocation.  \n\nComputer Science is the study of, and understanding of how software works, and how software is supposed to be created.  \n\nUnderstanding how software works does not mean you have to help create or maintain software.  \n\nA CS degree can empower you to work with a huge array of different actual career pathways, many of which will not require you to ever write code again.  \n\nI think you would do well to seek out an internship so you can see how CS is used in a business environment.  \nThat should help you understand the career options, and assist with the decision of changing majors or not.  \n\n\n-----  \n\nThe hot ticket right now in the technology workforce is automation.  \n\nAnything that can be automated, is being queued up to be automated.  \n\nIf you develop a robust, intelligent automation mechanism, it is dramatically more accurate and reliable than human interaction.  \n\n*(Just try not to forget that the opposite is also true: A shitty automation process can be dramatically worse than a human-powered one.)*  \n\nThe next generation of automation is all AI-powered, where the software practically writes itself new routines to improve a process.  \n\nThis, without question, will be disruptive to the status-quo of the current workplace.\n\n\nThis technology adoption is in the early stages of execution right now, today, as we type these comments.  \nThe bright idea already happened, and the early-adopters are creating the tools to do these things right now.  \n\nIn 3 to 5 years, those tools will be mature enough to build automation-conversion industries around.  \nThere are already automation businesses popping up.  \n\nIn 10 years the automation conversion industry will be mature and in steady-growth.  \n\nEvery time a new business process is automated, every business process that resembles that first one is quick and easy to replace.  \n\nIf you don't want to write the code to make all of this happen, that's totally cool.  \nI find writing code to be mind-numbingly painful too.  \n\nAdd a business administration minor, and now you can be the liaison between the business units and the people who create code for a living because you can speak both languages (nerd & suit).  \n\nAdd a Cybersecurity minor, or focus, and now you can review all this code that is being written to ensure it is compliant with security standards.  \n\nOr build a specialty around the automation of secure communications or data exchanges.  \n\nThe Cybersecurity field is in extensive growth mode, and a CS degree is an excellent foundation for that kind of work.  \n\nOr add some specialty in embedded systems and focus on programming robots to replace people on assembly lines.  \n\n-----  \n\nAnyway...  \n\nI encourage you to seek out an internship or Co-Op job so you can see how all this stuff is being used in the world to help you make an informed decision about your academic future.",
      "author": "VA_Network_Nerd",
      "created": 1634220354,
      "upvotes": 3,
      "replies": {}
    },
    "hglqtho": {
      "link": "/r/college/comments/q7tx2t/want_to_switch_majors_from_computer_science_but/hglqtho/",
      "text": "While automation seems to be going great places currently, it is *highly doubtful* that within our lifetimes, we will see something that's both sophisticated enough to do most skilled labor and affordable enough to implement on a large scale. Having some tech skills is going to benefit you in any field, but I don't think you'd have to work *in tech* to find a job if that's something you don't want to do. You mentioned your dad getting a degree that isn't a STEM degree, so I have to question why he'd take the time, effort and lost profit (since those hours could be spent working) if he *truly believes* that STEM is the only way to stay safe from AI.\n\n\n\nThat being said, instead of exploring other majors, it could be more productive to explore your end goal. What kind of career would you want? What sort of work could you enjoy, what sort of environment, how much variation in tasks, etc? It makes sense that you were thinking of major, but your end goal is to find a job, and while you can do that after just choosing a major that you like, it is going to be a million times easier for you to build your resume in college if you know the kinds of jobs you are shooting for and what you need to get those jobs. \n\n\nHaving said that, I disagree with the other commenter that money should be everything and making that decision. Money is important, but when you spend *so much* of your life working, you want something that won't burn you out or make you miserable. If you're already not feeling CS at 18, where are you gonna be in 10 years, ya know? You can find a decent career that isn't CS.",
      "author": "torgoboi",
      "created": 1634214770,
      "upvotes": 2,
      "replies": {}
    },
    "hgl1d6x": {
      "link": "/r/college/comments/q7tx2t/want_to_switch_majors_from_computer_science_but/hgl1d6x/",
      "text": "Yeah I was in the same position. I was doing psychology as my major, but I found it boring as all hell, but my parents were insistent that I stay in it and go for my PhD and get a job as a high paying occupational therapist. But I can’t see myself doing that everyday honestly, I found interest in business. My parents weren’t exactly thrilled as you can imagine lmao and they demanded that I stay in psych. But at the end of the day it’s my life, I’m gonna be doing this for the rest of my life, so if you can’t see yourself coding everyday of your life, do what interests you, or at least dual major or minor in it and give it a try. I sat down and explained to them that it’s my life, this literally decides the course of my life and I understand you guys want the best for me but I can’t see myself happy in this field, mentally ill are too draining on me, I’ve had my experience and I couldn’t take it, it hurt too much, but I love business, I love how the numbers just work and they don’t lie, picking different investment strategies to multiply your money. And that made then understand. Your dad is 100% right, the computer industry is booming and will continue to massively boom, but if you aren’t happy then you aren’t happy. Doctors are always gonna be booming, but not everyone wants or has what it takes to be one. You’re not stupid for wanting to explore, if you don’t wanna take that leap of faith yet, find out about dual majors and minors, or just take some electives.\nBest of luck!",
      "author": "Kenkxb",
      "created": 1634194387,
      "upvotes": 1,
      "replies": {}
    },
    "hgljkqz": {
      "link": "/r/college/comments/q7tx2t/want_to_switch_majors_from_computer_science_but/hgljkqz/",
      "text": "I'm a non traditional student also studying CS, take it from me and go the STEM route. They are high paying and in demand. If this pandemic has taught you anything is that were all expandable unless we have skills.\n\nThe real world experience you can get after graduation and you will but you'll be miserable with a low paying job trying to stay afloat. Also, the cost of living keeps increasing and anything less than 50k is not going to give you any independence. CS isn't just AI, it branches out to so many different fields, so make sure to explore them before making the final decision. \n\nI was in your position 18 years ago and dropped out. Worked bullshit jobs one after another. I've regretted not finishing school earlier when I was younger because now I'm paying for it. I'm in Idaho and there's a massive housing shortage and on top of people from Washington, Oregon and California are moving here in droves and paying cash which essentially pushes out the locals since we don't have those high paying jobs that can afford a house for 800k that used to be 300k. I'm being pushed out of my own city and state and it fucking sucks. This degree is my last shot to stay here otherwise I'll have to move to a different state in a more affordable city. Hell, even rent went from 1200 a month for a 2 bedroom to 2300 a month.\n\nHope this gives you a different perspective.",
      "author": "ShadowIG",
      "created": 1634210201,
      "upvotes": 0,
      "replies": {}
    }
  }
}