{"sid": "eemam0", "link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/", "title:": "Can I be independent at a college only 45 minutes from home?", "text": "A university 45 minutes from my hometown gave me a great scholarship and has a lot of the things I want in a school but I'm worried about how much independence I can have at a place that is so close to home/my family.", "author": "IanVM36", "created": 1577116403, "retrieved": 1632802747, "over_18": false, "upvotes": 624, "upvote_ratio": 0.98, "comments": {"fbzltup": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbzltup/", "text": "Absolutely! College is what you make of it. I know people who commute to school and are pretty self-sufficient, but I also know people who went away to school and still depend on their parents for a lot of things. It really depends on you and what you do while you're there.", "author": "CupcakesWolf", "created": 1577251090, "upvotes": 1}, "fbxjmvs": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbxjmvs/", "text": "I think you are overthinking it. How much independence you have is only up to YOU. I am a commuter and I feel perfectly independent... even when I am living with my parents..it is up to you how much you want to rely on your parents.", "author": "marissp", "created": 1577190643, "upvotes": 1}, "fbxixjb": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbxixjb/", "text": "It is okay, I think you should be happy to live close to your family, as they can support you during hard times.", "author": "imKyleCook", "created": 1577189736, "upvotes": 1}, "fbxit9p": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbxit9p/", "text": "Yes! moving out and going to college will inevitably bring a strong sense of independence no matter how little a distance away from home it is. I’m currently going to college only about 25 minutes away from my single father’s home and I have learned so much about myself and “how to adult” just by moving out of his house. Being so close to my hometown has been pretty convenient also, I have all my regular doctors offices and such nearby and am familiar with the area so most of my college friends come to me for directions/ info about the city. In case of an emergency, like a bad illness or a broken down car, it can be helpful and comforting to have your family not hours and hours away. That being said, my dad is very respectful of my space and boundaries and would never just show up unannounced or anything of the sort, so I can see how under certain circumstances living too close to home could hinder someone’s independence. all in all though I think as long as you’re moving out then you will gain an immense amount of independence no matter how far you go. good luck!! (And don’t skip class :)", "author": "Hamletsopheilia", "created": 1577189577, "upvotes": 1}, "fbxdkz5": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbxdkz5/", "text": "You can be independent while living at home if everyone respects boundaries.", "author": "mulemary", "created": 1577181720, "upvotes": 1}, "fbxaf8v": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbxaf8v/", "text": "My university is about an hour away from home. If anything it's an awesome perk because if I ever need my parents or just want to visit home it isn't much of an inconvenience. At the same time I spend most of my weekends at college. There are simply too many responsibilities at college for you to not be able to come up with a reason to be there. How independent you are is completely on you. Your parents will understand if you need to stay at school to study, work on a project, or if other extracirricular involvements require it. TLDR yes you can be independent.", "author": "Tanner69046", "created": 1577176926, "upvotes": 1}, "fbx9p74": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx9p74/", "text": "I live less than 45 min away from my college but since I dorm there, I have all the independence I want. It is up to you if you contact your parents or visit home often. More the most part, I think you will realize you have more independence than you ever dream of.", "author": "justin_v12", "created": 1577175861, "upvotes": 1}, "fbx92n6": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx92n6/", "text": "I'm at a university roughly 45 min (car) / 1h (train) away from my home town. Keep in mind that I don't own (and couldn't afford) a car, so I do have an excuse not to come home.\nIn my first year, especially the first semester, I came home only sporadically, because there was nothing to do back home and all my uni friends were here, while most of my friends from high school moved away anyway (some even enrolling at the same university as me).\nThese days though, I'm home most weekends, because I enjoy the comfort and I just like to spend time with my dad whenever I can. For most people it's probably the opposite though: they spend a lot of time back home during their first year at uni and it gets increasingly less.\n\nIn the end, a lot it depends on your family/parents and how close they want to keep you. But those 45 minutes definitely put a buffer between you and if you live on or near campus, you can choose to be quite independent from them.", "author": "joko_mojo", "created": 1577174973, "upvotes": 1}, "fbx7acm": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx7acm/", "text": "i’m independent at college 20 minutes from home.", "author": "nicksc82", "created": 1577172514, "upvotes": 1}, "fbx6pg5": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx6pg5/", "text": "Definitely. My university is only 45 minutes away from me as well and I honestly feel so independent, and especially being close to your family is important because in college they will help you through tough times. Not being far does have pros and cons, you may feel like you never really “left back to home” during breaks since you’re so close to university, and if you have a job in the town of your university and if it’s a college town it’s honestly depressing to see how dead it is and all your friends are gone. I honestly wished i did go to college farther some days but then having your home close to college is not the worst.", "author": "billabong295", "created": 1577171747, "upvotes": 1}, "fbx42ec": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx42ec/", "text": "It truly depends on you and your parents. My college is only 30 mins from home and I'd say my parents let me be pretty independent, although they still pay for college. If you're a legal adult, they will probably let you do whatever you want to as long as it's reasonable.", "author": "LeatherandLace08", "created": 1577168505, "upvotes": 1}, "fbx2ee2": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx2ee2/", "text": "Yes, just don't go home on weekends. That's when \"college\" happens", "author": "blackion", "created": 1577166660, "upvotes": 1}, "fbx228y": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx228y/", "text": "From my own experience as a now senior in college, people that remain close (mostly referring to staying in this town for university) do not change as individuals. For example, one ex teammate of mine stayed in our hometown for college, but because he has now been around the same things and people since middleschool, he has not evolved as a person, which you should, during his transition from high school to college whereas I and many friends of mine have changed in many ways for the better. \n  \nI would hope you are an outlier, but truly, I believe that it is always in your best interest to spread those wings and fly.", "author": "TheCrunchback", "created": 1577166312, "upvotes": 1}, "fbx21x6": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx21x6/", "text": "Yes. I dormed at a college that was about 45 minutes away from home. Best decision I ever made", "author": "_heisenberg__", "created": 1577166302, "upvotes": 1}, "fbx1tkn": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbx1tkn/", "text": "Yeah of course, just because you are \"Away\" doesn't mean you need to go home all the time, treat it as if you were a state or couple states away, i went to a college 35 minutes away from home, but i only went home once in a while", "author": "Carloverguy20", "created": 1577166065, "upvotes": 1}, "fbwyfo3": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwyfo3/", "text": "I went to a college 1 hr away from my hometown. Since the moment I started I only come home for holidays and break, and even now senior year only visit briefly as I've fully moved out. It is totally possible, but will depend on how much your parents naturally allow you to be more independent + how you handle creating boundaries that allow you to make yourself more independent. When you're closer, pushy parents can be more of an issue but I've found it is totally possible.", "author": "JJThatTallGuy", "created": 1577162911, "upvotes": 1}, "fbwwww9": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwwww9/", "text": "I got a good scholarship from a school near home too. I’m about 50 minutes away from my moms house, only 35 from my dads. However, I feel as though I have a lot of independence. It all depends on whether your parents respect your boundaries or not. My parents only come visit if I give them permission too, and they pick me up to take me off campus. They don’t come up into my room unless invited so it’s very much my space. As long as you can create that separation from home, you’ll be able to have a lot of independence and enjoy your time at school. Best of luck to you!", "author": "onebigoof", "created": 1577161636, "upvotes": 1}, "fbwwwq6": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwwwq6/", "text": "Get a good group of friends that will want to hang out/room with in the possible future. I joined a fraternity and have had an awesome group of friends because of it. Stay at home as long as you can stand it though, it will help financially in the long run.", "author": "ougottaluvit", "created": 1577161633, "upvotes": 1}, "fbwwhv1": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwwhv1/", "text": "If you are dorming how can you not feel independent? You don't live with them and so you aren't dependent in that regard and no dorm is going to let people inside without a pass even if they say they are a parent so it's not like your mom can act like a mom in your room when you are out by cleaning or whatever. you could dorm in a uni in your home town and be independent since it mostly comes down to you going to them for the most part.", "author": "RolfIsSonOfShepnard", "created": 1577161321, "upvotes": 1}, "fbwuc7o": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwuc7o/", "text": "It depends. My parents visited my sister every weekend because she was in college only 30 mins away. But the advantage was because she couldn't drive, it was convenient for anything she needed.", "author": "smartymarty1234", "created": 1577159662, "upvotes": 1}, "fbwtavq": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwtavq/", "text": "I went to college 50 min from my parents. First year and first semester of second year I lived on campus. Second semester second year and third year I lived off campus with my boyfriend. \n\nI loved it. I went home 1 weekend a month while I lived on campus. My dad worked in town sometimes and he'd take me out to dinner or help me with shopping since i didn't have a car. My parents would bring my brothers to visit if i missed them. But on a regular night i could go to the bar or to a friends and my parents wouldn't know the difference. \n\nMy mom expected to hear from me daily but even just a text was fine. And that was only because she was worried id get myself killed or arrested (i was into some pretty not ok activities in college related to urban exploration)", "author": "makeupqueena", "created": 1577158857, "upvotes": 2}, "fbwqayj": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwqayj/", "text": "you can be independent but not if your parents are too clingy and try to visit you all the time", "author": "nokiabby", "created": 1577156601, "upvotes": 1}, "fbwp3p1": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwp3p1/", "text": "Yes yes *yes*! I chose a college a half-hour away over an out-of-state school for financial reasons. This semester, there were months when I saw my parents several times per week *and* months when I didn’t see them at all. College is a whole different universe, and being busy with classes, extracurriculars, jobs, etc. tends to magnify the distance between your school and home lives.", "author": "a_wagen", "created": 1577155692, "upvotes": 1}, "fbwnrmk": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwnrmk/", "text": "Hey so I’m a senior at a school in NYC and I live about an hour from campus with my parents in Jersey. I dormed for three years and it was really important to me independence-wise. I went and visited home fairly often on weekends because they were so close, but it was fine. Now (staring this fall semester after living alone while studying abroad in the spring) I commute from NJ, living at home with my parents, and I still feel pretty independent. I stay at my girlfriend’s dorm pretty often, but even when I go home I get there pretty\nlate tbh (or late for my asleep-by-nine parents lol). It’s nice. I’m not gonna lie- I cannot wait to move out and feel actually independent. Financially independent. But tbh where I am now is smart for my bank account and does not feel smothering", "author": "NotDido", "created": 1577154743, "upvotes": 1}, "fbwmv3r": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwmv3r/", "text": "Yes and no. 45 is a lot better than 0-20 min because you or your parents have to have better of a reason to make the drive so it is “worth it.” But if you really need assistance like flat tire, come wash my clothes, etc it’s doable. But you will be tempted to be more dependent since you’re not hours or states away. But if you aren’t tempted and you want space then it’s 100% up to you how much you let them be a part of your life. Let it be a lesson to learn how to set boundaries in your relationships. It’s up to you to draw the line of how much space you need and learn that it’s not selfish to do so.", "author": "potatomermaid823", "created": 1577154088, "upvotes": 2}, "fbwlaa1": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwlaa1/", "text": "I did it (Australia). I pay for my university fees and all my expenses though which I think is a big part of it because then there's not as much obligation to hang out with your family. My mum and I have a strained relationship and I have lunch with her at a cafe every one or two week and I will come home for the day occasionally so that keeps her happy enough. My dad works at my uni sometimes so I get to see him a lot and we are really close so it works well", "author": "elsieholden", "created": 1577152917, "upvotes": 2}, "fbwkzv8": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwkzv8/", "text": "I commute to college. I am not independent in the true sense of the word (completely care for myself, cook, clean, etc), but I have a lot of freedom to run my life as I want it. I have a great relationship with my parents and I actually love living with them and at home.", "author": "theritualmurder", "created": 1577152700, "upvotes": 2}, "fbwkusc": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwkusc/", "text": "A lot depends on your parents but it still is a lot of independence. I was about 30 minutes from my hometown for university. It was great. I could be independent but know if I needed it, my parents were nearby. So you just have to talk to your parents. Let them know you want to stand alone. Be an adult.", "author": "PasstheySoysauce", "created": 1577152594, "upvotes": 2}, "fbwkek3": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwkek3/", "text": "I live an hour from school, and it's been great. I live on campus, don't go home much, and my parents don't visit all that often, so if you commute, get homesick, or have helicopter parents it'll be another story", "author": "SkiMonkey98", "created": 1577152252, "upvotes": 2}, "fbwjsl5": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwjsl5/", "text": "I live 40 min from my home at college. And I never really go home, or lean on my parents. It’s easy to be independent, as long as you aren’t forced into a bad situation with your parents.", "author": "Catelyn_Rose", "created": 1577151794, "upvotes": 2}, "fbwjdjn": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwjdjn/", "text": "Set boundaries with your family. Let them know you want independence and to call if they want to visit or wait til you visit them. I live 2 and a bit hours from my mum in one direction and 2 and a half from my dad in the other direction but I haven't been close with my parents til now so I'm seeing them every month or 2 (when my dad lives in same town during highschool I saw him once a year or so) it's all up to what you feel more comfortable with but don't let them guilt trip you into visiting more than you want to.", "author": "Wynonna99", "created": 1577151482, "upvotes": 2}, "fbwiw5f": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwiw5f/", "text": "i go to a school 45 minutes from my house, and yes, but it can really depend on how you do it. my roommate goes home every weekend and calls their mom everyday. i’m not super close with my parents but i am with my sister so being even 45 minutes away was awesome because she came to visit me a couple times. i only went home once in a while.\n\ni will say though, if your family is like mine, they might bother you about coming home every couple of weeks because you’re close. it’s probably not gonna be a big deal though, if you don’t want to go home you can just say you’re busy or have an exam that week and they’ll probably stop bugging you about it.", "author": "valentiiines", "created": 1577151114, "upvotes": 2}, "fbwg8p5": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwg8p5/", "text": "I live on campus at a college 45-60 minutes from my parents/hometown and they have no influence on my life there, but I can go home pretty much whenever I need to.", "author": "tittilating_tomatoes", "created": 1577149113, "upvotes": 2}, "fbwfscw": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwfscw/", "text": "My university is only 15 minutes away from my house. I live on campus and rarely visit home. I have found that is is really easy to feel independent while living on campus, no matter how far away home is. But at the same time, It has been nice to be close to home, as it has made move in/out much easier, and going home for holidays is no big deal.\n\nAt the end of the day, your college experience is entirely up to you. I think t’s important to keep in mind that you can go home and see your family often and still be independent.", "author": "cbates33", "created": 1577148771, "upvotes": 2}, "fbweylt": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbweylt/", "text": "As someone who lived on campus and in a student apartment while living 15 mins away from my university I'll give my two cents. I barely visit my parents even on weekends nor they wanted me to be home every weekend becuase my brother goes to school about 3 hours away and didn't want him to miss out by not being with us. I currently commute from home but now we live like 5 mins away from my university so there really isn't a point to live without my parents. It really depends on your parents they may expect you to visit every weekend or if your parents are like mine they didn't really car (however my mom worked around my campus so I did see her a lot). Honestly if you can afford definitely live on campus becuase even if you live close you don't notice really it still feels like the traditional college experience as if you went to a school hours away just most likely without the homesickness becuase you can go back and visit home whenever.", "author": "Spitfuls", "created": 1577148148, "upvotes": 2}, "fbweb0o": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbweb0o/", "text": "I go to a university about 35-40 minutes from my hometown and I mine as well be a plane ride away, my family never bothers me because they know I’m busy and having fun. That being said one of my other friends from my hometowns family pressures and guilts him to spend nearly every weekend at home and it has definitely hurt his college experience. It really depends on your family. My suggestion would be to talk to them, voice your concerns and let them know that you want to be on your own.", "author": "Hoccer99", "created": 1577147656, "upvotes": 2}, "fbwe9u2": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwe9u2/", "text": "I go to a college about 50 min from my house and I’m in an apartment right near campus. It’s so much freedom, I love it and it’s so weird being back home for break.", "author": "oddlyemily", "created": 1577147630, "upvotes": 2}, "fbwdr79": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwdr79/", "text": "Just make sure your parents aren’t tracking your location live on any social media.", "author": "Thoth18", "created": 1577147245, "upvotes": 2}, "fbwbohs": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwbohs/", "text": "I went to a college thirty minutes from home and I certainly was not independent from my parents. I never relied on them but I was always guilt-tripped into coming home nearly every weekend so I never built a social life. That lasted two years until I was sick of it and transferred three hours from home.\n\nBut if you can set boundaries then it can be easy to be independent. Just don’t go home every weekend.", "author": null, "created": 1577145702, "upvotes": 2}, "fbwbk1q": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwbk1q/", "text": "I went to school 1/2 hour away, and my mom was finishing her Bachelor's and then Master's at the same school at the same time. We sometimes met up for lunch, but honestly, no issue at all.", "author": "caryb", "created": 1577145614, "upvotes": 2}, "fbwamm1": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwamm1/", "text": "I'm about an hour away and it's nice enough so that I can go home if I want and it's not a big hassle but also far enough where I don't have to to worry about my parents dropping by. But it really depends like others have said about what kind of parents you have.", "author": "jedijohnny13", "created": 1577144924, "upvotes": 2}, "fbwad79": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbwad79/", "text": "Yea I go to a state school 30-40 mins from home and I have my own apartment and buy my own groceries and just take care of myself. Although, I am home now for a whole month... nice to relax and go back home from time to time, while having the option to be on your own. I actually prefer independence close to home", "author": "JamesK1220", "created": 1577144729, "upvotes": 2}, "fbw9hi0": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw9hi0/", "text": "45 minutes is a good distance. It's close enough that if you want to see your family, or you get homesick, you can pop over on the weekend or even for dinner if you really wanted. It's far enough away that you can arguably spend time away from your family if you want to as well. \n\nI did my undergrad about 90 minutes from my family, and that's about how it worked out. I'd drive over some weekends, and holidays, and the rest of the time I was free to do my school/personal things. \n\nAs others have said, it also depends on your family. If they're helicopter parents then 45 minutes probably isn't enough.", "author": "General_Lee_Wright", "created": 1577144084, "upvotes": 1}, "fbw8gze": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw8gze/", "text": "It all depends on how much you’re willing to be independent. I’m 30 minutes from home and it’s nice because I still get to see my parents when I feel like it, but I’m still taking care of myself all on my own.", "author": "marigold423", "created": 1577143341, "upvotes": 1}, "fbw84gi": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw84gi/", "text": "I go to school 60 minutes away from my home town and I honestly don't talk to my parents every week. I often go home on weekends, and I have healthy relationships with my parents, but they respect that I have stuff to do and they let me do my thing.", "author": "2Larg3", "created": 1577143098, "upvotes": 1}, "fbw7s28": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw7s28/", "text": "This was a worry of mine too going just 30 minutes away and the answer is absolutely you can. Independence does not come from being geographically far away from your parents or hometown, it’s a decision to take life into your own hands. Managing school work, a social life, and any other responsibilities while not having parents constantly pointing you in the right direction is what will develop your “independence”. I think you’ll also realize, as I did, that it’s really not as difficult as it might seem.\n\nFurthermore, there is absolutely nothing wrong with going home from time to time. There’s this unhealthy idea that going away to college means not looking back, but if you have a healthy home environment and have a desire to visit from time to time, do it! Of course, yes, it’ll be important especially early on to stay at school more often than not to develop relationships, but that doesn’t mean you can’t visit family. I personally have a really strong relationship with my siblings and family in general so I enjoy going home a day here and a weekend there to spend time with them because simply put I just enjoy being around them. \n\nI’m only a semester in so take this with a grain of salt, but from what I’ve learned so far, Independence is a decision, not a result of leaving behind everything that is familiar. You’ll become your own person and live independently if you make the decision to do so. If you still have the desire to go off and get away from everything for a while, consider doing a semester or year abroad(I would look into this regardless, honestly). But don’t throw away a great opportunity just because of the stereotype that you “need” to travel far away for college. You don’t. The experience is all about what you make of it.\n\nBest of luck in your decision and feel free to message me if you have any other questions about what it’s like going to school close to home!", "author": "LoneF0X", "created": 1577142876, "upvotes": 1}, "fbw6uny": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw6uny/", "text": "Depends on your situation, your relationship to your parents, etc.\n\nOne of my college friends grew up an hour away, and her parents make her come home frequently for all sorts of reasons, and they are very controlling, but she has helicopter parents. She’s gotten a lot more independence though slowly but surely while here, it’s just taking her parents time to let go.\n\nI know many others who are totally independent despite being from close by. It depends entirely on your relationship with your parents.", "author": "Snow_Wonder", "created": 1577142285, "upvotes": 1}, "fbw58ny": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw58ny/", "text": "I went to college 25 minutes from home and my parents left me completely alone", "author": "Sadamatographer", "created": 1577141265, "upvotes": 1}, "fbw4sgl": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw4sgl/", "text": "I went to college 45 minutes from home and was very independent! I stayed in the apartments on campus, paid bills, made food, did laundry, partied, etc. It was nice having the independence, but also having the safety net of knowing my mom was so close if I did need anything.", "author": "unonoche", "created": 1577140982, "upvotes": 1}, "fbw3t1p": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw3t1p/", "text": "It sounds like a good option! In college you will learn independence no matter what. Will you live on campus? \n\nI go to school 4 hours from home and while I like the space, being closer to home would have some serious benefits.", "author": null, "created": 1577140421, "upvotes": 1}, "fbw3nr7": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw3nr7/", "text": "hell yea. you can be independent. my college is two hours away but i’d imagine it’d be the same if it was 45 minutes away, and i’m completely independent.", "author": "siempreLinManuel", "created": 1577140332, "upvotes": 1}, "fbw3mjb": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw3mjb/", "text": "I'm 20 minutes from home and my parents are SUPER overprotective (I'm talking like if I say I'll be home by 10, they're ready to call a SWAT team at 10:15) and I haven't run into any issues. They won't be all up in your business because honestly who wants to drive 45 minutes every day or just to do a pop up on you when odds are you may not even be home, but rather at a friend's place/in class/study sesh etc. Don't overthink it and be grateful you're close enough to get home cooked meals/laundry done on weekends.", "author": "Lerandomguy2", "created": 1577140313, "upvotes": 1}, "fbw3kqz": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw3kqz/", "text": "I go to the nearest college to my home, and still live at home, and I feel I get all the independence I need, while still having wonderful support from my parents and family.", "author": "jjthejetplane42", "created": 1577140285, "upvotes": 1}, "fbw3hou": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw3hou/", "text": "I currently attend a college 45 minutes from home. Independence is not about distance, it is about relying on yourself for many things and developing a personal identity. If you are worried about not being independent enough, set a limit for the number of days that you can go back to your hometown not including breaks. Miss your mom? Meet her somewhere in the middle for lunch on a Saturday. You don't have to move 3 states away to be independent, you just have to learn adult skills.", "author": "ctrldwrdns", "created": 1577140236, "upvotes": 1}, "fbw3chi": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw3chi/", "text": "I’m going to college 50 mins away and it’s kinda perfect. I’m just close enough where they don’t feel like constantly checking on me and just far enough so that they aren’t constantly checking on me. But if you need to go home or want to eat dinner with them they’re close enough to do so.", "author": "chnlmb", "created": 1577140156, "upvotes": 1}, "fbw1vlf": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbw1vlf/", "text": "That's about how far I live from my family for college and I go home a weekend here and there.", "author": "Phight_Me", "created": 1577139342, "upvotes": 1}, "fbvzjus": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvzjus/", "text": "i go to college about the same distance. and i love it! it depends on ur parents expectations of u and if u live on campus. my parents say i can visit whenever and don’t make me so i’ll go like once a month for the weekend and it’s nice to have home cooked meals and spend some time with my siblings. living on campus is what gives u the most freedom bc they can’t control where u go etc", "author": "melodyrabbit123", "created": 1577138366, "upvotes": 1}, "fbvxn6w": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvxn6w/", "text": "It might be different if you're living at home but if you live on campus you can obviously control how much true independence you have. My sisters when to school 20 minutes away from home and they barely visited, just for laundry sometimes and a home cooked meal but that was it,", "author": "wilinouthere", "created": 1577137565, "upvotes": 1}, "fbvx6ao": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvx6ao/", "text": "Yes you can. I’ve been living 30 mins from home and I can come home whenever I want or stay there. My parents don’t pressure me to come home on the weekends. I’ve done really well for myself and it’s nice being able to come home easy for breaks and moving in/out. Independence isn’t the problem at all. I’m plenty fine on my own in the city, and my parents respect that", "author": null, "created": 1577137378, "upvotes": 1}, "fbvwdb5": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvwdb5/", "text": "Yep I live about 30 minutes away, assuming your parents aren't insane helicopter parents, the hardest part was convincing them why I wanted an on campus house instead of commuting. \n\nTo be honest tho if my parents weren't getting old/busy I'm sure they'd try and visit me", "author": "eviltj97", "created": 1577137036, "upvotes": 1}, "fbvvj5x": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvvj5x/", "text": "Im not sure if you'll be living at the college but if you do then you should have a lot more freedom. I go to college around the same time away from my family and I've gotten so much ore freedom. It's amazing.", "author": "igotkilledbyafucking", "created": 1577136682, "upvotes": 1}, "fbvviyz": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvviyz/", "text": "i go to/live at a college forty minutes from home and honestly, it’s hard to not go home every time i get overwhelmed at school. however, it has made me more independent in some ways. so i really think it just depends on your self-control.", "author": "twoformyheart", "created": 1577136680, "upvotes": 1}, "fbvrca8": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvrca8/", "text": "I'd say maybe commute for the first year or so and then move out if you decide that's what you want to do. It really depends on your home life though\n\nEdit: I'm realizing 45 minutes is a long drive for a day.", "author": "no_names_availablee", "created": 1577134948, "upvotes": 1}, "fbvr37l": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvr37l/", "text": "Absolutely. I just finished up at school 40 minutes away. Home is in the suburbs, school on outskirts of the city. I was barely home. Friends, work, and school commitments all made is difficult to be at home very much, which I was fine with! If I needed to go home or parents needed to drop something off a few times a semester it was doable.", "author": "Devin1405", "created": 1577134847, "upvotes": 1}, "fbvpuye": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvpuye/", "text": "Some of my friends sort of “cheated” the mandatory dormitory system some uni’s have by reporting that they’re commuting, but then they actually just get an apartment near the university. If you have the money for a lease and you don’t go home often/your parents don’t visit you often, you’ll have plenty of independence", "author": "toastytowels", "created": 1577134335, "upvotes": 1}, "fbvnaik": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvnaik/", "text": "Definitely this allows you to explore yourself on your own whilst having being able to still see family and still be able to have their support", "author": "art_wizard31", "created": 1577133275, "upvotes": 2}, "fbvn5nz": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvn5nz/", "text": "I live 10 minutes away from my home, my mother works on campus, and my brother attends with me, and I still feel very independent. It does depend on your parents. I try to make active attempts to include them in my life so that they don’t feel like they need to find invasive ways to try to connect with me.", "author": "gatorade_07", "created": 1577133217, "upvotes": 3}, "fbvn2nd": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvn2nd/", "text": "Absolutely, but only if your parents repects your boundaries. My school has those keycards that only opens for students for all building.", "author": "cold-smilehoodie", "created": 1577133181, "upvotes": 2}, "fbvn1dk": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvn1dk/", "text": "I went to college 20 minutes away from home but my parents would come over once a week to take me out to dinner. \n\nIt was nice to not live with them but still have them close enough to see them once a week. Plus they are close if you need help, which a lot of young people do. I think it's possible to maintain independence while being that close to home.", "author": "jeffbobmoses", "created": 1577133166, "upvotes": 3}, "fbvmcpn": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvmcpn/", "text": "Oh man I stay 45 minutes away from where I grew up. The only thing is that most other people you go to school with also know the area, nothing more to it. Independence was the same for me, but idk how intrusive your parents are", "author": "-lighght-", "created": 1577132888, "upvotes": 2}, "fbvlw8c": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvlw8c/", "text": "I do just this and yes it's fantastic. At a certain point you'll realize that it can be nice to be close to home, having the option is really valuable for peace of mind. At the exact same time I feel just as every bit independent as I would thousands of miles away. Being close(ish) is just an extra safety net that you'll be glad to have at one point or another.", "author": "gwad72", "created": 1577132699, "upvotes": 3}, "fbvll87": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvll87/", "text": "Yeah I'm in the same situation, only 30 mins from home and in my first semester life has changed completely. It's actually hard to go home for break because I'm so used to doing things for myself now.", "author": "logsandsmogs", "created": 1577132567, "upvotes": 2}, "fbvkua9": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvkua9/", "text": "Quite alot, provided you don't visit home alot.", "author": "Flairtor", "created": 1577132260, "upvotes": 2}, "fbvkigr": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvkigr/", "text": "This is exactly how my college experience was. It gave me enough independence as I lived on campus during the week and attended a lot of parties and events and visited my family on the weekends.", "author": "butterflierhigher", "created": 1577132117, "upvotes": 2}, "fbvk9lk": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvk9lk/", "text": "I go to a college 45 minutes from my home. I have so much Independence, but I can even go home any day I want. I think it's the perfect distance", "author": "CorrodedRose", "created": 1577132015, "upvotes": 2}, "fbvk94b": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvk94b/", "text": "As long as you don't live with your parents, yes", "author": "vixxenofviolet", "created": 1577132009, "upvotes": 2}, "fbvjkid": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvjkid/", "text": "I have my own place 10 min from my parents and am completely independent... So I think 45 minutes is far away enough", "author": "dutchbarbarian", "created": 1577131726, "upvotes": 2}, "fbvir2f": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvir2f/", "text": "If you live on campus, yes. If you live at home, probably not/depends upon your parents. \n\nWhen I first started college, I lived on campus and went to a school that was a little over an hour away, I had a TON of freedom and independence. \n\nNow I go to a school that is a 30-45 minute drive away from my house, and I live at home, so I basically have no freedom or independence. However, that would likely change (at least some) if I decided to live on campus", "author": "livingstone97", "created": 1577131390, "upvotes": 2}, "fbvhdf9": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvhdf9/", "text": "I have lived with my mom during most of college and it has been great. She is not controlling or anything and I got my own car. You will definitely need less money", "author": "DieSchungel1234", "created": 1577130819, "upvotes": 2}, "fbvf5uw": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvf5uw/", "text": "I actually go to a school a little under an hour from home! It would definitely depend on your parents, but I might as well be 3h away with regards to how much independence I have. So, if your parents are normal in their attachment/control levels, I highly recommend the distance. I can go home on a whim for emergencies or when I want to see everybody, but I still am as on my own as anyone else.\n\nThat being said, if your parents are a little more controlling and the type to force you to come home every weekend or show up unannounced, more distance will be necessary because that distance is way too convenient.", "author": "aureysia", "created": 1577129918, "upvotes": 2}, "fbvf2tr": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvf2tr/", "text": "I live this situation as well, I get as much independence as I really need. I can see family on weekends if I wish but if I don’t want to then I just say I am busy. Didn’t see my family an entire quarter despite them being so close.\n\nBest of both worlds really. It’s currently the holidays and I am having a little too much of home but I feel that would be the situation for anyone, people come home for the holidays anyways.", "author": "Xalteox", "created": 1577129884, "upvotes": 2}, "fbvcq2a": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvcq2a/", "text": "For me, I was raised by a pair of helicopter parents and one very involved aunt. They were never obsessive to the point where they tried to control my life, but kept tabs on it. Monitored the number of texts and calls I made, checked my bank records, went to every high school parent-teacher conference, etc.\n\nGranted I never really did anything that would warrant that sort of treatment, but my older siblings and cousins were absolute hell raisers at my age, and they’ve wanted to keep me on the straight and narrow since.\n\nI go to a college about an hour from my hometown. Freshman year was rough. One of them called at least once a day, always asked if I’d want them to come up for a weekend trip, etc. Granted it’s decreased because, as a second semester Junior, the newness of college has worn off. Even though I’m only an hour from home, I have the independence and privacy I need.\n\nAnd not to be that guy, but for real; they do it because they care. Be firm and set boundaries as you enter this phase of adolescence, but also remember they’re the only two people in the world who will be behind you in the worst of circumstances. Give your mom and dad a call every now and then just to check in.", "author": "bakedpotatowcheezpls", "created": 1577128926, "upvotes": 2}, "fbvaiix": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbvaiix/", "text": "Um, no. Parents can drop in at ANY time. Parents WILL drop in unannounced to surprise you with lunch/dinner.", "author": "3rdtimeischarmy", "created": 1577127992, "upvotes": 2}, "fbv944g": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv944g/", "text": "Honestly independence isn’t based on distance, it’s based on boundaries. You have to make it clear to your family when you want help and when you don’t. Learn to do your own laundry and cooking, find social circles that are at school and not just hometown friends. Try to be as financially independent as possible as well in case your parents use it to control you.", "author": "tarbearjean", "created": 1577127430, "upvotes": 2}, "fbv8su2": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv8su2/", "text": "It really depends on your parents. I go to college (and live on campus) about 30 minutes away from home and I feel completely independent. But if your parents are the helicopter parent type, then you probably won’t have the same experience. 45 minutes away tho is a pretty decent distance", "author": "joosh_hoofman", "created": 1577127298, "upvotes": 2}, "fbv7950": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv7950/", "text": "i go to a college around 20-30 minutes from home and i see my parents almost every weekend (i go home mostly because the food on campus is terrible lmao) but i've never had an issue with lack of independence. tbh there's not really much your family can do to \"watch over you,\" especially if you're living on campus", "author": "jeolchin", "created": 1577126656, "upvotes": 2}, "fbv78zj": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv78zj/", "text": "I’m dependence isn’t a distance it’s a mindset. If you want to become more independent do it, don’t let anything hold you back", "author": "keenuwest", "created": 1577126654, "upvotes": 2}, "fbv6clo": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv6clo/", "text": "I live about 45-60 minutes from my parents and don't see them too often. Depends more on you and your parents than anything else.", "author": "epicblob", "created": 1577126245, "upvotes": 2}, "fbv66gy": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv66gy/", "text": "Do your parents have Life360?", "author": null, "created": 1577126159, "upvotes": 4}, "fbv5sqm": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv5sqm/", "text": "I think there's definitely nothing wrong with going to school close to home and there's, in fact, a lot of advantages I'm sure come with it (I personally am about 3 hours from home so not super far not super close). My number one advice though is to be careful you don't use it as a crutch. It can be hard when your sick, or having a stressful week or fighting with a roomate ect but unless you really need it try to tuff it out on your own before retreated home to avoid/ have your parents deal with your problems. I see a lot of my in-state friends fall into this especially in the first few semesters so just watcch yourself on that and best of luck!!", "author": "thatsmyonion", "created": 1577125965, "upvotes": 2}, "fbv5sc0": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv5sc0/", "text": "As someone who was looking to get far far away from home and ended up at a college about an hour and a half away, yes. If you live on campus you will feel very independent, distance from your parents doesn't make too much of a difference when you're living and caring for yourself.\n\nDespite wanting to be as independent as possible myself having a parent who is close enough buy you groceries or take you off campus is nice. It doesn't make you any less of an adult, just makes the college experience a little more bearable.\n\nAlso if you have lots of scholarships being financially independent is an even bigger leap than moving away from your parents alone imo. Very freeing", "author": "unimportantop", "created": 1577125959, "upvotes": 2}, "fbv5r1u": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv5r1u/", "text": "I dormed at a college 15 minutes from home.  If you partake in the college activities you should be pretty independent from home. If you can avoid going home as often as possible I think it works well.", "author": "WidjarjarBinks", "created": 1577125941, "upvotes": 2}, "fbv5q2m": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv5q2m/", "text": "I was in the same situation my senior year. I ended up attending the state university that is 45 minutes from my house and I just finished my first semester. I was able to make it feel like I’m away from home and I feel like I’ve really grown a lot in such a short period of time. I set a goal for myself, to live at school until Columbus Day Weekend, and tried to make sure I could figure out how to do things on my own.", "author": "calebh56", "created": 1577125926, "upvotes": 2}, "fbv5hs0": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv5hs0/", "text": "My question to you is, why wouldn't you be??", "author": "ThisSubIsRacistAsf", "created": 1577125804, "upvotes": 2}, "fbv5dtq": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv5dtq/", "text": "My parents literally teach at my college and when I lived on campus I literally never saw them until I wanted too or when they called. I had my own life and did whatever I wanted to do irrespective of them and how close they were. So yeah you can definitely have independence if you truly want it.", "author": null, "created": 1577125744, "upvotes": 2}, "fbv5b8i": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv5b8i/", "text": "That's about how far I am from my school and live in campus. You can be as independent as you want. \n\nAnd come to think of it, my house is about a 5 minutes drive from my grandparents house. I'm pretty sure my mom felt independent even with her parents living close.", "author": "MikeNotBrick", "created": 1577125705, "upvotes": 2}, "fbv54j6": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv54j6/", "text": "I go to a college 45 minutes from home and my answer is Yes! Absolutely yes.", "author": "knj94", "created": 1577125608, "upvotes": 2}, "fbv50to": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv50to/", "text": "Yes. I was 45 minutes away and didn’t seem them until fall break", "author": "xbigwhale", "created": 1577125555, "upvotes": 2}, "fbv4vqa": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv4vqa/", "text": "It will depend on your family and you. I go to a college only 30 minutes away from home. I see my parents once every 1-2 weeks. It could be less often but I usually invite them up for dinner or something. Outside of that, they are very respectful of my privacy and desire to be more independent now. They aren't bugging me with texts and phone calls everyday, they aren't ever making surprise visits, etc.", "author": "dukwrth", "created": 1577125483, "upvotes": 1}, "fbv4sy9": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv4sy9/", "text": "That’s the distance I live and it’s far enough way that a day trip isn’t worth it but 2 days is justifiable. I go home every other weekend for laundry and it’s perfect", "author": "paradeiss", "created": 1577125443, "upvotes": 3}, "fbv3zl7": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv3zl7/", "text": "I live 15 minutes away and both my parents works at the University I go to. I can still never see them if I don’t want to.", "author": "WraithN", "created": 1577125045, "upvotes": 5}, "fbv3c01": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv3c01/", "text": "If you live on campus or basically not with parents, yes. I go to school an hour away from my parents and I have all of the independence and freedom I could ask for", "author": "jwenner44", "created": 1577124729, "upvotes": 6}, "fbv35cn": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv35cn/", "text": "Yes! I'm currently at a university about 30min from home but I feel quite independent being there. Just make sure you talk with parents about how much you'll actually be coming home, I did maybe 1-2 times a month at the most. It's far enough that you'll have the freedom to do what you want but also nice that you can go home for home cooking / not pay for laundry.", "author": "yashterday", "created": 1577124639, "upvotes": 3}, "fbv1uox": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv1uox/", "text": "It depends on your family, but there’s definitely space for you to have independence. If your family is the type that would come to your dorm room and start cleaning unannounced, consider going farther away. But if your family recognizes that you’re an adult and need the space to be independent, I would definitely go there. The biggest thing I realized from college (the first time around) is that finances matter most. Don’t go to a more expensive school simply because it’s expensive—if a good university that you’re happy with is giving you a great scholarship, take it. Keep student loans low", "author": "tragicxharmony", "created": 1577124026, "upvotes": 7}, "fbv07pc": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbv07pc/", "text": "I myself am going to a college less than an hour drive away from my parents and I feel independent after my first semester. As far as I've seen and experienced, the fact that you'll be able to live on your own and be your own person won't be lessened by how close your family will be.", "author": "Wicked_Facade", "created": 1577123242, "upvotes": 5}, "fbuz690": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuz690/", "text": "It depends on if you live away from home, or if you stay at home and commute. I STRONGLY suggest living away from home if it’s possible for you to do so. The difference of maturity levels between my friends who moved away for uni and my friends who stayed home is absolutely insane.", "author": "bisexual-plant", "created": 1577122755, "upvotes": 12}, "fbuz500": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuz500/", "text": "I live 10 minutes from home and I am very independent... Go home once every few weeks to visit family and pups and make a nice home cooked meal lol. It's really up to you as to how independent you want to be.", "author": "josephdouble6", "created": 1577122738, "upvotes": 10}, "fbuyv3r": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuyv3r/", "text": "I’m only 45 min from my parents and honestly I think it was the best of both worlds. Close enough to go home for a day or weekend and far enough that they couldn’t just show up. \n\nMy parents were of the kind that me making to college means their job as parents was a success. I had strict rules in high school but when I came home from college there were no curfew, no where are you going when will you be home? Stuff. It’s like they did their job and now it’s on me lol of course that’s not entirely true I’ve had to lean on them now and again and they’ve been there but I found great freedom at college even 45 min away", "author": "uglybutterfly025", "created": 1577122611, "upvotes": 31}, "fbuyqkk": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuyqkk/", "text": "That's about how far away from home my school was, and imo it was perfect. \n\nFar enough way I could be on my own during the week, but close enough I could go home on the weekends when I wanted or even just for dinner if there was a special occasion during the week.", "author": "LordMudkip", "created": 1577122549, "upvotes": 7}, "fbuwxpf": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuwxpf/", "text": "My college is exactly 45 minutes from home and trust me, If I don't want to go home my parents will not be driving the hour and a half to come get me.", "author": "GIGA_NUT", "created": 1577121677, "upvotes": 11}, "fbuweqr": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuweqr/", "text": "Yes. I went to school 20 minutes away and I definitely felt more liberated.", "author": "sheepishmenorah", "created": 1577121438, "upvotes": 1}, "fbuw379": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuw379/", "text": "One of my friends lives 30 minutes away from school, but goes home less often than I do (three hours away). Hell, there are some guys on my floor who's home is only 10 minutes across town, and they're still very independent. As long as you're living on campus and not at home, you don't have anything to worry about.", "author": "Dj_White_Gold", "created": 1577121287, "upvotes": 8}, "fbuw1eq": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuw1eq/", "text": "I go to a college 30 minutes from my house and only see my parents when I need to. At that same college, a kid who lives 6 hours away sees his parents almost every weekend. A bit exaggerated, but the point stands. It depends on your family more than it depends on the distance.", "author": "Gahorma", "created": 1577121264, "upvotes": 58}, "fbuvh5k": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuvh5k/", "text": "It’s possible, my school is around the same distance from home and it didn’t totally happen for me, progressively a bit over the years but not how I would’ve wanted it. It all depends on how your parents are and how you play it. I kind of like having a mix of independent college life and still being able to like be a kid and be part of the family, I probably will lose that entirely soon so it’s nice I get to hold onto it a bit.", "author": "fluffychiblets", "created": 1577121013, "upvotes": 6}, "fbuu7xq": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuu7xq/", "text": "If you commute then you are always gonna have less independence", "author": "ozilical", "created": 1577120437, "upvotes": 48}, "fbuttzr": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuttzr/", "text": "Depending on your family, you can be independent at a college 15 minutes from home. Avoid going home too often and participate at the college. Thats what I did and felt all the independence I needed", "author": "sjj999", "created": 1577120259, "upvotes": 97}, "fbuscw0": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuscw0/", "text": "you won’t be seeing your family everyday. you only need to see them when you want to come home for a weekend or they come to take you out to eat or something like that.", "author": "WaffleMan29", "created": 1577119592, "upvotes": 121}, "fbuq5l0": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbuq5l0/", "text": "No matter how far you are from home you will be much more independent than in high school. I go to college in my hometown and I have so much more independence and free time than I did in highschool.", "author": "prettypickely", "created": 1577118589, "upvotes": 665}, "fbumc67": {"link": "/r/college/comments/eemam0/can_i_be_independent_at_a_college_only_45_minutes/fbumc67/", "text": "That's a decent amount of distance. You'll get your independence depending on how crazy your parents are", "author": "strawberiwaifu", "created": 1577116814, "upvotes": 280}}}