{
  "sid": "qhz7if",
  "link": "/r/college/comments/qhz7if/want_to_quit_college/",
  "title:": "Want to quit college",
  "text": "I’m currently going to a community college and long story short I hate it, college isn’t for me at least for now, I’m going to finish out this semester because it’d be stupid not to but I haven’t registered for classes next semester and don’t plan to, I guess I just want to know what consequences I would face, if any? And I’m also wondering if fafsa would still give me student loans for the fall semester I’m currently in even if I don’t return to college after this semester, I guess I just really need some advice right now",
  "author": "Kayski363",
  "created": 1635463201,
  "updated": 1635779877,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "higoj3w": {
      "link": "/r/college/comments/qhz7if/want_to_quit_college/higoj3w/",
      "text": "Now, I'm not gonna tell you what to do because I'm a stranger on the internet who doesn't know your exact situation.  But I can tell you that I was in your position after my freshmen year.  I looked into trade apprenticeships and career paths that I could follow that didn't require a degree.  During summer, I decided that it wasn't that I didn't like college, but I didn't like the major or the college I was going to.  I switched from being an education major to an accounting major and switched from a commuter school to a school where I live on campus.  Sometimes it's not the big thing that you don't like, it might just be that your major or school isn't right for you.  I'm now in my junior year and plan on keeping at it.",
      "author": "Wizardoftheforest",
      "created": 1635474042,
      "upvotes": 2,
      "replies": {
        "higp9kz": {
          "link": "/r/college/comments/qhz7if/want_to_quit_college/higp9kz/",
          "text": "It isn’t necessarily the school or major for me, I think it’s a more of all of the stress about student loans and class just isn’t worth the end result for me, I’m at the point where I wish I never even decided to go to college so I wouldn’t have to worry about student loans and tuition",
          "author": "Kayski363",
          "created": 1635474387,
          "upvotes": 2,
          "replies": {
            "higqbk3": {
              "link": "/r/college/comments/qhz7if/want_to_quit_college/higqbk3/",
              "text": "Like I said, not gonna tell you what to do, but there are plenty of options outside of college.  There are a lot of unions that offer apprenticeship programs and plenty of decent paying jobs.  You could also take a year or semester off and take some time to think about it before you decide one way or the other.",
              "author": "Wizardoftheforest",
              "created": 1635474865,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}