{
  "sid": "qvr3m3",
  "link": "/r/college/comments/qvr3m3/did_you_all_stop_using_snapchat/",
  "title:": "Did you all stop using Snapchat?",
  "text": "A sophomore in college, I find myself losing more streaks than I am gaining them. I have like 4 left because most days I just forget to open the app with all my work. I was never big on social media anyway but hopped on the snap trend freshman year of high school. I thought about ending the rest but I’ve always had a streak with someone so I think it would feel weird. Yes I know I can just snap people who I ended streaks with but I’d kind of rather just not… \n\nAnyone else go through this phase where you realize the app is mostly pointless yet you’ve got such a habit of keeping streaks it would feel weird to have none?",
  "author": "Belleamii",
  "created": 1637123797,
  "updated": 1637181225,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hky8v3c": {
      "link": "/r/college/comments/qvr3m3/did_you_all_stop_using_snapchat/hky8v3c/",
      "text": "I wanted to disconnect for a little so I haven’t used Snapchat for almost three months now. I didn’t realize HOW MUCH I would end up disconnecting and it made me realize that I use Snapchat a lot for communication, which I hate. But so do most of my friends. So right now I’m almost on month 3 of no Snapchat and I realize I really don’t know too much about what’s happening in peoples/friends lives. Which is nice on one end, but I’ve also had feelings of complete disconnect. I guess it just depends how much you use Snapchat for actual communication.",
      "author": "alwaystrivenprosper",
      "created": 1637124526,
      "upvotes": 2,
      "replies": {
        "hkya7nh": {
          "link": "/r/college/comments/qvr3m3/did_you_all_stop_using_snapchat/hkya7nh/",
          "text": "Thanks a lot for your input!\nMy friends seem to be posting on Snapchat and other social media about the same amount as usual, but for me I’ve started to taper off a lot this year. I asked this question because I felt like I was alone in this situation. I guess it’s normal for all people to stop at some using socials at some point unless they expect to be snapping friends pics of their babies in their 30s",
          "author": "Belleamii",
          "created": 1637125278,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl01ns0": {
      "link": "/r/college/comments/qvr3m3/did_you_all_stop_using_snapchat/hl01ns0/",
      "text": "I used to have tons of streaks. Then in junior year of high school I realized how shallow it was and let them all die. Now I still use it to communicate to my closest friends and occasionally swipe up on an old friend’s story. I honestly know very few people in college who care about Snapchat streaks and I would find it a little immature if they did.",
      "author": "MissAloeVera",
      "created": 1637164969,
      "upvotes": 1,
      "replies": {}
    }
  }
}