{
  "sid": "qph2ui",
  "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/",
  "title:": "I just failed my 3rd Biology exam",
  "text": "First exam - didn't study at all - my fault. \n\nSecond exam - studied for two weeks straight every day. \n\nThird exam - studied every day since second exam and hired a tutor to meet twice a week. \n\nI don't know what else to do. I think there is nothing else to do but to retake this class. I'm extremely sad and unmotivated. I'm a bio major, <- will be changing that to chem bc I'm very good a chem compared to bio, however i still need to take bio as a science major. This is the easiest class too how am I not doing well? I have one more exam left in Bio and I have a 53% in the class. I basically need to score an A in the next exam to have a passing grade which is highly unlikely. I think this is extremely sad because I did put in the effort for the last two exams and I would cancel plans for it as well. I'm also avoiding my tutor bc he probably thinks i did well. I'm completely out of ideas right now. What do I do?",
  "author": "jbxblair",
  "created": 1636388558,
  "updated": 1636655363,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {
    "hjtqow0": {
      "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hjtqow0/",
      "text": "Did you go back and study the material from the first and second exams? Bio can build on previous concepts so if you are missing fundamentals, just studying new material might not be sufficient",
      "author": "idontcareaboutttt",
      "created": 1636392088,
      "upvotes": 5,
      "replies": {
        "hjtvbyy": {
          "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hjtvbyy/",
          "text": "I didn’t, so maybe that could have been it.",
          "author": "jbxblair",
          "created": 1636393923,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjtuv11": {
      "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hjtuv11/",
      "text": "do you feel as though you really understand the material or you’re just sorta memorizing everything and doing problems? i kinda had the same issue with bio and i ended up having to take very extensive notes from the textbook and continually go over them and the material until i actually understood the concepts behind everything as opposed to just the surface level.",
      "author": "nugget-puppy",
      "created": 1636393736,
      "upvotes": 2,
      "replies": {
        "hjtvrpo": {
          "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hjtvrpo/",
          "text": "well my tutor looked at my second exam and said that it looked like I memorized everything but didn’t really understand it. So for the third exam we began working on actually applying the steps on a picture and we drew out a lot of things. Which for this exam I definitely knew what was happening so idk why I still failed, I still need to see what I missed.",
          "author": "jbxblair",
          "created": 1636394096,
          "upvotes": 2,
          "replies": {
            "hju3fft": {
              "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hju3fft/",
              "text": "Would you be able to draw those things out on your own? Understanding it when the tutor explains/draws it and being able to produce it yourself are different. I would meet with your tutor again and this time you try to explain everything to the tutor. You’ll see where you’re not understanding things that way",
              "author": "idontcareaboutttt",
              "created": 1636397218,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjw9ry4": {
      "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hjw9ry4/",
      "text": "Is this an Intro to Bio (Bio 100) or a higher Bio class? (Microbio, Physio, zootology, etc..) could it be because you are not at all familiar with the things taught in class and have a hard time understand/retaining information?",
      "author": "FluffyStuffInDaHouz",
      "created": 1636430870,
      "upvotes": 2,
      "replies": {}
    },
    "hjtnshq": {
      "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hjtnshq/",
      "text": "[removed]",
      "author": null,
      "created": 1636390936,
      "upvotes": 1,
      "replies": {}
    },
    "hjv3m13": {
      "link": "/r/college/comments/qph2ui/i_just_failed_my_3rd_biology_exam/hjv3m13/",
      "text": "I'm in the same boat :/",
      "author": "Wide_2077",
      "created": 1636411812,
      "upvotes": 1,
      "replies": {}
    }
  }
}