{
  "sid": "q8rpvy",
  "link": "/r/college/comments/q8rpvy/i_have_an_a_in_every_class_this_semester_why_do_i/",
  "title:": "I have an A in every class this semester, why do I still feel like my life is falling apart?",
  "text": "So, the first semester of college was rough, I screwed up and got depressed. I went on a journey of self-discovery and entirely reinvented myself. I now am very organized and orderly in my life. I sort my emails, I have a to-do list, and I have made straight A's since last semester. Why do I feel like I am slowly backsliding to that place again? I mean I feel like I shouldn't, my life is entirely unrecognizable (in a good way) from where it was a year ago. Still, I can't help but have this fear/anxiety of everything collapsing. I get this feeling most whenever I miss a question or get an unexpected email. It shouldn't affect anything, I am doing it all right by normal standards. I just feel this sense of dread every time I open my school's website or drive to campus. It feels like the beginning of an end. Does anyone else feel this way?",
  "author": "RunThermal",
  "created": 1634314396,
  "updated": 1634331595,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.87,
  "comments": {
    "hgrb8xo": {
      "link": "/r/college/comments/q8rpvy/i_have_an_a_in_every_class_this_semester_why_do_i/hgrb8xo/",
      "text": "Yes I have felt this way for 4 years. It’s a continuous cycle of feeling like you’re falling back into bad habits, feeling like your doing great, feeling like you’re falling into bad habits, etc. It’s okay. I just try to make sure I take care of myself, try to think less about how I feel and just allow myself to feel, and remind myself that if my grades are good I shouldn’t be worrying that much.",
      "author": "Missmaniequinn",
      "created": 1634316700,
      "upvotes": 6,
      "replies": {}
    },
    "hgs3fbr": {
      "link": "/r/college/comments/q8rpvy/i_have_an_a_in_every_class_this_semester_why_do_i/hgs3fbr/",
      "text": "I don't feel exactly like this but I'm kind of in a similar spot. My dread is from change though, I'm going to be transferring schools soon, which was always the plan, and I'm extremely anxious about it.\n\nYou'll get through this though, if you had the strength to pull yourself through the first time, you can get through this. Maybe try a conditioning of sorts? Like a thought condition or something, think of a specific memory or feeling when you get in that bad headspace.",
      "author": "RavensCry2419",
      "created": 1634328373,
      "upvotes": 1,
      "replies": {}
    }
  }
}