{
  "sid": "qtucd4",
  "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/",
  "title:": "I [22F] want to go to college and get a masters (or something) in psychology (or something related to it).",
  "text": "Am I crazy? I think I really want to do this. I’ve considered other options, but this is what I feel most passionate about. \n\nI have a few mental health related issues myself, so school can be incredibly difficult for me at times. (It brings out a lot of uncomfortable, intense emotions. As I’m sure it does for many people, and this can be almost debilitating at times.) \n\nEven though, over the past few years, I have worked through a lot of these issues and found ways I can best support myself and set myself up to be successful, I can’t help but feel like I’m biting off a bit more than I can chew. \n\nI think this is because I imagine myself in the future as being the same person I am now, with the same level of skills and abilities and level of tolerance for discomfort or stress. Even though I know I am not the same person I was two, or five, etc. years ago. I am trying to look at this logically, to say I may not be ready for grad school or even higher level courses right now, but that I will be when I get there. \n\n\nI would really appreciate people’s thoughts on this if you’re willing to share. \n\nThanks :)",
  "author": "gongetriddadisshit",
  "created": 1636909921,
  "updated": 1637181576,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.69,
  "comments": {
    "hklyxmu": {
      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hklyxmu/",
      "text": "Graduate programs in psychology are competitive. Try to maintain a 3.5 - 4.0 GPA, get some practical or research experiences in your undergrad, and get good letters of rec by the time you apply to a graduate program. Most programs require high GRE scores, so make sure to build in a year or so of GRE prep before you take the test (take it at least twice).",
      "author": "zifmer",
      "created": 1636910972,
      "upvotes": 12,
      "replies": {}
    },
    "hklwqyp": {
      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hklwqyp/",
      "text": "What do you plan on doing with that degree?",
      "author": "when-words-fail",
      "created": 1636910091,
      "upvotes": 10,
      "replies": {
        "hklxaxx": {
          "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hklxaxx/",
          "text": "Being a therapist probably, helping people one on one with struggles they’re having in their lives",
          "author": "gongetriddadisshit",
          "created": 1636910315,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hkm105a": {
      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkm105a/",
      "text": "Hey psych doctorate student here. I majored in psych because I was passionate about it. Secondly, mental health workers with personal experience in what were treating makes us BETTER professionals. One of the reasons that makes the psych field so amazing. Totally go for it. Plus, psych professors are much more understanding and promote self care and less hw or extensions etc (not all the time but def understand accommodations in this aspect of course)!!!",
      "author": "mike_wazowskis_ass",
      "created": 1636911815,
      "upvotes": 6,
      "replies": {
        "hkma9m8": {
          "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkma9m8/",
          "text": "Can I ask you about your school experience in terms of grades and experience that got you accepted into the grad program?",
          "author": "gongetriddadisshit",
          "created": 1636915328,
          "upvotes": 2,
          "replies": {
            "hkmaznz": {
              "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmaznz/",
              "text": "Yes absolutely. I went to SCSU in Connecticut. Did average in high school but ended undergrad with a 3.97 and tons of research experience and presentations, conferences, and a publication which is awesome. All about connections in school. This got me directly into a doctorate program. But I know plenty of people without publications or research exp that have still gotten into doctorate. GREs are currently not required, so if you wanna apply, now is your best bet. I can’t personally speak on masters programs cause I skipped it. But I also had a senior undergrad internship that got me like 8 months clinical experience before I started my program this year. Honestly it’s about going for everything you can. Grab every opportunity, research, volunteer, etc. it’s all worth it.",
              "author": "mike_wazowskis_ass",
              "created": 1636915600,
              "upvotes": 3,
              "replies": {
                "hkmc6o8": {
                  "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmc6o8/",
                  "text": "Okay… that sounds like a lot….. \n\nI mean…. I hardly even know what the GRE is. I’m pretty much just starting my undergrad, so I guess I haven’t messed up too bad yet… 😬",
                  "author": "gongetriddadisshit",
                  "created": 1636916037,
                  "upvotes": 2,
                  "replies": {
                    "hkmcox8": {
                      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmcox8/",
                      "text": "Nah not at all! It’s a lot for the time frame keep in mind this is in the span of five years for me!! But take it as you go, one step at a time. When opportunities come to you in the future you’ll be ready. They seem scary now but you’re just starting out! And hey I was in your exact position five years ago, so don’t worry. You’ll be just fine :)",
                      "author": "mike_wazowskis_ass",
                      "created": 1636916218,
                      "upvotes": 2,
                      "replies": {
                        "hkmliec": {
                          "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmliec/",
                          "text": "Thank you so much for all this information!",
                          "author": "gongetriddadisshit",
                          "created": 1636919484,
                          "upvotes": 1,
                          "replies": {
                            "hkmlrom": {
                              "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmlrom/",
                              "text": "No prob!!",
                              "author": "mike_wazowskis_ass",
                              "created": 1636919583,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hkmct6a": {
                      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmct6a/",
                      "text": "Also I barely know what GRE stands for and I’m in doctorate school now. Standardized testing is dumb haha and tons of people don’t know what it is we just pretend we do😂",
                      "author": "mike_wazowskis_ass",
                      "created": 1636916259,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkmkbtw": {
      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmkbtw/",
      "text": "There is versatility and some fields related are sociology, political science, government, business, public relations, and more",
      "author": "louddorms",
      "created": 1636919032,
      "upvotes": 2,
      "replies": {}
    },
    "hkmlcpf": {
      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmlcpf/",
      "text": "I'm not sure what your level of mental health issues are, and it's none of my business. So, I won't ask. However, keep in mind that school environments are different than work, so if you are unable to work it is possible to get degrees and run right back into not being able to handle work. It's counterintuitive, but it's true. I know people on SSI, who earned degrees, but couldn't handle work environments afterwards. They weren't lazy either.\n\n\nOther than that, yes it is possible get a degrees with mental health issues at any age. Go for it! Just take care of yourself.",
      "author": "peppyunicorn",
      "created": 1636919423,
      "upvotes": 2,
      "replies": {
        "hkmqppe": {
          "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmqppe/",
          "text": "Work and school do cause my anxiety and depression to “flare up.” I have to do certain things in order to make sure I keep other areas of my life balanced. As long as I continue to do those things (and bonus if I see a therapist regularly) I’m peachy.",
          "author": "gongetriddadisshit",
          "created": 1636921418,
          "upvotes": 1,
          "replies": {
            "hkmt986": {
              "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmt986/",
              "text": "Sounds, like you're in a good place. It may not be perfect, but it sounds like this is a viable option for you. You might not be 18, but that's sometimes better. Slightly older adults,  have the life experience and maturity to avoid basic mistakes like not studying or waiting to the last minute to assignments. \n\nGood luck!",
              "author": "peppyunicorn",
              "created": 1636922407,
              "upvotes": 1,
              "replies": {
                "hkmvldx": {
                  "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmvldx/",
                  "text": "Yes, I still have a lot of work to do around it, and being consistent in taking care of myself. But I do feel like I’m in a better position to start school than I was when I was 18. (I went to college right after high school and it was disastrous.)\n\nAnd thank you!",
                  "author": "gongetriddadisshit",
                  "created": 1636923324,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkmac6b": {
      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmac6b/",
      "text": "I do not think graduation in Psychology is a good idea. Can you not do some other degree with high job prospects and have it as a side hustle or interest?",
      "author": "Monke_Good",
      "created": 1636915354,
      "upvotes": 0,
      "replies": {
        "hkmbrpa": {
          "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmbrpa/",
          "text": "I’ve heard this like 1,000,000 times before. I know the only degrees people find valuable are STEM degrees and I’m not really down for that stuff. I’m considering doing a double major in comp sci, or a minor in sociology. (I’m guessing a minor in sociology would also be considered a bad idea.) I have no experience with comp sci but I don’t find it very engaging at the moment. \n\nAnd if I don’t care about the thing I’m studying, that can also make it a bad idea. Money isn’t Intrinsically valuable, and I want a career that is going to be fulfilling to me.",
          "author": "gongetriddadisshit",
          "created": 1636915885,
          "upvotes": 4,
          "replies": {
            "hkoh7iu": {
              "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkoh7iu/",
              "text": "Literally just do whatever you want. People are always going to have opinions about what you do so it doesn’t matter. Research majors and career fields that are interesting to you and go from there! Arts/humanities degrees can be very versatile if you know what you’re doing.",
              "author": "Equivalent-Hat5388",
              "created": 1636948767,
              "upvotes": 2,
              "replies": {}
            },
            "hkmc2yl": {
              "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmc2yl/",
              "text": "Oh this is perfect!!\n\nYou can major in CS and do Psychology as a minor. It will be fulfilling both financially and emotionally.\n\nAlso computer science is not going to be about computers. Just watch YouTube video about it.",
              "author": "Monke_Good",
              "created": 1636915999,
              "upvotes": -4,
              "replies": {
                "hkmcbvx": {
                  "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmcbvx/",
                  "text": "I’m not going to take CS as a major…. That’s a good way for me to drop out lol",
                  "author": "gongetriddadisshit",
                  "created": 1636916088,
                  "upvotes": 6,
                  "replies": {
                    "hkmcgn4": {
                      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmcgn4/",
                      "text": "Better yet major in economics and psychology.",
                      "author": "Monke_Good",
                      "created": 1636916135,
                      "upvotes": 0,
                      "replies": {
                        "hkmcmcd": {
                          "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmcmcd/",
                          "text": "That could be an option. I’m pretty much at the beginning of my college career, so I’m likely going to be testing the waters in a few areas.",
                          "author": "gongetriddadisshit",
                          "created": 1636916192,
                          "upvotes": 2,
                          "replies": {
                            "hkmcv3i": {
                              "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkmcv3i/",
                              "text": "Do economics as it is relatively easier and higher paying too. Also personally I found it interesting.",
                              "author": "Monke_Good",
                              "created": 1636916277,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkn45iy": {
      "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkn45iy/",
      "text": "Well, I work in health economics now. Don't pigeon hole yourself with your degree choices. \n\nBroadly speaking, there's quite a lot you can do with a psych. degree. I studied in the UK though, so it may differ over in the states.",
      "author": "Elastichedgehog",
      "created": 1636926648,
      "upvotes": 1,
      "replies": {
        "hkn5mbd": {
          "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkn5mbd/",
          "text": "What do you mean pigeon hole myself exactly?",
          "author": "gongetriddadisshit",
          "created": 1636927234,
          "upvotes": 1,
          "replies": {
            "hkn61aa": {
              "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkn61aa/",
              "text": "I mean that people underestimate what they can do with their education unless it's a super specific STEM degree.",
              "author": "Elastichedgehog",
              "created": 1636927405,
              "upvotes": 1,
              "replies": {
                "hkn6m8e": {
                  "link": "/r/college/comments/qtucd4/i_22f_want_to_go_to_college_and_get_a_masters_or/hkn6m8e/",
                  "text": "Oh yes, I definitely find that seems to be a very common belief among people. I know there are other opportunities for psych degrees besides the most commonly thought of ones. Thank you for saying this though, because I have often heard from people saying that “psych is a useless degree” and I don’t necessarily think that is the case, but it makes me feel very awful and hopeless.",
                  "author": "gongetriddadisshit",
                  "created": 1636927641,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}