{"sid": "dh2l7a", "link": "/r/college/comments/dh2l7a/loneliness_at_college/", "title:": "Loneliness at college", "text": "How do you deal with loneliness at college? I’m an international student and I was raised with a huge difference in the environment/ideas for fun. I only have a few friends/people I know. Most people here just drink, party, or binge watch in the weekend. To make things worse, most people here are in state students and already know each other or have a lot in common. My roommates don’t do anything but play video games, study, and watch stuff online. The only thing I can think of is going to the gym but I can’t get over my social fears because I’m small and skinny. \nThank you.", "author": "ElBarro69", "created": 1570922448, "retrieved": 1632947754, "over_18": false, "upvotes": 867, "upvote_ratio": 0.98, "comments": {"f6psj63": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f6psj63/", "text": "Go to the gym. Just keep working out. Go to clubs, as in school clubs.", "author": null, "created": 1573063323, "upvotes": 1}, "f5ol7sr": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f5ol7sr/", "text": "Id suggest trying clubs, intermurals, and inviting people from your classes to do stuff. Before a big test ask a person that you talk to in class if they want to study, or go get lunch", "author": "Man-in-the-City", "created": 1572321430, "upvotes": 1}, "f3pefco": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3pefco/", "text": "I suggest you first have to think about it this way. No one is judging you. Its college, everyone is doing whatever they want to do. So you do the same thing. Go to the gym, hang out where you like to and you will make friends eventually. That's what I did and made a few great friends this way.", "author": "PasstheySoysauce", "created": 1571056778, "upvotes": 1}, "f3oxko2": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3oxko2/", "text": "Consider a fraternity, if drinking/partying isnt your scene there are co ed professional fraternities for that purpose as opposed to the standard social fraternities. Great way to meet people with similar interests, as well as incredibly valuable networking for the future and a strong resume point.", "author": "ch0ppa1", "created": 1571032648, "upvotes": 1}, "f3o9bs6": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3o9bs6/", "text": "To overcome your social fear, travel to countries known for their warm and social culture. Like Spain or UK. Spend some time in the social or common area and say hello to one person. You will be shocked how easy it is to make friends that way. Once you are comfortable with interacting with others you will not have any problem applying that skill anywhere.", "author": "campushappens", "created": 1571011800, "upvotes": 1}, "f3nmbx3": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3nmbx3/", "text": "Why would you be worried about going to the gym if you're small and skinny?? 1/3rd of the gym is small and skinny, 1/3rd is overweight/obese, and the other 1/3rd is swole people who made it. \n\nNobody is going to judge you for going to the gym- if anything everyone will be happy that your trying to get some work done at the gym. Very supportive communities thrive there.", "author": "Nyroxis", "created": 1570999615, "upvotes": 2}, "f3nkgkk": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3nkgkk/", "text": "At first the gym might be super scary, but people get super impressed if you're skinny and make gains over a semester. Try some 5x5 stronglifts!", "author": "Diiigma", "created": 1570998952, "upvotes": 1}, "f3milxc": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3milxc/", "text": "You don't like to do in house stuff (playing video games, watching movies) but you also don't like to go out or work out so... What do you expect to do with anybody?", "author": "crater_jake", "created": 1570988696, "upvotes": 1}, "f3mgw14": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3mgw14/", "text": "I left the school I felt lonely in lol and transfer to a school where a lot of friends are going too. Funny, I also made new friends at this school then before I have no regrets.", "author": null, "created": 1570988021, "upvotes": 2}, "f3mg369": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3mg369/", "text": "Get the app bumble. There is a section for making friends “bumble bff” if you’re a girl I’m sure it’ll work easier but that’s how I found amazing friends :)", "author": "sailee12", "created": 1570987694, "upvotes": 2}, "f3m7wea": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3m7wea/", "text": "How big is your university? You don't have to name the specific one, but just give the amount that are there", "author": "Astsai", "created": 1570984366, "upvotes": 2}, "f3m7t8m": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3m7t8m/", "text": "Some advice I saw in another post that with a similar topic was really dive into something you love. The example they gave was movie watching. Let’s say you love watching movies. Plan your day around it. Get your work out of the way so you can enjoy the 2 hours you have set out for yourself. Helps you feel like you have a goal to work toward instead of getting caught in that “welp... I can always study more I guess” mentality. But it doesn’t have to be movies! It can be anything! Video games, reading books, exercising, etc. I’ve found the easiest way to make friends is to not focus on just that: making friends! Focus on what you love and the people who also love what you love will find you if you don’t run into them first. (Also! Side tip that helped me a ton: People care about you a whole lot less than you think! I mean this in a good way! They are focused on themselves just as much as you are thinking about how they are judging you.) Good luck! I hope you’re able to find what you’re looking for!", "author": "Gryph0n22", "created": 1570984328, "upvotes": 1}, "f3m63yd": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3m63yd/", "text": "Try to make friends with the internationals and with people in your classes. I have a decent number of friends but I have made 100% of them like this.", "author": null, "created": 1570983618, "upvotes": 1}, "f3m1xh4": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3m1xh4/", "text": "I relate.   \nI'm not an international student and my uni is only half an hour away by train from the station in my hometown, so it's not that I'm new to everything here.  \nBut I really don't like partying and drinking. I think I'd like drinking if it was sitting on the couch and watching a fun movie, chatting, having a game night with no more than three friends... But partying and getting wasted? No thank you.  \nAnd most others actually like this for some reason (no judging, I just truly do not understand why), and while they are out they connect and make friends and become closer while I am just here.  \nIt sucks.  \nMy one friend from uni who is kinda like me suggested we join a game group, like boardgames and stuff. So we're going to see what that's like. Maybe that's something you could try?", "author": "ThatsTits_Janis", "created": 1570981892, "upvotes": 1}, "f3lx67u": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3lx67u/", "text": "Literally no one cares or is paying attention to you when you go to the gym, they're focused on what they're doing. I really can empathize with the social anxiety, but a part of life is doing things that are outside your comfort zone, so you need to take a leap of faith sometimes.", "author": "goingtobegreat", "created": 1570980421, "upvotes": 1}, "f3lsx96": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3lsx96/", "text": "Go to the gym regardless, I got in the best shape of my life freshman year because of the same stuff you're describing. Most people wanted to get drunk and party, get big and LIFT", "author": "Pikabuu2", "created": 1570979256, "upvotes": 1}, "f3lspre": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3lspre/", "text": "I agree with others who have suggested that you find a club on campus. If you can’t find one that you’re interested in, then broaden your exploration to the larger community that your college is in. The public library might be a good place to start. You can also look into some local volunteer opportunities. Getting involved in the community outside campus is a great way to make connections, create a social support network, and get personal satisfaction, while engaging in something that has nothing to do with your academics. Hang in there!", "author": "EFDcoach", "created": 1570979186, "upvotes": 1}, "f3lapkc": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3lapkc/", "text": "There's a lot of people out there who do not like to drink, party or binge watch. Go to the gym and talk to people in your dorm.", "author": null, "created": 1570974100, "upvotes": 1}, "f3k9yf7": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3k9yf7/", "text": "Man if somebody judged you at the gym you can tell from the getgo how shitty their character is and how much self doubt they carry. Seriously go hit the gym if you want. And honestly I dont even Party, I started reading books. I read daily and I also started making music. So going to the gym, reading, shopping groceries and making music is all I do and I enjoy it. I dont even want to connect with the most people.", "author": "GlockGodTheRealOne", "created": 1570963444, "upvotes": 1}, "f3jt0z9": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3jt0z9/", "text": "I watch chocotaco play pubg between classes.", "author": "Punk_Saint", "created": 1570957912, "upvotes": 1}, "f3js48w": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3js48w/", "text": "> My roommates don’t do anything but play video games, study, and watch stuff online. \n\nI am one of them.", "author": null, "created": 1570957519, "upvotes": 1}, "f3jq1ru": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3jq1ru/", "text": "I don't want to comment too much on American frats, but in the Netherlands they are very welcoming and fun. There's alsways the stigma (even in the Netherlands) of the rich arrogant frat boy, but in my experience those are very rare. \nI don't want to comment too much on your situation but my experience with my fraternity has been surprisingly positive and I've made friends there fairly quickly.", "author": "Niels14", "created": 1570956600, "upvotes": 1}, "f3jkhrt": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3jkhrt/", "text": "Join a fraternity brother. I’d be miserable if I didn’t. It puts 4 years of your social life on super easy mode and makes it so you can focus more on academics (Bc ur not worried about finding and keeping your place socially.) Dues aren’t crazy expensive and most frats will let you do a payment plan or a dues reduction if the frat is wealthy and knows your family honestly can’t pay.\n\nAlso don’t be afraid of ppl judging at the gym. If anything, people love and respect seeing skinny guys or fatasses because they’re working on improving themselves. Very, very few people judge.", "author": "planvital", "created": 1570954138, "upvotes": 1}, "f3jfitl": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3jfitl/", "text": "I actually have more respect for people that obviously dont go to the gym regularly, ie fat people or skinny people at the gym. That says youre trying to get out of your comfort zone and change yourself for the better, which is a lot harder to do than be in decent shape and stay where you're at.", "author": "TheMonarK", "created": 1570951935, "upvotes": 2}, "f3jelqa": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3jelqa/", "text": "I went to church", "author": null, "created": 1570951503, "upvotes": 1}, "f3j5zbt": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3j5zbt/", "text": "make a reddit post on your school's subreddit asking if people wanna hang or go to an event, join an org, join a PE class, also no one gives a fuck in the gym", "author": "klarinette", "created": 1570947488, "upvotes": 1}, "f3j1owl": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3j1owl/", "text": "May not be possible due to living situations, but I would probably die of loneliness if I didn’t have my cat. A dog would be an even better companion. Also, everyone wants to pet your dog which can lead to making friends!", "author": "yipppppp", "created": 1570945561, "upvotes": 0}, "f3iuow7": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3iuow7/", "text": "Am I you?", "author": null, "created": 1570942547, "upvotes": 0}, "f3iskj2": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3iskj2/", "text": "I’m literally currently sitting in my car by myself eating a Dairy Queen blizzard, blasting my favorite music, while everyone else is partying for homecoming weekend. Find your own happiness, cheesy as it sounds.", "author": "superflowering", "created": 1570941638, "upvotes": 20}, "f3is4em": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3is4em/", "text": "I went through this myself, and I only lived 6 hours away from home.  I didn't do anything about it and became depressed without accepting it until I wasn't eating, sleeping, or showering.  I eventually left and transferred to a different school and now I feel so much better.  Please make sure that if you think you're becoming depressed you talk to somebody.  As a lot of people have said, clubs, groups, etc. are great ways to meet people.  Another way that I've found is going with some people to meals together.  Just pick some people that you know and like, and go to dinner together.  Call friends/family at home too.  Just remember that if you really don't find your group, you may want to consider transferring.  I hope this helps!", "author": "overwhelmed_human", "created": 1570941451, "upvotes": 2}, "f3ionm4": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3ionm4/", "text": "From the looks of it, you seem like you're an Hispanic in a mainly white (or major minority) school. I get how hard it is for us to get along with people in college due to our nature and culture. However, we can't deal being completely lonely. If you dont get along with the other Hispanic people, try to figure out what you like to do. From there, find a club or activity that you see yourself doing to spend time in. If you hate socializing, try doing something online to do and learn a new skill. Do something that satifies you at least.", "author": "themexpride", "created": 1570939860, "upvotes": -1}, "f3iom70": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3iom70/", "text": "From the looks of it, you seem like you're an Hispanic in a mainly white (or major minority) school. I get how hard it is for us to get along with people in college due to our nature and culture. However, we can't deal being completely lonely. If you dont get along with the other Hispanic people, try to figure out what you like to do. From there, find a club or activity that you see yourself doing to spend time in. If you hate socializing, try doing something online to do and learn a new skill. Do something that satifies you at least.", "author": "themexpride", "created": 1570939841, "upvotes": -1}, "f3im64c": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3im64c/", "text": "Go to the gym. Everyone is focused on themselves. It takes one trip to get over that fear. You’ll be okay!", "author": "muffinzzzzzz", "created": 1570938716, "upvotes": 3}, "f3ikkut": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3ikkut/", "text": "Hentai", "author": null, "created": 1570938004, "upvotes": 1}, "f3ifsmm": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3ifsmm/", "text": "Just stay as busy as possible, you won't have any time to think about family.", "author": "DementedCooki3", "created": 1570936047, "upvotes": 5}, "f3iagwc": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3iagwc/", "text": "If you speak a different language fluently, sign up to translate,  volunteer at a local humane society, nursing home, hospital or other organization.  College drama clubs always need help with productions doing stuff like costumes, scenery or lighting. Do you have musical talent? Look for a band or choir. One of the best things about going to a college not in your home town/state is that you can be the person you always wanted to be with no one from your past there to say you aren’t. As far as going to the gym, it is there for students to use. Don’t hesitate to ask others there for helpful suggestions, especially if you don’t know how to use a piece of equipment.  People at a gym usually don’t care if you’re fit, it matters that you are there trying. Wishing you the best!", "author": "karenrn64", "created": 1570934194, "upvotes": 2}, "f3i9ouf": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3i9ouf/", "text": "I’m in the same situation. I’m also an international student  and my school doesn’t have many clubs that i could join, and everyone that attends the uni are mostly in-state (like 9 out of 10 i ask)\nI just have a few friends that i made (mostly international students too) but i get quite lonely as well..", "author": "chinyu19", "created": 1570933926, "upvotes": 2}, "f3i6dp4": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3i6dp4/", "text": "I would agree with others, join a club. That doesn't have to be THE social event, but it can help you make friends who will go places with you later on. Once you get friends, or even if you don't, find out what's going on around town. There are usually Facebook or website pages for the city that post events. Facebook also has an events tab that can show you what's going on. \n\nYou could also try going to tea rooms or coffee bars and see what they have going on. Sometimes they have game nights which is a good opportunity to socialize too.", "author": "lil_miss_curly", "created": 1570932803, "upvotes": 5}, "f3i5uri": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3i5uri/", "text": "College has been the same with me though I am an American student. Compared to High School it actually has been a bit better as I have made some friends but I still feel lonely and a loner. For me it was simply doing what I could to get out. I love basketball so I played pickup and had a decent friend in sophomore year. He left so I was a lone, but I found a job outside of school and made one friend right now. It's hard but best I could give you is try to get out that you think is right for you. I commute as well so I wanted to work to try to make some friends and do something and I have been doing it for over a year.", "author": "MementoMori511", "created": 1570932618, "upvotes": 2}, "f3i4piz": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3i4piz/", "text": "Go to the gym and if they have personal training available take advantage! This will teach you how to do different things and build your confidence. And lift weights!! Dont do cardio", "author": "scholarlywalrus00", "created": 1570932217, "upvotes": 2}, "f3i392l": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3i392l/", "text": "Go to the gym. Everyone there is so wrapped up in their own workouts/thoughts/appearance that they hardly notice anyone else. Just do you and be proud of it. College is where you can be free to do this.", "author": "Sosation", "created": 1570931729, "upvotes": 7}, "f3i309e": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3i309e/", "text": "The loneliness of grad school", "author": "RedFlutterMao", "created": 1570931646, "upvotes": 3}, "f3i2ydk": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3i2ydk/", "text": "Same feeling! Most of my colleague at work said that they had no friend at all. Here my advice, try to make friend with people who talk the same language like you. Im vietnamese so i talk to vietnamese people. Its easier to make friend in that way, cause the other people dont give a fuck bout what u say, eventhough u’re friendly but they just dont want to talk with u", "author": "SteveDo12", "created": 1570931628, "upvotes": 3}, "f3hyt0u": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hyt0u/", "text": "Greek life", "author": "JForeIsBae", "created": 1570930240, "upvotes": 1}, "f3hyiy7": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hyiy7/", "text": "A good way is keeping your door open. People take that as an invitation to hang out.", "author": "arlomilano", "created": 1570930140, "upvotes": 4}, "f3hxyi1": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hxyi1/", "text": "Discord, music, getting an on campus job helps a lot because you meet new people every day and you start to get to know the regulars.", "author": "KabarXD", "created": 1570929935, "upvotes": 1}, "f3hress": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hress/", "text": "Make a club!!!!", "author": "skuleuser", "created": 1570927533, "upvotes": 0}, "f3hqhio": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hqhio/", "text": "> going to the gym but I can’t get over my social fears because I’m small and skinny\n\nWhat do you mean you can't? If you want to make new friends having some self confidence would be super beneficial.", "author": "mysim1", "created": 1570927209, "upvotes": 3}, "f3hqbl9": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hqbl9/", "text": "Take a deep breath, pull your britches up, and take your first step into that gym. No one else is going to make you. I'm a college guy too, sophomore. I haven't gone to a single party, never drink, and I get straight A's. I still find time to work out and cook my own meals. I get lonely sometimes, sure. But it's better to be alone than to have a bunch of shitbrains dragging you down with them.", "author": "TrumanS17", "created": 1570927145, "upvotes": 55}, "f3hoyda": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hoyda/", "text": "I haven’t talked to anyone in the past 2 months. Only text and discord.", "author": "lolsup1", "created": 1570926644, "upvotes": 37}, "f3hombm": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hombm/", "text": "If you go to the gym and enjoy working out you could definitely meet like minded people by just talking to people at the gym. You’d be surprised at how many other people are in the same boat as you!", "author": "anupsidedownpotato", "created": 1570926527, "upvotes": 1}, "f3hojja": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hojja/", "text": "People in the gym don't judge, and honestly they're the most accepting people you'll see. Everyone there started off either really skinny or fat or something in between. Trust me", "author": "Darkseid346", "created": 1570926498, "upvotes": 52}, "f3hnmlw": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hnmlw/", "text": "I'll be your internet friend! I'm in the same situation. Not international, but I relate. :)", "author": "BlitzkriegBomber", "created": 1570926167, "upvotes": 2}, "f3hnktd": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hnktd/", "text": "What size school do you go to? If you go to a small school I’ve just gone and sat in the library and literally made friends that way.", "author": null, "created": 1570926148, "upvotes": 3}, "f3hm9rn": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hm9rn/", "text": "I am in the same position! I am an international freshman at a public state university, skinny, roommate does nothing but game and watch YouTube (I get inspiration to try and not be like him, which kinda helps me.)\n\nI only know a few people too, but I try to meet them as much as I can and have meals with them. If they know more people, most likely you will meet them and expand your own friend circle. Try to join clubs too, it's a good way to spend your time doing something productive. I am struggling with the clubs as I understand the amount of homework we get, but still try to go.\n\nI am not the type to party and drink AT ALL, and I won't even try to be. Don't get into those activities just to seem cool and as an excuse to be \"social\"; you can be social while studying with them too. Try to find people that are like you, you won't like being around people that keep drinking and partying all the time if you're not like that anyway.\n\nGood luck dude, hopefully you can be in a happier state of mind as you settle into college.", "author": "moreddit2169", "created": 1570925662, "upvotes": 2}, "f3hlwfs": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hlwfs/", "text": "As others have mentioned, joining clubs is great. Try finding one friend who you have stuff in common with and start talking to them A LOT. They might have their own friends too, TALK TO THEM TOO! I was in a similar situation as you (except I came from another state) and this is what's helped me so far. I did marching band so a lot of my friends are from there. I also found friends in my own major. College can be scary when a ton of people are there just to drink and party. Not everyone is like that. I went to a party school and I easily found people who are better students than me. Also, something I've noticed about international students at least in my school is that they tend to always be friends with people from their original country. Maybe find someone from where you're from (if possible) and talk to them. That's what usually helps a ton of other people. Good luck!", "author": "microfsxpilot", "created": 1570925523, "upvotes": 6}, "f3hjz54": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hjz54/", "text": "Clubs ,internships/jobs, and group projects/study sessions. It will take time to develop friendships but you'll eventually find your tribe soon and it will make your experience in college worth it.", "author": null, "created": 1570924754, "upvotes": 12}, "f3hjfq6": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hjfq6/", "text": "Id like to chip in and say, go to the gym and dont care what anybody thinks. Easier said than done, i know, but the benefits of going are great. Personally, exercising in general does wonders for my mental health and makes me feel good. And trust me when I say that no one is judging you, they’re focussed on themselves for the most part. Once you go a couple times, it’ll get easier and easier. I hope you consider going :)", "author": "SlugTownRoad", "created": 1570924546, "upvotes": 137}, "f3hfgrc": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hfgrc/", "text": "Clubs, gym, volunteering, and organize study sessions. ;)", "author": "Sock_puppet_theater", "created": 1570922921, "upvotes": 36}, "f3hf74h": {"link": "/r/college/comments/dh2l7a/loneliness_at_college/f3hf74h/", "text": "Clubs are always a good way to meet people with similar interests. It can be kind of intimidating to show up to a meeting at first but everyone is usually welcoming and you'll probably have fun. Also, don't be afraid to go to the gym, most people at the gym understand your there trying to improve yourself and there's always less people judging you than you think.", "author": "--SomeRapSongs--", "created": 1570922817, "upvotes": 298}}}