{
  "sid": "qk5u3x",
  "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/",
  "title:": "just dropped half of my course load halfway through the semester?",
  "text": "this is my third semester of college but i’m technically still a freshman due to the absolute dumpster fire that was the spring 2021 semester. i’ve changed my major approximately six times now. before i started applying for schools i wanted to become a nurse like my mother, but i am absolutely terrible at math so i was like, “absolutely not.” i was accepted as an english major to college. i went from english to political science to early childhood education to general studies to a business-geared ICP (individualized curriculum program) and i realized that i have no motivation for this particular field. i just decided to drop half of my course load and prepare for next semester because i finally decided what i want to do. too bad i didn’t come to this revelation sooner so i could have saved everyone a lot of time 😂",
  "author": "NovaLossaRaptor",
  "created": 1635738861,
  "updated": 1637400472,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.94,
  "comments": {
    "hiuimql": {
      "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hiuimql/",
      "text": "So, what’s the decision?",
      "author": "dalej42",
      "created": 1635738933,
      "upvotes": 10,
      "replies": {
        "hiuksx9": {
          "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hiuksx9/",
          "text": "i’m going to study to become an ASL interpreter! 😄 sorry i forgot to put that in there lol",
          "author": "NovaLossaRaptor",
          "created": 1635740258,
          "upvotes": 7,
          "replies": {
            "hiw4zvy": {
              "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hiw4zvy/",
              "text": "Hi :),\nI’m ITP student right now. It’s really difficult but amazing field. One piece is of advice, be really careful about the program you choose. There a lot of AA program out there that advertise like you could do that two year program and be done, but you can not take the certification exam without a BA. Also different program focus on different elements. For example my program is really focus on linguistics and culture. So, we don’t start interpreting until year 3 so that we have a really strong foundation when we do. You want to make sure you choose a program that is a good fit and will get you were you want to go. Good luck :)",
              "author": "Hufflepuff7009",
              "created": 1635779977,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hiuimsw": {
      "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hiuimsw/",
      "text": "Its okay! It sounds like you’re happy with your last decision. You got this!!",
      "author": "queendabliss",
      "created": 1635738934,
      "upvotes": 6,
      "replies": {
        "hiukqlu": {
          "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hiukqlu/",
          "text": "thank you! 🤍",
          "author": "NovaLossaRaptor",
          "created": 1635740218,
          "upvotes": 1,
          "replies": {
            "hiul6e0": {
              "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hiul6e0/",
              "text": "Absolutely. It is incredibly difficult to succeed without a goal in mind. Now that you have one, you can proceed with perspective. (Hey, that’s catchy). Good luck to you! 👍👌🤞🙌",
              "author": "cajunsoul",
              "created": 1635740494,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hiuqq61": {
      "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hiuqq61/",
      "text": "Happens to everyone.",
      "author": "Masculine_Teacup",
      "created": 1635744405,
      "upvotes": 3,
      "replies": {}
    },
    "hix1457": {
      "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hix1457/",
      "text": "did you go to your career advisors? Go to the career center at school and talk to them",
      "author": "Critical-Paper",
      "created": 1635793482,
      "upvotes": 1,
      "replies": {}
    },
    "hjim8cl": {
      "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hjim8cl/",
      "text": "This sounds like me. My mother and grandmother PUSHED nursing for years and I let them. Did so many classes to apply, got in realized I hated it and I knew I would and now I’m getting my bachelors in management. \n\nI’ve wasted so many years on their idea of me and not mine and I’ll be 27 when I graduate now! Sucks lol",
      "author": "AbleSilver6116",
      "created": 1636176526,
      "upvotes": 1,
      "replies": {
        "hjjlfyr": {
          "link": "/r/college/comments/qk5u3x/just_dropped_half_of_my_course_load_halfway/hjjlfyr/",
          "text": "i wish you the best on your field! 🤍 yeah my mom and my uncle were kind of the same way. she said i could do anything i wanted but the second i pitched an idea she’d be like, “no, not that” and he’d be like, “is this going to make you a lot of money? why not engineering? you’ll make six figures straight out of college.” i feel like this has something to do with the fact that my grandfather wanted all three of his kids (my mom, above named uncle, and other uncle) to pursue the military. my mom went to vocational school to get out of it, above named uncle actually went through with it and joined the air force, and my other uncle said he was on drugs so he wouldn’t have to do it. 😭",
          "author": "NovaLossaRaptor",
          "created": 1636202612,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}