{
  "sid": "qoi1yh",
  "link": "/r/college/comments/qoi1yh/so_i_want_to_be_a_good_student_now/",
  "title:": "So, I want to be a \"good student\" now",
  "text": "This year I want to have good grades. But I still can't get grades I would want, no matter how hard I try. I wasn't \"good student\" last year I started this year. So is it lack of experiences? Or something else?",
  "author": "Overall_Sea8981",
  "created": 1636263120,
  "updated": 1636655777,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.88,
  "comments": {
    "hjnc30e": {
      "link": "/r/college/comments/qoi1yh/so_i_want_to_be_a_good_student_now/hjnc30e/",
      "text": "You’re not completely screwed, there is always a chance to improve. \nUnfortunately, being a “good student” is 75% experience. Some/most of us have already spent 13 or more years learning how to be a good student by the time we get to freshman year and we continue learning over college. I would say talk to someone who is doing well and ask them what skills they have developed that attribute to their success. \nThis is my experience\n- read the textbook, then read it again\n- take notes- take all of the notes\n- go to office hours and email your professor if you need to\n- find the right time to study, make a schedule and stick to it\n- discipline your self. Find your vice (tv, partying, phone, friends, etc) and put your studies first. \n- invest in yourself. Take care of yourself outside of school work. Making time for your mental health and physical health is important. \n- take advantage of the writing center\n- most importantly, participate - go to class and do your assignments 100% of the time. \n\nOther tips that some people use but I don’t:\n- Study groups\n- tutoring",
      "author": "Slow-Ad1099",
      "created": 1636267703,
      "upvotes": 8,
      "replies": {
        "hjndj3l": {
          "link": "/r/college/comments/qoi1yh/so_i_want_to_be_a_good_student_now/hjndj3l/",
          "text": "This is good advice, thanks for sharing. I would add good time management and organization skills. I love planners but some people like google calendar or excel sheets. Some people like note software I prefer notebooks and word. It’s about having a plan of attack and trying to stick to it. Sometimes you don’t go to plan but that’s okay adapt the plan and try again.",
          "author": "beanie1816",
          "created": 1636269013,
          "upvotes": 3,
          "replies": {
            "hjofusi": {
              "link": "/r/college/comments/qoi1yh/so_i_want_to_be_a_good_student_now/hjofusi/",
              "text": "Good additions, I forgot about those.",
              "author": "Slow-Ad1099",
              "created": 1636296515,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjnaknm": {
      "link": "/r/college/comments/qoi1yh/so_i_want_to_be_a_good_student_now/hjnaknm/",
      "text": "Maybe you lack some basics. But rising from the bottom takes time. It's gradual. Don't lose hope keep trying you'll see results. Yeah and ask questions. Lots of them",
      "author": "laynedrea",
      "created": 1636266398,
      "upvotes": 2,
      "replies": {}
    },
    "hjovrzh": {
      "link": "/r/college/comments/qoi1yh/so_i_want_to_be_a_good_student_now/hjovrzh/",
      "text": "I did well my first year, then second year tanked my grades. I knew to get it up, I had to reprioritize my life. I quit my sorority, asked for less hours at work, and really put school as my #1 priority. I graduated with a 2.9 but way better than if I didn't reprioritize after my sophomore year. It's possible - just have to want it bad enough and sacrifice your time now for a better future.",
      "author": "metalheadplanner",
      "created": 1636303007,
      "upvotes": 1,
      "replies": {}
    }
  }
}