{"sid": "psrq11", "link": "/r/college/comments/psrq11/how_do_i_tell_my_mother_that_i_want_to_switch/", "title:": "How do I tell my mother that I want to switch majors?", "text": "This is a follow-up to my previous [post](https://www.reddit.com/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/). To summarize, I haven't learned much in my computer science class and I don't believe this is the right career path for me. I have went ahead and set up an appointment with my advisor for this week to see which major I could end up switching. The big elephant in the room is my mother. I have tried telling my mother the idea of switching before however she was upset when I did. She was asking me if she spent her money for nothing and told me I'm giving up when the coursework is difficult for me. I thought at first I would push on and try my best in learning but over these past semesters, I been relying on my friend to help me out with my coding projects. I'm already in my third coding class for my major and I still only remember the basics. I realize I would make a great mistake if I continue with this and graduate and learn nothing at all. I still would like to specialize in computers and my first major in mind is CIS ( Computer Information Systems). I asked advice from here and even my coding professor did advise that too. However, I am nervous to speak about switching majors to my mom again. I was thinking that I work part-time that I could pay half & half with her, to make the payment more easier for her. If there is any other advice you have, I'd appreciate it.", "author": "Wheetos-", "created": 1632257392, "retrieved": 1632946598, "over_18": false, "upvotes": 4, "upvote_ratio": 0.75, "comments": {"hdrw7r5": {"link": "/r/college/comments/psrq11/how_do_i_tell_my_mother_that_i_want_to_switch/hdrw7r5/", "text": "I'm going to be honest. When I mentioned to my parents I wanted to change my major to graphic design they flipped shit. They told me that it's an art major, no one will want to hire me and most importantly I didn't know how to even *draw*\n\nWhat did I do? I talked to my advisor, voiced my concerns and filed the paperwork to change my major. Called home on my way back to my dorm and told them. What did they say?\n\n \"Ok\"\n\nWere they upset that their future nurse of a daughter is now a future graphic designer? Hell yeah. They give me some shit about it every now and then but I'm quick to point out that design is more employable than they think. That's what made them settle down. When we were out and about I would point out things a graphic designer would have done.\n\n\nYou're young, and it's impossible to know what you want to do. Just because something is hard doesn't mean you should stick with it if you know that's something *you don't want to do.* If she's upset about it then offer to pay the loans yourself when you graduate.", "author": "im_not_really_batman", "created": 1632263197, "upvotes": 0}, "hdrstt2": {"link": "/r/college/comments/psrq11/how_do_i_tell_my_mother_that_i_want_to_switch/hdrstt2/", "text": "Focus on the employment opportunities available to a CIS major.  \n\nI'm a parent, and I don't care what my kids go to college for, so long as they have a plan for long-term employment.  \n\nCIS **IS** employable.  \n\nThere **ARE** jobs available for people with that degree.  \n\nBut, you're going to have to work hard to land an internship if you want to boost your employment point of entry.  \n\nPlease take a Linux class.  \n\nCome on over to /r/ITCareerQuestions  if you want to discuss a career plan in deeper detail.", "author": "VA_Network_Nerd", "created": 1632261648, "upvotes": 2}}}