{"sid": "l9dkuh", "link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/", "title:": "Paying $150 for an access code is a scam. Just go to the website you’ll be using for you homework", "text": "Access codes for webassign, Pearson and other sites professors what you to use really shouldn’t cost as much as a textbook if your only purchasing the access  code. So instead, just login to webassign( or whatever site you’ll be using) and just enter your class code and buy access through them. It’s called an online access code. If you purchase access online, it is automatically applied to your account and it’s normally a fraction of what you pay in the book store. [I’ll even link the support ](https://webassign.com/support/student-support/access-codes/) for doing so explaining each one. Same goes for Pearson. You still get the same resources as everyone else, but you’ll be paying much less. Just think about. Why pay, on average, $150 for a code though your bookstore, when you can go directly to the site and pay less. An access code for my algebra class was $190 but paid $90 after setting up my account and buying it on Pearson.                                  \n\nSay it’s a scam for me to explain to you that you can go through the homework site with class key in hand. Access codes can expire or be recycled without you knowing. So instead of going to your school’s bookstore, go onto the site, select purchase online accesss purchase, and you’ll be saving money on top of the fact it’s faster than waiting in line for it. It’s one of the many things the bookstore will never tell you, because access codes sell quick.", "author": "LittleHaitian", "created": 1612104169, "retrieved": 1632947183, "over_18": false, "upvotes": 1523, "upvote_ratio": 0.98, "comments": {"glmf2ju": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glmf2ju/", "text": "Lol people actually buy the physical book with a code??\n\nI just buy online and get access to the book online anyway. Why spend more for a physical copy.", "author": "Fermats_Last_Account", "created": 1612200134, "upvotes": 1}, "gll70h9": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/gll70h9/", "text": "I hate webassign. Apparently the entire math department at my school use it", "author": "adarkpond", "created": 1612179660, "upvotes": 1}, "glkag21": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glkag21/", "text": "Oh I *never* purchase from the bookstore anymore precisely for this reason. I was so mad when I bought an access code from the bookstore and found out afterwards that buying directly from the publisher is a lot cheaper.", "author": "UpbeatFaithlessness6", "created": 1612154328, "upvotes": 1}, "glk7bh4": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glk7bh4/", "text": "My college University definitely charges more... I bought my Edfinity code through Edfinity for literally half of what the bookstore was selling it for.\n\nWorked out better in the end. I ended up dropped and switching classes and it was super easy to switch it around through Edfinity. Based on what I was reading, it would have been harder through the bookstore.", "author": "Moonstonemuse", "created": 1612152555, "upvotes": 1}, "glk5zos": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glk5zos/", "text": "The codes I use for my students are less $100 and include and e-text.", "author": "Cjb3z4", "created": 1612151840, "upvotes": 1}, "gljwkqc": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/gljwkqc/", "text": "I think buying the access code gives you access for the class for a set duration for example 360 days and 2 years. In case someone is taking Gen Chem 1 and Gen Chem 2, buying an access code would allow them to use the same code for both classes. I paid for the class independently without an access code last semester, and now i have to pay for it again because the class from last semester is over. *I suppose this means buying it on the website means it lasts for the duration of 1 class*", "author": "NeatDry7654", "created": 1612147199, "upvotes": 1}, "gljuopu": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/gljuopu/", "text": "I bought a $200 code last summer & ended up dropping it 🥲", "author": "Noodlequeen77", "created": 1612146321, "upvotes": 1}, "gljciwy": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/gljciwy/", "text": "Lmao, I wish. In most classes my professors tell us to buy straight from them.", "author": "smartymarty1234", "created": 1612137605, "upvotes": 1}, "glj3sx0": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glj3sx0/", "text": "People that use FAFSA or federal aid are forced to go through their universities bookstore because we can charge our books, supplies, and access codes to our financial aid.", "author": "BrokeCollegeKid2020", "created": 1612133387, "upvotes": 1}, "gliuth3": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/gliuth3/", "text": "This is true. I got finessed by amazon buying a book that explicitly said comes with an access code and it didn’t. Got the access code directly from Pearson after that for like $70 and returned the book.", "author": "doyouhaveanyuni", "created": 1612129201, "upvotes": 1}, "glirzmj": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glirzmj/", "text": "For me I already do that it’s still too fucking expensive to make sense when I only get it for like four months", "author": "mokenz", "created": 1612127895, "upvotes": 1}, "glipjo8": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glipjo8/", "text": "You can also use a site called [scam risk](https://www.scamrisk.com/) which provides background on alot of courses", "author": "JustinManningR9Z", "created": 1612126749, "upvotes": 1}, "glimfxp": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glimfxp/", "text": "We needed to buy an ebook for chemistry and on the bookstore for my college it was $120 but I put off buying it then couldn't remember the link so I went thru the syllabus instead. Which took me to the website where I got it for $104. Felt bad for my classmates who got it on the bookstore.", "author": "DearRatBoyy", "created": 1612125301, "upvotes": 1}, "gli6d7j": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/gli6d7j/", "text": "See my school has $600 a semester we can charge to our student account for books so we dont have to pay. It comes from our tuition and since i alway wait until the professor says you need the book for the class i usually only ever use $200 of that $600.", "author": "BMOEevee", "created": 1612117923, "upvotes": 5}, "gli1p16": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/gli1p16/", "text": "We can't even do this at our college because in-order to access the course material we need to enter a specific code which can only be found on the inside of the first page of a brand new book. Therefore we HAVE To buy it from our school. Not all of our classes do this, most of them do.", "author": null, "created": 1612115834, "upvotes": 1}, "glhzo91": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhzo91/", "text": "Dammit I just bought them and now I see this LOL", "author": "rollllllllll_", "created": 1612114922, "upvotes": 1}, "glhzkb3": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhzkb3/", "text": "The scam is the book price and code in the first place, hope teachers do more with Open Education Resources, there are tons of free and peer-reviewed books out there for all subjects. Students advocate for these, most teachers are open but have no idea they exist. One source of many, OpenStax.", "author": "daddywestla", "created": 1612114872, "upvotes": 1}, "glhy6v5": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhy6v5/", "text": "Shocking how there are so many professors pretending to be nice and saying they direct their students to the cheaper options to buy access codes but completely disregsrd that nobody should need to pay 50 or 100 bucks to submit a couple assignments.", "author": "banniemd2b", "created": 1612114237, "upvotes": 0}, "glhukbt": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhukbt/", "text": "The concept of paying a small fortune to textbook publishers in order to turn in homework needs to die in a fire.", "author": "sylbug", "created": 1612112557, "upvotes": 4}, "glhuj15": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhuj15/", "text": "Prof here - I use McGraw-Hill connect and in my pre-semester syllabus video I give a pretty clear walkthrough of how to buy direct through the website (very easy as I just post the first assignment link in Blackboard).\n\nHowever - important thing here - some students are on scholarships where they MUST buy through the bookstore to get the full refund. If they bought online like we’re all suggesting, they get no refund.\n\nI try to be as clear as possible about this, but do check your textbook refund rules of your scholarship!", "author": "FlimsyIsopod", "created": 1612112540, "upvotes": 6}, "glhufbc": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhufbc/", "text": "This is also good because if you have any issues with your subscription, buying directly will mean better support. \n\nA month ago I bought from my school bookstore not knowing any better. Since I bought the code through my school, the publisher wouldn't help me. And every time I'd get the bookstore, they would turn me to the publisher. Out of frustration, I talked to the professor who got everything resolved in 24 hours. My professor had to intervene, get the sales rep for the school for the book/publisher, and force them to make it right. \n\nThe error? The bookstore sent me the wrong code for the wrong program. Thankfully, it was the same publisher so they could fix it.", "author": "WoodlyElf", "created": 1612112493, "upvotes": 4}, "glhrdy9": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhrdy9/", "text": "Same issue here. Code was like $150 and I found it cheaper for $55.", "author": "Sunshineal", "created": 1612111048, "upvotes": 1}, "glhr1ex": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhr1ex/", "text": "10/10 recommend checking eBay for your books before buying them from anywhere else. Before you laugh, I got one of my books brand new from eBay (access code and all) for $120, when the bookstore and everywhere else wanted $250+. Other books I got for $20 when the bookstore wanted $50, and similar large discounts. Can’t hurt to check!", "author": "Dogmama1230", "created": 1612110880, "upvotes": 12}, "glhoh6i": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhoh6i/", "text": "Also, as a professor, please please talk to someone if you're particularly hard up and can't afford texts/access codes.  Most universities have a fund to help students in need.\n\n(I use free online textbooks for my classes, but I know there are still plenty of students in need)", "author": "dontbothertoknock", "created": 1612109634, "upvotes": 82}, "glho55c": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glho55c/", "text": "I see a lot of comments saying that access codes at their college's bookstore is the same as the one at the publisher's website. This is probably true for a lot of colleges, but not all of them. \n\nSome colleges/courses (like mine and OP) only list one or two options for purchasing course material. For example, there are two main ways to getting the access code: buying the access code separately and buying a textbook with the access codes. It's possible that OP's college only provided the textbook option. Getting the ebook version or buying a used textbook is usually a much cheaper option than buying a new physical textbook, so it's usually better to buy the access code separately.\n\nFurthermore, some college bookstores only list access codes/subscription prices for maybe one semester. Sometimes for classes with multi-semester sequences like Calc and Chem, it can be advantageous to purchase multi-term access codes/subscriptions since that's usually cheaper. \n\nAgain, colleges can have the opposite problem as above: they only offer multi-term access codes when you might only need a one-semester access code.\n\nFinally, sometimes.colleges have prices that are actually cheaper than the normal publisher price. For example, my prof was able to talk to the college's publisher rep and get discounted prices for multi-term access codes so that the difference between 1 semester's worth and 4 semesters was like $14.\n\ntldr: College bookstores often don't give you the full range of options that publishers offer, so it might be better for students to go see what option best suites their needs. Sometimes colleges have better options and sometimes publishers have better options.", "author": "protiumoxide", "created": 1612109469, "upvotes": 14}, "glho24l": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glho24l/", "text": "Why do you buy books?\nJust google it, youtube or get a pirated .pdf \nBut ay, that's not for everyone. When you feel leached off from college's corrupted practices, it makes the decision much easier🤪\nAlso, I didn't read the entire post, just guessed from the title.", "author": "lustyweiner", "created": 1612109428, "upvotes": -12}, "glhn15x": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhn15x/", "text": "This is the way", "author": "DrewBHyphy", "created": 1612108920, "upvotes": 2}, "glhmyjl": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhmyjl/", "text": "Literally never buy anything from your college bookstore unless you absolutely have to. Everything they sell is an over priced scam that you can get cheaper elsewhere. The only exception to this is some campus-specific textbooks that are only sold there (but those are still a scam since the school could and should give you the book digitally for free instead of forcing you to buy the physical copy).", "author": "squirrel8296", "created": 1612108884, "upvotes": 128}, "glhmvld": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhmvld/", "text": "This. I’ve saved a couple hundred bucks this semester already by just going straight to the site itself and not going through the book store. Also, if you’re like me and would like a hard copy book instead of the ebook for some subjects Amazon rental is has been a blessing as well.", "author": "soykenito", "created": 1612108844, "upvotes": 3}, "glhmgdz": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhmgdz/", "text": "I can vouch for this. my professors were the ones who suggested to buy from the website itself (instead of the pricey bookstore code)! They don’t want us paying more money than we have to either.", "author": "rhaeeJ", "created": 1612108633, "upvotes": 22}, "glhjuzc": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhjuzc/", "text": "I've purchased \"used\" access codes from places like amazon. They turned out to work fine and were much cheaper than the $70 the website offers it for. \n\nOnce I purchased a code that turned out to not be for the right version of the book, but the book publisher's customer service hooked me up with a new code at no additional cost. I might have just been lucky though. But purchasing through amazon (good return policy) meant that I could buy that code for $30 or so and if it didn't work, I could just return it.", "author": "symmetrical_kettle", "created": 1612107320, "upvotes": 106}, "glhjqi7": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhjqi7/", "text": "[deleted]", "author": null, "created": 1612107256, "upvotes": 42}, "glhg02m": {"link": "/r/college/comments/l9dkuh/paying_150_for_an_access_code_is_a_scam_just_go/glhg02m/", "text": "This is not true for all colleges. My bookstore charges the same price that would be found directly on the website.", "author": "saywcu", "created": 1612105206, "upvotes": 514}}}