{"sid": "ohy1qn", "link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/", "title:": "2 students died due to stress in online class.", "text": "Hi, during last 48 hours prior to this post 2 students from the same institute as mine died due to overloaded stress,and from what i can gather ,the only responds towards this issue from our university is \"contact counsellor\" as if our counsellor can help us do the task, or answering our exams and test, we were also not subjected to study week and were expected to submit our assignment during finals,the management didn't even bet an eye to the students who died which btw from different course but same cause of death.I had similar symptoms of insomnia due to finishing assignment and anxiety caused by this online classes,my mental health starts to deteriorate and i constantly having severe headache from time to time now. I am considering to drop out of school since my university won't allow major change nor dropping of subjects. I just want justice to be served and for someone to stand up for these students as the lecturers and management kept saying \"do not let this goes viral\"\n\nCause of death: \nThe post mortems said exploded arteries in part of the brain causes bleeding(hemorrhaging),this happen to both of them,the students were said to be lacking in sleep and rest  and were in state of hypertension\n\nFor additional reading and reference:\nhttps://twitter.com/bernamadotcom/status/1414196851968921603?s=19\n\nhttps://twitter.com/saysdotcom/status/1414500140308520960?s=19\nUpdate:\nUpper management respond:\n(Shortly,they dont even address the death,they only say they care abt student's mental health but proceed to say \"go to therapy session w our counsellor or take medication from our medical facilities\" knowing full well we don't even have time for ourselves let alone sessions w counselors and most student's are at home far from their medical facilities!!! I commented on the video saying they dont even address the issue,and the comments were turned off!)\nhttps://youtu.be/A5WQv3nQy38", "author": "Educational_Area_750", "created": 1625978906, "retrieved": 1632802034, "over_18": false, "upvotes": 1300, "upvote_ratio": 0.96, "comments": {"h5i1qu6": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h5i1qu6/", "text": "Kids are so soft nowadays", "author": "Lost_Character_5840", "created": 1626515836, "upvotes": 1}, "h4wa95v": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4wa95v/", "text": "A perfectly healthy student at a young age should not be experiencing these problems even if they are undergoing a lot of stress. Are there any mentions of comorbidities or genetic diseases that may have predisposed them to 'rupturing an artery'? I am not taking any side, but I want to clarify that correlation do not equal causation. If you argue with your father and he dies of a heart attack, the argument did not cause the heart attack. But, it is the years of hypertension and hyperlipidemia that he had that eventually led up to that incident. I suspect those students may already have an aneurysm in their brain which is like a ticking time bomb if it is not treated", "author": "Knee_girl", "created": 1626074431, "upvotes": 1}, "h4vzrnx": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4vzrnx/", "text": "Condolences from the United States. Online has been extremely difficult and hard to adapt to. I remember being dean's list before online and getting C average in the first online semester and getting a D in physics. Online also overwhelmed me especially since I relied heavily on the help offered on campus and the opportunity to work with minimal distractions in the library or testing center. I'm going to try my hardest to never do online again as it's hurting our ability to learn and making things too stressful. I remember being in a ceaseless panic during the year... sometimes I thought I'd die of exhaustion. I think the universities need to start addressing the needs of their students and start making useful resources more accessible especially in online environments.", "author": "Snawyeres", "created": 1626065783, "upvotes": 2}, "h4vi2xn": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4vi2xn/", "text": "lol fr ?", "author": "LV58_DeathKnight", "created": 1626054922, "upvotes": -1}, "h4v8drc": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4v8drc/", "text": "Stress may have been a contributing factor but they died of an aneurysm. Exams and homework are not killing students as you seem to be suggesting here.", "author": "TheProfessorsCat", "created": 1626049660, "upvotes": 0}, "h4uxst7": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4uxst7/", "text": "My college has been sending a lot of notices regarding depression and stress, urging people to contact them or look for help if they feel any of those. One student jumped from one of the campus buildings a few years ago and they’ve taken it really seriously since then.", "author": "joc052", "created": 1626044151, "upvotes": 2}, "h4ulc1v": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4ulc1v/", "text": "17 year olds literally sailed to Normandy and watched their buddies heads get blown off 60 years ago we can handle fucking sitting on our laptops and doing college", "author": "Wackey-Tobackey", "created": 1626038525, "upvotes": -4}, "h4ugu1y": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4ugu1y/", "text": "I thought you were gonna talk about suicide but didnt wanna say it in the title.\n\nThey quite literally died to stress holy shit.", "author": "Nicofatpad", "created": 1626036405, "upvotes": 7}, "h4udg8x": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4udg8x/", "text": "This may come off as rude, but how do you die from stress? Like yes I understand college can be incredibly stressful but I just don’t understand how you can literally die from it. If that’s the case the College Board needs to get to work fixing their system. Two innocent lives lost because of their flawed system.", "author": "DeathGod105", "created": 1626034751, "upvotes": 1}, "h4ud742": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4ud742/", "text": "My condolences to the friends and families of the students. This is why we need to look after our health and not compromise it for the sake of school. I’m not at all victim blaming if it does seem that way but this is very sad to hear.", "author": null, "created": 1626034625, "upvotes": 4}, "h4ub6xj": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4ub6xj/", "text": "If you can go just part-time, do that.", "author": "squeaktoy_la", "created": 1626033665, "upvotes": 2}, "h4u9bc8": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4u9bc8/", "text": "online class can be stressful even if you only have 1 or 2 difficult classes it'll all add up or you might have all due dates in one week making that week very stressful. Having e books probably doesn't help either as it drains you from staring at the computer even longer", "author": "ericce24", "created": 1626032756, "upvotes": 2}, "h4u4nv4": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4u4nv4/", "text": "I’m sorry for their family and loved ones. May they Rest in Peace", "author": "vamantes", "created": 1626030415, "upvotes": 3}, "h4u24d2": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4u24d2/", "text": "The parents of the deceased students should sue the university and anyone who knew them or experienced the same mistreatment from teachers and the college should provide their statements as witnesses, that's the only way justice will be served.", "author": "kakonoheishi", "created": 1626029170, "upvotes": 2}, "h4tvogh": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tvogh/", "text": "Health takes priority above else. Schools can be changed, education can be postponed, but health, as they say, cannot be bought with money. I was in a rigid cohort system once. I didn't finish that university. Left it half-way, and enrolled in a different and a better one. I am sorry about all of the stress you have to deal with. I hope you can find a way to make your health a top priority.", "author": "MyHeartIsByTheOcean", "created": 1626025987, "upvotes": 2}, "h4tu9id": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tu9id/", "text": "..what-", "author": "syntaac", "created": 1626025282, "upvotes": 1}, "h4tsqor": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tsqor/", "text": "This is insane", "author": "unicornbraids", "created": 1626024525, "upvotes": 2}, "h4tr5ao": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tr5ao/", "text": "where did this happen?", "author": "ZeroExost", "created": 1626023734, "upvotes": 1}, "h4tn4f8": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tn4f8/", "text": "I still can’t believe that people think that these COVID precautions are less deadly than COVID itself among the younger population.", "author": "CAndrewK", "created": 1626021715, "upvotes": -2}, "h4tn1c2": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tn1c2/", "text": "This doesn't surprise me. I just finished my bachelor's a month ago and every other student I knew had extreme stress with insomnia included during the year of online classes.", "author": "TheManicMonocle", "created": 1626021672, "upvotes": 2}, "h4tmsme": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tmsme/", "text": "I experienced the same thing as well last semester. My headache was so bad that I can’t think properly and can’t read without using glasses. I decided to fix my sleep schedule and my headache eventually went away. Btw if you think changing your major will help your mental health, please do so. \nAlso, I noticed that our university tend to cover up things & just did the bare minimum when it comes to death of the students.", "author": "Jaenax", "created": 1626021548, "upvotes": 2}, "h4tkyec": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tkyec/", "text": "Oh damn this is in Universiti Teknologi. I live in Malaysia too but I didn't hear about this. The news cares more about \"this minister told this dumb thing today\" instead of addressing such topics. Sad.", "author": "Arax214", "created": 1626020608, "upvotes": 1}, "h4tkohq": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tkohq/", "text": "Wow I am shocked. I have heard of suicide because of school stress but to have your arteries explode? That is a whole other level of stress. Be well. Have some sleep and rest. Relax. I mean damn thats insane", "author": "whynotsaysthisguy", "created": 1626020468, "upvotes": 6}, "h4tdmf9": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tdmf9/", "text": "Four years ago, I became sick from a mental illness due to stress of the semester. Until today I take medication.", "author": "Ronredderson", "created": 1626016907, "upvotes": 7}, "h4tbgzo": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4tbgzo/", "text": "*\"do not let this goes viral\"*\n\n&#x200B;\n\nWell, welcome to Reddit.", "author": "Fendibull", "created": 1626015783, "upvotes": 12}, "h4t5ix1": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4t5ix1/", "text": "Not a suprise. I was depressed for almost a week until i realized that the reason i was depressed ws due to lack of social interactions. This is why i want everything to go back to normal. Took a gap year due to online classes.", "author": "smc23678", "created": 1626012572, "upvotes": 112}, "h4t1a58": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4t1a58/", "text": "Post it in r/malaysia.", "author": "Ditto_Long", "created": 1626010068, "upvotes": 19}, "h4t15op": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4t15op/", "text": "[deleted]", "author": null, "created": 1626009990, "upvotes": -16}, "h4t0abu": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4t0abu/", "text": "Just go to a different university if this one won’t let you change majors (kinda stupid that they do that) also try taking less classes. If the current amount is stressful cutting back can help and or take a break from school if it has brought you to stress this far.", "author": "LPKKiller", "created": 1626009425, "upvotes": 3}, "h4syfal": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4syfal/", "text": "Good gosh! The amount of people that believe stress can’t kill clearly have never tasted the dire states some people have been through. \n\nFor those that will go: BuT I dEaLt WiTh StReSs AnD I mAdE iT OuT OkAy. Congrats and go fuck yourself, I forgot everybody functions just like you 👍🏾. Clearly we all can just “DrOp ThE WoRkLoad & FiNd A BalAnCe.”", "author": "KungP0wchicken", "created": 1626008244, "upvotes": 99}, "h4sxb8h": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4sxb8h/", "text": "Died due to \"stress\" from college? GTFO 🤣🤣🤣", "author": "orangeblackteal", "created": 1626007491, "upvotes": -26}, "h4svcwj": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4svcwj/", "text": "https://twitter.com/bernamadotcom/status/1414196851968921603?s=19\n\nHere are one of the news article that wrote about this issue!\n\nApparently one of the student were crawling and expecting help from family members before falling to his death at 4-5am in the morning.", "author": "Educational_Area_750", "created": 1626006040, "upvotes": 369}, "h4ssrdi": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4ssrdi/", "text": "Yeah, online college is no joke. I did my full freshman year remotely. I slept at 5 am and woke up at 3 pm. One's mental health declines significantly.", "author": "tuduun", "created": 1626003929, "upvotes": 16}, "h4sksos": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4sksos/", "text": "ওহ্যই", "author": "Shakib0020", "created": 1625996317, "upvotes": 1}, "h4sfix0": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4sfix0/", "text": "awarded to help go viral idk how else i could help but hopefully a news reporter sees this", "author": "aguafreska", "created": 1625991067, "upvotes": 16}, "h4s7b7y": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4s7b7y/", "text": "[deleted]", "author": null, "created": 1625983672, "upvotes": -47}, "h4s1hgh": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4s1hgh/", "text": "They don’t let you change your major? That’s really weird. Is this in the US?\n\nEdit: I read the tag, never mind", "author": "Robot_Biologist", "created": 1625979354, "upvotes": 89}, "h4s17qb": {"link": "/r/college/comments/ohy1qn/2_students_died_due_to_stress_in_online_class/h4s17qb/", "text": "How did they die of stress? I am sorry but that part is somewhat unclear.", "author": "cssimps12", "created": 1625979180, "upvotes": 264}}}