{
  "sid": "qt1fgr",
  "link": "/r/college/comments/qt1fgr/how_much_do_you_guys_study/",
  "title:": "How much do you guys study?",
  "text": "How many hours per day? How many days per week? (When there’s no exam). Do you revise the materials every day? Or do you just study when you need to?\n\nI wanna know how much or little i study compared to other people",
  "author": "smoothedolphin",
  "created": 1636810656,
  "updated": 1637182000,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkgis2f": {
      "link": "/r/college/comments/qt1fgr/how_much_do_you_guys_study/hkgis2f/",
      "text": "Um, outside of homework really not a ton. \n\nI'll usually do some studying about a week prior to exams. I usually study around 4-6 hours per exam I'd bet. A good solid day of studying. \n\nI never miss homework assignments either and generally get 100% on them. I use them as kind of a intermediary to studying, as it helps plus I get points to do it.\n\nI've got 3 classes this semester that are terribly easy. I don't study for them. I didn't study a single minute for the one and nailed a 97 on the midterm while consuming tequila. \n\nMy more difficult classes usually take a bit more. My Statics course is generally just doing practice problems before the exam. The homeworks can take 2-3 hours a piece though. \n\nFor my materials course, I make flash cards and probably study 6-8 hours total for the exam. It helps a ton. I was the first done out of \\~80 students and my grade was 15% above the class average. \n\n*How*  you study is just important as how long you study. My materials course was a hard one to gauge at first. I got a 79.5% on the first exam after a 10 point curve but then greatly changed my study habits. I went from using the professor's skeleton notes that she fills in to ignoring them all together and writing flash card questions for the entire lecture. The only thing I do outside of class is put my questions into a flash card program and then run through them a few times. \n\nThen again, I wouldn't be using flashcards to study for calculus either.",
      "author": "Awkward_Mail_2786",
      "created": 1636813011,
      "upvotes": 2,
      "replies": {}
    }
  }
}