{
  "sid": "qcz46d",
  "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/",
  "title:": "College seems completely backwards.",
  "text": "It comes down to grown adults paying an institution for a service. The service being to be taught on the subjects you need to further your career. However they don’t teach you, they explain in little detail how to solve certain problems, then when it comes to the exam, you are not tested on the information you learned. You are tricked and given questions that are much more difficult then what you were taught. I understand it’s more so testing problem solving, however I find it to be ridiculous when I am “PAYING” to be taught this information, or the processes for solving these equations. I’m not paying to be taught only a sliver of the information needed to get 100% on my exam. Idk seems messed up I’m paying tens and thousands of dollars to be tricked instead of taught.",
  "author": "Themanchilddebo",
  "created": 1634843632,
  "updated": 1634849213,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhj0anm": {
      "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj0anm/",
      "text": "I agree. I've always thought modern college should employ the Socratic method when possible. Give people a chance to discover knowledge through active engagement in the material. But the sad fact is many schools look to cut every corner they can, including curriculum development, and end up becoming test taking farms. It's shameful.",
      "author": "whatistheformat",
      "created": 1634844128,
      "upvotes": 1,
      "replies": {}
    },
    "hhj25i4": {
      "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj25i4/",
      "text": "Here in NY, we are forced to take pre reqs that are literally about 2 years of high school BS, if we don’t then we can’t move up to upper classmen classes, if it weren’t for these pre reqs, people would be graduating 2 years earlier.\nSuch a waste of time.",
      "author": "Man7172",
      "created": 1634844883,
      "upvotes": 1,
      "replies": {}
    },
    "hhizt2x": {
      "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhizt2x/",
      "text": "A four-year university degree is *not* job training. \n\nYou're not paying them to teach you what you need to know. \n\nYou're paying them to help you learn how to think.\n\nWhoever told you otherwise, lied to you.",
      "author": "2ndChance_1stMistake",
      "created": 1634843928,
      "upvotes": 1,
      "replies": {
        "hhj2k4m": {
          "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj2k4m/",
          "text": "Imagine if colleges advertised “pay thousands of dollars for 4 years to learn how to think”",
          "author": "Spicybooiii",
          "created": 1634845049,
          "upvotes": 1,
          "replies": {
            "hhj2xun": {
              "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj2xun/",
              "text": "They advertise *exactly this* for their four-year university programs.\n\nIf your cognition tells you something different, then a university degree may not be for you.",
              "author": "2ndChance_1stMistake",
              "created": 1634845205,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hhj1e30": {
          "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj1e30/",
          "text": "I don’t agree. I inherently know how to think lol. I don’t pay tens of thousands of dollars to be taught how to think. If anything that is what high-school is for. I (and I assume many other students) go to university to further our education in Hopes of pursuing our desired career field.",
          "author": "Themanchilddebo",
          "created": 1634844571,
          "upvotes": 1,
          "replies": {
            "hhj2jtn": {
              "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj2jtn/",
              "text": "Disagree all you want; that doesn't make the reality of the situation any less factual. Nor does it make your position any more factual. One of the things that you should have learned in high school is that you are *not* entitled to your opinion; you're only entitled to what you can defend.\n\nIf you don't know that you don't know, then you *don't* know how to think.\n\nIf think you're paying tens of thousands of dollars for job training, it's *clear* that you don't know how to think.\n\nYou (and many other students) go to university in *hopes* of pursuing your desired career field; that is a false hope because that's not what a four-year university degree is or has ever been intended to do.",
              "author": "2ndChance_1stMistake",
              "created": 1634845046,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhj05du": {
      "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj05du/",
      "text": "College has really lost its purpose with the rise of the internet. Back when you actually had to read textbooks and actually research stuff and work with the professor the degree had value. Now college is just a cash cow being milked by telling people you need it to succeed in the real world, and the real world will only hire you if you have a degree. It’s a vicious cycle that will hopefully change in the next couple generations as things like Coursera grow in popularity.",
      "author": "harry01772",
      "created": 1634844069,
      "upvotes": 1,
      "replies": {}
    },
    "hhj909s": {
      "link": "/r/college/comments/qcz46d/college_seems_completely_backwards/hhj909s/",
      "text": "College still provides opportunities you wouldn't otherwise find on your own, and they're sometimes opportunities you'd never expect.",
      "author": "youareaweirdo___",
      "created": 1634847620,
      "upvotes": 1,
      "replies": {}
    }
  }
}