{"sid": "ptl0w5", "link": "/r/college/comments/ptl0w5/good_college_in_us_to_study_computer_science_or/", "title:": "Good college in US to study Computer Science or computer engineering?", "text": "Hello, I just finished my high-school and currently choosing the country and university. I've settled for the major I wanna study in. Anyone can recommend me a good university to study in US or any other country please? Plus one which offer scholarships because I might have a hard time with my finance. Planning on doing ossd for now...", "author": "Esperanza99", "created": 1632362007, "retrieved": 1632800847, "over_18": false, "upvotes": 0, "upvote_ratio": 0.33, "comments": {"hdyz6dx": {"link": "/r/college/comments/ptl0w5/good_college_in_us_to_study_computer_science_or/hdyz6dx/", "text": "Gonna be real with you. In the US any college that's not private you'll be very hard pressed to get most forms of financial aid. State/public institutions end up having to reserve most of their aid to their respective states, so those are the UCs, GT, UIUC, etc. \n\nThough I guess if you're international then that applies to all schools in the US. Financial aid is very hard to come by if you're international. If you're not, fill out the FAFSA and apply to the best school in your state or any \"prestigious\" out of state private school since they're more likely to hand out need based aid.", "author": "Kryoxic", "created": 1632409218, "upvotes": 2}, "hdx6pjk": {"link": "/r/college/comments/ptl0w5/good_college_in_us_to_study_computer_science_or/hdx6pjk/", "text": "well, the best are probably Carnegie Mellon, MIT, Stanford, UC Berkeley, UT Austin, the Ivies, U michigan... but all of these have very low acceptance rates, so you need very high grades and good ECs.", "author": "postmaloneismediocre", "created": 1632366828, "upvotes": 2}, "hdwxrsz": {"link": "/r/college/comments/ptl0w5/good_college_in_us_to_study_computer_science_or/hdwxrsz/", "text": "Mit", "author": "alternativealtacc", "created": 1632362302, "upvotes": 2}}}