{"sid": "pr59nm", "link": "/r/college/comments/pr59nm/considering_switching_majors_and_transferring/", "title:": "Considering Switching Majors and Transferring", "text": "I'm currently a sophomore biochemistry major. I initially wanted to pursue pharmaceuticals (specifically creating and dispensing drugs) or even going to pharmacy or medical school. I was content with being a biochemistry major freshman year because I saw there were many career paths I could pursue and the coarse load wasn't bad. However, now that the classes are more concentrated on actual biochemistry, I'm now really disliking the biology-aspect of the major and am missing the math and chemistry oriented content since it started to lean more on biology theory and life organisms, which I'm dreading. I also don't want to do any more extra schooling either (graduate school is my absolute limit).\n\nNow I'm considering switching to chemical engineering, as it applies more math and chemistry and I'm interested in manufacturing and chemical production (which I wanted to do with pharmaceuticals in the first place), and it provides many diverse job aspects I've been interested in (pharmaceuticals again, biomedical, cosmetics, food science, etc).\n\nNot only that, I'm also planning to transfer and go to a school close to home. Here's the issue. The school I'm applying to for the Spring doesn't have a chemical engineering program. I'm also considering applying to transfer for fall of my Junior year since other schools I'm interested in don't have spring transfer applications opened, but my mom has been pressuring me to come home for school as soon as possible (she's paying the bills after all).\n\nThis has been really stressing me out. I want to graduate on time, pursue a degree that I'm happy with, go to school closer to home, and try to comply to my mother's wishes.", "author": "justryingmybestt", "created": 1632046229, "retrieved": 1632801474, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hdj3nez": {"link": "/r/college/comments/pr59nm/considering_switching_majors_and_transferring/hdj3nez/", "text": "I'm a freshman biochemistry major who had wanted to be a dentist. Long story short I figured out that wasn't what I wanted to be anymore so now I'm making the same choice you are. I am thinking of transfering to engineering as well but it would mean graduating in 5 years instead of 4 and the thought pains me. The only reason being that where I go to school engineering is a 4 year in program and the extra year of tuiton and not \"graduating on time\" stigma messes with me. I want to say just remember it's your life, you only get one shot at it. Don't make the easy choice and send yourself down a path you will be dissatisfied with later on. If you don't want to go to secondary school it may just be best to take the plunge if it means more satisfaction as a whole.", "author": "Vaultoy", "created": 1632096384, "upvotes": 1}, "hdg5t97": {"link": "/r/college/comments/pr59nm/considering_switching_majors_and_transferring/hdg5t97/", "text": "BS in biochemistry here, there is a lot more math and chemistry that goes into the degree plan and courses than you may think. \n\nTo begin all your classes will go into introductory biology because it’s crucial that you understand these concepts before getting into higher level courses where work becomes more theoretical and research based.\n\nIf you are adamant about switching to chemical engineering I implore you to look into the course work required for this degree. It is an engineering degree after all, not necessarily a chemistry degree. You will not be heavily focused on chemistry (of course you will take basic intro to courses) but instead, the focus is on mathematics and physics. Don’t rush into a decision and think it through so that you really understand what it is you’re going into.\n\nHave you thought about just being a plain chemistry major?", "author": "goatboat_", "created": 1632048428, "upvotes": 2}}}