{"sid": "ebyoa7", "link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/", "title:": "Writing Prof Here Again: Some Notes On Asking For A Grade Bump", "text": "Obviously your mileage is going to vary. Every professor is different.\n\nFirst, I'll start with why I might give someone a higher grade, and there's really only two reasons:\n\n(1) I fat fingered something and typed in the wrong grade somewhere.\n\n(2) The final grade does not fairly reflect the student's ability at the end of the semester. Basically, some students may have done really poorly on an early assignment (I teach mostly freshmen), and then they get their bearings later on. I usually only really care when I have a student who is on the bubble -- it takes a C to pass, so I carefully look at the C- students to see if this is the case for anyone.\n\nOther professors may be more open to adjustments, so here's some things to keep in mind when you approach them about this:\n\n--We've already \"reconsidered\" your grade. We're aware of what we're putting in, and we know that a 79.4 is only 0.6 points away from a B-.\n\n--Why you want a higher grade isn't very important. Need to keep financial aid? Want to transfer? Headed to grad school? Parents will be mad? You're personally disappointed? Why you *want* the grade isn't nearly as important as why you *deserve* it.\n\n--Once submitted to the registrar's office, grades may be very hard for us to change. For me, I have to get the head of my program and the dean to sign off on it, then go down to the registrar, wait in line, and give the business to the clowns who didn't process the request. Ain't nobody got time for that.\n\n--The most important thing is to have a clear reason why you believe your body of work in the class means you deserve a higher grade. Correcting shortcomings from earlier in the semester is a decent reason. Committing to do better is not.\n\n\"I'm 0.5 points from a B-, and failed quiz #2, but got a B+ on the midterm which was cumulative and covered the quiz #2 material.\" That's a decent reason for adjusting a grade.\n\n\"I slacked off earlier in the semester and got a lot of Ds and C-s, but you can tell from my Cs and C+s that I really committed to doing better. Also I worked super duper hard on the final essay.\" Move along, move along.\n\n--Don't try to flatter us. Everyone tries it, no one succeeds, and we can tell from your grades whether your claims about \"really learning a lot this semester\" are true. And, if you're grade grubbing, odds are our opinions about whether you really did learn a lot differ.\n\nIf you can *demonstrate* that you learned a lot though, that matters. \"I did poorly on essay #1 because I didn't have a clear thesis statement, but you can see from the organization in essay #3 that I took your criticism to heart and learned from it\" might do well. \"I learned a lot, but still wrote bad essays\" does not.\n\n**Final Thought:** I know the standard advice is \"it doesn't hurt to ask,\" and from the student's perspective this is probably true. But, professors are people too. We don't like giving students failing grades. It's one of the worst parts of the job. Making us give you a failing grade twice sucks.\n\n--\"I missed 8 classes, slept through 3, and was always on my cellphone\" puts you on the short list for the circular file.", "author": "bl1y", "created": 1576603043, "retrieved": 1632947812, "over_18": false, "upvotes": 792, "upvote_ratio": 0.98, "comments": {"fbciei5": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fbciei5/", "text": "[deleted]", "author": null, "created": 1576724638, "upvotes": 1}, "fbbhz81": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fbbhz81/", "text": "My course syllabuses in every one of my businesses classes explicitly state to not email asking for a grade bump. This is due to the highly competitive atmosphere of this program and some of the students that go here are incredibly entitled....... but I missed the round up from a B+ to an A- .05%", "author": "oddgreatone", "created": 1576700862, "upvotes": 2}, "fbaurpa": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fbaurpa/", "text": "I think it might be helpful to note that begging at the very end of the semester may not be super helpful in any case. \n\nYou know after 3-4 weeks if you are not getting the material. You know after the midterm. You know half-way between the midterm and the final if you are doing poorly enough that you may not pass or may not pass with better than a C. If you are going to class and turning in assignments...you know if you are doing poorly.\n\nIn every class where I have reached out and asked how to improve or how to better understand the material \\*\\*throughout the semester\\*\\*...my grades have been bumped up to the next letter grade. Even when \\*I\\* feel I didn't deserve it. I for sure earned a C in statistics. But I ended up with a B. I have had a lot of on-the-cusp grades but never b/c I didn't turn in work or even turned in work late. All of my cusp grades have been bumped up so far...I'm 5 semesters down.", "author": "MableXeno", "created": 1576687222, "upvotes": 2}, "fbaujj4": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fbaujj4/", "text": "my math professor told the entire class on multiple occasions (including on the syllabus) that he bumps people up, as long as they are within 3% of the next letter & they do all the homework. i was at a 68.5% at the end. i worked my ass off to complete all the homework, but i just sucked at the exams (though i got slightly better grades each time). asshole didn't bump me up lol", "author": "crankthatshane", "created": 1576687081, "upvotes": 1}, "fbadl9t": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fbadl9t/", "text": "My professor went out of town for 2 weeks the day the final grades were posted. His email is on auto reply... can’t see how that’s allowed", "author": "Gibesmone", "created": 1576675046, "upvotes": 1}, "fbaarko": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fbaarko/", "text": "This feels like an appropriate post to ask a grade-related question. After having brain surgery last November, I finished 3 of my courses with As and 2 with a medical “no grade” to be finished within 9 weeks of the next semester. Surgery went fine but recovery was much harder than expected, and I ended up taking the whole next semester off. I had a 4.0, and my professors kept emailing about how I need to take the final and hand in work, but I was not capable of doing so and I got 2 Fs. I am back this semester working better and I just got a 4.0 again. I’m in an accelerated BA to MA program, and want to earn a PhD after this. I have a 3.6 because of those Fs and while a 3.6 doesn’t look bad, two Fs in grad level classes looks horrible on a transcript! If you were the professor in my situation, would you approve an appeal to have the grade removed from my transcript? I know I can get the administration on my side, but the appeal process starts with the professors and I feel stuck.", "author": "Basicallyellewoods", "created": 1576672320, "upvotes": 1}, "fb9u91r": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb9u91r/", "text": "I think the idea of bonus points is popping in my head because she keeps mentioning a curve or some sort of help when she does final grades. Generally I feel prof. Put a participant on grade in place specifically to give this kinda leeway. Not sure what she has planned but... my heart is hopeful. I keep trying to come to terms with accepting a B but... my mind just keeps fighting me.", "author": null, "created": 1576650096, "upvotes": 1}, "fb9t5o0": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb9t5o0/", "text": "[deleted]", "author": null, "created": 1576648908, "upvotes": 1}, "fb9sfpl": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb9sfpl/", "text": "I am a student, but witnessed another student who didn’t show up for probably 3 months of absences for the whole semester smitten our professor after turning in his final exam. Small class around 20 and I sat in the front but he said “thank you so much this was my favorite class this semester.” When good and well he had a D going into the final. Seriously this post is great it was so obvious he was trying to smooch the professor for brownie points. Students shouldn’t say things if they don’t truly mean it it’s pretty obvious.", "author": "frenchfried5", "created": 1576648163, "upvotes": 1}, "fb9qfph": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb9qfph/", "text": "why would you give a 79 though?", "author": "InbetweenerLad", "created": 1576646188, "upvotes": -2}, "fb9pc3k": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb9pc3k/", "text": "I only need 0.2% for one of my classes in order to get an 80%. I turned in two assignments very late which caused me to lose points in those assignments because of that. I also had technical issues with my online exam which caused me to run of time to finish it, but then again I'm not sure if this should be considered. I'm very scared to ask my professor about rounding grades, as I think that the professor will get annoyed by this.", "author": "-Sky_Nova_20-", "created": 1576645157, "upvotes": 1}, "fb9mk3p": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb9mk3p/", "text": "Yo OP what's your take? My method back in college wasn't to ask for a grade bump, just asking to see the final to understand where I went wrong so I can learn. I found prof's would often offer the grade bump to me by default I guess cause I showed interest in learning instead of my grade.\n\nSorry if this makes you more cynical. Don't hate the player, hate the game.", "author": "lil_v_vape_god", "created": 1576642725, "upvotes": 2}, "fb9911f": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb9911f/", "text": "[deleted]", "author": null, "created": 1576632485, "upvotes": 0}, "fb90gs1": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb90gs1/", "text": "Back in my undergrad days, I got 75% taken off because I paperclipped my pages instead of stapling them.", "author": null, "created": 1576626248, "upvotes": 1}, "fb8qhdd": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8qhdd/", "text": "Username checks out", "author": "AsianHackerMan123", "created": 1576619528, "upvotes": 0}, "fb8q4rn": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8q4rn/", "text": "oww", "author": "RovingRaft", "created": 1576619313, "upvotes": 1}, "fb8hvfs": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8hvfs/", "text": "In high school, I had an honors Astronomy teacher who knew I was desperate for a B in his class. I got 100% on every single class work, homework, and online assignment. Never got below a 100% on ANY of them for the whole semester. His tests made no sense to me so I got an F, two Ds and a C. I came in for help throughout the course of the semester and every single time he told me to just keep doing what I was doing because I was on the track to the B I wanted. Two weeks before the final I told him I was really struggling with the practice tests, he told me that I needed a B or a high C on the final to get the B in the class that I wanted. Judging by my test scores, that wasn't going to happen. I got a really low C on the final and my grade was 79.54 and he refused to give me a B in the class, even though the syllabus says the whole science department has to round up.\n\nI believe my counselor changed my grade after he submitted it, but that didn't really matter to me as much as this guy seeing how much work I put in to every single assignment and deciding that I didn't deserve a B in his class.", "author": "svartedongeribukse", "created": 1576614297, "upvotes": 1}, "fb8ga2t": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8ga2t/", "text": "This semester I took an online course and absolutely bombed the first midterm with a D. I realized I was being stupid and worked my ass off and got an A on the second midterm. I calculated that I needed a 39/40 on the final exam. I got a 38. I ended the class with an 89.94%. I emailed my professor (normally wouldn’t, but it’s 0.06%!) and she graciously raised me up to a 90. Shit happens, and if you can show that you put in effort, it pays off.", "author": "MLazarow", "created": 1576613275, "upvotes": 6}, "fb8g3w8": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8g3w8/", "text": "Maybe you can help with an etiquette question.\n\nI've had the opposite experience; I scored a 89.35% for the quarter. That's a B+. For an A-, I'd need a 90% or higher.  Without my asking, the professor bumped me up. I guess only 0.15% points gets me to 89.5%, which rounds up to 90%.\n\nI'm thrilled, and it was very nice of them. I had perfect attendance, paid attention, never missed and assignment, did extra credit, did all optional assignments.  The whole class bombed one test -- pretty badly. I got a 51% on that, IIRC, and was above the median for the class.\n\nWhat should I do? Can I thank them? They didn't have to fudge me the points. Should I? How?  I'd like to, but it feels awkward.", "author": "mikeblas", "created": 1576613161, "upvotes": 1}, "fb8cg0q": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8cg0q/", "text": "[deleted]", "author": null, "created": 1576610895, "upvotes": 5}, "fb8b2qi": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8b2qi/", "text": "[deleted]", "author": null, "created": 1576610050, "upvotes": -6}, "fb8b2pq": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8b2pq/", "text": "[deleted]", "author": null, "created": 1576610050, "upvotes": 3}, "fb8985t": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8985t/", "text": "As a student I 100% agree. I’ve gone through some personal issues that have caused my grades to slip, which has caused me to lose scholarships, but never once did I go to my professors and beg for a grade bump just because I felt entitled to it. \n\nThe only time I’ve ever asked for a grade bump was when the online textbook wasn’t registering my grades for the online homework even though I had completed every assignment, and even then I tried to contact tech support before going to my professor. I was also in contact with my professor from the beginning of the semester when I noticed I didn’t have a grade for the Chapger 1 homework I had completed, and so my professor was super understanding and gave me a 100 for the homework section of the course because I *communicated* like a decent human being instead of waiting until the end of the semester to go and beg.\n\nMy personal pet peeve is when students do the whole “I need an A in this class or I’m going to lose my scholarships and then I’ll have to drop out of school and live in a cardboard box” (maybe a slight exaggeration but you know what I mean). Again, I have also lost scholarships due to a low GPA so I understand those students’ frustration, but it’s not your professors’ fault that you can’t keep up. Extenuating circumstances happen, but if you communicate properly then 99% of the time professors will work with you. If your professor won’t work with you it’s probably because you didn’t communicate properly or just didn’t put the work in. Also, unless your scholarship requires a 4.0 then it’s unlikely that one class would bring you below the requirement.\n\nI’m going to shamelessly share this post in a few class Groupme’s that have whiny students in them. Normally I don’t like being *that* person but professors don’t deserve the amount of complaining and begging they get at the end of every semester.", "author": "dixiecup3", "created": 1576608896, "upvotes": 17}, "fb87ggf": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb87ggf/", "text": "As a professor myself, OP is 100% right. I bumped two students up this semester because they worked hard. \n\nThen I get emails from students who haven't submitted anything in weeks.", "author": "KouNurasaka", "created": 1576607802, "upvotes": 70}, "fb87dik": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb87dik/", "text": "Also... If I thought it proper, I would totally buy my Lit prof a bottle of wine. I told her a few weeks ago I would never want her job. To have a love of Lit like she does but being forced to read all our crappy papers just seems like it's own circle of hell LOL", "author": null, "created": 1576607752, "upvotes": 8}, "fb8793h": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8793h/", "text": "I'm struggling hard to achieve an A that's impossible to achieve at this point. I have an 87 in the class and only the final exam left. It is worth 150pts and I need 170 to break that A. \n\nHere's what is killing me. This is my first semester back in 20 years. I have busted my butt and received A's in all my GE classes. This semester I have also:\n\n\\-Moved 3 times\n\n\\-Dealt with living with a sociopath who deemed I was his property and would harass me for weeks\n\n\\-Had a messy break up with my BF\n\n\\-Underwent a botched surgery and was on pain killers for 2 weeks (I never missed a class, I never asked for an extension on a test and still managed to pull B's on my exams and practicals).\n\n\\- Massive bureaucratic issues with financial aid, school admins and declaration of Major issues. \n\nI had one really bad practical exam that my prof. knew I would do poorly on because it was, straight-up memorization of 150 terms. No physiology because there wasn't time to teach it completely. She apologized to me at the start of the module and told me I was going to struggle with this because I need to learn stuff logically, I don't memorize well. I got a C on this exam.  Since then I have gotten high B's and Mid A's on my exams. \n\nMy Prof told me the other day I should be hella proud of myself. 70% of the class has either dropped or failed by now. and I'm still mid-range grade for the remaining students. I can feel all the pride in the world, but that's going to nothing for my GPA or acceptance into the program. \n\nI'm not one to be a victim. I have since found a stable apartment, rid myself of the sociopath and reported him, stabilized my relationship and recovered from the surgery- I'm also back on track with my health seeing a nutritionist and PA monthly to ensure my health stays in order. \n\nI have, I guess done remediation of my life because I never dropped my determination for the class. I just feel there needs to be SOME way to take all of that into account. when determining the final grade. \n\nI get it... If I bomb the final with a D- I don't deserve a boost. but... even getting a B at this point or a low A has got to show I'm serious about this and have bled, cried and sacrificed to learn this content fully.   \n\n\nSorry for the vent- and thank you for reading it... I guess I really needed to get that all out.  Giving up my career and returning to school has been a massive life change and I'm doing my best... but the last 4 months have been beyond insane.", "author": null, "created": 1576607675, "upvotes": 12}, "fb85f7j": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb85f7j/", "text": "Thanks for the tips! I wish more teachers would come here and give their opinions since as a freshman I have diffently seen HUGE diffrances in what teachers find acceptable or not compared to college.", "author": "sirricherd", "created": 1576606547, "upvotes": 28}, "fb83s7l": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb83s7l/", "text": "Kudos to honest teachers", "author": "EarlofTeacups", "created": 1576605516, "upvotes": 43}, "fb833gy": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb833gy/", "text": "[deleted]", "author": null, "created": 1576605091, "upvotes": -30}, "fb8336h": {"link": "/r/college/comments/ebyoa7/writing_prof_here_again_some_notes_on_asking_for/fb8336h/", "text": "Thank you, your input on this subject is refreshing among all the students asking about it.", "author": "Bodidiva", "created": 1576605086, "upvotes": 182}}}