{"sid": "lt7kxd", "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/", "title:": "I got a 0 in a midterm group project because the person im working with plagiarized from Wikipedia", "text": "Hi, i had a group project that had 3 parts, one part is 50% of the work and the other two are the other 50%. We decided that i was going to do the two parts and my partner we going to do the last part.\n\nOn the submission date i was in the hospital with my uncle and submitted the work late. The prof said it was okay. Suddenly i get an email from her that we got a 0 because the project was copied from Wikipedia word for word. Yesterday i talked to the professor by phone and she said she will look into it. Now she is saying the grade stays and it is not her problem. \n\n I sent the prof a hospital admission paper and chats with my partner saying that he will do that whole part but its in a different language and she is not willing to hear me out. I had a 98% in the course and now i have a 72%.\n\nWhat should i do?", "author": "omani805", "created": 1614372877, "retrieved": 1632947195, "over_18": false, "upvotes": 1478, "upvote_ratio": 0.99, "comments": {"gpbg4qw": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gpbg4qw/", "text": "you got a 0 because you went to the hospital with your uncle. Those are the choices we make in life.", "author": "GrannyGrunge", "created": 1614618798, "upvotes": 1}, "gp7fqix": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp7fqix/", "text": "Take it to student affairs and the Dean.  Don't settle for a punishment where you didn't commit the crime. \n\nMake noise and fight it.  Unfortunately, I see professors bully students.", "author": "PsychAce", "created": 1614538175, "upvotes": 2}, "gp4vdhg": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp4vdhg/", "text": "This is why I hate groupwork with a huge passion.", "author": "M1A1Death", "created": 1614493748, "upvotes": 2}, "gp48ir1": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp48ir1/", "text": "I would take this up with the dean of the department. It's worth a shot!", "author": "arrakis21", "created": 1614483822, "upvotes": 2}, "gp1oy77": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1oy77/", "text": "Hi Omani,\n\nI am sorry to hear that you have a family member who is hospitalized. I think that your professor could have taken a more nuanced approach in this particular situation, but their behavior sounds like it is within the bounds of reason.\n\nIn response to your question, \"what should I do?\": \n\nChin up. You are still passing with 72% and it does not sound like you are facing disciplinary action for the plagiarism issue. Look at this as a valuable lesson that you will always remain responsible for any work you choose to delegate, even in a group of peers. In future assignments, remain involved in all parts of a group assignment throughout the process. Include time for verifying, and possibly correcting, any delegated group work. Otherwise, you are just gambling on the quality of the final product, which reflects poorly on you. Employers will respect your ability to manage and lead others to consistently produce quality work. Also, consider including what you learn from this situation in a future personal statement when you apply for things after college. Stories of personal growth are valuable in themselves.", "author": "Snoo_12140", "created": 1614449226, "upvotes": 2}, "gp1ldhp": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1ldhp/", "text": "Schedule an appointment with her over Zoom where you can explain how the work was divvied up & show her screenshots of your conversations with your partner regarding who did which parts of the project.", "author": "meggs_png", "created": 1614447941, "upvotes": 2}, "gp1js8k": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1js8k/", "text": "Escalate it. Take it to a dean, a department head, just someone with higher power than the teacher and bring your evidence.", "author": "hound30", "created": 1614447359, "upvotes": 2}, "gp1cxb3": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1cxb3/", "text": "Ugh what a horrible prof", "author": "Zeyn0202", "created": 1614445225, "upvotes": 2}, "gp0z3qi": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0z3qi/", "text": "This is why you don’t attend a shitty school.", "author": "arkonix1000", "created": 1614441753, "upvotes": -1}, "gp0lc0v": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0lc0v/", "text": "I want to emphasize a comment above for OP. The syllabus matters. OP -- and most students if r/college is anything to go by -- seems to be making assumptions about the pedagogical purpose of group work. It's usually _not_ to be a way to divide a time-intensive project; instead it's to mirror how academic (and most professional) work is done beyond the undergraduate world. There is no such thing as a co-produced biology article, op-ed, legal brief, architectural design, etc. where one party produces one part of it and the others assume their work is fine; rather, every person checks it, because every person is signing their name to it.\n\nIf that's who OP's professor views it (and if that's what the syllabus says or implies), the professor should reasonably expect OP to 1) mention there is a family reason the work may be turned in late -- which OP did -- but 2) use some of that time to review the partner's work.", "author": "dcgrey", "created": 1614438291, "upvotes": 3}, "gp0l8x3": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0l8x3/", "text": "Drop the class. Or just finish out and pass. But you probably don’t want to take it up with the academic misconduct office if it hasn’t been reported there already.", "author": "Happens_2u", "created": 1614438266, "upvotes": 0}, "gp0f4iy": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0f4iy/", "text": "If you have evidence that your partner copy-pasted or admits that he plagiarized, that should be okay. If you don’t have evidence if you used google docs you can check the document history.", "author": "TuriSosa25", "created": 1614436731, "upvotes": 3}, "gp0dm01": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0dm01/", "text": "You can probably speak to the chair person in your University", "author": "artistj11", "created": 1614436372, "upvotes": 2}, "gp0dh9d": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0dh9d/", "text": "That's why I like to do all my group projects on google docs--why? Because you can literally see who edited what, and when. If you used google docs, you can check which parts written by who--giving your professor proof on who plagiarized what.", "author": "artistj11", "created": 1614436341, "upvotes": 3}, "gp06wm4": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp06wm4/", "text": "could you go to the deans office?", "author": "beepbop290", "created": 1614434690, "upvotes": 2}, "gp01yem": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp01yem/", "text": "The only way I see this turning any good for you is if your partner takes one for the team, admits he solely cheated, and says you deserve a better grade.", "author": "AllamandaBelle", "created": 1614433568, "upvotes": 1}, "goz3gf1": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goz3gf1/", "text": "Go to the department Dean. Loop on the president or whoever is head of the whole thing.  I hate group projects.", "author": "OhioMegi", "created": 1614424441, "upvotes": 2}, "goyyh7s": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyyh7s/", "text": "What are the odds your partner would vouch for you to your prof? Are they a friend or just a random classmate?", "author": "sticky-dynamics", "created": 1614422912, "upvotes": 2}, "goytso6": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goytso6/", "text": "There should be a student advocacy group you can go to at your school.  If they can't help you they should be able to point you in the right direction.", "author": "ncaughneeto", "created": 1614419803, "upvotes": 2}, "goyqnlk": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyqnlk/", "text": "For reference I go to a state school in the US so hierarchies might be a little different per college. I would recommend you do this.\n\n1. find out who the professor‘s boss is, whether or not that is a department head or just another slightly ranking professor and contact them. Explain the calmly and impartially, make sure to include that you’ve had contact with the professor.\n2. Make sure to wait 1-2 days on a reply before you resend or escalate\n3. I would ask around your school (Facebook, Reddit, etc) and depending on how good of a chance you have it might be worth it to have a student or university honor board look at your case. \n\nI was in a similar situation where I got a zero on a final paper because a professor thought I had cheated by allowing someone to proofread my paper. I contacted the professors boss after the professor refused to change my grade back. I told the boss I was going to escalate to the honor board. A few days later my grade went back to its original score.", "author": "Jarboner69", "created": 1614416643, "upvotes": 3}, "goynjlk": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goynjlk/", "text": "I would be really upset so first, I’m sorry this happened to you. I think your first mistake was letting it slide that your partner waited so long to start the assignment. I hate group projects, I think we all do, but we still all have to get through them. In the future I would suggest staying on top of your partner early on. I know you said you were asking him to get started but there should have been regular communication about the progress of the protect etc. personally if I have a group project due in 3 days and haven’t received reassurance from my partner that their part is done or that progress has been made and they have a plan to finish on time I would have already voiced my concerns to my professor to give them a heads up of what I’m dealing with. If someone is starting a rather substantial midterm assignment two days before it’s due the chances are that they don’t intend to put a whole lot of effort into their work and the likelihood that they might cheat is definitely increased.", "author": "lch_xo", "created": 1614414858, "upvotes": 2}, "goyl3qj": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyl3qj/", "text": "Go to her boss and try to get her fired. Dipshit professors think they can get away with whatever but that isn't the case.", "author": "TheTrueQuarian", "created": 1614413338, "upvotes": 1}, "goyihog": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyihog/", "text": "I would try contacting the dean and explaining your situation, the only thing is your partner will probably get in more trouble if the dean is involved, but he also put you in this situation sooo...", "author": "Brodys-Boo", "created": 1614410891, "upvotes": 2}, "goyhjwv": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyhjwv/", "text": "If she won’t budge, go to the department chair and if that doesn’t work go to the dean and explain exactly what happened including the details with the hospital and why your part was late. Throw the other student under the bus it’s their fault for cheating and taking a two letter grade drop for their laziness is unacceptable. Don’t let them sweep it under the rug, bug whoever you need to until it is resolved.", "author": "mrcheese14", "created": 1614410056, "upvotes": 3}, "goyf37o": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyf37o/", "text": "For crying out loud they're a grown adult already. After four years of high school, how can anyone still not know by now that a) plagiarizing is a guaranteed fail, and b) Wikipedia is never considered a reliable source?\n\nI'm so sorry you had to go through that. Group projects can be a drag.", "author": "rtren_570", "created": 1614408455, "upvotes": 5}, "goy9y2f": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy9y2f/", "text": "What's with group assignments during a pandemic where we have to do online courses?  We can't rely on other people we only see on zoom who are less likely to respond to calls/texts/emails etc.  I'm beginning to think its more due to laziness and grading one project rather than for each student.  Its not fair for us, we're not the ones getting paid, we're paying the school and get stuck doing group projects over zoom?  Its almost laughable that this would even be allowed.", "author": "aaden08", "created": 1614404639, "upvotes": 12}, "goy6vje": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy6vje/", "text": "This isn't fair. She's not supposed to grade u because of one person cheated. I hope you get the justice u deserve", "author": "PuzzleheadedMail", "created": 1614403128, "upvotes": 3}, "goy54ao": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy54ao/", "text": "I’m a professor. You shouldn’t be penalized for a mistake your partner made. No way you could have known they cheated. You don’t have access to the tools we have. \n\nHere is what you do. First, get as much documentation as possible to prove your case. If you can forward the email of their contribution (since you said they sent you the parts and you sent in the compiler document) to show that the content came from the other student helps. Moreover, if you can get your partner to admit it, that’s the easiest route. You might be able to get them if you plead your case to your partner. I’ve had students come in in the past and state it was their fault with proof. Once you’ve collected this evidence, pass it on to your professor and write a professional (non confrontational) email. If she gives you a hard time, you go to both the department chair and dean of students. If that doesn’t work, DM me, there are other mechanisms in place. \n\nSorry, some professors are assholes.", "author": "BigBoosh37", "created": 1614402527, "upvotes": 8}, "goy39yc": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy39yc/", "text": "Both google docs and word have a revision history. Assuming you used one of these services pull it up and you can prove he was the one who added the plagiarism.", "author": "boulderss", "created": 1614401797, "upvotes": 5}, "goxzlbj": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxzlbj/", "text": "If you have anything written (text, groupme, email) stating who does which part of the assignmenbt, show her you did your part. Group assignments can really hurt a GPA.\n\nMake sure you communicate to the professor that you did everything you were suupose to do. If the prof still doesn't do anything THEN contact the department head.", "author": "kmars127", "created": 1614400264, "upvotes": 5}, "goxvhaj": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxvhaj/", "text": ">and chats with my partner saying that he will do that whole part\n\nSo you didn't contribute at all for the project?\n\nI'm confused. You said the project had 3 parts, and you would do the first 2, while your partner do the last one. Did you do the first 2?\n\nIf you did 2/3 of the project, and the 3rd part caused the project to fail, then show her the proof. If you have enough proof to separate your work from your partner's, then you have some ground for grade appeal.\n\n**But if you didn't make any contribution, then your professor is completely correct in not giving you any grade.** At best, you might not go down with your partner if your professor report this as an official academic dishonesty incident. (doesn't sound like she would do that.)", "author": "AcademicDifficulty", "created": 1614398846, "upvotes": 1}, "goxta3g": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxta3g/", "text": "What’s considered a pass?? 72 still sounds good to me", "author": "miszswimming", "created": 1614398121, "upvotes": -3}, "goxst5c": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxst5c/", "text": "I’ve tried to fight this sort of thing before without any luck. They’ll say that it is still your responsibility to review the assignment before submission and they’ll refuse any logic you give them. When I tried to fight it, they basically said “you can either take the 0 and this doesn’t have to leave the department or you can take it to an academic misconduct hearing which you really don’t want to do”. I hate to say it but unless you can get your partner to get down on their knees and beg the professor to take all of the blame I’m not sure there’s going to be a good resolution to this.", "author": "xthatguy339x", "created": 1614397969, "upvotes": 6}, "goxncxn": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxncxn/", "text": "You should have checked what your partner was submitting.", "author": "jaysonm007", "created": 1614396206, "upvotes": 4}, "goxmjkq": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxmjkq/", "text": "I won't be of help or maybe even support, it's true that the main responsible is your work partner for not being able to keep up with college/university work's basic standards, I hope there's a way to make them re do the class or something similar.\nIn some cases plagiarism is considered a crime, and the lowest thing you can do while in college, in some extreme cases they expell the student from the University, and that also affects their future possibilities for going into another university.\nPlease think that while this situation was BS, you can still better your grade and the consecuences could've been worse.\nMaybe there's a way to re do the work on your own? I don't really know how universities work outside of Latin America", "author": "Tuca1225", "created": 1614395948, "upvotes": 2}, "goxly9w": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxly9w/", "text": "There should be some sort of honor code hearing thing you can go to at your school. Maybe they can help you out if you prove you didn’t plagiarize, so you shouldn’t be punished for it.", "author": "rosiewitchy", "created": 1614395753, "upvotes": 2}, "goxl8xk": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxl8xk/", "text": "I nearly had this happen to me. Thank god I recognized the person I worked with clearly didn't have the level of writing capability and I reversed looked it up on Google. \n\nGently reminded them to reference, use their own words, because it's considered plagiarism. My luck that they actually pulled though and learned and made up for it. You can't fucking cheat especially with such a dumb tactic.\n\nIf I didn't cover my own ass I'd be in the same situation as you. Hopefully you can get it fixed but otherwise you can come out of this with that lesson in mind (I'm sure you already knew that though..)", "author": "Map-leaf", "created": 1614395526, "upvotes": 12}, "goxh7h0": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxh7h0/", "text": "All of that is true, however, that does not necessarily mean that the OP needs to bear it. At worst, he is guilty of academic misconduct through negligence, not academic dishonesty. There are obvious mitigating factors at play here and most people will see that. For a degree to be worthless, no action would have to be taken at all in a situation like this. You are creating a false dichonomy. You cannot just assume people have perfect foresight no matter how unexpected something is. Warnings exist for a reason.", "author": null, "created": 1614394129, "upvotes": 2}, "goxgkq3": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxgkq3/", "text": "That sucks bro", "author": "xyeIIow", "created": 1614393865, "upvotes": 0}, "goxfund": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxfund/", "text": "I think your next move is just to ask nicely if your professor can offer you some extra credit work.\n\nIn group projects you are supposed to work as a group. If you had worked together instead of just doing parts individually, you likely would have noticed the plagiarism. I'm very sorry about what you are going through outside of school, and I know this must feel unfair. Unfortunately, this is a pretty standard policy for group projects. \n\nIt's time to work your butt off and get that grade back up through other means.", "author": null, "created": 1614393540, "upvotes": 5}, "goxf02e": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxf02e/", "text": "It doesn't matter if your partner plagiarized, what matters is that YOU don't submit any plagarized work. You need to pay attention to what you submit. \n\nUnless if you submitted parts 2 and 3 and your partner submitted part 1 without your knowledge there's nothing much you can do.", "author": "academic96", "created": 1614393122, "upvotes": 4}, "goxeq5m": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxeq5m/", "text": "If I was you I would ask for a hearing with your school’s academic integrity board, and hire a lawyer. An academic integrity lawyer could get you off for this since you didn’t do the plagiarizing and you have proof.", "author": "ilikecacti2", "created": 1614392982, "upvotes": -1}, "goxduk7": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxduk7/", "text": "This is just another reason why group projects, especially during the pandemic, are a fucking waste of time.\n\nYour professor obviously just doesn’t want to do anymore work and you’re basically asking her to work overtime without pay. I bet the whole reason she assigned a group project was to only have to grade 1 item for multiple people - just like every tenured professor who assigns group projects.", "author": null, "created": 1614392484, "upvotes": 37}, "goxcqaz": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxcqaz/", "text": "Idk about yours but my university has a clear rule about that. If one of the members cheat you all get zero. Apparently we are supposed to check each other’s work. Tough luck.", "author": "MaleficentDistrict22", "created": 1614391833, "upvotes": 41}, "goxbsxd": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxbsxd/", "text": "Talk to a student advocate from you school. Judgements on academic misconduct (plagiarism) are often not left to the professor to make a judgment on (in the US). Good luck.", "author": "Thestruggleisfeels", "created": 1614391301, "upvotes": 15}, "goxb7fw": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxb7fw/", "text": "Did you submit the work?\n\nWhy on earth would anybody not run their assignments through a similarity/plagiarism test?", "author": "Jarrrad", "created": 1614390962, "upvotes": 4}, "goxa3r6": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxa3r6/", "text": "ooof thats rough. I hate group projects", "author": "iTrade_and_iGame", "created": 1614390337, "upvotes": 37}, "gox9x9u": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox9x9u/", "text": "How can you turn in a group project in two different languages? A group project means everyone takes responsibility for the entire project, it’s part of college and learning how to work in groups. If that guy thinks he can plagiarize from wiki none the less he should be taught a huge lesson and either get expelled or an f in the class. Plagiarizing is a huge mistake and no college let’s students get away with it. You being that persons partner should’ve looked it over. I would accept the grade and be glad you’re not getting an F in the class. Why didn’t he give credit to his source?", "author": null, "created": 1614390238, "upvotes": 10}, "gox9en6": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox9en6/", "text": "Under the bus your classmate goes. \n\nSeriously -- If everything here is true run them over with the bus. Back up over them. And then drive away over them again one more time for safe measure. \n\nCopy / pasting wiki this day in age is the DUMBEST thing to do in a college setting and if you do it you absolutely deserve to get fucked.", "author": null, "created": 1614389944, "upvotes": 161}, "gox79st": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox79st/", "text": "I had the same problem in two exercises I had to make last year and I have done nothing so far. I am also thinking about it... should I try something?", "author": "dzn_m", "created": 1614388746, "upvotes": 1}, "gox31nl": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox31nl/", "text": "What does the syllabus say about grading  group projects?  If it says that all students receive the same grade, all students receive the same grade: in this case, a zero. The expectation is that group-assigned work will be completed as a group, not divvied up and glued together at the last minute.  \n\n  \nI'm sorry about your uncle, but this is likely how your professor sees it.", "author": "Judythe8", "created": 1614386529, "upvotes": 27}, "gowzmm5": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowzmm5/", "text": "Take the situation with the department head. Aka if the employee wont listen to your complaints, demand her boss. I figured this out much after college, but if something doesnt feel right, you need to speak with the person up top.\n\nDont think of yourself as just a student, YOU ARE A CLIENT. You pay the school to assess your knowledge, the school is not above you. They work side by side with you. You aren't even just a customer, you are basically their partner. Sometimes its easy to forget. Explain the unfair situation with the department head, send them an email or call them. \n\nIve complained about a professor's credibility due to their sloppy and factually incorrect lectures, which resulted in the department head coming in to assess them in class. Ive gotten wrong information from school office clerks and had to speak to the department heads personally to get right answers about programs. Ive gotten denied from my program application, and also spoke to a department head about how I only needed one class in it to complete, which resulted in them letting me in after a short appointment. \n\nI have even stupidly FORGOTTEN to drop classes for a masters degree program and didnt find out I was enrolled until the semester ended, resulting in me owing tuition, but I came in and spoke to the necessary party, explained my unfortunate situation and did the necessary paperwork to get an application approved for tuition costs being removed.\n\nUnless you are speaking to someone at the very top of the chain, you need to speak up more. If the professor wont listen, go to their boss, their department head, make yourself heard. Im telling you right now, reading through the list of comments here and I see alot of BS. Forget the professor, talk to their department head. \n\nAs I said before, its easy to forget, especially if you are out of highschool where you have no voice or power. But in college, there are alot higher expectations for schools to adhere to. Professors are unwise to think they decide whats fair. So ask the department head to mediate. Best of luck, be brave and speak up.\n\nEdit: seeing some of the replys so let me say this. If you think you deserve to take the L and not do anything, then thats fine, learn a lesson by dropping 2 letter grades. If you already learned the lesson, its time to pursue action and start remedying the situation instead of letting your education fall apart.", "author": "bltbaybee", "created": 1614385306, "upvotes": 79}, "gowttyx": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowttyx/", "text": "Escalate it to an advisor and ask them what to do. Gather documentation from your uncle about the hospital visit as it will help your case. Keep escalating it one position up until you find someone that will help you. Request an oral exam on the essay content that you wrote to show that you did it. Offer to take a 25% penalty instead of a 0. If that fails, start a change.org position at the college to give them bad PR for not handling the case fairly using philosophical principles of utilitarianism.", "author": null, "created": 1614383422, "upvotes": 154}, "gowebsk": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowebsk/", "text": "That sucks but its up to you to check also. I run any writing in a group project through a plagiarism checker from grammarly. You should not be punished for cheating you did not do. I understand her POV if it was up to you and your partner you agreed to give them that task and they failed to do so.", "author": "Kirkthewebsurfer", "created": 1614378485, "upvotes": 16}, "gowdkdn": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowdkdn/", "text": "If what you’re saying is true, that only your partner used Wikipedia, then you should schedule a meeting with your professor to explain the situation. You might be able to increase your grade a bit.", "author": "dan-55", "created": 1614378249, "upvotes": 304}, "gow9125": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gow9125/", "text": "The issue seems to be that you're both responsible for the entirety of the work. If your partner agreed to do a section of it, you're still responsible for the final product.\n\nPractically, what you should do is bust ass for the remainder of the semester.\n\nAnd then consider the lower grade a relatively cheap price to pay for a very important lesson: Everything that can negatively impact you is your responsibility. It's like when you're walking and go to cross the street at a crosswalk. You still look both ways. Doesn't matter if drivers are supposed to yield to you; what matters is not getting hit by an inattentive driver.", "author": "bl1y", "created": 1614376832, "upvotes": 34}, "gow0kms": {"link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gow0kms/", "text": "Has you team member admitted to cheating? If you have proof that he was solely responsible for his part and there was no way you could’ve checked it the. You may have a leg to stand on. If you were to fight this, that you be your biggest obstacle explaining how you submitted the work without knowing that your partner cheated. Unless they come forward and say they did it all on their own. There’s nothing stopping anyone from assuming, yes your partner cheated but you knew and submitted anyway", "author": "smartwin02", "created": 1614374276, "upvotes": 738}}}