{
  "sid": "qgoa7o",
  "link": "/r/college/comments/qgoa7o/pretty_infuriated_right_now_for_my_group_project/",
  "title:": "Pretty infuriated right now. For my group project, I was the only one to add to our presentation, and nobody else did anything.",
  "text": "For my sales management class, we're at the point where we the students have to teach the class a particular section of a chapter in our textbook. We all agreed that we would work on one subsection for the presentation. It's due tomorrow and none of the other students added on this presentation except me. I finished my section of the PowerPoint, and nobody even started their's. It's 11:16 central time at the time I posted this and I got to go to bed and brace myself for the F on a group project.",
  "author": "Some1inreallife",
  "created": 1635308187,
  "updated": 1635457089,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hi7lug3": {
      "link": "/r/college/comments/qgoa7o/pretty_infuriated_right_now_for_my_group_project/hi7lug3/",
      "text": "Tell the professor if all else fails.",
      "author": "MetaBrains",
      "created": 1635310241,
      "upvotes": 5,
      "replies": {}
    },
    "hi7nu6x": {
      "link": "/r/college/comments/qgoa7o/pretty_infuriated_right_now_for_my_group_project/hi7nu6x/",
      "text": "Happens all the time. Group projects are hell. \nYou could send your teacher an e-mail tomorrow morning explaining the situation or you could tell them before the classe start.",
      "author": "Dravenya",
      "created": 1635311518,
      "upvotes": 5,
      "replies": {}
    },
    "hi7nl7o": {
      "link": "/r/college/comments/qgoa7o/pretty_infuriated_right_now_for_my_group_project/hi7nl7o/",
      "text": "same and im used to it by now, doing all the work because i need high mark to apply for scholarship",
      "author": "Catanddogg",
      "created": 1635311349,
      "upvotes": 2,
      "replies": {}
    },
    "hi7j121": {
      "link": "/r/college/comments/qgoa7o/pretty_infuriated_right_now_for_my_group_project/hi7j121/",
      "text": "I hear ya OP, that’s super frustrating. I always approach group projects like they’re individual work at this point. I’ve been let down too many times, hate to say it but I don’t trust anyone with my grades anymore. I hope you can talk to your prof and get some leniency if you can show you had an agreed upon plan they didn’t adhere to.",
      "author": "InsulinBlue",
      "created": 1635308574,
      "upvotes": 1,
      "replies": {}
    }
  }
}