{
  "sid": "qbz099",
  "link": "/r/college/comments/qbz099/gap_year_breaks/",
  "title:": "gap year/ breaks",
  "text": "has anyone taken significant time off from college to focus on other priorities like jobs/money/interests?? if so how do you feel about it and did you regret it? i’m in the process of doing that and i can’t help but feel so behind everyone even tho i have a job getting experience in different field than what i was studying.",
  "author": "xx_mich_xx",
  "created": 1634730564,
  "updated": 1634750228,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhcol5z": {
      "link": "/r/college/comments/qbz099/gap_year_breaks/hhcol5z/",
      "text": "I think most people being pumped into college should take at LEAST a year off before college. \n\nMy path wasn't that simple. I got into college right out of high school and ultimately dropped out. It's mostly due to not being ready for living on my own and all of that. It's overwhelming for young people. If you've watched this sub long enough, you'll see it pretty clearly. \n\nI took around 8 years off before coming back. Now that I'm back, the advantage is so clear. The work ethic I've learned over the past 8 years is invaluable. It's what literally makes college so much easier. \n\nI've built up plenty of social skills that a lot of my peers clearly lack. I could talk to anybody without ever feeling awkward or anything. I've made plenty of friends already and don't feel like it's difficult at all. In fact, in reading most these posts here about being lonely and not having friends I really feel like it's based out of lack of skill. 18-20 year olds have grown up in a controlled environment with people they've known for years if not most of their life. That makes it easier. Once they're thrown into college where that structure is gone, their social skills don't fit it anymore. \n\nI think it's important, as I've been observing this lately, is that at 32 I'm a lot better at not assuming that I'm a victim. I see it a TON on this sub. The victim identity is becoming more and more common and it's terribly unhealthy. I think I went through it in my early 20's as well to be honest. It's simply that \"I can't make friends because I'm Autistic or x or y.\" Those things just aren't true whatsoever but it puts the responsibility on something other than yourself to make friends. Young adults seem to want to push responsibility elsewhere. People start skipping class because of their depression even though skipping class is probably a large contributor to their depression. \n\nI think going into college at a more mature age probably has more value. My mindset into how I take the material in is way different. I'm no longer concerned so much with just getting the assignments finished. I'm VERY determined to fully understand the material. My learned work ethic has taught me to work through it until you get it. I generally work until 4:30 even on my days off. I treat it as a job. I definitely feel like I'm learning more and I know for a fact I'm getting better grades. I came from a 2.2 GPA when I dropped out and my first semester back I pulled a 4.0 and I've got all A's and a B this semester. The B is in a course that everyone always does poorly in. First exam I got 10% higher than the average. I'm happy with that. \n\nI don't regret it. I do regret waiting so long to go back though, but it had to happen. Everything had to happen to bring me to this point. Nothing could have gone differently. Now I've got 8 years of experience that contribute to my degree and I've got a better understand of the world and what it calls for. I highly suggest taking a few years before college to build skills that will highly benefit you in school.",
      "author": "Awkward_Mail_2786",
      "created": 1634731683,
      "upvotes": 2,
      "replies": {}
    },
    "hhcovec": {
      "link": "/r/college/comments/qbz099/gap_year_breaks/hhcovec/",
      "text": "I do not know if what I did is considered a break/gap year in your edefinition. I started college straight out of high school, then realised the major i was in wasnt the rught fit for me. So i quit uni to work for a while to figure out what to do with my life (other major, trade school etc.). Then started college again, a different major at a different university in a different city, 3 years after I started my first attempt at a degree.   \n\n\nFor me personally it helped a lot to figure myself out, work on myself (I had mental health issues aswell) and figure out what I wanted to do and achieve in life.   \nI started my current degree when i was 23 and i dont regret it. There are actually a lot of people my age or older in my class. I dont really mind behind \"behind\" other people, everyone moves at their own pace.   \n\n\nAND, even if someone gets their degree 4 year after finishing high school being \"on time\" and all that you never know if down the line they realise they are unhappy with their education choices etc. and start all over.",
      "author": "Odd-Tie6308",
      "created": 1634731857,
      "upvotes": 1,
      "replies": {}
    },
    "hhcp1lr": {
      "link": "/r/college/comments/qbz099/gap_year_breaks/hhcp1lr/",
      "text": "I did. My gap year was fall 2020 to spring 2021. I started at a new university as a sophomore in fall 2019 and I'm a junior this year. As for why.....didn't want to deal with pandemic college. I was a freshman for two years at community college and did not want to waste my last two years without the on campus experience. Do I regret it? No. College would have been hell in the 2020-2021 year anyway.",
      "author": "ComplexPurpose7",
      "created": 1634731960,
      "upvotes": 1,
      "replies": {}
    },
    "hhcurjg": {
      "link": "/r/college/comments/qbz099/gap_year_breaks/hhcurjg/",
      "text": "So I spent 2 years as an LDS missionary, so I guess that could be considered a break. I did 1 year of college, went on my mission, and then came back to school for my last 3 years. I think the important thing is that if you take a gap year, you need to maximize your learning experience from it.\n\nDon't take a gap year and just work at fast food to save money. Don't take a gap year for fun or because you \"deserve it\". Take a gap year to explore a job/industry you are really interested in. Take a gap year to get real work experience. Take a gap year to make good money and save for college to avoid debt. Take a gap year for personal development, networking, etc. Basically, imagine you're in an interview for your dream job and they ask \"Why did you take that gap year?\", Your answer should not be an excuse, or even an explanation, it should be an undeniable advantage to why they should hire you.",
      "author": "Thelton26",
      "created": 1634735095,
      "upvotes": 1,
      "replies": {}
    }
  }
}