{
  "sid": "qzeglf",
  "link": "/r/college/comments/qzeglf/the_semester_is_almost_over_but_im_struggling/",
  "title:": "the semester is almost over but I'm struggling",
  "text": "This semester is by far the worst I've ever done in school. I'm trying, I really am. I just feel like there's no point. I still crave academic validation and knowing that I most likely won't get all A's this semester because I've been slacking off is really getting to me. My depression and anxiety have also spiked and I'm just not doing well. I never post on Reddit but right now, I don't know what else to do. I have no one to talk to and I'm alone.",
  "author": "Minniemy012",
  "created": 1637560531,
  "updated": 1637689057,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.94,
  "comments": {
    "hlly7jd": {
      "link": "/r/college/comments/qzeglf/the_semester_is_almost_over_but_im_struggling/hlly7jd/",
      "text": "Don’t know if you still need it but DM if you get a chance.",
      "author": "Midnightrise_02",
      "created": 1637561353,
      "upvotes": 3,
      "replies": {}
    },
    "hlmwyru": {
      "link": "/r/college/comments/qzeglf/the_semester_is_almost_over_but_im_struggling/hlmwyru/",
      "text": "Evaluate your study habits. Are you getting assignments done before the day they are due? Are you being proactive with your studying?\n\nI find that I personally start to get stressed when I don't stay ahead. If I get to the point that I'm worried if I'll get stuff done on time, I've waited way too long. I've kind of made a decree for myself that I get things done early, simply so I don't experience stress. \n\nA lot of anxiety and depression can be reduced by assuming the responsibility of your course work, and taking care of it. I really don't think there's a better feeling than getting an assignment done early and turning it in. There's a huge spike of validation right there and it makes you feel good! \n\nI see a ton of posts regarding anxiety and depression on this sub. The majority of posts seem to have the same flavor as yours. There's a struggle with slacking off compiled with feelings that nothing matters. In the end, people are digging a hole below their feet that starts getting too deep to see out. \n\nI really think that if you can start small and start building your good academic habits back up, you can make a lot of the bad feelings subside. Small successes add up to be meaningful. Once you take responsibility and take care of things, you'll get a nice dump of dopamine to make you feel good. \n\nDon't get me wrong. It may seem impossible. The amount of work to get caught up won't be as much as you think. The amount of work to stay ahead is *literally* the same amount of work it takes to stay behind. The assignments still need to be done either way. Getting them done a day earlier isn't any more work but it does require more discipline.",
      "author": "Awkward_Mail_2786",
      "created": 1637587938,
      "upvotes": 2,
      "replies": {}
    },
    "hlm84by": {
      "link": "/r/college/comments/qzeglf/the_semester_is_almost_over_but_im_struggling/hlm84by/",
      "text": "I am feeling the same. My messages are open if you want to talk more!",
      "author": "scxllymxlder",
      "created": 1637568744,
      "upvotes": 1,
      "replies": {}
    }
  }
}