{
  "sid": "qguc5b",
  "link": "/r/college/comments/qguc5b/advice_needed_medicine_or_physics_and_mathematics/",
  "title:": "Advice needed: medicine or physics and mathematics?",
  "text": "Hello!\n\nI would like some advice regarding my choice of subject to study. Some initial info: I would say I \"love\" physics and mathematics as subjects to study, and I \"really like\" medicine as a subject. Last year I studied math and physics as a double bachelor for one year and I enjoyed it. This year I quit those two and started studying medicine. I have noticed that the medical material so far has not been engaging me as much as last year, and I am contemplating going back to math and physics. I have heard from a lot of other medical students, however, that the first year is quite boring but that it gets better later on. I have to add that I like the idea of being a doctor for a living (I think). I am attracted to the interaction with patients, the sometimes stressful working conditions that require a cool calm and collected attitude (which I have) and the technical challenges in specialties such as surgery or emergency medicine. Furthermore, the career-prospects of math and physics have been less clear for me. An office job doesn't appeal very much to me at the moment compared to a job in hospital taking care of interesting cases.\n\nBasically it comes down to this:\n\nI love the idea of becoming a doctor, but the medical material doesn't interest me as much as the math and physics from last year about which I used to get pretty excited (and still do). However, I feel like a career in math and physics (or economics/econometrics) would not stimulate my people skills, so to speak, and could possibly be a bit \"boring\" compared to an exciting job as a doctor.\n\nMy options:\n\n1. Finish this year of medicine to get a better impression of what the courses are like and decide at the end of the year if I want to go continue or not. Downside: I am studying something that up until now has not interested me as much as last year (there are about two or three medical courses which I look forward to, but a lot that I don't)\n2. Drop medicine and take up math and physics again. Downside: I completely give up becoming a doctor.\n3. Delay the decision, study medicine for a year or two and then combine it with math and physics (I know someone who has done this so it is possible and manageable).\n\nI am really struggling to make a decision and would love to hear your opinions.",
  "author": "carlojacobs",
  "created": 1635333457,
  "updated": 1635457090,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hi8gmle": {
      "link": "/r/college/comments/qguc5b/advice_needed_medicine_or_physics_and_mathematics/hi8gmle/",
      "text": "I think it all comes down to what kind of dr you want to  be - will you want to work in a hospital that is strong in research so you can improve patient outcomes and clinical care by performing studies - the tools to perform quantitative analysis is something you would learn in math like statistics. \nIf you want to do nuclear medicine then studying physics will help you gain a deeper understanding and appreciation of the physical process that are taking place and perhaps come with improvements or new ideas.",
      "author": "fella85",
      "created": 1635334288,
      "upvotes": 0,
      "replies": {
        "hi8j0wh": {
          "link": "/r/college/comments/qguc5b/advice_needed_medicine_or_physics_and_mathematics/hi8j0wh/",
          "text": "So far the clinical work appeals more to me than medical research, since I am not really that interested in stuff like pathology and cell biology (which is quite common among medical students as I have heard).",
          "author": "carlojacobs",
          "created": 1635335774,
          "upvotes": 0,
          "replies": {
            "hi8j5mg": {
              "link": "/r/college/comments/qguc5b/advice_needed_medicine_or_physics_and_mathematics/hi8j5mg/",
              "text": "I am interested in it on a clinical level.",
              "author": "carlojacobs",
              "created": 1635335854,
              "upvotes": 1,
              "replies": {}
            },
            "hi8nngk": {
              "link": "/r/college/comments/qguc5b/advice_needed_medicine_or_physics_and_mathematics/hi8nngk/",
              "text": "With pathology and in-vitro, I feel there are more basic science aspects of medicine.\nLet’s say you want to understand the variation in treatment received by patients with bronchiolitis coming to emergency.\nYou can do a prospective study that collects on everyone that presents with the condition and run an analysis to see what are the reasons behind the variation.",
              "author": "fella85",
              "created": 1635338369,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}