{
  "sid": "osvg0l",
  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/",
  "title:": "What’s the worst icebreaker/activity you’ve ever had to do?",
  "text": "I’ve had some bad ones when I was a student…",
  "author": "catscience247",
  "created": 1627420663,
  "over_18": false,
  "upvotes": 612,
  "upvote_ratio": 0.99,
  "comments": {
    "h6x8c0e": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6x8c0e/",
      "text": "During college orientation we had to play the game where you evolve from an egg to a chicken to a dinosaur to a human based on your performance in rock paper scissors. Don't even know why we did it because we didn't learn each other's names any better.",
      "author": "Longjumping-Math9685",
      "created": 1627535681,
      "upvotes": 1,
      "replies": {}
    },
    "h6x14f6": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6x14f6/",
      "text": "Spelling your name out with your ass in front of everybody at camp. Who tf thought of that shit nobody wants to sit through shaking butts for 30 minutes.",
      "author": "Dimsum_Boi",
      "created": 1627531140,
      "upvotes": 1,
      "replies": {}
    },
    "h6vjhfl": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vjhfl/",
      "text": "In church youth group while I was in middle school we played a game where the objective was to pass a dog treat to the mouth of the person to the right using only your teeth until it got to the other side of the room. Luckily they split guys and girls but still extraordinarily awkward nevertheless.",
      "author": "TwistedCube49",
      "created": 1627505231,
      "upvotes": 1,
      "replies": {}
    },
    "h6vj84h": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vj84h/",
      "text": "There was one where we had to stand in a line and start with the person saying their names and a object that starts with the beginning letter of their name. (ex Alex Apple). When it got to you, you were to recite from the beginning to you each persons name along with the object. And then say your name with a object until it gets to the last person who repeats everyone’s name and object. Someone who is terrible with remembering names this was an absolute stuttering nightmare.",
      "author": "TelevisionOk8974",
      "created": 1627505121,
      "upvotes": 1,
      "replies": {}
    },
    "h6v25me": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v25me/",
      "text": "Do a \"simple\" cheerleading pose. \n\n1. Stand on 2 of your friends thighs while they kneel with one knee on the ground \n\nOr \n\n2. Let a cheerleader carry you and stand on his shoulders. \n\nWent to the toilet... never came back for 2 hours. Wtf",
      "author": "junglelady2",
      "created": 1627497917,
      "upvotes": 3,
      "replies": {}
    },
    "h6uzvsw": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uzvsw/",
      "text": "Form a giant 50+ person circle by laying on the lap of the person next to you and then have someone else lay on top of your lap. Absolute worst thing ever.",
      "author": "bnb5296",
      "created": 1627496976,
      "upvotes": 1,
      "replies": {
        "h6v21mb": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v21mb/",
          "text": "Oh hell no...",
          "author": "catscience247",
          "created": 1627497871,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6usk9j": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6usk9j/",
      "text": "Honestly any ice breaker in general. Introverts worst nightmare",
      "author": "strawberry_2703",
      "created": 1627493931,
      "upvotes": 1,
      "replies": {}
    },
    "h6ur93v": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ur93v/",
      "text": "This might not qualify as an icebreaker but the worst intro activity we had to do was my freshmen year during welcome week. I went to a Catholic college my freshmen year. Because they had to explain title IX, instead of just telling us what counts as rape or sexual assault, they had kids from the state school come and put on a play about a girl who gets sexually assaulted by a friend and then did character Q&A after. The acting was surprisingly good, but the lines were so cringy, I had to keep myself from laughing. \n\nThe professors said if anything wanted to leave they could but idk if people left because they found it cringey or if they were legitimately triggered. \n\nI transferred to the state school my second year and when it came time for them to explain title IX, we literally just got a brochure and were told where to get condoms if we needed any. For reference, the Catholic school didn’t give out condoms and you weren’t allowed to have opposite sex overnight visits. they could refer us to a health organization, albeit a lot of the ones on the list they gave were crisis pregnancy centers.",
      "author": "CapriciousSalmon",
      "created": 1627493393,
      "upvotes": 3,
      "replies": {}
    },
    "h6ubuti": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ubuti/",
      "text": "This isn't as awful as some on here, but any icebreaker that requires us to stand in a circle and hold hands. My hands got clammy really fast.",
      "author": "Quiet-Use989",
      "created": 1627487094,
      "upvotes": 4,
      "replies": {}
    },
    "h6uapro": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uapro/",
      "text": "I was an Orientation Team Leader and some of the activities we were instructed to do were pretty bad, but the worst was the ***circle sit***. \n\nWe gathered several groups together (maybe 30 people), got in a circle shoulder-to-shoulder, turned to the left so that we were all facing the same direction, stepped in toward the center of the circle to get closer (because it wasn't awkward enough already), ***sit down on the person's knees behind you*** (while the person in front sits on yours), and then take steps forward....I mean, it broke the ice and *instantly* united all of the incoming students against the Orientation Team leaders!",
      "author": "Esmereldista",
      "created": 1627486623,
      "upvotes": 5,
      "replies": {}
    },
    "h6ua1io": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ua1io/",
      "text": "We had to write three things we liked. Crumpled the paper and threw it somewhere in the class. Then we had to pick up a random paper, read it and guess who the person was based on the three things they liked. So we had to “meet” our classmates. Except most people threw their own paper 3 feet from their desk and grabbed their own and some assholes threw the papers at girls heads but they were “aCcidEnTs”.\n\nEdit: also some people wrote their likes as “I like cats. I like dogs. I like my mom” so it sort of became impossible to even find people based on such a generic list. It was a disaster and so embarrassing.",
      "author": "localscreamqueen",
      "created": 1627486344,
      "upvotes": 4,
      "replies": {}
    },
    "h6u5caw": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u5caw/",
      "text": "I still have nightmares about this. \n\nIt's a group game that teaches communication. You all stand in a circle, grab the hand of the person in front of you, then grab the hand of the person next to you, and you have to untangle yourself. \n\nYou just met this group of strangers and now your ass is in their face is in someone else's crotch. You're trying not to fart or kick someone in the head while you straddle two complete strangers' arms. You're SWEATING. So. Much. Sweat. All because you wanted to join a leadership club to add to your resume. \n\nFuck this game.",
      "author": "The-J-StandsForJiant",
      "created": 1627484331,
      "upvotes": 6,
      "replies": {}
    },
    "h6u2ydl": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u2ydl/",
      "text": "We had to go around the circle and sing a verse of Twinkle Twinkle Little Star. Some people, including myself, refused and got roasted by the professor",
      "author": "coldaloe",
      "created": 1627483302,
      "upvotes": 2,
      "replies": {}
    },
    "h6tzdgd": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tzdgd/",
      "text": "“Introduce yourselves”",
      "author": "IndependentAd2522",
      "created": 1627481726,
      "upvotes": 2,
      "replies": {}
    },
    "h6ttwwx": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ttwwx/",
      "text": "Any time I have to come up with three interesting facts about my boring life",
      "author": "sgRNACas9",
      "created": 1627479163,
      "upvotes": 9,
      "replies": {}
    },
    "h6trd7o": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6trd7o/",
      "text": "One time we had to all sit in a circle. Basically we’d go around the circle, and say our name and what we ate for breakfast. Once we got through the whole circle, you had to go through it AGAIN. The only difference was that the person starting off the circle again had to go around the circle, list everyone’s name, then what they ate. Then the second person in the circle would do the same thing and so on and so fourth. \n\nI hated this game so bad because if you forgot someone’s name or what they ate everyone just stared at you. It was like a memorization game. And I feel like that puts you on the spot when you’re just learning everybody.",
      "author": "bluarrow7",
      "created": 1627477872,
      "upvotes": 9,
      "replies": {}
    },
    "h6tqb1a": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tqb1a/",
      "text": "We had to sing a few lines of whatever song we chose in front of the room and explain how that represents us. If you don't want to sing though, you're free to dance. It was just embarrassing.",
      "author": "iceketball27",
      "created": 1627477317,
      "upvotes": 6,
      "replies": {}
    },
    "h6tpmev": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tpmev/",
      "text": "we were doing icebreakers and a girl told me that her cat has aids",
      "author": "cacklinrooster",
      "created": 1627476951,
      "upvotes": 6,
      "replies": {}
    },
    "h6tgdnv": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tgdnv/",
      "text": "Dance while repeating a single line from a movie for a whole minute.......solo........on stage......infront of the whole college.",
      "author": "SmellsLikeTeenSweat",
      "created": 1627471233,
      "upvotes": 11,
      "replies": {
        "h6va5hp": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6va5hp/",
          "text": "I would literally rather join the marine corps and face whatever hell they have in store for me",
          "author": "SleighBellss",
          "created": 1627501310,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6t0xx6": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6t0xx6/",
      "text": "[deleted]",
      "author": null,
      "created": 1627458064,
      "upvotes": 9,
      "replies": {
        "h6ua62y": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ua62y/",
          "text": "Were these all at the same school? They sound truly awful!",
          "author": "Esmereldista",
          "created": 1627486397,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h6t0fvm": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6t0fvm/",
      "text": "The human knot where we have to untangle our arms & legs. Never successfully completed it!",
      "author": "jt1818",
      "created": 1627457637,
      "upvotes": 6,
      "replies": {}
    },
    "h6syf3p": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6syf3p/",
      "text": "we had to go up in front of a class of about 40 people and perform an interpretive dance that we came up with that represented our major and hobbies and people had to guess what they were\n\nif it didn't look enough like a dance and more like acting out movements, the professor would make you start over",
      "author": "SleighBellss",
      "created": 1627455909,
      "upvotes": 7,
      "replies": {}
    },
    "h6sxkq0": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sxkq0/",
      "text": "Spell my name out using my fucking ass in the air and it was the most embarrassing shit because my name has nine letters 😭💀🥴",
      "author": "theneighbourhoodthot",
      "created": 1627455212,
      "upvotes": 16,
      "replies": {
        "h6ub8zv": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ub8zv/",
          "text": "Butt charades! This game is a lot more fun if you’re spelling out a word and people are trying to guess it against another team",
          "author": "POO1718",
          "created": 1627486845,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h6ssfiu": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ssfiu/",
      "text": "The one where we had to stand in a circle and hold hands... and I ended up having to hold 2 sweaty dudes' sweaty hands because we were supposed to be passing messages like that. Ueugh!",
      "author": "imsorryifellasleep",
      "created": 1627451256,
      "upvotes": 10,
      "replies": {}
    },
    "h6spytp": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6spytp/",
      "text": "The whole use an adjective to describe yourself game. Then you went around the circle and repeated everyone's adjective plus their name before saying yours. Just... blegh. Very corny lol",
      "author": "Competitive-Course45",
      "created": 1627449530,
      "upvotes": 5,
      "replies": {}
    },
    "h6sox7w": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sox7w/",
      "text": "Anyone who's taken a lot of math courses will understand this...\n\nI forgot the name of this course but we were called randomly, had to go up to the board, introduce ourselves and what our major is, than had to solve a proof in front of everyone. \n\nI had no fu****g idea how to even start it and felt so embarrassed because the 2 people in front of me did it in seconds. It still gets my anxiety up thinking about it.",
      "author": "kluda06",
      "created": 1627448825,
      "upvotes": 24,
      "replies": {
        "h6wt64m": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6wt64m/",
          "text": "Oh god…. This made me anxious just thinking about it",
          "author": "Few_Entrepreneur_459",
          "created": 1627526790,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6sot76": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sot76/",
      "text": "I know this is the exact opposite of what you asked for lmfao BUT the BEST icebreaker I ever did was move-in day of freshman year at the dorms because I met my now-fiancé!! They put the building’s residents into 2 big lines and shouted a question, then you had a minute to discuss it with the person opposite from you and then you shifted over to the next person. We got paired up and the rest is history!",
      "author": "more-asbestos",
      "created": 1627448754,
      "upvotes": 13,
      "replies": {}
    },
    "h6snli4": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6snli4/",
      "text": "This wasn't an icebreaker but an in-class assignment. We had to publicly rate our own attractiveness and intelligence. To exactly nobodies surprise, everyone overrated themselves.",
      "author": "Ben__Diesel",
      "created": 1627447978,
      "upvotes": 31,
      "replies": {
        "h6sy1ab": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sy1ab/",
          "text": "i would shit my pants",
          "author": "SleighBellss",
          "created": 1627455590,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "h6sm2uh": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sm2uh/",
      "text": "This particular icebreaker happened quite frequently in high school where we started with one end of the room and had to say our name and the next person would say their own and all the ones prior to them. It was alright if you went first, but awful if you were last.\n\nSome teachers even had us say our name and something we like that begins with the same letter as our first name (i.e. “Sierra, sour patch kids”)\n\nNot fun because you were nervous the whole time that you were going to mess up someone’s name and this ice breaker took way too long.\n\nOn top of that, if you went to a large high school like me, a lot of people did not know one another, so it wouldn’t make things easier 😂",
      "author": "coolchickstar",
      "created": 1627447013,
      "upvotes": 6,
      "replies": {}
    },
    "h6sln6g": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sln6g/",
      "text": "Anything that involves singing is automatically terrible.",
      "author": "K3yB0ard5eizur3",
      "created": 1627446745,
      "upvotes": 8,
      "replies": {}
    },
    "h6skxeh": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6skxeh/",
      "text": "Go to church. I'm not religious, I've gone to church with 2 different ex girlfriends and it was so uncomfortable. I knew they wanted me to go because the experience meant a lot to them, and I understand why people like to or feel they need to go to church, but it's just not for me.",
      "author": "WhatABlake",
      "created": 1627446307,
      "upvotes": 4,
      "replies": {}
    },
    "h6sjeas": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sjeas/",
      "text": "During my freshman welcome week, I remember the worst one being an activity that involved toilet paper.\n\nThey told us to grab as much as we wanted, and once everyone got their piece, they explained to us that for each square, we would have to tell one 'interesting fact' about ourselves. It was...very, very difficult to make up 15 things on the spot.\n\nThe other usual yet awful icebreakers are the 'name, major/minor, year, and 1 interesting fact.' The only relatively interesting thing about me is that I have 6 birds, but I'm usually met with weird stares. Fun stuff.",
      "author": "Greasy_Panic",
      "created": 1627445396,
      "upvotes": 21,
      "replies": {
        "h6u9w6g": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u9w6g/",
          "text": "We did this one, too, but they told us to grab how much we use....awkward!",
          "author": "Esmereldista",
          "created": 1627486281,
          "upvotes": 3,
          "replies": {
            "h6v4pwk": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v4pwk/",
              "text": "Take nothing and say you use a bidet",
              "author": "catscience247",
              "created": 1627498994,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h6sandy": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sandy/",
      "text": "I hate anything that has to do with remembering people’s name. It’s embarrassing for both parties.",
      "author": "YesCoconutWater",
      "created": 1627440579,
      "upvotes": 18,
      "replies": {
        "h6us7e8": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6us7e8/",
          "text": "I had to do a thing when I transferred schools where we had to tell the person next to us what our name meant. I think they did it because there were a lot of international kids, but I honestly don’t know what my name means without googling it. I could say there’s a biblical queen with my name, but I was literally named after a First Lady and some obscure rapper my mom used to listen to.",
          "author": "CapriciousSalmon",
          "created": 1627493784,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6s5t2u": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s5t2u/",
      "text": "Literally made us sit in a kindergarten circle and dance in front of the people in our split up groups.\n\nWe were just freshman\n\nIt was the freshman welcoming party at night\n\n\nI can't dance\n\n\nNeither could many others\n\n\nLord make me forget the cringe",
      "author": "peyott100",
      "created": 1627438121,
      "upvotes": 43,
      "replies": {
        "h6sc9y0": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sc9y0/",
          "text": "Dance in front of people? Oh God",
          "author": "selena_hillard",
          "created": 1627441445,
          "upvotes": 14,
          "replies": {
            "h6sceuh": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sceuh/",
              "text": "I'm not joking\n\nThe campus has a huge athletic center and we were crammed into one of the bigger ones on campus and had to do this",
              "author": "peyott100",
              "created": 1627441518,
              "upvotes": 4,
              "replies": {
                "h6scktk": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6scktk/",
                  "text": "I’m so sorry you went through that because yikes",
                  "author": "selena_hillard",
                  "created": 1627441607,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "h6sz7f5": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sz7f5/",
          "text": "I had an icebreaker for some class where they made us learn a song and sing it…if it looked like people weren’t singing, they’d stop us and make us start over.",
          "author": "catscience247",
          "created": 1627456573,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h6s3713": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s3713/",
      "text": "Name, pronouns, major, where you're from, fun fact about yourself and open up your camera in an online zoom class of 40 people. Almost took the entire class time",
      "author": "GoldRequest",
      "created": 1627436819,
      "upvotes": 34,
      "replies": {
        "h6use1d": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6use1d/",
          "text": "My history of American economics teacher did a version of this that took five minutes: write that stuff down on a card and give it to him. He was a pretty chill dude and I took his class again for LGBTQ American history.",
          "author": "CapriciousSalmon",
          "created": 1627493860,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h6s2w3p": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s2w3p/",
      "text": "I hate the telephone game. I always get someone who says something gross or makes no sense and then I have to repeat it.",
      "author": "Kirbylover16",
      "created": 1627436667,
      "upvotes": 31,
      "replies": {}
    },
    "h6s2les": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s2les/",
      "text": "All of them 😂🤷🏻‍♀️",
      "author": "Throwawayaccounttt__",
      "created": 1627436520,
      "upvotes": 6,
      "replies": {}
    },
    "h6s0mcg": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s0mcg/",
      "text": "I sit near the back of the class so I can leave fast if they tell us to do these",
      "author": "KING_COVID",
      "created": 1627435535,
      "upvotes": 13,
      "replies": {}
    },
    "h6rzt1b": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rzt1b/",
      "text": "Once when I was about 16 I went to a college acting workshop to learn the Meisner technique... We had to choose a partner (a stranger), sit crosslegged with our knees touching, and stare deeply into each other's eyes for about 25 minutes (no laughing or talking allowed). Then we had to take turns complimenting each other. There was some other stuff that I think I've blocked out due to the trauma.\n\nIt certainly broke the ice, but it also broke me a little bit.",
      "author": "SnooMaps460",
      "created": 1627435133,
      "upvotes": 57,
      "replies": {
        "h6tluy1": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tluy1/",
          "text": "I had to do this in my Intro to Counseling class, but you also had to figure out what the person was feeling",
          "author": null,
          "created": 1627474821,
          "upvotes": 8,
          "replies": {}
        },
        "h6upute": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6upute/",
          "text": "Did you’re teacher get inspiration from falcon and the winter soldier?",
          "author": "CapriciousSalmon",
          "created": 1627492818,
          "upvotes": 3,
          "replies": {
            "h6v2o94": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v2o94/",
              "text": ">falcon and the winter soldier\n\nI don't know what this is!\n\nAnd honestly, I probably could've just begun AND ended the story with \" I went to a college acting workshop\" ...",
              "author": "SnooMaps460",
              "created": 1627498134,
              "upvotes": 2,
              "replies": {
                "h6vxxhd": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vxxhd/",
                  "text": "There’s a scene in the show where Bucky and Sam basically have to attend counseling and it consists mostly of them staring at each other. They both fail.",
                  "author": "CapriciousSalmon",
                  "created": 1627511613,
                  "upvotes": 1,
                  "replies": {
                    "h6w7m69": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6w7m69/",
                      "text": "Oof, yeah maybe they took some inspo lol",
                      "author": "SnooMaps460",
                      "created": 1627516235,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6rz4z3": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rz4z3/",
      "text": "hug the person next to me for three minutes. like what the fuck was that",
      "author": "babylainey1",
      "created": 1627434803,
      "upvotes": 589,
      "replies": {
        "h6sc32q": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sc32q/",
          "text": "What the fuck, by far the worst one I’ve read",
          "author": "selena_hillard",
          "created": 1627441344,
          "upvotes": 169,
          "replies": {
            "h6t9e89": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6t9e89/",
              "text": "to meet different people",
              "author": "anuarkm",
              "created": 1627465576,
              "upvotes": 34,
              "replies": {
                "h6tvvk0": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tvvk0/",
                  "text": "If you get this wrong one more time, I'm segregating this school",
                  "author": "MSBCOOL",
                  "created": 1627480119,
                  "upvotes": 21,
                  "replies": {
                    "h6ubb6b": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ubb6b/",
                      "text": "Hands down my favorite episode! 6SeasonsAndAMovie",
                      "author": "ehall4945",
                      "created": 1627486870,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "h6tkweo": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tkweo/",
                  "text": "Sly community reference?",
                  "author": "ehall4945",
                  "created": 1627474232,
                  "upvotes": 8,
                  "replies": {}
                },
                "h6v90t9": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v90t9/",
                  "text": "I’ve made bald friends!",
                  "author": "Beanpole513",
                  "created": 1627500832,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h6soqlm": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6soqlm/",
          "text": "No no no no no. What if someone has bedbugs? Scabies? Grookey hands?\n\nNinja edit: definitely meant to write gropey hands, but grookey hands are also a legitimate concern.",
          "author": "TyNyeTheTransGuy",
          "created": 1627448709,
          "upvotes": 71,
          "replies": {
            "h6tyrvf": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tyrvf/",
              "text": "yeah he has small lil fingers that would creep me out on a person",
              "author": "succsuccboi",
              "created": 1627481455,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "h6suddd": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6suddd/",
          "text": "This gives me the heebie-jeebies. I would have gone home at that point no thank you.",
          "author": "labcoatsonhomie",
          "created": 1627452694,
          "upvotes": 25,
          "replies": {}
        },
        "h6su6mw": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6su6mw/",
          "text": "Gave this the hugz award, appropriately enough",
          "author": "Anti1447",
          "created": 1627452549,
          "upvotes": 16,
          "replies": {}
        },
        "h6su60o": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6su60o/",
          "text": "Yooo wtf lmao",
          "author": "shrimpynut",
          "created": 1627452537,
          "upvotes": 14,
          "replies": {}
        },
        "h6sxk9h": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sxk9h/",
          "text": "three minutes...",
          "author": "iamsojellyofu",
          "created": 1627455202,
          "upvotes": 12,
          "replies": {}
        },
        "h6u5z7k": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u5z7k/",
          "text": "Covid be like 👀",
          "author": "HahaStoleUrName",
          "created": 1627484612,
          "upvotes": 6,
          "replies": {}
        },
        "h6sdktz": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sdktz/",
          "text": "Why is this not top comment",
          "author": "Mastious",
          "created": 1627442148,
          "upvotes": 24,
          "replies": {}
        },
        "h6v78xg": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v78xg/",
          "text": "This is one of those cases where we thank corona",
          "author": "xd0429",
          "created": 1627500077,
          "upvotes": 5,
          "replies": {}
        },
        "h6uhgpw": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uhgpw/",
          "text": "omg",
          "author": "Queasy_Repair251",
          "created": 1627489399,
          "upvotes": 3,
          "replies": {}
        },
        "h6ulebe": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ulebe/",
          "text": "🤮",
          "author": "Srqjeb",
          "created": 1627490992,
          "upvotes": 3,
          "replies": {}
        },
        "h6v3too": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v3too/",
          "text": "I would have straight up said no",
          "author": "Hopeful-Helicopter24",
          "created": 1627498615,
          "upvotes": 3,
          "replies": {}
        },
        "h6v3y5m": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v3y5m/",
          "text": "So I guess this was clearly before the covid times",
          "author": "Regi413",
          "created": 1627498668,
          "upvotes": 3,
          "replies": {
            "h6v40ub": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v40ub/",
              "text": "many moons before",
              "author": "babylainey1",
              "created": 1627498699,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h6sujjq": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sujjq/",
          "text": "[removed]",
          "author": null,
          "created": 1627452825,
          "upvotes": 1,
          "replies": {}
        },
        "h6un104": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6un104/",
          "text": "I would’ve walked out of class cause wtf",
          "author": "bottledbed",
          "created": 1627491653,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6rwz33": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rwz33/",
      "text": "Had to tell people our favorite color….",
      "author": "willbio",
      "created": 1627433736,
      "upvotes": 4,
      "replies": {}
    },
    "h6rwdlp": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rwdlp/",
      "text": "It was in high school but the teacher literally made us pick a rock out of a tub and introduce our pet rock to the class. I was cringing the whole time.",
      "author": "gtrman571",
      "created": 1627433436,
      "upvotes": 32,
      "replies": {
        "h6sdmrr": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sdmrr/",
          "text": "Did you get to keep the rock?",
          "author": "maibagels",
          "created": 1627442178,
          "upvotes": 10,
          "replies": {}
        },
        "h6us9su": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6us9su/",
          "text": "Yeah ngl, I like that idea. It reminds me of those Elmo and Rocco memes.",
          "author": "CapriciousSalmon",
          "created": 1627493812,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6rw32h": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rw32h/",
      "text": "Tied between “what type of instrument are you?” and “what type of cheese are you?”",
      "author": "TheStockMeerkat",
      "created": 1627433293,
      "upvotes": 33,
      "replies": {
        "h6tv02f": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tv02f/",
          "text": "Im a Buffalo Di Mozzarella myself",
          "author": "mexicandemon2",
          "created": 1627479699,
          "upvotes": 6,
          "replies": {}
        },
        "h6vjrdr": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vjrdr/",
          "text": "So BuzzFeed quizzes basically",
          "author": "TwistedCube49",
          "created": 1627505346,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h6rv5yt": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rv5yt/",
      "text": "Step up to the line\n\nWe all stood in a loose circle with a smaller circle in the middle. Whenever you agreed with or identified with a phrase, you were supposed to step to the smaller circle. Then you would step back.\n\nThese ranged from \"I identify as famale\" to \"I follow liberal politics most closely\" to \"people of the GRSM deserve to have the same rights\" to \"I don't get along with my parents\". It was awkward as Hell and people refused to look at others because some of the questions were really personal.",
      "author": "SnapdragonPBlack",
      "created": 1627432831,
      "upvotes": 24,
      "replies": {
        "h6spwth": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6spwth/",
          "text": "Nice to give you the chance to make enemies the first day of class, I guess",
          "author": "TyNyeTheTransGuy",
          "created": 1627449494,
          "upvotes": 12,
          "replies": {
            "h6tcill": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tcill/",
              "text": "Definitely gave me a heads up on who to avoid I guess",
              "author": "SnapdragonPBlack",
              "created": 1627468247,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "h6rv2hj": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rv2hj/",
      "text": "we were given a random object and had to make noises imitating it and everyone else had to guess what it was. except they weren't things that made noises, it was stuff like \"fire hydrant\"",
      "author": "ekwater",
      "created": 1627432783,
      "upvotes": 20,
      "replies": {}
    },
    "h6ruqfm": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ruqfm/",
      "text": "well  I mean I once used the introduction Hi I'm (my name here) and I'm going to buy you drinks until you find me attractive ( this was intended as a joke I was a little tipsy already). But the guy laughed and told me then I would be buying a lot of bottle water.  That made me laugh and well... his name was David he was cute and we hooked up ... it was a good weekend...  I didnt  really register the cringe of that particular line untill the following Monday in the middle of my  Circuits lab...lol\n\n Never saw David again after that we didn't exchange numbers or social media just a brief bit of fun and a fond slightly fun memory now",
      "author": "pygmypuffonacid",
      "created": 1627432617,
      "upvotes": -1,
      "replies": {}
    },
    "h6rudtr": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rudtr/",
      "text": "This didn’t happen in college thankfully, but when I was in middle school at a church event we did an icebreaker where you had to pass a carrot from person to person holding it between your knees. It was SO AWKWARD",
      "author": "mkrae2000",
      "created": 1627432447,
      "upvotes": 81,
      "replies": {
        "h6s6jtb": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s6jtb/",
          "text": "Lol that sounds awkward but kinda fun",
          "author": "_FTP_",
          "created": 1627438502,
          "upvotes": 28,
          "replies": {}
        }
      }
    },
    "h6ru84j": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ru84j/",
      "text": "Well, a good one I had was a professor who just asked what our favorite show was. He was like, \"I need reccomendatuons lol.\" Honestly I felt like a lot of the student personalities were reflected in each show they picked.",
      "author": null,
      "created": 1627432367,
      "upvotes": 249,
      "replies": {
        "h6rvtqe": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rvtqe/",
          "text": "This sounds good, if always found you can glean more from a person through their interests rather than just saying, \"Tell me about yourself.\"",
          "author": "no_boy",
          "created": 1627433162,
          "upvotes": 63,
          "replies": {}
        },
        "h6sb3xb": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sb3xb/",
          "text": "I might try this, because I really do need recommendations!",
          "author": "Act-Math-Prof",
          "created": 1627440820,
          "upvotes": 32,
          "replies": {
            "h6ssaix": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ssaix/",
              "text": "Naturally people will have the conventional NCIS and the Office responses but no doubt some students are watching some shows that are hidden gems :)",
              "author": null,
              "created": 1627451156,
              "upvotes": 21,
              "replies": {
                "h6uabz4": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uabz4/",
                  "text": "The Office is really quite good even on the 11th watch through. :c",
                  "author": "GreyStomp",
                  "created": 1627486464,
                  "upvotes": 1,
                  "replies": {
                    "h6uc12v": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uc12v/",
                      "text": "I practically have the dialogue of many episodes memorized!",
                      "author": "Act-Math-Prof",
                      "created": 1627487167,
                      "upvotes": 1,
                      "replies": {
                        "h6unv6y": {
                          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6unv6y/",
                          "text": "Fair enough! If you haven’t watched Community (or rewatched in a while) I’d recommend checking it out as well! Super fun show! :)",
                          "author": "GreyStomp",
                          "created": 1627492002,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h6sy4d6": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sy4d6/",
              "text": "I'll spare you the effort of needing to ask anybody in real life.\n\nhttps://en.wikipedia.org/wiki/Resident_Alien_(TV_series)\n\nIt's got virtually every genre covered. And I suppose it helps being biased towards Alan Tudyk's comedic skills over the last 2 decades.",
              "author": "darkapplepolisher",
              "created": 1627455662,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "h6su94o": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6su94o/",
          "text": "This would be an awesome ice breaker. I hate ice breakers so much but doing ones that relate with more people would make it somewhat better.",
          "author": "shrimpynut",
          "created": 1627452603,
          "upvotes": 11,
          "replies": {}
        },
        "h6tu0dj": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tu0dj/",
          "text": "Ok solid icebreaker lmao",
          "author": "sgRNACas9",
          "created": 1627479210,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h6rsokp": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rsokp/",
      "text": "The classic fun fact. I swear I feel like the most boring person in the room.",
      "author": "RealIntel",
      "created": 1627431607,
      "upvotes": 52,
      "replies": {
        "h6v1v2j": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v1v2j/",
          "text": "All my facts would either be super boring, or I'd feel like I come across as bragging",
          "author": "SandyV2",
          "created": 1627497795,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h6rrsup": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rrsup/",
      "text": "There was one where we went around in a circle and we had to state our name and an interesting fact, then the next person had to repeat our name and interesting fact and add on their own name & fact. So it was a long chain of remembering names and facts and this was all on the first day.",
      "author": "bing-no",
      "created": 1627431173,
      "upvotes": 109,
      "replies": {
        "h6rsope": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rsope/",
          "text": "This right here has to be the worst one.",
          "author": "MediumGlossy",
          "created": 1627431608,
          "upvotes": 43,
          "replies": {}
        },
        "h6rttu5": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rttu5/",
          "text": "I’ve had to do the name one before, but I cannot imagine the torture of remembering names AND a fact!",
          "author": "Paper182186902",
          "created": 1627432171,
          "upvotes": 23,
          "replies": {}
        },
        "h6trudb": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6trudb/",
          "text": "Just like my game. It was horrendous. When I did it, I forgot somebody’s name and it was the absolute worse. More stressful than anything",
          "author": "bluarrow7",
          "created": 1627478120,
          "upvotes": 7,
          "replies": {}
        },
        "h6upnze": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6upnze/",
          "text": "I had to do that in high school for my home room freshmen year and because I stood next to the teacher’s left, I would’ve been the last person. Thankfully the bell rang right before it got to me.",
          "author": "CapriciousSalmon",
          "created": 1627492742,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h6rrbbs": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rrbbs/",
      "text": "Make up a handshake together.\n\nThis kid was really into doing this one handshake and we had the most lit handshake but it didn't break the ice between us two lmao (Plus tha handshake was kinda sus, looked like we were doing a gang sign lol). Plus his hands were really really rough and sweaty and I was like yeeesshh\n\nTo add to this, in middle school I did an ice breaker where we had to introduce ourselves to the class and add a word that describes us with the same letter of our name in front of our own name. and I thought the word 'eerie' was intellectually smart LOL,  So I went by Eerie (insert name) for a whole fucking year. The teacher said \"wow, I like that one\" YEAH MRS. PETERS i'M SURE YA DID ALRIGHT!\n\nOnce I learned the meaning of the word Eerie I asked to change it lol. That was another bad ice breaker",
      "author": "Lelricaa",
      "created": 1627430932,
      "upvotes": 50,
      "replies": {
        "h6tq5md": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tq5md/",
          "text": "I’m afraid to ask, but what does Erie mean?",
          "author": "Blank_Error",
          "created": 1627477237,
          "upvotes": 6,
          "replies": {
            "h6u9y1g": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u9y1g/",
              "text": "I think op meant \"eerie\", which means strange and frightening.",
              "author": "princess_puffpuff",
              "created": 1627486302,
              "upvotes": 6,
              "replies": {
                "h6uvv2i": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uvv2i/",
                  "text": "Yes exactly😂 \nI haven’t used the word eerie since 6th grade so pardon my spelling issue lmao. But yes, strange and frightening 😂",
                  "author": "Lelricaa",
                  "created": 1627495301,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h6u9gcv": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u9gcv/",
              "text": "I can't find anything bad...according to the Merriam-Webster dictionary, Erie refers to [\"a member of an American Indian people living south of Lake Erie in the 17th century\"](https://www.merriam-webster.com/dictionary/Erie).\n\n\\*Edited to add - I also looked it up on Urban Dictionary and didn't find anything other than the city of Erie.",
              "author": "Esmereldista",
              "created": 1627486095,
              "upvotes": 2,
              "replies": {
                "h6uvsg1": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uvsg1/",
                  "text": "It is a lake. \nRealized I was spelling it wrong haha, Eerie also means something that’s strange and frightening 😂",
                  "author": "Lelricaa",
                  "created": 1627495269,
                  "upvotes": 2,
                  "replies": {
                    "h6uw59c": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uw59c/",
                      "text": "Oh, I know what eerie means. And yep, the lake is named for the people who occupied the area.",
                      "author": "Esmereldista",
                      "created": 1627495421,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6rqvlf": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rqvlf/",
      "text": "Would like to ask tho...what would actually be something yall would want to do?\n\nI've done shitty activities, but have lowkey come to the conclusion that there isn't rlly an activity that ppl actually would want to do.",
      "author": "ItzN0tMe",
      "created": 1627430716,
      "upvotes": 75,
      "replies": {
        "h6s9qrq": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s9qrq/",
          "text": ">Would like to ask tho...what would actually be something yall would want to do?\n\nUse the Kahoot! trivia app involving everyone. We did that in an orientation and most of us had a blast!",
          "author": "MrsRadarOreilly",
          "created": 1627440114,
          "upvotes": 42,
          "replies": {
            "h6sqx44": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sqx44/",
              "text": "What kind of questions?",
              "author": "two_short_dogs",
              "created": 1627450177,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "h6ru33w": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ru33w/",
          "text": "Honestly, I think a game I learned in highschool might be fun. Basically, for first day in AP English, we played hangman, except the word was our name/a preferred nickname.\n\nOur teacher let some kids (Esp kids who struggled with english as a second language) skip but most of us played anyways. Basically, she was trying to show us how common certian letters and sounds were in names from certian areas. (I.e. Spanish and italian names share a lot of similar sound groups like masculine names ending in -io)",
          "author": "Throwaway44556879",
          "created": 1627432298,
          "upvotes": 53,
          "replies": {}
        },
        "h6rvfuu": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rvfuu/",
          "text": "Haven't played it myself but two rooms and a boom seems fun",
          "author": "AmDuck_quack",
          "created": 1627432968,
          "upvotes": 8,
          "replies": {
            "h6s19as": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s19as/",
              "text": "What is that",
              "author": "Blackberries11",
              "created": 1627435850,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "h6szk0m": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6szk0m/",
          "text": "For smaller groups, hangman!!! This was how I broke the ice with someone before and it was SO fun!!! We would either pick a question for ourselves or ask each other a question and the answer was to be found within the hangman game",
          "author": "toofeduptocare",
          "created": 1627456866,
          "upvotes": 7,
          "replies": {}
        },
        "h6sqfm6": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sqfm6/",
          "text": "People like talking about their pets",
          "author": "introvertedbassist",
          "created": 1627449843,
          "upvotes": 6,
          "replies": {}
        },
        "h6uroxx": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uroxx/",
          "text": "Collegehumor did a take on this: high stakes icebreaker. For example, say your dad comes to you in the middle of the night with a body: do you help him dispose of it or do you call the cops on him? On your best friend’s Shirley’s wedding day, you find out the maid of honor is having an affair with the groom, so do you tell Shirley and ruin the wedding or do you let her enter a doomed marriage? \n\nWe had to do this during AP European history and I found it so much better because we had legitimately fun discussions.",
          "author": "CapriciousSalmon",
          "created": 1627493574,
          "upvotes": 4,
          "replies": {}
        },
        "h6s8u04": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s8u04/",
          "text": "One I use that people seem not to hate, at least in a specified strategic planning or development retreat setting, is the \"personal coat of arms.\" I now have worksheets that make it easier, but all you need is a sheet of paper. You make three squares. The first square you ask people to draw or write down their past successes. Second square is personal challenges or opportunities for growth. Third square is their vision for the future. Everyone gets three minutes for each square. Then you go around the room and each person talks through their squares in one minute or less. Then later on in the day we do the exercise again, but it's for the team and not the individual. Puts everyone on an equally vulnerable playing field and leads to real connection. It's much better doing it than the explanation I gave here.",
          "author": "radabadest",
          "created": 1627439644,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h6rq1to": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rq1to/",
      "text": "we all had to share our pronouns, that's it. Nothing else",
      "author": "ahbearcat",
      "created": 1627430309,
      "upvotes": 30,
      "replies": {
        "h6rrh92": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rrh92/",
          "text": "omg This was the “hot topic” every new student zoom meeting I was in like can y’all come up with something else pls 😭",
          "author": "moderatef",
          "created": 1627431012,
          "upvotes": 22,
          "replies": {}
        },
        "h6rtm31": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rtm31/",
          "text": "I hate how that's incorporated into every introduction now. It feels so forced and fake",
          "author": "TheOnlyHaverfordSimp",
          "created": 1627432063,
          "upvotes": 26,
          "replies": {
            "h6tvc7l": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tvc7l/",
              "text": "Also can be safely assumed like 99% of the time",
              "author": "mexicandemon2",
              "created": 1627479863,
              "upvotes": 4,
              "replies": {
                "h71jz2g": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h71jz2g/",
                  "text": "Yeah, it should definitely be something where if you're trans/ non binary, etc then you can say it if you wish so people don't mess up but if I'm a guy and I know I look like one I trust people to use he/him etc...",
                  "author": "TheOnlyHaverfordSimp",
                  "created": 1627616737,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6rowh1": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rowh1/",
      "text": "ahhh yes, almost every college class had introductions with the classic “sAy yOuR nAMe, yOuR mAjOr, aNd aN inTeReStiNg fAct aBouT yOu” \n\ni would always have to wrack my brain to think of something remotely unique for the fact haha",
      "author": "SnaccAttack12",
      "created": 1627429743,
      "upvotes": 99,
      "replies": {
        "h6rramq": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rramq/",
          "text": "I’m a professor and I hate doing this shit but I also have no other way to really get info on my students day one. Would it be easier to just leave the fun fact out? Just, name, major, and year in school?",
          "author": "crimbuscarol",
          "created": 1627430923,
          "upvotes": 52,
          "replies": {
            "h6rsm5l": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rsm5l/",
              "text": "aww i didn’t know professors felt that way about intros too! and hmm, maybe something more specific than a fun fact could be better, like a favorite movie or favorite music artist. i feel like most people can relate to those interests :)",
              "author": "SnaccAttack12",
              "created": 1627431573,
              "upvotes": 38,
              "replies": {
                "h6rsvqo": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rsvqo/",
                  "text": "I teach history so maybe I can ask their favorite historical figure or time period. Thanks for replying!",
                  "author": "crimbuscarol",
                  "created": 1627431703,
                  "upvotes": 43,
                  "replies": {
                    "h6rujf4": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rujf4/",
                      "text": "that’s a perfect way to get to know them! and no problemm",
                      "author": "SnaccAttack12",
                      "created": 1627432520,
                      "upvotes": 20,
                      "replies": {}
                    },
                    "h6t6k4k": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6t6k4k/",
                      "text": "I second this! My high school history teacher asked us our favorite historical figures both on the first day of class and as the final assignment before we graduated. I chose different figures and it was fun to reflect on what made me change.",
                      "author": "_SilentTiger",
                      "created": 1627463048,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "h6u3if9": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u3if9/",
                      "text": "I do the name and most significant place they've been.  Not the most impressive, their most significant.  If that's Grandma's house for family dinner, I want to hear about that and not their trip to Rome. \n\nStart teaching that interpretive significance from the beginning 😎",
                      "author": "IntrovertedImmigrant",
                      "created": 1627483545,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h6s13pc": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s13pc/",
              "text": "Think of what you want to know about them and have them write it on an index card. Then collect them",
              "author": "Blackberries11",
              "created": 1627435774,
              "upvotes": 10,
              "replies": {
                "h6s1c2c": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s1c2c/",
                  "text": "Is there any value in the students hearing about one another? This would be in an upper division class (so all majors). I don’t do any introduction stuff in my survey level.",
                  "author": "crimbuscarol",
                  "created": 1627435888,
                  "upvotes": 9,
                  "replies": {
                    "h6s29ik": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s29ik/",
                      "text": "I think there is. I tell my students to introduce themselves in class. For my subject (a language class) I want them to get to know each other. I have some coworkers who do the index cards as well.",
                      "author": "Blackberries11",
                      "created": 1627436355,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "h6sgze0": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sgze0/",
                  "text": "In an HR class we did 2 truths and a lie on index cards and had to guess whose it was lol",
                  "author": "roseyd317",
                  "created": 1627444005,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h6tudox": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tudox/",
              "text": "I've had profs who just have us write this stuff on a note card and turn it in. It's much less torturous for those of us with anxiety and the Prof can read them privately to get to know us. Occasionally they'd ask if we'd be willing to share with the class and some people do.",
              "author": "anon_throwaway13579",
              "created": 1627479393,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "h6rsair": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rsair/",
          "text": "\"I uhhh, almost hit someone with my car the other day\" \n\nWoooow, nice! Great to meet you. Next person!",
          "author": "Lelricaa",
          "created": 1627431416,
          "upvotes": 32,
          "replies": {
            "h6sctix": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sctix/",
              "text": "Then the next student replies, \"I almost got hit by a car the other day\" haha",
              "author": "Maxwellmonkey",
              "created": 1627441737,
              "upvotes": 18,
              "replies": {}
            },
            "h6sd20d": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sd20d/",
              "text": "I got \"and my grandpa founded the Klan in [that state]!\" Like that's an accomplishment to be proud of. 😳",
              "author": "poop_on_you",
              "created": 1627441866,
              "upvotes": 6,
              "replies": {
                "h6v4ih9": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v4ih9/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1627498906,
                  "upvotes": 2,
                  "replies": {
                    "h6vmwyi": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vmwyi/",
                      "text": "So much cringe",
                      "author": "poop_on_you",
                      "created": 1627506686,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h6rtui7": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rtui7/",
              "text": "“well then! which lucky lot on campus do you park in, just out of curiosity? i won’t need that for future reference aha… not at all”",
              "author": "SnaccAttack12",
              "created": 1627432180,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "h6rnkqj": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rnkqj/",
      "text": "this wasn’t in a college class but it’s the one ice breaker i hate the most. i don’t know what it’s called but basically the group stands in a circle and you go around saying your name. the leader picks someone to stand in the middle and they point to someone on the outside. the person crouches down and the 2 people on their right and left have to guess each other’s name. the person who didn’t guess the other persons name fast enough switches with the person in the middle and they repeat with picking people on the outside and switching back and forth. as someone who is horrible with names this was such an anxiety inducing game that i wish i could never do it again",
      "author": "ewephantsc",
      "created": 1627429102,
      "upvotes": 308,
      "replies": {
        "h6roko7": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6roko7/",
          "text": "Oof, this sounds terrible!",
          "author": "Maraakis",
          "created": 1627429584,
          "upvotes": 62,
          "replies": {}
        },
        "h6s874m": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s874m/",
          "text": "That sounds like hell for people like me who have social anxiety",
          "author": "Sean737",
          "created": 1627439322,
          "upvotes": 45,
          "replies": {
            "h6soc6b": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6soc6b/",
              "text": "it was and i played it multiple times on dif occasions too 😩",
              "author": "ewephantsc",
              "created": 1627448460,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "h6sn02j": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sn02j/",
          "text": "That’s a game called “Splat”, common induction game where I’m from.",
          "author": "SiberianResident",
          "created": 1627447598,
          "upvotes": 14,
          "replies": {}
        },
        "h6tweks": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tweks/",
          "text": "Did this at basically every orientation session from middle school to college among many other lame games. Whats worse was that those who lost the games had to do a forfeit. I had a poor memory when it comes to names and thus didn't enjoy myself",
          "author": "testercheong",
          "created": 1627480363,
          "upvotes": 3,
          "replies": {
            "h6uqb0i": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uqb0i/",
              "text": "Where are you from? I've never heard of this.",
              "author": "FightForDemocracyNow",
              "created": 1627493005,
              "upvotes": 1,
              "replies": {
                "h6vg9zh": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vg9zh/",
                  "text": "Not sure about the commenter you asked. But in the UK this game is called splat and literally everyone knows how to play it.",
                  "author": "henrik_von_davy",
                  "created": 1627503893,
                  "upvotes": 1,
                  "replies": {}
                },
                "h6w7bfp": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6w7bfp/",
                  "text": "Singapore. Many orientation activities (at least those that I've attended) consists of games like this",
                  "author": "testercheong",
                  "created": 1627516089,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h6upbwu": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6upbwu/",
          "text": "I remember when I transferred schools, we got partnered up and had to tell the person what our name meant. I have no idea what it means without googling and we weren’t allowed to use our cellphones. If they meant why we were named that in the first place, I could’ve told them my mom liked a certain First Lady and a freestyle rapper.",
          "author": "CapriciousSalmon",
          "created": 1627492606,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6rmj09": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rmj09/",
      "text": "During my freshman orientation they ran an activity called “Trivia Race”. We were split into two teams and our orientation leaders would read off random questions about the school, city, pop culture, etc. We’d then have to run to the other side of the room, and whoever arrived first would try and answer the question. If they got it right, their team got a point. If not, someone on the other team could try and answer.\n\nProbably would’ve been relatively fun, but one guy who took it way too seriously shoved a girl in one of the early rounds. She wound up taking a nasty spill and breaking her wrist. \n\nDefinitely killed the mood.",
      "author": "bakedpotatowcheezpls",
      "created": 1627428595,
      "upvotes": 141,
      "replies": {
        "h6wsqiq": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6wsqiq/",
          "text": "This has to be one of the worst I’ve read 😂😂 I couldn’t imagine the vibe in the room after that",
          "author": "Few_Entrepreneur_459",
          "created": 1627526563,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h6rm0fw": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rm0fw/",
      "text": "I hate all of them. The really bad ones are the \"name, major, career goal\" especially when its for like a 400 level class where everyone has the same major and similar career goals.",
      "author": "Nosleep_9764",
      "created": 1627428347,
      "upvotes": 394,
      "replies": {
        "h6rs1rp": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rs1rp/",
          "text": "Oh god, I forgot how many ice breakers I did in college. I didn't even attend any of my school tours or that shit lol",
          "author": "Lelricaa",
          "created": 1627431296,
          "upvotes": 76,
          "replies": {
            "h6rxbmg": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rxbmg/",
              "text": "I didn't do the tours but I did have to do orientation, which sucked. Luckily now that I'm in 300 and 400 level courses I don't have as many profs that do them.",
              "author": "Nosleep_9764",
              "created": 1627433912,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "h6sejfj": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sejfj/",
          "text": "Still better than the professor who asked us to describe the worst thing that has ever happened to us...in front of people we'd been in a room with for all of 20 minutes. He legit said if at least 3 people didn't cry he'd dock everyone points.\n\nIt was calculus in case anyone is wondering. Maybe he was reminding us that derivatives weren't as bad as childhood abuse? Idk.",
          "author": "Torrey_not_Kori",
          "created": 1627442660,
          "upvotes": 60,
          "replies": {
            "h6sjts3": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sjts3/",
              "text": "\"Being made to take this class, apparently...\"",
              "author": "S-Punky",
              "created": 1627445649,
              "upvotes": 25,
              "replies": {}
            }
          }
        },
        "h6rvsi2": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rvsi2/",
          "text": "\"Why are you taking this class?\"\n\nIt's required to graduate. End of Story.",
          "author": "iamsavsavage",
          "created": 1627433145,
          "upvotes": 119,
          "replies": {
            "h6rxjeh": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rxjeh/",
              "text": "Hahah my favorite answer. Also the generic \"I thought it would be \nan interesting class\" is always good.",
              "author": "Nosleep_9764",
              "created": 1627434022,
              "upvotes": 47,
              "replies": {
                "h6smr3r": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6smr3r/",
                  "text": "\"This class has a 1.7/5 difficult rating on RateMyProfessor.\"",
                  "author": "Ben__Diesel",
                  "created": 1627447441,
                  "upvotes": 47,
                  "replies": {
                    "h6znon2": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6znon2/",
                      "text": "“My school’s subreddit said that there would only be 2 short essays and I hate writing”",
                      "author": "empireof3",
                      "created": 1627585350,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h6tkz06": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tkz06/",
          "text": "Im, uh. Im taking this class because even though it's not required for my major, all the material in it are related to the masters I applied for. \n\nI thought at least that was a varied answer (and true) I've never seen such confusion",
          "author": "bitetheboxer",
          "created": 1627474277,
          "upvotes": 6,
          "replies": {
            "h6tovhq": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tovhq/",
              "text": "The amount of confused looks I got when I said I needed a class for my minor was awesome. I still don't know if its because people don't know what a minor is or if they didn't know that class was required.",
              "author": "Nosleep_9764",
              "created": 1627476544,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h6znvuc": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6znvuc/",
          "text": "Lol, organic chemistry discussion where 18/21 students are there for prehealth, a few for research/engineering purposes, and the one student who isnt is a spectacle",
          "author": "empireof3",
          "created": 1627585431,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6rlw2w": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rlw2w/",
      "text": "I’d say just a basic “fun fact” because you get boring stuff about “I’m the youngest of 3” and then someone goes “my dad killed someone” and makes it awkward for everyone",
      "author": "KeiraBearStella",
      "created": 1627428292,
      "upvotes": 449,
      "replies": {
        "h6rqfjk": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rqfjk/",
          "text": "then I have an existential crisis because I can't think of one thing interesting about myself",
          "author": "mkbburk",
          "created": 1627430498,
          "upvotes": 247,
          "replies": {}
        },
        "h6rtnmh": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rtnmh/",
          "text": "Or “my mum died of cancer”.",
          "author": "Paper182186902",
          "created": 1627432084,
          "upvotes": 47,
          "replies": {}
        },
        "h6sohcr": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sohcr/",
          "text": "I had an amazing professor last semester who challenged us to give a boring fact about ourselves during the first zoom class, and it was hilarious. Icebreakers that poke fun at icebreakers are the best icebreakers lol",
          "author": "RoyalSloth",
          "created": 1627448551,
          "upvotes": 39,
          "replies": {
            "h6u2uqm": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u2uqm/",
              "text": "Oh my gosh! There's a professor at my university that asks for boring facts and it was so amusing. I think I told him that I have brown hair (my hair was dyed green) and he called me a tree in response",
              "author": "SnapdragonPBlack",
              "created": 1627483259,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "h6s6553": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s6553/",
          "text": "My boring fun fact is I'm a Vikings fan, or I was born in [different state]",
          "author": "_FTP_",
          "created": 1627438293,
          "upvotes": 14,
          "replies": {
            "h6scbby": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6scbby/",
              "text": "Skol!",
              "author": "FamishedHippopotamus",
              "created": 1627441466,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h6rt8rd": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rt8rd/",
          "text": "I would say the fun fact of myself is that I haven’t killed myself at this point or something sarcastic",
          "author": "colossuskidd",
          "created": 1627431879,
          "upvotes": 26,
          "replies": {
            "h6sr6qx": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sr6qx/",
              "text": "Nah that's awkward",
              "author": "SirBubbles_alot",
              "created": 1627450367,
              "upvotes": 36,
              "replies": {
                "h6tq778": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tq778/",
                  "text": "Who cares? I’m at college to earn a degree not make friends",
                  "author": "colossuskidd",
                  "created": 1627477259,
                  "upvotes": -4,
                  "replies": {
                    "h6wgwih": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6wgwih/",
                      "text": "Networking is an important part of being successful",
                      "author": "Afraidofdownvotes0",
                      "created": 1627520771,
                      "upvotes": 2,
                      "replies": {
                        "h6wh22n": {
                          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6wh22n/",
                          "text": "Not wrong about that, but what bothers me is these silver spoon kids get handed jobs this year yet when I graduated last year; the world basically collapsed on itself.",
                          "author": "colossuskidd",
                          "created": 1627520846,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6rlvgl": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rlvgl/",
      "text": "We all had to stand in a circle and the teach er began: \"I'm the creative Carolin\", while doing some kind of over the top movement of swinging a pen or brush of some kind. Next person had to repeat (\"She is the creative Carolin\"), including the exaggerated movement (!) and adding her own alliteration of Adjektive, Name and corresponding movement.\nIf it was deemed to timid by the teach er, the Person had to try again until he/she got it \"right\". \nWe were 50 People.\nPeople tried to say no, but were harshly beratend by the teacher, telling them that they had to, because it was needed that every body had to learn everybody\"s Name. It Was a class on adult education...",
      "author": "Maraakis",
      "created": 1627428284,
      "upvotes": 422,
      "replies": {
        "h6rnk2s": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rnk2s/",
          "text": "Jesus that sounds like agony",
          "author": "R3adingSteiner",
          "created": 1627429093,
          "upvotes": 139,
          "replies": {
            "h6ro0iz": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ro0iz/",
              "text": "It absolutely was. I love the topic of the class, but every hour spent in this class felt absolutely wasted...",
              "author": "Maraakis",
              "created": 1627429313,
              "upvotes": 55,
              "replies": {}
            }
          }
        },
        "h6rnq8f": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rnq8f/",
          "text": "DONE THIS!! It’s sooo hard to do after like six people!",
          "author": "Cali-wildflowers",
          "created": 1627429176,
          "upvotes": 72,
          "replies": {
            "h6rocst": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rocst/",
              "text": "Yeah and it took ages, too! Ugh. But to be honest, compared to this, every Single other ice breaker felt like a walk in the Park or just mildly stupid.",
              "author": "Maraakis",
              "created": 1627429480,
              "upvotes": 35,
              "replies": {
                "h6rofqo": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rofqo/",
                  "text": "Yes you actually had to pay attention!!",
                  "author": "Cali-wildflowers",
                  "created": 1627429519,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            }
          }
        },
        "h6s957g": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s957g/",
          "text": "I've never done this icebreaker, but it sounds to be the worst ever. Congrats, you win!",
          "author": "MrsRadarOreilly",
          "created": 1627439804,
          "upvotes": 18,
          "replies": {}
        },
        "h6suae1": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6suae1/",
          "text": "I’ve done this too, with around 30 people. Just gets longer with the bigger of a group you have. Wouldn’t recommend\n\nEdit: removed exponentially",
          "author": "Anti1447",
          "created": 1627452629,
          "upvotes": 9,
          "replies": {
            "h6t305a": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6t305a/",
              "text": "Exponentially?",
              "author": "El_Hugo",
              "created": 1627459842,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h6scuki": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6scuki/",
          "text": "I've done this!  And I've run into my classmates in random places (Chicago, NYC, etc) and all of a sudden remember their name and adjective.  So weird how that works.  Hated it in the moment, but dang if that wasn't the one class where I never forgot a name.",
          "author": "poop_on_you",
          "created": 1627441753,
          "upvotes": 20,
          "replies": {
            "h6sexfv": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sexfv/",
              "text": "I would always forget their name and adjective, but remember their motion. So I would see them around campus and they would say hi and I wouldn't know who I was talking to until I do their motion and they are always \"how do you remember that and not my name\" but I'm just that bad with names",
              "author": "SnapdragonPBlack",
              "created": 1627442867,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "h6trquj": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6trquj/",
          "text": "This reminds me of our icebreaker game. This is not fun for students! It’s more intimidating than anything",
          "author": "bluarrow7",
          "created": 1627478069,
          "upvotes": 3,
          "replies": {}
        },
        "h6uidoz": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uidoz/",
          "text": "Doing it with adults... it's awkward, just horrid. Doing it with my elementary aged kids, who already have a CRAZY amount of energy, a total success. Mind you the groups were still relatively small but audiences matter. Im sorry you had to endure that 🥴",
          "author": "Requin23",
          "created": 1627489772,
          "upvotes": 2,
          "replies": {}
        },
        "h6u0zud": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u0zud/",
          "text": "Oh god, I would have dropped the class lmao",
          "author": "milkshak196",
          "created": 1627482448,
          "upvotes": 1,
          "replies": {}
        },
        "h90zjy5": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h90zjy5/",
          "text": "I did that in middle school and completely blocked out the memory until this comment. It was for a theater class so I guess there was an excuse for the teacher to be harsh but still. Brutal.",
          "author": "lphelan15",
          "created": 1629033110,
          "upvotes": 1,
          "replies": {}
        },
        "h93zevc": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h93zevc/",
          "text": "I did that one and it wasn't so bad in my opinion. I already knew alot of people in the group though so that may have been why it wasn't so bad.",
          "author": "Roar353",
          "created": 1629082140,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6rhe0h": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rhe0h/",
      "text": "Painting T-Shirts with positive sayings never felt more like a cuck in my life.",
      "author": "TG721",
      "created": 1627426162,
      "upvotes": 16,
      "replies": {
        "h6rleb3": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rleb3/",
          "text": "At least you didn't attend college during the late 2000s/early 2010s when \"Keep Calm and...\" was EVERYWHERE.",
          "author": "officiakimkardashian",
          "created": 1627428059,
          "upvotes": 29,
          "replies": {}
        },
        "h6rxek0": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rxek0/",
          "text": "haha cuck, what a reddit moment",
          "author": null,
          "created": 1627433952,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "h6rfjgm": {
      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rfjgm/",
      "text": "Two truths and a lie is always so boring. Always the same, I have 2 brothers, etc.",
      "author": "bumfuzzle179",
      "created": 1627425297,
      "upvotes": 504,
      "replies": {
        "h6rjb2o": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rjb2o/",
          "text": "That's why I always go first and go big: I've been arrested. I've swam a mile in a hurricane. I've given tours of a 'real' haunted house.",
          "author": "simmelianben",
          "created": 1627427067,
          "upvotes": 256,
          "replies": {
            "h6rn22w": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rn22w/",
              "text": "I'm guessing the lie is the haunted house",
              "author": "RadiantHC",
              "created": 1627428850,
              "upvotes": 74,
              "replies": {
                "h6rnd09": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rnd09/",
                  "text": "Nope! I gave tours at a local tavern that was built about 200 years ago and is one of the last spots the lost confederate gold is suspected to have passed through. Also famous for an 1800s doctor who kept the skeleton of an executed dude in the cellar for study. Eagle Tavern in Watkinsville GA.",
                  "author": "simmelianben",
                  "created": 1627428997,
                  "upvotes": 109,
                  "replies": {
                    "h6rp9rl": {
                      "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rp9rl/",
                      "text": "Holy crap - I drive past Eagle Tavern at least 3 times a week but I've never heard that story! I may have to go for a tour sometime.",
                      "author": "ghostlytree",
                      "created": 1627429923,
                      "upvotes": 38,
                      "replies": {
                        "h6rqi7u": {
                          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rqi7u/",
                          "text": "It's worth it! Small donations support the entire visitors center, and the Halloween ghost tours are pretty spectacular.\n\nI'd recommend going in Halloween even since those folks have more stories.",
                          "author": "simmelianben",
                          "created": 1627430534,
                          "upvotes": 38,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h6s9n2l": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s9n2l/",
                  "text": "The lie is the haunted house without the OP intending it, apparently. Haha",
                  "author": "Capricancerous",
                  "created": 1627440061,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "h6uqlnx": {
              "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uqlnx/",
              "text": "You haven't been arrested?",
              "author": "purpleplatapi",
              "created": 1627493127,
              "upvotes": 2,
              "replies": {
                "h6usx7d": {
                  "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6usx7d/",
                  "text": "Correct! The hurricane one happened while at Boy Scout camp. The camp was in a protected valley and the swim started at 6am as the storm was coming in. So we got tropical storm level winds that afternoon, but the rain that fell during the swim was officially part of a hurricane still",
                  "author": "simmelianben",
                  "created": 1627494079,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "h6ttslu": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ttslu/",
          "text": "My strategy is to always pick the most insane things that have ever happened to me.  I have a pretty average life 99% of the time but when things do happen it's always absolutely ridiculous.",
          "author": "JSD12345",
          "created": 1627479104,
          "upvotes": 4,
          "replies": {}
        },
        "h6tkmgh": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tkmgh/",
          "text": "Haha. I always say, im from New Mexico, I was abducted by aliens and never specicify which kind.\n\nIt does actually get hits. And my trues are weird enough that no one is actually sure.",
          "author": "bitetheboxer",
          "created": 1627474055,
          "upvotes": 5,
          "replies": {}
        },
        "h6vh1j9": {
          "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vh1j9/",
          "text": "The problem is not the icebreaker it's the people who are doing it. I'd say of all the icebreakers two truths and a lie has the most potential if interesting people are playing it",
          "author": "henrik_von_davy",
          "created": 1627504211,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054989
}