{"sid": "avl2dh", "link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/", "title:": "Anyone else stuck in this cycle you can't get out of?", "text": "Every semester is always the same for me. I start the semester off with an incredible amount of determination, swearing that I will be on top of all my work and such. Then, after a month or so, the laziness and procrastination kicks in, and I start falling off. Slowly, I start delaying my work and studying until the very last minute and find myself eventually being behind on the material for all of my classes. After that point I am just hoping that semester ends already, so I can get a fresh start and hope I'll be more studious next semester (hint: no I won't) . ", "author": "akarui_neko", "created": 1551316507, "retrieved": 1632802002, "over_18": false, "upvotes": 1410, "upvote_ratio": 0.99, "comments": {"ejq0osz": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ejq0osz/", "text": "Heh, I'm in my first year of engineering and both the semesters have gone the exact same way. ", "author": null, "created": 1553936022, "upvotes": 1}, "eiszdrn": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/eiszdrn/", "text": "Please please please don’t complain about your college life. Trust me, when they say college is one of the best experiences of your life, they mean it. Once you’re out of college and the real world hits you in the face, all you’re gonna wanna do is get yo ass back to college. Trust me. Just enjoy the people, enjoy the ROUTINE every semester and enjoy the thoughtful discussions in class ", "author": "lobsterman1million", "created": 1552920401, "upvotes": 1}, "eilmiro": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/eilmiro/", "text": "Yeah I feel you", "author": "Bills-ham", "created": 1552669369, "upvotes": 1}, "eiiyu1u": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/eiiyu1u/", "text": "This has been me foreeeeever. I’d start of with a shit ton of motivation then then I use all of it up by the second week. For me the reasoning was depression and ADHD. Have you considered trying something like conserta or adderall? Before I started taking adderall I’d loose motivation super fast and it’d take me 6 days to write a simple essay just cause I couldn’t sit down to do it. Life is so much easier now, I have a schedule that I actually follow and I get everything in on time cause it doesn’t kill me to do one thing.", "author": null, "created": 1552586309, "upvotes": 1}, "ehjbzek": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehjbzek/", "text": "This has been me every semester so far. One thing that I've done this semester is I got a to-do list app, and include all my assignments on it. Now Instead of procrastinating, I check that lost frequently and feel motivated to do things so that I can check them off and get them off my chest. It wasn't even that i ever forgot stuff, it was always in the back of my mind, but it's helped a ton with motivation.", "author": "cheeseybacon11", "created": 1551420557, "upvotes": 1}, "ehj1758": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehj1758/", "text": "I already forgot to submit a 100 point essay this semester. I don’t know what the heck my problem is! ", "author": "bcecilia-", "created": 1551410793, "upvotes": 2}, "ehiv0vf": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehiv0vf/", "text": "I was very determined at the beginning of the semester, until about a couple of weeks ago when I had all my midterms jammed packed into a few days. I did okay on some, failed one, and barely passed another. I was exhausted and burnt out. I feel like it really zapped my motivation and now I am actually trying to find some motivation tips :/. I know some people will say just push through, but that can do a lot of damage to my mental health. Past couple year it's made depressed and mentally drained even after finals were over. I wish I didn't get overwhelmed so easily. It sucks. Makes it feel like I am not competent or don't have enough willpower or something.", "author": null, "created": 1551406175, "upvotes": 2}, "ehijl3j": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehijl3j/", "text": "That's how I used to feel every single semester. College isn't forever, it isn't even comparable to the rest of your life (unless you want to go into academics, of course). Don't be too hard on yourself- but I can also promise that once you start breaking the little habits, the bigger ones get easier to tackle! Productivity can be just as cyclical of a habit as laziness :) It always feels like a miracle when you get one step ahead of yourself. You can do it!!! :D", "author": "LemDoggo", "created": 1551397552, "upvotes": 2}, "ehi8exg": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehi8exg/", "text": "Help pls", "author": "ReggaeMonestor", "created": 1551389923, "upvotes": 2}, "ehi1m63": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehi1m63/", "text": "my advice is to stop wasting money on college. use your money to invest in something else possibly starting a business or something. ", "author": "ultimatefrisbeemem2", "created": 1551385256, "upvotes": 2}, "ehi1hfc": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehi1hfc/", "text": "college is over prescribed you dont need college to learn or get a job.", "author": "ultimatefrisbeemem2", "created": 1551385174, "upvotes": 2}, "ehi1euo": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehi1euo/", "text": "yeah this happened to me and i dropped out. i ended up going back again and i dropped out again after failing. now im trying to be self employed ", "author": "ultimatefrisbeemem2", "created": 1551385128, "upvotes": 2}, "ehhznc7": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhznc7/", "text": "This is me now but I'm trying my best.", "author": "jg2353", "created": 1551384032, "upvotes": 2}, "ehhz4z8": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhz4z8/", "text": "I'm in my second semester and I think this is becoming my pattern too. idk if I'll see the end of college though", "author": "george-waschin", "created": 1551383726, "upvotes": 2}, "ehhwzim": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhwzim/", "text": "Power through and rest easy knowing that employers do not give a shit about GPA. It’s gonna be fine, you’re on track, get that diploma. ", "author": "dunkintitties", "created": 1551382404, "upvotes": 1}, "ehhrkc0": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhrkc0/", "text": "I have a semester cycle but it's different- it goes in phases like the week.\nFirst couple of weeks are the 'Monday,' I'm readjusting to the routine, still mourning my freedom from break. \nTuesday is the first round of exams which tell me I need to get my ass into gear.\nWednesday is the humpday- I'm in a good rhythm, at my most driven and prepping for midterms.\nThursday plateaus. \nFriday is finals week- the end is in sight, I just have to push myself once more. \nBreaks are the 'weekends'\nSunday nights are the week before a new semester starts ", "author": "Indya89", "created": 1551379084, "upvotes": 3}, "ehhq4h6": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhq4h6/", "text": "I've been in this cycle probably since middle school/high school. Almost didn't graduate my original year if it wasn't for summer school. Now I'm back in college again (I flunked my first semester) with my other half and I keep telling her my grades are good. I'm sure I'm not doing well in one of my classes but unsure in the others. I don't want to disappoint her and myself by getting back into this terrible fucking cycle.", "author": "fat-shaggy", "created": 1551378190, "upvotes": 1}, "ehhh800": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhh800/", "text": "I think it is because u were so tense at the beginning that ur mental stamina ran out before u reached the end. Personally, I suffered a similar problem, but when I learned to do things at moderate speed, I could go a lot further than I could before. The key here is to find a distraction, either entertainment or area of interest outside what u are learning from school. \n\nAlso, there is no need to keep thinking about giving it ur best. Just treat it as breathing, as natural as possible that u don't think about why u should be studying hard.", "author": "Demosama", "created": 1551372682, "upvotes": 3}, "ehhg1md": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhg1md/", "text": "I don’t know if it’ll be the same for you. But staying extremely organized and detailed as far as assignments, tests, and even my day to day life (hygiene, keeping my place clean, journaling, going to the gym often, etc) typically keep me on a leash. The small things you do to help clear your mind and stay healthy typically go far to help you stay efficient. Laziness and apathy are typically a symptom of my brain being scattered and stressed. When everything else is in order, I’m able to more clearly focus on what is important. If any of this doesn’t make sense I’m sorry I’m in class rn but I had to reply to this haha cause I feel this shit heavy ", "author": "thegoatishere", "created": 1551371942, "upvotes": 3}, "ehhf7io": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhf7io/", "text": "I feel I'm in a similar situation/ cycle. It sucks to be in. But as long as you graduate with a degree did it really ever matter at all...\n\nedit: a word", "author": "Pumadillo", "created": 1551371402, "upvotes": 2}, "ehhefn8": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehhefn8/", "text": "Study tip (that I never actually manage to do myself, because I get lazy after a while and neglect to do it): go home after your lectures and read your notes. From the beginning to the end. The more you read it, the less foreign it seems to you. \n\nI always find myself saying I don't know something, then going back to my notebook and I've written it down, right there, in my own damn handwriting in plain fucking English. \n\nSend help. ", "author": "dizzzzzayfosho", "created": 1551370901, "upvotes": 3}, "ehh9vg6": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh9vg6/", "text": "Yeah, this actually the reason I'm on reddit right now LOL. I have a paper (due today) and an exam (on Monday) to study for but I just can't seem to find the motivation... I'm concerned that I'm not concerned for both deadlines.", "author": "Kooky_Barnacle", "created": 1551367879, "upvotes": 4}, "ehh9sp3": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh9sp3/", "text": "And eventually you'll graduate! That's my plan. Just do it how I've been doing it and next semester my grades will be decent enough to graduate.\n\nThen I'll have a piece of paper that says I can have a big kid job.", "author": "themflatearthers", "created": 1551367826, "upvotes": 3}, "ehh8y4g": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh8y4g/", "text": "I think this might just be how it works ;-;  \n\n\nAt least in the \"real world\" with a \"real job\" the pain is never ending which makes procrastination so much less appealing. ", "author": "nerdyginger27", "created": 1551367244, "upvotes": 2}, "ehh8kyg": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh8kyg/", "text": "Been there, done that. ", "author": "FreakingWeird", "created": 1551366995, "upvotes": 2}, "ehh6ypc": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh6ypc/", "text": "I'm right there with you. I've found myself doing this just about every semester but this is my last one. I can't seem to get out of this struggle because it ends up working. I'll hold off even big projects until the very end and yet I am still able to get it done in a crunch and still pass with flying colors lol. It doesn't motivate me at all to start earlier.", "author": "BrolyDisturbed", "created": 1551365793, "upvotes": 3}, "ehh6os6": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh6os6/", "text": "I’ve gotten to the point where you don’t have the will to cram last second so you better start soon enough or not at all", "author": "Trowawaycausebanned4", "created": 1551365587, "upvotes": 2}, "ehh3f24": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh3f24/", "text": "Where do you get this incredible amount of determination? I'm just done with the exam session, I'm about to start second semester and I sometimes I'm already so done…", "author": "chic_luke", "created": 1551363048, "upvotes": 2}, "ehh0ad4": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehh0ad4/", "text": "Every single semester", "author": "flaninpan", "created": 1551360286, "upvotes": 2}, "ehgzumk": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgzumk/", "text": "Yes.", "author": "Threwaway2019", "created": 1551359877, "upvotes": 2}, "ehgx9lh": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgx9lh/", "text": "It's okay you're not alone, i know i have no saying in this but just do it, finish your studies no matter what. That's what's keeping me going although my pointers are pretty much declining", "author": "marzen0", "created": 1551357136, "upvotes": 2}, "ehgtyci": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgtyci/", "text": "Just finished a 20 sec stop motion animation in 1 day 1 hour after the deadline. We had a month on us. \nBut hey, anything worth doing is worth doing poorly.", "author": "jokonokon", "created": 1551352753, "upvotes": 2}, "ehgtrs8": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgtrs8/", "text": "Fortunately/unfortunately for me, I get anxious when I have any sort of work assigned that I havent started yet. So I usually start any assignment the day I get it, and get as much done as I possibly can. I started and finished a 1000 word essay last night that was assigned Monday, and the fact that I didnt touch it Monday or Tuesday made me think about and swell on it all day at work yesterday. ", "author": "Kuke69", "created": 1551352465, "upvotes": 2}, "ehgt1p1": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgt1p1/", "text": "motivation will always fail you contrary to what people often say. You're going to have to developed tmthe discipline to force yourself to Saturday and take care of your business.", "author": "GIgroundhog", "created": 1551351263, "upvotes": 2}, "ehgrku1": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgrku1/", "text": "Understand that you're not alone in it.\nIt's about how hard we push forwards pass the motivation block and accomplish the tiny amounts at first", "author": "PoisonedHive", "created": 1551348711, "upvotes": 2}, "ehgq8zl": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgq8zl/", "text": "Before the semester you have free time and energy to commit to going for it. You could try scheduling a pep review in the middle of your semester.\n\nA weekend or break where you can take a break reflect on the work you got done and how good that felt, and then recommit to finishing the second half with the same momentum.", "author": "LotusApe", "created": 1551346514, "upvotes": 2}, "ehgp5tf": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgp5tf/", "text": "Very much me. Just getting on with it. I’m graduating in 2020 so I’m just counting down the days x", "author": "_sarz", "created": 1551344813, "upvotes": 2}, "ehgo2ea": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgo2ea/", "text": "Yeah basically. I’ve gotten used to it at this point. I think even after college its gonna be the same situation. We just gotta appreciate the small things and roll with the punches. ", "author": "Daft_Newell", "created": 1551343079, "upvotes": 2}, "ehgnbc6": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgnbc6/", "text": "Where are you in your college courses? Are you taking lower division general ed or upper division for your major? \n\nI find the latter to be much more encouraging because I actually care and have interest in taking those classes.", "author": "ClericalAnnexation", "created": 1551341965, "upvotes": 2}, "ehgm9dm": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgm9dm/", "text": "This was me until I found something I like. Happened to be aquaculture, now I have a goal I can focus on that means something more than a piece of paper. I suggest figuring out what you’re working towards, make sure you actually want to do it for you, and use it. The way I figured it out was by sitting down to do schoolwork, and letting my mind wander to other things. Eventually I kept coming back to aquaculture and foodservice. Good luck", "author": "CrusztiHuszti", "created": 1551340469, "upvotes": 2}, "ehgm635": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgm635/", "text": "Unlike a job there’s no paycheck, college is like waiting 4 years to get paid. It’s tough af and don’t be too hard on yourself. \n\nDuring the 4 years it feels like it’s not the right answer, not until it starts to answer real life problems, how to go out and party more to meet people and get laid, how to get money, how to feed the needs of the cravings. ", "author": null, "created": 1551340338, "upvotes": 1}, "ehgl6sm": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgl6sm/", "text": "Yeah man. We all feel that. It sucks too cuz I tell myself I’ll do better next semester. Nope. ", "author": "WynterSkye", "created": 1551338949, "upvotes": 2}, "ehgkz0v": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgkz0v/", "text": "This is me right now. But I,m in online classes only so I,m trying really hard to motivate myself. I have to finish a rough draft on the short and long term affects of chronic insomnia that's due tomorrow. ", "author": "Bluebearje", "created": 1551338656, "upvotes": 2}, "ehgktxg": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgktxg/", "text": "This is the same with me kind of, I start off doing my best to not procrastinate but slowly and slowly I get too. However, no matter how much I do procrastinate I always finish all my work when it is due. I may push it to the last moment but I’m the type of person who always dependable on school work. So much so that one of my teachers stopped checking if I did homework because he knows I always do.", "author": "justin_v12", "created": 1551338465, "upvotes": 2}, "ehgila2": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgila2/", "text": "i’m so glad i’m not the only one ", "author": "sadxtortion", "created": 1551335545, "upvotes": 2}, "ehgi64y": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgi64y/", "text": "It's the opposite. I'm usually lazy at the start of the semester. Lazy and sick. ", "author": "lg-baby", "created": 1551335036, "upvotes": 2}, "ehggy0i": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehggy0i/", "text": "/r/me_irl", "author": null, "created": 1551333606, "upvotes": 5}, "ehgg6kq": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgg6kq/", "text": "Yeah that’s because over the course of the semester you remember the reality of jumping through seemingly (and sometimes actually) arbitrary hoops for someone who doesn’t care while you don’t get paid for it. The panic of being behind on your work dulls that sensation and you forget, wondering how you got here. You promise to do better, as you’ve forgotten what caused this in the first place. Then the cycle repeats. ", "author": "ConradtheMagnificent", "created": 1551332754, "upvotes": 2}, "ehgfvw2": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgfvw2/", "text": "I'm a senior and that's my life. I'm pretty good at it now though. I'd say that's what college teaches you though. Diamonds are made under pressure", "author": "realryang", "created": 1551332443, "upvotes": 2}, "ehgfoou": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgfoou/", "text": "Lol this is me, but this semester my Circuits, Investigation and Neumatics teams are full of people that don't do shit. I have to do everything so at least my procastination isn't kicking in. It may sound evil but what keeps me going through is that I am going to pass and they are not.\n\nGood luck bud, you can do it!", "author": "Georgieboi98", "created": 1551332221, "upvotes": 2}, "ehgfo27": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgfo27/", "text": "You started the semester off with incredible determination? Spread some of that over here will ya. lol", "author": "Lukerpooker", "created": 1551332201, "upvotes": 2}, "ehgfb2u": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgfb2u/", "text": "Thanks for sharing, at least I know I'm not alone. I always hear people around me saying how much they procrasinate and stuff but I don't think they realize how bad it actually is for me...", "author": "Rakster505", "created": 1551331828, "upvotes": 2}, "ehgf257": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgf257/", "text": "Not to such an extreme degree but this is me rn. I've just had two busy weekends where I could've gotten work done but I decided to use the relatively little free time I had to relax instead. Unfortunately this means I have to use time during the week to catch up, when I'd rather be using that time studying and staying ahead. Fortunately I only have a week and a half until spring break - once I finish everything before then I can just do a \"hard reset\".", "author": null, "created": 1551331574, "upvotes": 2}, "ehgezt6": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgezt6/", "text": "You are sharing my pain. This has been going on ever since I could remember and I believe it will even follow me in grad school.", "author": "phymathnerd", "created": 1551331508, "upvotes": 3}, "ehgej0q": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgej0q/", "text": "It’s why I feel like I can’t go to college being a dropout ", "author": "SilentJon69", "created": 1551331046, "upvotes": 2}, "ehge9ry": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehge9ry/", "text": "Most relatable thing I’ve ever seen ", "author": "iDaddy420", "created": 1551330792, "upvotes": 2}, "ehge3v4": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehge3v4/", "text": "I procrastinate to feel alive. I love the adrenaline of worrying if I’m going to make the 11:59 deadline. It’s the only source of dopamine my caffeine crazed body can muster \n\nJk I’m just a POS :(( ", "author": "proxalfy", "created": 1551330632, "upvotes": 8}, "ehgdxol": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgdxol/", "text": "Try nofap", "author": "Chizzledman", "created": 1551330464, "upvotes": -1}, "ehgdvnt": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgdvnt/", "text": "I broke out of it after being in it all my life. It happened my junior year.\n\nIt literally just came down to the realization that I'm going to be doing the exact same amount of work regardless of when I start it. That's all.\n\nSo why not do work once it is assigned? You can get it done sooner, you're more relaxed while doing it, you can ask the professor when you're stuck (and they'll appreciate fielding questions when an assignment is new, rather than the day before it's due), and you can guarantee yourself a good grade. \n\nWhat I would say is that determination, inspiration, motivation -- these words mean nothing. It's nice to have motivation, but it won't last you 4 straight months. The only thing that ever matters in college is discipline. If you can work when you don't want to work and can manage your time accordingly, you'll go far in life. ", "author": "hatewrecked2", "created": 1551330405, "upvotes": 142}, "ehgdehy": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgdehy/", "text": "Thankfully this semester I have beaten it. I just feel like I’m punching every assignment in the fucking face. Submitting shit a month ahead. \n\nTrying not to drown but the stress is getting to me. ", "author": null, "created": 1551329939, "upvotes": 24}, "ehgc6r4": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgc6r4/", "text": "hey that's me ***right now***", "author": "liberatelatios", "created": 1551328795, "upvotes": 2}, "ehgc5m2": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgc5m2/", "text": "I don’t think the 10 week schedule helps. I have a midterm every week and a project every other. I don’t feel like I have enough time to take a break and whenever I do take a mental break I regret it and feel guilty afterwards. I still don’t understand how students in my classes make As and are mentally sane ", "author": "frostyclawz", "created": 1551328767, "upvotes": 2}, "ehgbz1v": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgbz1v/", "text": "This is me right now. Idk why I'm like this", "author": "AmatureProgrammer", "created": 1551328599, "upvotes": 2}, "ehgbxxi": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgbxxi/", "text": "I used to feel like this definitely. A couple of major things have changed for me though which have helped me start to turn this around. First, I found a major I actually wanted to take (English). Second, I started going to bed at a reasonable time (before midnight) on a regular basis during the week. Third, I started eating better and exercising more, which have helped me with my overall mental health too, which I think was a huge part of my procrastination problem. Also if your school has counseling services maybe go to that? I don't go to counseling but I do go to free weekly chiropractic services which keeps me loose as a goose all week. I'm a huge proponent of the theory that if your body feels good then so will your mind. Your school probably has a ton of shit you don't know about that's designed to help you be more productive and I've only recently started utilizing it, in so doing realized that people don't actually use the resources being actively given to them.", "author": null, "created": 1551328569, "upvotes": 2}, "ehgbjnz": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgbjnz/", "text": "What helped me out with this a bit was doing my work and studying around other people that can and can’t be in your same major/classes. Having someone else being on your ass about stuff is way more effective than being on your own ass about it imo. \n\n", "author": "sligaro", "created": 1551328212, "upvotes": 2}, "ehgaszm": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgaszm/", "text": "Yes, except this last semester, my final semester, I've so far been able to keep up. I think it's because I finally have an office space again and I'm actually succeeding in forcing myself to work on stuff. \n\nAnI can see the light at the end of the tunnel and it's beautiful. ", "author": "MocknozzieRiver", "created": 1551327550, "upvotes": 3}, "ehgare0": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgare0/", "text": "This is me. By the the time Spring or Fall break rolls around the motivation is gone. I guess sometimes I get excited about new classes and learning something new that I start out motivated and determined and then once I realize the classes aren’t that thrilling it just goes away. ", "author": null, "created": 1551327512, "upvotes": 3}, "ehgaqh3": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgaqh3/", "text": "For me it’s usually the other way around. I start off slowly and progressively work better as I get more into the routine of semester. ", "author": null, "created": 1551327489, "upvotes": 2}, "ehgais2": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehgais2/", "text": "Yup. As a music major I have learn songs by ear every week and I always push it off till the day before and end up doing a shitty job but who needs motivation?", "author": "racistfire", "created": 1551327301, "upvotes": 6}, "ehg9wqx": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg9wqx/", "text": "I do this. I'll have a week to do something, but end up working on it until four AM that morning and only getting a few hours of sleep ", "author": null, "created": 1551326782, "upvotes": 2}, "ehg955i": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg955i/", "text": "Use breaks and 3 days weekends to catch up. While they are a time to relax it can also be a time to get back on track with work. Remember, your brain is gnna want to take the easy way out but you gotta get past it. Someone who can beat their mind can beat the college stereotype of procrastination.", "author": "Animeaning", "created": 1551326143, "upvotes": 19}, "ehg8l6u": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg8l6u/", "text": "This is me right now, I've had one hell of a week filled with lots of work and tests and those just keep coming. I should be studying for a quiz tomorrow at 7am but I'm just doing nothing knowing damn well that I have to get good grades. This semester has sucked ass from the start and it keeps getting worse by the day. I'm really considering if its even worth staying in college.\n\n&#x200B;", "author": "Darkporky", "created": 1551325689, "upvotes": 12}, "ehg8dl8": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg8dl8/", "text": "Yup. I feel that. \n\nI have been told I was ~gifted~ since like the 2nd grade and college made me realize I’m not fucking gifted, the school system just sucks. \n\nSo it’s a constant reminder of how dumb I actually am. ", "author": "rogertaylorkillme", "created": 1551325516, "upvotes": 185}, "ehg88dw": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg88dw/", "text": "This happens to me during the spring semesters. The weather is usually pretty great, and, maybe it's just me, but the workload is often harder and more stressful than it is during the fall. ", "author": "MegaSpidey3", "created": 1551325399, "upvotes": 2}, "ehg6xfk": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg6xfk/", "text": "Maybe it's because I'm a freshman, but so far I've managed to stay on the grind with only a bit of laziness... kind of worried that I'll have really bad burnout later on.", "author": "chkyan", "created": 1551324363, "upvotes": 2}, "ehg61d0": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg61d0/", "text": "Lmao the procrastination doesn’t hit you first second back on campus? Smh", "author": "Malorn44", "created": 1551323667, "upvotes": 2}, "ehg4y6a": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg4y6a/", "text": "Laziness and procrastination doesn't kick in after a month. It kicks in immediately each time you put something off. Make a schedule, keep an agenda, and stick to it.", "author": "Atraidis", "created": 1551322812, "upvotes": 3}, "ehg4re5": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg4re5/", "text": "I use to have this issue as well. But I feel like the more classes you take, the less time you can afford to procrastinate. So in other words, take a bunch of classes to keep yourself busy at all times. ", "author": "CornClouds", "created": 1551322663, "upvotes": 2}, "ehg4q4o": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg4q4o/", "text": "This is my first semester, but i haven' had TOO much issue with getting my work done, it's finding time for my hobbies that's hard. You have to treat it like a job, if you don't you won't succeed. I treat it like any day in the Army, just show up at the right place and right time with your work done.", "author": null, "created": 1551322636, "upvotes": 4}, "ehg4lwp": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg4lwp/", "text": "this is definitely me. If it helps, sometimes I just remind myself that the semester is \"only 16 weeks\" and it's not going to be forever. Sometimes it makes me feel better about working hard now and relaxing later but other times I just procrastinate nevertheless.", "author": "ReachandCrackTheSky", "created": 1551322542, "upvotes": 13}, "ehg4jj3": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg4jj3/", "text": "That’s damn near everyone, and if this isn’t you, you prob have an anxiety disorder. College is hard af. Just know you’re not alone, despite how on top of shit your classmates seem", "author": "FoggyFlowers", "created": 1551322491, "upvotes": 3}, "ehg3z7c": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg3z7c/", "text": "This is me. I start the semester off doing my readings (wow), getting ahead in classes, feeling so determined. Nowadays I'm starting my homework 2 hours before it's due. I don't know much about psychology or anything but I would bet it's a symptom of burnout. ", "author": null, "created": 1551322041, "upvotes": 24}, "ehg1oyn": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg1oyn/", "text": "Lol same expect I’ll just stop going to class for days at a time ", "author": "Tommy808s", "created": 1551320219, "upvotes": 6}, "ehg1j5c": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg1j5c/", "text": "I feel attacked by your hint 😂", "author": "Miss_Beech_Tree", "created": 1551320092, "upvotes": 3}, "ehg1b3o": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg1b3o/", "text": "[deleted]", "author": null, "created": 1551319914, "upvotes": 344}, "ehg0i7c": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg0i7c/", "text": "This is me, especially since we’re on quarters so they go by much quicker. ", "author": "bluedreaxm", "created": 1551319287, "upvotes": 47}, "ehg0bjn": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehg0bjn/", "text": "[deleted]", "author": null, "created": 1551319143, "upvotes": 350}, "ehfxhxg": {"link": "/r/college/comments/avl2dh/anyone_else_stuck_in_this_cycle_you_cant_get_out/ehfxhxg/", "text": "Are you me?", "author": "shashon29", "created": 1551316887, "upvotes": 105}}}