{
  "sid": "qbc5n2",
  "link": "/r/college/comments/qbc5n2/how_can_i_get_straight_a_grades_in_college_and_do/",
  "title:": "How can I get straight A grades in college and do more better in school???",
  "text": "Hello everyone, I am about to be a junior in college and I am thinking about doing a double major in finance and business management because these courses overlap together. I don't know for sure if I have a learning disability or a low IQ because I don't know what to do next because I wanted to get a master's degree in finance or to get into a top MBA or something. I am currently struggling a bit with trying to get good grades in college because I keep procrastinating and not performing the best to my ability in school. It's like I keep being lazy and procrastinating. I wanted to know how I can perform the best in my next two years of college as that I currently have a 2.7 as of right now and I am thinking of trying my hardest. At times, I also struggle with paying attention and remembering information sometimes and I just wanted to concentrate as well. Is there any effective studying techniques that you can help with and any type tips?? I have currently taken a semester off from college and I am working but I STRONGLY need to think about my actions and how to get straight A grades from now on. I know it's possible because there's many different variables and factors that are being considered. Someone please help me??\n\n\nEdit: Students with a GPA of 3.8-4.0, what did you do to get nearly straight A grades? What was your strategies and tips and how can I change my life completely??",
  "author": "Critical-Paper",
  "created": 1634652123,
  "updated": 1634654350,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh8hx2b": {
      "link": "/r/college/comments/qbc5n2/how_can_i_get_straight_a_grades_in_college_and_do/hh8hx2b/",
      "text": "Don't worry about Straight A's, just do what you can do best. Unless if you have a scholarship on the line you should do some side projects as those are whats gonna help you a lot",
      "author": "GoldRequest",
      "created": 1634653431,
      "upvotes": 1,
      "replies": {}
    }
  }
}