{
  "sid": "r1h6xk",
  "link": "/r/college/comments/r1h6xk/should_i_have_high_expectations_for_myself_in/",
  "title:": "Should I have high expectations for myself in this situation?",
  "text": "So I graduated high school almost a year ago and I first went into physics then robotics and finally now I transferred into fashion design and i’m genuinely the happiest i’ve ever been.The only issue is that I was never “artistic” or creative growing up.I think i’ve always had a creative side but I never put effort into that side of me so it just never showed.My grades were all straight A in high school especially when it comes to scientific subjects.However,those subjects aren’t my thing other than for studying and getting grades.I’m enjoying fashion design but this is my first semester and i’m struggling.\n\n\nNow I’m struggling not because i can’t understand or can’t do the work,but because i need a lot more time and practice to finish anything since it’s my first time sewing and learning and working with my hands.The professors have such high expectations and compare me to other classmates and point out how slow i am..I mean it’s not my fault?Im literally here to learn and take my time with it.\n\n\nIt’s genuinely my first time working with my hands and i’m making alot of mistakes which I believe is normal..right?\n\nI practice a lot  in my free time and I genuinely try my best to perfect whatever i’m doing even if it’s my first time.I just compare myself to others and i end up with zero confidence .\n\nI’ll probably fail this semester honestly but i still learned a lot..What should I do?\n\nI just need time and practice.\n(also i have ADHD and it makes everything 10x more difficult)",
  "author": null,
  "created": 1637793538,
  "updated": 1638207233,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hlzfwxg": {
      "link": "/r/college/comments/r1h6xk/should_i_have_high_expectations_for_myself_in/hlzfwxg/",
      "text": "Be gentle with yourself. Learning a bunch of new, small skills to combine into one much larger new skill! That takes time, and your professors should respect the effort you’re putting in, no matter how long it’s taking you while you’re learning.",
      "author": "sugarcult01",
      "created": 1637807298,
      "upvotes": 1,
      "replies": {}
    }
  }
}