{
  "sid": "prbuae",
  "link": "/r/college/comments/prbuae/first_virtual_career_fair_tomorrow_i_have_no_idea/",
  "title:": "First virtual career fair tomorrow. I have no idea what to expect.",
  "text": "\nI’m a junior and this will be my first career fair for a summer engineering internship. I always avoided career fairs because of how they terrified me, but this time I forced myself to attend one because I need the experience. Tomorrow I have interviews for 3 jobs, 10-15 minutes each. The problem is I have no idea what to say or expect. I’m expecting to just freeze up and have no idea what to say. Can someone give me the basic layout on how these things usually go?",
  "author": "mody_bird_s",
  "created": 1632070891,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hdi70ib": {
      "link": "/r/college/comments/prbuae/first_virtual_career_fair_tomorrow_i_have_no_idea/hdi70ib/",
      "text": "Your most important fundamental skill in all of engineering is critical thinking, or problem solving.  \n\nTurn your engineering-mindset on, and approach the problem with critical thought.  \n\nEmployers in attendance paid for the privilege of interviewing you and your peers.  \n\nThey know you are students.  \nThey know you have trivial amounts of experience.  \n\nSo what are they probably looking for in the absence of experience?  \nEnthusiasm? Curiosity? Positivity? Excitement?  \n\nWho are the companies you will be interviewing with?  \nDon't tell me, I don't care -- but you should care.  \n\nWhat do they make?  \nWho are their competitors?  \nHow is their business?  \n\nGoogle: Yahoo Finance <company name>  \n\nYeah I know Yahoo is pretty old-school, but their Financial News aggregator is still surprisingly solid.  \n\nLet's try: \"yahoo finance general electric\" just as an experiment.  \n\nSmack center you see a histogram of their stock price. Click the 5Y to see the 5-year history.  \nOuch. They've lost more than half their value in the past 5 years. That stings.  \n\nScroll down to skim some news highlights.  \n\nThere is an article from Motley Fool summarizing what they see as a forecast for GE. That might be worth skimming.  \n\nThen you see some news about GE selling part of their nuclear business and potentially trying to expand into greener energies.  \n\nOk, so now you have a kind of warm & fuzzy understanding about who they are.  \n\nLet's ponder what you might be in for.  \n\nThis is Fall Career Fair.  \n\nIt's tough to try to make a proper internship experience work while you are in classes. So, this might be a compressed internship over winter break, or it might be a long, slow Co-Op work opportunity.  \n\nHow many hours of work are they looking for per week?  \n\nIs this a staff augmentation engagement, or is this a formal internship or Co-Op program?  \n\nStaff Augmentation means you are cheap (student) labor. They will throw work at you, and you'll try to figure out how to do it.  \n\nFormal Programs have much more mentoring and training involved.  \n\nStaff Augmentation programs *can* pay more.  \nFormal Programs have a better long-term pay-off if you do well.  \n\n-----  \n\nRelax. This isn't life or death.  \n\nBe engaged. Show interest in the opportunity.  \n\nEverything is gonna be ok.",
      "author": "VA_Network_Nerd",
      "created": 1632082067,
      "upvotes": 5,
      "replies": {
        "hdinpfp": {
          "link": "/r/college/comments/prbuae/first_virtual_career_fair_tomorrow_i_have_no_idea/hdinpfp/",
          "text": "This really helped calm my nerves. Thank you so much for the useful information",
          "author": "mody_bird_s",
          "created": 1632089116,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050630
}