{"sid": "d1kopy", "link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/", "title:": "Roommate refuses to lock the dorm door", "text": "My roommate REFUSES to lock our dorm door, I’m a band member and own multiple instruments, an expensive computer, monitor, iPad and more. The other day I opened my door to find a person I had never seen before standing in the middle of my room, I said “hey man!” And the rando said “hey!” And bolted past me, out the door and down the hallway to the elevators. I told my roommate about this and he just says “he probably just had the wrong room” I have confronted my roommate 3 or 4 times and I told him he has to lock the door, today over snapchat this was his word for word message he sent “Dude I’ve already been here a year and me and my buddies know everyone on this floor nothings getting stolen bud. You can lock it that’s fine but I’m not going to” this got me absolutely fuming, I feel like I’m about to explode and I feel the moment he enters the room I’m going to go berserk. The RA has been gone for the past couple days including today so I have nobody to turn to. Any tips? On both calming me down and getting him to lock the door, I don’t feel like having to pay what would be equal to another year of college if my instruments get stolen, not to mention the sentimental value of them from the generations before me that passed them down.\n\nEdit: is there anyway to get him kicked out of my room? If it helps, A few days I found his secret stash of Busch Light, and he vapes like crazy when I’m not around, when I go into the room from a day full of classes, it reeks like burning sugar.\n\nEdit: I do have a description of the random who was in my room before and his shirt had a last name on the back I’ll definitely bring that up with my RA\n\nEdit: I gotta get to sleep and it’s nearly 1:00, I got a class at 9:00, I’ll save the sleep deprivation for exams later in the year, thanks for the sound tips, and the funny things you guys are saying in the comments. you guys rock..... and roll. See y’all in the morning.\n\nUpdate: I have set an appointment with the RD today at noon, it is currently 10:00. At first they said he wasn’t available today, until I brought up that it was a security issue. They said it needs to get resolved immediately so they are making an exception. Wish me luck on making my case, I’ll update you guys on what happens\n\nUpdate: my RD said that I need to file a police report and have the police talk to my roommate directly, also they are going to expedite the moving process and get him out of my room within a week, also spotted my RA at lunch and he said he is going to take care of it immediately.\n\nUpdate: Police said they are going to talk to the RD to set up a talk to make sure he locks the door, in the meantime while they get the move paper work finalized. I don’t think he is going to be very happy about the police showing up at our door, but that’s the price you pay when you don’t have respect for others.\n\nGUYS, FINAL UPDATE: My roommate is moving out tomorrow, officially, 1 floor down. I am ecstatic thanks for all of your guys’ help!", "author": "Jeep_Joe", "created": 1567995612, "retrieved": 1632802446, "over_18": false, "upvotes": 881, "upvote_ratio": 0.98, "comments": {"f0ijvqt": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/f0ijvqt/", "text": "Gotta look out for you mate. Do my part to save you from yourself.", "author": "Tullymayne_iv", "created": 1568642816, "upvotes": 1}, "f0ii2op": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/f0ii2op/", "text": "I can’t believe you are not embarrassed to be posting about having an issue with vaping... is that how soft our younger generations have become? You are in college it’s time you take that massive stick you’ve had wedged up your arse since high school and live and let live. I seriously can’t wrap my head around how someone vaping around you rattles you. All you gotta do is place a cheap camera in your room and activate it when you leave so if anything ever goes missing you simply reference to video of that day and file a complaint or whatever against the person seen stealing on your camera. \n\nI highly encourage you to try with all your little boy strength might and be a laid back easy going cool dude. Use the camera and avoid complaining to the RA and those above him. You’ll isolate yourself as “that douche” and spend the next 4 years trying to shake that reputation you made for yourself the first month of freshman year. Trust me when I say that even though many things are forgotten about over time, no one forgets who the snitch bitch is.", "author": "Tullymayne_iv", "created": 1568642072, "upvotes": 0}, "ezu5jnk": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezu5jnk/", "text": "Don’t talk anymore. He/she is being an ass! \n\nNow is NOT the time for talking anymore. Tell the RA or housing staff.", "author": null, "created": 1568145775, "upvotes": 1}, "ezscnup": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezscnup/", "text": "The worst thing you can do any situation like this is to lose your emotional cool. Contact the head office anyone and let them know what is going on and that you must change rooms immediately. If they don't cooperate, seriously, seriously consider changing schools, they don't deserve your tuition. Anything that does get stolen I would take to legal resorts for lost of money. This is not cool, but agian, I must stress not to do anything irrational such as blowing up, keep it to yourself, you don't want him to use anything against you.", "author": "thisguy223455", "created": 1568087252, "upvotes": 1}, "ezqva0w": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezqva0w/", "text": "[deleted]", "author": null, "created": 1568064377, "upvotes": -2}, "ezqmbom": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezqmbom/", "text": "Steal his stuff and act like someone broke in.", "author": "OkayTalk", "created": 1568061168, "upvotes": 2}, "ezqkn3z": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezqkn3z/", "text": "Go to the Building Manager. If there is not one, go to the Dean of Students. Your roommate is a big problem, and needs to be dealt with ASAP.", "author": null, "created": 1568060519, "upvotes": 2}, "ezqffbx": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezqffbx/", "text": "Roommate change. End of story. It’s an administrative issue", "author": "Dorothy_Day", "created": 1568058529, "upvotes": 2}, "ezqccf6": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezqccf6/", "text": "I went through something like this but instead of a dorm room it was a fucking house. For some reason, my housemates were incapable of locking the front door. When I told them to just, you know, lock the damn door they would always say, \"Oh my God man just relax random strangers aren't going to walk in through the door\" or \"Our neighborhood is safe relax\". The amount of times I'd wake up at 6am just to see the door unlocked drove me crazy. On a few occasion, our door would even be wide open. \n\nThis is just some next level laziness. How some people are unable to do something as basic as locking the door is beyond me. I'm so glad I'm out of that place.", "author": "Eye_Refuse", "created": 1568057432, "upvotes": 2}, "ezq9utl": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezq9utl/", "text": "The updates are what I am here for. Glad to hear this is getting resolved.", "author": "Agent-Shark", "created": 1568056565, "upvotes": 4}, "ezq7qn3": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezq7qn3/", "text": "Maybe some of his shit needs to go missing to get the message", "author": "lafiaticated", "created": 1568055822, "upvotes": 2}, "ezq30ph": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezq30ph/", "text": "it seems like you got this resolved, but I'll echo what other people have said, and that's that even at 'safer' schools shit still gets stolen. I go to a small (~2500 undergrads) historically women's college with small dorms (mine last year had about 65 students, so we knew everyone who lived in the building) and there was still shit stolen. someone went around to my floor last year trying to steal medications (only antipsychotics and super ibuprofen actually got stolen). I know someone in a different dorm that got electronics stolen from their room. Another person had her seizure meds stolen a couple years ago, so she always locks her door, but her closet was outside of her room last year (yay old ass houses, theres a lock for that too but who tf is gonna lock their closet) and someone targeted her and threw all of her stuff around her closet to send her a message. \n\nNow, I still don't usually lock my door. I just dont have anything in my dorm room that I think is worth stealing, and nothing of super sentimental value. but still, last year, when all of this shit was going down, my roommate and I still had an agreement that if we either of us felt uncomfortable leaving it unlocked, we would try our best to lock our door. It's a shared space and something like security isn't something that you can really compromise on. Your roommate clearly doesn't respect you or your ability to feel comfortable in your personal living space, and I'm glad your res life staff is helping you to address the situation. if they start to stall on your roommate moving out, I would request an immediate relocation. just logistically it's a lot easier and faster to move a willing party (you) than an unwilling one (your roommate).", "author": "726e82", "created": 1568054119, "upvotes": 3}, "ezpuv0j": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpuv0j/", "text": "Take his stuff and hide it to make it seem like someone stole it", "author": "KratosKrist", "created": 1568049085, "upvotes": 3}, "ezpunuj": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpunuj/", "text": "the OP sounds like a kid I would hate", "author": "Tullymayne_iv", "created": 1568048952, "upvotes": -2}, "ezpu7lf": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpu7lf/", "text": "Thank fuck the dorms at my school automatically locked when they closed, similar to a hotel room door. I wonder why some schools don't do that.", "author": "ToxicPilot", "created": 1568048648, "upvotes": 5}, "ezpsnc7": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpsnc7/", "text": "I slept at my friends college appartment when there was a huge party and they had this kind of \"social room\" with a playstation and a JBL boombox and I met this group of guys who were also like me just sleeping over and one of them just took off with the JBL boombox, nobody knew who he was.", "author": "Dikkelul27", "created": 1568047605, "upvotes": 2}, "ezps760": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezps760/", "text": "[deleted]", "author": null, "created": 1568047301, "upvotes": 2}, "ezpmtkt": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpmtkt/", "text": "Steal all his shit. That'll learn him.", "author": "CunninghamsLawmaker", "created": 1568043757, "upvotes": 2}, "ezpmnv5": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpmnv5/", "text": "Lol college always has thieves and opportunists. People won’t hesitate to yeet your stuff.", "author": "giny33", "created": 1568043652, "upvotes": 4}, "ezpmm0z": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpmm0z/", "text": "Yeah do what you can and I saw some people give good advice.  If you are worried though, I’d look in to Dorm Room Renters Insurance.  If you have car insurance, call your company up. If you don’t, ask your parents to see if the insurance company they use offers it.  There’s independent companies that offer it and it’s pretty check. Just make sure that you get one with a low deductible. It will cover theft and damages. Here’s a list of good companies for the insurance.   [THE BEST DORM ROOM RENTERS INSURANCE FOR STUDENTS](https://thecollegeinvestor.com/31971/dorm-room-renters-insurance/)", "author": "DrCravenMoorehead", "created": 1568043618, "upvotes": 2}, "ezpkixg": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpkixg/", "text": "All these people saying talk to him like he’s a relational guy lmao, he won’t lock the door so he’s an idiot. Just use all the alcohol and vape he has for blackmail and if he “forgets” to lock the door one more time get him kicked out.", "author": null, "created": 1568042411, "upvotes": 3}, "ezpj5e7": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpj5e7/", "text": "Hide something valuble of his.", "author": null, "created": 1568041652, "upvotes": 2}, "ezphv92": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezphv92/", "text": "You might double check the dorm rules for security.  It should say that rooms have to be locked when you aren’t in them.  Where’s the RA that he or she isn’t around?  If you can’t get assistance through the RA, go up a rung and speak to the people in charge of the dorms and ask to be reassigned or have him be reassigned based on his refusal to secure the room, and cite that you already found one unauthorized person in your room with your valuables.  Until you get this fixed, see if you can store your band equipment in the band room or some other place to minimize loss.  I would also suggest talking to campus security because they might know regulations that you don’t know.", "author": "SalisburyWitch", "created": 1568040951, "upvotes": 2}, "ezphovo": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezphovo/", "text": "This happened to me my sophomore year. I lived in a triple campus apartment with two other girls. I always locked the door whenever I left, especially because I experienced a burglary when I was young. The girls would text me while I was in class or at work saying that I locked them out and demanded that I get home ASAP to unlock the door. They refused to lock the door or take their apartment keys with them anywhere. Why, I’ll never know. I talked to my RA about it. She offered to come to my apartment and talk to my roommates, but they went to their room and pretended not to be home every time the RA came by to discuss locking doors. The RA told me that because we were all legally adults, she couldn’t force my roommates to talk to her, so I was SOL unless I switched rooms. \n\nKeep the lines of communication open with your RA, but also know that they may not be able to change your roommate’s behavior or even speak to your roommate. Start a discussion about changing rooms now, as it can be a lengthy process. Good luck!", "author": "psychjewell", "created": 1568040853, "upvotes": 4}, "ezphhqq": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezphhqq/", "text": "It would be a real shame if some of his stuff got misplaced and he thought it had been stolen.", "author": "hogwartstrekkie", "created": 1568040744, "upvotes": 2}, "ezpgce8": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpgce8/", "text": "I haven’t seen this anywhere yet but if this continues to be a problem, maybe it would be beneficial to invest in a locker for your valuables? Your music department probably has instrument lockers you can rent, and something smaller could be used for your devices if you’re really worried about them and nothing is being done about it (I know the devices/computer stuff would be much more difficult to do this with, but it is an idea just in case)", "author": "goddess_of_sarcasm", "created": 1568040118, "upvotes": 2}, "ezpcl12": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezpcl12/", "text": "If your floor RA isn’t there you can try to see if there is an RA on-call who can assist you or you can go directly to your res life office. Good luck!", "author": "Ajaxx42", "created": 1568037950, "upvotes": 3}, "ezp8ba3": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezp8ba3/", "text": "Steal all his shit and say someone robbed you guys.", "author": "JustBrolic1", "created": 1568035307, "upvotes": 6}, "ezp89v6": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezp89v6/", "text": "Have someone steal his shit and leave it out on the lawn. Tell him that will continue until he learns to lock the door.", "author": null, "created": 1568035280, "upvotes": 4}, "ezp81nf": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezp81nf/", "text": "[deleted]", "author": null, "created": 1568035129, "upvotes": 3}, "ezp76ta": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezp76ta/", "text": "Any RA can deal with this, if your RA isn't available, go to another. If you can't find one, hit up the housing people in person or through email. Get receipts of the texts.", "author": "Edywang", "created": 1568034551, "upvotes": 5}, "ezp5n3w": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezp5n3w/", "text": "Had the same problem with my roommate as you do yours. Then hundreds of dollars worth of my stuff got stolen and nothing could be done because the door was left unlocked.", "author": "thorik1998", "created": 1568033575, "upvotes": 7}, "ezoy2os": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezoy2os/", "text": "Write an email to the housing people and try to get moved to a different room/ your own room. Maybe dorm life isn’t the way to go. Get an off campus apartment", "author": "WobleWoble", "created": 1568029925, "upvotes": 2}, "ezotmoa": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezotmoa/", "text": "I really wanna smack your roommate. Just cause nothing has happened doesn't nothing will ever happen. If I were his roommate I'd hide his expensive stuff or just sell it just to 'teach him a lesson.' I won't even feel guilty about it.", "author": "WhipsandPetals", "created": 1568028049, "upvotes": 4}, "ezoplw3": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezoplw3/", "text": "You confronted him, he said he refuses to lock it because he knows no one will steal your stuff. If he’s so sure about that then tell him if anything gets stolen he pays for it, since he wants to carry responsibility on your stuff. He will get the message and start using his brain and lock the door; because that guy clearly is an idiot.", "author": null, "created": 1568026309, "upvotes": 4}, "ezomon2": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezomon2/", "text": "[removed]", "author": null, "created": 1568025013, "upvotes": 1}, "ezom0hm": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezom0hm/", "text": "I would contact the RA. This joker knows the rules and if they aren't following them then they can be kicked out. Also he shouldn't be making your life miserable as it is your dorm and you are paying good money for it.", "author": "EsmeFrost", "created": 1568024708, "upvotes": 3}, "ezoiz87": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezoiz87/", "text": "I can't believe there someone like this exists lol has he not watch crime shows? you more likely to be robbed/ killed if they have an easy way in and out. Why are people not scare of this crap? also rape is a big concern just because (it sounds like you two are men) it doesn't you can't get sexual assault/ rape by someone in your sleep. You should still go to the TA about the random guy going in rooms though. He probably stole something and you guys don't realize what it is yet.", "author": null, "created": 1568023328, "upvotes": 5}, "ezo86t3": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezo86t3/", "text": "A few cans of beer isn’t going to get him kicked out. Also at my school if you request a room mate change you have to meet with the RA for mediation then the head of Residential Services then if both agree you would be the one moved.", "author": null, "created": 1568018201, "upvotes": 7}, "ezo7v9i": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezo7v9i/", "text": "I'm an RA and at least at my uni all residents have the right to safety and security of their rooms including locked doors. Not locking doors when there's the desire to is a violation of housing policy and your roommate can get busted for it.", "author": "OGMagicConch", "created": 1568018043, "upvotes": 15}, "ezo67hd": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezo67hd/", "text": "Where exactly do you think someone who stole your trombone is going to take it? You're in the middle of nowhere. Also, I have good news for you: no one wants your trombone. People who play the trombone already have trombones. \n\nThis is all annoying for sure but it seems like you're having other normal roommate issues that you need to resolve that may be making this issue about the doors feel more urgent than is really reasonable. Try meditation!", "author": "that_tom_", "created": 1568017231, "upvotes": -9}, "eznvi6k": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznvi6k/", "text": "[deleted]", "author": null, "created": 1568012197, "upvotes": -4}, "eznudxp": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznudxp/", "text": "Change roommates ASAP. I never understood dumb fucks who don't lock their door. I had this situation twice and it wasn't worth it. After telling them a couple times I went and handled it with staff.    \n\nThis guy is a fucking idiot. Your \"buddies\" are usually the main ones that steal from you 90% of the time. If not them, one of their sketchy ass friends they bring over.  \n\nThis is part of why I never have people in my apartment unless I know them. People steal. Rich. Poor. Cool. Uncool. On drugs. Sober.", "author": null, "created": 1568011688, "upvotes": 35}, "eznrbmr": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznrbmr/", "text": "I would talk to your RA at this point. The unlocked door is also a liability for the college and a safety issue so the RA can take care of the issue for you since you already tried. Also, you want a paper trail so I would email the complaint just in case you do end up getting your things stolen because of your roommates neglect. It will also help you get moved to another room if it comes down to becoming necessary.", "author": "ophelia667", "created": 1568010309, "upvotes": 7}, "eznpm8y": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznpm8y/", "text": "Ya I’d switch rooms in a heartbeat. Me and my roommate ALWAYS lock our door even though we pretty much trust everyone one on our floor. Don’t take the risk of having your shit jacked just because your roommate’s a delusional twat", "author": "afterschoolsnacks19", "created": 1568009551, "upvotes": 11}, "eznnlzp": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznnlzp/", "text": "That is college dorm life, I hate living in Dorm because there is always a people like that who pull a prank, RA just wants to reconcile with your worst enemy and often absent only in office for during classes also only for 6 hours a week and often in housing meeting. They would not do anything about it. I have lost my instant pot, memory foam, t-bone steak, ribeye, and new york strip because of that because it was my responsibility to keep it safe in the box.  That roommate has paid a lot of fine of for stealing, surprise he has not been arrested.", "author": null, "created": 1568008675, "upvotes": 7}, "eznm01z": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznm01z/", "text": "Okay, this is an extremely petty solution so don't do it unless you are ready for the consequences.\n\nHide his important stuff from him and when he freaks out, mention \"hm, we should've locked the door\" and then when he agrees and leaves the room the next day, put the thing on his bed.\n\nAgain, this is not sound advice. Don't do it unless you recognize the possible consequences and are okay with them. The top comment is the best way to go. I'm just a petty bitch.", "author": "arlomilano", "created": 1568007963, "upvotes": 8}, "eznlq66": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznlq66/", "text": "Can you get a lock box anywhere on campus? Does your music program provide one, can you ask your dorm to, or can you simply pay for one in the interim? Forcing him to change his behavior seems futile, snitch on him.", "author": "hestercat", "created": 1568007846, "upvotes": 9}, "eznkuj5": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznkuj5/", "text": "It would probably be easier for you to move out than to get him kicked out.", "author": "numberthangold", "created": 1568007463, "upvotes": 22}, "ezngmud": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezngmud/", "text": "I would personally just start taking his stuff and hiding it in places he won’t find it to simulate theft. Your roommate sounds like a jack ass so he would deserve it. I’m not responsible for what you do tho it’s your call.", "author": null, "created": 1568005662, "upvotes": 9}, "eznevhd": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznevhd/", "text": "for one your dorm room really should not be used as a storage unit. for your computer you can buy a cable that locks the laptop to something in the dorm and you unlock it with the key when you need to bring it with you.\n\n&#x200B;\n\nonly keep essentials there and carry with you expensive things. store everything else somewhere else. hell if you can afford expensive stuff like pc and ipad you can buy a storage unit if you care that much about the items being stolen.\n\n&#x200B;\n\nthere are ways to lock items inside the dorm though so they can not be taken without tin snips or a chainsaw.", "author": "Speedracer98", "created": 1568004917, "upvotes": -13}, "eznbx98": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/eznbx98/", "text": "Have a friend come in and steal a bunch of stuff to teach him a lesson", "author": "DarkskinJesus", "created": 1568003706, "upvotes": 121}, "ezn9qvc": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezn9qvc/", "text": "So the whole “nothing ever gets stolen so I don’t need to lock the door” is a lie. Even on the safest campuses. My school is considered pretty safe, so it’s very common for people to leave doors unlocked when they leave for the day or even when they go to sleep. One time, a girl woke up to a guy standing at the foot of her bed at 3 AM. He left when she told him to, and was arrested at the dorm’s front entrance when he tried to leave. We’ve also had strings of thefts (laptops, electronics, etc) when people take advantage of those who leave their doors unlocked. \n\nSit down with your roommate. Confronting someone over text/virtually does nothing. Talk to him very seriously about this matter, and why it’s not all about him, it’s about you too. You may want to also include the term: if anything of mine gets stolen because you left the door unlocked, you pay. Tell him you’ll get an RA/administrator involved if he doesn’t at least try to make an effort (breaking old habits is hard). Don’t be a dick and rat him out for something completely unrelated (drinking/vaping). This is also not an issue for campus police. This is an interperson, roommate issue that can be resolved either between the two of you or possibly with an RA/reslife third party.", "author": "struggleknot", "created": 1568002842, "upvotes": 257}, "ezn83m2": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezn83m2/", "text": "While waiting for your chance to report his violations (do not hesitate) you need to protect your stuff. Remove your stuff.\n\nKeep your smallest instrument, carrying it with you at all times. The rest go into a rented storage unit, home to your parents, or sold. The same goes for all the rest. When you head off to classes in the morning, the only things left in the room should be cheap laundry.", "author": "oughtoch", "created": 1568002194, "upvotes": 18}, "ezn2s7m": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezn2s7m/", "text": "[deleted]", "author": null, "created": 1568000140, "upvotes": -23}, "ezn0q71": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezn0q71/", "text": "nows the time to \"claim\" something is missing and pin it all on him", "author": "casper89d", "created": 1567999378, "upvotes": 34}, "ezn07q2": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezn07q2/", "text": "Maybe tell campus security? They might give him a talking to. Otherwise see about changing dorms.", "author": "khal-elise-i", "created": 1567999189, "upvotes": 75}, "ezmsnvy": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezmsnvy/", "text": "Talk to him again, directly and seriously (preferably in the room). Explain that if the door isn't locked in the future you'll go to the housing staff. And then do that.", "author": "Laurasaur28", "created": 1567996478, "upvotes": 533}, "ezmrsx5": {"link": "/r/college/comments/d1kopy/roommate_refuses_to_lock_the_dorm_door/ezmrsx5/", "text": "Just snitch him out to your dorm director, they will get it taken care of.", "author": "OrangeKlip", "created": 1567996172, "upvotes": 112}}}