{"sid": "ep1or8", "link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/", "title:": "Is it possible to eat healthy on a college meal plan?", "text": "In the last year I’ve lost 40 pounds, gotten in shape, and feel so much better about myself. I did this partially because it’s my senior year and I’m going to college in the fall. \n\nBut I feel like everyone eats completely unhealthy in college, and you’re surrounded by junk food. To make this even harder, at my college you have to be on a meal plan with just about every meal being on the plan. So I’ll be eating in the cafeteria multiple times a day. Do college cafeterias have healthy eating options? \n\nI just don’t want to get out of shape or gain the “freshman 15” or anything. Any comments appreciated.", "author": "officemichaelscott_", "created": 1579091257, "retrieved": 1632802797, "over_18": false, "upvotes": 573, "upvote_ratio": 0.98, "comments": {"fek3lgl": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fek3lgl/", "text": "I lost 120 lbs while I was in college anything is possible", "author": "fuckbrocolli", "created": 1579191885, "upvotes": 2}, "feiz62z": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feiz62z/", "text": "Negative", "author": "ky-98", "created": 1579151364, "upvotes": 0}, "feit42o": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feit42o/", "text": "My school had a very good salad bar and had low calorie options I would it’s actually easier to eat healthier at the cafeteria but it depends on your school", "author": "redwallchronicles", "created": 1579146512, "upvotes": 1}, "feilpvr": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feilpvr/", "text": "My roommate is big on watching what he eats and working out daily. Me, not so much. Some days he struggles to find something healthy but most days he can find something that is acceptable for his diet. One thing I’ve noticed is that he avoids the salad bar which is a healthy option in my opinion. I’d imagine you will have a salad bar so take advantage of that. I know ours has different meat options on it too like grilled chicken or chicken salad so hopefully you will be able to figure it out. Personally I just eat whenever and how ever much I desire and (thankfully and hopefully it stays this way) haven’t gained any weight as far as I know since being in college. Plus I drink high calorie beer multiple times a week as well. Always been a big eater so not much has changed and honestly I do occasionally skip meals but I think my metabolism is high so that’s what keeps me from being overweight.", "author": "blong2021", "created": 1579141471, "upvotes": 2}, "feil5ww": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feil5ww/", "text": "Not at IU where I’ve seen soda cheaper than a bottle of water", "author": "Beowulf_27", "created": 1579141090, "upvotes": 1}, "feiinkz": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feiinkz/", "text": "Check out some of your college resources! Mine has a nutritionist for students that’s available to go over meal plans or options. Aside from that, just be aware of what you choose to eat, drink plenty of hydrating fluids and GET PLENTY OF SLEEP. I always tend to eat really bad whenever I’m tired.", "author": "knic143", "created": 1579139411, "upvotes": 2}, "feihvtn": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feihvtn/", "text": "Not drinking soda is what really helped me stay in shape I think", "author": "mf9159", "created": 1579138902, "upvotes": 1}, "feignxo": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feignxo/", "text": "I started losing weight after just cooking my own food. I realized they even cook the veggies in oil and there were almost no options that were healthy. However, our school has problems with health violations and stuff so i don’t trust them anyway", "author": "plumpudd", "created": 1579138097, "upvotes": 1}, "feig3w6": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feig3w6/", "text": "So, yeah, that freshman 15 is notorious, but it has a lot of contributing factors: \n\n-people drink (illegally if you’re in the states), and that is a lot of empty calories you’re chugging down, and I remember many a time when I was 19, headed to Waffle House for my hangover meal the next morning. \n\n-no parents to tell you to eat broccoli. \n\n-I mean, pizza IS better than salad. \n\n-people eating at weird hours of the day, so you don’t pay attention to your meal sizes. I would recommend little snicky snacks throughout the day, so you don’t gorge late at night—that’s really what’ll put on the weight.\n\nAbove all, you’ll have to go out of your way to eat healthy at a lot of universities, but there’s plenty of recreational athletic fun times to be had to burn those calories.", "author": "purpleitch", "created": 1579137723, "upvotes": 1}, "feid2fw": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feid2fw/", "text": "No. In so sorry", "author": "DiddyDiddledmeDong", "created": 1579135674, "upvotes": 1}, "feid25a": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feid25a/", "text": "Mostly you can. Its just the stress and time management hat will influence your decisions. \n\nSee if they have any resources for free and healthy foods or meal prepping etc.\n\nIm going with protein/almond milk and banana shakes, almond butters and coconut oils since I crave carbs a lot lately. Also chia flax and psyllium husk for fiber. That should stifle cravings to a point. \n\nHealthy fruits and fibers are our friend!", "author": "opalstranger", "created": 1579135669, "upvotes": 1}, "feib5gr": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feib5gr/", "text": "No", "author": null, "created": 1579134391, "upvotes": 2}, "feiaz4t": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feiaz4t/", "text": "Go to YouTube and type in “brothersgreeneats”.  Then when you’re done watching all those videos, type in “prohomecooks”.\n\nEnjoy!", "author": "sdmst440", "created": 1579134275, "upvotes": 2}, "feiab09": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feiab09/", "text": "Most dining halls have a buffet style set-up. Watch your portions and eat healthy foods. Salad, veggies, fruits, an occasional desert. You can always have snacks in your room also!", "author": "CSGKEV9278", "created": 1579133827, "upvotes": 1}, "fei6sgi": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei6sgi/", "text": "Depending on where you go to school see if there are any discount fruit markets around. Boston has a great one and I’m sure other places do \n\nYah it's a little gross sometimes but you can freeze the good fruit and it's an amazing stockpile to have.", "author": "asphodelusalbus", "created": 1579131550, "upvotes": 1}, "fei545l": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei545l/", "text": "There's actuallly plenty of guides on youtube! There's a ton about bulking, cutting and I believe even maintaining. They are not as cheap as Ramen and water but they shouldnt be more than $20 per week", "author": "Cibiii", "created": 1579130484, "upvotes": 1}, "fei4akw": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei4akw/", "text": "My college meal plan only allows me one meal a day. I haven't eaten today because of that. As well the food isn't healthy. So in my situation no. I have 45 minutes until the cafeteria opens. And then I will eat some food that's been frozen for a month and thawed out.", "author": "SparrowFate", "created": 1579129967, "upvotes": 1}, "fei3ot9": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei3ot9/", "text": "thanks!! good luck!", "author": "ShilohFromOhio", "created": 1579129583, "upvotes": 1}, "fei31mo": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei31mo/", "text": "I lost weight my freshman year! If possible, maybe your school dining hall has a nutritional info chart somewhere for most of the food they serve. That way you can keep track of calories and what's going inside your body. Also I found myself getting sick of dining hall food a lot and started grocery shopping for little healthy snack I cold eat throughout the day. I usually bought stuff like carrots, cherry tomatoes, cucumbers, hummus, turkey, cheese, and stuff like that! Oatmeal and yogurt are great to have as well. For dinner I usually did have to go to a dining hall or buy microwave dinner but I still ended up losing weight since the deficit of calories was enough!", "author": "wilinouthere", "created": 1579129178, "upvotes": 1}, "fei303w": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei303w/", "text": "\\>I feel like everyone eats completely unhealthy in college\n\nThat just a stereotype. I have lots of varsity athletes among my students who are careful about what they eat, nutrition and dietetics majors, and quite a few vegans/vegetarians as well. At least on our campus its entirely possible to eat healthy and well, with lots of options, every day. That said, we are a residential campus that doesn't have commuter students, so everyone is on the meal plan, it's expensive, and the managers are very responsive to students as a result.\n\nThe problem comes with places that have low-quality dining options, only offer fast food, are dominated by commuters (so there are few/no options on weekends), or are simply corporate...some schools have sold their dining operations out to Taco Bell and Pizza Hut, for example.  So in part it's going to be a function of the campus you pick-- be sure to look into the food service as part of your decision-making process.", "author": "SnowblindAlbino", "created": 1579129153, "upvotes": 2}, "fei2nw9": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei2nw9/", "text": "Definitely. While I'm a commuter with my older brother, we sort of don't take food from home all the time since we might be running late one morning. I saw my friends gain weight who stayed on campus- primarily because they ate a lot... way too much I mean. \n\nI can't speak for other campuses, but on mine, we have a makeshift 7-eleven. My brother and I call it that since it sells microwavable goods, snacks, or just premade sandwiches at a reasonable price. We ate over there most of the time, and maybe at the campus restaurants about once or twice a week depending on our budget. The most important thing is to literally make sure you get a decent amount walking! Just walk around the fields- head to the gym for a small walk. You won't gain nor lose weight, trust me.", "author": "LordSkorri", "created": 1579128945, "upvotes": 2}, "fei0gz5": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fei0gz5/", "text": "U could always not eat win win. Save money and pounds", "author": "Rhu_2002", "created": 1579127611, "upvotes": 1}, "fehyqkb": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehyqkb/", "text": "There will be vegetarian and vegan options so steer towards those.", "author": "Cerenya", "created": 1579126569, "upvotes": 1}, "fehyn4b": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehyn4b/", "text": "Yes, yes you can. I’ve been living on campus for the last three years and dropped from 245 lbs to 150 (in a healthy manner). I now regularly exercise and eat right with the food options they have, they will always have healthy options with the caloric amounts there. \nWanna know the secret?\n\nIt’s who you hang out with. I found friends that were fit and active and frequented the gym which gave me the opportunity to do that. Don’t try to find people that sit in their rooms all day and eat like crap. Try to find active people with good habits, this will also translate into your school work. \n\nKeep up the work!", "author": "GenitilsGrievous", "created": 1579126511, "upvotes": 2}, "fehyd7c": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehyd7c/", "text": "Of course! You just gotta be mindful of your portion sizes and try not to eat a lot of garbage (steer clear of the pizza and ice cream). When I had the unlimited dining plan as a freshman, I often went for healthy options like fish, grilled/baked chicken, whole wheats, and steamed vegetables.", "author": "CupcakesWolf", "created": 1579126345, "upvotes": 1}, "fehx6ed": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehx6ed/", "text": "Salads", "author": "IDrankChocolateMilk", "created": 1579125639, "upvotes": 1}, "fehw7fi": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehw7fi/", "text": "Of course! Avoid processed foods at all costs. Eat your fruit and veges. Fruit and veges > meats. If you lack funds, you can apply for SNAP.", "author": "cold-smilehoodie", "created": 1579125088, "upvotes": 1}, "fehvd9y": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehvd9y/", "text": "Most dining halls have a salad bar and decent protein carb options. There may not be a ton of variety but you can definitely do it. But me and everyone I know actually lost weight during freshman year due to skipping meals from class timing not working out, and walking around campus in general, as well as the dining hall closing at a set time limiting late night snacks.", "author": "mbrosie", "created": 1579124614, "upvotes": 1}, "fehuac4": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehuac4/", "text": "Eat healthy work out more. All diets work if you stick to them.", "author": "anonymousperson45", "created": 1579123999, "upvotes": 1}, "fehto6q": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehto6q/", "text": "I lost 30 lb in a semester (over the course of 4 months) on the meal plan. My schedule looked roughly like this:\n\n8am: eat a big breakfast. Usually it consisted of eggs, some form of potato, and some form of meat. And a cup of fruit. Usually around 800 calories\n\n12pm: some kind of light snack. Usually nuts or seeds. About 300 calories. \n\n3-4pm: a big meal. Usually some kind of meat, vegetable, and side. Probably 600-800 calories \n\nI started off overweight to begin with, so by eating 1900 calories a day I still lost weight.  But if you need to eat fewer than that, you can easily modify this schedule to just eat less per meal. The real trick is to only eat one plate at the dining hall. My problem was that I would eat a healthy plate but then have a junk plate or more afterward. But when I switched to only one plate, I just put all the healthy stuff on one plate and avoided the junk.", "author": "mysuperusername7689", "created": 1579123652, "upvotes": 2}, "fehsj1n": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehsj1n/", "text": "Of course. The ONLY reason the freshman 15 exists is because there is a big population of freshman that effectively ends up eating a lot more than they did at home while still burning the same amount of calories.\n\nYes, you *are* surrounded by junk food at the dining hall, but that's no different than being surrounded by junk food at the grocery store. Healthy options exist at both places and anyone who truly wants to eat healthy doesn't have to try hard to find a lot of good options.\n\nAs a person who lost a lot of weight and closely examined dining hall food, I would suggest the following:\n\n1. Eating lots of \"basic foods\" like fruit, vegetables, nuts, eggs, etc. (because these items are pretty universal in terms of their content and they aren't something the dining hall can get a junky version of).\n2. Don't always avoid the yogurt, granola, and milk, but be aware of what type they have. My dining hall has very cheap yogurt (I'm used to Chobani, which to be fair is probably too expensive for them) that has more sugar per cup than our ice cream there. So if you ate the yogurt you might as well have picked the ice cream. The granola is likely full of flour and cheap grains (healthy granola contains mostly nuts and seeds but this is expensive and therefor unlikely to see).\n3. Go for the meat items (chicken, pork, and fish are usually the better options). These are typically all okay and something the dining halls are good at. The one thing I would look out for is heavy sauces, they will often *double* the calories.\n4. If you want to regularly eat the main line items that aren't healthy, my advice is to pair them with healthy options (and therefor they will make up less of your plate and you will still be full). For example: using the main line's chicken alfredo on a salad you made or getting a lot of vegetables and adding in a bit of the orange chicken.\n5. Check the nutrition cards even for the seemingly healthy or more basic items. You will be surprised on occasion when there is a bunch of sugar or processed carbs in items that were healthy when your mother made them.", "author": null, "created": 1579123010, "upvotes": 3}, "fehsiv5": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehsiv5/", "text": "I just transferred last semester and I have actually lost weight on the dining plans! I personally found it easier to manage my diet and be in control of what I'm eating when presented with multiple options. Keep working out though, that is key, and pay attention to when your body is full. Just because you have unlimited swipes doesn't mean you have to eat your whole deposit", "author": "Tumshel", "created": 1579123007, "upvotes": 1}, "fehsc1m": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehsc1m/", "text": "My university had a salad bar and always had gluten free/vegan options. They always tasted like crap, but I actually lost 10 pounds freshman year because I went to the dining halls so much and I could actually control what I ate. Before I was stuck with what my parents had in the house, and they aren't very healthy eaters", "author": "sleepycarabou", "created": 1579122900, "upvotes": 1}, "fehs89g": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehs89g/", "text": "It really is easy. From my standpoint I actually enjoy healthy foods so the salad bar is like heaven to me lol. I actually lost 10 pounds my freshman year of college because of how much I walked around each day and I actually kept working out each day. You should be fine if you make the right choices! :)", "author": "lunarfusedloki", "created": 1579122840, "upvotes": 1}, "fehqklr": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehqklr/", "text": "Yes. I lost weight by only eating salad in college.", "author": "gunzstri", "created": 1579121895, "upvotes": 1}, "fehqgmm": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehqgmm/", "text": "Super easy. Most schools give you 2 meals a day on the basic plan. Make sure to load up on lean protein like grilled chicken which most schools have an abundance of. Make sure to eat plenty of healthy carbs too, preferably rice or pasta and vegetables as well. Eat fruit a lot too and just make sure to eat enough of these foods so that you don’t feel hungry or like snacking on junk. Message me if you need extra help I rushed when writing this.", "author": "AndrewS1793", "created": 1579121833, "upvotes": 2}, "fehq8no": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehq8no/", "text": "As a 12 yr old I am ecstatic to be recommended something I am quite scared of and aren’t even that close to attending thank you reddit.", "author": "ScaryBagel", "created": 1579121706, "upvotes": -3}, "fehq4pg": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehq4pg/", "text": "This is what I do not just to eat healthily but also on a budget;\n\nI buy everything I can in bulk, stuff like rice, beans, quinoa, cereal, oats, and some nuts (for snacks). This way I save money.\n\nKeep my red meats to the minimum, maybe once or twice a month. But I keep my animal fats in a good amount by eating fish and/or chicken once a week.\n\nI Pre-make meals, so for example if I make rice, beans and grilled chicken breast one day, I make sure I have enough for the rest of the week, so I buy a pack of 12 chicken breasts.\n\nWhere I spend most money is in fruits, so I try to buy stuff that can last more than a week, oranges, bananas, and apples.\n\nAnd for cravings and snacking, I just get nuts, and dried fruits, which I can also get in bulk. And just drink water all the time. If I don't feel like having just plain water, I drop one lime and make lemon-infused water (lime is stronger and can make the lemon taste last longer).\n\nI also started buying flour in bulk so when I feel like having a pizza I just bake it myself, is cheaper than ordering out and it tastes better ;)\n\nI hope this is helpful\n\n&#x200B;\n\nedit: mentioned in another comment and I agree, limit your alcohol intake, especially if you're not eating healthy enough.", "author": "saryn4747", "created": 1579121643, "upvotes": 2}, "fehpwzf": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehpwzf/", "text": "If you’re like me, I went into college addicted to nicotine and that’s a good way I’ve repressed my appetite", "author": "DeathViper77", "created": 1579121519, "upvotes": 0}, "fehou8a": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehou8a/", "text": "Make sure your diet is consistent and make sure you pick something reasonably healthy at a decent serving size. Your college might have a gym and it should be free so visit it 2-3 times a week.", "author": "wielderofFire1051", "created": 1579120898, "upvotes": 1}, "fehopj7": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehopj7/", "text": "Just dont overeat", "author": "monkeyburrito411", "created": 1579120821, "upvotes": 1}, "fehnwx1": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehnwx1/", "text": "It is possible! Dining halls will have healthy options, you just have to be careful not to let yourself be tempted by the junk. There will be times you’re stressed and feel the need to indulge, but honestly I think the real reason I have avoided weight gain thus far in college is I never ride the buses, I walk everywhere. Typically I get upwards of 10,000 steps a day just walking from class to class. Things like that on top of additional exercise help a lot to negate any slip ups you might have in the dining hall.\n\nEdit: I also don’t drink. I think that probably helps as well.", "author": "typiyall", "created": 1579120364, "upvotes": 2}, "fehm3ok": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehm3ok/", "text": "Canned vegetables and ground chuck", "author": "joeywisenbaker", "created": 1579119319, "upvotes": 1}, "fehjb7s": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehjb7s/", "text": "Yes but I can be difficult depending on your schools meal quality. At my school I honestly eat healthier here than I do at home but I also have my days where i eat super unhealthy.", "author": "tattooedships", "created": 1579117701, "upvotes": 1}, "fehes7h": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehes7h/", "text": "I think yes. My school has a salad bar, pizza, and burgers standard everyday, but then they have three other self serve areas each with different things, like soups, or different pastas or international cuisine. Its definitely possible, u just need to have your own control.", "author": "smartymarty1234", "created": 1579115051, "upvotes": 2}, "fehec26": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehec26/", "text": "I’ve found it easier to eat healthy at school rather than at home, which is surprising. My family tends to eat a lot of the same stuff, which is generally pizza or pasta, with the occasional chicken breast. At school there’s this one place that makes great salad bowls where I can add whatever protein I want, it’s fairly pricey (I have a declining balance meal plan) but we’ll worth it since the portion is fairly large. It’s all about knowing where to look and what to get!", "author": "benjioco", "created": 1579114789, "upvotes": 2}, "fehdmkc": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehdmkc/", "text": "Each university is different.  Mine featured a large buffet style cafeteria with different bars.  There was a large salad bar, home cooking, international, sandwich and fries, then random (usually pasta).  We also had a food court in the student building with a chick-fil-A, Panera, and Mein Bowl along with the ability to use our dining dollars at Starbucks and other restaurants within a 2 mile radius of the school that worked with them on taking the dining dollars as payment.", "author": "xmarketladyx", "created": 1579114382, "upvotes": 2}, "fehczey": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehczey/", "text": "Just a tip, if you’re allowed to have one, getting a slowcooker could be a great way to eat healthy. You could just put in a bunch of beans in the morning, steal vegetables from the salad bar, and have a healthy, filling meal", "author": "cilicia_ball", "created": 1579114009, "upvotes": 2}, "fehcf3o": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehcf3o/", "text": "I assume every college has a salad bar so yes, it's possible. Just watch how much you eat and get some vegetables in your diet. Some colleges also have fitness centers so you can exercise there.", "author": "arlomilano", "created": 1579113686, "upvotes": 2}, "fehbqvo": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehbqvo/", "text": "Yeah should be simple enough. Just buy healthy snacks and only eat at the cafeteria when you truely are hungry.", "author": null, "created": 1579113287, "upvotes": 2}, "fehbk5z": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehbk5z/", "text": "I don’t know how *your* college is, but personally my school serves lots of healthy things. But they also offer a lot of junk food. You just have to be smart and try to eat a mix of the things you like while also getting in the fruits and veggies.", "author": "shiverglow", "created": 1579113179, "upvotes": 2}, "fehaaky": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fehaaky/", "text": "I actually was at my healthiest on a college meal plan. Looking back I suppose I ate at the right places that served healthy options with healthy meats (chicken and fish) with vegetables nd regularly ate fruits and hardly had dessert or junk food. I actually thought it got more difficult to stay healthy once I was living on my own.", "author": "goingtobegreat", "created": 1579112420, "upvotes": 2}, "feha3j8": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feha3j8/", "text": "I lost a bunch of weight at the beginning of my first semester, then quickly gained it all, and some more, back. It was partly due to how much I messed up my metabolism by not eating. I would never eat, eating maybe once every day or every other day, because of how scared I was to gain weight. Then, I fell into a depressive episode in the middle of the semester where all I did was eat chocolate and stay in bed and not go to class. I eventually pulled myself out of it, and started eating like a normal human being again. Not the healthiest of foods, but usually vegetarian (no fruit, because I don't trust campus fruit). My metabolism didn't like that *at all* so I quickly gained ten pounds, but the fat was redistributed in a different way, as I had also gained a lot of leg muscle. \n\nLong story short, yes, you can eat healthy, but college students in general have such crazy, hectic schedules, and the grand majority of the food is comfort food/easy to make that it's kind of hard to. Other comments mentioned binge eating during stressful times, which I've noticed is the case with a lot of my friends as well.", "author": "outspokenchameleon", "created": 1579112302, "upvotes": 3}, "feh8jjz": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh8jjz/", "text": "I literally just came out of a Healthy Lifestyle presentation for RA Life (I have RA Training Right Now for the Week) Invest towards re-doing your mini fridge - stack your fridge with vegetables in tupperware, grab your favorite yogurt, stack it with water, hummus, anything of the healthy variety. When eating out, don’t be afraid to ask for an alternative such subbing in a small salad instead of french fries. As well, control your proportions you don’t have to be a health freak but be consistent in your proportions. \n\nAs well, a great point to state. we have a meal plan for off-campus, and we might be considering making a meal plan in collaboration with a grocery store -so RA’s can go to the grocery store and buy healthy items for themselves to refrain from spending so much on campus on unnecessary and unhealthy foods.", "author": "ShilohFromOhio", "created": 1579111361, "upvotes": 2}, "feh8fuz": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh8fuz/", "text": "In my experience, I’ve drank on more weight that I ate. Things like parties and tailgates have so much alcohol available you forget that each drink is sometimes 150+ calories!", "author": "dammitjanetily", "created": 1579111300, "upvotes": 2}, "feh7p2i": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh7p2i/", "text": "It'll be a little difficult, since most large universities will have a wide variety of foods, and even smaller campuses will have a smaller variety, like mine does, so it will be a little more difficult to eat healthier but it can happen. I've found that controlling how much snacks you eat and what kind can help improve your health. I'm a freshman right now, and I've actually lost weight since college started, so it's a different experience for everyone depending on what you choose to do with your diet and health during the year.", "author": "SorryIsMyMiddleName", "created": 1579110866, "upvotes": 2}, "feh6k3l": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh6k3l/", "text": "Yes, they do. Check to see if your college has a dietitian on staff to help you navigate options.", "author": "rosietozie", "created": 1579110197, "upvotes": 2}, "feh5fzo": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh5fzo/", "text": "i always eat a salad mixed with some grilled chicken and potatoes whenever i go at my dining hall, find a creative way to eat healthy!", "author": "lucidnonrealist", "created": 1579109526, "upvotes": 2}, "feh36yp": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh36yp/", "text": "For sure. At my college there’s multiple dinning areas. Each with their own menus. In the main cafeteria there is a plethora of options. From salads to sandwiches and more. And even some of the unhealthier menus have options to remove or add things. Like with the burgers you can get different buns or vegetarian burgers. Or a chicken burger and remove the buns for a grilled chicken. \nThen the food stores have some options, though more limited, on food. There’s stuff you can make yourself like ramen and baking supplies but they also sell premise stuff. Like spinach wraps and such. They’re usually pretty good. \nAll else fail you can get your own stuff and cook it your self. Eggs are usually cheap. Rice can be bought in giant 20 lbs bags for like $10 at some places. Spinach is usually cheap. \nBut also at the end of the day what matters is that if you want to stay in shape you gotta burn the calories off. Check if your collage has a gym and if it’s cost is included in the tuition. If it is use the heck out of it. If not think about paying for a membership. Watch your calories if your really worried. The menus should have the estimated calories of their food. If you really want to eat healthy it’s totally possible. But it’s up to you if you go with the healthier choices or look for them.", "author": "aradol", "created": 1579108199, "upvotes": 2}, "feh1mvs": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh1mvs/", "text": "It’s possible. I was a victim of the freshman 15 and it was because I ate so much trash. I’ve tried to eat healthier and it’s hard but possible. My biggest advice is eat in the dining halls where you swipe to enter and it’s all you can eat. I find there are more healthier and more balanced options. Also look at nutrition info, it’s easy to think something is good for you and find out it’s not. Love my campuses smoothies but I don’t love the 50+ grams of sugar in them.", "author": "millagilmores", "created": 1579107264, "upvotes": 2}, "feh1huj": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh1huj/", "text": "Yes you can. Pretty much do the opposite of what I did. I gained around 50 pounds in two years. I was always a little overweight in high school but I was always playing sports and working out. I moved away to college, and now that I was on my own I could eat whatever I wanted. Our dining halls were all you can eat and I wasn’t playing sports so you can see where the problem was. \nKeep track of what you eat. I know it’s tempting to just get burgers and fries, pizza, and everything else. But make good choices, sure those can be an occasional thing but don’t make them your diet staples. And make sure you make time to work out, that’s my biggest regret is since I was the only person now holding myself accountable I got lazy.", "author": "gpuncviper", "created": 1579107178, "upvotes": 3}, "feh1ekn": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh1ekn/", "text": "It's funny you mention 40 pounds. In the first 4 months of college, I lost 40 points (went from 170 to 130lb). I am on a meal plan that has a crazy amount of money on it (it was the cheapest one and still too much). I would say just don't buy too much junk food and only buy meals from the cafeteria, or a healthy snack like fruit. The other day I bought $13 worth of fruit in the morning and it lastest me until dinner. Now I've got eggs in front of me. Just don't fall for the sugary stuff all the time and you'll be fine.", "author": null, "created": 1579107122, "upvotes": 3}, "feh0000": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feh0000/", "text": "It is possible, but you’ll be surrounded by more junk food on the regular. I fell into the mindset of “Ive been walking a lot, ergo I can eat more”", "author": "bing-no", "created": 1579106272, "upvotes": 2}, "fegxwq2": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegxwq2/", "text": "You can opt out of  meal plan if you commute to your college/university.", "author": "QueenLazuli", "created": 1579104983, "upvotes": 2}, "fegxvbk": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegxvbk/", "text": "Yes it's called self-control.", "author": "guyinhisroom", "created": 1579104958, "upvotes": -2}, "fegxiv3": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegxiv3/", "text": "My college had a salad bar open all day and it had all the toppings and a bunch of dressings. I ate that a lot. On the other hand, the desserts are on a big table and they're there all the time in different varieties. There is access to soda machines all the time too. I had a friend who drank soda at literally every meal. \n\nThe bottom line is, if you have self control at home you can have self control in college. Don't drink soda with every meal, eat the fruit available, have a salad every now and then. \n\nAlso, alcohol. It has an incredible amount of calories. So don't think you can drink whatever you want ever bar night and never put on any weight. That's most of what I saw with people who gained weight. I'm not really a drinker, I limit myself to one soda per day, only had dessert after dinner, and I never put on any weight in college.", "author": "uglybutterfly025", "created": 1579104744, "upvotes": 5}, "fegxg4t": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegxg4t/", "text": "Yes you can, been there, done that.\n\nFirst, its cool and social to eat in cafeteria with your study buddies and helps you stay in touch with news and friends.\n\nAlso, I bet you are not forced to get breakfast or dinner there.\n\nYou've gotten in shape, so you surely know good nutrients and meals.\n\nThe most convenient way is to get a crock pot and prepare oats for breakfast everyday and potatoes/rice with quality meat for the evening.\nThats what serious college athletes do.\n\nYou can also bag healthy snacks like eggs, prepared veggies or fruit for library through the day.\n\nPlain, quality food is cheaper than processed and with clever prep you will always have tasty, good foodchoices at hand (and even share with dormmates or friends comming over).\n\nHave a fit and fun time at college!", "author": "powerplay666", "created": 1579104697, "upvotes": 5}, "fegve6q": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegve6q/", "text": "It definitely is easy to eat healthy, I lost like 30 lbs my first year in school because I was able to change my eating habits and eat the healthier options at my school.", "author": "SenorSmaySmay", "created": 1579103392, "upvotes": 3}, "feguy5o": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feguy5o/", "text": "Yes, this isn't that hard actually. That 15 pound tradition is tied to inactivity, beer consumption, junk food at all hours.  Keep healthy snacks in your dorm.  Walk the long way to class.  Use the stairs.  Many food services now have healthier options.  Don't drink soda every meal.  Stay hydrated.  Join an active club or figure out how to regularly get to the gym or spend more time on your feet.", "author": "KickIt77", "created": 1579103108, "upvotes": 27}, "fegu0ro": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegu0ro/", "text": "I haven't gained any weight since coming to college, in fact I run Spartan races now and am doing quite well. The meal plans and cafeterias should have tons of healthy options, including salad bars, rices, chicken breast, and pasta choices. Stay away from the fried foods and ice cream and everything should be okay! Also, freshman 15 is also based on the sheer amount of alcohol consumed in that first year and getting used to that. Beer has a lot of calories, its really what does people in!", "author": "ChopChopMasterOnion-", "created": 1579102512, "upvotes": 4}, "fegtq7l": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegtq7l/", "text": "Yes but it’s mainly about caloric intake not types of food, although the type of food will help stick to a caloric intake. \n\nAlso remember that the freshman 15 can go either way. Personally I’m half way through my first year and I’ve lost 5 pounds (which for some people is good but for others is bad for health) because I don’t remember to eat enough", "author": "hintersly", "created": 1579102323, "upvotes": 2}, "fegsp98": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegsp98/", "text": "Yes, they definitely have healthy options wherever you go. Honestly, it isn't too hard to gauge whether a meal is healthy or not. It might be difficult to say \"this has x many calories\", but it should be obvious that stir fry is better for you than pizza. If you just choose meals that are healthy, you won't need to worry about gaining the wrong kind of weight, getting fat, or counting your calories. If it tastes rich and fatty, it's probably not great for you. If it tastes sort of subtle or bland, it's probably good for you. \n\nThe trick is to take pleasure out of eating. Eating is for nutrition, not pleasure. If you make that distinction, you will have zero issues making healthy choices. You can get your pleasure somewhere else, where it won't adversely affect your health- you don't need it every time you eat. Jerk off more or something, I dunno. If you don't want to put junk in your body, don't.", "author": "This_is_your_mind", "created": 1579101645, "upvotes": 3}, "fegsit7": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegsit7/", "text": "GET A RICE COOKER\n\nBuy a 5lb bag of jasmine rice.\n\n-Furikake rice seasoning (dried seaweed and sesame seeds)\n\n-Sriracha\n\n-Soy Sauce\n\n-Oyster Sauce\n\n-Fish Sauce\n\n\nWhip up a stupid dummy thicc bowl of rice and throw 1-3 fried eggs on top and season that bad boy. Cheap as hell and delicious.", "author": "fuckweasel-1", "created": 1579101526, "upvotes": 49}, "fegsfzu": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegsfzu/", "text": "You can for sure. There are healthy options in most college markets. \n\nBut I don’t think the “freshman 15” comes from unhealthy eating choices. It comes from drinking/partying, stress and unhealthy sleeping patterns. And not staying active. \n\nCollege is VERY different then high school for many reasons and no matter what kind of person you were in high school, college hits different. \n\nPersonally I would suggest trying not to stress about gaining weight, try your hardest to eat right and stay active.", "author": "ClassyHotMess", "created": 1579101473, "upvotes": 17}, "fegqwos": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegqwos/", "text": "I would say the biggest freshman 15 factor is how much you drink. I didnt really drink my freshman year, so it wasn't a big factor for me. However, I knew plenty of other people who went out several night a week for some pretty heavy drinking. These were the people who I noticed gained the weight. A lot of unsuspecting college freshman don't realize how many calories are in alcohol. \n\nAs for the cafeteria, that really changes depending on the college. My college has a small little vegan area and a salad bar/sandwich station, but that's it for healthy in the cafeteria. I didn't even eat in that area most of the time, and just ate food down the normal cafeteria line (not the burgers and pizza part, but the line with stuff like lasagna or \"homestyle\" food. I'd say they had some pretty good options as you could ask the servers for a small portion or for \"just the veggies and meat with no starch\". Sometimes my cafeteria had calories listed which was helpful. I actually lost weight my freshman year because I only ate meals twice a day with no snacks and I walked everywhere.", "author": "hyeonmibeans", "created": 1579100428, "upvotes": 38}, "fegpvln": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegpvln/", "text": "See if your school has an online menu. This might help you look into your best choices for healthier foods (or at least what to avoid)\n\nI personally ate burgers and mozzarella sticks everyday for my first 2 weeks because I was so excited to eat something like that without having to pay cash for it\n\nJust a bit of self control and remember that some foods were not made with a 2000 calorie diet in mind", "author": "NoahTheCA", "created": 1579099717, "upvotes": 55}, "fegjmys": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegjmys/", "text": "First, it has nothing to do with the college meal plans. Healthy options are there, no matter what your school or schedule is like.\n\nIn my opinion, there are 3 primary reasons that cause the \"freshman 15\" (which is not limited to freshmen or college students). \n\n1. Significant life change. Many just left their parents home, where they are use to balanced meals. They left their high school sports teams.  They have freedom to eat whatever they want and do whatever they want. Bad choices are to be expected.\n2. Stress. School is stressful. So are new jobs, and busy season, new kids, divorces and so on.  Neglecting self care and overeating are common results. Additionally, it can be tough to find time to cook, so people choose fast food. (That's an excuse though.)\n3. Lack of knowledge.  This is understandable. There's simple a lot of bad nutrition info out there. The info that the US Gov pushes ([myplate.org](https://myplate.org)) is made of recommendations that are most profitable to the Ag industry. They recommend 3 daily servings of dairy enen though over 65% of the planet cant digest dairy. They recommend 4 servings of grains (bread). Humans didn't cultivate grain until recent history. We didn't evolve for that to be a significant source of nutrients.  I would recommend anyone concerned with their health and nutrition to do their own research. A good starting point is \"Lies my doctor told me.\"  Dr. Ken Berry debunks many common health myths that have been perpetuated by bad science.  He examines what was wrong with the original science that supported the claims and presents counter evidence to prove it as false. He also gives sources for additional research. (It's available on audible too.)\n\nMy simple advice: \n\n1. Track your calorie intake.\n2. Reduce or eliminate breads/grains. You don't need them. You can get carbs elsewhere.  \n3. Limit refined sugars.  Get rid of soda.  \n4. Don't surround yourself with junk. If you are taking food back to your room, don't bring junk food. Bring fruit. If you aren't hungry enough to eat and apple, you aren't actually hungry.\n5. Drink water. If you feel like you need a snack, go drink a 16 oz glass of water.  It'll do the trick most of the time.", "author": "Inactive_Account", "created": 1579094788, "upvotes": 187}, "fegiy5n": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegiy5n/", "text": "&#x200B;\n\nfrom my experience temptation was always there unlike cooking at home", "author": "Detective-E", "created": 1579094201, "upvotes": 7}, "feggjye": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feggjye/", "text": "The obvious answer is yes you can. Just be aware of what you are eating and portion amount. A lot of people gain weight freshman year because they have a unlimited meal plan, so it’s super easy to eat more. People will also stress eat. Just make healthy choices and at a reasonable portion size and you will be fine.", "author": "lman89607", "created": 1579092039, "upvotes": 513}, "feggcp1": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/feggcp1/", "text": "Some schools will have better food and food options, but in general, yes it is possible. It will likely require a decent amount of discipline since usually it is buffet style and you just take what you want, so you’ll need to cut yourself off every meal. Also there should be healthy options so you can still have a good diet. Deserts are so easy to take and eat at dining halls so be careful of that since sugar stacks up and turns to weight.", "author": "wwong555", "created": 1579091846, "upvotes": 23}, "fegg84i": {"link": "/r/college/comments/ep1or8/is_it_possible_to_eat_healthy_on_a_college_meal/fegg84i/", "text": "It depends on your school really.", "author": "ratzho", "created": 1579091722, "upvotes": 5}}}