{
  "sid": "pxlbln",
  "link": "/r/college/comments/pxlbln/what_are_your_opinions_on_clubs_about_gaming_and/",
  "title:": "What are your opinions on clubs about gaming and anime, whether you're a teenager or an adult?",
  "text": "Also, if you asked me what clubs I was in, and I told you that I was apart of clubs like these, would you still find me interesting?",
  "author": "WorthlessFoolish",
  "created": 1632880720,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "heopeod": {
      "link": "/r/college/comments/pxlbln/what_are_your_opinions_on_clubs_about_gaming_and/heopeod/",
      "text": "Gaming is pretty common nowadays. Idk about anime though. But honestly, who cares? Maybe you'll run into some people with the same interests.\n\nAs someone who games and occasionally watches a good anime from time to time. I'd find you interesting.",
      "author": "DivineFalchion",
      "created": 1632889913,
      "upvotes": 2,
      "replies": {}
    },
    "heoi12w": {
      "link": "/r/college/comments/pxlbln/what_are_your_opinions_on_clubs_about_gaming_and/heoi12w/",
      "text": "Eh I don't say that can identify an interesting individual. It doesn't disclose much except your hobbies.\n\nAnime gets a bad rep so there are some stereotypes associated with. Depends how you want your first impression to be.",
      "author": "safespace999",
      "created": 1632885701,
      "upvotes": 3,
      "replies": {}
    },
    "heoaz8t": {
      "link": "/r/college/comments/pxlbln/what_are_your_opinions_on_clubs_about_gaming_and/heoaz8t/",
      "text": "I wouldn’t find you not interesting. Depends who you are as a person, if you got other interests or not, those aren’t my interests so if those are your only two interests then I probably won’t find you interesting. Depends who your talking to as well. Some people might judge you tho.",
      "author": "Funny_Medicine_4025",
      "created": 1632882202,
      "upvotes": 1,
      "replies": {}
    },
    "het4ia2": {
      "link": "/r/college/comments/pxlbln/what_are_your_opinions_on_clubs_about_gaming_and/het4ia2/",
      "text": "Look, I'm such a weeb that I didn't even have to seek out the Anime and Gaming Club at my first college - I shared a class with the president and vice-president and on the very first day they somehow honed in on my signal and approached me after. I didn't end up joining (I wanted to but I had literally no time for it) but I was pleased as punch that they asked me, and probably still would've been even if I hadn't been into anime. Anyone who judges someone based on their interests or what clubs they're in is a garbage person who should join the garbage club, you do you.",
      "author": "sashathebrit",
      "created": 1632972358,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634055930
}