{"sid": "ptjdqw", "link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/", "title:": "How to stop FOMO as a freshman?", "text": "Hello everyone. I’m a freshman (18M) at a rather large public university. According to my parents, I’m doing great so far. I’ve gone to some parties met a few friends, gone to the gym a lot, doing relatively well in classes. However, I can’t shake the feeling of just being so dismayed all the time. I feel like everyone else has more friends than I do, or is doing more stuff on the weekends, more popular, or is generally more successful. It’s caused a severe emotional reaction in me, and I need any advice possible. At first I told myself “just meet more people” but I think it’s a more deep-seated psychological thing. If anyone has experienced something similar to this please let me know.", "author": "OurLordTrotsky", "created": 1632356159, "retrieved": 1632800761, "over_18": false, "upvotes": 45, "upvote_ratio": 0.92, "comments": {"hdz9i0j": {"link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/hdz9i0j/", "text": "I'm a Professor and advisor with my degree in psychology. I can tell you that you are absolutely not alone. I felt this way too, and the majority of students that come into my classes or office (probably around 90% of them) all feel that other students are smarter them, more social, better at understanding material. It sounds trite, but you will overcome this and have a better experience as you progress. The first semester is really hard. \n\nThis is imposter syndrome. Unfortunately, it doesn't go away. However, there are really great articles and resources out there about how to shift your mentality. u/setthersonj advice is great advice that matches what a lot of the research shows. Shift your thinking to compare yourself only to previous versions of yourself and it can help. Though, this is a slow process and one that you'll have to keep monitoring throughout your life. \n\n&#x200B;\n\nHere's a great article on how to overcome imposter syndrome and what it is. [https://www.mindful.org/how-to-overcome-impostor-syndrome/](https://www.mindful.org/how-to-overcome-impostor-syndrome/)", "author": "thehelpfulprof", "created": 1632413558, "upvotes": 3}, "hdxmzva": {"link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/hdxmzva/", "text": "Quality vs quantity... just saying...", "author": "daveymars13", "created": 1632377096, "upvotes": 1}, "hdxkgo3": {"link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/hdxkgo3/", "text": "I'm a sophomore on campus for the first time ever, so I can see where you're coming from. My advice would be to not worry about what you see on insta, snap, or whatever social media you use. The grass isn't always greener on the other side of the fence. Those people just choose to put it up on social media, which is fine, but for your sake, don't look at it. \n\nI've focused on being me and putting forward the best me. I haven't been to any parties because that's not my kinda vibe, but I know people who do it basically every other day and we're both happy with where we are. I personally believe if you have all your stuff together, everything else will fall into place much more easily. I don't have many friends, but they're amazing friends who I can vent to without feeling judged and that's all I care about, in terms of friends.", "author": "fruitninja777", "created": 1632375228, "upvotes": 8}, "hdxcemq": {"link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/hdxcemq/", "text": "Almost all of the things that happen, happen in places you are not. Think of how big your campus is, and how many people are there. Now imagine that there are over a thousand campuses just like it. \n\nNow imagine all the bars in your area, and how many absolute ragers happen in them. Now imagine how many bars there across the state.\n\nNow imagine how many are going on across the country.\n\nNow imagine the same across the world.\n\nYou are not at any of those legendary parties. None. And that's totally okay. Be present in your own moment.", "author": "SamSeebourne", "created": 1632369972, "upvotes": 1}, "hdxabns": {"link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/hdxabns/", "text": "If you’re worried I’m beyond worried then lmao. The longest conversation I’ve had has been with my advisor, and the only person I’ve spoken to more than once is a girl that asked me questions about assignments twice. Guess I’m in the exact same boat of dismay then >.>", "author": "ArmoredSpearhead", "created": 1632368791, "upvotes": 5}, "hdx6x9s": {"link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/hdx6x9s/", "text": "I’m a freshmen experiencing this too. I’ve made a few friends but I always feel like I should have more going on.", "author": "MonsterSlugStick", "created": 1632366943, "upvotes": 1}, "hdwsyt7": {"link": "/r/college/comments/ptjdqw/how_to_stop_fomo_as_a_freshman/hdwsyt7/", "text": "I think the mistake is comparing yourself to others. There’s a quote that I’m probably misremembering but it’s roughly “comparison is the greatest thief of joy.” Sure some kids might have more friends than you but do you know the grades all those kids are making? They very well could be failing classes or falling behind because they’re so concerned with the social aspects of school. You also don’t know the true value of their friendships. You might see a kid hanging out with 10 people and think “wow they have a lot of friends” but the odds are pretty low that all 10 of those people would be there for that person in a true time of need. Or the kids that you deem more successful than you might have no friends as their focus is entirely on their studies. It sounds to me like you’ve found a good balance of everything so far. Try to remove other people from the equation and ask yourself without comparison if you’re happy with your current social and academic achievements. There will always be someone with better grades or more friends so using them as the benchmark isn’t a good idea. For example, I’m 26 and just now a sophomore. I could easily look at you and say “wow this guy is starting school 7 years earlier than I did. He’s doing so much better than me.” But that train of thought does me no good. I have a high quality but low quantity group of friends and make good grades so what more could I ask for. Just take a step back and take note of the things you’ve accomplished instead of the things you haven’t. You sound more than on the right track to me.", "author": "setthersonj", "created": 1632359988, "upvotes": 30}}}