{
  "sid": "qrgxm2",
  "link": "/r/college/comments/qrgxm2/i_dont_know_what_im_doing_with_my_life/",
  "title:": "I don't know what I'm doing with my life",
  "text": "I'm not sure if this applies to anyone else, but I literally don't know what I want to do in my life. I started out in college with a math degree, and to be honest the only reason I'm choosing it is because I don't know what job I want to get in the future.\n\nMy parents say that I should go do commerce for job stability, but I rejected be cause I don't know shit about business, plus commerce jobs are not well paid enough.\n\nNow I'm just taking random ass courses in math or compsci just for the sake of learning more \"useful\" skills in terms of employment. I am also an executive at one of the clubs in my uni, not because I'm passionate or something just because it adds to my cv.\n\nI have no goals and aspirations or anything, I'm just doing things for the sake of looking better. It just makes me feel like an empty shell with no purpose in life. \n\nTl, dr : idk what I'm doing with my life, or what I'm going to do in the future.",
  "author": "fmelol",
  "created": 1636620385,
  "updated": 1636654736,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "hk6kqq4": {
      "link": "/r/college/comments/qrgxm2/i_dont_know_what_im_doing_with_my_life/hk6kqq4/",
      "text": "Do computer science as a major that pays well. You don’t need a passion you need to get paid. Then you can find a hobby/passion on the side.",
      "author": "occasionaldrinker",
      "created": 1636620920,
      "upvotes": 3,
      "replies": {
        "hk6rxy0": {
          "link": "/r/college/comments/qrgxm2/i_dont_know_what_im_doing_with_my_life/hk6rxy0/",
          "text": "I couldn’t agree more. @OP, get the papers, get the money, sooner or later you will find something you are obsessed with and you can do it for fun, or money, or both.",
          "author": "custompprs",
          "created": 1636627217,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}