{
  "sid": "qf3c2s",
  "link": "/r/college/comments/qf3c2s/to_those_who_went_away_for_college_was_the_extra/",
  "title:": "To those who went away for college, was the extra money worth it?",
  "text": "Debating on transferring to an out of state college. I’ve already been accepted and it’s a great school, but my family is really pushing against it because they’ll insist that it’s too much debt and that it’ll ruin my adult life and all that.",
  "author": "verawolf227",
  "created": 1635116164,
  "updated": 1635184373,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhxdumo": {
      "link": "/r/college/comments/qf3c2s/to_those_who_went_away_for_college_was_the_extra/hhxdumo/",
      "text": "Out of state just isn't worth it for me, it's way too expensive. Paying 4x the tuition isn't for me",
      "author": "lissamarie3",
      "created": 1635120378,
      "upvotes": 3,
      "replies": {}
    },
    "hhx7aqg": {
      "link": "/r/college/comments/qf3c2s/to_those_who_went_away_for_college_was_the_extra/hhx7aqg/",
      "text": "No not worth it. Not worth the debt",
      "author": "Concerned-23",
      "created": 1635117099,
      "upvotes": 6,
      "replies": {}
    },
    "hhxdv7y": {
      "link": "/r/college/comments/qf3c2s/to_those_who_went_away_for_college_was_the_extra/hhxdv7y/",
      "text": "What's your major?  If the same degree and networking opportunities can be had locally, then I would suggest staying home and completing the requirements in-state.  Your support system is home and you will likely not have a support system by moving out of state.  You will also usually end up paying about 4x the in-state tuition rate for the first year, not to mention housing.  I've literally had grown men cry to me about their high student loan debt and payments once they graduated from a private out-of-state uni and realized the financial situation they were in.",
      "author": "MDWrangler80",
      "created": 1635120386,
      "upvotes": 1,
      "replies": {}
    },
    "hhyl4ev": {
      "link": "/r/college/comments/qf3c2s/to_those_who_went_away_for_college_was_the_extra/hhyl4ev/",
      "text": "why pay 4x more when you dont need to?",
      "author": "ghostmode342",
      "created": 1635146683,
      "upvotes": 1,
      "replies": {}
    },
    "hhymdku": {
      "link": "/r/college/comments/qf3c2s/to_those_who_went_away_for_college_was_the_extra/hhymdku/",
      "text": "Yea paying 3 times more money just so you can go out of state is, and I’m going to be blunt, a very stupid thing to do.",
      "author": "Jfogs2020",
      "created": 1635147737,
      "upvotes": 1,
      "replies": {}
    },
    "hhzif7c": {
      "link": "/r/college/comments/qf3c2s/to_those_who_went_away_for_college_was_the_extra/hhzif7c/",
      "text": "You can get in-state tuition after a year. As someone who needed to get as far away from my hometown as possible, it would be 100% worth it for me. I am currently attending a community college in a different state, the first year is a bit spendy, but the second year will be covered by Pell Grant and scholarships. In the long run, it's probably not the most financially sound decision though. Think about where you want to be for the next 4 years and go from there. I'd rather experience a new place and be away from home than save on tuition for a year, but that's just me.",
      "author": "Nordic-Blue",
      "created": 1635170453,
      "upvotes": 1,
      "replies": {}
    }
  }
}