{
  "sid": "q8q8eg",
  "link": "/r/college/comments/q8q8eg/flunking_out_of_college_what_do_i_do/",
  "title:": "Flunking out of college, what do I do??",
  "text": "   Excuse any typing errors please, I’m on mobile at work right now. I’m 21 this year and started my 3rd year of college in August, and I have lost all motivation to attend my online classes or complete any work. I am only taking 11 credit hours at the moment because I was dropped from my 3 credit hour class for not attending. I work 24-36 hours a week but only on weekends and I have nothing but time to complete my work. \n\n   My issue is that with the pandemic, my mental health has taken a steep decline. I mean, I wasn’t exactly mentally healthy to begin with but now I’m even worse off. I can’t get any sleep and when I do fall asleep I can’t get out of bed. I’m just really struggling right now, and it’s showing in my grades. \n\n   I’m only barely passing one of my four classes and it’s too late to withdrawl. My depression isn’t an excuse for how shit I am at time management and I don’t know what to do. I can’t complain to my professors about being depressed because who gives a fuck, honestly? I’ve kind of accepted that I’m going to take a really bad hit to my GPA, and lose my scholarship but I don’t know where to go from here.\n\n  There’s pretty much no coming back from my situation because I have more zeros and absences than I do time in class, so my question is... what do I do now? I feel like I should take a break from school but I honestly don’t think I’ll come back. I’m feeling really hopeless right now and I have no direction. What would you do if you were me?",
  "author": "lostgirl3000",
  "created": 1634310026,
  "updated": 1634331773,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgqv90v": {
      "link": "/r/college/comments/q8q8eg/flunking_out_of_college_what_do_i_do/hgqv90v/",
      "text": "time to go do somthing else it sounds like.",
      "author": "MalcomX1964",
      "created": 1634310124,
      "upvotes": 5,
      "replies": {}
    },
    "hgqw0oc": {
      "link": "/r/college/comments/q8q8eg/flunking_out_of_college_what_do_i_do/hgqw0oc/",
      "text": "I’m sorry you’re going through this, and a lack of motivation is tough to deal with. I’m in my 4th year of school and have dealt with this feeling before. \n\nWhat got me out of a rut like this is meeting with my professors. Basically I just say “Hey, I haven’t been trying my best, and it’s showing in my grades, but I want to improve. What can I do?”\n\nIn my experience, professors generally want you to succeed in their classes, and having a conversation with them is incredibly motivating. \n\nThere IS a path for you to get your grades up, but you won’t find it until you talk to your professors about it. Reaching out to them is the first step. Hope this helps!",
      "author": "Walker_C",
      "created": 1634310447,
      "upvotes": 2,
      "replies": {
        "hgqxt1t": {
          "link": "/r/college/comments/q8q8eg/flunking_out_of_college_what_do_i_do/hgqxt1t/",
          "text": "I get what you’re saying about reaching out to my professors, but I haven’t put in any work this semester to deserve their help or for them to even want to help me. I’ve shown them that I don’t care so of course they won’t care either. \n\nI more so meant can I come back from this in the long run? Like, is college even still an option? If you saw my grades you would probably agree that passing these classes isn’t happening.",
          "author": "lostgirl3000",
          "created": 1634311200,
          "upvotes": 1,
          "replies": {
            "hgqzpln": {
              "link": "/r/college/comments/q8q8eg/flunking_out_of_college_what_do_i_do/hgqzpln/",
              "text": "Seems like you’re making a lot of assumptions about what your professors think of you. You might be pleasantly surprised if you reach out to them. \n\nYou’re right I haven’t seen your grades, but I had a friend with a ZERO in all of his classes after midterms, and he finished with straight C’s, so it can be done!\n\nBut to your point, you can definitely come back from this in the long run. One bad semester will not ruin your college career",
              "author": "Walker_C",
              "created": 1634311989,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "hgsaw38": {
      "link": "/r/college/comments/q8q8eg/flunking_out_of_college_what_do_i_do/hgsaw38/",
      "text": "[removed]",
      "author": null,
      "created": 1634331638,
      "upvotes": 1,
      "replies": {}
    }
  }
}