{"sid": "pr2mdp", "link": "/r/college/comments/pr2mdp/college_kinda_sucks/", "title:": "College kinda sucks", "text": "I started college about a month ago and it hasn’t lived up to my expectations. Before I came to college, I think I had an idea in my head that I was instantly going to make friends and have a group to do stuff with. But, I haven’t really made any friends. I feel like i’m meeting a ton of people but no one wants to hang out with me or they’d rather hang out with other people. I feel like i’ve really tried my best to make friends by going to clubs, campus events and really putting myself out there but nothing seems to stick. \n\nRecently, I met a girl in one of my classes who I actually bonded with over not having many friends. I’ve been eating and hanging out with her for the past two week and I thought that I finally made a friend. I even went shopping with her and another girl today! After shopping, they talked about meeting up later that night. Once we got back to the dorms though, they said they were gonna take a nap and just chill for a bit and I thought we’d eventually meet back up. So, I invited them to dinner and one didn’t respond and the other said she already ate. I figured “no big deal” we’d hang out later. So I texted her if she wanted to do something this evening and she said that she had to study and couldn’t do anything. Guess who I ran into? It was her and the other girl laughing in the hall and i’m pretty sure they ate dinner together. It honestly hurt my feelings. \n\nI don’t know if i’m being sensitive but i really thought this girl was my friend. But, as soon as she meets someone better, i’m ditched to the side. Why lie too? I  wouldn’t have been as hurt if she just straight up told me she wanted to hang with just the two of them. \n\nI am more reserved and quiet than most people but i really have tried to put effort into meeting people. I’m so lonely and just wish that I was someone’s first choice:( I hope college gets better bc I don’t know if I can take four years of this.  Sorry for the negativity. I’m just sad", "author": "RarePea", "created": 1632032166, "retrieved": 1632801457, "over_18": false, "upvotes": 14, "upvote_ratio": 0.85, "comments": {"hdhfgz8": {"link": "/r/college/comments/pr2mdp/college_kinda_sucks/hdhfgz8/", "text": "Don’t give up. I know plenty of people who struggled freshman year but managed to find friends later. For me, it was the opposite- made friends freshman year, realized sophomore year we mainly hung out because we lived close to each other and weren’t really that close. I’m short- just because you do or don’t have friends freshman year doesn’t mean it will always be like that. Things change, for the worse and for the better. All you can do is keep trying.", "author": "ludgatedwyer500", "created": 1632071332, "upvotes": 2}, "hdgkhwh": {"link": "/r/college/comments/pr2mdp/college_kinda_sucks/hdgkhwh/", "text": "40s person here and have worked in higher ed for a couple decades, so I've known dozens of first year cohorts between undergrads and grad students. The first semester is a complete crapshoot in terms of making friends. Heck, I remember my first semester being crummy that way, because everyone but me on my hall wanted to go Greek, so they made a ton of friends the first weekend. I spent all my time on my high school friend's hall, which for me (male) was both fun (the hall was all female) and lonely (I wasn't meeting men to be friends with). \n\nCollege is a weird experiment, where we take people out of their familiar environments, put them in new environment, shake them all up, and see which people connect to each other to make a new familiar environment. The extra challenge the experimenters included was they didn't give complete information about how the physics of connecting work. Some people have the dumb luck of floating past others with the right connectors, while others have to float around a bit longer. Even when people connect, they don't really know why; in fact the connections might be surprisingly weak. The environment gets shaken a few more times -- when people pledge, when people choose second-year roommates, when the first round of break-ups happen -- and new connections form.\n\nThat doesn't really help feeling lonely. Most humans aren't built to handle loneliness with anything other than a preoccupation to stop being lonely. But the nice thing about college is, there _are_ people to connect well with, but it can take some wandering and shake-ups to find them.", "author": "dcgrey", "created": 1632057773, "upvotes": 6}, "hdfmunh": {"link": "/r/college/comments/pr2mdp/college_kinda_sucks/hdfmunh/", "text": "Dude, I fucking feel you. This is also what I’m currently experience, only difference is I have it a little better because I’m rooming with an old friend but yea I thought I’d be able to find a group to do stuff with but nope, haven’t made a single long term friend at all. Just a bunch of people who I greeted and got their socials.", "author": "Dankiie", "created": 1632033392, "upvotes": 8}, "hdfmg8d": {"link": "/r/college/comments/pr2mdp/college_kinda_sucks/hdfmg8d/", "text": "It gets better! I had no friends for a while when I first started and eventually met my now best friend. We’ve both met many people like this and both got our feeling hurt but it changes after a while.", "author": "96unavailable96", "created": 1632033093, "upvotes": 6}}}