{
  "sid": "r4b49o",
  "link": "/r/college/comments/r4b49o/im_23_and_thinking_about_trying_to_go_back_to/",
  "title:": "I'm 23 and thinking about trying to go back to college (or trade school), need advice.",
  "text": "Hey peeps! I'm not sure really where to begin with this because it's been a really long time - or so it feels like. \n\nI'm currently 23 and work a schedule I build myself, that being said it's not the most lucrative job, but enough to get by in my current living situation (lots of support). I've always wanted to continue education but I'm a terrible student (always have been). I feel like however, given that my job requires the IQ of a hermit crab but allows me this freedom of schedule, I should take advantage of it. \n\nI tried teaching myself programming for a year but didn't do the best I could've done, and kind gave up. Been over a year since I've written a line of anything. I'd like to go and give a structured course a shot because I feel like when I was self teaching I developed imposter syndrome and lost faith in myself. \n\nWould anyone have any suggestions on courses or how to get started even just going back to school? I know this whole post seems kinda silly but I really don't even know where to start. I'm thinking maybe just picking up some basic courses at my local community college just to redevelop a feel for school. \n\nThanks!",
  "author": "Vondoomian",
  "created": 1638124830,
  "updated": 1638206776,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmg6org": {
      "link": "/r/college/comments/r4b49o/im_23_and_thinking_about_trying_to_go_back_to/hmg6org/",
      "text": "I can answer this so easily for you.\n\nIf you go to college have an exit plan. Why are you going to college? For the degree right? Will you have a plan to utilize the degree? \n\nIf your answer is YES, then go to college and get the degree.\n\nIf NO, Then go to trade school for 2 years, and get your license for what ever you are doing. \n\nBut remember BOTH College and Trade school is difficult depending on your concentration. For example: A degree in Computer Science/Engineering is going to be extremely difficult. A license as a Dental Hygienist/X-Ray Tech in trade school is also extremely difficult.",
      "author": "CarSuperFast",
      "created": 1638134751,
      "upvotes": 1,
      "replies": {
        "hmgileg": {
          "link": "/r/college/comments/r4b49o/im_23_and_thinking_about_trying_to_go_back_to/hmgileg/",
          "text": "yes a cs degree is torture if you arent smart as hell",
          "author": "Raymond_K_Hessel2000",
          "created": 1638139639,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}