{"sid": "i46prn", "link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/", "title:": "Should I accept the scholarship?", "text": "I’m a mixed race student and recently applied for a scholarship for diverse students. In the school’s scholarship acceptance letter they said that I will be put in a group of other students of color. \n\nThe problem is the side of my family that comes from Mexico all have white skin tone. The other side of my family is Canadian. Because of this I’m thinking about turning down the scholarship. However, when I told my mom about my decision she felt offended that I was turning away from my heritage. \n\nWhat should I do?\n\nEdit- Thanks everyone! I will take the scholarship.", "author": "Typical-Deer", "created": 1596639127, "retrieved": 1632802197, "over_18": false, "upvotes": 933, "upvote_ratio": 0.96, "comments": {"g0l170e": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0l170e/", "text": "Take the scholarship! \n\nIf you're worried about people judging you based on your phenotype make up (this is tricky as most judge based on appearance), I honestly wouldn't worry about. I've met people who look really European (white), but guess what? They were actually Puerto Rican! Plus, nationality, race which is a social construct, and ancestry and all different things! \n\nYou have southern and northern European ancestry mixed with Native American and you should be proud of that!", "author": "Optimal_Impression", "created": 1596735059, "upvotes": 1}, "g0ko6qz": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ko6qz/", "text": "First off, Hispanic is not a race, hence why you can be white and Latino at the same time (not talking about mixed race). I think the OP meant that her parent who is Mexican is racially white but culturally Mexican.\n\nOP take the scholarship. If you need the money don’t hesitate to take it. The US puts all Mexicans and Latinos, no matter if they are white, black, indigenous or mixed as people of color", "author": "yslwej", "created": 1596729273, "upvotes": 3}, "g0kate4": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0kate4/", "text": "Don't turn it down if you want a cheaper education. But as a 3rd yr student in a diversity scholarship, let me warn you. \n\nMore than likely, the school that is offering you the scholarship will be primarily white, with your scholarship group being the minorities. And it will be unconfortable the entire time. Even now, I still haven't made friends because there is a stigma involving me and my scholarship group. \n\nIf you truly care about the college experience and making friends, then you may need reconsider. But friends in college are temporary, and your future is a bigger priority imo.", "author": null, "created": 1596723578, "upvotes": 1}, "g0k112f": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0k112f/", "text": "Take it my daughter is 1/2 Brazilian but you would never know it. She got a scholarship and I’m totally good with it. As long as you don’t lie you are worthy of it", "author": "RHMS21", "created": 1596719155, "upvotes": 2}, "g0jypo4": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0jypo4/", "text": "Being light skinned has nothing to do with it. If you're Hispanic, you're Hispanic. You're clearly qualified, so why turn it down? \n\nIt's not like once they find out what you look like, they'll be like, \"Oh shoot. Nevermind. You're not the right skin color. No scholarship for you!\"", "author": "MeeMooHoo", "created": 1596718060, "upvotes": 1}, "g0julds": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0julds/", "text": "My dad always says to never turn down money. You deserve it.", "author": "211012-7", "created": 1596715970, "upvotes": 1}, "g0jp4bw": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0jp4bw/", "text": "Take the money! Who cares what people think. You earned it by hard work. Celebrate your accomplishments and accept the gift for your bright future.", "author": "dgreco4767", "created": 1596712386, "upvotes": 1}, "g0jmw8i": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0jmw8i/", "text": "Bro take the money lol", "author": "monkeyburrito411", "created": 1596710326, "upvotes": 1}, "g0jmj7q": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0jmj7q/", "text": "I don’t care if you have to cheat the system (which you aren’t anyways) but colleges cheat us. Do everything you can to get tuition reduced", "author": "thecasualcaribou", "created": 1596709979, "upvotes": 1}, "g0jchs1": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0jchs1/", "text": "How is that program not racist", "author": "argentiniansigma", "created": 1596699906, "upvotes": 1}, "g0j9vt7": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0j9vt7/", "text": "Funny you’re story is similar to mine. Just replace Mexico with argentina and Canada with America. Regardless I would say you aren’t a person of color. I know I’m not. Fully white but also Latino. (Not mutually exclusive). Just do whatever you feel like isn’t lying. I would not consider white Latino to be PoC but if you think it’s reasonable to believe it simply extends to all minorities (of which you are one as a Latino) then accept it. I don’t think they’d make too much of a fuss. Just acknowledge you aren’t a PoC but you are a minority. Things are complicated.", "author": "argentinevol", "created": 1596697423, "upvotes": 1}, "g0j4ifq": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0j4ifq/", "text": "Nobody will give a fuck especially if you know Spanish", "author": "supersk8er", "created": 1596692776, "upvotes": 1}, "g0j4fhq": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0j4fhq/", "text": "why would you turn down free money lol", "author": "TheGuyMain", "created": 1596692710, "upvotes": 1}, "g0iytnj": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0iytnj/", "text": "Short version, world history:\nGroup A screws over Group B, because they can.\nTime passes.\nGroup C arrives.\nGroup B screws over Group C, because they can.\nFollow this pattern to the present day.\n\nTake the scholarship. You earned it. Your grandmother worked her ass off so that you could be in a position to worry about if it’s ok to take the money. Not taking it ignores your family’s hard work.\n\nStop worrying over petty BS. Take the scholarship. No white a$$hole would think twice in your position.", "author": "sigholmes", "created": 1596688514, "upvotes": 2}, "g0ixq1y": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ixq1y/", "text": "If someone offers you free money you should probably take it. I don’t blame anyone for gaming a dumb system.", "author": "TWR3545", "created": 1596687777, "upvotes": 1}, "g0ivpzj": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ivpzj/", "text": "Thank you for this. I really appreciate your comment. It’s very helpful. I have never heard of that show but recently got Hulu! We will definitely watch it. :-)", "author": "just-another-human05", "created": 1596686462, "upvotes": 1}, "g0iv1ul": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0iv1ul/", "text": "I'm half mexican, my twin brother looks mexican, i do not---though i can get a nice tan somtimes--- i recieved a similar scholarship. Frankly i dont share my finances with anyone. And if anyone ask i just say i prefer to be the only one who knows about my finances.", "author": "19Riften99", "created": 1596686028, "upvotes": 1}, "g0iuf52": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0iuf52/", "text": "This is sad. My daughter is half Arab and very white \n-passing. The reverse racism is already doing its work on the minds of white-passing POC. Because you're not dark enough you believe that you aren't worthy of the scholarship. ACCEPT THE MONEY!!!", "author": null, "created": 1596685628, "upvotes": 1}, "g0ir3sf": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ir3sf/", "text": "TAKE THE MONEY", "author": "kelsybobelsy", "created": 1596683605, "upvotes": 2}, "g0iop0b": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0iop0b/", "text": "Is this the \"institutionalized racism\" I've been hearing so much about lately?", "author": "upstatenyphotog", "created": 1596682230, "upvotes": 2}, "g0ilog6": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ilog6/", "text": "You do realize white Mexicans is a thing right? Your skin tone shouldn’t matter just take the scholarship.", "author": "NoiceMango", "created": 1596680552, "upvotes": 5}, "g0iif69": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0iif69/", "text": "If they didn't think you should get it they wouldn't have offered the scholarship.", "author": "goldxoc", "created": 1596678785, "upvotes": 1}, "g0igkac": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0igkac/", "text": "I am half Mexican ethnically as well. It’s not considered mixed race but you are from a different culture, and part of an ethnic minority. \n\nI was a National Hispanic Scholar and got a $5,000 scholarship every year. I didn’t feel guilty because I earned it. My father came to this country (US) because of those opportunities. I agree with your mother and a lot of the commenters. Your skin color doesn’t define your heritage. Take the scholarship.", "author": "rogertaylorkillme", "created": 1596677782, "upvotes": 1}, "g0ieoyu": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ieoyu/", "text": "I applied for a diversity scholarship at my school, but my only qualification was being a first-generation college student. Very white. Had to go to a meeting at the beginning of the school year with a bunch of other “diversity scholars” and was one of the few Caucasians in the room. Honestly, it’s nbd. At the end of the day, free money is free money", "author": "18mcgr", "created": 1596676770, "upvotes": 1}, "g0idscd": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0idscd/", "text": "What are the conditions of the scholarship -- you have to be a person of color? It's not like they're going to run a genetic test or have a minimum skin tone, so it comes down to your personal/family identify. If your family ancestry is totally European and you can trace your lineage directly to the conquistadores, it might be wrong to take it. If your ancestry is mestizo but your skin is light enough to pass as white, this scholarship is absolutely still for you IMO. But in the end they can't ask you to prove your POC status so it's going to come down to whether you personally identify as one", "author": "SkiMonkey98", "created": 1596676281, "upvotes": 1}, "g0idd04": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0idd04/", "text": "My good friend is in the same situation. He is a white presenting Latino and got a similar scholarship and attended the people of color orientation, he made a lot of friends and it worked out fine, and from my understanding nobody judged him because he looked white.", "author": "distressefakeleather", "created": 1596676048, "upvotes": 1}, "g0ibeck": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ibeck/", "text": "Congratulations on the scholarship! If you qualify for it, you should take it. Best of luck in college. 😃", "author": "craigoz7", "created": 1596674978, "upvotes": 1}, "g0ia14w": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ia14w/", "text": "You are still diverse and just because you are colored white does not mean that. Accept your scholarship and move on. There is no reason to be afraid of it at all.", "author": "nemo1261", "created": 1596674229, "upvotes": 1}, "g0i7lu0": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0i7lu0/", "text": "Canadian isn't a race.", "author": "catncrunch", "created": 1596672928, "upvotes": 1}, "g0i7aha": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0i7aha/", "text": "I’m full white, and if I mistakingly got that I’d still take it because prices are ridiculous. If you earned it by all means take it.", "author": "Trip4Life", "created": 1596672760, "upvotes": 1}, "g0i5xpq": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0i5xpq/", "text": "Take the money man! Congrats! I wish you luck at college.", "author": "Rahmbomb13", "created": 1596672036, "upvotes": 2}, "g0i4nua": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0i4nua/", "text": "I'm in the same boat. People think I'm white til I actually tell them. Take advantage. A good education leads to a better life. Don't be a fool. I know you were going to accept in anyway, but there's the validation you were looking for.", "author": "Alexmexha", "created": 1596671357, "upvotes": 2}, "g0hzpnr": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hzpnr/", "text": "Question, do you speak Spanish?", "author": "zaddyzee", "created": 1596668758, "upvotes": 1}, "g0hypkt": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hypkt/", "text": "Accept it.  Diversity tuitions shouldn’t exist in the first place, they’re racist.  I’m also a mixed kid and got free money.", "author": "AquaticMine", "created": 1596668237, "upvotes": 3}, "g0hxk8r": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hxk8r/", "text": "Of course you should take the money", "author": null, "created": 1596667651, "upvotes": 2}, "g0hvx3a": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hvx3a/", "text": "Take it. If they're giving you free money take it.", "author": "boanerfard", "created": 1596666824, "upvotes": 2}, "g0hvvvh": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hvvvh/", "text": "As a black girl- take it !!!!", "author": "TheJazmineRose", "created": 1596666807, "upvotes": 2}, "g0hvlk0": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hvlk0/", "text": "is it the wrong thing to do? yeah, kind of. \n\nshould you do it anyway? yes imo", "author": "adult_size", "created": 1596666663, "upvotes": 1}, "g0hsoob": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hsoob/", "text": "I feel you - I am half Hispanic and half white. I look white. I was able to go to a fancy private university thanks to a similar scholarship. You aren’t deceiving anyone - you are mixed race and you look like you look. I always hate when paperwork says “Select the race you most identify with (only choose one)”. I won’t choose one, I am who I am and I identify as both. \n\nI know just the way you are feeling, and still I say take the scholarship. You were granted it for a reason (and, trust me, student loans feel way different a few years out of college then when you are just signing up). Good luck in school and all the best to you my fellow mixed race superstar!", "author": "The_Duchess_of_Dork", "created": 1596665204, "upvotes": 3}, "g0hsnzm": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hsnzm/", "text": "There’s a member of the congressional black caucus that literally just looks like an old white dude.\n\nYou’re not going to be denied or discriminated against because you don’t “look” Mexican enough. Take the money.", "author": null, "created": 1596665195, "upvotes": 1}, "g0hseaa": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hseaa/", "text": "I 100% understand! My family is fully Brazilian but I am white in skin color because of recessive traits I pulled from my grandparents. Just because your skin color doesn’t fall under what most people consider to be colored, it doesn’t mean that your bloodline should be ignored. Take advantage of the different scholarships you qualify for and always ask when in doubt. Good luck! :)", "author": "purplecase101", "created": 1596665063, "upvotes": 1}, "g0hs2wr": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hs2wr/", "text": "Duh", "author": null, "created": 1596664905, "upvotes": 1}, "g0hrg6q": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hrg6q/", "text": "I don’t think it is wrong to accept it but if you can’t sleep at night then don’t do it. Also, don’t ever listen to someone who uses the term “free money.”", "author": "mynamesmace", "created": 1596664596, "upvotes": 1}, "g0hqeiq": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hqeiq/", "text": "Accept the scholarship. There are people who apply to scholarships that dont even relate to the scholarships because they need the money. Your future self will thank you for it. Also, you'll make new friends. 🙂", "author": "TheOfficialRiceBug", "created": 1596664082, "upvotes": 1}, "g0hq9dy": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hq9dy/", "text": "money is money.", "author": "MambaDrip", "created": 1596664012, "upvotes": 3}, "g0hq2tb": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hq2tb/", "text": "Take the scholarship, but use the opportunity to go to college to get in touch with your heritage, such as taking Spanish classes, hispanic history classes etc.", "author": "despacito4206669", "created": 1596663922, "upvotes": 2}, "g0ho2kb": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ho2kb/", "text": "I was in the same position.  I was offered a diversity scholarship for being mixed race (white and asian).  I don’t look one bit asian so I felt as though I was “stealing money” from other minorities who would’ve benefited from it.  Ultimately though, I think it’s important to recognize that the university awarded you that scholarship not because of your looks but because of you as a person, your qualifications, and your heritage that defines you.  I didn’t attend the school I received the scholarship from, but if I did I would’ve accepted it because college is pricey as fuck.", "author": "boodiboo", "created": 1596662942, "upvotes": 2}, "g0ho1e3": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0ho1e3/", "text": "There was a scholarship given at my college meant for black students, but it was awarded to a white student because he was the only one who applied and, apparently, legally they couldn’t not award him it because that would be “racial discrimination”\n\nIdk but if this white kid can take a scholarship meant for black people, you as a Mexican can take a scholarship meant for POC\n\nPlus, free money dude", "author": "Elevendytwelve97", "created": 1596662926, "upvotes": 11}, "g0hmny0": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hmny0/", "text": "As long as you were completely honest about your background when you filled out the scholarship, then you should absolutely take it. If you said you were half Mexican and half Canadian and you didn't lie and say you were black or something, then the scholarship is yours and you shouldn't feel bad for using it.", "author": "katsteve", "created": 1596662261, "upvotes": 8}, "g0hmjtw": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hmjtw/", "text": "I had a scholarship for diverse students based on my Hungarian-American parents and my first generation American status. I’m soooo white, yet qualified for a diversity scholarship. Just food for thought.", "author": "mother_of_nerd", "created": 1596662206, "upvotes": 1}, "g0hksm8": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hksm8/", "text": "Absolutely accept it!! Your skin tone does not matter.", "author": "mehoymiboi", "created": 1596661361, "upvotes": 1}, "g0hkk0u": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hkk0u/", "text": "It free money and will help you in the long run it might not see that now but it will so I would take it", "author": "katerow6789", "created": 1596661248, "upvotes": 1}, "g0hk2gu": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hk2gu/", "text": "A friend of mine is also half white and half Latino, and has a diversity-centered scholarship at our school. He’s definitely white passing (though he does have a Hispanic first name). I never saw anything wrong with it, and neither do any of our visibly non-white friends. Diversity isn’t just about skin color, after all. Your heritage is still an important part of who you are (for most people). Hispanic people have significantly less chance of going to and completely college - that’s what those scholarships are meant to combat. I definitely think you should take it.", "author": "kora_nika", "created": 1596661022, "upvotes": 2}, "g0hj9x4": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hj9x4/", "text": "Being Canadian-Mexican makes you what they call \"diverse\". I don't see why you wouldn't take it.", "author": "ThatProfessor3301", "created": 1596660653, "upvotes": 2}, "g0hj5ff": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hj5ff/", "text": "I hate the idea of heritage scholarships but please do take it if you qualify.\n\nPathetic that those even exist. There were minorities living in million dollar homes that I know who were eligible for that bullshit.", "author": "kahrido", "created": 1596660595, "upvotes": 4}, "g0hihtd": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hihtd/", "text": "Take the money, so it won't be a lot of money you have to pay out of pocket.", "author": "Warblerdalton", "created": 1596660294, "upvotes": 2}, "g0hhx61": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hhx61/", "text": "My mom is from the Dominican Republic and my dad is from Puerto Rico. I came out white as snow, still makes me as Hispanic as you are. Take the damn scholarship.", "author": "yaslh", "created": 1596660024, "upvotes": 4}, "g0hhf7j": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hhf7j/", "text": "Wow another affirmative action pick", "author": "sickboy789", "created": 1596659788, "upvotes": -3}, "g0hf6xu": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hf6xu/", "text": "You better take that money!  Forget pride when it comes to tuition. It beats paying a 25% interest rate from student loans!", "author": "Redd889", "created": 1596658767, "upvotes": 1}, "g0hezio": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hezio/", "text": "it’s free money. if your actually a POC then accept it, that’s what.. it’s. for.?", "author": "grubbycoolo", "created": 1596658677, "upvotes": 1}, "g0hc1te": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0hc1te/", "text": "Dude you’re Hispanic. Don’t feel bad. I bet there will be white passing students in that group with you.", "author": "art_lover82279", "created": 1596657403, "upvotes": 1}, "g0h5x2a": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0h5x2a/", "text": "Yes! Take the scholarship!", "author": "Pohlers", "created": 1596654723, "upvotes": 2}, "g0h3kkc": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0h3kkc/", "text": "Remember if your mixed race, that's 2 different heritages together, and just because one side of your heritage's genes have influenced the colour of your skin, that doesn't and shouldn't take away from the fact that you are a product of both heritages.\n\nAlso remember genetically a combination of your mum's and dad's DNA, those are genetics and it's what makes you, you. \n\nYes, from a superficial perspective you seem to have white skin, however that's quite literally skin deep. The college offered you a scholarship because they know you're deserving of it. \n\nTake the scholarship.", "author": "OateyMcHoface", "created": 1596653617, "upvotes": 2}, "g0h2jsr": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0h2jsr/", "text": "I’m glad you’re choosing to take the scholarship. I agree with all the comments, and I’m sure you have a unique perspective of your heritage while having light skin. You definitely have something fresh to bring to the table. Good luck out there!", "author": "publichealthofficer", "created": 1596653138, "upvotes": 3}, "g0h140i": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0h140i/", "text": "Dude. Its free money. You qualify for it, and shouldn’t worry about people giving you shit for having lighter skin. That’s bullshit, and none of their business. You saw that you were qualified, applied, and earned the damn thing. Take it!", "author": "Pyro-Millie", "created": 1596652465, "upvotes": 30}, "g0h0sph": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0h0sph/", "text": "It's not wrong to accept it. You qualified and you earned it. Your skin color doesn't matter in this situation. You're no less Mexican just because your family members have white skin tones :)", "author": "SquigglyHamster", "created": 1596652316, "upvotes": 170}, "g0h0nx8": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0h0nx8/", "text": "You qualify, therefore you should absolutely take it. Trust me, any help you can get at all is a fucking blessing", "author": "Evalion022", "created": 1596652254, "upvotes": 1}, "g0gzj1b": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gzj1b/", "text": ">  I will be put in a group of other students of color. \n\nWhat does that mean?\n\nThe scholarship is only open to POCs?  Or you will physically be placed with other POCs?", "author": "lupineblue2600", "created": 1596651714, "upvotes": 8}, "g0gzhof": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gzhof/", "text": "Don’t turn it down.", "author": "superduperkason", "created": 1596651697, "upvotes": 14}, "g0gxhu0": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gxhu0/", "text": "Absolutely take it. Im the same way. My mom is as white as can be but my father is hispanic. I’m very light skinned and felt a little uneasy taking the scholarship that covered my entire tuition that was basically based on my last name. I also had to be involved in our school’s multicultural community. I ended up taking the scholarship and was relieved to find out that I wasn’t the only one in the same boat. You’ll likely not be the only one either. Take any help you can get with your tuition.", "author": "Onyxpenguin426", "created": 1596650747, "upvotes": 2}, "g0gv4v2": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gv4v2/", "text": "I’m half Latino but I look super white and I’ve never had much of a connection to my heritage. I have a “diversity” scholarship to my school that I was originally really hesitant to accept but without it on top of my academic scholarship I wouldn’t have been able to go to college so I took it.", "author": "IanVM36", "created": 1596649599, "upvotes": 44}, "g0guhku": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0guhku/", "text": "I ain’t never seen no person of color turn down money cause they where given because of their skin color, don’t be stupid take the money!!", "author": null, "created": 1596649286, "upvotes": 13}, "g0grjib": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0grjib/", "text": "I was in this exact same situation a few months ago, and my advice is to go with your own gut. if you don't feel comfortable with your heritage yet, and being in a diversity scholarship would hurt your sense of identity, don't do it. If you need the money, obviously your identity should come second. And if the idea comes from your family's lack of oppression experiences, just know that being an immigrant is one.", "author": "pcbv", "created": 1596647965, "upvotes": 1}, "g0gp11m": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gp11m/", "text": "i say take it. just because you’re canadian as well does not mean that you are not diverse. i personally am not, so i feel a bit awkward giving you this advice, but take pride in your family history bro. also, college is expensive. i hate to say it, but it does tend to be survival of the luckiest out there. don’t turn something down because you don’t think you deserve it. trust me, if they’re offering, you absolutely do. best of luck :)", "author": "foreignnatives", "created": 1596646804, "upvotes": 5}, "g0gnr88": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gnr88/", "text": "College tuition and fees have inflated 4-5 times faster than the overall inflation since 1985. It's only getting more expensive. If the scholarship is for diverse groups that includes you! Your skintone is not definitive of anything. Take the money for education and run! It's meant for you and others alike.  You should not feel guilty for accepting.", "author": "Enjoythefall710", "created": 1596646227, "upvotes": 1222}, "g0gnp0z": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gnp0z/", "text": "It’s free money. Money that you don’t have to spend out of your own pocket.", "author": "Chowder1054", "created": 1596646200, "upvotes": 41}, "g0gffpu": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gffpu/", "text": "its free money my nibba", "author": "Joyson1", "created": 1596642380, "upvotes": 0}, "g0gc7fm": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0gc7fm/", "text": "Since you are technically not 100% white, just take it.  I'm Snow White over here and if I could get some assistance besides just a Pell Grant, I wouldn't question it one bit.  It's not like you're lying.\n\nBesides, there are many Portuguese, Mexican, and South Americans who look very white because they come from families where their ancestors mated with Spanish, English, or French explorers and local regents.  Doesn't make them any less Hispanic/Latino.", "author": "xmarketladyx", "created": 1596641006, "upvotes": 74}, "g0g9pu0": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0g9pu0/", "text": "You may have more privilege than some people of color, but you likely still don't have as much privilege as \"fully\" white students.  While I didn't have to face issues around a diversity scholarship, I'm racially somewhat similar to you -- my father's side is white Jewish American (and Jewish people are conditionally white anyway), my mother's side is Chinese American, and I pass for white.  I still have to face many microaggressions, most of which my white peers don't ever have to experience, and many of which are doubted by my POC peers -- and erasure is itself a form of racism.  Examples...\n\n* I still have to hear all the insults against Asian people and Asian culture, and often people don't tone them down b/c they think I'm white -- for example, a coworker told me that \"Chinese food just runs right through her\"\n* People refer to me as white to my face, despite knowing my heritage, and then when I call them out on it, they say \"well, you know what I mean.\"  Yeah, I know you mean you're racist and thought I'd go along with it.  \n* I still occasionally get \"Where you from?  No where you *really* from?\", I'm sure it's less than for \"full\" Asians, but for me instead of just guessing different East Asian nationalities, they also guess different Hispanic groups/nationalities and Native American as well.  \n* When I do get included in POC groups, the \"full\" POCs give me dirty looks as an interloper.  \n* White people share white savior stories with me about how they help POC, forgetting that I'm a POC.  \n* \"What is your race? Check only one\" forms make me want to throw my computer through a window. \n* I know a few Asian people who look down on white people, and they look down on me even more.  My own aunt told my mother \"why are you bothering to teach her to use chopsticks, she's never going to be Chinese.\"\n\nEven if you yourself haven't experienced racism or erasure personally, the Mexican side of your family definitely has in America, and they have been denied opportunities as a result.  If they had been allowed to rise to the level they of course deserved, think of how different your own life could have been -- for example, maybe they would've gotten rich enough you didn't need scholarships for college.  Scholarships like this are intended not just to help counteract the racism you yourself have faced, but the generational effects of racism that have changed your life for the worse as compared to \"full\" white people.  \n\nAnd if you really actually don't need the scholarship, you can still accept it to honor your heritage and ancestors, and then make a donation to the scholarship fund to help other deserving students get the help as well.  Heck, even if you *do* need the scholarship now, you can aim to donate to the scholarship fund in the future.", "author": "AceyAceyAcey", "created": 1596639932, "upvotes": 27}, "g0g89qf": {"link": "/r/college/comments/i46prn/should_i_accept_the_scholarship/g0g89qf/", "text": "it’s free money tho", "author": "calebgbrimhall", "created": 1596639326, "upvotes": 435}}}