{
  "sid": "qlabxf",
  "link": "/r/college/comments/qlabxf/should_i_drop_out/",
  "title:": "should i drop out?",
  "text": "Hi, so i’m 21 and i’ve been going to community college for 3 years now. In high school I did pretty well, averaged around B’s and some A’s, but once I started college I became the worst student possible. i’ve dropped out of numerous classes, failed 3 and changed my major 4 times, and I run into the same problem every time- I get overwhelmed and anxious to the point I’m frozen and feel like I can’t even look at my computer. I was dismissed from the first community college I attended for dropping too many classes and a low gpa. Since COVID, i transferred to another community college and began online classes. i’m about 10 weeks in and i’m extremely behind in 2 out of the 4 classes. I managed to finish one rushed course, but at this point in the semester I start crying as soon as I look at my assignments, grades and what I need to do to be successful. My major is Art, so I keep questioning why I’m putting myself through this stress and anxiety for something that won’t necessarily help me in the future. i’ve been wanting to go to cosmetology school to become a hair stylist, but I get so much pressure from my dad claiming that I would regret not getting at least my associates degree. At this point I don’t know what to do and it’s affecting my mental health so I could use some help. thanks",
  "author": "lc1766",
  "created": 1635876578,
  "updated": 1635890748,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hj1p7su": {
      "link": "/r/college/comments/qlabxf/should_i_drop_out/hj1p7su/",
      "text": "Just realize it’s not the end of the world man, I’ve been there, I got so deep under and I was so broke and mentally struggling that I just walked outta my house one night in college and never came back, either way you go, you’ll figure it out and life will carry on. I wouldn’t say I regret my decision, but I wouldn’t say it was necessarily the right decision either. You’ve got to take care of your mind first and foremost.",
      "author": "cowboyjon13",
      "created": 1635879941,
      "upvotes": 1,
      "replies": {}
    }
  }
}