{
  "sid": "q446w4",
  "link": "/r/college/comments/q446w4/for_those_of_you_who_havefound_meaningful/",
  "title:": "For those of you who have/found meaningful friendships in college, how did you meet your friends?",
  "text": "I’m a sophomore and I’m living with people I sorta get along with but sorta don’t. On the one hand we’ll have a laugh or throw a party, and the same week I’ll hear the guy I’m least close with talk about me behind my back. If we didn’t have fun times, these guys wouldn’t be my friends. I get along with most of them, but am in dire need of some real friends and feel lonely. I guess I can live with them for rest of the year but not for long.\n\nSo my question for those of you who have real friends you enjoy being with: how did you meet them? Any suggestions or advice in general? Could use some motivation too, I’m feeling very down about my college life in general.",
  "author": "Paolo7Simonetti",
  "created": 1633719113,
  "updated": 1634083175,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hfwysga": {
      "link": "/r/college/comments/q446w4/for_those_of_you_who_havefound_meaningful/hfwysga/",
      "text": "Just by hanging out in the common room and dining halls. We found common ground eventually, and now we talk and play games and hang. They really mean it when they say that you just have to put yourself out there.",
      "author": "to_walk_upon_a_dream",
      "created": 1633734970,
      "upvotes": 4,
      "replies": {}
    },
    "hfw3uye": {
      "link": "/r/college/comments/q446w4/for_those_of_you_who_havefound_meaningful/hfw3uye/",
      "text": "Started with one of my friends that was in dorm cluster. He had a thing for the girl next door and she was over a few times. She ended up being one of my best friends. Dorm friends brother had a roommate that ended up being my roommate sophomore year and ended being someone I still talk to 6 years later.",
      "author": "NinjaLorian",
      "created": 1633721630,
      "upvotes": 2,
      "replies": {}
    }
  }
}