{
  "sid": "qvkp7g",
  "link": "/r/college/comments/qvkp7g/how_to_get_out_of_a_depressive_episode_in_college/",
  "title:": "How to get out of a depressive episode in college?",
  "text": "I haven’t submitted any assignments in a week. I’m staying in bed all day. I’m not sure if it’s the weather or what and I feel so bad because my professors aren’t really accommodating it and letting me submit work late but I can’t blame them can I? . I just don’t want to even shower or eat. Nothing even happened I just feel awful suddenly. \n\nI tried to sign up for therapy through my school but there’s a super long wait list and I don’t have money for anything else. I feel like I’m sabotaging everything I have worked for — how is it that 3 years of grinding can crumble so fast? Anyway, how do you guys get yourself out of depressive episodes. I feel horrible",
  "author": "mcatpremedquestions",
  "created": 1637103766,
  "updated": 1637181102,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {
    "hkx2eej": {
      "link": "/r/college/comments/qvkp7g/how_to_get_out_of_a_depressive_episode_in_college/hkx2eej/",
      "text": "I try to break things down to the smallest *possible* step and get started. Sometimes just getting started is enough to build a little momentum; if not, that's still progress from where the day started. Usually it's somewhere in the middle, where it's like dragging a boulder, but doable. \n\n\nWhen that's not getting your stuff done, sometimes it can be helpful to make some calculated sacrifices. What I mean by this is that if there's a course where there are lots of assignments not worth a ton of points, it's less risk to your grade to miss one, versus missing an assignment worth like 10% of your grade. This isn't ideal, but when you hit a point where you *know* you can't get everything done, sometimes it helps to know where you have room to cut corners.\n\n\nSometimes it's helped to be around people who are doing stuff, either for encouragement or for accountability. I don't know why, but I feel way more motivated around other people than I would by myself.",
      "author": "torgoboi",
      "created": 1637105160,
      "upvotes": 8,
      "replies": {}
    },
    "hkx098h": {
      "link": "/r/college/comments/qvkp7g/how_to_get_out_of_a_depressive_episode_in_college/hkx098h/",
      "text": "I just force myself to go out. I find any stupid reason that will force me to get out. If I have to go out, I will shower first because I am too self conscious. Showering usually helps a lot. \n\nIf I manage to shower and go out, even if it's just to buy groceries, then I might be functional for the rest of the day.\n\nBUT what has really really helped me, is to have two or three people in my life that will force me to do things when I can't force myself. My boyfriend will make me go out with him to get coffee by the beach, will make me go to my martial art practice, will force me to make plans with friends and not take them back etc. My music partner will force me to go to rehearsal (if he knows it's the depression talking) even if I haven't practice enough, but again because I am self conscious, because I know he won't let me cancel then I force myself to practice and that's good. I have friends that will make me at least have a video call with them or play some games over discord or something. \n\nTherapy has helped me tremendously, but without the other people in my life I would have been way way worse.",
      "author": "cornualpixie",
      "created": 1637104230,
      "upvotes": 4,
      "replies": {}
    },
    "hkx57sh": {
      "link": "/r/college/comments/qvkp7g/how_to_get_out_of_a_depressive_episode_in_college/hkx57sh/",
      "text": "What I start with is baby steps. Have a paper to write? Open your laptop and make google doc and label it. Have a worksheet? Write your name at the top. Scan through assignments so you’re familiar with what they are about. Have a lecture video to watch? Bring your laptop or phone into bed, get a snack and watch it like a netflix show.",
      "author": "oliv_tho",
      "created": 1637106378,
      "upvotes": 1,
      "replies": {}
    },
    "hkxnzb6": {
      "link": "/r/college/comments/qvkp7g/how_to_get_out_of_a_depressive_episode_in_college/hkxnzb6/",
      "text": "There’s been a whole lot of great suggestions on this thread, but I’ll add another thing that affects me greatly.\n\nMake sure that you aren’t stuck in the same place all day, every day. It is absolutely vital that you get outside and have a break from screens when you get into a rut. It’s even better if you can fit exercise into it, although I understand that you don’t have any motivation or willpower left. Take baby steps, and don’t be glued to your house.",
      "author": "Lkj509",
      "created": 1637114634,
      "upvotes": 1,
      "replies": {}
    }
  }
}