{
  "sid": "qmztsq",
  "link": "/r/college/comments/qmztsq/am_i_screwed_in_life/",
  "title:": "Am I screwed in life?",
  "text": "For some background, I am a senior majoring in IT and Criminal Justice. The past few weeks I have been really stressing over what my future is going to look like, and I'm starting to realize that I didn't really learn anything in college. My university never provided any hands on \"training\" which is kinda important for IT imo, and the lectures never really taught me anything. I feel like I've set myself up for failure, and that I am going to stumble in a world of IT professionals who know a shit ton more than I do. I just feel like I have set myself up for failure because my path didn't focus on any programming, and the classes on networks, computer hardware, etc. really taught none of that. Has anyone else felt like this before or have any tips on what I can do to try and survive once I graduate?",
  "author": "mikervn",
  "created": 1636074901,
  "updated": 1636137163,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hjd6o5n": {
      "link": "/r/college/comments/qmztsq/am_i_screwed_in_life/hjd6o5n/",
      "text": "This is completely normal. People get anxious towards graduation because it’s a big shift and your everyday life is about to change. You may have to relocate for a job away from family etc. It’s a hard thing to accept but you have to trust yourself. \n\nYour life has been leading up to this moment and college is meant to give you the building blocks for your career. For example in elementary school you learned addition/subtraction, in middle school you started doing algebra and in college you did stats. You learned how to add 15 years ago but that doesn’t mean you forgot how to do it, it’s just not on your mind because you no longer have to think to do it and it’s implemented to what you’re currently learning.\n\nCollege is meant to introduce you to all these different concepts and give you the ability to apply them to your job. You aren’t supposed to know how to do IT work for every program that exists or know the sentencing precedent for X case. That’s what on the job training and gaining experience is for. \n\nYou’ll be okay. Good luck, and congrats on graduation.",
      "author": "rynpickles",
      "created": 1636078421,
      "upvotes": 6,
      "replies": {}
    },
    "hjd3uu3": {
      "link": "/r/college/comments/qmztsq/am_i_screwed_in_life/hjd3uu3/",
      "text": "Well, this is going to hurt but having an undergrad in these days is nothing. While you definitely should have searched for an internship or two by now u are still not fully fked. I have realized i while ago that if u are gonna wait for u school to provide u opportunities u will end up in mom's basement. My advice would be to inform yourself  independently and see ok where do I go from here. Ok  i late for an internship what would be a good MS to make myself more specialized in something. Analyze the market u wanna get in... Don't wait nobody is gonna provide u anything!",
      "author": "bumbumbum1969",
      "created": 1636077105,
      "upvotes": 4,
      "replies": {
        "hjd4xsz": {
          "link": "/r/college/comments/qmztsq/am_i_screwed_in_life/hjd4xsz/",
          "text": "Yea, I have realized that my school is useless. I had an internship this past summer and it was a company and an industry that I was definitely interested in. I applied for a position with them for after graduation but they never called me back, and the recruiter ghosted me. I think I’m just depressed and stressed thinking about it all",
          "author": "mikervn",
          "created": 1636077610,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjeriz9": {
      "link": "/r/college/comments/qmztsq/am_i_screwed_in_life/hjeriz9/",
      "text": "Yes",
      "author": "yetiman3511",
      "created": 1636117311,
      "upvotes": 0,
      "replies": {}
    }
  }
}