{
  "sid": "r1lhju",
  "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/",
  "title:": "High School student here, can someone please explain to me what a fraternity is?",
  "text": "So I’ve tried asking my mom what a frat is and she told me it’s like a special club that you pay for to get drunk and party and have sex and I’m not allowed to join one (but she can’t really stop me anyway). But I’m not exactly sure if this is really what they are about, and I’m just pretty confused about what a frat is and if I should join one when I go to college. Could someone help explain it to me please, is my mom right or do they have more than that?",
  "author": "IOnlyPlayAsEco",
  "created": 1637806747,
  "updated": 1638207010,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.71,
  "comments": {
    "hm0e7o0": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm0e7o0/",
      "text": "Disclaimer: not in greek life but plenty of friends who have been. \n\nAll of these comments are pretty cynical and this site has a anti greek life (aka Fraternities and sororities) view for sure but what it is generally is a house/group of students that are chosen by members through a recruitment process based on personality or interest. Most pay to be part of an easier way to try to make friends, often who like to party and go out and socialize. There are however also special interest fraternities that maybe do less partying (but still some) and more academic networking like engineering, community service, business, or premed fraternities. Some are also based around cultural interests. Join one if you like going out on weekends and partying and are willing to go through a recruitment process. If you don't like it, then that's valid and don't join. It could affect your academics, but I also know plenty of people who were in frats and are now studying for med school or graduated with engineering degrees and people who flunked out from partying or mental health issues who weren't in that kind of organization. Depending on the school I also know plenty of religious people part of greek life who joined for friends but never have more than a drink or two. \n\nThis sub gets plenty of topics complaining about not making friends or how the college experience is non-existent, but then likes to say the trope \"fraternities are just paying for friends\" and have anti-frat opinions. It's a bit contradictory. A social life is really important to maintain mental health and wellbeing and a Greek life org could be a helpful tool. Just because you dont value socialization or nightlife doesnt mean other people cant or shouldnt enjoy those things.",
      "author": "intl-uni-help-please",
      "created": 1637826086,
      "upvotes": 19,
      "replies": {
        "hm0p1ox": {
          "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm0p1ox/",
          "text": "Thanks for being rational",
          "author": "pussyslayerguy",
          "created": 1637834483,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlzfvah": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hlzfvah/",
      "text": "Ur moms right",
      "author": "ShibaSis23",
      "created": 1637807278,
      "upvotes": 43,
      "replies": {
        "hlzmqzy": {
          "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hlzmqzy/",
          "text": "Yep",
          "author": "TWR3545",
          "created": 1637810442,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlzrv38": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hlzrv38/",
      "text": "A frat claims to be an opportunity to be mentored by and mentor your peers, while also building a robust professional network.\n\nIn reality none of that happens, 99% of frats are there to get drunk/ laid/ and finish easy non- in demand degrees (see communications).",
      "author": "New_Demon24-7",
      "created": 1637812956,
      "upvotes": 25,
      "replies": {
        "hm23t61": {
          "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm23t61/",
          "text": "Say “frat bad” on reddit and watch the upvotes flood in. \n\n\nThat’s not what they’re for. Although, I don’t think wanting to drink, get laid, and finish college is unique to a fraternity. Sounds like men in general lmao",
          "author": "SockEmRocco",
          "created": 1637862745,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlzuquh": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hlzuquh/",
      "text": "Fraternities are not for people who are serious about college. Your mom is right. If you want to pay to live that kind of lifestyle, go for it, it'll be fun but understand that it doesn't attract the \"studious and ambitious\" crowd. Mostly privileged, toxic, and careless boys.",
      "author": "eyeofmint",
      "created": 1637814445,
      "upvotes": 12,
      "replies": {
        "hm21jox": {
          "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm21jox/",
          "text": "Not true.",
          "author": "SockEmRocco",
          "created": 1637861810,
          "upvotes": 2,
          "replies": {}
        },
        "hm01n7y": {
          "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm01n7y/",
          "text": "They really are so horrible.",
          "author": "gongetriddadisshit",
          "created": 1637818176,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm20dlm": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm20dlm/",
      "text": "Yes. I’ve been in a fraternity for all of college and  have served as president within our chapter of roughly ~50 guys.\n\n\nA fraternity is a men’s social organization which focuses on fostering brotherhood while participating in philanthropy, service, social events, and member development.\n\n\nI do get drunk, party, and have sex. I would still do all of these if I didn’t join a fraternity, but to each their own. In my chapter, we host philanthropic events to raise awareness for domestic violence and autism. In addition, we participate in intramural events together, have informal and formal trips together, study together, and yes, party together. Fraternities do cost money in the form of dues. Dues usually fund: The chapter house which typically has 10-15+ bedrooms, some event fees (socials, homecoming, recruitment), national insurance incase something goes wrong at a chapter house (minor caught drinking booze, accident happens and someone gets hurt, etc), and a small fee goes to fraternity nationals (which is bs but it is what it is). The paying for friends argument makes no sense.\n\n\nIf you like doing typical guy stuff and kicking it with your friends, you might like to join one. I know I’ve really enjoyed having a support system away from home while being able to workout, go fishing, play video games, hoop, study, party, and hang with my bros. \n\n\nIgnore the odd reddit users claiming fraternity guys are bums or privileged. I’m a first gen college student that started an amazon business in college and will be starting med school next year. \n\n\nEnjoy college, you’ll find something that fits you👍🏻",
      "author": "SockEmRocco",
      "created": 1637861333,
      "upvotes": 4,
      "replies": {}
    },
    "hlzm8es": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hlzm8es/",
      "text": "By googles definition:\n\na male students' society in a university or college.\n\nthe state or feeling of friendship and mutual support within a group.\n\nIt’s really like a house that a bunch of guys live in at college. They may share common interests or are sharing the same major or minors in college. These can also be made up of a religious group or academic society.",
      "author": "Maleficent-Ad-6667",
      "created": 1637810197,
      "upvotes": 3,
      "replies": {}
    },
    "hm0po49": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm0po49/",
      "text": "I am in a fraternity. It is essentially is like a social club, in which you pay for membership and it may be secret or non secret (rituals etc.)  It also helps you build connections with alumni who were also in it which can land you jobs after college. Furthermore, it is an excellent tool for leadership growth and opportunities. I have served on our executive board under risk management and it definitely was an awesome opportunity. Furthermore, the parties and fun events we throw are a blast too. A lot of people on reddit may hate fraternities and some hate us for good reasons. There are cases of SA that fraternities have been known to try and cover up, however that is stereotyping. My chapter has been around for  years and we haven't had to deal with a title IX as far as I know, which is something we are immensely proud of. We weed out bad guys and refuse to let anyone who exhibits creepy behavior be a part of our fraternity. Furthermore, take a look at how many presidents have been in fraternities, Neil Armstrong was an alumni of mine, as is Adam silver (NBA commissioner) as well as the CEO or LinkedIn, the CEO of chipotle, the CEO of Dropbox and the owner of KFC to name just a few. People saying \"people in fraternities don't take college seriously\" are more likely than not upset that they don't party more and feel unfulfilled in their college experiences. My chapters cumulative GPA is above a 3.0 and having guys in the fraternity who have taken classes that you may one day take helps with grades because they can help you study and prepare for tests. Sorry about the rant but I'd figure I'd give you my perspective.",
      "author": "pussyslayerguy",
      "created": 1637834992,
      "upvotes": 3,
      "replies": {
        "hm10gz1": {
          "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm10gz1/",
          "text": "But Google says that Neil A went to Purdue, Jeff Weiner went to UPenn, and Drew Houston got his degree at MIT. How could they all be your alumni?",
          "author": "leozianliu",
          "created": 1637843566,
          "upvotes": 1,
          "replies": {
            "hm18qih": {
              "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm18qih/",
              "text": "i think they mean under his frat like they were all in his frat at different schools",
              "author": "trackxdreams",
              "created": 1637848648,
              "upvotes": 5,
              "replies": {
                "hm1eesj": {
                  "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm1eesj/",
                  "text": "Yep, precisely what I mean",
                  "author": "pussyslayerguy",
                  "created": 1637851579,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm0r3v3": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm0r3v3/",
      "text": "Observation: A guy posted a question about frat and received almost all replies from girls/women (judging from profile pic).\n\nReddit is a weird place.",
      "author": "leozianliu",
      "created": 1637836164,
      "upvotes": 1,
      "replies": {}
    },
    "hm01j54": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm01j54/",
      "text": "A scam.",
      "author": "gongetriddadisshit",
      "created": 1637818112,
      "upvotes": -1,
      "replies": {}
    },
    "hma1b9q": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hma1b9q/",
      "text": "I was in greek life, so hopefully I can help. The stereotypes are true for SOME fraternities, but not all. \n\nBasically, it is a group of people who get together to share a common bond (the fraternity). You make friendships and may party, yes, BUT it is also great for building relationships with people to network in the future (it's about who you know, not what you know sometimes). They also do events called philanthropies, which are basically charity events...in simple terms haha. You also learn about brotherhood/close relationships/networking. \n\nThe money you pay to be a part of it isn't \"paying for friends,\" but to fund the operations of the fraternity. The events, resources, and housing don't pay for themselves. \n\nBut it all depends on the frat you choose. Rushing is the process of basically checking out all the frats and basically interviewing with each to see if you and a certain frat are a match. It is a great way to see which frat you want to join, and which ones you don't. They pick you but you get to pick your top ones each day (rush week is just a week, but you visit all of them the first day, then it dwindles down each day until you and a frat \"match\"). \n\nAlso, there are academic frats, not just the stereotypical greek life ones. It's more like a club but still has fees and some of the same aspects. We had one that was an engineering fraternity, where you had to be an engineer major. These ones are greaaaaaat for networking in the future after college.",
      "author": "metalheadplanner",
      "created": 1638024538,
      "upvotes": 1,
      "replies": {}
    },
    "hm23epa": {
      "link": "/r/college/comments/r1lhju/high_school_student_here_can_someone_please/hm23epa/",
      "text": "Google is free",
      "author": "when-words-fail",
      "created": 1637862581,
      "upvotes": -2,
      "replies": {}
    }
  }
}