{
  "sid": "qhibbf",
  "link": "/r/college/comments/qhibbf/do_community_colleges_require_12_years_of/",
  "title:": "Do community colleges require 12 years of education for international students",
  "text": "Sorry if I’m asking again because previously i didnt get any answers so I’m gonna try my luck again.\n\nDo community colleges require 12 official school years?\n\nI’m planning to take the GED and SATs(self study, online courses),  I’m a international student (never been to the us but planning to) and here we graduate at 16(10 years of official school) because we do the Cambridge curriculum so we usually move up to Alevels for another 2 years and graduate there and move on to Uni.\n\nAs you guys know most universities require a 12 year official school education(correct me if I’m wrong), do community colleges require this as well?\n\nIf they don’t and i enter a community college for 2 years does that mean at the end I’ll have 12 years of official education(when entering community college ill only have 10 years of official education) and i can then meet the requirements and move on to Uni? Also how hard is it for community college graduates to move up to Uni? My high school grades are horrid",
  "author": "throwRAmovingtoSA111",
  "created": 1635409641,
  "updated": 1635456988,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hicy93o": {
      "link": "/r/college/comments/qhibbf/do_community_colleges_require_12_years_of/hicy93o/",
      "text": "I think the 12 years of education is an American thing since our school system is 1st-12th grade with each grade being a year. If you already have completed your general education from your home country and are pursuing higher education in the U.S then that rule shouldn’t apply to you.\n\nEdit: grated take what I say with a grain of salt… I was born in the U.S so I could be really off base. The best way to figure this out in my opinion would be to get in contact with a college international student affairs department.",
      "author": "Tactical_Leo",
      "created": 1635411739,
      "upvotes": 1,
      "replies": {}
    },
    "hid3cf0": {
      "link": "/r/college/comments/qhibbf/do_community_colleges_require_12_years_of/hid3cf0/",
      "text": "They don't.",
      "author": "LikelyWriting",
      "created": 1635416055,
      "upvotes": 1,
      "replies": {}
    },
    "hiddu6m": {
      "link": "/r/college/comments/qhibbf/do_community_colleges_require_12_years_of/hiddu6m/",
      "text": "Many US universities don't even ask to see your high school transcript and SAT scores once you complete an associate's degree or a certain number of college credits. I was homeschooled and it wasn't a problem. Talk to the community college you want to enter, I am sure they can help you. Talk to them before you take the GED and SAT. It might not even be necessary.",
      "author": "QuentinDurward",
      "created": 1635423170,
      "upvotes": 1,
      "replies": {}
    },
    "hieg703": {
      "link": "/r/college/comments/qhibbf/do_community_colleges_require_12_years_of/hieg703/",
      "text": "If it is considered high school graduation in your country, most colleges will accept it. It’s not about length in the US, it’s more about equivalency. Call the school and ask what proof of graduation you’ll need!",
      "author": "JeanVII",
      "created": 1635439852,
      "upvotes": 1,
      "replies": {}
    },
    "hiervg0": {
      "link": "/r/college/comments/qhibbf/do_community_colleges_require_12_years_of/hiervg0/",
      "text": "They require evidence that you have the skills to be able to keep up with studies.    If you have bad grades, you will most likely be required to take some basic English and Math courses to show you can study at the level required.      Universities in the US usually require paperwork showing past degrees and grades earned.   The highest level you've studied will be what they take most into consideration, though that can depend on how long ago and which subjects.\n\n&#x200B;\n\nI did well in high school and pretty crap in my Bachelor's degree.   However, I later returned to a community college for courses in a different subject, got all A's and was accepted into a Master's program at an excellent university.",
      "author": "ElegantProvocateurXX",
      "created": 1635444364,
      "upvotes": 1,
      "replies": {}
    }
  }
}