{
  "sid": "qekfjv",
  "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/",
  "title:": "How would you feel going to college with a 29 year old.",
  "text": "I go to class on campus next semester and sometimes feel a little apprehensive. Most people on campus are 17-22, and I won't graduate until I'm 32. I'm 29 in a few months. I have my reasons for going to college at this age. Mainly just because I couldn't take the horrible jobs, and I'd like to be a CPA and start or buy an accounting firm. It just feels weird going on campus. What would be your first thought if you saw someone near 30 on campus in your undergraduate class?",
  "author": "Verdict44",
  "created": 1635047872,
  "updated": 1635184589,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hhtobsa": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhtobsa/",
      "text": "Idc man I just want my degree, I’m in a night class with only late 20s and 30 yr olds, I legit don’t care we all paid to be here, as long as you aren’t an ass ur good in my book and I think a lot of people think the same.\n\nIf you take night classes you’ll see a lot more people around your age, morning & afternoon classes are those 17-22 yr olds. Don’t give it too much though because I guarantee nobody cares as much as you think they do.",
      "author": "Kenkxb",
      "created": 1635048429,
      "upvotes": 11,
      "replies": {
        "hhtox5y": {
          "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhtox5y/",
          "text": "Thanks. I think I just need to start, and then I won't care. Sometimes I don't care, then when I think about it too much, I care. I just needa start going to classes, and I bet it will go away. Thanks again.",
          "author": "Verdict44",
          "created": 1635048782,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhu1vaj": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhu1vaj/",
      "text": "I would probably prefer a 29 year old than the average college student as a teammate in a group project. Someone at that age going to college has to be serious about it",
      "author": "cowfishAreReal",
      "created": 1635057692,
      "upvotes": 8,
      "replies": {}
    },
    "hhtz9zj": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhtz9zj/",
      "text": "One of my teammates on my senior design team graduated HS before I was born, and I'm 26...it doesn't matter at all I can still talk to him and his experience is actually pretty valuable to our team.\n\nA couple of people I met at CC were also around my age or slightly older and they mixed just fine with everyone, so pretty much it doesn't really matter",
      "author": "NinjaLorian",
      "created": 1635055707,
      "upvotes": 6,
      "replies": {}
    },
    "hhuku73": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhuku73/",
      "text": "I thought it might feel weird too.\n\nWhen I was 18 I took community college classes and a LOT of my classmates were older. 40s, 50s, 60s even. But I was studying early childhood at the time.\n\nWhen I went back to school for engineering years later I thought it might be weird being in my 30s and having kids, you know? But at community college a good number of my classmates were in very similar positions to me. \n\nI thought when I transferred to university it might be weird for some people and make study groups and friendships weird. But its not, and actually, I have a classmate who is twice my age.\n\nI'm old enough and have enough going on in my family life that I'm not really interested in hanging out with my classmates or going to parties, but we still lean on each other for academic help. I've told classmates casual stories about my kids and they still wanna study with me so I guess they don't find it too weird.",
      "author": "MrFancyBlueJeans",
      "created": 1635073696,
      "upvotes": 5,
      "replies": {}
    },
    "hhupb22": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhupb22/",
      "text": "One of my best friends in college is turning 29 in December. I’m 23. No one cares as long as you don’t make a big deal about it. We’re all just here to get our degrees and graduate ahahah",
      "author": "coraline_button_",
      "created": 1635077004,
      "upvotes": 4,
      "replies": {}
    },
    "hhtxyg0": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhtxyg0/",
      "text": "I find my older peers delightful.\n\nAs long as you are respectful and take interest in your younger peers, you shouldn't have any trouble finding your place on campus.",
      "author": "dinoteef",
      "created": 1635054715,
      "upvotes": 3,
      "replies": {}
    },
    "hhveaea": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhveaea/",
      "text": "Honestly, I'm starting next year at 22, it'd be nice to not feel like all the people I'm interacting with are children.",
      "author": "romandrogynous",
      "created": 1635089916,
      "upvotes": 3,
      "replies": {}
    },
    "hhtspj5": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhtspj5/",
      "text": "I’ve had some people as old as like 60 in some of my classes (polisci and languages).  There are lots of reasons older people take college classes and it’s not uncommon, especially at bigger universities.  People might see you and be curious, but it’s not like they’re judging you.  Go for it!",
      "author": "Heyrist",
      "created": 1635051085,
      "upvotes": 2,
      "replies": {}
    },
    "hhtyy8s": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhtyy8s/",
      "text": "I go to a community college, so for me it’s quite normal",
      "author": "Immediate-Duck3929",
      "created": 1635055464,
      "upvotes": 2,
      "replies": {}
    },
    "hhuuma4": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhuuma4/",
      "text": "I’ve got some ppl in their late 20s in my classes, all great ppl and solid classmates. Just be a decent person 🤷🏽‍♂️\n\nEdit: grammar",
      "author": "somerandomperson1099",
      "created": 1635080252,
      "upvotes": 2,
      "replies": {}
    },
    "hhuym18": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhuym18/",
      "text": "I'm a junior and I'm 33 years old now. I speak English as my second language and I'm Asian. There's a lot of obstacles on my way but it's the only way if I want to have a brighter future. So just keep fighting!",
      "author": "Wise-Value-8415",
      "created": 1635082508,
      "upvotes": 2,
      "replies": {}
    },
    "hhv6smh": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhv6smh/",
      "text": "Honestly nobody really cares, if they do that's on them. Get your degree! My mom is finishing her accounting undergraduate degree next semester, at 58! \n\nIf anything, people would prefer working with/seeing \"older\" students. I know I do. Good luck!",
      "author": "orangebunn",
      "created": 1635086524,
      "upvotes": 2,
      "replies": {}
    },
    "hhv6tc9": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhv6tc9/",
      "text": "It doesn’t make any difference to me whatsoever. I’ve been in class with people in their late teens, 20’s, 30’s, 40’s and probably so on. As long as you work hard if we get partnered up 😂",
      "author": "AccomplishedCrow7495",
      "created": 1635086534,
      "upvotes": 2,
      "replies": {}
    },
    "hhwnah2": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhwnah2/",
      "text": "I've been in classes where there are older students (30's) as well as kids who are still in high school. In college age doesn't really matter, everyone is just trying to get their education and degree",
      "author": "Stonedmagus",
      "created": 1635108132,
      "upvotes": 2,
      "replies": {}
    },
    "hhx2dwq": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhx2dwq/",
      "text": "in a lot of my classes we have older students and it’s chill, we all just wanna get our degrees and go",
      "author": "badbitchbobo",
      "created": 1635114763,
      "upvotes": 2,
      "replies": {}
    },
    "hhttkwx": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhttkwx/",
      "text": "I would be overcome with the urge to throw batteries at them and then tar and feather them.",
      "author": "SadWater7",
      "created": 1635051657,
      "upvotes": 1,
      "replies": {}
    },
    "hhu6fnd": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhu6fnd/",
      "text": "[removed]",
      "author": null,
      "created": 1635061410,
      "upvotes": 1,
      "replies": {}
    },
    "hhxfw3a": {
      "link": "/r/college/comments/qekfjv/how_would_you_feel_going_to_college_with_a_29/hhxfw3a/",
      "text": "I have people in their 40s in some of my classes. One of my professors is in one of my online classes. I don't think anyone cares tbh",
      "author": "NoDryHands",
      "created": 1635121425,
      "upvotes": 1,
      "replies": {}
    }
  }
}