{
  "sid": "qklbp7",
  "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/",
  "title:": "ProctorU accused me of cheating and it's really pissed me off. How should I handle this?",
  "text": "A few weeks ago I took a midterm for a STEM class using ProctorU. Here are the important details:\n\n* I work in IT and have Teamviewer installed on my laptop as part of my job.\n\n* When I logged in to take the test and downloaded the ProctorU software, the \"proctor\" noticed that Teamviewer was installed and informed me that I would need to uninstall it and reconnect.\n\n* I agreed, and uninstalled the software while ProctorU was still connected and recording the session.\n\n* I reconnected as instructed and proceeded to take the test. There were no issues with the new \"proctor\". I scored a 96 because it was an easy exam and I prepared for several hours.\n\n* A few days later, I receive an email from my professor that he was invalidating my score based off of a report from ProctorU. Their attached letter said that it was because Teamviewer was installed and due to their \"experience in cases of a similar nature, the academic integrity of the exam had been breached.\" The report mentions that they asked me to uninstall it and that I understood, and that there was a video of the incident.\n\n* I replied to the professor that Teamviewer was a widely-used program and was part of my job. If he had access to the video, not only would he be able to see that there was no active remote session, but also that I uninstalled the software before beginning the exam. Regardless, he decided that he wants me to take the exam again.\n\nAlthough this is a purely online class, the Professor has requested that I go to the physical college to take the exam. I'm fine with this, since I know for sure that my score will be the same or better since the exam was easy and I absolutely did not cheat. I've set two different appointments with him and he has failed to show up and later sent me emails apologizing for the \"miscommunication\".\n\nI plan to finalize this score on the test retakes and then file a grievance with the college. My greivance will be as follows:\n\n*  Against the college for using this service that provides undertrained, underqualified \"proctors\" located in a call center on the other side of the world and allowing them to submit false claims with zero evidence. (I'm not sure if I should work in here the obvious security and privacy concerns in allowing these assholes access to my computer)\n\n* Against the professor for accepting this and forcing me to retake the exam with zero evidence of actual dishonesty.\n\n\nAm I taking this too far? I'm an older student and certainly would not put up with this kind of behavior in the professional environment. I work full time and have a full class load so this has been a giant pain in the ass so far. My reason for wanting to pursue this is the idea of a young adult being subjected to this with little life experience and how horrible this situation would be for them.\n\nI would like to ask the college to:\n\n* Re-examine their use of ProctorU\n\n* Or require additional training for the \"proctors\"\n\n* Raise the bar of evidence required before accusing a student of academic dishonesty\n\nThe professor acted like he was doing me a favor in not involving the department head. However, once I am finally able to retake the test and try to clear my name, I plan to send this grievance through the official channels to the Department Head and am still considering whether or not to involve my attorney.\n\nI would like some feedback please on whether I should even bother with this. I don't have high hopes that anything would change, but I would like to encourage both the college and my professor to think twice before pulling this bullshit on another student.",
  "author": "MSMSP",
  "created": 1635794038,
  "updated": 1635890563,
  "over_18": false,
  "upvotes": 139,
  "upvote_ratio": 1.0,
  "comments": {
    "hixjfij": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hixjfij/",
      "text": "Yes, please bother. At my university, ProctorU has already been kicked to the curb. I imagine this is because so many students have complained. The first time I used it, I was SHOCKED that we had to give over control of our computers (even if just for a few seconds). I reluctantly did it but to me that is such a PITA and goes against all modern advice on how to protect your information.",
      "author": "SenoraGeo",
      "created": 1635800892,
      "upvotes": 102,
      "replies": {}
    },
    "hixufrg": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hixufrg/",
      "text": "Do it. In fact they might take you more seriously because you're an older student. Glad to see you have some balls",
      "author": "Brushermans",
      "created": 1635805542,
      "upvotes": 51,
      "replies": {}
    },
    "hix3pe6": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hix3pe6/",
      "text": "Hell no, hold the professor accountable like he was going to try and hold you accountable. His “miscommunication” should be brought up as well.",
      "author": "Spicybooiii",
      "created": 1635794547,
      "upvotes": 116,
      "replies": {}
    },
    "hiyj0z4": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hiyj0z4/",
      "text": "I dream of a day where the ProctorU’s of the world are disbanded. We use a similar software where we have to uninstall any program that runs in the background, give the program administrator level privileges, unattach any external devices like multiple monitors and speakers/headphones, and when we start we have to scan our driver’s licenses. It’s a HUGE invasion of privacy and while I’m not doing anything “wrong” it’s just uncomfortable, not to mention a huge pain.",
      "author": "NeedsMoreJava",
      "created": 1635816487,
      "upvotes": 20,
      "replies": {}
    },
    "hixyrb8": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hixyrb8/",
      "text": "Pro tip for everyone else who has to deal with terrible online proctoring services: make a completely clean computer environment just for taking exams. Use a spare computer if possible, or otherwise just make another user account. Remove or disable everything except the exam program/browsers.",
      "author": "jhulc",
      "created": 1635807428,
      "upvotes": 27,
      "replies": {}
    },
    "hixwqcz": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hixwqcz/",
      "text": "Ace that test and file those charges. You got this dude",
      "author": "GoldRequest",
      "created": 1635806541,
      "upvotes": 16,
      "replies": {}
    },
    "hiz73l8": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hiz73l8/",
      "text": "Who or where do you plan to file this grievance with?",
      "author": "lucianbelew",
      "created": 1635829139,
      "upvotes": 2,
      "replies": {
        "hj24jbb": {
          "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hj24jbb/",
          "text": "My college has a well-documented process for filing complaints/grievances.",
          "author": "MSMSP",
          "created": 1635885835,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiz4hgy": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hiz4hgy/",
      "text": "[deleted]",
      "author": null,
      "created": 1635827402,
      "upvotes": 1,
      "replies": {
        "hizhizd": {
          "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hizhizd/",
          "text": "My school uses lockdown browser instead of proctorU, but I have to have a camera with audio on at all times. I have to circle the camera 365 around my room, show my desk, all that stuff. And while the test is being taken, it apparently has software or something that detects eye movements and head movements and stuff. I wouldn't dare use a phone while taking a test lol",
          "author": "-SmashingSunflowers-",
          "created": 1635837508,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj0llof": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hj0llof/",
      "text": "I cannot fuckin stand ProctorU. Having to watch them install and run some plugin on my PC sucked.",
      "author": "CaprioPeter",
      "created": 1635864060,
      "upvotes": 1,
      "replies": {}
    },
    "hj2fy0h": {
      "link": "/r/college/comments/qklbp7/proctoru_accused_me_of_cheating_and_its_really/hj2fy0h/",
      "text": "Appeals are a thing after all. You should absolutely go ahead and do it.",
      "author": "Unexpectedarthur",
      "created": 1635890206,
      "upvotes": 1,
      "replies": {}
    }
  }
}