{
  "sid": "qpo7ho",
  "link": "/r/college/comments/qpo7ho/college_isnt_what_i_thought_it_would_be/",
  "title:": "College isn’t what I thought it would be",
  "text": "Growing up my family always told me that college would be the best time of my life and it would be super fun and I’d meet tons of people left and right. Well now I’m a sophomore in college and it just isn’t anything like how my family described it. I feel like all I ever do is school work, and still don’t even do well in my classes. I was super isolated in the dorms because of covid and now I have roommates that I never see, so I’m still super isolated. I’ve only made one real friend the entire year and a half I’ve been here and I can’t really meet people in my classes because they’re still mostly online. I can’t help but feel like I’m doing something wrong because I’m not having the college experience that people always describe. It’s not fun, it’s just stressful and lonely and I can’t wait for it to be over. Does anyone else feel this way?",
  "author": "Ok-Blueberry-9184",
  "created": 1636408340,
  "updated": 1636655292,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hjvpn7g": {
      "link": "/r/college/comments/qpo7ho/college_isnt_what_i_thought_it_would_be/hjvpn7g/",
      "text": "I felt like I was reading my own writing. I feel the same way, all I do is study and I've made literally one friend aside from my roommates. I think college is overhyped, and there is no \"one way\" to experience it. Just do what makes you happy, even if it doesn't look like your family described it.",
      "author": "SilentSwordfish392",
      "created": 1636421713,
      "upvotes": 8,
      "replies": {}
    },
    "hjv1ky4": {
      "link": "/r/college/comments/qpo7ho/college_isnt_what_i_thought_it_would_be/hjv1ky4/",
      "text": "If college is the highlight of your life, it’s probably not a good life.",
      "author": "Spicybooiii",
      "created": 1636410960,
      "upvotes": 16,
      "replies": {
        "hjw98we": {
          "link": "/r/college/comments/qpo7ho/college_isnt_what_i_thought_it_would_be/hjw98we/",
          "text": "Or maybe it just means you're young",
          "author": "Temporary-Complex751",
          "created": 1636430637,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hjw772n": {
      "link": "/r/college/comments/qpo7ho/college_isnt_what_i_thought_it_would_be/hjw772n/",
      "text": "i dont think it is college. i mean, one can enlist in army and have best time of their life. it is what you make of it, not other way around.",
      "author": "ghostmode342",
      "created": 1636429660,
      "upvotes": 5,
      "replies": {}
    },
    "hjuvw13": {
      "link": "/r/college/comments/qpo7ho/college_isnt_what_i_thought_it_would_be/hjuvw13/",
      "text": "it's not fair to wonder if you're doing something wrong when it seems covid is the main cause of your isolation. No one feels like they can do just whatever right now. that's how it is on this planet at this moment in time. Of course some are just ignoring covid and doing whatever they want. I don't think that's a good idea, though.\n\nAnyway the pandemic is no doubt taking a bite out of how millions of students' college experience should be right now. And that sucks, I know. but you can't blame yourself for that!",
      "author": "whatistheformat",
      "created": 1636408616,
      "upvotes": 7,
      "replies": {}
    }
  }
}