{"sid": "j21r2j", "link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/", "title:": "College is making me depressed and I don't know what to do.", "text": "I just started college last month. I'm majoring in sciences. Im failing in some of the classes and I feel like I'm falling behind. \n\nThis is very different from high school. I used to excel at school without the need to study much. Now I'm studying 24/7 and it's draining my life energy away. I've fallen into depression and I haven't left my house in weeks now. Because of the online classes, I don't know anybody in classes and I'm staring at my screen all day. (my textbooks are all online). My eyes are deteriorating at a quick rate. It's the first time in my life that I'm doing all-nighters. I've been having mental breakdowns often. I don't have a balance. \n\nCan someone give me advice on what to do? I'm lost.\n\nEdit: I read all of the replies. Thank you all for all the advice and support messages. I really appreciate it. It means a lot :)", "author": "clubthesadist", "created": 1601394322, "retrieved": 1632801981, "over_18": false, "upvotes": 1482, "upvote_ratio": 0.98, "comments": {"g901ncq": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g901ncq/", "text": "Stop making college such a big deal. Yeah you have to finish, but don't let it overwhelm you. You're only human.", "author": "honeyonpizza1995", "created": 1602855586, "upvotes": 1}, "g89u0zp": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g89u0zp/", "text": "I'm in my late twenties and just got back into college this semester. I've worked retail and trade work the past 10 years and despised it. I've been studying all day every day the past 2 months and loving it compared to working in the heat all day. The best advice I can give is just try tough it out, because jobs without a degree can suck pretty bad. Put in the work now and you'll have a much better job in the future. Just make sure to take plenty of small breaks throughout the day.", "author": "BrrToe", "created": 1602292098, "upvotes": 1}, "g762e34": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g762e34/", "text": "We have all been in this state to some degree. I recommend going to science help sessions if your school has them or getting a private tutor. Really helped me last year.", "author": "Fritz___", "created": 1601471626, "upvotes": 1}, "g761ytw": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g761ytw/", "text": "This is super late but I hope you read this and this is able to help you.\n\nI was very much like you and my transition into Higher studies hit hard. I basically gave up on studying because I didn't even know what studying was - I had never studied before. Right now, I am going through a learning process of how to learn.\n\nFirst and foremost, set or schedule time for studying. Start slow (2-4 hours) for now. And then schedule time for different activities. If you don't feel up to going out at this very moment or period, thats ok - there are many things you can do at home! You could watch dance tutorials on Youtube and follow along or maybe try drawing. Cooking, knitting, reading, writing - these are all things you can do at home. Schedule time for different activities, starting with maybe one activity and try doing it.\n\nIf this feels like too much, try doing one activity for a week, and then adding another one the next week and so on. The most important thing you will get from this is a sense of accomplishment and satisfaction at the end of the day. And this makes you want to do this the next day and so on.\n\nIn regards to studying - I really like some of Ali Abdaal's videos (Youtube) on active recall. As others have mentioned, focus more on studying effectively. His videos have helped me to study in a more effective manner.\n\nYou mentioned that your eyes are deteriorating, I assume this is because all of your lectures are online? Unless the lecture has lots of demonstrations, try listening to only the audio (connect your laptop to headphones and sit facing away from the screen?) Whilst going through the lecture, test yourself on your understanding constantly. After the lecture, to memorise, make Anki (this is what I do and is an example of studying effectively.)\n\nLearning to learn is a process and honestly, you have to work to find what works for you. I am still trying to get into studying and have recently started enjoying it, little by little because I am able to understand and learn things which I couldn't through school. I hope that you grow to be able to feel more accomplished by the things you do.\n\nGood luck!", "author": "Qualifiedadult", "created": 1601471380, "upvotes": 1}, "g75zejz": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g75zejz/", "text": "Ah yes, this reminds me of my freshman year as well. I took three heavy stem courses with labs right off the bat, and it made me an absolute nervous wreck most of the time. As a junior, I've come to accept that life and its gotten so much easier to find balance. I know you will too. Just give it time.", "author": "XkratoszantX", "created": 1601469741, "upvotes": 1}, "g75tlfp": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g75tlfp/", "text": "Been experiencing the same lately. We'll get through this! Sending virtual hugs if that helps.", "author": "bashfulred", "created": 1601464934, "upvotes": 1}, "g75nw5k": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g75nw5k/", "text": "It was a really hard adjustment for me so you’re not alone! Take care of yourself. Get at least 6-9 hours of sleep and make yourself a schedule! Let your professors know too. They won’t kill you 💞", "author": "pizzaslut1121", "created": 1601458580, "upvotes": 1}, "g75hsvy": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g75hsvy/", "text": "Since you just started I figure you might adjust.  It can seem daunting to see the mountain of undergrad you have to climb, but looking back it‘s not so bad.  My advice would be to roll with the punches and don’t overextend yourself.  The lack of the traditional college experience is a bummer because a huge part of it was social: meeting and interacting with new, intelligent and different people.  I would be lying if I said nobody drops out though.  Some people can’t take it or leave for various reasons.  There’s that cliche orientation bit about one of the two people sitting next to you, etc.  This new chapter in life will demand a higher level from you, and I hope you seize it and grow.", "author": "EmptyLevel", "created": 1601451221, "upvotes": 1}, "g75bcet": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g75bcet/", "text": "Let me tell you that I was in your boat too. I'm majoring in sciences as well, and my first semester was a reality check for me as well\n\nTry investing in some blue light glasses to protect your eyes, for starters. Also, just be sure to use your time wisely when studying. And don't be afraid to speak up if you don't understand. Asking your friend or emailing your professor won't hurt you. \n\nAnd don't pull all nighters, as people have said before. Your brain needs sleep to function properly. Pulling all nighters is just hindering what your best performance could be.", "author": "KatColorsTheStars", "created": 1601444852, "upvotes": 1}, "g75b53q": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g75b53q/", "text": "i… felt this. i wish i had advice to give but i’m in the exact same spot. hope it’s at least a little bit of comfort to know you’re not alone :)", "author": "amcmbl", "created": 1601444679, "upvotes": 1}, "g757klp": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g757klp/", "text": "1. Buy blue light glasses! That can help with the eye strain and fixing even that little issue can go a long way.\n2. Understand that this semester is hard and weird for everyone. You probably will have to study more and it will be harder than you’re used to. But your family is there to lean on! Use them for encouragement, social support, and even studying help if they’re willing.\n3. Make sure to set aside time for breaks. Going for a walk, watching an episode of a show, listening to a podcast, whatever. Rest helps you refocus and be more productive in the long run .\nGood luck! You got this.", "author": "stever29", "created": 1601441778, "upvotes": 1}, "g757bvp": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g757bvp/", "text": "Online or not, this is a common problem, so know you're not alone. I, myself, was suffocating in college before we went online, because it was just too much.  I can't promise that this feeling will go away when classes go back in person, or with just a few changes to your habits, but I do have a few tips:\n\n1. Don't study so hard. You don't have to memorize everything, you don't have to read everything, you don't have to write down everything. To be honest, I only take notes in class, if that, and I don't take notes on the reading unless a test is coming up. To be honest, I don't even do the reading all the time. I have all A's, I do well, I remember plenty. I'm not saying to do exactly what I do, because you should adjust your method depending on the class, but this is what generally works for me, personally. Find what works for you, something that doesn't demand all nighters.\n\n2. If you have a lot of homework, start working the night that it is assigned. You don't have to finish it all at once, it doesn't even have to be perfect right away, but do something to get the ball rolling. It helps A LOT.\n\n3. Get some sleep. Drink water. It will change your life.", "author": "yellowdaisycoffee", "created": 1601441595, "upvotes": 1}, "g754h5c": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g754h5c/", "text": "For starters, I would strongly recommend getting blue light glasses since it is affecting your eyes so much. For the rest of it, I would recommend learning to pick your battles. The textbook can be helpful, but depending on the class, you don't need to use it as much as you might think. I've had science classes where the textbook is followed, but the most important things are the lectures and the work that the professor assigns. That will show you what you need to know and how to do the work. Just do what you reasonably can, and work from there.\n\nAnother thing is to make sure you take some time to yourself. Get your assignments done, sure, but you will only continue to do worse if your health, including mental, falls apart. Play some video games, read some books, spend some time outdoors, socialize. Whatever you need and want to do. Life isn't meant to only be about work and school. If you need to or are able to, maybe take less credit hours next semester. Good luck, you'll do great!", "author": "Ririann14", "created": 1601439546, "upvotes": 1}, "g7520fm": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g7520fm/", "text": "I most certainly agree with every other post. Try you best to make sure you are reading things over and taking notes. Ask your professor questions even if it annoys him/her. Reach out to tutoring services. Definitely do anything u can to pass because it sucks to have to take the class over again. You got this. Good luck", "author": "sugarbbymadi", "created": 1601437928, "upvotes": 1}, "g751fas": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g751fas/", "text": "The most important thing is your mental health not your GPA or anything else even though it may seem really important now. I had a couple not so great semesters when i was struggling w my mental health and it’s just about getting though it, not being perfect. This is just the first semester and it’s the middle of a pandemic, I promise people will cut you slack. Here’s a couple things just in case it hasn’t already been said: \n\nTech out to your professors/ TAs and tell them you’re feeling overwhelmed/ struggling- they’re here to help. They might be willing to be more flexible with dates or be able to offer you 1 on 1 help- remember this is their job and you’re not being a burden or silly or anything like that. \n\nDo any of the departments have tutors you could go to? Or general tutors for the university? Even if you just show up and say I don’t even know where to start nothing makes sense they might be able to help you figure out more effective studying strategies.\n\nSet an alarm every day to leave the house even if that means just sitting outside and feeling the sun shine or take a short walk if you feel up to it. \n\nAnd if comes to it getting a W is always better than an F and it’s certainly not the end of the world even if it feels like it.\n\nDepression is incredibly hard and being in college is hard and living in a pandemic is hard but I promise it doesn’t have to be this hard, please please fight the urge to spiral even worse. It’s about the little victories", "author": "geograthey", "created": 1601437563, "upvotes": 1}, "g74zy67": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74zy67/", "text": "Junior in college here, I would give you some “life tips” but it seems that this post has already received those in high quantity. So, here’s some practical advice. BUY BLUE LIGHT FILTERING GLASSES. Trust me, they’re well worth it. You can get them on Amazon for like $10 and they greatly reduce eye strain while staring at a monitor all day long. Now that everything is online, it’s physically tolling to keep up with how much time we spend in front of our screens. In addition to that, I like to play video games in my free time and it really sucks when you spend all day draining your eyes on your computer for class and have no eye stamina left for things you enjoy.", "author": "BillowyWave5228", "created": 1601436666, "upvotes": 1}, "g74wsez": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74wsez/", "text": "If you give it all you got, and you still fail, you won’t regret it. Why is that? Because you know you have it all you got, there was nothing left on the table. It happened to me in my freshman year, and I failed a class. Thankfully, I was able to rebound and pass it the next time, but still.", "author": "Jcampbell000", "created": 1601434847, "upvotes": 1}, "g74v033": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74v033/", "text": "One word. Cheat", "author": "Komorebi43", "created": 1601433882, "upvotes": 0}, "g74glvw": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74glvw/", "text": "Get printed books and drop one or two courses.", "author": null, "created": 1601426094, "upvotes": 2}, "g74ec30": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74ec30/", "text": "exercise--go for a run, lift weights. eat healthy. do all these things and your mental state will improve rapidly. i can tell you that for a fact, because it worked for me. brought me back from a very dark place. remember, determination and hard work, always. you can do this, brother.", "author": "trisdank", "created": 1601424762, "upvotes": 1}, "g74dnfo": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74dnfo/", "text": "I had major problems with depression during college. And the biggest thing I'd recommend above anything else, is seek treatment for your depression. Once you treat that, its so much easier to create and maintain a healthy routine and manage classes.\n\nI'm not sure how colleges are handling this during covid, but I'd say reach out to your University's Counseling Center. Universities usually offer free access to mental health services to their students, so I would try to utilize that! Good luck! :)", "author": "amburney", "created": 1601424356, "upvotes": 1}, "g74curv": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74curv/", "text": "I hope you figure it out this semester, but I don't have much advice on that. What I will say though, is not to give up on college if this semester doesn't work out. At least for me, trying to study alone at home is waay harder than it was on campus where I could build relationships with classmates and professors. \n\nI guess my best advice for the short term would to talk withn(email, zoom, whatever) your professors, let them know you're struggling (basically describe it how you did here) but want to do better, and see if they can help at all. If that doesn't work, get in touch with your dean and tell them your depression is out of control, and see if you can withdraw or get an incomplete rather than failing classes. Also, are you getting any kind of mental health treatment? Some schools are offering remote counselling.", "author": "SkiMonkey98", "created": 1601423886, "upvotes": 1}, "g74abbp": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g74abbp/", "text": "It was very hard for me to adapt as well, but it was under different circumstances (no rona virus), I know that online classes suck so much but I hope you figure it out with the help of someone.\n\nHope you get better OP.", "author": "Luizg825", "created": 1601422410, "upvotes": 1}, "g748m17": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g748m17/", "text": "Dude, I feel the exact same way. Only I’m actually at my college and I still don’t have friends :(. I’m also a freshman and feel so overwhelmed like I’ll never get the work done. \n\nMaybe buy some blue light glasses for your eyes? That’s what I did. Something that also helps me get my work done is literally writing out a schedule for my day hour by hour. At first I didn’t want to do it because I’m not someone who plans, but it’s really helped on the days I have multiple assignments due. \n\nOther than that, I don’t know what to tell you other than you’re not alone, which sucks because people tell me that and I’m like how is that supposed to help me feel better? Sending you a virtual hug though. I hope you’re able to find the motivation to become organized and things get easier for you!", "author": "labbaloo", "created": 1601421425, "upvotes": 1}, "g746nkf": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g746nkf/", "text": "Bro I feel you, Im going through something similar and it’s tough. I’m planning on taking less credits  as well as accepting the fact that there are L’s in life that you just gotta take and roll with. Hope it gets better for you man.", "author": "DoodyCalls2", "created": 1601420318, "upvotes": 1}, "g742n5i": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g742n5i/", "text": "I don’t know how it works for zoom but any good school will have resources for tutoring. \n\nDon’t be afraid to use it. \n\nThe best STEM students aren’t afraid to ask for help, and many end up becoming a tutor later on.", "author": "il_vincitore", "created": 1601418085, "upvotes": 1}, "g73umjp": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73umjp/", "text": "Hey bro, identity theft isn’t a joke lol \n\nI understand exactly where you’re coming from. I underestimated the workload I’d have and I’ve already pulled my few first all nighters. It really sucks", "author": "DandonLand", "created": 1601413911, "upvotes": 1}, "g73ue1o": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73ue1o/", "text": "College professor here - these are what I suggest to my students when they are facing this as well:\n\n* Go to office hours, if they are held (I hold mine online) and ask any questions you have about the material (make a list of questions ahead of time). If there aren't office hours, make an appointment. \n* If you are falling behind, let the instructor know. I'm EXTREMELY liberal with my deadlines these days - lots of my students are in different time zones, or are essential workers, or are having to juggle all kinds of difficult life situations. I get that. \n* Take time away from your screen. Get outside. Walk. Run. Do something that gets your blood flowing and gets you out into nature. \n* Try to manage your time (I know - I'm shit at this myself, but I try every day to get it better). I like to use the [Pomodoro](https://francescocirillo.com/pages/pomodoro-technique) method, because you can control the length of your breaks, as well as the longer break, and it also helps you see where you are working well and where you are working less productively.\n* Treat your sleep schedule strictly - turn off all your screens an hour before bed, use the blue light blockers another commenter mentioned, and go to bed and get up at the same time every day. You can't function well if you're not sleeping well.\n* Eat healthy stuff (plants). You can't function well if your engine is running on shit, and in my experience, many college students' diets are less than optimal. \n* Look to see what your school offers in terms of assistance. One of the schools where I teach is offering students emergency loans for access to the internet, loaner laptops, etc. We are also offering (as we do in \"normal\" times) free counseling, free help with time management, etc. Don't forget about the tutoring stuff that's always available at schools, either. That's always great - and if your teacher knows you're getting help from the Writing Center, or the tutoring center or whatever your school calls it, then all the better (I get an email when a student goes to the Writing Center at all my schools, so it's most likely that your teacher knows already, but it's always good to make sure). \n* Finally, you might feel like you have everything riding on this class, or this semester, or this degree. You don't. You can gain a lot through failure as well as through a good grade, and failure isn't the end of the world. I know how that sounds, but it's true - failure can offer us some excellent opportunities we might not ordinarily get.\n\nGood luck - lots of people are dealing with this sort of thing right now, so you aren't alone.", "author": "Readthesyllabus3", "created": 1601413792, "upvotes": 1}, "g73tpfr": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73tpfr/", "text": "Your not alone man. I been going through the same thing. It gets better, keep pushing my g.", "author": "FinisherReZ", "created": 1601413459, "upvotes": 1}, "g73qspn": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73qspn/", "text": "It gets better with time. It’s a big adjustment, everything becomes better with time", "author": "tulip-8", "created": 1601412234, "upvotes": 1}, "g73lonu": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73lonu/", "text": "I'm no doctor (I just read books and watch videos - take my advice lightly and go to a doctor or therapist if you have serious concerns), but how's your diet and how are you taking care of yourself physically? The mind and body are pretty connected and when one is deteriorating or struggling the other will suffer as well.\n\nVitamin D deficiency could be playing a role in how you're feeling - sometimes it can cause mood changes along with other symptoms (sleepiness and muscle weakness for example, plenty more). Normally you can get enough vitamin D for the day by spending 15 minutes in direct sunlight without sunscreen (if you burn easily, more depending on your skin type).\n\nThere are also studies that suggest gut health plays a small role in overall mood - are you eating vegetables or getting any fiber? An easy way to get some fiber is to buy some ground flax seeds from any grocery store and eat it with your cereal/oatmeal (I put like 2 tablespoons in each serving - you probably won't notice the taste). Berries are also VERY GOOD for your gut - blackberries, blueberries, raspberries.\n\nCruciferous vegetables are also amazing for your health- broccoli, cauliflower, kale. You can buy frozen packets of them frozen for fairly low prices - and all you do is pop them in the microwave for like 5 minutes and they're good to go. (*Also, I sauté my kale on the stovetop with some olive oil for a couple of mintues until they turn dark green- another easy small meal*)\n\nJust moving around in general helps your intestines move the shit inside easier - try to walk around for 0.5-1.5 hours a day if possible.\n\nAlso, sleep 7-8 hours a day PLEASE - that should be your priority above everything else besides getting your vitamin D levels up. Lack of sleep causes tons of weird physical symptoms that can freak people out.\n\nListen to what others are saying as well - maybe you should consider visiting a therapist or a coach - some things happen when we're younger that affect the way we act now, and having someone help you identify those events or behaviors and you learning how to recognize why those thoughts occur is a great first step to take in helping yourself out :)\n\nHope this helps. Godspeed friend o7", "author": "deaadondo", "created": 1601409974, "upvotes": 1}, "g73kh8n": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73kh8n/", "text": "I dont know if its possible but if you feel like its bad for you to look at the screen for so long then maybe you should print it out or write it down (im still in high school but when i struggle with something i write it down again and it helps memorize it sometimes). \n\nWhen i feel overwhelmed (i have a bad habbit of procrastinating until i have too much stuff on my hands) i usually take a break from everything. You cant be efficient if you arent well rested and relaxed. \n\nIf you think your depression is worsening then seek professional help.\n\n Well we have a groupchat on messenger for the class so its easy to ask for help, but maybe contacting others and setting up online study sessions with them would be a good idea to both socialize and get help with what you're stuck with. Sometimes you have to take the initiative even tho it feels awkward and hard. I know it isnt easy (i myself struggle with this last part) but you asked for advice and this is the best i can think of.\n\n The best of luck to you in your studies and always remember to keep your mental health a top priority.", "author": "Mr_Whitte", "created": 1601409428, "upvotes": 1}, "g73kbo3": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73kbo3/", "text": "Try to have fun & set aside a time on weekends for homework and studying", "author": "brookebeck", "created": 1601409365, "upvotes": 1}, "g73hvm1": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73hvm1/", "text": "This is probably as much of a covid thing as it is a starting college thing. There’s a reason why freshman have orientations, dorms, and special social events. It sucks because not only is that part gone, but there’s the impending doom of what’s going on right now. \nStarting college is a learning curve for everyone, and especially someone like you that never needed study skills before. \nAs far as college goes, my advice is study smarter not harder. Studying more and ineffectively erodes your grades and free time. Shoot an email out to your professors to briefly explain your situation and ask them for class specific tips. They will likely help. Find study techniques that work. I recommend Thomas Frank on youtube, or /studyskills . There are also some study discords I use to stay focused and I find it’s really motivating. \nSecondly, you need to have balance. I know it seems counterintuitive right now, but it’s important now more than ever to try to stay connected socially and go outside. Try and find some novelty while being safe. There’s a pandemic but that doesn’t mean life doesn’t go on, and you need fun activities to make sure your brain is happy so you can perform. \nGood luck, and hang in there. You’re not a lost cause, just some bad luck you’ll have to fight to get to the other side.", "author": "okgrace", "created": 1601408350, "upvotes": 1}, "g73f6cq": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73f6cq/", "text": "I cannot stress this enough, TAKE CARE OF YOURSELF!!! \n\nThis was me my first two years of college, I could’ve written this post.  My major was difficult like yours, I had some toxic friendships and difficulty finding new ones.   College was an adjustment, and I was overwhelmed with a deluge of never-ending homework. I was suicidal.  Two failed classes later I have had to learn that everything stems from how well I am taking care of my body and mind.  Please prioritize eating, sleeping- go to bed early (I used to proudly pull a couple all-nighters a week, my body literally broke down).... you will find your retention in classes and your mood are significantly improved.  Once you strengthen your body by taking care of it, working out id hugely helpful too- you can work off a lot of stress and it clears your mind to better focus. You HAVE to prioritize these things, otherwise you will find yourself drained.  \n\nNext, take advantage of resources around you- go talk to campus counseling, find STEM-major groups or reach out to classmates through forums or group projects about study tips or any questions about difficult concepts.  Your peers are in the same boat- everybody feels alone especially in this time.  You are capable, you are smart, and you will make it through this a stronger person. 💛 Feel free to dm me if you need someone to talk to.", "author": "linsellemy", "created": 1601407142, "upvotes": 1}, "g73dhlo": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73dhlo/", "text": "My sister, who graduated with honors, gave me some advice that I thought was bologna at the time, but have recently learned she was right. You cannot read everything that's required. You just can't. You won't sleep and you'll have mental breakdowns. Choose to read the required text for classes you know you'll struggle in, and be content with just taking notes for the others.\n\nI know that sounds like a fool's way out, but since taking her advice, I've been on the president's list twice now. I fought against the idea for a while because I'm a major perfectionist, but she was right.\n\nThe first semester of college is ALWAYS the hardest. You will learn how *you* learn, as well as how to manage time, what the professors will want you to learn, etc.\n\nMy mother is a Professor. If you're struggling, reach out to yours. Most will be happy to accommodate you, especially during this pandemic.", "author": "DaydreamerJane", "created": 1601406449, "upvotes": 22}, "g73bgbw": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73bgbw/", "text": "I went through a version of this myself. Didn’t have to work too hard in high school. Took dual credit classes that were high school class times counting as college credit. Went to college to study chemistry and failed the very first chemistry class. That’s when I realized that if you don’t have the knack for something you can’t study enough to make up for your lack of natural ability in it. My first couple semesters I had a D, and 2 Q drops, then I changed majors to English and after that I pulled my GPA up enough to graduate with over a 3.0 \n\nMight want to look at what you’re the best at and not just what you want to do. \n\nAlso after a tragedy in my family, I used the school counseling service that was free to me as a student so I highly recommend you check that out as well", "author": "uglybutterfly025", "created": 1601405471, "upvotes": 1}, "g73am0s": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73am0s/", "text": "I’m in the same hole, except I live on campus which is now a ghost town. Please no more all nighters. I give myself at least 6 hours of sleep if I need extra time to study.\nI also go out for a walk, take time to play games, etc to unwind. \nFor the socialization aspect I have joined online study groups. I also socialize with gaming and voice chats on discord. Sometimes we just need someone to talk to. \nYou also might need to learn effective studying techniques.\nI literally only read half of what I am given more poly science and government classes because half of it is just explanatory matter.  That’s because it’s just fluff, apparently all the thesis and theories have fluff in their introductory matter, lol. \nAlso, the only thing you probably need to do in some classes is brute force study definitions. I have gotten A’s in some classes just studying definitions, reading only the intro chapters to understand the basic concepts and extrapolating data from there. Please also look into online tutoring. Many colleges offer free tutoring to their students.", "author": "brokebacknomountain", "created": 1601405064, "upvotes": 1}, "g739kis": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g739kis/", "text": "When I started university it was hard for me too.\n\nI was a dual enrollment and AP student. (12 of them exams most of which I passed) I was in a lot of classes in my senior year and was attending my high school and my DE college full time. (Go to school, come home, eat, go to college, etc.) I was working with three clients so anytime I had free time I was working or volunteering or doing religious work. (i'm a Christian)\n\nI didn't get a break from high school. I literally graduated and started class at the DE college to make up two classes I failed as a DE student the next day. I was also still working three jobs to help pay for college. \n\nThen halfway through that, I started university classes and orientation in a special study abroad program. I finished out my CC classes, did the study abroad portion of the program and then the next day started a new program where I did research and science programs (kind of like a STEM orientation week) and then I started fall classes. \n\nWhen I started U classes I lost the ability to go to sleep and lost consciousness twice over the summer as a result. Apparently, I was experiencing a mental breakdown but I didn't realize it because I had been told all my life that people who asked for extra time on papers or for help were lazy or \"typical gen zer's.\"\n\n&#x200B;\n\nI didn't have any friends as they all went to another state school and everyone who had ever bullied me came to mine. So I would just be walking through the science hall and then I'd see the woman who shoved my head into a toilet just sitting there chilling on her phone or", "author": "BecuzMDsaid", "created": 1601404553, "upvotes": 2}, "g73859o": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73859o/", "text": "Electrical Engineering Major here: \n\nSet up a schedule and delegate study and relaxation time, all separate from each other. \n\nMake sure you’re getting physical activity (gym, running, etc) because you need to get rid of the stress hormones. \n\nAlso, if you’re having breakdowns, I’d recommend seeing a therapist. I’m seeing one right now and it helps a ton! \n\nGood luck!", "author": "WidjarjarBinks", "created": 1601403864, "upvotes": 6}, "g7379au": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g7379au/", "text": "You need to talk to someone. College can be a huge adjustment, and it's especially difficult right now since social activities are limited. All-nighters are never a good idea. You really shouldn't pull more than one or two all-nighters in a semester, and definitely not multiple in a row. It'll stress you out and make it much harder to function.\n\nEmail your school's counseling service and see if you can schedule a session. You're paying tons of money (if in the US) and might as well take full advantage of that.\n\nYou're right that you need to find a way to have some balance. Studying 24/7 really won't help. You need to find different ways to study. I also think you should join some clubs. Lots of clubs are meeting online, and it's never too late to join! Join clubs that interest you and join some related to the classes you're taking, as they might be able to help. Personally, studying for 12 hours straight isn't as good as studying for 4 hours, then taking a break, then another 4 hours. You can only retain so much information at a time.\n\nAnd cut yourself some slack :)", "author": "Pangolin007", "created": 1601403448, "upvotes": 2}, "g736thr": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g736thr/", "text": "If you are feeling like your mental health is being affected by your classes, you should treat it as any other illness. If it becomes too severe you can send your professor an honest email explaining your situation briefly and if you are seeing a therapist of some sort they should also be able to write a letter on your behalf. Mental illness is exactly that- an illness, and it should be treated as such.", "author": "bad-and-bluecheese", "created": 1601403277, "upvotes": 3}, "g736jif": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g736jif/", "text": "Hey! I know exactly how you feel, my freshman year was very similar, and Im also a STEM major. \n\nFor Classes:\n- Do more practice problems than pure reading. \n\n- Set a specific time each day for studying, eating, taking a walk/going to gym, sleeping, and fun. \n\n- When readings textbooks, make sure to look at the chapter summaries both before and after you read the chapter itself. Even write them down and try to look for it as you go so your mind puts extra attention to it. \n\n- Quizlet and Chegg are your friends. \n\n- Dont forget that ACE offers free tutoring, and I believe they also offer online tutoring now. \n\n- I was a person who would start Group Chats in my classes so we could ask eachother for help, do study sessions, etc. I doubt your professors would be upset if you did the same \n\n- Make sure you have a planner so you can keep track of what assignments are due when and how far out tests are. If you need a super in-depth one get a passion planar, or download one sheet of it to test it out. \n\nFor your health/mind:\n- You need to set up a 6 hour minimum sleep schedule. If youre so stressed that you cant sleep, try Melatonin. All nighters, while tempting, just really mess up your mind and energy for several days after. \n\n- Pick a physical activity to do each day, even if only for an hour. Blood clots are rising exponentially in students who are not moving around enough with everything being online these days. Plus this will give you a little breathing time. Go to Landis and play with a dog, go on an early morning walk, have a dance party in your room. You get the idea. \n\n- I strongly suggest you add a hobby to your routine. It could be playing video games, it could be embroidery, reading a physical book, it could be songwriting. Something that either you already love or are curious about learning. I recommend doing these after your daily study session, treating it as a reward. It will encourage you mind to study again the next day, and itll give you a cooling off period before sleep. \n\n- I know you mentioned not having any new friends due to online classes. Two suggestions for you. \n\n1. Call up some of your high school buddies! I still talk to about 10 of my high school friends and Im about to graduate! Make an effort to keep them in your lives. \n\n2. You can try to find clubs to join. A lot of clubs are hosting activities online since so many students are still at home. Or you could try to search for non school related things like a sports club or whatevers in your area. \n\nSecret 3rd Option: You dont have to do this one all the time, but if theyre alive call your grandparents. Its a scary time for them, and since they prob cant get out much odds are theyre bored to tears and a simple call could mean a lot to them. Just a suggestion. \n\n- If the screens are hurting that bad, consider adjusting your screen to red light, getting blue-light glasses or making sure youre letting in enough natural light to fight it. \n\n- You can get a free therapist through the school. Each therapist is different, but my experience was really positive and they helped me find the courage to leave an abusive situation. I dont know everything thats going on in your life, but its always nice to have someone to talk to. \n\nI hope some of these help you! Good luck!", "author": "bigotterfan", "created": 1601403165, "upvotes": 10}, "g733fi6": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g733fi6/", "text": "I always recommend taking some gap time if things aren't working well. You can usually take at least 6 months off without repercussions. Get out, get a job, and live life for a little bit and find your motivation!", "author": "Boxinggandhi", "created": 1601401908, "upvotes": 2}, "g733ciq": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g733ciq/", "text": "My college had like an $8 fee with your tuition every year that pays for the counseling center lol. It’s pretty common to experience depression after a big change like going to college. Use that resource if it’s available.", "author": "samanas6608", "created": 1601401873, "upvotes": 3}, "g73378f": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g73378f/", "text": "Can you drop one class? It might make things more manageable.", "author": "SublimeUniverse", "created": 1601401811, "upvotes": 4}, "g732u6x": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g732u6x/", "text": "Spend some time outside, it helps.", "author": "whaddup_pimps", "created": 1601401643, "upvotes": 2}, "g7320e3": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g7320e3/", "text": "What classes in STEM particularly? \nFor biology: concept mapping is awesome, as well as doing practice problems. Sometimes asking yourself questions (ie: what process(es) is(are)the Golgi apparatus involved in? What is the significance of these processes?) it helps you think about what questions could look like as well as how to answer them. Also, go to office hours! Your profs and/or TAs want to help you! That’s what they are there for. Even if you need help figuring out how to study, that’s a good thing to ask for help with. \n\nFor chemistry: same as above, but do all the practice problems possible. Go over them till you get them right and can explain what you are doing wrong. Watch YouTube videos (I’m partial to the organic chemistry tutor- he has gen chem and physics videos as well. \n\nTry not to to focus too much on how overwhelmed you are and make sure you are blocking out some time during the day for a breather. Self-care is just as important, if not more than studying. \n\nCollege is a whole other beast then high school, but you’ll get the hang of it.", "author": "applepieanne", "created": 1601401248, "upvotes": 12}, "g730uqk": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g730uqk/", "text": "talk therapy has helped me. College still makes me depressed but therapy has helped\n\nedit: many college offer some free talk therapy so you could look into that", "author": "ThinkingSmash", "created": 1601400685, "upvotes": 23}, "g730n82": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g730n82/", "text": "Definitely adding to the ‘don’t do all nighters’ chorus. \n\nInstead focus on remembering the material that you studied during the day versus the material you haven’t gotten to. All nighters are generally a lose/lose situation because they make you vulnerable to making simple mistakes you otherwise wouldn’t have made if you were rested. Also sleep helps us with learning and memory, so depriving yourself is going to hurt you rather than help you. I’ve done all nighters myself, but try and limit when and how you’re doing them.\n\nHow are you studying the material? I’m not in the hard sciences, but effective study tips are sooooo important to learning and retaining the material. Depending on what you’re doing I could give some suggestions.\n\nDefinitely seconding the suggestion to diverting more of your energy over to the class you’re failing until you see a boost in that grade. \n\nI know things are looking bleak right now, but you can do it!", "author": "RollingScone93", "created": 1601400585, "upvotes": 64}, "g72zoym": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g72zoym/", "text": "My heart goes out to you. You may be taking too many classes at once. Putting together a routine that gives you time to complete homework and study as well as time for self care is important. Also, make sure you get enough sleep and incorporate healthy foods into your meals and snacks.  Next semester I would advise to tone down the workload and limit the amount of credits to give you time for rest and relaxation too. Getting burned out will effect your grades and mood quicker than anything.\n Good luck!", "author": "asilverwillow", "created": 1601400122, "upvotes": 30}, "g72opb3": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g72opb3/", "text": "I have group chats w/ my classes. It’s not much communication, but it helps us get to know one another and it also allows us to be easily available for Zoom/Skype group study sessions, etc.\n\nDon’t burn out. Make a schedule & stick to it, but schedule yourself some free time each day as well. Just remember: you’re working hard and you deserve to relax, even if it’s only for 15 minutes.", "author": "ChriSayre01", "created": 1601395808, "upvotes": 17}, "g72oi1h": {"link": "/r/college/comments/j21r2j/college_is_making_me_depressed_and_i_dont_know/g72oi1h/", "text": "[deleted]", "author": null, "created": 1601395725, "upvotes": 300}}}