{
  "sid": "qlxq3m",
  "link": "/r/college/comments/qlxq3m/over_the_traditional_experience_i_want_to_finish/",
  "title:": "Over the traditional experience, I want to finish college online.",
  "text": "I have been attempting to complete college in person (mostly), since I was 17 years old, Fall 2018. I'm now 20 years old, and still not making much progress towards my degree at all. I have A LOT of pressure from my family towards staying in school, and will basically be disowned if I don't. I know this because I have talked to them about the idea of not wanting to do school. I have never been met with such a lack of understanding and support in my entire life.\n\n My plan right now is to take a semester off (again) even though I basically took the entirety of 2020 off and lied, as well as dropping my classes Spring 2021 and lying about being in school again. I'm in the process of figuring out if I have ADHD, even though I most likely have a diagnosis that my family has lied to me about my entire life. I've also struggled with a lot of social anxiety, and have done much better with online settings for classes. I know many will argue that, \"If you can't do the work in person, why do it online?\" Overall, I've always enjoyed the setting of asynchronous online courses much more.\n\nWhat are some programs that don't seem to be targeted more towards adults finishing school? I feel like there has never been a push towards \"college-aged\" students doing online classes, other than when the pandemic started.",
  "author": "Patellas",
  "created": 1635955550,
  "updated": 1636137464,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hj69ejp": {
      "link": "/r/college/comments/qlxq3m/over_the_traditional_experience_i_want_to_finish/hj69ejp/",
      "text": "I would say it's best not to lie and be honest. Don't make that a habit. And yes, you can do school online, but that's only if you have the motivation. Having ADHD and doing online is not as simple as it sounds, I have it too. I would definitely recommend doing gen studies at your local community college at least part-time and working part-time so you can decide what's best for you.",
      "author": "Zealousideal_Ear_195",
      "created": 1635960532,
      "upvotes": 2,
      "replies": {}
    },
    "hj7dyfe": {
      "link": "/r/college/comments/qlxq3m/over_the_traditional_experience_i_want_to_finish/hj7dyfe/",
      "text": "I’ve been much more successful in online college than I was at in-person college. Arizona State University has some good online programs, that might be a place to start!",
      "author": "marythekat",
      "created": 1635976133,
      "upvotes": 1,
      "replies": {}
    },
    "hj7vrqh": {
      "link": "/r/college/comments/qlxq3m/over_the_traditional_experience_i_want_to_finish/hj7vrqh/",
      "text": "If you are looking for an online university check out Western Governors University. Really good online university and has regional accreditation so it's legit as well.",
      "author": "zobadobadop",
      "created": 1635983737,
      "upvotes": 1,
      "replies": {}
    }
  }
}