{"sid": "en82r8", "link": "/r/college/comments/en82r8/is_it_unethical_for_me_to_submit_a_paper_for_a/", "title:": "Is it unethical for me to submit a paper for a class which I already wrote, for the same class, in a previous semester where I withdrew?", "text": "A few semesters back was going through a really tough time and I ended up withdrawing from all of my classes. One was an elective for my major which is an online class. I'm now in my final semester and decided to retake the class to fulfill my last elective requirement. I didn't get very far but I have at least 1 paper from when I took it before, and am debating as to whether it's dishonest to submit the same paper again or just write a new one. Thoughts?", "author": "jaggary", "created": 1578753161, "retrieved": 1632947983, "over_18": false, "upvotes": 606, "upvote_ratio": 0.98, "comments": {"fdwkahl": {"link": "/r/college/comments/en82r8/is_it_unethical_for_me_to_submit_a_paper_for_a/fdwkahl/", "text": "Check with your professor but generally this is considered academic dishonesty, which is a no-go.", "author": "Laurasaur28", "created": 1578759584, "upvotes": 1}, "fdw3f11": {"link": "/r/college/comments/en82r8/is_it_unethical_for_me_to_submit_a_paper_for_a/fdw3f11/", "text": "As stupid as it sounds, self-plagiarism is a very real thing.  Ask your professor if they care before you do this, you don’t want to risk getting in trouble with your school in your last semester.", "author": "liz4234", "created": 1578754685, "upvotes": 677}, "fdw3bkk": {"link": "/r/college/comments/en82r8/is_it_unethical_for_me_to_submit_a_paper_for_a/fdw3bkk/", "text": "Yes because it is a form of academic dishonesty that can generally lead to more trouble than what it is worth. \n\nI would talk to the professor first and see if they approve.", "author": "marlissa_lavellan", "created": 1578754649, "upvotes": 167}, "fdw339n": {"link": "/r/college/comments/en82r8/is_it_unethical_for_me_to_submit_a_paper_for_a/fdw339n/", "text": "Yes, this is a form of academic dishonesty. Generally there is an exception made if you talk to the professor first, and they approve it.", "author": "biggreen10", "created": 1578754573, "upvotes": 363}}}