{"sid": "nsmixn", "link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/", "title:": "My senior capstone advisor wants me to consider further revising my work for publication.", "text": "In addition to giving me glowing feedback (saying it is one of the two best Capstones he has seen during a decade of teaching), he said I would be \"in great shape\" to refine it further to possibly submit to a journal, and that he is more than willing to help me achieve that.\n\nThis is crazy. I had always thought that professors were being overly lenient when grading my writing over the years, but I don't think this is something an instructor would have an incentive to lie about. I am unsure what benefits that would have for me in the immediate future, but the proposition by someone that I immensely respect both as a scholar and a person has me glowing right now. \n\nIt was a religious studies capstone on the American Catholic Church during the Regan Administration primarily.", "author": "pseudophocles", "created": 1622863388, "retrieved": 1632802756, "over_18": false, "upvotes": 610, "upvote_ratio": 0.98, "comments": {"h0p57uu": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0p57uu/", "text": "congratulations!!! this was low key a \"dream\" of mine when i did my capstone!!!", "author": "kickitlikeadidas", "created": 1622908712, "upvotes": 1}, "h0p1swt": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0p1swt/", "text": "This actually sounds like something I want to read! Good job that’s great!!", "author": "pink-biochemist", "created": 1622907129, "upvotes": 1}, "h0oyd4g": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0oyd4g/", "text": "Congrats - this is awesome!!! If you haven’t already, I’d suggest talking to both your advisor and someone in your campus’ undergraduate research and/or scholarly publishing offices - that might be in the library, or maybe in the administration offices.\n\nYour advisor can be a great help in finding a reputable journal to submit your thesis to and can help you understand that process. But if you can talk to someone from scholarly communications or your institution’s research/publishing office, they’ll be able to help you understand your rights as an author. They can also help you figure out how you want to make the article available for readers, and what rights you want to retain as the author.\n\nSome questions to ask, research, and think about - do you want your article locked behind a paywall in order to get it in a specific journal, or do you want to publish it as an open access article and make it free for anyone to read, but maybe not get the same citation metrics or the prestige of a specific journal title? Or is gold open access an option (where the article is paywalled for an embargo period and then free to read after that)? Do you want to have a copy archived in your institution’s repository, if it has one, and how do you do that - and what kind of copy does the journal you choose allow you to archive, pre- or post-edit? Will you still have the right to share copies or present on your thesis later if you want to, per your agreement with the journal you choose?\n\nI don’t mean this to be overwhelming - I just know that these are things we don’t always talk about with students like we should. Usually students are so excited to be published that they’ll just go with the process - but you’re as much of an author as anyone else, and you deserve to have a conversation about your rights as an author and how you want others to be able to access your work.\n\nCongrats again - this is an awesome thing and definitely something to be proud of!! Your advisor is gonna be talking about you and your work with their colleagues for a long time.", "author": "lifebrarian", "created": 1622905769, "upvotes": 3}, "h0oud7k": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0oud7k/", "text": "Dude that is incredible!! Congratulations!!", "author": "DumbHuman53", "created": 1622903786, "upvotes": 1}, "h0oexxl": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0oexxl/", "text": "That's great news. It's a good thing to have on your resume having something legit in the real world. \n\nPlus with the added benefits of someone paying you to use it or even hire you cause of it can be a nice bonus.", "author": "Rj_owns", "created": 1622894723, "upvotes": 4}, "h0odhdn": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0odhdn/", "text": "That is so incredibly awesome!! Congrats!", "author": "NewFreezer18", "created": 1622893668, "upvotes": 1}, "h0ob8vx": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0ob8vx/", "text": "I don’t even know you and I’m proud of you. This is a HUGE deal. Congratulations!!!", "author": "Laurasaur28", "created": 1622891976, "upvotes": 7}, "h0ob3rj": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0ob3rj/", "text": "Congrats!! Any super interesting tidbit you’d share from your research?", "author": "Sushi_Whore_", "created": 1622891865, "upvotes": 5}, "h0o0p0a": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0o0p0a/", "text": "Congrats! You definitely should pursue that. If nothing else, you'll be able to say that you're a published author for the rest of your life.", "author": "lacourseauxetoiles", "created": 1622882845, "upvotes": 11}, "h0np0qr": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0np0qr/", "text": "That sounds like a very interesting topic! Congrats on your accolades. Any interesting takeaways you'd wanna share from your research?", "author": null, "created": 1622872529, "upvotes": 19}, "h0nmd93": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0nmd93/", "text": "That's great news. As far as this, \n>I am unsure what benefits that would have for me in the immediate future\n\nIt'll probably be a solid amount of work for no pay, but could definitely help you with jobs or grad school admissions and IMO it might be worth doing just for the satisfaction of sharing your work with the world", "author": "SkiMonkey98", "created": 1622870503, "upvotes": 159}, "h0nh4v4": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0nh4v4/", "text": "HOLY SHIT that's incredible. You should be absolutely glowing with pride!!", "author": "ripprinceandrey", "created": 1622866908, "upvotes": 42}, "h0nfov3": {"link": "/r/college/comments/nsmixn/my_senior_capstone_advisor_wants_me_to_consider/h0nfov3/", "text": "Congrats! That’s great news and an ode to your hard work and talent!", "author": "sosubservient", "created": 1622865989, "upvotes": 116}}}