{
  "sid": "q92jvq",
  "link": "/r/college/comments/q92jvq/major_considerations/",
  "title:": "major considerations",
  "text": "I’m currently a freshman psychology major ans I went to school thinking that i wanted to pursue something in this field for sure. However, recently i’ve been having other considerations. The thing is, i’m thinking of majors in VERY different areas. Besides psych, i’m interested in nursing, civil engineering, and criminal justice. I know i’m only a freshman so i have some time to figure it out, but it feels like every day i spend not knowing what i want to do is a day wasted and it’s really stressful. if there’s been anyone in a situation like this, how did it turn out? what did you do to figure it out?",
  "author": "aubrii",
  "created": 1634349588,
  "updated": 1634423831,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgtbo9i": {
      "link": "/r/college/comments/q92jvq/major_considerations/hgtbo9i/",
      "text": "I went through something similar freshman year starting with a major in Kinesiology and then realizing it was not the path I was interested in and switched to Health Sciences- I figured it out by taking classes in both fields and realizing I liked health sci more! You likely will need a decent amount of general credits to graduate anyways so I suggest taking a couple classes that you think would be more interesting and then going from there. If you switch your major after just one year it really isn’t a big deal- most of my friends who’ve gone to college also switched after the first semester or two! Hope this helps :)",
      "author": "lyvnicole929",
      "created": 1634350109,
      "upvotes": 1,
      "replies": {
        "hgtcre3": {
          "link": "/r/college/comments/q92jvq/major_considerations/hgtcre3/",
          "text": "thanks!! i’ve been trying to figure out if i could take a civil engineering course but they aren’t open to students not enrolled in that college, so i think i’m going to try to see if i can sit in for one lecture to see how it is. i’m definitely not worried about staying in college an extra year if i need the time or the credits don’t overlap, but in a way i also feel like i’m wasting my life if i take a long time to figure it out. i’ve been doing a lot of research this week about different majors and career paths & this weekend i’ll keep doing it, so hopefully i’ll at least figure out what i like more soon. thank you!",
          "author": "aubrii",
          "created": 1634350709,
          "upvotes": 2,
          "replies": {
            "hgtd0q0": {
              "link": "/r/college/comments/q92jvq/major_considerations/hgtd0q0/",
              "text": "That’s good that you’re actively researching too, I’m sure you’ll feel sure of something soon! Good luck !",
              "author": "lyvnicole929",
              "created": 1634350848,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}