{
  "sid": "qcrbl0",
  "link": "/r/college/comments/qcrbl0/why_do_i_keep_getting_below_average_on_exams/",
  "title:": "Why do I keep getting below average on exams?",
  "text": " \n\nThis is a serious post, I legitimately can not understand why I keep getting below average on exams. I tracked my studying habits for my last exam and I used the tomato timer method so I was not burning out.  \nI legitimately practiced and sacrificed so much of my free time in prep just to get below the average. I have been desperately trying to understand what is going on that is causing this. I know that it's studying smarter not harder and all that, but I feel like I'm grasping the material then just freezing up on the exams. Meanwhile, my peers seem to not study as much but still do much better than me. I am not just sitting staring at a piece of paper, I'm practicing problems over and over, trying to understand the material, etc.\n\nCould someone offer some serious advice on how to change my trend of just scoring below average, I used to be a 4.0 student and now for every class, I'm just scraping by. \n\nI'm an accounting major for reference",
  "author": "xDaquarius137x",
  "created": 1634821388,
  "updated": 1636181864,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hhhmh2b": {
      "link": "/r/college/comments/qcrbl0/why_do_i_keep_getting_below_average_on_exams/hhhmh2b/",
      "text": "It sounds like its not your method of studying that is causing you to fail, but that you’re dealing with text anxiety. \n\nI don’t know enough about text anxiety to be able to offer any insight on how to get past it, but I did find an [article](https://www.mayoclinic.org/diseases-conditions/generalized-anxiety-disorder/expert-answers/test-anxiety/faq-20058195) by the Mayo Clinic that may be help.",
      "author": "kizeltine",
      "created": 1634823468,
      "upvotes": 1,
      "replies": {}
    },
    "hhi1pam": {
      "link": "/r/college/comments/qcrbl0/why_do_i_keep_getting_below_average_on_exams/hhi1pam/",
      "text": "College is about competing. At the end of the day some people just learn faster/more efficiently. Hard pill to swallow",
      "author": "DeepSpaceOG",
      "created": 1634830179,
      "upvotes": 1,
      "replies": {}
    },
    "hhikono": {
      "link": "/r/college/comments/qcrbl0/why_do_i_keep_getting_below_average_on_exams/hhikono/",
      "text": "\"I'm grasping the material then just freezing up on the exams\"\n\nTo counter this, study as close to wherever you take the test as much as you can. This is called using contextual clues. Math tests used to give me anxiety, so I did this after a friend recommended it, and it worked. I also paired my math studying time with the smell and taste of mint (sounds weird, I know, but it's psychologically valid). Whenever I studied math, I drank mint tea and used a pencil that smelled like mint that I got online. I also wore the same light jacket whenever I studied math. I went from being a C student in math to an A student.",
      "author": "zifmer",
      "created": 1634837781,
      "upvotes": 1,
      "replies": {}
    },
    "hhjd4ny": {
      "link": "/r/college/comments/qcrbl0/why_do_i_keep_getting_below_average_on_exams/hhjd4ny/",
      "text": "First and foremost, comparing yourself to peers is a slippery slope.  You don't know how much they've actually studied. \n\nCollege is a challenge. You've now figured out what is challenging to you. There's a few ways you can take it really. Some people give up and do something else. Some improve. \n\nI highly suggest looking into better study techniques. Ask your peers or even the professor. Maybe get a good idea on how they are making their exams so you can prepare accordingly. \n\nThe absolute baseline you should be doing is completing every assignment and example problem supplied to you. AT LEAST. If a professor is giving you practice problems, they are probably doing it because they will use something similar on the exam. Also, if they provide any sort of 'skeleton notes' or slides, those are more than likely where the exam questions come from. \n\nI've noticed for myself that not all courses require the same studying discipline. Some are memory based and some are about learning the process. Each requires it's own way of studying. I use flashcards for my materials course but there's no way in hell that'd work for statics. \n\nAs for freezing up on exams, I think it's important to develop a sound strategy for that as well. Being well prepared is a huge contributor to exam performance. If you get into the exam and feel your body freaking out, force yourself to take 10 very deep breaths very slowly before starting. It helps bring more oxygen into the brain and generally brings upon a certain amount of mindfulness. \n\nIf you aren't attending tutoring or office hours, now is the time. Consider it an important part of your education. I think the idea of office hours feel weird to most people. If you are struggling, you absolutely need to be using these resources. They exist for that reason completely, so it's important that you use them. You'll probably end up learning more than you thought by attending those. \n\nSometimes I'm convinced that the average of certain courses has to do with memory and retention. I'm fortunate enough to possess a brain that is apparently good at retaining information with little exposure. After enough people telling me that it's something I have, their stories became a little more interesting. Some people don't retain things quite as quickly and it requires other strategies to work with that. It's not your brains fault, it's your challenge. I have my own set of challenges I conquer to succeed. \n\nI think the most important thing is to take this in stride. See it as a challenge with a solution. Don't get beat down by it. Use it as an opportunity to show that you can do these things with a plan and determination. You'll be fine. You'll figure it out!",
      "author": "Awkward_Mail_2786",
      "created": 1634849262,
      "upvotes": 2,
      "replies": {}
    }
  }
}