{
  "sid": "q193p3",
  "link": "/r/college/comments/q193p3/making_friends_but_not_friends/",
  "title:": "Making friends but not *friends*",
  "text": "Is anybody else (especially frosh like me) meeting so many people and making friends, but nothing is getting any deeper than that? Back home, I had friends who I had bared my soul too and I just can't seem to find that kind of connection here. It feels like everybody else already has those kinds of groups that are so connected to each other already. \n\nI'm trying to join clubs and teams, but the school I go to has a notoriously difficult club scene and I'm just so lost, not to mention a little bit homesick too. But that's a whole other post.",
  "author": "CirqueDeSol",
  "created": 1633365315,
  "updated": 1634084146,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.86,
  "comments": {
    "hfd9t7b": {
      "link": "/r/college/comments/q193p3/making_friends_but_not_friends/hfd9t7b/",
      "text": "You’re about a month into school, so it’s not surprising you haven’t quite found your people yet. Just keep going to social events and doing what you like and you will find others who like doing the same things. I’m not sure what your school offers, but mine has an outdoor adventure club that a lot of people make friends in while on hikes or skiing.",
      "author": "Gullibella",
      "created": 1633365516,
      "upvotes": 10,
      "replies": {}
    },
    "hfg9dmd": {
      "link": "/r/college/comments/q193p3/making_friends_but_not_friends/hfg9dmd/",
      "text": "I hear you man… thing is, I would rather be patient waiting for authentic friends with real connection than form friendships founded on hot air through clubs or parties or things like that. \n\nMost people when observing my friend group back home and myself couldn’t tell you for the life of them how we ended up connecting. We all have such different personalities but our connection is natural and the friendships fulfilling. At this point, my plan is just to be patient and see where things take me.",
      "author": "DueYogurt9",
      "created": 1633415339,
      "upvotes": 2,
      "replies": {}
    }
  }
}