{
  "sid": "qc3m5a",
  "link": "/r/college/comments/qc3m5a/psychology_format_is_terrible_for_me/",
  "title:": "Psychology format is terrible for me",
  "text": "In my psych 101 class 80% of our grade is simply based on 3 exams!!! What?! I just got my first exam score back and I got a 70%, I’m freaking out a little bit. Ive never been a good test taker even if I do understand the material (I studied and understood the material). Im just not good at taking exams. Classes like these are what’s going to kill my gpa. How can I overcome this? (I would like to get at least a B in the course)",
  "author": "BigKitchen1056",
  "created": 1634744114,
  "updated": 1636184353,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhds6zm": {
      "link": "/r/college/comments/qc3m5a/psychology_format_is_terrible_for_me/hhds6zm/",
      "text": "The only thing you can do is develop better study/test-taking habits. This isn’t high school where, as long as you do your homework, you can get an A or B. Most of my classes are at least 90% exams. If you have serious test anxiety, I would consider seeing a therapist.",
      "author": "DcCash8",
      "created": 1634749248,
      "upvotes": 1,
      "replies": {}
    },
    "hhdfdu7": {
      "link": "/r/college/comments/qc3m5a/psychology_format_is_terrible_for_me/hhdfdu7/",
      "text": "As some background info I want to go into a masters program that requires a 3.0 undergrad gpa. That’s why I’m freaking out about classes like these being detrimental to that",
      "author": "BigKitchen1056",
      "created": 1634744180,
      "upvotes": 1,
      "replies": {}
    },
    "hhecsl1": {
      "link": "/r/college/comments/qc3m5a/psychology_format_is_terrible_for_me/hhecsl1/",
      "text": "I find it to be so boring! This class is random, all over the place with their little personal stories every class, this week we spent 20 minutes talking about a lady's knee surgery and drugs, WTF does that have to do with psychology in our textbooks.",
      "author": "TragicalKingdom",
      "created": 1634757474,
      "upvotes": 1,
      "replies": {}
    }
  }
}