{"sid": "a2jpv5", "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/", "title:": "Just a reminder. Even though you are taking your finals, don't forget to evaluate your professors as well.", "text": "Title says the point.\n\nSemester is ending and you're about to move on and forget your current professors.  Somebody else still needs to take the course you you just finished.  Pass on what you learned.  \n\nUse your school's feedback surveys (most schools push them or even require them). Use RateMyProfessor.  Just share your experience.  Did the professor torture you by treating their 3 credit humanities course like it was a 6 credit monster worth 30 hours per week?  Was you Bio professor awesome and deserves recognition?  \n\n\nThis matters.  When I go to register for classes, I check my professors ratings.  If there are 3 or less ratings, then it's useless to me.  I would rather take a 3.9 professor with 40 reviews than a 5.0 with 1 review.  You should all be checking these and leaving feedback afterwards. If you aren't reading any sort of reviews prior to registering, it's kinda your own fault when you are stuck with the most difficult professor on campus. \n\nThere.  Said my peace.  Do whatever you want.  We're all adults. Most of us at least.  ", "author": "Inactive_Account", "created": 1543800920, "retrieved": 1632802104, "over_18": false, "upvotes": 1128, "upvote_ratio": 0.96, "comments": {"eb44gw7": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb44gw7/", "text": "Evaluations literally mean nothing. Nobody is gonna give a fuck about what some 20 something year old salty ass student is gonna say about a prof, when they probably saying some bad shit because they failed? ", "author": "your_simpleton", "created": 1543979158, "upvotes": 0}, "eb1eg68": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb1eg68/", "text": "My school actually sends us all evaluation docs for all of our instructors and hounds us until we complete them. ", "author": "rlev", "created": 1543884785, "upvotes": 1}, "eb16yki": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb16yki/", "text": "Yes, check ratemyprofessor. I did not use the site signing up for my first semester and I regret it. Now that I’ve had an opportunity to use it while registering for my second semester, I figured I would check what my first semester profs got.  And now I realize why that physics course was so damn hard. 30% would take again, 1.9 quality, and 4.3 difficulty. Now I’m praying I’ll pass the class", "author": "Evil_MrMuffinz", "created": 1543878234, "upvotes": 1}, "eb10wzw": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb10wzw/", "text": "You’re right. Thank you for this", "author": "Eteacles", "created": 1543873638, "upvotes": 1}, "eb0pvl5": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0pvl5/", "text": "At my school, the school's feedback surveys aren't required but they affect whether or not that professor gets tenure. So I do them honestly.", "author": "DamascusSteel97", "created": 1543866028, "upvotes": 1}, "eb0igsn": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0igsn/", "text": "My reviews are based upon the personal experiences I have had with the professor. If you have caused me a significant amount of unfair stress that was due to you as a professor and not something self-inflicted, I'm review bombing the heck out of you and going into explicit detail with the problems that I had. If you are a terrible teacher, I will say it and rate you accordingly, regardless of I got a great grade and had a cakewalk passing.", "author": "ThatNerdyRedneck", "created": 1543860911, "upvotes": 2}, "eb001lk": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb001lk/", "text": "As an entitled jerk my evaluations are strictly based on my grade. If I ace the class my evaluation will be “strongly agree” is I get a “c” my review will be harsh but detailed. ", "author": "Carl2011", "created": 1543846491, "upvotes": -1}, "eazyujh": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazyujh/", "text": "At my collage you had to give your name and student id to leave any feedback, and one teacher told us they can read the feedback and see the persons name, so nobody would say anything negative for fear of being marked harder\n\nWe also could not pick with the prof we wanted", "author": null, "created": 1543845225, "upvotes": 2}, "eazya8s": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazya8s/", "text": "Nice try, Professor....", "author": "Lg71199", "created": 1543844605, "upvotes": 3}, "eazxaru": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazxaru/", "text": "My professor is dropping a homework and rounding all our grades up if 50% of us did our evaluations so you best believe we were on that", "author": "destructor_rph", "created": 1543843473, "upvotes": 4}, "eazpjhr": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazpjhr/", "text": "While I admit I will continue using ratemyprofessor to check for ratings before enrolling in classes, I have to admit how inaccurate many of these ratings are.\n\nI’ve had to take two different classes from very lowly rated professors before and was pleasantly surprised at how lovely these two were as educators and people in general.\n\nMy advice is: don’t be so quick to judge a professor/class based on RmP ratings and instead, at least take the first week of class to get a feel for the class syllabus and professor before committing to take or drop the class.", "author": "skinneykrn", "created": 1543830815, "upvotes": 6}, "eazg63q": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazg63q/", "text": "Sweet tip for using reviews to select a prof: \n\nread the reviews, don't look at the numbers, they're often meaningless/arbitrary. \n\nYou can usually \"average\" people's input to formulate a reasonable impression of a professor. And, you can decide for yourself what is and isn't important that others took issue with. \n\n\nI.e. if everyone complains a professor assigns too much reading/doesn't teach, you can assume that it's a big workload but you have a high level of control over your own grade, because they're likely lazy and give you carbon-copy exams of formulaic questions that reading will have prepared you for. \n", "author": "Thoughtbuffet", "created": 1543815578, "upvotes": 4}, "eazfjkh": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazfjkh/", "text": "Can you ask me to do this in like 3 weeks? I’m busy with finals lol", "author": "mackys", "created": 1543814825, "upvotes": 5}, "eazfj8z": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazfj8z/", "text": "The main things I look for when I check RateMyProfessor is if they're passionate and show enthusiasm about the subject. Getting a teacher who is not interested in their subject is the worst.", "author": "NaiadoftheSea", "created": 1543814815, "upvotes": 5}, "eazb0q1": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazb0q1/", "text": "Totally agree, but as an aside I would encourage you to take Ratemyprofessor with a grain of salt. It may be useful in some cases, but they are now removing negative reviews. Either at the request of the bad professors or on their own. Idk. Either way, talk to upperclassmen and use other resources when you're planning your schedule. \n\nOne of the worst professors I've ever had, who previously had a score of like 1.5 and many, many negative reviews, now has a score of 5 because the only remaining review is the one positive one he received.", "author": "LordMudkip", "created": 1543810283, "upvotes": 15}, "eazal01": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazal01/", "text": "On ratemyprofessor good reviews= the class is an easy a and bad reviews = the class is not an easy a. You can have someone with good reviews but the teacher could not be that good but people overlook it because the class was an easy grade.", "author": null, "created": 1543809866, "upvotes": 24}, "eazaje9": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazaje9/", "text": "My professor was encouraging us all to do the evals, he was saying at our university they’re important and he’s seen professors denied tenure because of it. So yeah I’m gonna do them for sure!", "author": "erikaa21", "created": 1543809824, "upvotes": 27}, "eazaj3y": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazaj3y/", "text": "Useless at my school but I’m gonna do it anyway because I see it like voting. At least your voice is out there.plus it’s a good way to vent about what you would never say to your professors face (within reason of course). My professors go at 200 mph which makes it hard for me as a student to absorb all the learning so I’m definitely going to account for it in my survey", "author": "haichewjichoo", "created": 1543809817, "upvotes": 32}, "eaz8ucc": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz8ucc/", "text": "Ratemyprofessor is so sucky in so many strange ways. Unless the comments go into a lot of details, they seem to be worthless. \"I don't understand their accent!!!\" with a horrible rating for so many professors who I thought didn't even have an accent at all. And then there's the \"she's disorganized\" comments that seem to be on every female teacher I get. The worst one I saw was a paragraph of \"I was *enamored* with ____ I looked forward to her class and was early every day,\" and \"She's *charming, smart, beautiful* and the class made my heart race, etc \" like yikes, teacher, do the police know about this kid?\n\nMy mom teaches at my uni and for a while she was my ride so I had to sit in her class a lot. She was the only prof I've seen that was always early. Sure enough, two ratemyprofessor comments had something like \"SHE'S ALWAYS LATE!!!\" I have no idea what would make a student so mad think that lying is better than even being honest about what they thought was a problem\n\nThen there's evaluations. I always feel one way or the other of two extremities: either it doesn't mean shit or it will potentially ruin someone's career. Look, I did my fair share of joking around. On an old professor's eval I left a numbered list of suggestions to make the class completely focused on volcanoes as a joke(and yes, it was obviously a joke). Then I met my bf, who's with a phd and now is at that horrible period afterwards where no one's hiring you. I didn't know before I met him that for a lot of places evaluations aren't an optional way to show off. Even if I really dislike a teacher, I will now never use an eval to potentially harm their career. The fact that a person's career could be hurt because of input from someone no one but the teacher knows, all without the teacher's ability to provide their own argument, is bullshit. It's a failure of academia and another reason why it's just becoming a large joke.\n\nSo, teachers, either sell out or get out.", "author": "Komodo_Madre", "created": 1543808283, "upvotes": 19}, "eaz6rtj": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz6rtj/", "text": "But if they have really good reviews at least you know the lazy people are passing", "author": "Oof101Oof", "created": 1543806400, "upvotes": 79}, "eaz54hv": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz54hv/", "text": "I do my schools feedback survey. Usually they're biased but if they have enough complaints on the same teacher Dean's and other people will evaluate their classes more or even sit in to see how they teach. ", "author": "thinkB4WeSpeak", "created": 1543804994, "upvotes": 50}, "eaz2q13": {"link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz2q13/", "text": "There's a lot of research showing that these evaluations are completely useless and are not good predictors of how much students learn in class. Hate to say that  but students are exteremely biassed when evaluating their professors.", "author": "Miladmd", "created": 1543802953, "upvotes": 369}}}