{
  "sid": "a1i7vq",
  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/",
  "title:": "I’m about to answer every one of your questions",
  "text": "• Talk to your professor\n\n• Talk to your guidance counselor / academic advisor\n\n• Talk to your parents\n\n• Talk to a therapist\n\n• Talk to Google\n\n90% of the questions we get on this sub can be answered by following any of the points I just listed.\n\nObviously we are here to help, but we don’t know everything about your current situation. Most of us are college students just like you. But the people I just listed? It’s their job to help you.\n",
  "author": "Relevated",
  "created": 1543504846,
  "over_18": false,
  "upvotes": 1107,
  "upvote_ratio": 0.92,
  "comments": {
    "eaq737v": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq737v/",
      "text": "You can all help us improve the content of r/college by using the \"Report\" feature.  If you see a post or comment that seems to violate one of our sub rules (among them being \"ask your professor/read the paperwork/do your own research\"), please report it.  You have a team of moderators who look at every report made and will happily remove content that isn't helpful.  We cull as much as we can, but often times we just miss stuff.",
      "author": "ecklesweb",
      "created": 1543511817,
      "upvotes": 1
    },
    "eas7fhi": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eas7fhi/",
      "text": "Here’s a thought: if you don’t like what people post in a thread, leave the thread.\n\nYeah, some may post silly and ridiculous questions on here, but isn’t that the point of Reddit in general?\n\nMost, keyword “most,” advisors do not know shit, nor do they really care about every single student. Do you know how many students they are responsible for? It’s nearly impossible for them to effectively help every student, especially at schools with a huge student body. Not all professors are helpful either and they definitely do not have the time to guide every student who comes their way.\n\nIt’s hard to know everyone’s parent situation. “Talk to your parents” is not an option for everyone for numerous reasons.  Some parents simply don’t care/support their child when they go to college and other parents may know absolutely nothing about higher education whatsoever. \n\nCertainly, Google can provide answers to some questions, but not all of them. What’s wrong with seeking some input from actual college students who generally experience the same situations in one way or another? Just because someone asks for the advice of strangers, doesn’t mean that they’re going to do that 100%. Besides, what’s the difference between listening to an answer created on Google by whoever and someone who actually goes to or went to college?\n\nNot everyone can afford to see a therapist. Yes, some schools do provide students with someone to speak to along those lines, but it’s not easily accessible for everyone at every school. Some require separate payments. Some require a bunch of sessions. Just because someone had a bad day and posted about it on Reddit, doesn’t mean they need to see a therapist. \n\nEverything is different for everyone. Sometimes, we just like to have others to talk to who experienced or who are experiencing similar situations. ",
      "author": "eternal_blackness17",
      "created": 1543581541,
      "upvotes": 2,
      "replies": {}
    },
    "earm249": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earm249/",
      "text": "You forgot roommates and chegg",
      "author": "sm2016",
      "created": 1543552110,
      "upvotes": 2,
      "replies": {}
    },
    "earajp8": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earajp8/",
      "text": "\\>Talk to a therapist   \n\nLook at mr moneybags over here",
      "author": "destructor_rph",
      "created": 1543542304,
      "upvotes": -1,
      "replies": {}
    },
    "eara9m5": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eara9m5/",
      "text": "I would also like to add:\n\nLearn to write a resume.  Learn to write a resume to cater to xxx job requirments.\n\nDon't expect an internship to be handed to you.  Put yourself out there, temp agency, volunteer.  Something.  Even as a marketing major you can make up some flyers for a food bank with a map and hours.  Even if you have to work for peanuts at first.\n\nLEARN TO MANAGE YOUR MONEY.\n\nGO TO CLASS.\n\nIf you find your self in a major that is way over your head, back out.  \n\nIf this is your 5th, 6th, or even 7th attempt at (example) Calculus or upper division Physics....change majors.  Not every job at there requires Calculus.  Not everyone is good at that kind of math/science.  Not everyone is good at English, History, or theater.\n\nIf your parents demand you attend a certain school and/or earn a certain degree- pay for college yourself.  Get the degree you want, not what they want.\n\nMany, many jobs only require an Assoicates degree to be successful.  \n\nDon't let money or status dictate your major.  Yes, earning enough money to support yourself is great.  But if your in a major just because you might end up earning $110,000 a year and your failing half your classes and your miserable, it's not worth it.\n\nYes you will have to go into debt to afford college.  But be smart.  Virtually no degree is worth graduating $100K in the hole.\n\nPsychology majors and Liberal Arts Majors are still needed.  People do still hire them.\n\nDon't assume the minute you earn you undergrad means your done learning.  Never stop improving your skills.",
      "author": null,
      "created": 1543542049,
      "upvotes": 7,
      "replies": {}
    },
    "ear7pdk": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear7pdk/",
      "text": "If i stumbled across this sub, before i decided to go to college, i would've probably noped out. I mean everybody there hates you, professors make you fail classes, weirdos actually try to start conversations with you and much worse... Ugghh",
      "author": "baRRaccudax",
      "created": 1543539799,
      "upvotes": 2,
      "replies": {}
    },
    "ear6th9": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear6th9/",
      "text": "You forgot \"search the sub.\" \n\nMany questions can be answered by reading past relevant threads. ",
      "author": "Comrox",
      "created": 1543539007,
      "upvotes": 2,
      "replies": {}
    },
    "eaqwwlt": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqwwlt/",
      "text": "I’ve done all those things, but r/college is full of people going threw the exact thing I am. As crammed as my schedule is and fearful my classmates are to admit they are crushed.  This thread is a great reminder that I’m not alone in needing 7 sources of help. \n\nThat’s what r/college is for. ",
      "author": null,
      "created": 1543530588,
      "upvotes": 3,
      "replies": {}
    },
    "eaqsg70": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqsg70/",
      "text": "Also for the therapist one- most colleges have psychologists there to help you manage stress and anxiety because it’s so common for college students!! ",
      "author": "audphin",
      "created": 1543527139,
      "upvotes": 2,
      "replies": {
        "ear6oo6": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear6oo6/",
          "text": "Idk how it is at other schools, but at mine you can’t see someone regularly, you can only have a few sessions. So it’s basically for people who don’t really need therapy (to me therapy means working through things longish-term).",
          "author": "bonesnappletea",
          "created": 1543538886,
          "upvotes": 2,
          "replies": {
            "eatbowf": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eatbowf/",
              "text": "Same at my college—and as a bonus, it takes 4 - 6 weeks to even get an appointment. The exception would be if you’re an acute risk to yourself or someone else (suicidal or homicidal), in which case you are held in the wellness center until a counselor has 15 minutes to talk to you and evaluate the situation, then they send you to the ER anyway (which many of us can’t afford, and one more barrier to seeking help). The situation really sucks.",
              "author": "bibblia",
              "created": 1543613466,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "eaqsevt": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqsevt/",
      "text": "Well that can be attributed to most subreddits with the exception of the first two. You act like you just solved all problems in the world lol",
      "author": "Nullveer",
      "created": 1543527112,
      "upvotes": 3,
      "replies": {}
    },
    "eaqp536": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqp536/",
      "text": "Also, talk to your RA and/or the people above them.",
      "author": "Diddy_8D",
      "created": 1543524656,
      "upvotes": 1,
      "replies": {}
    },
    "eaqo279": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqo279/",
      "text": "Therapy is a waste of time and money.",
      "author": "send_me_them_tits_",
      "created": 1543523864,
      "upvotes": -4,
      "replies": {
        "eaqsvam": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqsvam/",
          "text": "HAHAHAHAHA, suuuure bud. ",
          "author": "jjstew22",
          "created": 1543527456,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eaqg2ie": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqg2ie/",
      "text": "Don't talk to your advisor (at least if you're undergrad), I've never had one that knew the first thing about what was best for me. Or even cared to know. Just look at your degree plan, and plot it out yourself.",
      "author": "redzilla500",
      "created": 1543518043,
      "upvotes": 1,
      "replies": {
        "earh2oq": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earh2oq/",
          "text": "[deleted]",
          "author": null,
          "created": 1543547951,
          "upvotes": 4,
          "replies": {
            "eatrr2s": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eatrr2s/",
              "text": "Same here.",
              "author": "Sentry459",
              "created": 1543627785,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "eaqba3p": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqba3p/",
      "text": "A lot of student handbooks are free online for everyone and have details specific to the school, especially regarding scholarships, degrees, disciplinary issues, and other  topics. ",
      "author": null,
      "created": 1543514695,
      "upvotes": 2,
      "replies": {}
    },
    "eaq8wze": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq8wze/",
      "text": "Also read the shit you're given to read.",
      "author": "SweetBabyBeelz",
      "created": 1543513103,
      "upvotes": 7,
      "replies": {}
    },
    "eaq7jja": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq7jja/",
      "text": "Eh. A lot of questions are hard to find on google, but also don't necessarily warrant a professor or advisors attention. That's the point of this sub. Obviously there are some that are just bad questions (what should I major in?), though.",
      "author": "MetallicGray",
      "created": 1543512136,
      "upvotes": 6,
      "replies": {}
    },
    "eaq778j": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq778j/",
      "text": "You forgot \"talk to your roommate\"",
      "author": "fffw001",
      "created": 1543511894,
      "upvotes": 10,
      "replies": {}
    },
    "eaq5g4v": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq5g4v/",
      "text": "But, what major should I pick? When should I change my major? What school is teh bestest?  How do I get a job during/after school?\n\nThese are the questions that I need strangers to answer for me.",
      "author": "Inactive_Account",
      "created": 1543510656,
      "upvotes": 58,
      "replies": {
        "eaq6iqe": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq6iqe/",
          "text": "Most common answers:\n\n1. Anything STEM\n\n2. Never, unless your major is not STEM, then immediately.\n\n3. [link to some “unbiased” ranking website] or “I had good luck at [their university].”\n\n4. Apply/Fairs/Apply at fairs/Some shit named “Handshake”\n\nMost common responses:\n\n1. “...but the liberal arts are my passion bro...”\n\n2. “...but I’m so close to graduation, and I just can’t handle school anymore [stomping].\n\n3. “...yeah but this other ‘unbiased’ site says this... and I can’t move that far... and my sister needs help...”\n\n4. “...yeah but social anxiety [stomping].\n",
          "author": "The_Nitram",
          "created": 1543511407,
          "upvotes": 50,
          "replies": {
            "eaq75w0": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq75w0/",
              "text": "When I answer #4, I usually give them resumes writing resources. That's helps 95% of the time. Or just accepting that you arent worth six figures the day you graduate. \n\nAnd the response to that is \"But my STEM degree!\"\n\n",
              "author": "Inactive_Account",
              "created": 1543511869,
              "upvotes": 23,
              "replies": {}
            },
            "eaq9rh9": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq9rh9/",
              "text": "I feel the STEM circlejerk is kinda bad on this sub to be honest. I wish more people here were open to people wanting to try a non-STEM major.\n\nYeah, it's important to be realistic with your goals and it is true that in general, STEM degrees are more marketable, I agree with that.\n\nBut anytime someone says they want to major in something non-STEM the comments are always people begging them not to. I know for me, I'd have a really hard time in a STEM major. It just doesn't stimulate me.",
              "author": "Ojo46",
              "created": 1543513664,
              "upvotes": 46,
              "replies": {
                "eaqiq85": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqiq85/",
                  "text": "Dunning-Kruger for days, IMO. It's amazing how confident people tend to be in dismissing entire fields of study when the only exposure they have to that field is a basic 101 survey course they had to take for a gen ed requirement.",
                  "author": null,
                  "created": 1543520017,
                  "upvotes": 18,
                  "replies": {}
                },
                "eaqkhf9": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqkhf9/",
                  "text": "I think it has to do with the demographic Reddit (most online communities actually) attracts generally. Most people on Reddit are edge lord nerds, edge lord nerds tend to like STEM majors so including the financial advantages of having a such a major; I can see why it’s hard for them to understand why someone would want a liberal arts degree. ",
                  "author": "thelmanator",
                  "created": 1543521301,
                  "upvotes": 14,
                  "replies": {
                    "ear8o8p": {
                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear8o8p/",
                      "text": "Some of us have go to a miserable, shit paying job because we made the mistake of seeing value in a liberal arts degree.\n\nSTEM skills will follow you for life. Liberal arts \"skills\" will follow you to the unemployment line.",
                      "author": "UnconstrainedRage",
                      "created": 1543540635,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                },
                "eaqarie": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqarie/",
                  "text": "The jerk is real. I’m all for non-STEM degrees. My advice, “understand that your non-STEM piece of paper is basically unemployable unless you supplement it with X,Y, and Z (depending on what their stated career goal is), and/or go get your graduate degree, but make sure that you supplement that with X,Y, and Z.”",
                  "author": "The_Nitram",
                  "created": 1543514336,
                  "upvotes": 16,
                  "replies": {
                    "ear18ms": {
                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear18ms/",
                      "text": "Many non-STEM Bachelor’s degrees are absolutely employable. Not all, but many.\n\nSame is true of STEM, for that matter. ",
                      "author": "kabea26",
                      "created": 1543534121,
                      "upvotes": 15,
                      "replies": {
                        "ear4wyk": {
                          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear4wyk/",
                          "text": "*cough* Economics *cough* ",
                          "author": "The_Nitram",
                          "created": 1543537303,
                          "upvotes": 2,
                          "replies": {
                            "ear8q4s": {
                              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear8q4s/",
                              "text": "If you go to a top school.\n\nOtherwise enjoy your shit job paying 30k like the rest of us\n",
                              "author": "UnconstrainedRage",
                              "created": 1543540683,
                              "upvotes": 2,
                              "replies": {
                                "earf860": {
                                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earf860/",
                                  "text": "Chase after the dream, don’t chase after the money. \n\nIf I like my job and it puts a roof over my head and food on the table, I don’t care whether I’m making $30k or $300k. I’d rather be poor doing something I care about than rich and miserable. ",
                                  "author": "kabea26",
                                  "created": 1543546345,
                                  "upvotes": 4,
                                  "replies": {
                                    "earfeha": {
                                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earfeha/",
                                      "text": "Your mind will change in 2 years.\n\nIf I offered you 300k to quit your job and suck my duck would you do it?\n\nBecause I would.",
                                      "author": "UnconstrainedRage",
                                      "created": 1543546495,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "earb51b": {
                                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earb51b/",
                                  "text": ">If you go to a top school.\n\nEh, having more free time to do cool shit has more to do with it really.",
                                  "author": null,
                                  "created": 1543542827,
                                  "upvotes": 1,
                                  "replies": {
                                    "earbare": {
                                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earbare/",
                                      "text": "What does free time have to do with employment?",
                                      "author": "UnconstrainedRage",
                                      "created": 1543542968,
                                      "upvotes": 1,
                                      "replies": {
                                        "earbrr2": {
                                          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earbrr2/",
                                          "text": "Because if you have scholarships, grants, etc. whatever you want to throw in (yes including parents who cover tuition/living costs) , you have all the time in the world to focus on college while developing your skillset (my interests are Labor and Urban Economics so it involves quite a bit of research, statistical programming, econometrics, and GIS). Having that free time to develop was the reason multiple recruiters from LinkedIn sent offers for positions like market research analysts, data analysts, econometrician, etc despite going to a cheap school. ",
                                          "author": null,
                                          "created": 1543543374,
                                          "upvotes": 1,
                                          "replies": {
                                            "earc5xv": {
                                              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earc5xv/",
                                              "text": "So if your rich already is what your saying.\n\nI had full ride and didn't get jack shit like that despite being published.",
                                              "author": "UnconstrainedRage",
                                              "created": 1543543721,
                                              "upvotes": 0,
                                              "replies": {
                                                "earcm98": {
                                                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earcm98/",
                                                  "text": "Yes and no. I live in Georgia (low cost of living) so things are pretty affordable getting more bang with your buck. On a related note if you don't mind me asking, what field did you do research in? You don't have to answer but I'm pretty curious.",
                                                  "author": null,
                                                  "created": 1543544110,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "earcs1v": {
                                                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earcs1v/",
                                                      "text": "I did research into demographics and ethnography and how they impact political allegiance.",
                                                      "author": "UnconstrainedRage",
                                                      "created": 1543544248,
                                                      "upvotes": 2,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                },
                                "eas3wh9": {
                                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eas3wh9/",
                                  "text": "*shrug* I went to a shit school, make around $50 in a low cost of living area, and I graduated in March. I work in accounting (took one accounting course for fun). ",
                                  "author": "The_Nitram",
                                  "created": 1543576189,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "eaqi462": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqi462/",
                  "text": ">I feel the STEM circlejerk is kinda bad on this sub to be honest. \n\nIt's bad nation-wide, and the media are among the worst offenders. They don't even bother to look at the data on outcomes, they just parrot talking points about jobs that are often erroneous, and even when they are right they assume the only thing that matters is direct ROI in terms of dollars of income vs dollars of tuition. It's an assinine way to evaluation educational options and a terrible disservice to students of all kinds.",
                  "author": "SnowblindAlbino",
                  "created": 1543519573,
                  "upvotes": 5,
                  "replies": {
                    "eaqk6is": {
                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqk6is/",
                      "text": "> they just parrot talking points about jobs that are often erroneous\n\nA lot of these career prep and college prep subreddits are a **serious** case of the blind leading the blind. \n\nSo many people are just echoing secondhand opinions that they read on another post or heard from another student, and confidently presenting those opinions as fact when they have no personal experience with the subject.\n\n\n\n\n",
                      "author": null,
                      "created": 1543521077,
                      "upvotes": 7,
                      "replies": {
                        "ear8uyf": {
                          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear8uyf/",
                          "text": "I have direct experience. Liberal arts degrees are hit garbage trash, everyone i know who has one is struggling to find gainful, all of them still live with their parents, none kf them have benefits.\n\nWhat actual, honest value do you really think there is in a liberal arts degree? What? What do you put on resume? Why would anyone pay you anything at all whatsoever?",
                          "author": "UnconstrainedRage",
                          "created": 1543540802,
                          "upvotes": -4,
                          "replies": {
                            "earbtvu": {
                              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earbtvu/",
                              "text": "I think we've had this conversation before.\n\nI'll say again: market value != inherent value. \n\nJust because something makes a lot of money for rich billionaires doesn't mean it is a moral or inherently good thing to do.\n\n\n",
                              "author": null,
                              "created": 1543543427,
                              "upvotes": 5,
                              "replies": {
                                "earc2p7": {
                                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earc2p7/",
                                  "text": "If you get cancer how are you going to pay for it? How you sre going to retire? How else you afford kids?\n\nYou don't have answers to these questions. Money matters more than anything in the world",
                                  "author": "UnconstrainedRage",
                                  "created": 1543543644,
                                  "upvotes": -2,
                                  "replies": {
                                    "earc6db": {
                                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earc6db/",
                                      "text": "I do think that money matters, but I don't see people as worthless gutter trash for making financially unwise decisions.",
                                      "author": null,
                                      "created": 1543543731,
                                      "upvotes": 4,
                                      "replies": {
                                        "earcgfz": {
                                          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earcgfz/",
                                          "text": "It doesn't matter how you see them. They will live the life of worthless gutter trash whether they deserve it or not. Just as slaves lived their horrid even though they didn't deserve it\n",
                                          "author": "UnconstrainedRage",
                                          "created": 1543543973,
                                          "upvotes": -7,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "eaq5x5o": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq5x5o/",
          "text": "talk to urself ",
          "author": "duckhunttoptier",
          "created": 1543510973,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "eaq4olu": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq4olu/",
      "text": "I think a lot of people tend to trust the advice from their peers more than from advisors or counselors, because advisors don't really have any incentive to be honest. They work for the university, so it makes sense for them to simply say whatever benefits the university, not the student.\n",
      "author": null,
      "created": 1543510110,
      "upvotes": 45,
      "replies": {
        "eaq5wf6": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq5wf6/",
          "text": "Fair point. I've had good and very horrible unqualified advisors.  The latter kinda ruined every bit of credibility in her department for me. Now I go to another campus when I need to speak to an advisor.",
          "author": "Inactive_Account",
          "created": 1543510957,
          "upvotes": 13,
          "replies": {}
        },
        "eaqiboq": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqiboq/",
          "text": "> people tend to trust the advice from their peers \n\nAdvice from other uninformed 18-20 years olds isn't always that helpful. I know lots of people who have received *terrible* advice from peers that created all sorts of problems.",
          "author": "SnowblindAlbino",
          "created": 1543519725,
          "upvotes": 8,
          "replies": {
            "eaqjfi8": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqjfi8/",
              "text": "It isn't, but you generally shouldn't rely on one source of information for major life decisions to begin with. \n\nAnd there are certain subjects that advisors just won't ever be honest about. You're never going to have an advisor tell you that their program doesn't have any research opportunities, or that their electives are poorly taught, but you might get that information from an alumni or current student of the program. \n",
              "author": null,
              "created": 1543520528,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "eaqgak3": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqgak3/",
          "text": "Came here to say this. Do not trust your advisor. Learn to do it for yourself",
          "author": "thesteichenator",
          "created": 1543518211,
          "upvotes": 1,
          "replies": {}
        },
        "earusfw": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earusfw/",
          "text": "Agreed, had three advisors at three different schools tell me the wrong classes to take that ended up harming me more than helping me in the end. If you’re required to talk to your advisor obviously there’s no way around it but don’t go in clueless, do your research before talking to them as well as do more research after talking to them. ",
          "author": "iodinevanadiumey",
          "created": 1543561432,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eaq3o55": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq3o55/",
      "text": "• Talk to your roommate. Just be a normal human being and communicate.",
      "author": "Vincent_Soprillo",
      "created": 1543509388,
      "upvotes": 185,
      "replies": {
        "eaq4cgg": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq4cgg/",
          "text": "I'd rather talk to Reddit, then Google, then leave threatening notes, then text them",
          "author": "DrJPepper",
          "created": 1543509867,
          "upvotes": 85,
          "replies": {
            "eaq5jfs": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq5jfs/",
              "text": "You forgot step 1. Stew on the existing problem for a 2 months, then go to reddit.",
              "author": "Inactive_Account",
              "created": 1543510718,
              "upvotes": 39,
              "replies": {
                "eaq7h0j": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq7h0j/",
                  "text": "\"Hey guys. This is my first semester and things were going pretty well with my roommate up until a few weeks ago. I have a 10 AM on MWF so I usually will get up around 8:30-9:00. My roommate has an 8 AM these days but he usually doesn't wake me up. After fall break though, he started to get up at 5 and practice banging cast iron pans together. Also, he punches me in the balls at exactly 5:32 AM every MWF. Should I just confront him about it? I don't want to be rude.\"",
                  "author": "Vincent_Soprillo",
                  "created": 1543512087,
                  "upvotes": 51,
                  "replies": {
                    "eaq7uh2": {
                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq7uh2/",
                      "text": "I know this is an exaggeration, but it isn't too far off from a recent post about 5am blending.\n\n\nIMO, 90% of these posts come from an OP who is far too submissive and just doesnt know how to handle conflict. And if asking strangers first is what it takes to give them a push to confront the roommate, then I'm ok with those posts.",
                      "author": "Inactive_Account",
                      "created": 1543512356,
                      "upvotes": 26,
                      "replies": {
                        "eaqjb61": {
                          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqjb61/",
                          "text": "> IMO, 90% of these posts come from an OP who is far too submissive and just doesnt know how to handle conflict. And if asking strangers first is what it takes to give them a push to confront the roommate, \n\nEh, other times you all want TOO MUCH conflict. As a professor, I cringe at the amount of times the answer given here is to \"Contact your dean! Threaten legal action! Threaten protests!\" for a simple issue of grading. Do people threaten those things? Yes, and it almost never reflects well on them.",
                          "author": "EconMan",
                          "created": 1543520440,
                          "upvotes": 12,
                          "replies": {
                            "eaqkopx": {
                              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqkopx/",
                              "text": "I always get downvoted for this, but when most threads tell \"Contact the dean!\", I usually point out that it could be the students fault and that they should take some responsibility for their lack of work.\n\nThat is always met with \"Why would OP lie? No, their professor is just singling them out and being mean.\"",
                              "author": "Inactive_Account",
                              "created": 1543521451,
                              "upvotes": 8,
                              "replies": {
                                "eaql0zu": {
                                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaql0zu/",
                                  "text": "Yes, I always cringe at how OP's story is met with zero acknowledgement that we may be getting only a partial story of what happened. I can say that 99.9% of the time, nobody is out to get you, simply because we're too busy to be able to hold grudges on students who we only have for a semester. Do students disagree with our grades and grading policies? Absolutely, but it would so rarely be an actual personal thing.\n\nAnd I can tell you that at my school, going over my head to the dean immediately instead of just talking about it with me would result in a much worse outcome. It's not professional and it shows very little responsibility. \n\nSo, I mean, yes maybe people in this subreddit don't like \"conflict\", but I rarely see it in these threads regarding professor's students don't get along with. There, the default action seems to be come out with your guns blazing instead of...talking with them. There's always two sides to a story.",
                                  "author": "EconMan",
                                  "created": 1543521694,
                                  "upvotes": 8,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "earuopg": {
                          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earuopg/",
                          "text": "As a person who has been in these types of situations many times I can say that its not because we don’t know how to handle conflict, but rather because they don’t like confrontation or causing bad feelings between people, even if they are not close to each other or in significant relationship with each other where oftentimes confronting a conflict directly or aggressively might lead to more problems (ie roommates, employer/employee, professor/student, advisor/phd student, coworkers, etc. for example, explain why so many women refuse to report a sexual assault - because we are conditioned to fear the consequences of doing so over the gratification of the possible but not even guaranteed benefits) \n\nWe are looking to find an alternative way to go about solving the issue that they might not be able to come up with themselves, from someone else with a similar experience or even just smarter at dealing with these types of situations.  The reason why we ask other real people for their opinions, advice and input is because its personalized feedback. Google is robotic and built on algorithms. Articles and blogposts are designed to engage the reader and convince them to believe their opinions and can be biased or misleading or incredibly generalized. Its feels less sincere than a person taking a few minutes of their time to read about someone’s troubles and write down their perspective or input. ",
                          "author": "khaleesi_onthatbeat",
                          "created": 1543561302,
                          "upvotes": 1,
                          "replies": {
                            "eas7onx": {
                              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eas7onx/",
                              "text": "But honestly, these situations are almost never that complicated, and the options are obvious. You're not stupid, so whatever options you've thought of are probably the only reasonable options that exist. \n\nIn a lot of the threads where people are looking for advice, it's very clear that they don't want to do anything at all. Anything you suggest is met with excuses and reasons why they \"couldn't possibly do that\". It's weak, and it's a cop-out. \n\nYou know what to do, you know how to do it, so go and do it. Raise your grievances and deal with this shit like a competent human being. I absolutely welcome people who want advice on how to word things or want opinions on some of the details, but not people who are going to play dumb and pretend as though simply *speaking* to their professor or roommates never crossed their mind. \n\nYou're looking for some magical third option for your problems because you're procrastinating on dealing with things. That's entirely on you, and it's a significant problem you need to fix. If you wait for too long to make decisions then decisions will be made for you, and they will not be in your best interest. Learn to handle ambiguity and practice being decisive. We actually can't give you personalised feedback because we're not you and we aren't living your life. ",
                              "author": "NoxiousQuadrumvirate",
                              "created": 1543581861,
                              "upvotes": 2,
                              "replies": {
                                "easa9o1": {
                                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/easa9o1/",
                                  "text": "clearly you don't understand because you've never actually been in this type of person's shoes. By stating so brashly that we're \"not stupid\" and claiming that not raising grievances directly all the time equivocates us to being incompetent human being is actually pretty condescending. Most people really want to avoid a conflict or are afraid of the consequences and at least *hoping* there might be some better option out there that might be better. \n\nyeah you might not be me or another person and living our life but you may have faced the same exact or almost the same situation and had xx results from doing xx way and this might sway the person asking for advice to try a method suggested by someone else or do the same thing or similar.  Having options and people laying them all out in front of you, having more support of one option over another, listening to people debate about the different ways and reasonings behind different ways is helpful for us to come to a calculated and well-prepared decision and also prepared for the realistically possible consequences that might differ from what we imagine. \n\nespecially when it comes to human interactions with people you have no choice but to maintain a good relationship with or continuing interacting. If i had my way I would say what I wanted to and confront everyone about a lot of things that grieve me, but in the end it could potentially ruin my relationships with those people and others - negatively affect my reputation, endanger my job. If it were like a roommate situation I could end up having more fights or the person being petty or behaving worse in retaliation and making my life more miserable, end up kicked out of the home or without a roommate and unable to afford the rent - these are just general examples I can think of off the top of my head from my own personal experience.  \n\nAnd yeah, maybe some people would rather not do anything at all. Because it's unpleasant. Not everyone is so gung-ho about doing things they don't like to do or give them more stress as you seem to be. *eyeroll* ",
                                  "author": "khaleesi_onthatbeat",
                                  "created": 1543584807,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ear1hat": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear1hat/",
          "text": "I wish my roommate would do this...",
          "author": "vr1252",
          "created": 1543534323,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eaq2fxp": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq2fxp/",
      "text": "Reminds me of how 99% of threads on legaladvice eventually come around to \"maybe you should talk to a lawyer?\"",
      "author": "ElegantTobacco",
      "created": 1543508502,
      "upvotes": 507,
      "replies": {
        "eaqqiwz": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqqiwz/",
          "text": "Except that could cost money the people don’t have ",
          "author": "CrazFight",
          "created": 1543525686,
          "upvotes": 89,
          "replies": {
            "earqwoo": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earqwoo/",
              "text": "Usually lawyers allow one free appointment that they can give for legal advice though. I remember because in Sopranos, the mob boss who was in a divorce with his wife went to every top divorce lawyer in the area specifically so that she wouldn't be able to have them review her case because of a previous knowledge about the opposing party. But ya usually it's free for first reviews.",
              "author": "cc3141592",
              "created": 1543557043,
              "upvotes": 20,
              "replies": {
                "easas8v": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/easas8v/",
                  "text": "Cant wait to get married so I can get divorced.",
                  "author": null,
                  "created": 1543585348,
                  "upvotes": 4,
                  "replies": {}
                },
                "eascb9c": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eascb9c/",
                  "text": "That's pretty funny and totally illegal haha",
                  "author": null,
                  "created": 1543586811,
                  "upvotes": 3,
                  "replies": {
                    "eb21jx6": {
                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eb21jx6/",
                      "text": "Seeing a lawyer is illegal? ",
                      "author": "VictoriasSecretCEO",
                      "created": 1543908618,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "eb0vctb": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eb0vctb/",
                  "text": "Dang , just to see a lawyer it costs me 200. Might depend on where u live. ",
                  "author": "CrazFight",
                  "created": 1543869795,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eaq245q": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq245q/",
      "text": "Financial aid office too.",
      "author": "wolf2600",
      "created": 1543508267,
      "upvotes": 13,
      "replies": {}
    },
    "eaq0f8y": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq0f8y/",
      "text": "This is such good advice. I have went to my guidance counselor with all of my simple and complicated questions, they seriously know everything. And when they dont, Google does 😅",
      "author": "-imnotunique-",
      "created": 1543507048,
      "upvotes": 20,
      "replies": {
        "eaq5p0k": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq5p0k/",
          "text": "And when they know nothing, it's a good hint that it's time to swap schools. Misinformation from advisors can seriously hurt your college experience.",
          "author": "Inactive_Account",
          "created": 1543510820,
          "upvotes": 8,
          "replies": {
            "eaqi7ma": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqi7ma/",
              "text": "If you're only relying on your advisors for information, by the time you realize they know nothing, it will be too late and your college experience will already damaged. \n\nIt might be better to take everything with a grain of salt, ask multiple sources and look for patterns of consistency in advice.",
              "author": null,
              "created": 1543519643,
              "upvotes": 2,
              "replies": {}
            },
            "earifxh": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earifxh/",
              "text": "Not all advisors are the same. Before jumping straight to transferring, I'd suggest just going to a different advisor. \n\nAlso, I don't know how everyone else's experiences is but IMO your best bet is knowing your degree path and figuring out what you need to take. This can also give you security if your advisor doesn't know what you're talking about and you're unable to switch or seek a second opinion before registration.",
              "author": "Comrox",
              "created": 1543549084,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "eaq08hw": {
      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq08hw/",
      "text": "Stackoverflow is great too. ",
      "author": "BaoZaker",
      "created": 1543506918,
      "upvotes": 209,
      "replies": {
        "eaq0d7e": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq0d7e/",
          "text": "Thread close , topic not relevant enough.",
          "author": "WeStandUnited5009",
          "created": 1543507009,
          "upvotes": 78,
          "replies": {
            "earyq37": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/earyq37/",
              "text": "The absolute worst is when you find a question which is exactly your problem but no answers.",
              "author": "exploder98",
              "created": 1543567144,
              "upvotes": 6,
              "replies": {
                "eauvw5k": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eauvw5k/",
                  "text": "Nah I'd say the worst is when you find a question which is exactly your problem, but people reply with \"You can figure it out yourself. It's easy.\"",
                  "author": "ThisIsAlreadyTake-n",
                  "created": 1543677965,
                  "upvotes": 4,
                  "replies": {
                    "eawpn08": {
                      "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eawpn08/",
                      "text": "Aaarrrgggghhh.",
                      "author": "exploder98",
                      "created": 1543735298,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "eaq1293": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq1293/",
          "text": "Stackoverflow be like:\n\nHave you checked google",
          "author": "Gocountgrainsofsand",
          "created": 1543507507,
          "upvotes": 56,
          "replies": {
            "eaq6t1r": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq6t1r/",
              "text": "Stackoverflow be like:\n\nnvm.  i figured it out.",
              "author": "ecklesweb",
              "created": 1543511612,
              "upvotes": 29,
              "replies": {
                "eaqg9r3": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqg9r3/",
                  "text": "The greatest sin",
                  "author": "TomBob42369",
                  "created": 1543518194,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "eaq4bbt": {
              "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq4bbt/",
              "text": "\"Did u even try googling this gawd\" ",
              "author": "Featherfy",
              "created": 1543509843,
              "upvotes": 12,
              "replies": {
                "ear5usw": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/ear5usw/",
                  "text": "oof when you're not the OP of the post on stackoverflow and get to the post by googling",
                  "author": "trottingtriever",
                  "created": 1543538137,
                  "upvotes": 4,
                  "replies": {}
                },
                "eardqvg": {
                  "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eardqvg/",
                  "text": "the trick is to talk shit and say that this technology is so garbage and that no one should ever use it. Then you get real help",
                  "author": "whitelife123",
                  "created": 1543545074,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "eaq0fjc": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaq0fjc/",
          "text": "Ol' faithful right there",
          "author": null,
          "created": 1543507054,
          "upvotes": 4,
          "replies": {}
        },
        "eaqjvm8": {
          "link": "/r/college/comments/a1i7vq/im_about_to_answer_every_one_of_your_questions/eaqjvm8/",
          "text": "“Nvm I figure it out thanks though”",
          "author": "Jaydeepappas",
          "created": 1543520854,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634057397
}