{
  "sid": "qmxxdb",
  "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/",
  "title:": "I haven’t spoken to a single person in 2 weeks and I’m horrifyingly depressed and lonely and miserable and I’m falling apart",
  "text": "I’m a freshman btw. I have severe social anxiety and during orientation I met a group of girls who I started a group chat with and they were the main people I hung out with for like the first two months. However, they all eventually met people in their dorms and in their classes while my socially awkward ass met basically no one. Then I reached out a cute guy I met during orientation who seemed kinda awkward as well and I started hanging out with him a bit but then he abruptly dropped out. Now, I have literally no one to hang out with.\n\nI don’t have anyones number. I’m in 2-ish clubs (one I go to every week but the other one changes meeting times so much that I’m rarely able to go). I haven’t met anyone in those clubs who I’ve managed to hang out with outside of our meetings. I also work for the yearbook which is entirely student run, but we have like one 30 minute meeting every two weeks so I don’t get much of an opportunity to socialize with them. \n\nI’m horribly depressed. I try to distract myself by filling up my time doing shit, but I always remember eventually how lonely I am. Idk what to do. I just want this semester to end so badly. I feel like next semester might be better bc I’ll have another chance to meet people in new classes, but I feel like I’ve missed that window of opportunity this semester. I try to go to like every social event on campus, but people always show up with their groups of friends or they’re already friends with people there and I’m way to anxious to talk to groups of people like that. I’m miserable. \n\nI’ve started seeing a counselor at my school bc they have free counseling services, but I can only see them every like 2.5 weeks bc of how booked they are. Idk what to do. I break down crying all the time. I don’t know who to talk to about how I’m feeling. I talked to my RA once but I think she thinks I’m weird as hell and doesn’t like me. I’m so depressed that I’m procrastinating my work until I get overwhelmed by deadlines. It’s a never ending cycle. I was so excited for college but I’m not happy here at all.",
  "author": "ventibabythrowaway",
  "created": 1636069086,
  "updated": 1636181841,
  "over_18": false,
  "upvotes": 156,
  "upvote_ratio": 0.96,
  "comments": {
    "hjcuhnz": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjcuhnz/",
      "text": "This semester is almost over, you can always try again in next semesters classes. People are always looking to make new friends especially in a new area",
      "author": "GoldRequest",
      "created": 1636072962,
      "upvotes": 65,
      "replies": {}
    },
    "hjcseqj": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjcseqj/",
      "text": "Honestly, I would try to find clubs with longer meet times even if they are outside your normal interests. I transferred as a junior and was in similar shoes. I joined multiple clubs but the one that stuck was judo because the meeting would last two hours and kinda forced me to be social with different people. Any club that lasts long and forces direct participation is probably your best bet.",
      "author": "Crazyacebaron22",
      "created": 1636072055,
      "upvotes": 20,
      "replies": {}
    },
    "hjctz46": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjctz46/",
      "text": "I feel the same way, I’m not in college but I work full time and everyone hangs out outside of work. Every time I think I meet someone cool they find other better friends than me apparently",
      "author": "Strawbsmilk",
      "created": 1636072739,
      "upvotes": 9,
      "replies": {}
    },
    "hjd3m5p": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjd3m5p/",
      "text": "wow, i relate so much to this post. i'm in the same boat, i'm a freshman and i've got social anxiety so it's so tough for me to talk to people. my school has free counseling services as well and i just met with a counselor today, but they're also pretty much booked here as well so i'm rarely going to be able to see a counselor. i broke up with my girlfriend a few weeks ago so i really don't have like anyone to talk to and its the most overwhelming feeling. in high school i had a great friend group and people to hang out with on the weekends, but i just don't have that here and it feels overwhelmingly lonely.\n\nwhat's been pretty helpful for me is trying to stay productive and working on myself because i have so much free time. working out has been especially great for me because it seriously boosts my mood and i feel wayyyy more confident. i also try to stay optimistic. like you, i'm looking forward to next semester because its another opportunity to meet people and i feel like i'll be much more prepared this time around to meet people. it sounds like you're definitely putting in a lot of effort to meet people, like going to the social events, so i feel confident that eventually you'll meet your people :) in the mean time try to focus on yourself, that's how i've been coping.",
      "author": "javaslab",
      "created": 1636076996,
      "upvotes": 8,
      "replies": {}
    },
    "hjd5yuo": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjd5yuo/",
      "text": "Call your parents. Say hello to the maintainers/random staff members. The semesters almost over. You’re doing a good job.",
      "author": "_heatwaves_",
      "created": 1636078087,
      "upvotes": 8,
      "replies": {}
    },
    "hjco209": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjco209/",
      "text": "I was gonna say you should get help, but since you’re already talking with a counselor, that’s good. Just remember, it takes time. You anxiety isn’t just gonna go away because you’re in college now. Also try to plan your days. \n\nHonestly for me, the most important thing, is gaming. But to be able to do that with a good conscience I need to finish my homework/assignments and have done my chores, and been at training. All of which takes time. And if I were to do that all the time, then I would never be able to game. \n\nSo most of the time I game with a guilty conscience. \n\nI guess what I’m trying to say is don’t be so hard on yourself. You’re trying. Take it at your own pace. Don’t compare yourself to others. I hope it gets easier for you.",
      "author": "Randolph-",
      "created": 1636070136,
      "upvotes": 16,
      "replies": {}
    },
    "hjdmup5": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjdmup5/",
      "text": "First off - call your parents if you need someone to talk to, just because you are in college doesn’t mean they can’t be there for you (assuming you can talk to them - sorry if you can’t) \n\nSecond, just to try and give some different advice as others are saying, have you though about getting a job? If you don’t already have one, sometimes getting a job that can take up some of your time can do wonders. On one hand, it gives more responsibility which honestly kinda forces you to get your shit together on other stuff like assignments and not procrastinating. You’ll also be getting some money. More importantly for you however would be the extra social outlet you’ll receive. This will be even better if you can find a job that has your age group primarily working there - or maybe even look into campus jobs for your college. You would find other students and be forced to interact with them for long periods of time which can do wonders for creating connections and friendships. \n\nIf you already have a job or if you don’t think this solution is for you - try and look into study groups or clubs that have longer meetings. Same logic as before - if you are forced to interact with people then eventually you’ll build connections and relationships. \n\nSince you are already talking to people about this - I would say try and relax and if you still can’t seem to find anyone try next semester. \n\nYou’d be surprised how many people are in your exact same shoes. You wouldn’t notice it because everyone always seems to be in a group - but trust me, a ton of other students are having the same issues as you. Feel proud that you have the drive to try and reach out to people and join clubs and stuff. A lot of people don’t and end up even worse. Keep at it, best of luck!",
      "author": "michael_am",
      "created": 1636086892,
      "upvotes": 5,
      "replies": {}
    },
    "hjd8vkf": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjd8vkf/",
      "text": "Hey you can do it! Sounds like you're trying your best, that's all you can do. Don't stress about not being good enough or being the best version of yourself, it will happen when you're not paying attention. And no need to stress about making friends outside of clubs. Some clubs you just show up and have a good time while you're there. Keep doing that and eventually you might find yourself really clicking with someone. If that doesn't happen, that's okay too! There are so many different types of people and you might not make friends where you expect. Go where you want to go, do what you want to do and you'll find your people eventually. For now, if you can talk to your family or friends from the past or online peoples, that will help give you something to look forward to. You don't even have to talk about how you're struggling, it might be more fun for you that way. You could play an online game with them to take the pressure off talking. From your username, you like coffee? Go to a coffee shop on or off campus and set up with your laptop and a tiny work goal. See how it goes, if you don't get anything done - you still accomplished something by getting out of your room and being around people, even if you don't talk to them! I know it seems impossible to get out of where you are right now, but you've probably done it before? Or you've done other really hard things, and you CAN fucking do this!! Sending internet stranger hugs your way!",
      "author": "LJ-gibbs",
      "created": 1636079463,
      "upvotes": 3,
      "replies": {}
    },
    "hjdta92": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjdta92/",
      "text": "Do you have friends from high school? Join a small discord get to know people there. Most often the server will go dead after a while but there are times where I have made long term online friends.",
      "author": "Bearsbarebear",
      "created": 1636091262,
      "upvotes": 3,
      "replies": {}
    },
    "hjdnq32": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjdnq32/",
      "text": "Join a sports club. The fewer the members, the better because everyone in a small club will know each other.",
      "author": "Mean-Parking-2307",
      "created": 1636087434,
      "upvotes": 2,
      "replies": {}
    },
    "hjdvhz7": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjdvhz7/",
      "text": "this is going to sound a bit funny and I'm not trying to judge, but since you've already made good steps to getting a counsellor, do you think anti anxiety meds might help with your social anxiety? my mom takes a half a one a day and they really REALLY help her relax and not imagine terrible things happening to me and my brother who live in different provinces/towns all the time. I totally get it if that's not an avenue you want to go down; I'm not a big fan of pharmaceuticals either, but in some cases they can be just the help we need and there's no shame in that at all. maybe just to take the edge off so you can try to find your people at events and parties and such.  \n\n\nfailing that, I would also suggest exercise. if you're procrastinating anyway, maybe fill that time with something positive you can focus on and get in touch with your body and mind. especially if you can be outdoors in the fresh air and nature, it can be really therapeutic. mindlessly walking around doesn't always help and can sometimes make things worse, I find it has to be a focused effort to get out of our heads a bit more. ADDITIONALLY, when you start exercising and begin to see progress (you can run three miles instead of just two), you might even feel a little more confident.  \n\n\nI'm sorry this is happening to you. I went through a phase of feeling incredibly ostracized my first year at uni, too. you'll get through it! just remember that even though the moments might suck, time never stops, and we're always always moving forward (just keep swimming).",
      "author": "Klutzy-Classroom6756",
      "created": 1636093012,
      "upvotes": 2,
      "replies": {}
    },
    "hjfabum": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjfabum/",
      "text": "If it makes you feel any better, I’m 26, still in college and haven’t made 1 friend cuz of my anxiety.",
      "author": "AP_Feeder",
      "created": 1636125386,
      "upvotes": 2,
      "replies": {}
    },
    "hjdb4qe": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjdb4qe/",
      "text": "I’ve been there too. I pushed myself to finish the school year as much as I wanted to leave after one bad fall semester. I transferred after my freshman year to a community college and then to a 4 year college and I commuted all of those years. And you know what? It was more amazing than I could have ever dreamt. I had so much fun, made so many friends when I least expected, and I somehow turned my whole college experience around. When you know what to do, do it. For me, it was transferring. You know what you feel like you need to do, don’t be afraid to do it.",
      "author": "Midwestniceish",
      "created": 1636080532,
      "upvotes": 3,
      "replies": {}
    },
    "hjdqtmo": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjdqtmo/",
      "text": "What you feel is what every other freshman feel. This is not uniquely to you, so keep at it you awkward son a B$#@!",
      "author": "timemaninjail",
      "created": 1636089489,
      "upvotes": 1,
      "replies": {}
    },
    "hjfj2e2": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjfj2e2/",
      "text": "maybe finding online friends could be easier",
      "author": "just__because-",
      "created": 1636128778,
      "upvotes": 1,
      "replies": {}
    },
    "hjfphw1": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjfphw1/",
      "text": "First of all be confident. This thing happened with me cause I found myself kinda uncool and not that much gentle in comparison of others but eventually I realised that it's me and I don't have to be cool fool. So don't feel miserable, you are different and try to be normal as you are. I am sure you'll be able to find some good friends soon. Good luck🤞🍀",
      "author": "Priyanshi_Rawat",
      "created": 1636131235,
      "upvotes": 1,
      "replies": {}
    },
    "hjg1nd8": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjg1nd8/",
      "text": "heyy dw you’re not alone :( i’m almost in the same boat as you. just started uni and whats worse is that all of my courses are online so i barely go to campus and feel very isolated all the time. i literally do everything alone and its weird to me bec i was always surrounded by people in high school. \nyou’re putting in a lot of effort so don’t be too hard on yourself. also i’ve noticed that post-covid everyone’s generally more stand-offish and closed off and socialising is so much harder. its not your fault. \ni honestly think you’re doing great by my standards lol. When it comes to finding your people let stuff happen naturally and even if it doesn’t work out you’ll have the next semester. \nas for the talking bit maybe hit up an old friend on ig or an online space related to ur interests. feel free to hmu on here if that doesn’t work out. if it counts for anything i’d genuinely befriend you irl. i honestly wish i could meet people from here in uni cause a lot of time the struggle is mutual, its just hard to actually identify it in people irl.\njust hang in there it’ll get better and there’s only a few more weeks to go before winter break. virtual hugs!!",
      "author": "rooftops22",
      "created": 1636135930,
      "upvotes": 1,
      "replies": {}
    },
    "hjepubo": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjepubo/",
      "text": "Probably just give up and drop out now",
      "author": "yetiman3511",
      "created": 1636116456,
      "upvotes": -6,
      "replies": {
        "hjeywns": {
          "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjeywns/",
          "text": "No",
          "author": "ventibabythrowaway",
          "created": 1636120741,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjimjf9": {
      "link": "/r/college/comments/qmxxdb/i_havent_spoken_to_a_single_person_in_2_weeks_and/hjimjf9/",
      "text": "If your fine with talking to randos over the internet I'm always up for it",
      "author": "SlightlyPositiveGuy",
      "created": 1636176746,
      "upvotes": 1,
      "replies": {}
    }
  }
}