{"sid": "pwwaeb", "link": "/r/college/comments/pwwaeb/whaaaaat_masturbating_in_the_communal_dorm/", "title:": "Whaaaaat? Masturbating in the (communal) dorm bathroom is “seriously disgusting?”", "text": "Yesterday everyone in my dorm building (around 500 people both guys girls and diverse genders) had to be in a zoom meeting with the person that is right above the RA’s in authority. I think like RAC or REC or something like that. This meeting was about rules (building rules, school rules, safety rules, etc).   \n\nThe RAC are allowed to add rules in addition to the ones made by the school, our RAC has some added reasonable rules, no basketball bouncing, soccer balls have to be carried and not transported by kicking, baseball bats have to be in a backpack or carried by the thick side etc. Then came “no masturbating in the bathroom toilets, showers or  sinks”. Then she said “seriously you guys it’s disgusting, think about all the people that will use the same facilities where you did your things it’s just disrespectful” “just do it in your room or find someone to have sex with there is plenty of condoms at the health center just about a 30 second walk from the building”  \n\nYes the last two things are true I went to get some several weeks ago just in case I find a gf or fwb, and they have pretty much all the types you can imagine but still it seems like not allowing masturbating in the bathroom is too much  \n\nAlso we are supposed to report if we suspect someone is masturbating otherwise we could be subject to the same discipline as them  \n\nThe good thing is that the “report” first had to be done with the RA and when the REC said that she had the biggest “what the hell?” face so she might not do anything about it if someone reports   \n\nI mean I don’t think there is anything wrong with doing it on the toilet that’s where I have been doing it for the past month. And if there is please tell me where I should do it instead (not the room I have 3 roommates so I would rather save my “roommate kick outs for private time” in case I get a gf) basically we are have the right to ask everyone to step out 4 times a semester as long as it is not causing them extreme hardship and not during finals week but it can be more times or during finals week by mutual agreement\n\nI understand the shower prohibition more because it can be clogged by semen and the sink one for obvious reasons but not the toilet one, and for girls not even the shower one", "author": "throwaway67083", "created": 1632795173, "retrieved": 1632800142, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"hejxg2h": {"link": "/r/college/comments/pwwaeb/whaaaaat_masturbating_in_the_communal_dorm/hejxg2h/", "text": "\"Or the sinks\"???? What kind of animals are you living with, lmao", "author": "postmaloneismediocre", "created": 1632799479, "upvotes": 1}, "hejsrrd": {"link": "/r/college/comments/pwwaeb/whaaaaat_masturbating_in_the_communal_dorm/hejsrrd/", "text": "Yeah... it is “seriously disgusting”. It’s a communal space.", "author": "RyeMarie", "created": 1632797142, "upvotes": 1}, "hejr53d": {"link": "/r/college/comments/pwwaeb/whaaaaat_masturbating_in_the_communal_dorm/hejr53d/", "text": "I'm a girl, this post is inappropriate and make me feel 🤢🤮🤮🤮\n\nI know girls (including me) have periods, but thankfully everybody is good at keeping the bathroom clean so I don't have to worry about blood and tissue are over the place form someone's period.", "author": "malarkeyasian", "created": 1632796355, "upvotes": 1}}}