{
  "sid": "q26cxg",
  "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/",
  "title:": "Does it get easier in College?",
  "text": "I’m a pretty burned out senior in high school (but no i am not trying to challenge your supremacy, I don’t have more homework than you ~~engineering students~~ engineers). I was wondering if it gets easier in college workload wise and socially? Cause during my lurking period I saw a lot of posts here about burnout and loneliness. Any thoughts are appreciated, thanks!",
  "author": "nameqmark",
  "created": 1633470253,
  "updated": 1634083708,
  "over_18": false,
  "upvotes": 70,
  "upvote_ratio": 0.95,
  "comments": {
    "hfj6btr": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfj6btr/",
      "text": "No the workload for college is more challenging than high school. The expectations on your learning are higher as well. However, I do want to emphasize the importance of study habits and passion for your field/subject. I found that although college has a heavier and more challenging workload, I enjoyed it more than high school. I was able to actually show and apply my knowledge in a field that I loved. \n\nIf you have trouble with burnout and loneliness in high school I suggest rethinking the way you study and how you develop and maintain social interactions. You might be using inefficient studying strategies. \n\nSocial connections in college can include: close friends, study buddies, mentors, professional networks etc. You want to meet people who share similar values and respect you for who you are. These should be people who lift you up and can give their honest thoughts on your weaknesses. The social aspect of college can be intimidating at first but you will learn to grow into it. Once you find the right people, you can feel confident in sharing and improving your work and your ideas. \n\nIf you are interested in preparing for college I have some resources that I can share with you. \n\nIt helps to start reading and taking notes like you would in college. When I was in high school I started learning college studying skills from my sibling. I also attended information sessions and workshops at universities I was interested in.\n\nI would suggest reading journal articles now. The Journal of Emerging Investigators offers free access to journal articles. The articles are written by middle and high school students, but you can start training your skills in reading articles. \n\nI have a study with me playlist on my YouTube channel that focuses on helping students study better in college. This playlist includes:\n\n\\- 5 effective study habits (I introduce my overall studying style)\n\n\\- How to read a textbook\n\n\\- How to read a journal article\n\n\\- How to take notes (lectures, readings, project and exams)\n\n\\- How to prepare for and take exams (I talk about ways you can tackle different types of exams)\n\n\\- 5 books that can help you build your vocabulary, improve your reading, writing, presentation skills and life skills for college\n\n\\- School supplies that I found to be useful during college\n\n\\- College freshman advice \n\nMy playlist link is: [https://youtube.com/playlist?list=PLdkoToKBS\\_VQo0\\_2eyB09tZGzfNYgyEum](https://youtube.com/playlist?list=PLdkoToKBS_VQo0_2eyB09tZGzfNYgyEum)\n\nI also have a College Freshman Starter Kit. This useful for getting you familiar with how to transition from high school to college.\n\nLink to the kit:\n\n[https://docs.google.com/document/d/1AeO1X4u0ZWQCkDk3zALoDUPV\\_W7K9wV5HvoFWK\\_Es2E/edit](https://docs.google.com/document/d/1AeO1X4u0ZWQCkDk3zALoDUPV_W7K9wV5HvoFWK_Es2E/edit)",
      "author": "irisy211",
      "created": 1633471307,
      "upvotes": 89,
      "replies": {
        "hfk74uu": {
          "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfk74uu/",
          "text": "Great comment!",
          "author": "WalmartDarthVader",
          "created": 1633489349,
          "upvotes": 3,
          "replies": {}
        },
        "hfl9g9d": {
          "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfl9g9d/",
          "text": "You should have put this on blogger😅",
          "author": "visionary_shyam",
          "created": 1633518472,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfj8pbb": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfj8pbb/",
      "text": "The workload is actually roughly the same but the type of learning changes dramatically. For instance, in high school, you might be doing 45 hrs of school stuff a week, out of which 35 is in class and just 10 doing hw and stuff outside of class. In college, its about 50 hrs a week but your class time is only like 15 hrs. The rest is all hw and studying that you have to do on your own. Some people find this more challenging and others find this easier. \n\nAs others have mentioned, a major plus is that for the most part, you’ll be taking classes in subjects you at least somewhat like. So that makes college more exciting and tolerable imo",
      "author": "mowa0199",
      "created": 1633472393,
      "upvotes": 27,
      "replies": {
        "hfjli8f": {
          "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjli8f/",
          "text": "Great breakdown of the time spent in high school / college.\r\n\n  \nThe 6 hours a day of having to sit in class back in high school was way more draining than the hours spent studying in college.  I find that 3 hours can zoom by studying my core classes like nothing, and it’s more enjoyable than my memory of having to sit through a 1 hour high school English class.",
          "author": "RadioTech13",
          "created": 1633478537,
          "upvotes": 6,
          "replies": {}
        },
        "hflbrhj": {
          "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hflbrhj/",
          "text": "The challenging part is that professors won’t hold your hand. You might get less assignments and feel like you have a lot of time but in that time you are actually supposed to review the material. The difference is that in high school you get homework consistently to assess your learning. If you don’t get homework in college that first exam you fail will be the wake up call.",
          "author": "kyeelee",
          "created": 1633520005,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfj96sn": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfj96sn/",
      "text": "Lol no.\n\nBut in all seriousness, it gets worse. I wouldn’t say that there is more work, but it’s definitely harder. I don’t want to scare you, It’s doable, but you need to learn how to manage your time and refine your study habits.",
      "author": "JupiterRocket",
      "created": 1633472614,
      "upvotes": 28,
      "replies": {
        "hfjhe1c": {
          "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjhe1c/",
          "text": ">wouldn’t say that there is more work, but it’s definitely harder.\n\nIn my experience thats not true, I have significantly more assignments to hand in than I did in high school",
          "author": "taybay462",
          "created": 1633476513,
          "upvotes": 5,
          "replies": {
            "hfjksyi": {
              "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjksyi/",
              "text": "For me, it’s an equal amount of work but it takes way longer than than it did in high school. Every school and every class is different.",
              "author": "JupiterRocket",
              "created": 1633478194,
              "upvotes": 3,
              "replies": {
                "hfk7no5": {
                  "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfk7no5/",
                  "text": "For me it’s way more bcuz I didn’t take any APs or honor classes in high school.",
                  "author": "WalmartDarthVader",
                  "created": 1633489608,
                  "upvotes": 1,
                  "replies": {}
                },
                "hfluca2": {
                  "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfluca2/",
                  "text": "For me it’s much more work, but it takes less time because I’m in class so little",
                  "author": "bodak_red",
                  "created": 1633529900,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfj7il1": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfj7il1/",
      "text": "The workload doesn't but at least the courses you will take will be related to your field in some way. My courses weren't the easiest but they felt more fulfilling if that makes sense.\n\nAlso as far as the social part you'll more than likely be with other engineering students who are in the same boat as you and forming study groups really makes the difference. I don't think I would have done well in my Calc courses especially if it wasn't for practicing the material with some friends.",
      "author": "Traaaaaaaaap",
      "created": 1633471846,
      "upvotes": 3,
      "replies": {}
    },
    "hfj9n9f": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfj9n9f/",
      "text": "The workload is definitely alot more challenging but you have the perk of creating your own schedule also I found my gen ed classes were more assignment heavy than my core classes but I am psych so I have a crapton of reading to make up for it and my major classes way more interesting and tolerable 😂 the gen eds were tough cause most werent my interest and too this day writing classes slightly annoy me lol but its worth it and the customizations to your schedule a definite perk.",
      "author": "Silver_Least",
      "created": 1633472827,
      "upvotes": 3,
      "replies": {}
    },
    "hfja3uv": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfja3uv/",
      "text": "My personal experience was great. I started college my senior year of high school and looking back, if I hadn’t done that I probably would have failed out of school. I was being put into these AP classes that were nothing near what I wanted to do and couldn’t get college credit despite getting an A all year because I didn’t pass a test that is harder than any exam I have ever taken in college. I started college and immediately felt more motivated and more in tune with my education. The workload is more, self-discipline is a must, but for whatever reason I felt like I had so much weight lifted off of my shoulders not being in high school anymore, even when I was taking gen ed classes that were not applicable to my direct field.",
      "author": "wingnut4000",
      "created": 1633473046,
      "upvotes": 3,
      "replies": {}
    },
    "hfjbeok": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjbeok/",
      "text": "Workload is definitely more challenging. You can't get away with cramming 10 mins before the test and then acing it. Socially I think its easier since most people are more open and the general cliqueness of HS goes away.  Burnout can be real, but the loneliness posts are part Reddit becoming a echo chamber for the select few. For every 1 lonely posts there's 1000 who are busy doing other things so they don't post how they aren't lonely.",
      "author": "NinjaLorian",
      "created": 1633473663,
      "upvotes": 3,
      "replies": {}
    },
    "hfj6snz": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfj6snz/",
      "text": "Depends a lot on your high school. If it's a high quality high school, you may actually find college to be easier, because 1) you will be more prepared for college than your peers, and 2) you won't have every moment of your day taken up by AP classes and extracurriculars. The freedom to design your own schedule in college can be a breath of fresh air compared to high school.\n\nMost engineering majors, though, will find college harder. You really don't know what it will be like for you until you try it-- you might be one of the lucky ones that finds college easier.\n\nIf it makes you feel any better, I found both undergrad (in a non-STEM field) and grad school (in a STEM field where all the students with engineering degrees in my classes complain it's \"hard,\" lol) to be easier than high school.",
      "author": "HumanDrinkingTea",
      "created": 1633471518,
      "upvotes": 6,
      "replies": {}
    },
    "hfjkbm0": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjkbm0/",
      "text": "Workload:\r\n\n  \nI would say that college is a lot easier overall in terms of workload, although I have special circumstances.\r  \nI started college at the age of 23 at my local community college, so I’m much more motivated now to try my hardest compared to high school, and transfer to my dream school.  I also went to a college prep high school, which dished out at least 3 hours of homework every night.  Community college is at most 6 hours of work a day including class (I’m studying accounting and econ, not engineering).\r  \nSo if you’re planning on going to CC, then don’t worry at all. Most of the professors are laid back.  I expect my workload to increase significantly when I transfer and start upper division classes.\r  \n\r  \nSocially:\r\n\n  \nCollege CAN be better socially than high school.  The amount of social activity you experience is really up to you.  People are nicer and more understanding in college overall, and joining clubs and meeting people is great experience.  \r  \nThat being said, it is also very easy for college students to just do their school work, go home, and never meet anyone outside of class.  There is nothing stopping anyone in college from doing this.  A lot of people don’t participate in clubs (maybe this is unique to CC).",
      "author": "RadioTech13",
      "created": 1633477957,
      "upvotes": 2,
      "replies": {}
    },
    "hfkyeuj": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfkyeuj/",
      "text": "Higher workload and much harder. However I feel like you’ll have more motivation because you’ll meet great friends along the way. I had a massive burnout half of my senior year and it’s been a month in university and I’m still motivated and not burned out, despite scoring terribly",
      "author": "uselessambassador",
      "created": 1633508616,
      "upvotes": 2,
      "replies": {}
    },
    "hfjb10s": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjb10s/",
      "text": "Depends on your program, school, and teachers. Most of my workload is just projects, so even though I probably put in more hours than I did in HS, it doesn't feel that way now. The first year or two will probably be fairly similar to HS. I had less graded homework, usually just a quiz or something over the reading in class, for my gen eds (aside from English and Math).   \n\n\nOnce you get to the point of having mostly classes in your major, even the \"work\" doesn't feel as much like work assuming you enjoy it. A fair amount of my professors are either project or test heavy, which I love because I hate random busy work.",
      "author": "Hunt3r8806",
      "created": 1633473484,
      "upvotes": 1,
      "replies": {}
    },
    "hfjdv1d": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjdv1d/",
      "text": "no, the workload is much more intense. what makes it bearable is pursuing what i’m interested in. if i hated reading about glial cells and synapses for hours i’d be miserable, but i find it cool so i’m doing just fine",
      "author": "rapsodiya",
      "created": 1633474807,
      "upvotes": 1,
      "replies": {}
    },
    "hfjgqo1": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjgqo1/",
      "text": "Depends on course. \nGenerally tougher.",
      "author": "jameskishtok",
      "created": 1633476187,
      "upvotes": 1,
      "replies": {}
    },
    "hfjhabj": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjhabj/",
      "text": "I mean this kindly, but how the hell would it make sense that the workload in college gets easier?? It does not. Think of the difference between middle and high school courses, then double that. You spend less time actually in class but that doesnt mean you have more free time, to do well you really need to study a lot. You have weekly homework and lab reports, depending on your classes you may have an exam every other week. Concepts are harder and if you have an in depth question the professor may tell you to come to their office hours to ask it. Socially, it depends honestly. If you make an effort to talk to people you shouldnt have any trouble finding people to hang out with. Its much less cliquey too",
      "author": "taybay462",
      "created": 1633476460,
      "upvotes": 1,
      "replies": {}
    },
    "hfjk7zs": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjk7zs/",
      "text": "Socially it was easier because a lot of people are looking for fresh starts and new friends. Even if it’s difficult to decide who is worth being a friend, people stick with persistence.\n\nThe course load is a lot more than high school because the content is difficult and actually requires studying on your own time. I was very burnt out my senior year. I really recommend taking it slow your first semester to adjust and to remind yourself to relax now and then! Try taking 3 classes instead of the recommended 4 if you are starting your freshman year still feeling burnt out. Remember: It’s not a race to graduation!",
      "author": "shoelaceys7373",
      "created": 1633477907,
      "upvotes": 1,
      "replies": {}
    },
    "hfjl1nu": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjl1nu/",
      "text": "It does and it doesn't get easier at the same time. I'm a freshman and one thing I've noticed is that there is no unnecessary busy work. So in some ways there is less work. The work we do have to do is more substantial and difficult, but there isn't any mind-numbing pointless work. It's also easier to get work done because we get to choose our schedules instead of spending 7+ hours at a time stuck in school.",
      "author": "lissamarie3",
      "created": 1633478312,
      "upvotes": 1,
      "replies": {}
    },
    "hfjpyix": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjpyix/",
      "text": "you have more freedom but no its definitely not easier. the curriculum is more difficult, the classes are 10x faster paced, and because of all your new freedom you arent gonna wanna do anything hahaha",
      "author": null,
      "created": 1633480656,
      "upvotes": 1,
      "replies": {}
    },
    "hfjx5oz": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjx5oz/",
      "text": "Yes and no. I’m in music so ALL of my classes are music related but I also have 11 (if you count ensembles, studio, and lessons etc). I have about 4 classes with homework, which is always due for the next class. Because I’m in music I also practice 2-3 hours a day and I have a job with the orchestra. I’m doing what I love so it doesn’t always feel like work, but I’m also exhausted by the end of the day. My best advice is to establish routines and get enough sleep each night.",
      "author": "isabellesch1",
      "created": 1633484438,
      "upvotes": 1,
      "replies": {}
    },
    "hfjxme3": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfjxme3/",
      "text": "Depends on your major. If it's business or liberal arts, you're gonna have a bunch of free time. If you're doing engineering you're going to be going to class, doing homework and studying, that's it.  People doing bio and pre med and stuff, their workload increases heavily during MCAT and stuff.",
      "author": "09ikj",
      "created": 1633484677,
      "upvotes": 1,
      "replies": {}
    },
    "hfk3s5n": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfk3s5n/",
      "text": "I think it depends on what kind of classes you took in high school and what your major is in college, among other factors. I will say that I struggled A LOT in high school and was very burnt out by the end of the college application season. I was taking a bunch of AP classes and also struggling with how early school started (7:20 am wtf). \n\nI’m a STEM major and I can say the content in college is much harder, but it doesn’t feel as bad as high school. I am better equipped to deal with classes since I’m older and have learned how to study more effectively than when I was in high school. The workload also mostly depends on you—do you want to coast through college and not be involved in any extracurriculars, or do you want to pad your resume with everything you can? I know people that play video games for hours every day and people who don’t have any free time, even on weekends. \n\nSocially, college is a much better experience for almost anyone. It is a little different during the pandemic, but finding friends you vibe with is amazing. \n\nDon’t be discouraged by the idea of burnout in college!! Learn how to study effectively and take care of your mental health, especially around exam times.\n\nEdit: word",
      "author": "figurespeller718",
      "created": 1633487655,
      "upvotes": 1,
      "replies": {}
    },
    "hfk7t10": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfk7t10/",
      "text": "If you took multiple APs or IB diploma then the workload might not feel super different but like someone said, you are expected to be pro active. Plus there’s the whole setting up yourself for a nice internship/job side of college.",
      "author": "WalmartDarthVader",
      "created": 1633489687,
      "upvotes": 1,
      "replies": {}
    },
    "hfk8hnp": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfk8hnp/",
      "text": "For me I just had to become a little more motivated. Often I have a lot of free time which is nice but can get dangerous. I'm in my last semester with a job lined up and feel like a senior in highschool with major senioritis so I guess that doesn't go away.",
      "author": "bgbgb_",
      "created": 1633490039,
      "upvotes": 1,
      "replies": {}
    },
    "hfkbqwo": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfkbqwo/",
      "text": "It gets easier for sure. I was an all AP student and I was closer to burnout then, than as a college junior now. You start studying things you’re interested in and you live with your friends so your social life is better regardless. Join Greek life, get involved, and choose a major you love and you’ll have a great time in college.",
      "author": "joc307",
      "created": 1633491780,
      "upvotes": 1,
      "replies": {}
    },
    "hfkf8h8": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfkf8h8/",
      "text": "For me, freshman year was academically easier than junior year of high school for the most part. The biggest thing for me was learning how to use my free time, because you will have more and won’t have parents around to nag you about school work or chores so you will have to be the one to actually get this done. As a STEM major my classes got more difficult afterwards and some weeks I definitely experience burnout multiple times a semester, but you learn to power through it. Socially, I already knew some people at my university, but it might take a sec to make friends, but by sophomore year I had a good set of friends and definitely started to go out more than I did in high school (if that’s your thing). Joining clubs, possibly Greek life, and talking to people in your classes and dorm will help with this.",
      "author": "desba3347",
      "created": 1633493821,
      "upvotes": 1,
      "replies": {}
    },
    "hfkr5yr": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfkr5yr/",
      "text": "Lmao, I wish",
      "author": "tatertot-59",
      "created": 1633502186,
      "upvotes": 1,
      "replies": {}
    },
    "hfku1mj": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfku1mj/",
      "text": "The workoad is definitely more and more challenging. But if you chose a major that you are passionate about you will actually enjoy what you are doing. I had projects i haf no idea how to even start in and was very stressed but honestly once you get the hang of it youll actually find thats its more exciting than stressful if you like what you do. As for the loneliness, im a second year who has gone on campus once so cant really speak to that hahaha",
      "author": "reskort-123",
      "created": 1633504599,
      "upvotes": 1,
      "replies": {}
    },
    "hfl110r": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfl110r/",
      "text": "It is get easier in school if you find a education program that suits with your profile, for example if you are into entrepreneurship, you can choose a bachelor in entrepreneurship. then it will be easy for you because you have chosen somthing that you like",
      "author": "NadeePSE",
      "created": 1633511197,
      "upvotes": 1,
      "replies": {
        "hfl12o5": {
          "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfl12o5/",
          "text": "like PARIS SCHOOL OF ENTREPRENEURSHIP, They invest on you",
          "author": "NadeePSE",
          "created": 1633511243,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfl2y5j": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfl2y5j/",
      "text": "Depends on what you going into, I know my friends that went into Police Foundations or whatever it's called, said the elective classes were the hardest part. \n\nWhile us in the Engineering fields are doing 5 to 8 courses a semester, at least 4 of them have labs to be done every week or two. Graded assignments for basically all mandatory classes, that is due every 2 or 3 weeks. Plus all the lectures we have to absorb. Also have to hope our elective teacher doesn't make us write essays or stuff that will take more than one homework session to finish.\n\nDon't get me started on Midterm/Final exams or group project BS, if you are unlucky enough to get a shit prof, that assigns you group or has no exam prep time available. You are in for a world of hurt.\n\nThough I did have enough time to work fulltime and chill with friends in the same program.",
      "author": "Rj_owns",
      "created": 1633513042,
      "upvotes": 1,
      "replies": {}
    },
    "hfl9qg6": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfl9qg6/",
      "text": "Unfortunate that my first year have been online and still hoping to be present in college by the mid sem this year, I have heard from seniors that when you're with friends, studies and homeworks become easier to do (group study effects) and I believe that's true, from it's proof I witnessed during school days.",
      "author": "visionary_shyam",
      "created": 1633518665,
      "upvotes": 1,
      "replies": {}
    },
    "hflaf4s": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hflaf4s/",
      "text": "More like u get better in college",
      "author": "Razansmeak",
      "created": 1633519122,
      "upvotes": 1,
      "replies": {}
    },
    "hfml6id": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfml6id/",
      "text": "Depends on your major and what you did in high school. \n\nHigh school, I did IB and band. I was in school from 7AM to 7PM every single day. I had a ton of homework, projects, essays, assignments for school. I had stuff for band I had to do. Exams to study for every week. It was terrible. \n\nCollege, I’m taking 16 credits this semester while being a full time flight student. Even the week before my flight instructor practical test (considered the hardest test in a pilots career, eight hour long test with oral and flight portions), I STILL didn’t experience anything close to the stress I had in high school. Because I was passionate about the work. I enjoyed studying. And I also have all online classes so I don’t even have to go anywhere. \n\nSocially though, high school was way better for me. Grew up with the same people so we got to know each other.",
      "author": "microfsxpilot",
      "created": 1633541053,
      "upvotes": 1,
      "replies": {}
    },
    "hfmr7yc": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfmr7yc/",
      "text": "It depends on your major and also the instructor. Mine is more business related where assignments are more how much work is given versus how difficult the work actually is.",
      "author": "DammieIsAwesome",
      "created": 1633543581,
      "upvotes": 1,
      "replies": {}
    },
    "hfmwnaa": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfmwnaa/",
      "text": "depends on the classes you take and your field of interest, but in my case the workload is a bit more and totally doable. \n\nsome classes will be heavily based on writing and quizzes, others readings and discussion. either way, at least in my case, it feels like less because there’s less busywork and more assignments geared towards actually retaining information.",
      "author": "summerinsummerisle",
      "created": 1633546016,
      "upvotes": 1,
      "replies": {}
    },
    "hfn3vd5": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfn3vd5/",
      "text": "To be honest high school was a cake walk for me I never felt burnt out or anything but college absolutely drained me however I only felt drained when I went to college full time and worked at the same time but at the time I was an engineering student and the first two years were extremely hard and I ended up quitting my job to focus on my last two years but turned out the last two year we’re actually manageable so I always had a set schedule where I studied all week so I can go out on weekends but let me tell you I had the best experience in college and I’m so grateful that I did. It’s been a year since I graduated and I miss college days all the time because life was much simpler for me but now it’s basically just work, paying bills and at the same time it’s a nice feeling to see your hard work in college paying off. \n\nSo good luck and never stress out remember college is not hard but it’s challenging so do yourself a favor and know how to time manage your day. Also remember everyone is looking for a friend in college so expose yourself to people cause they will be the people to cheer you up and help you study.",
      "author": "dyalah",
      "created": 1633548989,
      "upvotes": 1,
      "replies": {}
    },
    "hfn684z": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfn684z/",
      "text": "There’s wayyyyy less homework in college than in high school. The material is harder but it’s less stressful to learn it since most of the learning happens inside of the classroom. I’m a junior neuroscience major and only have a few hours of homework a week. I’d say the majors with the most homework are comp sci, anything math/physics-related, and humanities. Anything in the life sciences is usually pretty chill with homework.",
      "author": "ekaplun",
      "created": 1633549973,
      "upvotes": 1,
      "replies": {}
    },
    "hfn9mt8": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfn9mt8/",
      "text": "Compared to high school, college is heavier in terms of workload. From my experience, senior year was kind of a drag for me, I didn’t study much, but now I started college this year and I can tell you it requires more studying. \n\nMy one regret from senior year is not having better study habits to start college strong. If you can resist senioritis and start studying more now, you’ll be in a better position when you start college.\n\nSome good tactics for studying include self-testing on knowledge you learned in class (one of the most effective methods for studying) and (as difficult as it may seem senior year of high school) paying attention in class. Doing those things will better prepare you for college and will allow you to have good study habits going right into college. Hope this helps!",
      "author": "FlotPlays",
      "created": 1633551398,
      "upvotes": 1,
      "replies": {}
    },
    "hfqtutf": {
      "link": "/r/college/comments/q26cxg/does_it_get_easier_in_college/hfqtutf/",
      "text": "Some VERY important things that successful students do that burnouts do not:\n\nTactfully choosing manageable class schedules\nLearning how you study best\nActually learning time management  \n\nI’m working on my masters so I’ve been around the block. Yeah, I’m tired, too. But I’ve definitely become a more efficient student over the years and it’s made things way easier. Like, the movie trope about just spending 10+ hours in the library? Unrealistic. Learn to take effective breaks and compartmentalize school time and free time.",
      "author": "famous_shaymus",
      "created": 1633623836,
      "upvotes": 1,
      "replies": {}
    }
  }
}