{"sid": "pwsge6", "link": "/r/college/comments/pwsge6/withdraw/", "title:": "Withdraw", "text": "\nI have 4 W’s from Fall 2020 due to having COVID, which made me fall behind in my classes. I took a gap semester off and am currently attending a new university, starting from Fall 2021. I’ve had depression and anxiety since middle school, but wasn’t clinically diagnosed until this summer. I know it’s only been 1 month since school started, but I’m feeling overwhelmed and tempted to just drop out of all my classes for the semester (but I won’t bc my parents would kill me). I want to become a psychiatrist because as someone who has mental health issues, I want to help people who are experiencing similar things. Idk what to do", "author": "rilxo", "created": 1632782379, "retrieved": 1632800138, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hejn9li": {"link": "/r/college/comments/pwsge6/withdraw/hejn9li/", "text": "as a psych major, it sounds like getting a counseling certificate or masters would be a better fit for you. Psychiatrists don’t give therapy, they diagnose & do medication management. If that’s the route you want than psychiatry would be a good fit, but for therapy, you don’t need to become one.", "author": "rynpickles", "created": 1632794531, "upvotes": 1}, "hejd6hh": {"link": "/r/college/comments/pwsge6/withdraw/hejd6hh/", "text": "Take less classes! Don’t withdraw from all of your classes. Just take it slowly. I did the same thing when I first went to college. I overwhelmed myself and my schedule, kept thinking I needed to take x amount of classes to “stay on track” but the truth is, I needed to take it slow and get good grades.\n\nIdk if you have a planner or like a make shift to do list but planning out what you need to do every week has helped me so much. It can be overwhelming to look at sometimes but it does help me evaluate what is a good amount of work for me to do vs what is too much and can help you decide what class to drop or how many classes you should take. It really helps time management and gives you structure.", "author": "shoelaceys7373", "created": 1632789916, "upvotes": 2}}}