{
  "sid": "qoptkq",
  "link": "/r/college/comments/qoptkq/im_need_of_a_better_graphing_program_than_excel/",
  "title:": "I’m need of a better graphing program than excel",
  "text": "Hi, science major here and idk where to ask this. What is your favorite free graphing program (or one you can get for very little money)? I used to use logger pro and I loved it but now it isnt free anymore :((\n\nI need something that can both scatter plots/line graphs and bar charts. And: super important -> I need to be able to do different sized error bars for each data point <-",
  "author": "subwaytuna666",
  "created": 1636295922,
  "updated": 1636655783,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjohyhc": {
      "link": "/r/college/comments/qoptkq/im_need_of_a_better_graphing_program_than_excel/hjohyhc/",
      "text": "You are going to hate me for recommending this (which I totally understand), but R is incredible once you learn to use it. And given that you’re a science major, it would be well worth your time to start learning it.",
      "author": "Harddicksavage",
      "created": 1636297411,
      "upvotes": 6,
      "replies": {
        "hjotc8o": {
          "link": "/r/college/comments/qoptkq/im_need_of_a_better_graphing_program_than_excel/hjotc8o/",
          "text": "Cool, thanks im a newbie so never heard of it. It looks awesome",
          "author": "subwaytuna666",
          "created": 1636302029,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjow50c": {
      "link": "/r/college/comments/qoptkq/im_need_of_a_better_graphing_program_than_excel/hjow50c/",
      "text": "Many universities have subscriptions to different data tools. My campus has Tableau, SPSS, all of the Microsoft suite, and a few others. There's an office on campus that helps people use them correctly too. \n\nI might ask the faculty in your department what they use, since they'll likely be doing it for their research as well. Each field has its own standards of what is traditional.",
      "author": "TheJaycobA",
      "created": 1636303149,
      "upvotes": 1,
      "replies": {}
    }
  }
}