{
  "sid": "q6yrkp",
  "link": "/r/college/comments/q6yrkp/i_dont_know_what_to_do_with_my_fulltime_student/",
  "title:": "I don't know what to do with my fulltime student status. Should I drop out?",
  "text": "I'm pursuing my BS in Chemistry, a field that I love - and I'm absolutely dying. I'm taking forever to earn my degree as I switched majors at an inconvenient time (spent a year of just doing basic classes irrelevant to chem but requires for a BS), and during quarantine I essentially would enroll full time, only to withdraw down to two classes because my mental health was failing, and to comply with my scholarships and grants requirements. So I'm essentially two years behind. \n\nI'm sick of school. I love lab, people and learning, but I just can't handle classes while having financial instabilities and working part time on and off. Along with keeping my depression in check. \n\nI wake up miserable, can barely do assignments, and I feel as if I'm in Hell. Part time isnt an option per my financial  aid. I could drop put and try my luck with full time, chemistry related jobs that'll accept me. But, my dad would be so disappointed in me - I'm about to cry just thinking about it. \n\nI don't think I can continue like this. What the hell should I do?",
  "author": "GloopBeep",
  "created": 1634082513,
  "updated": 1634588910,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgf65tk": {
      "link": "/r/college/comments/q6yrkp/i_dont_know_what_to_do_with_my_fulltime_student/hgf65tk/",
      "text": "i went through the same exact thing as a bio major and i completely understand how you feel. most people don't understand how depressing college can be for some people. i dont think you should drop out at all. especially if your grades are good. take a semester off and get your mind right and figure out what you actually want to do. you got this",
      "author": "chefmoyarde",
      "created": 1634083352,
      "upvotes": 2,
      "replies": {}
    },
    "hgf68m9": {
      "link": "/r/college/comments/q6yrkp/i_dont_know_what_to_do_with_my_fulltime_student/hgf68m9/",
      "text": "It will be very difficult to find a job in chemical industry without at least a bachelors. Possibly just lab assistant jobs where all you are allowed to do is clean glassware, even that could be rough. \n\nAcademic research jobs require degrees, no two ways about it.\n\nI have a B.S in Chem and couldn’t find a job for over a year, unless you already have something lined up then do not expect this it happen. I’m not trying to be rude, just real.\n\nTake a semester or two off to work though everything that’s going on, don’t just drop out.",
      "author": "goatboat_",
      "created": 1634083390,
      "upvotes": 1,
      "replies": {}
    }
  }
}