{"sid": "psq2u6", "link": "/r/college/comments/psq2u6/is_my_professor_shit_or_am_i_missing_something/", "title:": "Is my professor shit or am I missing something?", "text": "In my bio class I have taken extensive notes each week for my weekly quiz and labs. These notes are taken from the PowerPoints he has provided. In addition to the PowerPoint notes, I have downloaded the book that is optional and taken notes from the designated chapter. Every. Single. Test and quiz has only around two questions from what we have covered.  \nEach week I am taking around 5-6 pages of notes.", "author": "Komaedaisgay77", "created": 1632252609, "retrieved": 1632946578, "over_18": false, "upvotes": 14, "upvote_ratio": 1.0, "comments": {"hdszpb1": {"link": "/r/college/comments/psq2u6/is_my_professor_shit_or_am_i_missing_something/hdszpb1/", "text": "I'm not sure if you're exact situation, but what I can say is that from how you described it out sounds like you're memorizing the notes and looking for every question to be regurgitation of that information.  I'd like to think that the other questions are applying/using that information and you're not able to do that.  That is the most common reason my students do not perform week in the beginning of my classes. They are used to just spitting back west they memorized, but they have no idea what the information really means or how to use it.", "author": "GriIIedCheesus", "created": 1632282503, "upvotes": 1}, "hdrtua1": {"link": "/r/college/comments/psq2u6/is_my_professor_shit_or_am_i_missing_something/hdrtua1/", "text": "[deleted]", "author": null, "created": 1632262109, "upvotes": 7}, "hdrtm0m": {"link": "/r/college/comments/psq2u6/is_my_professor_shit_or_am_i_missing_something/hdrtm0m/", "text": "I had the same problem in biology. Nothing the professor lectured on would be on the quizzes. I bombed them all. I later found out that the department head made the tests. So you practically had to know everything in every chapter. A few students did okay but me and others didn't. I don't do well with quizzes that cover 2 chapters. In biology it's extensive.", "author": "LikelyWriting", "created": 1632262003, "upvotes": 2}, "hdrgk03": {"link": "/r/college/comments/psq2u6/is_my_professor_shit_or_am_i_missing_something/hdrgk03/", "text": "Directly ask your professor what you should be studying. If he doesn't tell you, ask another way. \n\nI think this is an interesting thing I see with younger people going to college. They just seem not to push those things. The professor is who you're paying to educate you. \n\nI've got a professor who is terribly absent and writes the most vague fucking questions while expecting a perfect answer. I literally send every question he asks me back to him. There's no animosity between us, but I make DAMNED sure I'm getting what I need to excel. At first, he'd only answer my questions with short return emails until I figured out that you need to give him everything you've got done for him to help. \n\nAsk the professor. Find out how they work. There's a method to their madness or they're just fucking horrible. In that case... beats me.", "author": "Awkward_Mail_2786", "created": 1632256356, "upvotes": 3}, "hdratgz": {"link": "/r/college/comments/psq2u6/is_my_professor_shit_or_am_i_missing_something/hdratgz/", "text": "You are getting so much more out of the class than everyone else. Money well spent.", "author": "CindsSurprise", "created": 1632253986, "upvotes": 2}, "hdr7mc4": {"link": "/r/college/comments/psq2u6/is_my_professor_shit_or_am_i_missing_something/hdr7mc4/", "text": "I'd ask other students in your class if they are experiencing something similar.", "author": "Gray4004", "created": 1632252675, "upvotes": 8}}}