{
  "sid": "qcs99f",
  "link": "/r/college/comments/qcs99f/am_i_considered_a_resident_if_i_am_an_out_of/",
  "title:": "Am I considered a resident if I am an out of state student who lives in housing endorsed by my school?",
  "text": "So its time to fill out the fafsa and I am currently in my first year of college. I am still financially dependent on my parents but now this has me a bit confused. My family lives in Georgia but I moved to Pennsylvania into the University Commons next to my school (not a dorm).  Am I considered a resident of Pennsylvania? Do I need the license plate and driver's license to say Pennsylvania on it now? I haven't even applied for any kind of medical insurance because I dont know if I am considered a resident.",
  "author": "Ibsael",
  "created": 1634824221,
  "updated": 1634849240,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhhq4g4": {
      "link": "/r/college/comments/qcs99f/am_i_considered_a_resident_if_i_am_an_out_of/hhhq4g4/",
      "text": "No you’re not a Pennsylvania resident. You need to establish residency there which includes a drivers license and getting your car registered in PA. If you’re dependent of your parents you are likely a resident of the state they’re in. Also you can be a resident of a state but still be out of state for tuition purposes",
      "author": "Concerned-23",
      "created": 1634825182,
      "upvotes": 1,
      "replies": {}
    },
    "hhinhmy": {
      "link": "/r/college/comments/qcs99f/am_i_considered_a_resident_if_i_am_an_out_of/hhinhmy/",
      "text": "Best thing to do is to make a quick call to your university's financial aid office.  The staff there answer this question and others like it about a thousand times per day.  My sense is that you probably don't qualify as a PA resident yet, but your college will be able to give you definitive information as to what makes a resident vs a non-resident.  Good luck.",
      "author": "ChemMJW",
      "created": 1634838916,
      "upvotes": 1,
      "replies": {}
    }
  }
}