{"sid": "l5qa7x", "link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/", "title:": "They say the school is not making enough money, but every year some higher ups get pay raises and a bonus. Is my school the only one that does this?", "text": "$100,000 pay raise, a contribution to 415(m) account, and a $25000 bonus annually. And a lump sum payment. I'm trying to make sense of it all.\n\nFor the record, tuition goes up around 3% annually at the school before the pandemic, don't know what it's like now.\n\n*This is written from the perspective of a student*\n\nEdit: I can understand how hard it is to run a college moreover get the funding. A bonus is justified, but a $100,000 pay raise on top of the bonus is mind boggling (to me that is).\n\n\nEdit: after reading all these comments about people's experiences and the impact of this pandemic on everyone's lives, it does pain me and it weigh heavily on my heart. Please please please take all the time you need to heal. I apologize if this post caused trigger, anger, resentment. I know I can't do much, but I pray things do get better. Hang in there.", "author": "TheFriendlyAmoeba", "created": 1611702463, "retrieved": 1632947356, "over_18": false, "upvotes": 1023, "upvote_ratio": 0.99, "comments": {"gl01l6s": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gl01l6s/", "text": "Hey honest question:  Why are you going to college?  Is it to just learn (you can get that from Wikipedia), or to increase your future earning potential?\n\nAnd with that in mind, when you finally reach your best earning years, how would you feel about some 18 year old complaining about the fruits of your labor that you're now reaping, after so many years?  SO that they can save some money, to get to where you are now...", "author": null, "created": 1611782028, "upvotes": 0}, "gkzohqm": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkzohqm/", "text": "*but but if we don't pay the president a fat bonus, they'll leave!* oh well", "author": "okThisYear", "created": 1611776995, "upvotes": 1}, "gkz8fmg": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkz8fmg/", "text": "I am an international student, and so I have only myself to blame for coming to this country and its insanely expensive colleges (although I am in a public university).\n\nBut we don't actually have to put up with this.  We can strike, we can organize, we can refuse to pay fees until certain demands are met.\n\nMost Americans I meet are very skeptical of this sort of thing. But you can't have a college without the students. We have a say. Does your school have a student union?", "author": "whatimjustsaying", "created": 1611770403, "upvotes": 2}, "gkxlpt7": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkxlpt7/", "text": "My university is in the middle of cutting three entire departments (a little over $500k) while splurging $1.1 million in executive bonuses. The university president boasts about how he has not raised tuition in over two years, but at this point he is actively defunding our academics and making $600k a year doing it.", "author": "yellowcard-igan", "created": 1611743023, "upvotes": 5}, "gkxfiyo": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkxfiyo/", "text": "I simply find outrageous that my uni is charging the same tuition fees, after a year of online classes. It's ridiculous.", "author": "thatkafkaguy", "created": 1611737406, "upvotes": 1}, "gkx9hn1": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkx9hn1/", "text": "Schools never teach people about money!! “If you dont find a way to make money while you sleep, you’ll work until the day you die”", "author": "cmomkong", "created": 1611732141, "upvotes": 0}, "gkx3395": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkx3395/", "text": "My school has a $1 B endowment but still raises tuition and fees every year. I’ll graduate with $60k in debt. Hooray!", "author": "grenada19", "created": 1611727247, "upvotes": 3}, "gkx1pyu": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkx1pyu/", "text": "My school (public liberal arts small college) has frozen the price of tuition three years in a row but I’m sure the higher ups make a lot.", "author": "rainydayinmay9", "created": 1611726297, "upvotes": 1}, "gkx1clb": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkx1clb/", "text": "Just go to Purdue where the tuition has been frozen for like the past 12 years!", "author": "french-wannabe", "created": 1611726046, "upvotes": 2}, "gkx03ld": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkx03ld/", "text": "Administrative bloat is one factor, but [severe declines in state support](https://www.insidehighered.com/news/2015/05/05/report-says-administrative-bloat-construction-booms-not-largely-responsible-tuition) are the main reason higher ed budgets are tight.", "author": "_The_Professor_", "created": 1611725212, "upvotes": 4}, "gkwzwo0": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwzwo0/", "text": "Tbh 100,000 is probably nothing for a school. It’s like 5-6 students yearly tuition in Canada. I’m guessing even less for America", "author": "MaleficentDistrict22", "created": 1611725084, "upvotes": 3}, "gkwyu61": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwyu61/", "text": "welcome to adulting. My husband is one of the low guys. Does a ton of work for his school. Saves them a ton of money and they still pay him jack sh**. They'll come up with any excuse. Only the top guys make the big bucks.", "author": "Glad_Speed_1078", "created": 1611724390, "upvotes": 6}, "gkwyk6b": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwyk6b/", "text": "I'm pretty sure it's clear that most colleges are businesses. Us as students are their customers, paying them tens if not hundreds of thousands of dollars for a piece of paper, which unfortunately leaves many of us in crippling debt for years to come.\n\nI'm grateful that for me, college tuition is not an issue, but many others suffer from tuition and other exorbitant fees.", "author": "MansaMusa333", "created": 1611724210, "upvotes": 8}, "gkwvqfb": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwvqfb/", "text": "This year the university I work at granted us all our 3% “cost of living raise” sent out to everyone their new salary for the year... then took it back. Took away that money from every employee. Their reasoning was to just “hold on to it” just in case. No one but the higher ups will see that money. \n\nIn my department specifically they have cut 1/3 of our part time help (from 6 to 2), with plans to cut those two out this year as well. They will also “move around” my small team of three people.", "author": "uglybutterfly025", "created": 1611722456, "upvotes": 5}, "gkwu8t6": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwu8t6/", "text": "Tuition will continue to rise so long as people can get loans for any amount of money. Pretty wild we let 18 year olds make one of the biggest financial decisions of their lives a few months after making them raise their hand to go to the bathroom. Remember, you cannot erase student debt even in bankruptcy.", "author": "MsPrincessConsuela", "created": 1611721592, "upvotes": 66}, "gkwqhl3": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwqhl3/", "text": "The emergency fund at my school is empty this semester.", "author": "Melonpan_Pup442", "created": 1611719535, "upvotes": -1}, "gkwo10z": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwo10z/", "text": "In the meantime, adjunct faculty are making 2500 USD per 3 credit hours course, or 1500 for 1 credit-hour course (not per month, but for the whole course), no health plan, no vacations, no sick days..", "author": "iamnewhere2019", "created": 1611718226, "upvotes": 18}, "gkwml7d": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwml7d/", "text": "College is a business. They really  don't care about education. They want the money to build the best campuses. To attract  the most students. To get the most money.  Tuition  will increase  and the higher ups will be driving  new cars. The following  semester. \nThe excuse they used to increase  Tuition  when I was in school. We are increasing  Tuition  to make financial  aid  better.", "author": "LegendkillahQB", "created": 1611717476, "upvotes": 15}, "gkwmgjg": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwmgjg/", "text": "They also copped millions in cares money", "author": "Adhdicted2dopamine", "created": 1611717408, "upvotes": 9}, "gkwkfk9": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwkfk9/", "text": "My university is constantly building new learning centers, giving out bonuses to higher ups, and celebrating donors every year.\n\nDespite that they still sent me an email yesterday to \"get ahead of the game in giving to the university\", along with a cute graphic telling me what would I rather spend $10/day on, coffee or \"cementing my legacy\" lol", "author": "blueangrygoose", "created": 1611716370, "upvotes": 87}, "gkwe3ar": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwe3ar/", "text": "I go to a smaller private school (below 5k students) and the former president of school was making close to 700k a year (on top of other benefits) and it says that he got a 6 million dollar retention package a few years before retirement. The amount of money some people make in higher education is ridiculous.", "author": "munderhill22", "created": 1611713219, "upvotes": 99}, "gkwdugl": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwdugl/", "text": "This is a part of how universities function under capitalism. They are a business first and a place of learning second", "author": "Gerardo1917", "created": 1611713097, "upvotes": 69}, "gkwc9ym": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkwc9ym/", "text": "It's rather simple when you actually break it down financially. Those positions getting bonuses/raises are a lot different than most faculty positions in the sense that they are more performance oriented and based on creating value. The school pays well for a head of marketing or university president because they expect that it will pay itself back and more via enrollment and alumni donations. So you have to consider it in terms of what they are getting back from the investment and not just what they are paying to keep those people. The net benefit is generally supposed to be positive even when they pay them a ton of money. It might not always end up like that, but generally that happens if the board is picking good people. They might get paid $300,000 more than a faculty member but they might also bring in a few extra million to the university each year compared to other people they could have hired (this is the goal when they look for a president, at least).\n\nUniversities have a board of regents or trustees and those people oversee the hiring of university presidents. They are tasked to do what is best for the university in the long-term and that often includes paying more for a certain person when it makes sense as an investment. Think about it this way: would you rather hire a $50 accountant that projects $300 in tax savings or a $500 accountant that projects $1200 in tax savings?", "author": "br1039", "created": 1611712306, "upvotes": 9}, "gkw61oe": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkw61oe/", "text": "Meanwhile I teach your classes and I drive a 16 year old vehicle....", "author": "GriIIedCheesus", "created": 1611709217, "upvotes": 167}, "gkw5xrz": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkw5xrz/", "text": "When we first started seeing the pandemic's impact on the US economy, my school reduced student employee hours from 40 to 10. Not a single admin took a pay cut with their 6 figures. Instead they let already struggling students struggle more.", "author": "SherAlex26", "created": 1611709163, "upvotes": 156}, "gkvtl6v": {"link": "/r/college/comments/l5qa7x/they_say_the_school_is_not_making_enough_money/gkvtl6v/", "text": "You just explained the finances of nearly every university and most corporate businesses", "author": "Nickjet45", "created": 1611703271, "upvotes": 531}}}