{
  "sid": "qpmoy7",
  "link": "/r/college/comments/qpmoy7/what_is_the_worst_examples_of_stereotypical/",
  "title:": "What is the worst examples of stereotypical majors that you've seen?",
  "text": "I always hear stereotypes about majors (usually CS/Engineering being either a) antisocial nerds or b) reaaally douchey about their intelligence and Business and co. being dumb/not doing any work) and I'm curious, have you seen these stereotypes in the wild? Of course they don't apply to everyone but im curious if you've seen anybody be the spitting image of their stereotypical major",
  "author": "Dyljam2345",
  "created": 1636404137,
  "updated": 1636655350,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hjuqs0j": {
      "link": "/r/college/comments/qpmoy7/what_is_the_worst_examples_of_stereotypical/hjuqs0j/",
      "text": "Usually the computer science students look nerdy, they’re more awkward and wear glasses and dress very geeky. \n\nThe business students are mostly guys who go to the gym, typically Chads.",
      "author": "dropthemic2003",
      "created": 1636406585,
      "upvotes": 2,
      "replies": {}
    },
    "hjvr9jn": {
      "link": "/r/college/comments/qpmoy7/what_is_the_worst_examples_of_stereotypical/hjvr9jn/",
      "text": "business majors are always the stereotypical frat/gym bro... and they're kinda right lol. everytime i go to the gym most are business majors.\n\nthe art and history majors always have a unique set of clothing and hairstyle. same with music majors. i saw a graphic design major with toys for earrings. \n\nenvironmental science and marine bio majors are a little hippie and most are really into crystals. \n\nnurse and education majors are kinda bossy \n\nhealth majors are always stressed out (makes sense and understandable)\n\nSTEM majors are nerdy\n\n&#x200B;\n\nhonestly all of these are pretty true but you will always find exceptions",
      "author": "Oro-Lavanda",
      "created": 1636422444,
      "upvotes": 2,
      "replies": {
        "hjw87j4": {
          "link": "/r/college/comments/qpmoy7/what_is_the_worst_examples_of_stereotypical/hjw87j4/",
          "text": "Geology would make more sense for the \"into crystals\" bit",
          "author": "SwoleKylo",
          "created": 1636430134,
          "upvotes": 1,
          "replies": {
            "hjw8c8u": {
              "link": "/r/college/comments/qpmoy7/what_is_the_worst_examples_of_stereotypical/hjw8c8u/",
              "text": "true but a lot of people are usually into \"healing\" crystals.",
              "author": "Oro-Lavanda",
              "created": 1636430195,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}