{
  "sid": "qf6cla",
  "link": "/r/college/comments/qf6cla/how_do_you_make_friends/",
  "title:": "How do you make friends?",
  "text": "It's my tenth week of my freshman year and I still haven't made any friends. I have mild social anxiety and already come off as a bit “weird” and awkward to others. \nSince beginning college, I did join one club but that hasn't been very successful. I was also trying to become friends with two other people that live in the same dormitory as me, but they don't seem very interested.\nI understand that I could be putting in a bit more effort towards meeting people, however, I don't even know where to begin or how to overcome my fear of doing so. Does anyone have any tips or recommendations? I'm just tired of being lonely and having no one else to talk to.",
  "author": "HumanDumpsterFire_",
  "created": 1635126478,
  "updated": 1635184184,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hhxr5zv": {
      "link": "/r/college/comments/qf6cla/how_do_you_make_friends/hhxr5zv/",
      "text": "If you have tried a club, you could also try Greek life, it’s definitely a big step, but it could work.",
      "author": "Evan1204",
      "created": 1635127113,
      "upvotes": 2,
      "replies": {}
    },
    "hhxu85c": {
      "link": "/r/college/comments/qf6cla/how_do_you_make_friends/hhxu85c/",
      "text": "last year i started college during covid so just imagine all of this but with super strict rules. i totally understand how u feel. i found my graduating class had a fb gc and i posted my snap on there and met lots of people. since you live on campus put some social media of yours on the door and also add people who have theirs up and just message and ask if they want to hang out. worst that happens is you hang out and dont click and you never have to bring it up again. trust me there are *so* many other people in the same boat as you and you WILL find people.",
      "author": "thomasshclby",
      "created": 1635128696,
      "upvotes": 1,
      "replies": {}
    },
    "hhygi9k": {
      "link": "/r/college/comments/qf6cla/how_do_you_make_friends/hhygi9k/",
      "text": "Find people in your major/pre major classes. Make a study group with em, you'll be seeing them a lot in the next few years. If that works, you can ask to do other stuff after studying for outside of school.",
      "author": "NinjaLorian",
      "created": 1635142888,
      "upvotes": 1,
      "replies": {}
    }
  }
}