{
  "sid": "qgcam6",
  "link": "/r/college/comments/qgcam6/is_anyone_tired_of_all_those_writing_assignments/",
  "title:": "Is anyone tired of all those writing assignments?",
  "text": "I am and honestly I got so tired of doing so many writing assignments that I half ass them especially if they say type 250 words for the first post and 150 for the replying post. Like I just write and make my post sound dumb to get that many words. Surprisingly I still have As in all my classes while I’m doing that. So I was wondering am I the only one that does that or do other people do that too? I despise writing since that is not my favorite subject but I still try to have my assignments done.",
  "author": "Lytzy",
  "created": 1635271464,
  "updated": 1635302385,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hi59igh": {
      "link": "/r/college/comments/qgcam6/is_anyone_tired_of_all_those_writing_assignments/hi59igh/",
      "text": "What year/major are you?\n\nI write minimum 2 7-pagers a week. It's a part of college. You have to show you understand the concepts, not just pick the right answers on a multiple choice test.\n\nTrust me, the writing will help you in the long run. Develop that skill now.",
      "author": "BarIntelligent9156",
      "created": 1635272894,
      "upvotes": 4,
      "replies": {
        "hi5kqwx": {
          "link": "/r/college/comments/qgcam6/is_anyone_tired_of_all_those_writing_assignments/hi5kqwx/",
          "text": "It’s my junior year and liberal studies.\n\nI write a lot of essays which I dislike too but I at least try to get it done.\n\nI try to get better at writing but it’s hard for me to stay focus. Plus my high school did a poor job on teaching me how to understand how to write them. Most of my teachers would just say “okay your going to write about so and so” then they wouldn’t bother helping me improve if I did something wrong. So I just know I need to get it done with the requirements in the rubric.",
          "author": "Lytzy",
          "created": 1635277269,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi589fc": {
      "link": "/r/college/comments/qgcam6/is_anyone_tired_of_all_those_writing_assignments/hi589fc/",
      "text": "If you can bs your way thru writing you may be a gifted writer",
      "author": "MutedInvestigator847",
      "created": 1635272402,
      "upvotes": 2,
      "replies": {
        "hi5iw9z": {
          "link": "/r/college/comments/qgcam6/is_anyone_tired_of_all_those_writing_assignments/hi5iw9z/",
          "text": "Maybe I never thought about that!",
          "author": "Lytzy",
          "created": 1635276561,
          "upvotes": 1,
          "replies": {
            "hi5j3lu": {
              "link": "/r/college/comments/qgcam6/is_anyone_tired_of_all_those_writing_assignments/hi5j3lu/",
              "text": "Remember nothing has to be 100 percent your soul just put down something coherent and use grammarly",
              "author": "MutedInvestigator847",
              "created": 1635276638,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}