{"sid": "bs3vt3", "link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/", "title:": "Went from being on Academic Probation to the Dean’s List (Freshman)", "text": "So my first semester I didn’t try very hard and didn’t study thinking that I could pull the same stuff I did in high school and ended straight up failing half my classes and getting a 1.26 GPA. Over winter break I thought to myself you can do better than that and in the spring semester I applied myself to my studies a lot more diligently, started going to office hours and supplemental instruction classes even if I didn’t think I needed to, and got help from my fraternity brothers who had taken my classes before and ended up getting a 3.57 GPA this semester and got on the Dean’s List. Moral of the story: never give up and you can always do better; even if you failed a couple classes :)", "author": "bradthedouche", "created": 1558623039, "retrieved": 1632802647, "over_18": false, "upvotes": 741, "upvote_ratio": 0.98, "comments": {"eonwzhm": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eonwzhm/", "text": "i did something similar - 3.0 freshman year, 4.33 senior year for a 3.5 cumulative. dean's list at my alma was top 4% of the college", "author": "Core_Four", "created": 1558723640, "upvotes": 1}, "eomjqtd": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eomjqtd/", "text": "never give up bub", "author": "uglyassvirgin", "created": 1558690529, "upvotes": 1}, "eomfk8t": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eomfk8t/", "text": "I had 29 backlogs or failed courses did 22 in 1 year now doing the last 7 .. I am effectively doin in 18 months what I failed in 4 years", "author": "exgreener", "created": 1558687865, "upvotes": 1}, "eom1h6n": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eom1h6n/", "text": "It would be nice if I had friends to help me/study with haha \n\n\nI’d like to be shot", "author": "Basically_Zer0", "created": 1558680011, "upvotes": 1}, "eolw4x5": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eolw4x5/", "text": "I can relate. I did terrible in HS and it discouraged me from going to college because I felt like I wasn’t good enough. I postponed going to college for a few years and then finally had the courage to enroll and I’ve been getting mostly A’s with a few B’s and made it to the deans list. Never thought I could do it but here I am ☺️", "author": "ChicagoChurro", "created": 1558677310, "upvotes": 2}, "eolvzgo": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eolvzgo/", "text": "Thank you for posting this. No really, I really mean it. This motivates me to keep striving. \n\nI have been struggling so badly with my math class because I have dyscalculia (math version of dyslexia). I got a D- in my class and it has killed my hopes of ever becoming the best version of myself that I dreamed about but reading your story is motivating. This fall when I go back I am going to try much better this time and not let myself crash again.\n\nI hope to be like you and be able to make it to the deans list or heck even get a full ride into my dream veterinary school. This makes me so hopeful for the future. Thank you so much! Wish you the best of luck with your life. :)", "author": "JackyG8991", "created": 1558677230, "upvotes": 2}, "eolj6tx": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eolj6tx/", "text": "Congrats! Me too! I was on probation for a scholarship, but similar. Got an email telling me to come pick up my Dean’s certificate today and felt really good", "author": "StarFizzle", "created": 1558671688, "upvotes": 2}, "eokxd8x": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eokxd8x/", "text": "Congrats dude! Big accomplishment there (:\n\nI went through the same thing. Got put on AP last semester from failing 2 classes while pledging. This semester I ended with a 3.5. It's pretty relieving to see you're not the only one who went through it, lol!", "author": "wednessdayy", "created": 1558662965, "upvotes": 2}, "eoksn1a": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoksn1a/", "text": "Are you myself by any chance? Because that also happened to me!!! I slacked off my first semester which was this past fall semester and failed two classes which brought my GPA down to a 1.38. In the spring I passed two of my classes with a B and the other two with an A and now I am no longer in academic probation but I am also on the Dean's List. I guess being put in academic probation was a real wake-up call.", "author": "unclelumbago2", "created": 1558661226, "upvotes": 2}, "eoknwsb": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoknwsb/", "text": "Went from being on academic probation to the Presidents list 👌 good job!", "author": "imbrownbutwhite", "created": 1558659012, "upvotes": 3}, "eoklawd": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoklawd/", "text": "I screwed up big time when I first went to college, I ended up with a 1.25 GPA after 3 semesters. I was then placed on academic suspension for a semester. I ended up taking a whole year off to figure out what I wanted to do, I changed my major from finance to chemistry, and I’ve been on the dean’s list for the past 3 semesters and have had a 4.0 on all 3 semesters, which has in turn raised my GPA to a 3.68. \nIf you think you need a break from school to figure out what you want to do, definitely take it. Never give up and always believe you can do it no matter how badly you’ve screwed up🤓\n\nEdit: Great Job!!!!!!!!! Keep up the great work pal 😎", "author": "zeramy1", "created": 1558657290, "upvotes": 3}, "eokiq8a": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eokiq8a/", "text": "what is your major?", "author": null, "created": 1558655570, "upvotes": 1}, "eokidw0": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eokidw0/", "text": "Congratulations!", "author": null, "created": 1558655347, "upvotes": 1}, "eokdwel": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eokdwel/", "text": "I'm a freshmen too. I think my classes this past semester were just easy by college level standards because I put in just about as much work as I did in high school (which is to say not an exceptional amount), and I ended up acing my exams and finishing with a 3.7. I'm sure next semester will be a smack in the face lol", "author": "Jakeremix", "created": 1558652376, "upvotes": 4}, "eokbdln": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eokbdln/", "text": "Inspirational!", "author": "JustAxel058", "created": 1558650740, "upvotes": 1}, "eok9byc": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eok9byc/", "text": "I just finished my first semester and have no clue what the dean's list is. Can you explain?", "author": null, "created": 1558649459, "upvotes": 1}, "eojuo3v": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eojuo3v/", "text": "I can attest to this as well. Freshman/Sophomore year I fooled around. I ended up changing my major from pre-pharmacy to HA because no way my grades where going to get me into pharmacy school. I ended performing better and being more active such as joining orgs and being more social, connecting with my professors more, etc. Graduated with a 3.25 (really strived for at least cum laude). On top of that I got a deans award (small scholarship) and got accepted to a top school to pursue my masters (I start this fall).\nThere’s a lot truth to “it doesn’t matter how you start, it’s how you finish”, and all other similar quotes and sayings.\nOverall I’m really happy and content with my choices.\nThanks for the post.", "author": "JohnnnyBravo_", "created": 1558643138, "upvotes": 5}, "eojtivq": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eojtivq/", "text": "Are you me? I literally have like 5 semesters of classes spread out over the course of 3 years, and each semester is either sprinkled with FNs or just one class that I got an FN in. \n\nI was suspended for a year back in like 2013. \n\nThis semester I took the two classes I had been struggling with and got A's in both. My GPA was like 1.5 and because of that 4.0 over the spring, I'm now at a 2.5 and feeling a lot better about myself. \n\nI loved your story and I hope that both of us can keep up the good work!", "author": "MermaidAyla", "created": 1558642679, "upvotes": 9}, "eojg8n3": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eojg8n3/", "text": "That is very good!", "author": "theoryofdoom", "created": 1558637458, "upvotes": 1}, "eoj87s9": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoj87s9/", "text": "I can relate to this.  I dropped out twice.  Ended up on the deans list during my final couple years when I finally honed in on a major I was interested in.  I had a 3.8 major GPA and \\*just\\* barely a 3.0 overall after retaking philosophy to balance out my F.  I took Calculus I twice.  Calc 2 twice.  English 1 twice (because why show up for finals when you're passing??)  \n\n\n5 years out of college and I am doing well, working remote making $250 shy of 6 figures.", "author": "lexushelicopterwatch", "created": 1558634368, "upvotes": 41}, "eoj6bzh": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoj6bzh/", "text": "Congrats, I'm in the same boat as you except I've been on dean's list since last Summer and almost about to graduate now. What program are you doing?", "author": "sarumango", "created": 1558633647, "upvotes": 1}, "eoj60sx": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoj60sx/", "text": "[deleted]", "author": null, "created": 1558633521, "upvotes": 1}, "eoj2fm9": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoj2fm9/", "text": "Super cool. How many credits did you do to get that high up? How many credits did you already have if any?", "author": "Bigdstars187", "created": 1558631979, "upvotes": 1}, "eoj0wot": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoj0wot/", "text": "I did the same thing!  0.65 -> 3.67!  Good job, it’s not an easy thing to do!  It’s hard to refocus after a semester like that, at least it was for me.  I had a lot of self doubt going into that second semester, but also a hell of a lot of determination.  Again, congrats!  Keep pushing :)", "author": "pkatess", "created": 1558631246, "upvotes": 71}, "eoix9ai": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoix9ai/", "text": "Good job!", "author": "Pshivvy", "created": 1558629174, "upvotes": 3}, "eoiw9yw": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoiw9yw/", "text": "Your post made me check to see if I got on the dean's list, sadly my 3.5 didn't get me on the list. Congrats to you though!\n\nEdit: A word", "author": "ValdBagina002", "created": 1558628609, "upvotes": 34}, "eoin206": {"link": "/r/college/comments/bs3vt3/went_from_being_on_academic_probation_to_the/eoin206/", "text": "That's awesome! Great job!", "author": "Neat_Description", "created": 1558623215, "upvotes": 120}}}