{"sid": "psv2d7", "link": "/r/college/comments/psv2d7/need_some_advice_on_life/", "title:": "Need some advice on life", "text": "I am really in need of some good advice on what to do with university and life right now. I am currently majoring in computer engineering, I am in my second year. I had switched from computer science over to computer engineering. I am not sure I even want to go down this route for my career, I really want to have a career in something technology related but I am really on the fence on continuing with computer engineering because it has so much math and physics in it and I am definitely not a fan of math. I've been thinking of switching over to information technology, just dropping out in general or struggle through the next 3 years and possibly being miserable. I really disliked coding but maybe because I didn't learn it properly. I feel so lost and stressed, I cried myself to sleep the last 3 nights. On one hand if I graduate then I won't disappoint my parents and will have a stable job but I might be miserable for the next 3 years and possibly the rest of my life, while on the other hand if I dropped out I don't know what I'd really do as a career. I just feel like I'm way too young to even know what I'd want to do for the rest of my life.", "author": "Dankiie", "created": 1632267506, "retrieved": 1632800940, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hdt5n5k": {"link": "/r/college/comments/psv2d7/need_some_advice_on_life/hdt5n5k/", "text": "1. There's nothing wrong with leaving college and coming back later (or not at all).\n\n2. Your degree doesn't determine what jobs you will be able to get. Having a degree in information security, information technology, cyber security, computer science ect.. can get you most positions in the it field.\n\n3. You can get a job in IT with just certifications or showing them projects you have done on your own time.", "author": "LordofDsnuts", "created": 1632286160, "upvotes": 1}}}