{
  "sid": "quw493",
  "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/",
  "title:": "How do I manage to do “bad” on an exam even after studying hard?",
  "text": "Some context is that I’m a psychology major in premed. \nI just took a exam for one of my psych courses and I got a high C. My previous two exams were a B and another high C. But for this exam I studied almost 5 days in advanced. I reviewed lectures, notes, Quizlett flash card, worked with other classmates, etc. I didn’t go out with friends unless it was the library to study. I didn’t go to my college’s football game or go out anywhere. I studied hard for this exam. \n[ I already don’t have much of a social life so I had to give up more than what I had] \nI took it and felt like i would get a high A or even a 100. \nBut no. I got the same damn grade as my previous exams. I don’t know if I’m mad at the exam or myself, probably myself. \nThis is undergrad level work yet I want to put myself into medical school. I genuinely don’t know what to do now.",
  "author": "Skyline-369",
  "created": 1637026713,
  "updated": 1637181418,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.85,
  "comments": {
    "hksr5r1": {
      "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hksr5r1/",
      "text": "Here is my advice: there are two things that you can control when studying, one being how long you study and another is how you study. When you are studying, do you just read over notes or do you relate it to real life? For example, could you explain the concepts from what you studied to someone else? For how long you study, did you study for a couple hours? How long per day did you actually study for?",
      "author": "Dubbstep15",
      "created": 1637027103,
      "upvotes": 11,
      "replies": {
        "hksrym6": {
          "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hksrym6/",
          "text": "When studying i would like talk out the Professor lecture slides as if i was teaching and using my notes along the way. I reviewed the cards and those slides too. And it varied for how long I studied per day. But nothing less than 2 hours at least.",
          "author": "Skyline-369",
          "created": 1637027461,
          "upvotes": 3,
          "replies": {
            "hksssyy": {
              "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hksssyy/",
              "text": "Here is a method I learned from people in med school, its called the Pomodoro Technique. How it works is you do four 25 minute sessions with 5 minute breaks in between, then after the fourth 25 minute session, take a 30 minute break. What this does is it allows you to work with the time you study instead of against it, while also keeping you engaged with the material instead of getting fatigued/distracted. For me personally, I benefit from studying at different points of the day instead of just doing one full session like at night for example. Since this is a question for psychology, I recommend quizlet for flashcards along with the “test” function. I found success with quizlet more times than not.",
              "author": "Dubbstep15",
              "created": 1637027834,
              "upvotes": 9,
              "replies": {
                "hksti7f": {
                  "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hksti7f/",
                  "text": "I’ll try that out then. Thank you",
                  "author": "Skyline-369",
                  "created": 1637028145,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hkuhyl5": {
              "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hkuhyl5/",
              "text": "Are you using materials to study that are already made? Like lecture notes, premade flash cards and stuff like that? \n\nOne thing that's helped me quite a bit is making my own notes and flash cards. Instead of simply using the professor's slides, I write my own notes. I found that just reading their stuff doesn't do it for me. Writing it, with a real pen and real paper, helps me internalize it in a way that I'm used to. It's my language. \n\nI have a Materials and Manufacturing course and it's almost pure memorization. She provides skeleton notes that she adds stuff into during the lecture. I've found that simply sitting there with a pen and notebook making questions out of her lecture notes for flashcards is the best for me. I assume she looks at her own slides and makes questions from them, so that's exactly what I'm doing. That way, my notebook only has questions and answers in it. I take those home and make flashcards and that's how I study. \n\nI think there's something to be said about using previously made materials. I don't find them to be as productive and effective as making your own. I think it's absolutely important to transcribe everything you want to remember. Writing something down in your own words has a strange way of internalizing it. \n\nCollege will always go this way. You'll get a professor and bomb one of their exams. The key here is to be flexible and find what works for them. Every professor demands a different set of skills to pass their course. If your study habits aren't working for that class particularly, it helps to take a good hard look on how to improve and implement those changes.",
              "author": "Awkward_Mail_2786",
              "created": 1637066662,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hksrfcw": {
      "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hksrfcw/",
      "text": "Hey if you honestly put in the effort. Just remember due to cheating they have to change up exams 2 times a year. So the likelihood of them having a mistake in it or making it to hard is possible. I'm senior in Computer science. An unspoken truth about computer science is previous graduates had it easier and didn't have to go through as much information as you. Your degree is probably similar. Fuck GPAs get that paper so an HR department can check that Box you got this shit.",
      "author": "NotStaggy",
      "created": 1637027223,
      "upvotes": 1,
      "replies": {
        "hkssodb": {
          "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hkssodb/",
          "text": "I mean I suppose so. But med school care about that GPA during admission cycles.",
          "author": "Skyline-369",
          "created": 1637027775,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkszjnj": {
      "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hkszjnj/",
      "text": "what class is it?",
      "author": "rynpickles",
      "created": 1637030802,
      "upvotes": 1,
      "replies": {
        "hkt1d3d": {
          "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hkt1d3d/",
          "text": "Biological Psychology.",
          "author": "Skyline-369",
          "created": 1637031618,
          "upvotes": 1,
          "replies": {
            "hkt2dro": {
              "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hkt2dro/",
              "text": "whew, that class wasn’t my forte either so I can’t offer much advice. Everyone has one class that they try hard at but it doesn’t click. I wouldn’t beat yourself up over it if the rest of your grades are generally high. Good luck!",
              "author": "rynpickles",
              "created": 1637032076,
              "upvotes": 2,
              "replies": {
                "hkta3i1": {
                  "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hkta3i1/",
                  "text": "Thank you",
                  "author": "Skyline-369",
                  "created": 1637035702,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkvyklg": {
      "link": "/r/college/comments/quw493/how_do_i_manage_to_do_bad_on_an_exam_even_after/hkvyklg/",
      "text": "Do you get the exam back? Can you see what you got wrong? You need to first figure out what is tripping you up on the exams. It could be anything from the wording to the actual content. If you just don’t understand what the question is asking you or you misinterpreted it, then that means you need to study test taking techniques and how your professor wants you to answer the questions. If it’s the actual content, like you got something wrong because you simply didn’t know the answer, then you need to figure out where that information was previously stated in class. Was the question from a lecture, book, or homework assignment? If you find that the majority of the questions that you’ve missed were from a certain place, then you know you need to study that material more in depth. \n\nI took anatomy and physiology, and I noticed early on that most of the questions were formulated from information from the textbook. I would create flash cards based on the text book and eventually got good at spotting information that looked like it could be a good test question.",
      "author": "JupiterRocket",
      "created": 1637089145,
      "upvotes": 1,
      "replies": {}
    }
  }
}