{
  "sid": "py13l9",
  "link": "/r/college/comments/py13l9/college_freshman_that_cant_cope_with_school/",
  "title:": "college freshman that can't cope with school anymore.",
  "text": "I came into college a cs major and after the first week of school I was in a psych facility for a week because the stress of school (being a cs major) added to my pre-existing depression was too much for me to bear. I switched to a liberal arts major but I can't change my classes till after this quarter is done. I can not handle my precalculus and intro to computer science class. I could continue my intro to cs for another seven weeks but I can't go on with precalc anymore. I have a precalc test on Friday that I know I am going to fail. I am only in my third of week of school and wont mind starting a liberal art class and catching up because I'm a lot better in those kind of things but the period to drop classes and pick up new ones is long gone. \n\nI would drop my precalc class but I need 8 hours to be a full-time student and dropping this class will leave me with 7 hours. I don't know what to do. I don't want to go to the psych facility for a second time . What I'd like to do is replace my precalc class with another class and if possible replace my intro to cs class as well. desperate for any advice",
  "author": "redcityaventura",
  "created": 1632938837,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "herlpes": {
      "link": "/r/college/comments/py13l9/college_freshman_that_cant_cope_with_school/herlpes/",
      "text": "Go to your professor's office hours and talk to them about your situation. They may be able push you through the system on grounds of compassion. I have had to do this myself and I had a very experienced professor who knew how to help me with the school.\n\nAnother option to consider is to drop out of the rest of the semester. Make an appointment with your academic advisor to discuss this because there may be financial issues to consider. You may be able to get a tuition reimbursement with a note from your doctor.\n\nNo matter what happens you can get through it. You must be your own advocate and don't take no for an answer. Your mental health is number one.\n\nGood luck!",
      "author": "PaganMathilde",
      "created": 1632946964,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634057474
}