{
  "sid": "iowwme",
  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/",
  "title:": "Does anyone else feel... strange?",
  "text": "I’ve been doing online college for three weeks now and I’m moving in September 14. During this time I’ve been feeling almost like nothing, like I’m in limbo or in a universe I don’t belong in. I know we’re in very odd times but even still it seems so strange to exist. Nothing that’s happened feels like it was meant to happen, days go by so quickly and I’m losing track of what’s happening in my everyday life. Hopefully moving in will mitigate some of these feelings. Please comment if any of you feel the same way.",
  "author": "NoUeys",
  "created": 1599582911,
  "over_18": false,
  "upvotes": 2140,
  "upvote_ratio": 0.99,
  "comments": {
    "g66g1m6": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g66g1m6/",
      "text": "It seems like everyone is feeling depersonalization/derealization right now.",
      "author": "oasisreverie",
      "created": 1600743236,
      "upvotes": 1,
      "replies": {}
    },
    "g57iyal": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g57iyal/",
      "text": "Try therapy maybe. You need something to ground yourself.",
      "author": "em9694",
      "created": 1600065805,
      "upvotes": 1,
      "replies": {}
    },
    "g4uu98g": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4uu98g/",
      "text": "Yo,\nI'm in the middle of trying to get my FAFSA done, and all this other BS that I was behind on because of a bit of a mental breakdown. I pretty much just wanted to shut the world out and watch Netflix documentaries. \n\nYou're doing great, it's very normal to feel this way, because it is NOT normal what is going on. Even some of my most put-together friends/family are struggling right now, because they are very much the straight-line, A to B, \"OK what's next\", full the schedule to the brim, type of people, and have never deviated. Deviation from your \"normal\" sends a shock through the human brain, and not even that, the entire world! We're all programmed this way.\n\nJournal, if you can, or like. I find it fascinating, that one day I will be able to look back to something I wrote, during a pandemic, et. al. and recount what I survived through. (Albeit, spending a few weeks hiding under a rock). I saw your post, looking for something else, and I just felt like I had to respond/reach out. I get it... You're not alone <3 *virtual hugs*",
      "author": "SouthernLemon",
      "created": 1599853255,
      "upvotes": 1,
      "replies": {
        "g4uupwd": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4uupwd/",
          "text": "Can I also just say, something that has been helping me immensely, is listening to any podcast, youtube, whatever... that is from inspirational speakers, (ones that you like, or can tolerate). As silly as it sounds, but after I get done with one, from say... Casey Neistat, I do feel a little more motivated, and little more positive. It's cheesy I know.. some people have very passionate feelings about these \"inspirational you tubers\"... but hey, we're all different. Test it out, see if it helps, if not, try something else, right? <3 Peace be with you",
          "author": "SouthernLemon",
          "created": 1599853471,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4ozf53": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ozf53/",
      "text": "I feel this 100%. It's so weird to feel like this because it's never happened before. I sometimes feel like I'm floating and waiting for the next day and the next and the next. The only time I don't feel like this is when I'm reading or watching it's always sunny. But other than those times, I feel like nothing.",
      "author": "ArgentinaLostAgain",
      "created": 1599750992,
      "upvotes": 1,
      "replies": {}
    },
    "g4lzsqf": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4lzsqf/",
      "text": "Right now I feel like nothing matters. Like everyone is standing on a table with one leg trying to balance themselves and not fall into oblivion. I am slowly going crazy just sitting here in my apartment staring at a screen for hours on end. I transferred this semester so I don't know anybody at this school, and since there are no clubs meeting right now, all the avenues for social activity are gone. I want to look forward to something but seems like everyday a little less matters.",
      "author": "Ruvikify",
      "created": 1599701951,
      "upvotes": 1,
      "replies": {}
    },
    "g4kl7d7": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4kl7d7/",
      "text": "Literally same. It feels like we are all just existing in some kind of simulation rn. We are all just saying \"oh well\" and getting dragged all over the place by colleges, politicians, whoever and whatever tf comes at us without even acknowledging it.  \n\n\nIt's like we're all in some collective dissociative state. You should research solipsism; it'll blow your mind.",
      "author": "nerdyginger27",
      "created": 1599676498,
      "upvotes": 2,
      "replies": {}
    },
    "g4k62ex": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4k62ex/",
      "text": "I've been moved into my first year of college for about 4 weeks now, and I can definitely say that it doesn't feel real. I would have never expected my college experience to be 1. So lonely 2. Boring enough that days pass by without me realizing and 3. Hurting my wallet even though we are in a pandemic.",
      "author": "YahikoNigata",
      "created": 1599668944,
      "upvotes": 4,
      "replies": {}
    },
    "g4k47fc": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4k47fc/",
      "text": "Yeah it’s like I’m always just waiting",
      "author": "Realistic_Pickle_184",
      "created": 1599668033,
      "upvotes": 2,
      "replies": {}
    },
    "g4jzbh6": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jzbh6/",
      "text": "It feels weird doing only online classes when you don't have much else to do, especially if your used to going to class because it gives you the sense you're doing something of important by leaving your house lol. I'd try doing homework and study in different locations to make it feel like your feeling busy",
      "author": "Memarian22",
      "created": 1599665591,
      "upvotes": 2,
      "replies": {}
    },
    "g4jnbtr": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jnbtr/",
      "text": "I totally agree with what you’re saying. I’ve been feeling the same way as well :( it sucks",
      "author": "Den_sity2000",
      "created": 1599659159,
      "upvotes": 2,
      "replies": {}
    },
    "g4jmtmc": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jmtmc/",
      "text": "I fucking hate online learning.",
      "author": "swollemolle",
      "created": 1599658854,
      "upvotes": 2,
      "replies": {}
    },
    "g4jklmh": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jklmh/",
      "text": "Times like these are when we see the importance of a discipline structure. And how much we relied on college to supply that for us now that we have to do it ourselves. I would recommend the following at least : try to get up at around the same time and go to sleep at around the same time during the week, keep a regular eating (number of meals and time at which they are eaten) schedule, try and get some exercise everyday (preferably some that gets outside in the sunlight haha) , try to engage in some level of person to person interaction every day ( obviously not Covid inducing situations) like talking on the phone with a family member or friend, and lastly keep your space and yourself in good repair (clean, tidy) because this will effect your sense of self respect and motivation.",
      "author": "lameinsane",
      "created": 1599657468,
      "upvotes": 1,
      "replies": {}
    },
    "g4jg2hd": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jg2hd/",
      "text": "Yeah man. Literally have no college friends. It sucks",
      "author": "Sky_Hawk105",
      "created": 1599654348,
      "upvotes": 4,
      "replies": {}
    },
    "g4jffq0": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jffq0/",
      "text": "Feel lost, confused and really sad",
      "author": "MelissaArt94",
      "created": 1599653872,
      "upvotes": 1,
      "replies": {}
    },
    "g4j6jbm": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4j6jbm/",
      "text": "maybe so",
      "author": "phirdeline",
      "created": 1599645344,
      "upvotes": 1,
      "replies": {}
    },
    "g4j623u": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4j623u/",
      "text": "College kid from Australia here, been studying online for around 6 months now whilst in lockdown. This is my first year, and saying it sucks is an understatement. I’ve gone beyond breakdowns and feeling sad, now it’s this weird void of emptiness and feeling like you’re not awake :,))",
      "author": "erineii",
      "created": 1599644789,
      "upvotes": 2,
      "replies": {}
    },
    "g4j3792": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4j3792/",
      "text": "YES I hardly leave my apartment so suddenly my sleep schedule is switched, I don’t fall asleep until 5 AM and won’t wake up until 4 PM unless I have zoom calls the next day - in which I promptly wake up, start my zoom call, and then once it’s over, fall back asleep. Time is weird now",
      "author": null,
      "created": 1599641366,
      "upvotes": 2,
      "replies": {}
    },
    "g4ixoru": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ixoru/",
      "text": "It's because we have lost major parts of the usual structure that makes up our daily lives! Gyms, libraries, schools, even friends are all at least harder to get to nowadays. Study sessions or hangouts are out of the picture, and physical exercise can be straight up forgotten. \n\nIt's really important to keep up that structure in some way, and I recommend CGP Grey's video called \"Spaceship You\" to talk about it in more detail. It's a very real problem that can lead to a slow drift into abyss, and I hope this helps. \nGood luck!",
      "author": "hairypotdirt",
      "created": 1599635111,
      "upvotes": 1,
      "replies": {}
    },
    "g4ixoj8": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ixoj8/",
      "text": "It’s very sci-fi-ish lol.Everyones wearing masks on campus and classes are so small like some dystopian reality where the world is on the brink of destruction and death",
      "author": "Annaranthe",
      "created": 1599635104,
      "upvotes": 3,
      "replies": {}
    },
    "g4ivy4c": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ivy4c/",
      "text": "Glad to hear I'm not the only one feeling this way. Currently taking an EMT course and Chemistry (a subject I truly struggle on). Every day seems stressful as hell and I wake up dreading the amount of work that I have to engage in. The worst part is I feel like none of the information is sticking in my head. But anyways, good luck man, we are in for a very interesting semester.",
      "author": "champion117",
      "created": 1599633374,
      "upvotes": 1,
      "replies": {}
    },
    "g4iuqll": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iuqll/",
      "text": "I move in on the 17th, my masters course starts on the 25th.\n\nYeah I'm feeling a little weird. Never used Zoom and the first time I'll meet my new course-mates will be through it.\n\nBut I'd rather this and be safe than be forced to attend 100+ people lectures again.",
      "author": "Elastichedgehog",
      "created": 1599632228,
      "upvotes": 3,
      "replies": {}
    },
    "g4iqzeh": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iqzeh/",
      "text": "Yep however, I take online courses during the summer so I’m kinda used to it. It does feel extra weird to have it happen for so long though. And to not have the classes be halfway over (I take six week classes in the summer and we’ve been in class for three weeks already). I swear, these full semester online classes are as hard as my six week online summer classes though (at least at my school). I’m drowning in lectures and discussion boards.",
      "author": "huskeya4",
      "created": 1599628933,
      "upvotes": 1,
      "replies": {
        "g4ja5ko": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ja5ko/",
          "text": "Lectures and discussion boards are the traditional form of education’s attempt to do the exact same thing online. These didn’t work that well in person and are orders of magnitude less effective online.",
          "author": "billgx",
          "created": 1599649230,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4iq4w7": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iq4w7/",
      "text": "We will probably forget a lot of what has happened during 2020 (maybe 2021), I think we’ll remember the main things but not details. I struggle to remember back a few months tbh. Everything that has happened this year has been a lot to take in and pretty traumatizing. I wouldn’t be surprised if we can’t remember very much about these times when all of this is over.",
      "author": "drinksomeaguagirl",
      "created": 1599628243,
      "upvotes": 1,
      "replies": {}
    },
    "g4iq4mq": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iq4mq/",
      "text": "as someone who graduated during covid and still has no job, i completely understand. you’re craving structure and potentially a new environment. you’re eager to move forward but being home and starting college doesn’t feel like a new chapter. i understand. i promise it gets better! you’ll find things you enjoy to provide yourself with some structure. i am in love with my skin care routine— it is the beginning and end to my day. also always make your bed :)",
      "author": "discotiddies14",
      "created": 1599628238,
      "upvotes": 1,
      "replies": {}
    },
    "g4ipo5m": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ipo5m/",
      "text": "I've done all my work on time and seem to be caught up on the material but I still don't feel like I am, like I was supposed to turn in something last night every day. \n\nHopefully it gets easier as the semester chugs along and I get used to the fully online aspect.",
      "author": "Verpiss_Dich",
      "created": 1599627879,
      "upvotes": 1,
      "replies": {}
    },
    "g4ikmmc": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ikmmc/",
      "text": "Definitely. I like feel like I’m stuck, like it’s all just been one very long day that I can’t escape. Nothing good happens anymore and it’s making me feel numb",
      "author": "lillends",
      "created": 1599624224,
      "upvotes": 1,
      "replies": {}
    },
    "g4ik5cl": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ik5cl/",
      "text": "I think everyone feels strange right now. Please don't give up. I'm a college instructor, and I do feel sorry that my students have to spend part of their college time in a state that is anything but normal. Believe me, your professors feel strange too. We may be smiling on video conference, but internally, we are having a hard time with not being able to walk around and feel the energy of the classroom, get close to our students so that we can help them with a problem or answer a question, conduct class team activities etc. It's tough. Just keep going. We'll make it through.",
      "author": "Violet_Atlas",
      "created": 1599623901,
      "upvotes": 1,
      "replies": {}
    },
    "g4ijvcv": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ijvcv/",
      "text": "Yeah same and a friend of mine at college is feeling the same.",
      "author": "warrior15678",
      "created": 1599623716,
      "upvotes": 1,
      "replies": {}
    },
    "g4ih7lr": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ih7lr/",
      "text": "I feel like i'm in a parallel universe. Time is flowing and I am part of the that flow, but I'm not really there. Days blend together and all time seems to be the happening at the same time. Even the things I do to break up the days are starting to blend into the peaceful chaos. Everything is happening at the same time. Nothing is happening ever. \n\n&#x200B;\n\nI almost miss working because at least it gave me a sense of time.",
      "author": "myalwaysthrowaway",
      "created": 1599622034,
      "upvotes": 3,
      "replies": {}
    },
    "g4ih3a0": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ih3a0/",
      "text": "This may be somewhat relevant, but there's a community I found when I got really burnt out from college (similar symptoms for unrelated reasons). It might still apply to some of you guys tho. Check out /r/aftergifted",
      "author": "Firebird117",
      "created": 1599621959,
      "upvotes": 3,
      "replies": {}
    },
    "g4ifbfi": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ifbfi/",
      "text": "I feel the same way with all of the crazy shit going on in the world and in the United States, both politically and with covid. not knowing what’s going to happen on a week to week basis. Days feeling extremely short, losing track of time. Oddly enough though I’m weirdly calm and more motivated than usual",
      "author": "soulsurvivor97",
      "created": 1599620887,
      "upvotes": 2,
      "replies": {}
    },
    "g4ie9l7": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ie9l7/",
      "text": "I had those same feelings the first week, then I moved to my college the second week and the feelings kinda left. I felt like a person again, then on the third week I got sent back because the campus got hit with 120 cases of covid.",
      "author": "DaDudeNextToYou",
      "created": 1599620246,
      "upvotes": 1,
      "replies": {}
    },
    "g4idel5": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4idel5/",
      "text": "I’m so glad I’m not alone. I’m so tired all the time and staring at my computer all day doesn’t help. There’s barely any activities going on at school, I can’t find a job, I have a chronic illness that keeps getting worse... I just want something good to happen.",
      "author": "xcatloverx",
      "created": 1599619740,
      "upvotes": 2,
      "replies": {}
    },
    "g4id5qx": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4id5qx/",
      "text": "I’ve been saying I feel like I’m living in limbo since classes started Aug. 17th for me so I’m right there with you. I think we all feel a little weird right now. The days blend together to the point where time just feels like it doesn’t exist. I was hoping once classes got rolling the feeling would cease but it hasn’t, so I guess it’s just a waiting game",
      "author": "oceanscrub",
      "created": 1599619593,
      "upvotes": 4
    },
    "g4ickeb": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ickeb/",
      "text": "thank u for putting to words the way I’ve been feeling since March 😭",
      "author": "Genesis5412",
      "created": 1599619240,
      "upvotes": 1,
      "replies": {}
    },
    "g4ibp8c": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ibp8c/",
      "text": "It's a trap. It doesn't feel like shit's happening because it's virtual but the midterm will arrive all the same.",
      "author": "thatLifeVibe",
      "created": 1599618725,
      "upvotes": 1,
      "replies": {}
    },
    "g4i8ope": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i8ope/",
      "text": "oh my gosh I was literally just talking about this! I've been doing online college since March (I also took summer classes) and for the first few months it was kinda fun, but I started a new program at a new college today and it doesn't even feel real. I haven't met any of my professors or classmates, and it's really bizarre because I'm in nursing school, which is usually such a hands-on program. I'm only going to see them every other week for a few hours in person. even our clinicals are online. it's just bizarre. I know I'm still getting a quality education but it just feels eerie",
      "author": "FitLotus",
      "created": 1599616972,
      "upvotes": 2,
      "replies": {}
    },
    "g4i8ola": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i8ola/",
      "text": "for a while it seemed i felt like this. then for me personally, I noticed that when I spent time avoiding the activities that made me forget about time (for me it was gaming), I felt more in the moment.",
      "author": "cow_says_mooooo",
      "created": 1599616970,
      "upvotes": 2,
      "replies": {}
    },
    "g4i7i5a": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i7i5a/",
      "text": "Perhaps your mind is just kind of putting things on hold until you're out of your temporary situation - till you move. One thing I've tried to practice and remind myself throughout 2020 is to be present. People say things like \"let's take a shot at 11:59 Dec 31, 2020 and never speak of this again\" in the sense that we hope 2021 is better. Why not focus on being present though and focus on what is good now? I recently got into a new band which introduced me to a Japanese proverb \"Mono no aware\" basically meaning \"the awareness of [impermanence](https://en.wikipedia.org/wiki/Impermanence) (無常, *mujō*), or transience of things, and both a transient gentle sadness (or wistfulness) at their passing as well as a longer, deeper gentle sadness about this state being the reality of life\" ( [https://en.wikipedia.org/wiki/Mono\\_no\\_aware](https://en.wikipedia.org/wiki/Mono_no_aware) )  The band took the proverb to say that we watch these days pass by and let's say 5 years later we look back at them only in memory remembering all the good times. If we're present though and acknowledge what's good now, we can presently live the good times. I know this is a very hard concept and a poor time to talk about it, but all the same perhaps now is the best time to talk about it.",
      "author": "Keboh3",
      "created": 1599616303,
      "upvotes": 1,
      "replies": {}
    },
    "g4i7d34": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i7d34/",
      "text": "My schoolwork is like hydras right now every time I get an assignment done the next class session we get twice as much shit assigned",
      "author": "trunks111",
      "created": 1599616222,
      "upvotes": 1,
      "replies": {}
    },
    "g4i78id": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i78id/",
      "text": "Im so glad you posted this here. I feel exactly that. I just feel like life shouldn't go on. This summer felt nice. The weather got me out and I was able to hang out with my home town friends. Now that we all left for college, its just an eerie, lonely feeling. We're all just sitting in different parts of the country taking classes on a computer. And its like we're expected to be productive and go above and beyond when the world is still at a halt.",
      "author": "biogirl787",
      "created": 1599616150,
      "upvotes": 2,
      "replies": {}
    },
    "g4i75ut": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i75ut/",
      "text": "The days for me seem to melt away but at the end of the week it always feels like a long time has passed. Ironically the times in which I feel the most connected to reality are when I'm trying to escape it by playing video games or watching movies.",
      "author": "Fedora200",
      "created": 1599616109,
      "upvotes": 1,
      "replies": {}
    },
    "g4i4o8m": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i4o8m/",
      "text": "I’ve definitely been feeling the same way i don’t even have the motivation to interact with my friends/others anymore",
      "author": "honey--boba",
      "created": 1599614738,
      "upvotes": 1,
      "replies": {}
    },
    "g4i2moe": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i2moe/",
      "text": "I can definitely relate. There's so much going on to the point where it feels like nothing is going on.",
      "author": "scarlettears",
      "created": 1599613616,
      "upvotes": 1,
      "replies": {}
    },
    "g4i2gzm": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i2gzm/",
      "text": "It feels like we’re all in an uncanny episode of Black Mirror",
      "author": "DazedPenguin15",
      "created": 1599613525,
      "upvotes": 2,
      "replies": {}
    },
    "g4i0xvx": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i0xvx/",
      "text": "This is why I decided to take a gap year. I do terribly in an online setting, and having that looming threat at all times just won’t sit with me.",
      "author": "Scientedfic",
      "created": 1599612661,
      "upvotes": 2,
      "replies": {
        "g4j2495": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4j2495/",
          "text": "Nice, do u plan on doing anything? Taking a gap semester has crossed my mind but given how difficult getting a job/internship rn is, I don’t think I’d be productive at all.",
          "author": "DabTwerkSkrt",
          "created": 1599640068,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4i0doj": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i0doj/",
      "text": "By strange do you mean just watching my due dates pass and being confused and zero motivation? Idk it’s not like me to just skip assignments but I’ve been planning my procrastination and doing just enough to pass, if even.",
      "author": null,
      "created": 1599612349,
      "upvotes": 2,
      "replies": {}
    },
    "g4hxykq": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hxykq/",
      "text": "Yes",
      "author": "TheTurtleFan",
      "created": 1599610981,
      "upvotes": 1,
      "replies": {}
    },
    "g4hxtrz": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hxtrz/",
      "text": "same bro. 2020 was the fastest year of my life",
      "author": "ejunsub",
      "created": 1599610906,
      "upvotes": 2,
      "replies": {}
    },
    "g4hxswo": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hxswo/",
      "text": "yes! this is what i was thinking about today. i’ve been feeling really anxious, unproductive, and just overall strange even though i’ve been keeping myself ahead etc. i feel ‘lazy’ because i am sitting at my desk doing assignments or reading, but i’m not being lazy. and then, if i take a break and let’s say lay on my bed and go on my phone, it doesn’t feel like a break it just feels like i’m being unproductive? i think since i’m sitting there at my desk for all my classes that when i take a ‘break’ it doesn’t feel different. i don’t know. but it’s been making me feel really anxious. i think doing all my work in my bedroom (i stayed home) makes my room feel uncomfortable. it’s odd.",
      "author": "reveluvs",
      "created": 1599610893,
      "upvotes": 1,
      "replies": {}
    },
    "g4hwk1i": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hwk1i/",
      "text": "I feel you. Ever since March, I’ve been feeling like I’m not really in this world anymore. I have to drag myself to do things and feel so sluggish all the time. Definitely a weird time for all of us",
      "author": "TT_TT97",
      "created": 1599610193,
      "upvotes": 2,
      "replies": {}
    },
    "g4hvfdz": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hvfdz/",
      "text": "Huh.  I always feel like this tho",
      "author": "ButtFuel",
      "created": 1599609548,
      "upvotes": 2,
      "replies": {}
    },
    "g4hv3c4": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hv3c4/",
      "text": "I feel this shit. Been feeling like i’m dissolving away into the void",
      "author": "b00kzzz",
      "created": 1599609357,
      "upvotes": 2,
      "replies": {}
    },
    "g4hutj5": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hutj5/",
      "text": "Since March. It feels like a dream or I’m on a video game pause screen.",
      "author": "Realistic_Pass",
      "created": 1599609218,
      "upvotes": 2,
      "replies": {}
    },
    "g4htxoo": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4htxoo/",
      "text": "I've actually been feeling amazing recently.  \n\n\nMaybe some of us just thrive in chaos.",
      "author": "Sevenzulu",
      "created": 1599608739,
      "upvotes": 5,
      "replies": {}
    },
    "g4hthue": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hthue/",
      "text": "I’m thinking of just taking a gap semester for fall. Online classes are really not it and it’s the same price for regular classes but the experience is so diminished. I’d rather work and do other things than stay home almost 24/7 with classes and homework all the time. My motivation has gone down significantly for this semester",
      "author": "Real-Gucci",
      "created": 1599608490,
      "upvotes": 1,
      "replies": {}
    },
    "g4htdve": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4htdve/",
      "text": "I wish this semester was the pass/no pass semester. It’s so much worse than the transition to online",
      "author": "LordLychee",
      "created": 1599608428,
      "upvotes": 1,
      "replies": {}
    },
    "g4ht12y": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ht12y/",
      "text": "Yes. I’m meeting with my class once a month. I’m a nursing student so we have clinicals every week... Trying to stay focused for 3 hours on a Zoom lecture straight up sucks. As a cross country athlete, I feel naked running around campus without a mask on. I’m trying to find a routine but nothing is set in stone... everything is temporary. It’s confusing.",
      "author": "runnerpride98",
      "created": 1599608223,
      "upvotes": 1,
      "replies": {}
    },
    "g4hso7d": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hso7d/",
      "text": "This is my thoughts exactly. It’s like nothing is real and I’ve been feeling really unmotivated to do my classes well. And yet its the only sense of normalcy grounding my days. I’ve been feeling very untethered because I think COVID really showed me that all these life decisions/paths you’re “supposed” to take are completely arbitrary given that so many of our world has been turned upside down and rules/policies written away. It’s been hard to make meaning out of anything I’ve been doing and I’m pretty scared for the future because it is even more unknown now. Especially with this upcoming election, who knows what’s going to happen past it",
      "author": "Kooky_Barnacle",
      "created": 1599608016,
      "upvotes": 2,
      "replies": {}
    },
    "g4hrut1": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hrut1/",
      "text": "This is how I'm feeling as well. I am a junior in college but this year feels off. Also doesn't help I got broken up with a few weeks ago lol. At this point I'm just just hoping spring semester feels more like what I'm used to but I'm losing hope about that everyday.",
      "author": "smoke_inyoureyes",
      "created": 1599607554,
      "upvotes": 2,
      "replies": {}
    },
    "g4hqvvd": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hqvvd/",
      "text": "These are definitely strange times with everything going on, and it's okay to feel weird and realize that you feel that way. Staying motivated can be hard, especially when you spend basically all day in front of the computer. I've been doing online classes since March and for the first few weeks especially I was depressed as hell. I've been pretty depressed a couple times since too, and ofc whenever I was feeling that way I just stayed inside not doing much. What's made me feel better in this time has been changing up my schedule in little ways, and staying relatively active.\n\nI go on walks most evenings (when I don't work), sometimes just for like 15 minutes, sometimes for an hour or so, some days I go walking in the nearby woods. I change up the games I'm playing every few days and the things I'm listening to so life isn't too too monotonous. I do a couple push ups or pull ups after most times I go to the bathroom, just to get a lil  bit of upper body workout. I stop to go out in my backyard for a couple minutes every now and then. I'll take some time in the morning to read outside some days before I start gaming for the next 4 or 5 hours. \n\nJust little things to keep a bit of diversity in my days...... I can't really offer advice for the schoolwork tho, I'm bad at everything except reading and writing responses 😅😅😅",
      "author": "SaintLucien",
      "created": 1599607007,
      "upvotes": 1,
      "replies": {}
    },
    "g4hqbzn": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hqbzn/",
      "text": "Just graduated and I feel the same way. I'm living at home, working a labor job - it feels a bit like I'm caught I  an endless high school summer, except it's harder to see friends",
      "author": "SkiMonkey98",
      "created": 1599606709,
      "upvotes": 1,
      "replies": {}
    },
    "g4hptjd": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hptjd/",
      "text": "Welcome to the military.",
      "author": "devildocjames",
      "created": 1599606445,
      "upvotes": -1,
      "replies": {}
    },
    "g4hpcs7": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hpcs7/",
      "text": "I'm already failing two classes, and my brother probably has covid now. I'll probably drop out, soon.",
      "author": null,
      "created": 1599606207,
      "upvotes": 3,
      "replies": {}
    },
    "g4hp7zx": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hp7zx/",
      "text": "I'm feeling this way too. I'm a commuter student and this is my last semester for a B.A. should be exciting right? It has that out of place feeling you're describing. The days go by but nothing feels like it matters as far as assignments going toward anything. It just feels like another, more stressful, way to pass time.",
      "author": "Cat_Panda_Canda",
      "created": 1599606136,
      "upvotes": 1,
      "replies": {}
    },
    "g4ho3sb": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ho3sb/",
      "text": "I’m right there with you man. I don’t even have the words to describe how I’m feeling.... but the closest is just like you said: “strange.” I’ve always thought therapy was something that I would never ever need. My first meeting is on Friday.",
      "author": "Legalize_Sun_Chips",
      "created": 1599605569,
      "upvotes": 1,
      "replies": {}
    },
    "g4ho316": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ho316/",
      "text": "Yes. My fiancé died 11 months ago and then covid happened soon after. I truly feel I entered an alternate reality. Hell maybe. I’m so over it. All of it.",
      "author": "huna-lildahk",
      "created": 1599605559,
      "upvotes": 8,
      "replies": {
        "g4i5hn5": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i5hn5/",
          "text": "Oh my, how awful. *There are no words.* But please hang in there. It is hard. But people do care.",
          "author": "billgx",
          "created": 1599615188,
          "upvotes": 6,
          "replies": {}
        },
        "g4ieq1a": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ieq1a/",
          "text": "Just an internet stranger here but I’m wishing you nothing but happiness and healing. Proud of you for waking up each day and having the strength to keep going.",
          "author": "cpd_crazylife",
          "created": 1599620524,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4hmxrw": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hmxrw/",
      "text": "Me 24/7",
      "author": "dreamcore004",
      "created": 1599604977,
      "upvotes": 1,
      "replies": {}
    },
    "g4hm2ph": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hm2ph/",
      "text": "I feel you bro:(",
      "author": "bawan27",
      "created": 1599604534,
      "upvotes": 1,
      "replies": {}
    },
    "g4hl9a7": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hl9a7/",
      "text": "I’ve always been a good student, and this is the first semester I haven’t been interested in school or receiving good grades. I slept until 2 pm today. I have no idea how to get my motivation back.",
      "author": "caldwelln2602",
      "created": 1599604111,
      "upvotes": 8,
      "replies": {
        "g4hn41v": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hn41v/",
          "text": "Same here man. I feel depressed. Like it’s hard for me to stay motivated. My mind has felt foggy, I feel like my recall is worse. I need to get out but I’m stuck staring at a screen, feeling like I’ve learned nothing.",
          "author": null,
          "created": 1599605067,
          "upvotes": 7,
          "replies": {
            "g4i0tq3": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i0tq3/",
              "text": "Today I had my textbook open for 20 mins and I didn’t even finish a page. My brain legit feels like static. I mean we can’t be so harsh on ourselves. The world is going through such a transitory period so it’s impossible to expect us to be at normal functioning levels.",
              "author": "caldwelln2602",
              "created": 1599612598,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g4hl4oz": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hl4oz/",
      "text": "Same, I barely have any motivation and it’s not about learning or truly studying anymore, it’s just about submitting assignments before 11:59. I’m honestly scared of how my GPA is going to look like at the end of the semester and the communication is lacking with my professors. I was really thinking of taking a gap year before the semester started and I regret not doing so.",
      "author": "melizabethabel",
      "created": 1599604043,
      "upvotes": 1,
      "replies": {}
    },
    "g4hkrwu": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hkrwu/",
      "text": "I’m on my third week of class and I have no idea what’s going on, when quizzes and exams are, what assignments are due and when, etc. This is my ninth semester of college. I don’t know what I’m doing. I’m not able to get motivated. \n\nHonestly I’m thinking of dropping out and returning to school when things are normal. Any career in my field of study won’t be hiring for the next 2-3 years, potentially longer. I’m going to have to get a full time job to fill the gap at some point, might as well do it now. I have a very attractive work connection 1,500 miles away. I’d be making more money in a year than I’ve cumulatively made in my entire life. Feels like I’m wasting time staying in school during covid.",
      "author": "dovahbe4r",
      "created": 1599603865,
      "upvotes": 5,
      "replies": {}
    },
    "g4hknmv": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hknmv/",
      "text": "Yeah, I feel the same way. Got on campus on Friday, it still feels weird. Hard to meet people.",
      "author": "ImrusAero",
      "created": 1599603805,
      "upvotes": 1,
      "replies": {}
    },
    "g4hkm5g": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hkm5g/",
      "text": "Sounds like dissociation.",
      "author": "Mecca1101",
      "created": 1599603784,
      "upvotes": 1,
      "replies": {}
    },
    "g4hkjw7": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hkjw7/",
      "text": "The past three days have been especially strange. I can’t put a finger on it but everything just feels WEIRD. Feel so disassociated with life like I’m living in a simulation.",
      "author": "whorsian",
      "created": 1599603753,
      "upvotes": 2,
      "replies": {}
    },
    "g4hjos9": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hjos9/",
      "text": "I go to all the lectures, do all the work, do great on the quizzes, and yet I feel like I haven't learned anything. \n\nIt's not just you.",
      "author": "Eye_Refuse",
      "created": 1599603309,
      "upvotes": 3,
      "replies": {}
    },
    "g4hj7ly": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hj7ly/",
      "text": "I definitely understand this feeling. Sometimes motivation is hard to come by during this time and I want to get ahead on things, but I feel like I get easily overwhelmed despite not feeling like I'm doing enough. Especially with my anxiety, there are times where I just... do not feel great. Something that has helped me though is writing down good things that happen each day. I think sometimes things can feel monotonous, but genuinely writing down good things in each day shows that each day is different and will bring a good thing - even if it is just eating your favorite thing for dinner or whatnot! I feel like using stuff like Google Calendar has also helped to keep me organized and on track because I keep the reminders on and it helps to let me know when certain things need to be done.",
      "author": "serendipitydream",
      "created": 1599603064,
      "upvotes": 3,
      "replies": {}
    },
    "g4hiyp5": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hiyp5/",
      "text": " No, I just feel sad.",
      "author": "RiCkyTicKybr0",
      "created": 1599602942,
      "upvotes": 1,
      "replies": {}
    },
    "g4hfq5h": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hfq5h/",
      "text": "I feel that so much tbh. Just a crazy surreal state of liminality.",
      "author": "clumpedupcards",
      "created": 1599601461,
      "upvotes": 4,
      "replies": {}
    },
    "g4hek9b": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hek9b/",
      "text": "yes but for different reasons. i took a leave of absence cause i didn’t want to do hybrid classes with the potential of going fully online, but i’m still living off-campus with other students. instead of school i’m working full-time for the next year. i am very confident with my decision, but it’s a very strange feeling.",
      "author": "pastelxbones",
      "created": 1599600967,
      "upvotes": 1,
      "replies": {}
    },
    "g4he75b": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4he75b/",
      "text": "Same feeling totally.",
      "author": null,
      "created": 1599600812,
      "upvotes": 1,
      "replies": {}
    },
    "g4hdevw": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hdevw/",
      "text": "I’m remote this semester. My junior year. This is my second week of classes and I feel even less motivated than I was last semester when we went remote. I haven’t taken a single note in any class and am not keeping track of assignments. This all sucks and I feel like I’m learning nothing. The only thing to remember is that pretty much everyone is more or less in the same boat. And no matter how much your situation sucks, there is probably someone out there who has it worst",
      "author": "nealmk",
      "created": 1599600481,
      "upvotes": 6,
      "replies": {}
    },
    "g4hde27": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hde27/",
      "text": "Totally feel you! feels like a simulation...",
      "author": "njsz",
      "created": 1599600471,
      "upvotes": 3,
      "replies": {}
    },
    "g4hcztu": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hcztu/",
      "text": "Getting to campus is really nice. I’ve been here for a month and it’s just like a nice little bubble away from everyone and everything. We’ve only had 4 cases so far too so I’m hoping that keeps up.",
      "author": "Trip4Life",
      "created": 1599600289,
      "upvotes": 1,
      "replies": {}
    },
    "g4hbg3w": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hbg3w/",
      "text": "Yes! I’m an instructor lurking on here but I’ve been feeling like this for months.",
      "author": "Blackberries11",
      "created": 1599599660,
      "upvotes": 17,
      "replies": {}
    },
    "g4haucb": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4haucb/",
      "text": "I feel this so hard. 4-6 hours a day on zoom, while people at other places are out there partying. Strangely, I find it harder each day that we will go back to a \"normal\". I've begun to feel very hopeless and dull.",
      "author": "star_slayerr",
      "created": 1599599344,
      "upvotes": 1,
      "replies": {
        "g4hbu0h": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hbu0h/",
          "text": "same, life will definitely be different in the upcoming months and year or so.",
          "author": null,
          "created": 1599599863,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g4hahdh": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hahdh/",
      "text": "Yes, Jesus Christ yes I’m so glad somebody put this into words. Not in like a serious derealization way or anything but to me just nothing feels incredibly... real right now. Nothing seems to have much purpose, I’m scatterbrained and confused, my education seems like it doesn’t even matter right now. What good will it do me? The world is fucked anyway. I’m not even gonna get to walk the stage, at least not on time. I don’t know man.",
      "author": null,
      "created": 1599599158,
      "upvotes": 25,
      "replies": {}
    },
    "g4hacdn": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hacdn/",
      "text": "Life is always weird, doesn't matter what happens. But, each moment is an opportunity to get weirder and make it funner. Or...leave your unwanted schoolwork in the hands of a professional ghostwriter. I mean, Hamburger Helper.",
      "author": "Writeyourpaper",
      "created": 1599599088,
      "upvotes": 2,
      "replies": {}
    },
    "g4h9jbv": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h9jbv/",
      "text": "Yeah, I've also been having intense feelings of dissociation these last few couple of months. Idk if it's depression or being desensitized to everything going in the world. It's already my 3rd week of online classes and I forget I'm even in school. We're all in this together lol",
      "author": "Bk_Grizzly",
      "created": 1599598672,
      "upvotes": 8,
      "replies": {}
    },
    "g4h90le": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h90le/",
      "text": "https://youtu.be/snAhsXyO3Ck\n\nCheck this video out, I was feeling the same way but this helped me keep myself in check",
      "author": "benben591",
      "created": 1599598410,
      "upvotes": 6,
      "replies": {}
    },
    "g4h8xum": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h8xum/",
      "text": "I’m sorry you’re feeling this way. Honestly, I feel exact the opposite. Everyday feels great to me, but it may be because I got out of depression as soon as the lockdown happened. \nFor some reason, I feel like I’m more in control of my life now than I ever have been. I used to be an extremely anxious person, but after quarantine started, all my stresses just literally faded away in a week. Online college really helps me feel like I have more control over my life, and I’m loving it! \nIs there anyone else who feels the same?",
      "author": "chocopizza1",
      "created": 1599598371,
      "upvotes": 10,
      "replies": {
        "g4i4gks": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i4gks/",
          "text": "The lockdown is the introvert's paradise. It is perfect for those of us who gain energy from being alone. You certainly are not the only one who feels this way.",
          "author": "billgx",
          "created": 1599614626,
          "upvotes": 3,
          "replies": {
            "g4jqfpx": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jqfpx/",
              "text": "Yea but there's a difference between voluntary and forced. I wouldn't necessarily call it a paradise I'm very introverted but even I get sick of being in the house",
              "author": "kawaiipop24",
              "created": 1599660943,
              "upvotes": 3,
              "replies": {
                "g4k5cb4": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4k5cb4/",
                  "text": "Good point. I’m introverted too and don’t like having my freedom restricted.",
                  "author": "billgx",
                  "created": 1599668593,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g4h8caf": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h8caf/",
      "text": "Definitely.\n\nI feel like college is a joke now with pure online classes, and that we're not doing much. I'm not motivated at all, and we're not even learning very complicated stuff. At least last semester the first half was face-to-face. I hate this semester already and I'm only at the beginning of the third week!",
      "author": "elephant35e",
      "created": 1599598065,
      "upvotes": 8,
      "replies": {}
    },
    "g4h57lt": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h57lt/",
      "text": "This semester doesn’t feel like it matters, it feels like it doesn’t count. Nothing feels like it counts. It’s like you’re currently enrolled in school, but not really. It feels like you don’t have to do anything.",
      "author": "andyytaccnt",
      "created": 1599596504,
      "upvotes": 24,
      "replies": {}
    },
    "g4h3d2q": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h3d2q/",
      "text": "It doesn't even feel like school started. It's just all weird",
      "author": null,
      "created": 1599595592,
      "upvotes": 20,
      "replies": {}
    },
    "g4h36at": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h36at/",
      "text": "Yeah. It’s been a rough year. I started going to therapy and it helped me a lot. Best of luck",
      "author": "curiousoap",
      "created": 1599595498,
      "upvotes": 6,
      "replies": {}
    },
    "g4h2wqd": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h2wqd/",
      "text": "Dude same",
      "author": "RocketSquidFPV",
      "created": 1599595362,
      "upvotes": 3,
      "replies": {}
    },
    "g4h2qlz": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h2qlz/",
      "text": "This is absolutely normal, you’re lacking the physical cues that you associate with being a student and are therefore disconnected from the experience. You’re also likely under stimulated, making it hard to feel engaged!",
      "author": "Mirella-pug13",
      "created": 1599595278,
      "upvotes": 69,
      "replies": {}
    },
    "g4h0l1z": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h0l1z/",
      "text": "[deleted]",
      "author": null,
      "created": 1599594219,
      "upvotes": 148,
      "replies": {
        "g4ha4u8": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ha4u8/",
          "text": "Me too. It also feels like I’m dreaming. I don’t know what I’m going to do next my body just does it for me without conscious thought but I can think about what I’m doing or why I’m doing it I just don’t feel like I’m in control half the time. I find myself cleaning stuff or walking around campus without even realizing I was",
          "author": "ajbear01",
          "created": 1599598980,
          "upvotes": 30,
          "replies": {
            "g4iadw6": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iadw6/",
              "text": "I want to point out that (though I'm not a mental health professional) this sounds just like dissociation. Dissociation is a normal way for our brain to protect us in stressful times, and people who are prone to anxiety might experience it more readily. But if you start feeling dissociated on a regular basis, if it becomes distressing or feels like it never seems to end, or if you begin forgetting large blocks of time, you should see a therapist.",
              "author": "lezzbo",
              "created": 1599617959,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "g4hj5dd": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hj5dd/",
          "text": "I'm graduated now, but I spent most of spring quarter in virtual learning. By the time April and May rolled around, we were getting inundated with news about the pandemic and the protests were heating up, with all the videos of cops brutalizing the protestors. I remember going absentmindedly to my classes and not being able to focus or engage. The rest of the time, I was just sitting in front of the computer with readings and empty Word documents pulled up, unable to absorb anything and just obsessively following news and videos about the protests. Through it all, the lightheadedness was definitely very jarring to me - it's like as hard as I tried, I just couldn't focus my brain on the present.",
          "author": "sunkissedmoon",
          "created": 1599603033,
          "upvotes": 14,
          "replies": {
            "g4i4lgq": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i4lgq/",
              "text": "Same happened to me, and im glad at least one of my profs understood and gave me an A for the class when I really couldn't give my all",
              "author": "Dezthegrunt",
              "created": 1599614697,
              "upvotes": 2,
              "replies": {}
            },
            "g4m5gwo": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4m5gwo/",
              "text": "[deleted]",
              "author": null,
              "created": 1599704976,
              "upvotes": 0,
              "replies": {
                "g4t9e3z": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4t9e3z/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1599822104,
                  "upvotes": 3,
                  "replies": {
                    "g4ubq0z": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ubq0z/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1599844496,
                      "upvotes": 1,
                      "replies": {
                        "g4ym1pu": {
                          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ym1pu/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1599936691,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g4hxzwc": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hxzwc/",
          "text": "yes!! i felt anxious all day today until i finally found a reason to go out and drive. then i felt better because i was able to get out and get fresh air and feel like i was actually ‘doing’ something",
          "author": "reveluvs",
          "created": 1599611002,
          "upvotes": 3,
          "replies": {}
        },
        "g4ixl93": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ixl93/",
          "text": "Aye think y’all might be experiencing some disassociation. Welcome to the life of an adhd kid",
          "author": "FrozenMrPotato",
          "created": 1599635011,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4h07y4": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h07y4/",
      "text": "Same, nothing was the same as it was 7 months ago. 7 months ago, I was commuting, had a bunch friends, and getting good at my job. Now, I’m doing online school, have really no friends, my job is easier but more stressful at the same time, and I will be doing classes I’ve never had experience in. It feels weird, also it’s my sophomore year and my sophomore year of HS my depression got so bad that I went to a mental hospital.  I’m afraid it will happen again because I’ve been in isolation (other than work) for 6 months straight. I’m not sure how much more I can take. I’m hoping January 2021 will bring a miracle, a reset, and I can go back to campus.",
      "author": "denver_rose",
      "created": 1599594040,
      "upvotes": 67,
      "replies": {
        "g4i92ky": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i92ky/",
          "text": "Rooting for you ❤️",
          "author": "idkfr123",
          "created": 1599617195,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "g4gz5b7": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4gz5b7/",
      "text": "Very much so. I am also just feeling very cut off from any desire to be a part of things. Half my classes are hybrid, half are fully online. Class involvement? Could get switched to online and never see these guys again, and the fully online ones don't even have zoom sessions. It feels strange \"knowing\" a professor and classmates solely through words... I haven't heard from any clubs I joined previously, maybe I should email or text them? Well, they never contacted me when we switched online, so why get involved now. Activism? I've been in that for all summer and such and nothing has really happened. \n\nI am in my seventh semester yet still feel like my classes are very intro, but my degreeworks doesn't show any alternative classes I can take- I need like 7 more credits for my minor, 15 more for my major, and no classes required for the degree are offered rn it seems. I'd talk to my advisors or faculty like they say, to use them as resources, but what's the point? \n\nIt just feels so strange. And then I look for jobs online and nothing pops up, or is way overcompetitive- how can I get a bar tending job when almost all bars are closed, so even a part time listing can ask for three years experience, and I have zilch? Should I even still be in college when everything seems like on the brink of a huge disruption?",
      "author": "_donotforget_",
      "created": 1599593505,
      "upvotes": 26,
      "replies": {
        "g4hpj4z": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hpj4z/",
          "text": "This is exactly where I’m at. Hang in there.",
          "author": "--ShieldMaiden--",
          "created": 1599606298,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4gz21w": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4gz21w/",
      "text": "Yeah it just feels odd really. I’m at my school right now, as I moved in they switched my courses to all online classes so it just been weird. There’s never anything going on like last semester and I find it hard to motivate myself to actually do these course because they’re not engaging at all. \n\nI just hope next semester will be different",
      "author": "UnsoughtDawn",
      "created": 1599593462,
      "upvotes": 12,
      "replies": {}
    },
    "g4gys88": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4gys88/",
      "text": "me freaking too. i’ve been in school for almost a month and even on campus things just feel weird. i’m a freshman & really feel like i missed out on the usual activities to meet people, & being out of state i feel like i don’t belong already just from that. plus meeting people with masks just sucks enough, like you can’t even smile at someone or see if they’re smiling at you",
      "author": "kourtroom",
      "created": 1599593327,
      "upvotes": 37,
      "replies": {
        "g4i3mjo": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i3mjo/",
          "text": "This exactly. \"...you can't even smile at someone or see if they're smiling\" \n\nI'm starting to force myself to look at people in the eye and say hello. Yes, it feels a little awkward. But I think our masks are hiding something very important, that human connection. Maybe if enough people do a little something extra like a warm greeting, it might help some of us who are struggling.",
          "author": "billgx",
          "created": 1599614173,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g4gwxsj": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4gwxsj/",
      "text": "I literally was just talking to my family about this yesterday. I was explaining to them how nothing feels real to me rn. I feel like im in a simulation. Something feels so off",
      "author": "mhaas622",
      "created": 1599592418,
      "upvotes": 185,
      "replies": {
        "g4hn5hz": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hn5hz/",
          "text": "Feels more like a loading screen in a video game. Cant really go anywhere, cant interact with other people socially, nothings really going on, except for some loading graphics (tiger king S1).",
          "author": "RickTitus",
          "created": 1599605088,
          "upvotes": 39,
          "replies": {}
        },
        "g4hdpyv": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hdpyv/",
          "text": "glitch in the matrix",
          "author": "harshit1705",
          "created": 1599600606,
          "upvotes": 39,
          "replies": {}
        },
        "g4lr4bt": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4lr4bt/",
          "text": ">I feel like im in a simulation.\n\nTo be fair, you could be.",
          "author": "Bigfrostynugs",
          "created": 1599697366,
          "upvotes": 5,
          "replies": {
            "g4m0vul": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4m0vul/",
              "text": "absolutely",
              "author": "mhaas622",
              "created": 1599702497,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g4gwwou": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4gwwou/",
      "text": "[deleted]",
      "author": null,
      "created": 1599592403,
      "upvotes": 113,
      "replies": {
        "g4igvfw": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4igvfw/",
          "text": "I feel this too. I went from scared to angry to now just apathetic since everything thats been going on since March. I just graduated and am back at my parent’s house with no real direction now and no knowledge of what the future might hold. I’m just in a kind of state of limbo until/if things go back to “normal.”",
          "author": "LazyAssedMenace",
          "created": 1599621829,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g4gwm7s": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4gwm7s/",
      "text": "honestly same feeling here too, this is my first semester and it’s been just bad and worst time to be alive rn.",
      "author": null,
      "created": 1599592256,
      "upvotes": 8,
      "replies": {}
    },
    "g4gu4v6": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4gu4v6/",
      "text": "[deleted]",
      "author": null,
      "created": 1599591007,
      "upvotes": 481,
      "replies": {
        "g4h7sjp": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4h7sjp/",
          "text": "Told myself about a week ago I'll break my schedule just this once to eat lunch and catch up on the online lecture later. Now I'm a week behind on lectures. \n\nDon't break schedule and more importantly don't be a bad student like me lol.",
          "author": null,
          "created": 1599597789,
          "upvotes": 200,
          "replies": {
            "g4hahqq": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hahqq/",
              "text": "You’re not a bad student. You’re going through some shit, just like everyone else. A lot of people feel depressed, unmotivated, lethargic, etc. Man, I have a 3.9 GPA, I’ve always loved school, always tried my best. When classes were in person, I would go to the library every day and do homework for hours. I would even get ahead in my classes sometimes. \n\nNow that we’re online, I struggle to do even an hour of work each day. I find myself falling asleep or going on reddit. I can’t bring myself to watch the online lecture. I don’t even get up to go to the kitchen, I just eat snacks in my room instead. I’m not a bad student. I’m a good student going through a bad time (with depression and an uncertain future and financial issues - a lot of people are going through this exact same thing right now). \n\nYou really should forgive yourself. Even surviving is tough at this point, so if you’re alive, you’re doing great. Your grades aren’t the end of the world, and they don’t define you. Even if you get a C-, it’s still an accomplishment that you’re able to stay in school and pass classes during such an awful time. Be kind to yourself ❤️",
              "author": "Slothfulness69",
              "created": 1599599163,
              "upvotes": 250,
              "replies": {
                "g4hb4e0": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hb4e0/",
                  "text": "Im glad i read this lol, i feel like i haven't been able to switch to school mode at all. My brain in stuck in some weird limbo and I'm doing work all day that could theoretically take less time. Even though im doing ok gradewise i feel like im learning absolutely nothing.",
                  "author": "Desto2014",
                  "created": 1599599490,
                  "upvotes": 53,
                  "replies": {
                    "g4hrqza": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hrqza/",
                      "text": "Yeah, I can relate. I feel like it’s because nothing is concrete anymore. Before the pandemic, you might’ve been able to do well in online classes because that was the only change in your life. Everything else would’ve been normal. \n\nBut now we’re in a situation where it’s like...what am I doing? And why? How can I make a goal about my school and my career when I don’t even have a reasonable estimate of what life will look like one year from now? Before, it was concrete. You’d graduate at x date and then get a job in x industry. Now, graduation dates are up in the air because of finances, and who knows if that job will exist anymore and if it does, is it even paying the same as it used to? And a lot of us also feel like, what’s even the point of having that job if you can’t use the money to go out with friends or travel? What does the future hold? What even are my goals anymore? \n\nMy advice is just try your best. Do what you can, but don’t overwhelm yourself. We can deal with the future when it comes (in your case, your issue of not learning might affect your future classes or job, but I’m saying don’t worry about it now. Deal with it when it comes up)",
                      "author": "Slothfulness69",
                      "created": 1599607494,
                      "upvotes": 21,
                      "replies": {
                        "g4lqh0w": {
                          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4lqh0w/",
                          "text": "In many ways the pandemic is forcing people to think long term, which can be jarring and unpleasant.\n\nOften it's easy to ignore the future and focus on either what is going on at the moment, or what is coming up soon. You concentrate on your school work during the day, and throughout the week you think of going out on a date on Friday, or your friend's wedding at the end of the month, or buying your first car soon.\n\nGraduating and starting a career are distant thoughts that are just kind of vaguely assumed while you focus on imminent short term goals and distractions. We struggle to overcome the monkey brain that is desperate to achieve what we want in the near future.\n\nBut now, everything has changed. Many of our lives has been reduced in many ways --- namely in the removal of social lives or even modest assumptions about what the next period of life will entail. The unpredictability of the future destroys our easily held notions of what is going to happen to us.\n\nIt forces us to confront the basic, terrifying idea that we don't know what will happen to us and that we aren't in control. During more normal times, most of us can push that to the back of our minds and occupy our thoughts with all the trappings of social interaction, short term goals, and the intricacies of modern life. Now that is gone.",
                          "author": "Bigfrostynugs",
                          "created": 1599697026,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "g4ijcsp": {
                          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ijcsp/",
                          "text": "Yeah I think thats smart. Get through what I can now and worry about other stuff when things are normal. I mean its not like we're experiencing this pandemic in a bubble, I hope people will realize that this year is hard on everyone and wont hold some mild slip ups against people.",
                          "author": "Desto2014",
                          "created": 1599623381,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g4hlhsx": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hlhsx/",
                  "text": "I feel the same way. The state burning down isn't helping. What even is this reality.",
                  "author": "PyrocumulusLightning",
                  "created": 1599604233,
                  "upvotes": 11,
                  "replies": {
                    "g4hp6r1": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hp6r1/",
                      "text": "On top of it being depressing, a lot of students are worried about evacuating and/or their families. A few days before school started, I had to pack my stuff in case of evacuations from the SCU Fire. I didn’t know where I would get internet from if I had to evacuate. And a lot of other folks are worrying about “my parents house is in an evacuation zone, is it gonna burn down?” It’s awful. And we can’t go outside cuz of hazardous air quality.",
                      "author": "Slothfulness69",
                      "created": 1599606119,
                      "upvotes": 11,
                      "replies": {
                        "g4hz62u": {
                          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hz62u/",
                          "text": "Our fires just got bad (Washington) and the air quality is bad enough they're telling us to stay indoors with the windows shut. It's still not as bad as the year it was raining ash from wildfires in Canada though - during which I had to move! Petty of me, but I resent missing the beautiful late summer we're having.\n\nIt is so hard to focus on intellectual things when there's no satisfying way to take a break. If I had to worry about evacuations too it would be game over. I feel like California schools should help their students get through this, but I'm not sure what they could do other than pause the term until the fires are under control. If you had the choice, would you want to stop school for a few weeks and resume when the danger has receded?",
                          "author": "PyrocumulusLightning",
                          "created": 1599611664,
                          "upvotes": 5,
                          "replies": {
                            "g4iqsrb": {
                              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iqsrb/",
                              "text": "It’s been raining ash on and off in my area. Can’t go shopping or anything fun in indoor spaces cuz of corona, can’t do outdoor activities like hiking cuz of smoke. We’re really just confined to our houses now. Also, if your air quality is bad, places like Lowe’s and Home Depot sell smoke masks. I recommend buying some ASAP because they sell out quick when wildfire season peaks. Stay inside, keep all doors and windows shut, and if you’re driving, recirculate the air. Also, keeping your blinds closed all day is depressing, but it’s more depressing to look outside and see smoke. So personally I keep mine closed. \n\nI’ve been in school during evacuations before (pre-pandemic) and I think I prefer it when they close school. A couple years ago, the state’s deadliest wildfire forced most colleges in NorCal to close for about a week or two. We didn’t extend the semester; the professors had to revise the course, so when we came back, it was like everything crammed into the last few weeks. It was hectic but still better than when I had to evacuate and school was open. I remember I missed an assignment deadline because we just had to pack our stuff and leave immediately, so I forgot my laptop. You can’t think straight when it’s an emergency evacuation. \n\nBut even if you get warnings ahead of time to evacuate, you still can’t really focus on school because you’re thinking about your house and whats gonna happen, checking the news 24/7 for updates, and planning in case of worst and best case scenarios.",
                              "author": "Slothfulness69",
                              "created": 1599628783,
                              "upvotes": 2,
                              "replies": {
                                "g4ky3l2": {
                                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ky3l2/",
                                  "text": "> you still can’t really focus on school\n\nExactly, it's pretty hard to slog through technical journals when your mind keeps jumping back to how you're going to handle getting out of dodge. Stress is the worst for focus.\n\nGood call on smoke masks. I have a respirator with a HEPA filter but it's a bit intense for all-day wear, that's for sure.\n\nBut seriously, staying in during the pandemic was already eating my brain. Good luck out there, and I hope the term gets better for you.",
                                  "author": "PyrocumulusLightning",
                                  "created": 1599682823,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g4hkgqt": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hkgqt/",
                  "text": "Thanks for this! Really need to hear that. I know I’m not the only one that feels like this but for some reason I alway think I’m alone with this mentality that I can’t stay motivated with these online classes. I relate very much, days go by so quick with me just doing homework all day and studying and then the next day it’s the same thing I barely have time to do anything I would like. I have always been a good student as well getting A’s and barely any c’s during my whole college career so far (I’m in my junior year), but this online experience is not the best. I’m not trying to just complain abt the whole experience because I have saved a lot of money not dorming or commuting but my social aspect of life is disappearing. Also, these professors are doing the bare minimum at least in my case and don’t seem to care abt there students experience online or grades.",
                  "author": null,
                  "created": 1599603709,
                  "upvotes": 8,
                  "replies": {
                    "g4hqp19": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hqp19/",
                      "text": "I feel like a lot of people feel “alone” because we’re all insecure, tbh. I felt bad about myself for a while because I gained weight since March, but on reddit everyone seems to be like “quarantine gave me time to lose weight.” And I waste my days doing nothing but see so many people like “ever since I got laid off, I took up this cool new hobby and found a way to monetize it!” \n\nFinally I realized there are a lot of people like me, but I don’t see them on reddit because, like me, they don’t wanna talk about it. It’s embarrassing to feel like you’re being unnecessarily lazy. That’s really not the case though. Of course we’re depressed and lazy; we’re not designed to sit inside our houses for 6 months with minimal human interaction, so it’s normal to be down about it. \n\nReach out when you need to, on reddit, with your friends, with your classmates. You’d be surprised. Literal strangers in my classes have agreed and spoken up when I said that I’m feeling down about online classes and stressed about the pandemic. We’re all in a weird, scary limbo.",
                      "author": "Slothfulness69",
                      "created": 1599606900,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "g4hpnxr": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hpnxr/",
                  "text": "Oh, thank goodness I'm not the only one.",
                  "author": "ParsnipPizza2",
                  "created": 1599606366,
                  "upvotes": 3,
                  "replies": {}
                },
                "g4huoju": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4huoju/",
                  "text": "I'm glad I'm not the only one feeling like this. I was the same way as you, but I'm really struggling too. Thanks for saying this. This is my first semester at University after 3 yrs in CC and I'm having trouble keeping my sanity. I've been doing a lot of things last minute, which has NEVER been me.",
                  "author": "What-the-heck-Craig",
                  "created": 1599609148,
                  "upvotes": 3,
                  "replies": {}
                },
                "g4iikyx": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iikyx/",
                  "text": "Honeslty man, I'm going through the exact same shit. Only thing is that I'v been working my ass off and yet I still feel fuckin behind. Like I literally be  turning in my assignments just before 11:59pm on the due dates. Like it's not even my schedules it's really just me not being able to finish assignments fast and efficiently. Then something random happens every day that I can never take in an account of and ruins my entire schedule, and I'm once again falling further behind. I'm coming to the conclusion of just dropping 1 out of my 6 courses or else i may not be able to squeeze enough time to study effectively for my tests. This is the first time that this happening and I just feel like a mess. I'm sorry for going off my rant, but I really needed to let this out somewhere.",
                  "author": "Deathstroke12420",
                  "created": 1599622895,
                  "upvotes": 3,
                  "replies": {
                    "g4ipoua": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ipoua/",
                      "text": "Yeah, adjusting to the new pandemic life is really difficult, and 6 classes in one semester was hard even before shit hit the fan. Maybe you could drop one class like you said, or if you can, see if you can do the “credit/no credit” grading system for one or more of your classes. That way you don’t have to worry about a low grade hurting your GPA, you just have to pass and you’ll be fine.",
                      "author": "Slothfulness69",
                      "created": 1599627893,
                      "upvotes": 1,
                      "replies": {
                        "g4iqu7n": {
                          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iqu7n/",
                          "text": "I forgot about the credit no credit system. Maybe I should do that.",
                          "author": "Deathstroke12420",
                          "created": 1599628816,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g4i38nw": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i38nw/",
                  "text": "I wish I had this support in my life. Shits hard homie.",
                  "author": "WitchAlex",
                  "created": 1599613956,
                  "upvotes": 2,
                  "replies": {}
                },
                "g4ijfe1": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ijfe1/",
                  "text": "Thanks, I really needed to hear this right now. It is a lot harder to get good grades and stay motivated and engaged than normal for me at least. So I will forgive myself for the bad days.",
                  "author": "birdsdontfly",
                  "created": 1599623428,
                  "upvotes": 2,
                  "replies": {
                    "g4iphzm": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iphzm/",
                      "text": "Some good advice that I got from someone is treat yourself the way you would treat your best friend. You would never tell your friend that he’s lazy or dumb for struggling in this pandemic, so you shouldn’t say it to yourself either. Be kind to you, too.",
                      "author": "Slothfulness69",
                      "created": 1599627742,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "g4jn5a6": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jn5a6/",
                  "text": "This comment wasn’t directed at me, but man did I need to hear it. Thank you for the kind words.",
                  "author": "aer_999",
                  "created": 1599659049,
                  "upvotes": 2,
                  "replies": {
                    "g4khsuj": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4khsuj/",
                      "text": "It was directed towards you too. Everyone that’s feeling down about struggling. We have to be nice to ourselves",
                      "author": "Slothfulness69",
                      "created": 1599674857,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g4htmlv": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4htmlv/",
              "text": "Wait your schedule doesn't have a lunch break?",
              "author": "Alyscupcakes",
              "created": 1599608564,
              "upvotes": 2,
              "replies": {}
            },
            "g4ipwac": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ipwac/",
              "text": "As someone with learning disabilities, that's what normal life is like.\n\nThis online stuff is just impossible.",
              "author": "popfilms",
              "created": 1599628053,
              "upvotes": 2,
              "replies": {}
            },
            "g4jlm66": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jlm66/",
              "text": "Don't skip lunch bro!!! You gotta plan it into your schedule",
              "author": "lilac0101",
              "created": 1599658105,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g4he4th": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4he4th/",
          "text": "I'm already behind and don't even care that much, I'm doing the bare minimum without reading and skimming lecture videos",
          "author": "Kobe_AYEEEEE",
          "created": 1599600783,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g4ghulx": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ghulx/",
      "text": "I think this is a very common feeling right now.  It's very interesting times and no one really knows how to process whats been happening so don't be too hard on yourself and let yourself feel the feelings",
      "author": "Legitimate_Narwhal_2",
      "created": 1599584854,
      "upvotes": 73,
      "replies": {}
    },
    "g4ghn5c": {
      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ghn5c/",
      "text": "Ya I have been feeling this too. After all the shit we've been through during the last few months and the lingering uncertainty over what's gonna happen in the future, I'm finding it very hard to feel motivated. It's tough for me to worry about where I'll be working next year when I don't even know what will happen a week from now. I feel like I could get sent home again any day now because of COVID and with the election coming up, things are probably just gonna get even crazier. It's tough worrying about the normal college things like classes, work, social life when the future just seems so uncertain.",
      "author": "BotherTurbulent2058",
      "created": 1599584750,
      "upvotes": 592,
      "replies": {
        "g4hmnoh": {
          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4hmnoh/",
          "text": "I used to bust my ass and now I think I formed depression being on my computer in my room all day doing schoolwork and feeling like I have no direction in life. My brother is an EMT and he may fail because he can’t do life saving scenarios through a screen.",
          "author": null,
          "created": 1599604833,
          "upvotes": 134,
          "replies": {
            "g4i8r71": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4i8r71/",
              "text": "I recently had to run codes virtually and it was very strange",
              "author": "FitLotus",
              "created": 1599617010,
              "upvotes": 18,
              "replies": {}
            },
            "g4ijv8q": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ijv8q/",
              "text": "This is your wake up call. If your life was based around busting your ass all the time and you feel depressed without it then something is wrong with the world.",
              "author": "U_Sam",
              "created": 1599623714,
              "upvotes": 9,
              "replies": {
                "g4ilkwt": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ilkwt/",
                  "text": "Care to explain? I just don’t feel like I’m getting a good education just being online and just feel demotivated not being in an enriching environment",
                  "author": null,
                  "created": 1599624878,
                  "upvotes": 16,
                  "replies": {
                    "g4jje85": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jje85/",
                      "text": "Yeah I feel that 100%. I was basically saying that if work is your personality and takes up your life something is probably not right. It sounded like to me that this person is busy all the time but now that they are less busy the feel like they have less self worth and are bored.",
                      "author": "U_Sam",
                      "created": 1599656696,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                },
                "g4ilms5": {
                  "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ilms5/",
                  "text": "Can you rephrase what you said? I'm having trouble understanding",
                  "author": "bahehs",
                  "created": 1599624913,
                  "upvotes": 3,
                  "replies": {
                    "g4jjmqq": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4jjmqq/",
                      "text": "If work is the only thing distracting you and you feel lost without it, it’s a problem. It sounds like the person is constantly involved with surrogate activities and isn’t self-actualised at all.",
                      "author": "U_Sam",
                      "created": 1599656852,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "g4ixi31": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ixi31/",
                      "text": "Saying he’s a workaholic. \nI disagree with them but that’s what he’s saying",
                      "author": "FrozenMrPotato",
                      "created": 1599634920,
                      "upvotes": 4,
                      "replies": {
                        "g4loyrp": {
                          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4loyrp/",
                          "text": "Yeah they're not saying they're depressed because they're not working all the time.\n\nThey're saying it's confusing and disheartening to suddenly have to conduct your entire life from behind a computer, with little to no connection to the \"real\" world, at least not in any tangible, enriching way. It's isolating and feels less worthwhile.",
                          "author": "Bigfrostynugs",
                          "created": 1599696220,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "g4iyh7u": {
                      "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4iyh7u/",
                      "text": "If your identity is your work, ask why? If you lose your work do you lose your identity? What is important?\n\nIf not working (a job you might not enjoy) makes you depressed there might be a flaw in the plan... or you might just be a masochist.",
                      "author": "ItoAy",
                      "created": 1599635951,
                      "upvotes": 2,
                      "replies": {
                        "g4ptj1g": {
                          "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4ptj1g/",
                          "text": "The fact that one would think all life has to offer is work, is outstanding, there's so much more to offer, your suppose to be able to enjoy whatever it is you enjoy in life, if its sitting on a beach soaking the sun, there's no reason you should be refrained from being able to do so, if you wanna jump out of a plane everyday, all you bro, but the fact money alone keeps us from being able to do what we want, is sickening, working your whole life should not exist. Unless that's what you personally enjoy is working... build a farm.",
                          "author": "OnlyJamesTtv",
                          "created": 1599760626,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g4uvr17": {
              "link": "/r/college/comments/iowwme/does_anyone_else_feel_strange/g4uvr17/",
              "text": "It's ok to feel these feelings, they are normal human responses to our world being disrupted the way it has. I watched history documentaries, and some inspirational speakers on youtube, and it gave me prospective, that this is not something that is new, it is just now we have technology, and the ability to communicate with lightning speed. (Positive: I can respond to your comment and say \"hey you, I was feeling the same way, this is what helped me\" etc... but, sadly, Negative: We are force-fed so much information, being on the laptop all day, and Tv's, is not good for us at all. It used to be a super hippie-dippie thing to say \"need fresh air\" but its really just a biological thing.)\n\nAt the end of the day, It seems, if you're not altering your brain with neurotropics, or whatever it is that silicon valley is doing in order to be putting out so much, yet taking so little time to do basic things like SLEEP, and EAT... it's very off-putting. I gave birth, and the first month after my child was born, I was being tortured in ways the government actually still uses to this day. SLEEP DEPRIVATION, and poor nourishment. Hardly had time to cook a proper meal... sleep was a joke, and I LOST it on my partner several times, and was willing to consider just walking away from it all (of COURSE not... after a good 2-3 hr nap I was better), but Isolation, sleeplessness, and malnutrition will do things to us that are just plain horrible. \n\nsorry... bit of a rant...",
              "author": "SouthernLemon",
              "created": 1599853936,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634051974
}