{
  "sid": "r00aws",
  "link": "/r/college/comments/r00aws/got_into_a_fight_with_roommate/",
  "title:": "Got into a Fight with Roommate",
  "text": "Some of you may remember the post I made a while back about my roommate who kept moving my stuff around without my permission, including my mail, and he also hid something important and broke the frame of a picture of my girlfriend that she gave me. I ended up talking to an RA about his behavior, and while they didn't directly confront him, they still told me that he wasn't allowed to touch anything that belonged to me as long as it was on my side of the room. Last night I had my girlfriend over the dorm as we were watching a movie and cuddling in the dorm's common room. The bedroom door opened and I saw my roommate moving my stuff again. I reminded him that the RA told him to stop, but he simply replied, \"I don't give a fuck, it's not like they can kick me out.\" I should mention that my girlfriend can be very protective of me, so at that point my girlfriend angrily stormed up to him and swiped my stuff from his hands, demanding that he stop bullying me and that he also pay us back for ruining the frame to her picture. He refused, arrogantly claiming he was in the right and that he owes us nothing. My girlfriend then made a very rude remark in response which set him off, so he yelled at her to shut up before he splashed his soda at her. In response I ran into the bedroom, took his jacket he had lying on his chair, and chucked it out the window. (For the record, we live on the 1st floor and I knew that the worst that would happen is that the jacket gets covered in the dirt it lands on.) He demanded to know what was wrong with me so I growled that no one treats my girlfriend like that so he retorted that she deserved what she got, so I then chucked his pillow out the window too. He ran out of the dorm (not through the window, through the door leading to the hallway) to go get his stuff. I was about to throw his sheets outside too but my girlfriend stopped me and told me that we need to leave. Since then I've been staying at her house, and I don't plan on going back until after Thanksgiving. I plan to tell my RAs about this too, however, I'm worried about what he's done to my things since I left and I'm worried if the RAs do confront him, he'll tell them some kind of crazy lie so he seems like the victim (he threatened he would do this in the past.)",
  "author": "imsosickofthisbull",
  "created": 1637627328,
  "updated": 1637689068,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hlppow3": {
      "link": "/r/college/comments/r00aws/got_into_a_fight_with_roommate/hlppow3/",
      "text": "Damn that sucks. Hope you didn't leave valuables in the room with that crazy person.",
      "author": "plowableacorn",
      "created": 1637631135,
      "upvotes": 2,
      "replies": {
        "hlps11z": {
          "link": "/r/college/comments/r00aws/got_into_a_fight_with_roommate/hlps11z/",
          "text": "I did at least make sure to take my most expensive and important things with me, however, I would still be quite upset if something were to happen to any of my things I have in my dorm.",
          "author": "imsosickofthisbull",
          "created": 1637632216,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlqarhl": {
      "link": "/r/college/comments/r00aws/got_into_a_fight_with_roommate/hlqarhl/",
      "text": "Oh my goodness … I would go visit on campus housing and demand to be moved. This is a toxic and clearly abusive situation.",
      "author": "Parking_Cranberry935",
      "created": 1637641276,
      "upvotes": 2,
      "replies": {
        "hlqpszo": {
          "link": "/r/college/comments/r00aws/got_into_a_fight_with_roommate/hlqpszo/",
          "text": "The thing is, it might cost money I can't afford to spend right now if I'm moved, I've been trying really hard to save up so I can buy a house with my girlfriend, she's been working hard too so I don't want to make us further from our goal. However, I do intend to address the issue with my roommate to either the RA's, the residential director, and/or campus housing in hopes he will be moved.",
          "author": "imsosickofthisbull",
          "created": 1637650807,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlpur2b": {
      "link": "/r/college/comments/r00aws/got_into_a_fight_with_roommate/hlpur2b/",
      "text": "Dude he’s gonna fuck with your stuff if you leave it in there",
      "author": "when-words-fail",
      "created": 1637633461,
      "upvotes": 1,
      "replies": {
        "hlqplc4": {
          "link": "/r/college/comments/r00aws/got_into_a_fight_with_roommate/hlqplc4/",
          "text": "I've already been at my girlfriend's house for more than twenty four hours, I did make sure to bring my most important belongings with me but obviously that wasn't everything I have in the dorm, I don't have anywhere else to put those things.",
          "author": "imsosickofthisbull",
          "created": 1637650648,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}