{
  "sid": "r41i27",
  "link": "/r/college/comments/r41i27/considering_changing_majors_in_junior_year/",
  "title:": "Considering changing majors in junior year",
  "text": "Right now I'm studying logistics engineering in a foreign country. I love my core subjects (supply chain management, warehousing, etc). But the engineering courses, man, those engineering courses. I'm always on the verge of failing. And the work load of those courses make me lose focus on the core logistics subjects. I'm thinking about changing my major but I'm in my 3rd semester now, is it too late to jump ships? And I have a scholarship to worry about and I'm not sure whether my parents will agree with me. I'm completely lost.",
  "author": "Afek_mzf",
  "created": 1638095608,
  "updated": 1638206819,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmdyxey": {
      "link": "/r/college/comments/r41i27/considering_changing_majors_in_junior_year/hmdyxey/",
      "text": "Being in your third year… you’re so close! Engineering classes are hard, but plenty of people still make it through despite the difficulty level, myself included. But only you can decide if that’s what you really want. Pros and cons lists can help as well as discussing with friends and family\n\nMy fiancé was in a very similar predicament to you a few years ago, in his third year of mechanical engineering, but realized it wasn’t what he wanted. He took the plunge despite what our peers or even his parents said because he knew it wasn’t what he wanted. Its worked out great for him so far and he’s doing something he’s really interested and passionate about now. \n\nThat being said, if you are going to switch this late in the game, HAVE A PLAN. Know what you do want to do, and have all the logistics of a major change mapped out. You should consult with someone in the field youre trying to transfer too to see how feasible it is with the classes you currently have. It’s your life, and even if you have to add an extra year or take out a loan to help you along, if you’ve got a plan and you stick to it as much as possible I say make your life what you want.",
      "author": "Former_Afternoon9662",
      "created": 1638096473,
      "upvotes": 2,
      "replies": {
        "hme0psq": {
          "link": "/r/college/comments/r41i27/considering_changing_majors_in_junior_year/hme0psq/",
          "text": "Hi, thanks a lot for responding and I'll definitely take some of your advice. The thing is I'm not in my third year, I'm in my third semester (early 2nd year), so I'm not in too deep yet, I think. I just don't know what to do man, exam period is getting closer and I feel like I'll fail half of my course. Is it reasonable to change in my 2nd year? Or do you think its too late and I'll have to plunge deeper instead?",
          "author": "Afek_mzf",
          "created": 1638097894,
          "upvotes": 1,
          "replies": {
            "hme192e": {
              "link": "/r/college/comments/r41i27/considering_changing_majors_in_junior_year/hme192e/",
              "text": "Oh I totally misread that as year instead of semester. Almost everything I said can still stay the same, except I would honestly encourage you to look into it more. I would still consult with someone, make your pros and cons list and talk to someone close to you about it but its far far  easier to transfer while you’re still early on in your program for most cases. There’s generally less pressure about “wasted time” and if you already feel like this major isn’t for you, don’t feel trapped just because you’re in your second year. Make a new plan, and it should work out for you if that’s what you want",
              "author": "Former_Afternoon9662",
              "created": 1638098297,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hme28z5": {
      "link": "/r/college/comments/r41i27/considering_changing_majors_in_junior_year/hme28z5/",
      "text": "If switching your major is going to make YOU happy then absolutely do it!! It’s not worth making yourself miserable for something you aren’t going to enjoy a career in or a future in. Honestly, even if you were in your junior year I’d still say the same thing. Find what you want to do and go with that. If your parents don’t agree it shouldn’t matter because it is your future you’re taking care of. Unless your scholarship is for engineering you shouldn’t have any issues there either!",
      "author": "ap_2319",
      "created": 1638099046,
      "upvotes": 2,
      "replies": {
        "hmfcj4f": {
          "link": "/r/college/comments/r41i27/considering_changing_majors_in_junior_year/hmfcj4f/",
          "text": "Update, my parents understood me but it looks like it's too late to change my major. The new reg said I can only change my major within my first year, so it looks like I'm going into the deep end now. Thanks for the encouragement though, it means a lot.",
          "author": "Afek_mzf",
          "created": 1638122785,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}