{
  "sid": "ql90yy",
  "link": "/r/college/comments/ql90yy/how_do_i_tell_my_parents_im_dropping_a_class/",
  "title:": "How do I tell my parents I’m dropping a class?",
  "text": "I’ve always been a semi-successful kid in high school (3.2 GPA, 29 ACT) and my parents expectations kind of followed that into college. Come midterms, my grades are A B C+ D D D. The adjustment for college has been very difficult and I’ve considered dropping a class. I can only drop one and have decided which one, but I feel like my parents will be disappointed in me for dropping classes. Is there any way I can tell them without feeling like I’m letting them down?",
  "author": "GHCorvette",
  "created": 1635873083,
  "updated": 1635890756,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hj1a88j": {
      "link": "/r/college/comments/ql90yy/how_do_i_tell_my_parents_im_dropping_a_class/hj1a88j/",
      "text": "It sucks that you are worried about their disappointment. But I think if they are going to be disappointed there's nothing much you can do about it. You could tell them you're optimistic you'll do better as you continue to adjust to college, or try to plan ways to do better with them. But really if ur honest with them and the need to drop a class for the sake of ur grades then it's on them to understand",
      "author": "tibsies",
      "created": 1635874104,
      "upvotes": 1,
      "replies": {}
    },
    "hj1ghet": {
      "link": "/r/college/comments/ql90yy/how_do_i_tell_my_parents_im_dropping_a_class/hj1ghet/",
      "text": "I've always just dropped it and told my parents that it was harder than expected and I would like to focus on it when I have an easier course load and that I would like to spend my energy on keeping up my grades in my other classes instead of focusing on the one that I'm dropping and will re-take it in another semester",
      "author": "Unfair-Campaign257",
      "created": 1635876583,
      "upvotes": 1,
      "replies": {}
    }
  }
}