{
  "sid": "jeqz5m",
  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/",
  "title:": "Why do students have to give professors and admin slack due to the pandemic but we don't receive the same?",
  "text": "May be a confusing title but:\n\nWe're in the middle of a pandemic, everyone knows that. Usual financial and health problems are worse for everyone, there's more anxiety in the air due to elections and covid, yet students don't seem to be getting any sort of recognition for the unusual times. The workload is as much as ever, no pass/fail grades, a lower quality of education online(I love online but it's still lower quality on average and everyone agrees on this)\n\nBut when it comes to problems with distance learning from the college's side(bad technology set ups, online exams not working etc), the excuse I'm given from them is that 'its a pandemic, we're trying to adjust to the new circumstances'. Well no shit so are we! You keep classes at the same difficulty, if not higher and want us to feel bad for you when you're not prepared to provide us a high quality education for literally thousands of dollars??\n\nThere are some of us who're on the other side of the world and have to live through an entirely different timezone to attend classes. I for one, spend all day sleeping and have to stay awake through the night because my professors want me to attend live classes and not just look at recorded ones.",
  "author": "CrazyTechq",
  "created": 1603205333,
  "over_18": false,
  "upvotes": 4936,
  "upvote_ratio": 0.97,
  "comments": {
    "gctcd35": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gctcd35/",
      "text": "Oh hell no, if my professors gave me some bullshit about “zero-tolerance” and “no excuses”, then I’d be calling every department on campus to try to get their smart ass taken care of. Professors need to remember that I am paying for your salary — they work for me. I am happy to lay down the law for a professor who is already incompetent at using technology or teaching. And that’s on period ☺️",
      "author": null,
      "created": 1605778375,
      "upvotes": 1,
      "replies": {}
    },
    "gcohs88": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gcohs88/",
      "text": "My professors have been allowing late work, my college allows you to apply for pass/fail...I never utilize either because I don't allow events outside of my control to affect events inside of my control.",
      "author": "Vrakhala",
      "created": 1605667212,
      "upvotes": 1,
      "replies": {}
    },
    "gbt0d29": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gbt0d29/",
      "text": "I agree. My professor was supposed to give us access to the take home final exam for the whole weekend, but he didn't set up the dates correctly. So, the exam access was only between midnight and 8am, and it was 3 hours. We have to make all these accommodations for the teachers who don't know how technology works, yet we have to be perfectly on time when turning in assignments. My teacher said we only get a one-time pass, where she will accept the assignment late. If you have any other internet or power outages after that, you're getting zeroes on your assignments. The teachers need to give some more leniency if they expect the same from their students. We are paying the same price as a quality education when our teachers don't know how to post a recorded meeting online. The teachers shouldn't all be using the same excuse of \"Well im too old to learn how to use technology\". This is the age we live in now. If you can't teach in our environment, news flash, you aren't a teacher nor are you teaching. At least for my college, the professors have been given the entire summer to learn how everything works, yet we only have a week to learn how to use it. There is no reason for them to not know how to use the technology if they were provided with literal guides and taught how everything works.",
      "author": "brilor123",
      "created": 1604990476,
      "upvotes": 1,
      "replies": {}
    },
    "gbj0a0u": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gbj0a0u/",
      "text": "College is a business and they just want your money. They don’t care about you but expect you to care about them.",
      "author": "nikolas_diaz",
      "created": 1604797617,
      "upvotes": 1,
      "replies": {}
    },
    "gajgqm0": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gajgqm0/",
      "text": "Another professor chiming in here. While I agree with what one of the profs said below about us not getting much slack at all--it's very true, and frustrating, for administrators to expect the same quality under these circumstances--there's one huge difference: we're getting paid and you're not. (Now, a ton of adjunct faculty, which is roughly 66-75% of faculty in the US, are NOT paid well at all. I have to put that in here.) So yeah, you're spending a bunch of money on a substandard experience while being expected to keep insane hours, the same workload if not more, and with the same grade consequences. It's not right.\n\nRe: the workload, my best guess is similar to what someone else said: We are putting all the small assignments you would do in class into the lesson plan/homework. And yes, this can be difficult to estimate in terms of time on task. But I do also believe some profs think that because you're online/remote, somehow you're more likely to slack off. I know some professors at my institution are giving MORE work than normal, which is crazy. I think most students will have realized by their junior year at the latest that professors are really bad at keeping in mind that students have anywhere from 3-5 other classes. That didn't suddenly change during the pandemic.\n\nI campaigned at my institution for pass/fail grades but was told that it lessened the value of the degree, which is b.s. in circumstances like these.\n\nMy first advice is to communicate a lot with your professors. If I don't hear from someone, I don't know what's going on with them, and frankly, it's hard to keep them in mind when I've got other students who ARE reaching out to me. It's not too much at all to ask for a few extra days on an assignment. If someone doesn't have a track record of abusing such requests, then I never have a problem agreeing.\n\nMy other advice is to organize and speak up. Because here's the open secret: You're spending a bunch of money, and you can take that money elsewhere. Students more than faculty and staff have sway with college administrators when they present a united front. Think of it this way. If your tuition is $35k, and just 100 students speak up, that is $3.5 million dollars speaking. And right now, a ton of colleges are facing extreme financial crises.\n\nYes it's hard, very hard, for all of us. But I want you to know that you're right to be asking this question. Stay healthy out there.",
      "author": "AmericanJeremiad",
      "created": 1604009713,
      "upvotes": 1,
      "replies": {
        "gajjpm0": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gajjpm0/",
          "text": "Hey there,\nMost probably won't see your comment but I'll reply.\nI missed it out in my original post but I'm not completely heartless towards professors; I know how hard it is for them too because of life and the college administrations. Obviously some professors are naturally better at handling these situations whilst others are just horrible towards their students. \nAs for your advice: I really think it's good and I've been trying to do it. I've communicated more with professors and tried to help them understand our side of it. And the 2nd point about organizing and speaking up is what gets me. I've been trying to get people to do that with me but students are just not up for it. They may be scared of administrations or maybe expect nothing to come out of it. I'm hoping things get better for both students and faculty.",
          "author": "CrazyTechq",
          "created": 1604011266,
          "upvotes": 1,
          "replies": {
            "gajlp9s": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gajlp9s/",
              "text": "Hey, I appreciate your reply! And no worries, I certainly didn't take your original post personally. I thought that one prof made a good point and wanted to back it up for the sake of other students who might read this. I appreciate your understanding; I think a lot of students actually understand it very well once I talk about it with them. But I do believe you all are in a terribly hard position right now, too, and it doesn't help for profs to act like it's the exact same position. Where I teach, we have a lot of students who come from underprivileged circumstances, poor schools, and environments that are hostile to them because of their gender or sexuality or race/ethnicity, including their own homes. My experience, education, and income all give me an advantage in dealing with this that so many students just haven't had the chance to obtain yet. \n\nHas your increased communication with your profs helped at all?\n\nI get what you're saying about students being reluctant to speak up. I'm sure the reasons are both of the things you mentioned plus the fact that everyone is just stressed out and squeezed for time. The sad thing is that you shouldn't have to be speaking up and organizing at all!!! It's another undue burden to place on the shoulders of young people trying to get a decent education right now.",
              "author": "AmericanJeremiad",
              "created": 1604012324,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g9tmjz3": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9tmjz3/",
      "text": "It’s like when parents say, “Do as I say, not as I do.” I took a Calc 3 exam on Oct 12. 11 days later and I still haven’t received my grade. Kinda frustrating. I get they are busy, but how does it take 2 weeks to give exams back?",
      "author": "nickberlo",
      "created": 1603498123,
      "upvotes": 2,
      "replies": {}
    },
    "g9nk9oa": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9nk9oa/",
      "text": "It’s been a hot mess. Really debating on taking the next semester off.",
      "author": "clowisdead",
      "created": 1603379613,
      "upvotes": 2,
      "replies": {}
    },
    "g9klgla": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9klgla/",
      "text": "one of my prof literally said the other day “i’m not gonna keep doing pre-recorded lectures in addition to live ones, it’s getting to be too much for me” as if i don’t have 4 other classes that i have to watch lectures for/do work for. bro you’re getting paid to teach me this stuff",
      "author": "ktsmitt",
      "created": 1603308248,
      "upvotes": 2,
      "replies": {
        "g9mflf0": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9mflf0/",
          "text": "You want your prof to both record lectures and give a whole different set of live lectures? Why?",
          "author": "Blackberries11",
          "created": 1603346707,
          "upvotes": 2,
          "replies": {
            "g9n8kah": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9n8kah/",
              "text": "well for one, because that’s what he told us we were gonna get at the start of the semester. and the recorded lectures also helped in understanding the course content, which is confusing at best",
              "author": "ktsmitt",
              "created": 1603373361,
              "upvotes": 1,
              "replies": {}
            },
            "g9pvuo4": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9pvuo4/",
              "text": "how one of my profs is doing it, she does a couple videos (not too long) on the material we will be reviewing in the live lecture. we are then to watch them and go to the textbook to kinda learn and have questions. then during the live lecture, we go over big ideas and then problems. so if they suddenly stopped with the videos and only told us where to read in the textbook, it’d feel pretty incomplete",
              "author": "Nuculu",
              "created": 1603419875,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9k3ode": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k3ode/",
      "text": "It’s all about money. \n\nIf you fail a class right now and retake it, you’re paying them 2x as much money for shitty online classes that are cheaper for schools to be running. \n\nProfessors make them money no matter what.",
      "author": null,
      "created": 1603299795,
      "upvotes": 2,
      "replies": {}
    },
    "g9jqqub": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jqqub/",
      "text": "First I've heard about students being required to give professors slack.\n\nI've yet to get an e-mail from a student saying \"Don't worry if it takes you an extra week to grade my paper. Also, I've already decided to give you top marks on the evaluation.\"",
      "author": "bl1y",
      "created": 1603293524,
      "upvotes": 1,
      "replies": {
        "g9pwweu": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9pwweu/",
          "text": "if you looked through some of the comments you would see people saying how their prof just didn’t upload a week’s material bc “life got busy”, how another didn’t put exam dates on their syllabus and just said they would know with 3 days notice, how some profs have multiplied the workload. just bc you may not be doing these things doesn’t mean others aren’t, and someone doesn’t have to directly say words for them to be giving you slack",
          "author": "Nuculu",
          "created": 1603420354,
          "upvotes": 0,
          "replies": {
            "g9q9exp": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9q9exp/",
              "text": "That's professors acting shitty, which is different from students *being required to give them slack.*",
              "author": "bl1y",
              "created": 1603427651,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9jkm4y": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jkm4y/",
      "text": "Believe me, students are getting a ton of slack.",
      "author": "heretek",
      "created": 1603290406,
      "upvotes": 3,
      "replies": {
        "g9nwa4d": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9nwa4d/",
          "text": "It’s never enough for some.",
          "author": "AcademicDifficulty",
          "created": 1603385477,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9jhjp7": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jhjp7/",
      "text": "While taking a course in person a few years back I asked to reschedule an an assignment missed due to an emergency and the professor was giving me a hard time. They asked me if I thought it would be fair for all the other students (15 of them) that were able to complete the assignment and how they would feel if I got a second chance. I flat out told them if we polled all of my classmates they would agree it would be fine for me to make it up.",
      "author": "cjmaguir",
      "created": 1603288749,
      "upvotes": 2,
      "replies": {}
    },
    "g9jhh95": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jhh95/",
      "text": "At the beginning of the semester it was, “We’re all gonna have to be flexible this semester” I quickly learned it was only for them. \n\nMy roommate was exposed to a positive case and obviously I live with my roommate. My school knew but was still trying to figure out what to do and I have lab on Tuesdays and Thursdays. I emailed on Monday explaining the situation and that I don’t feel comfortable being on campus until I know whether I’ll be contact traced as well. She told me I had to come in or I had to go online for the rest of the semester (which is literally a computer game type of lab). I ended up going and that Tuesday night got an email saying to Quarantine in place. I forwarded the entire email and all of a sudden it was No problem on this end, see you next week.",
      "author": "joywynter",
      "created": 1603288711,
      "upvotes": 3,
      "replies": {}
    },
    "g9jd2na": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jd2na/",
      "text": "Humans are not nocturnal creatures. I highly recommend you reach out to the dean or someone about being required to attend live lectures at night. Over time a sleep schedule like this will be very detrimental to your health",
      "author": "rwalston19",
      "created": 1603286157,
      "upvotes": 2,
      "replies": {}
    },
    "g9jce8v": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jce8v/",
      "text": "Online education, if done correctly, isn't actually any worse than traditional classes on average in terms of student performance. Although there is still a difference that someone unaccustomed to it can be negatively affected by. Still, this issue of online vs in-person classes is highly exaggerated to apply to all online classes rather than merely poorly taught ones through COVID-19.\n\nIf by difficulty, you mean in terms of projects, assignments, etc. Than I can agree that there should be less of it or that it should be scheduled appropriately, although the actual content learned in the class shouldn't be watered down just because we're having a pandemic.\n\nAlso, your personal concern is very strange. Why would you sign up for classes that you would have to stay up at night to get through just to complain about it on Reddit? Is it bad that this happens? Sure. However, these restrictions are often put into place for valid reasons that are at the discretion of the individual professor, so acting as if this is a systemic issue in the education system is very strange and unhelpful. I'm sorry that not every professor can keep in mind that some of their students signed up for classes on the other side of the globe, but expecting this type of treatment from every professor is unrealistic. University professors aren't here to hold your hand like high school teachers are, usually students have to deal with these issues on a case by case basis, it happens. Is it right? No, but it's always been like this, this pandemic changed little but the problems faced.",
      "author": null,
      "created": 1603285740,
      "upvotes": 1,
      "replies": {}
    },
    "g9ish3k": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ish3k/",
      "text": "Last semester, they replaced every single exam with a thesis paper for my best friend. She was in her first semester of her master's degree. She literally had to do 5 ~20 pages thesis papers over the summer. One of them was a GROUP WORK!!! and 40 pages long. They did not change the amount of credits you get. It was still like 3 or so FOR A WHOLE TERM PAPER (you'd usually get 6-9)! She had to read 1000s of pages of secondary literature and had zero freetike whatsoever. They didn't even extend the deadlines. It was insanity. All that for 15 credits.",
      "author": null,
      "created": 1603267060,
      "upvotes": 3,
      "replies": {}
    },
    "g9iighm": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iighm/",
      "text": "You are right! It's tough for everyone and anyone, no matter who it is or what their title, if they expect allowances for current issues had damn well better be giving those same allowances. That just common sense and common courtesy, neither of which are that common anymore.",
      "author": "soonerpgh",
      "created": 1603257430,
      "upvotes": 1,
      "replies": {}
    },
    "g9ii0vc": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ii0vc/",
      "text": "\"Offense is the best defense\"\n\nPut the burden on students before they even know what's happening and keep the narrative running.",
      "author": "CrimsonBolt33",
      "created": 1603257065,
      "upvotes": 2,
      "replies": {}
    },
    "g9iho3m": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iho3m/",
      "text": "[deleted]",
      "author": null,
      "created": 1603256770,
      "upvotes": -2,
      "replies": {
        "g9j7fn4": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9j7fn4/",
          "text": "Wow, anecdotal evidence",
          "author": "CombatWombat994",
          "created": 1603282349,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9i80bh": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i80bh/",
      "text": "YES!! thank you for saying this!!!",
      "author": "lyndsay0413",
      "created": 1603249815,
      "upvotes": 1,
      "replies": {}
    },
    "g9i6yya": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i6yya/",
      "text": "> my professors want me to attend live classes and not just look at recorded ones.\n\nThis isn’t a preference thing. It is the best way to learn. You’re literally asking for someone talk at you instead of with you. \n\nThis doesn’t work for education because you aren’t a vessel to have knowledge poured into. To learn, you need to be forced to exercise some thinking—and brains are wired for maximal laziness, so yeah, actually forced. Since we are social creatures. conversation does this perfectly.",
      "author": "Jooju",
      "created": 1603249159,
      "upvotes": 5,
      "replies": {
        "g9jemfo": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jemfo/",
          "text": "Fair point.",
          "author": null,
          "created": 1603287082,
          "upvotes": 1,
          "replies": {}
        },
        "g9pv3hs": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9pv3hs/",
          "text": "of course that is ideal, but this is obviously not an ideal situation. it is easy to see how for this person going to the live lecture is much more damaging than beneficial. if they could have a normal schedule during the day in their time zone, they could still section out time to watch the lecture, and be much more receptive to learning as they aren’t having to deal with the stresses of doing work in the crack ass of night. one of my own profs doesn’t require us to attend their live lecture, and i still mostly do bc i also recognize the benefits of being there firsthand to get that knowledge like you. but i have had to watch two of them afterward because of unforeseen circumstances which are much more possible during this pandemic. it would’ve been even more stressful to have to deal with what was going on in my life as well as losing points for not attending the lecture during the slotted time. it is unfair to not be flexible during this time to students’ needs such as these",
          "author": "Nuculu",
          "created": 1603419536,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9i5lta": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i5lta/",
      "text": "I’d say get in touch with your Academic Advisor. Assuming that you’ve contacted the prof and you’re doing your best, if the professors are not being reasonable, the dean needs to know. I’m sure most professors have been given instructions to be understanding. Have specifics ready.",
      "author": "Dorothy_Day",
      "created": 1603248318,
      "upvotes": 1,
      "replies": {}
    },
    "g9i470o": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i470o/",
      "text": "This is why I skipped this year for school. I see no reason to pay full price for a lower quality product. Its understandable that everyone is getting used to this but for me to pay up to 8k a semester to teach myself is stupid. I might just see college differently but if I'm not getting what I'm paying for, then I boycott the system. \n\nOthers may not have the opportunity to put off education like I do, but the message is still there.",
      "author": "RaNDoM123SaLAd",
      "created": 1603247457,
      "upvotes": 5,
      "replies": {}
    },
    "g9i2abo": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i2abo/",
      "text": "Because life sucks bro",
      "author": "donkeykong2369",
      "created": 1603246303,
      "upvotes": 2,
      "replies": {}
    },
    "g9i0mma": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i0mma/",
      "text": "I feel you on this one ... Luckily I made it though the class still, but I basically had to get an A on every assignment.... My first exam for a class closed at 12 in the afternoon, which obviously is a weird time in my experience (past 1-2) years at my college assignments were due 12:00 midnight.... I assumed the exam was due at midnight and obviously I was wrong..... I emailed / texted the teacher within 2 hours 12:00-2:00 pm if she could possibly open the test for me due to my misunderstanding and it was the first test with her, she proudly proclaimed \"school policy says no test retakes, policy is policy\"...... So obviously shitting my pants that I'm getting a 0 on a 50 point exam in a class that only has 300 points total..... The next test, she forgets to make it open on canvas and doesn't open it until 6 hours later we all receive a message \"oops sorry guys! Still getting used to canvas, good luck on your exam\".... The hypocrisy was painful and feel it's exactly what your talking about....... This class was a 9 week course, and I was stressed out beyond belief this entire half semester thinking I may fail the class due to 1 mistake and lose out on my FAFSA/Grants/Scholarships/ funding & GI Bill. Fun stuff.",
      "author": "Wxxz",
      "created": 1603245324,
      "upvotes": 3,
      "replies": {}
    },
    "g9hyyc8": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hyyc8/",
      "text": "They don’t. Check r/professors",
      "author": "ABlackShirt",
      "created": 1603244352,
      "upvotes": 5,
      "replies": {}
    },
    "g9hmtot": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hmtot/",
      "text": "[deleted]",
      "author": null,
      "created": 1603237444,
      "upvotes": -3,
      "replies": {
        "g9pwy4o": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9pwy4o/",
          "text": "lmao what",
          "author": "Nuculu",
          "created": 1603420378,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9hltas": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hltas/",
      "text": "I’m sorry that your professors are like that but in one of my courses the professor gave the top 1/3 of students an A+ because of the pandemic",
      "author": "randomassname0120",
      "created": 1603236861,
      "upvotes": 3,
      "replies": {}
    },
    "g9hlb4s": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hlb4s/",
      "text": "I'm a college professor and all we hear from administration is to suck it up and bend over backwards for students right now, with no acknowledgement of what we have to deal with.",
      "author": "AerosolHubris",
      "created": 1603236567,
      "upvotes": 4,
      "replies": {
        "g9pwafw": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9pwafw/",
          "text": "totally understandable and it sucks what profs are going through. reading through the comments it just seems to be different from institution-to-institution tbh. some profs are being more lenient, while others are multiplying the workload and being overall more harsh. i’ve seen that other profs have told OP what kind of you guys are having to go through and they acknowledged it’s hard for y’all as well",
          "author": "Nuculu",
          "created": 1603420077,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9hk3g2": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hk3g2/",
      "text": "I graduated last spring, but all my best professors gave us slack. I ended up learning more in those classes because it was fun and I wanted to learn, while the hardo professors just made me stress out, shut down and do the bare minimum",
      "author": "SkiMonkey98",
      "created": 1603235869,
      "upvotes": 2,
      "replies": {}
    },
    "g9hjjz5": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hjjz5/",
      "text": "Im not a professor in the US so it may be different, like my students usually pay around 2k isd per year for tuition.\n\nEven if your tuition is high, then the prof isn't getting paid enough to deal with this.\n\nOnline learning takes a lot more effort on the profs side(I have given and taken classes online) and we do not get any extra pay for this. We usually do not have any extra time to try it out before the class, so problems will occur. \n\nAlso most profs at my uni still use flip phones. Its a pretty big sign that they need a lot of time to adjust to new technology, whereas students are still young and highly adaptable. \n\nThere's another big thing. If you can't use the software or have an issue on your end, you can just ask your friend to borrow their comp/show you how it works/use their WiFi. This is usually not a possibility for profs at all. \n\nI still have to commute 3 hours daily on top of giving lessons and grading tests(no TAs because im still young) . I simply don't have any possibility of testing a connection before class. \n\nJust remember that your prof is overworked and undercompensated for his qualifications.",
      "author": "RPSisBoring",
      "created": 1603235559,
      "upvotes": 7,
      "replies": {
        "g9it58q": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9it58q/",
          "text": "US students pay up to 30k a year or more.",
          "author": "ChronoZ52",
          "created": 1603267807,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g9hi7uj": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hi7uj/",
      "text": "because they are in charge and make the rules",
      "author": "Miikeymt",
      "created": 1603234795,
      "upvotes": 1,
      "replies": {}
    },
    "g9hhkg6": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hhkg6/",
      "text": "I can understand not making it easier. Though it is a pandemic, and everyone is struggling that much more, they have to keep to the same expectations and possibly or probably take covid into account down the line. My issue is when professors issue more busy work saying that since we’re gone now, we have more time. They load on more work expecting us to have a easier situation when some and many people are in a much more difficult environment.",
      "author": "ansonnnn",
      "created": 1603234431,
      "upvotes": 3,
      "replies": {}
    },
    "g9hfpjt": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hfpjt/",
      "text": "I have a professor who is uploading a video of his lecture for the second class \"because [he] doesn't want to repeat what [he] just said\"",
      "author": "secondtrex",
      "created": 1603233405,
      "upvotes": 3,
      "replies": {}
    },
    "g9hfmfl": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hfmfl/",
      "text": "I have one professor who just uses recorded lectures that they made last semester or over the summer, and their zoom sessions are just reserved for doing class quizzes or projects...\n\n***That take an hour and 30 minutes, the normal time he could be using to lecture instead of just using recorded video lectures.***\n\nAnd then he blames us for not learning enough. Like??? Why are these professors forcing students to do more work than would normally be required? Why am I having to go out of my way to watch lecture videos you recorded months ago instead of just watching you lecture live over zoom? I have another professor who doesn't even do zoom sessions, he just posts recorded video lectures to our college's LMS alongside some homework and mini essays. To be fair, he gives students the work at the begining of the week and gives us until 11:59 pm on Sunday to submit things, so I'm willing to be more lenient with him as he gives students the time they need. However, I have one professor who DOESN'T. EVEN. RECORD. VIDEO. LECTURES. HE DOESN'T LECTURE. AT ALL. He just gives us **auto-graded assignments** (save for a discussion assignment that happens every other week or an essay test) that open on Wednesday each week and close ON FRIDAY. AT NOON. We basically have two and a half days to do all assignments in the class for the week that are majorly AUTO-GRADED. Like, if you're going to make most assignments auto-graded anyways, why don't you give students all the time they need to complete them? I can understand if you were having to hand-grade assignments, but 95% of the assignments are just auto-graded. This professor has me stressed trying to do 5-6 assignments in a two day window. \n\nHonestly, with the online format, it seems like most professors are getting a break. They can just post video lectures they recorded months ago - or better yet, not go through the effort to record/do lectures at all - to the class and give auto-graded assignments. It cuts their grading and overall work required in half while forcing students to go out of their way to do more work for the class than required. Professors who are using the online format as a way to be lazy and force students to do more while not offering leniency legitimately piss me off.\n\nKeep in mind, I know that not all professors are being lazy with the online format, and I appreciate the professors who do put in the work for the class while being understanding to students. Professors who are still doing their job to the best of their ability with the online format and are not cutting corners - I salute you! Keep being great, I'm sure your students are grateful to have you as their professor this semester.",
      "author": "ThoughtCenter87",
      "created": 1603233356,
      "upvotes": 4,
      "replies": {
        "g9ibexo": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ibexo/",
          "text": "This made me smile...on Monday none of my students came to class. None. Not a single person. I gave an entire hour long presentation to an empty room just so it could go out on Zoom. My commute is 40 minutes, I drove in the rain, gave my organized presentation, and went back to my office to feel sad.",
          "author": "Cuzcopete",
          "created": 1603252078,
          "upvotes": 3,
          "replies": {
            "g9ig6px": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ig6px/",
              "text": "I am so sorry to hear that, that is terrible. I sincerely hope that doesn't happen to you again. \n\nI'm glad I was able to make you smile, though. It's clear you're passionate about your job and are seriously committing to it.",
              "author": "ThoughtCenter87",
              "created": 1603255582,
              "upvotes": 1,
              "replies": {
                "g9igyq5": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9igyq5/",
                  "text": "Actually I cancelled class for tomorrow so I can think what to do....likely starting friday I will just teach from my office via Zoom and forget trying to do it in an empty room. Doing hybrid is terrible, it's not possible to teach in a room and on line at the same time. Its 2 different approaches and they just dont fit together. Plus I do hand grade all assignments and write extensive comments to help students improve. I am very close to quitting my job because the pressure and disappointment is overwhelming. I love my subject, really want to inform my students but this whole semester is just crap and there is no one to turn to for help. Everyone is left to figure it all out by themselves. If you think it sucks to be a student now, I can guarantee it sucks to be a professor.",
                  "author": "Cuzcopete",
                  "created": 1603256197,
                  "upvotes": 4,
                  "replies": {
                    "g9k8892": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k8892/",
                      "text": "Plus teaching hybrid/hy-flex is literally three times the work.",
                      "author": "Jooju",
                      "created": 1603301980,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "g9iisxo": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iisxo/",
                      "text": "I've heard other professors in this subreddit talk about similar issues. Are there any advisors or professors you can speak to about this? Somebody might be able to offer help.\n\nAnd yes, I do agree that this isn't easy for professors either. You're being pressured to adapt to an online system for classes while maintaining the same quality of education, which online simply is not possible, especially without the normal face-to-face interactions and physical work like hand-grading. I've had professors print tests out that students have done, hand-grade them, and then take pictures of the hand-graded papers to send to students for feedback, however I know that's rather tedious and you shouldn't have to go through those extra steps. I'm sorry that despite your clear passion for your subject this semester has taken a toll on you.",
                      "author": "ThoughtCenter87",
                      "created": 1603257720,
                      "upvotes": 1,
                      "replies": {
                        "g9ikmm3": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ikmm3/",
                          "text": "No, there is no one. I'm the only member of my department who comes to the office every day, all day. It's a 40 minute commute each way for me, so I stay and work, plus I like the idea of being part of the campus community: being out on central campus, going to the library, eating in the union, listening to the marching band rehearse, all of the campus experience. But it's just me and a secretary. I recently stopped by the Faculty Excellence office to see what workshops & training are available, but they are closed with a sign saying it's all online now. There is no one to help anyone.",
                          "author": "Cuzcopete",
                          "created": 1603259291,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9k7k0u": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k7k0u/",
          "text": "I might be able to provide some insight into these decisions, but some of it might come off as defending a bad course design and I hope you'll forgive me for that. I'm willing to grant that the classes/professors you're referencing are less than ideal, if not outright shitty. \n\nFirst thing to know is that generating online materials takes much more time than you're realizing. **Teaching online is not a break; it is a nightmare.** \n\nEverything takes more time because everything needs to be extremely structured. This goes for every assignment, but it multiplied by all the small learning objectives in the curriculum that normally can be handled informally, and which now need extremely specific instructions and assignments. These \"extra\" assignments were always there, but now they looks to students like bullshit busywork—and to be fair, when poorly done, it is identical to bullshit busywork. \n\nYour professor probably fell back on this (terrible) format for the class because all he had was terrible options. It is almost certainly because of cheating. If permitted, everyone would just google all the answers. This happens constantly; studies show it, students admit it, everyone knows it. Cheating degrades the quality of the degree you are paying for. Time limits and proctoring help to mitigate cheating in online classes, and that's why he would use those. \n\nBut, using synchronous time for testing instead of lecture/discussion sacrifices the best way to learn. It is absolutely a bad course design. Worse, he is being his own proctor, and I guarantee he hates it. But, surprise, proctors are in high demand right now, and your professor is likely forced into doing it himself. \n\nNow, at this point, there is a \"better\" alternative, but you're going to hate it even more. The best learning outcomes are gained from open-book critical essay exams. That's the only thing that gets around all these problems without sacrificing the quality of the education. It is also the only way to get all the things you're asking for. Buuuut, these types of exams are really fucking hard. Students hate them. They require a high level of knowledge, critical thinking ability, and writing skill. It is not practical for every course to do this—especially if you're still building the required skillsets and knowledge for critical writing in your field. \n\nSo, having no real access to the better choices, we're back to self-proctoring and video lectures.",
          "author": "Jooju",
          "created": 1603301664,
          "upvotes": 3,
          "replies": {}
        },
        "g9imxbr": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9imxbr/",
          "text": "How lucky for your professor that you’re willing to be more lenient with him!",
          "author": "Blackberries11",
          "created": 1603261416,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9hf6fz": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hf6fz/",
      "text": "I agree. I'm very fortunate that I have extremely understanding instructors, but my mental health is pretty much shot and this is probably my worst semester so far in terms of mental health (which is saying a lot considering I was >!borderline suicidal !<my very first semester in fall 2017).  The amount of times I have had a mental breakdown in the past 2 months is...definitely not healthy.",
      "author": "MiyaDoesThings",
      "created": 1603233113,
      "upvotes": 3,
      "replies": {}
    },
    "g9hd7lg": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hd7lg/",
      "text": "For me, I feel the workload has \\*increased\\*. I have one professor who has not posted a single lecture (besides a quick 3 minute hello video on youtube). This week alone I was assigned to read a 400-page book, watch two, two-hour long videos on youtube and read a few articles, to answer questions. This is for just one of my four classes. In another class I have a 300pg book, 50pgs of textbook reading, and the beginning of a 9pg essay to start by the end of the week. I literally am on my laptop, studying etc all day and can't keep up! If I were still working I don't know if I could do it. I'm so thankful I am able to stay at home with my family in this time though. Ok wtf am I doing. Back to studying. (I'm just an undergrad working on gen eds and one upper division btw)",
      "author": "Sunnyroses",
      "created": 1603232048,
      "upvotes": 9,
      "replies": {
        "g9kdhe1": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9kdhe1/",
          "text": "I finished studying at midnight, and now I'm back at it again. This is college :(",
          "author": "Sunnyroses",
          "created": 1603304454,
          "upvotes": 1,
          "replies": {}
        },
        "g9nz8hx": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9nz8hx/",
          "text": "This is crazy!  I am a prof and I reduced the amount of material I am covering this semester because I realize that it is harder on me and my students this semester.  What kind of f'ing sadists assign more?",
          "author": "Amateur_professor",
          "created": 1603386895,
          "upvotes": 1,
          "replies": {
            "g9qotnt": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9qotnt/",
              "text": "I'm doing alright, kind of skimming through some of the material. I also received an extension for one of my assignments. I'm not sure if the professors assigned more material or if I simply chose classes that happen to require a lot of heavy reading even under normal circumstances. But hey, winter break is right around the corner! We've got this.",
              "author": "Sunnyroses",
              "created": 1603442218,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9h9yin": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h9yin/",
      "text": "I truly believe nothing has changed, but online does expose the worst from the college system: admin, professors, and students. \n\nI’ve had good and bad experiences during this time with admin and professors.",
      "author": "GAAPisCool",
      "created": 1603230628,
      "upvotes": 8,
      "replies": {}
    },
    "g9h8u7b": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h8u7b/",
      "text": "My History proff was an actual G and gave us 2 passes so we could strike any 2 assignments of our final grade. But got to agree with you, that only class I've seen that in and other profs of mine are given more work than ever",
      "author": "SilverLightning926",
      "created": 1603230156,
      "upvotes": 2,
      "replies": {}
    },
    "g9h8exs": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h8exs/",
      "text": "My math class online is with an older professor and it is kind of...not great quality. I'm sure they are fine in person but Zoom makes it so bad. I'm honestly worried I'm going to fail.",
      "author": null,
      "created": 1603229976,
      "upvotes": 1,
      "replies": {}
    },
    "g9h7quw": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h7quw/",
      "text": "Yeah it's fucking bullshit. My A&P2 professor is honestly the biggest idiot I've ever come across. ~65% of our total grade is labeling pictures of pig dissections. The pictures he gives us are nice and neat, very easy to tell everything apart, but in the videos he posts it doesn't even look like he is dissecting the same organism. His camera I swear to god only renders in 360p I shit you not, his room is full of red lighting and what little you CAN see just blurs together. The fact that he expects us to understand what he is doing while we can't see it is ridiculous. Grades very harshly too, and half of the stuff he's asking us to label, I get \"no results found :(\" from multiple search engines when I try to look up legible diagrams to use as a reference. It's a fucking scam.\n\n\nAnd don't even get me started on the profs that grade attendance jesus christ... \"You're in college now, be a responsible adult. Oh you can't make it to class because you have a job you work to pay the bills you have? Tough luck, kid. Even though all of the live lectures are recorded and posted online, go fuck yourself! :D\"",
      "author": "Big_Goosh",
      "created": 1603229688,
      "upvotes": 1,
      "replies": {
        "g9itjd2": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9itjd2/",
          "text": "imagine grading attendance in a math class that has every class meeting recorded. Oh that same Proff has no due dates in canvas or the syllabus and he dead ass likes to tell us the day before, \" You have a 20 question test due tomorrow. I want each question done step by step( doing any step of an equation in your head = -6 points). I will upload it today at 4pm and its due tomorrow at 10am.\"  Did i mention class his class is 11-12pm.",
          "author": "ChronoZ52",
          "created": 1603268243,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9h6ad7": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h6ad7/",
      "text": "Preach!\nAnd my teacher which we never meet with refuses to email anyone Friday-sunday",
      "author": "Kalbex",
      "created": 1603229080,
      "upvotes": 1,
      "replies": {}
    },
    "g9h5tru": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h5tru/",
      "text": "Seriously I'm doing pretty bad in most of my classes but no fuck me right. But a professor can take a month to return grades...at this point it may be smarter to wait until this bs is over",
      "author": "itsjosh18",
      "created": 1603228879,
      "upvotes": 2,
      "replies": {}
    },
    "g9h4eeu": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h4eeu/",
      "text": "Just here to say that not every professor is an asshole\n\nMy college is doing fairly good, first 2 weeks of the semester all classes were on teams, now I have 6h of teams classes per WEEK and everything else is either on youtube or google disk and students can watch it whenever they want\n\nOne professor doesnt have us redo assignments \"I dont want to stress you too much so you got an E and try better next time\" + detailed description of what we did wrong\n\nIn general most our professors try to do as much as they can to help us- there are only 8 of us with this major on 4000+ students college (4000+ is quite a lot for my country), so that probably helps us tho",
      "author": "user975A3G",
      "created": 1603228278,
      "upvotes": 1,
      "replies": {}
    },
    "g9h3im5": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h3im5/",
      "text": "Most schools do not allow recorded lectures if students can be heard (or seen). And they do not allow a class — that is billed as synchronous — to be taught in an asynchronous fashion using prerecorded lectures. \n\nIt sucks, but here is what you can do. Open up a private zoom meeting and record yourself seeming interested. Save that recording and use it as your virtual background when you have to attend a stupid zoom class/lecture/meeting that you would rather avoid. Use that virtual background to handle attendance and use software like OBS to record the class/lecture/meeting. I should add that not all laptops/computers can handle this approach.",
      "author": "duckbrioche",
      "created": 1603227913,
      "upvotes": 1,
      "replies": {}
    },
    "g9gynin": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gynin/",
      "text": "Lol I have NEVER heard this. Professors are constantly told to give students slack though",
      "author": "Blackberries11",
      "created": 1603225940,
      "upvotes": 7,
      "replies": {}
    },
    "g9gxam1": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gxam1/",
      "text": "Are you kidding?    \n\n\nI don't know about other classes, but I feel like I'm giving my students so much slack that I'm doing them a disservice.",
      "author": "emarcomd",
      "created": 1603225393,
      "upvotes": 4,
      "replies": {
        "g9gxt5u": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gxt5u/",
          "text": "Well you're not my professor and this was obviously not targeted at you specifically considering I have no clue who you are. I'm glad you're giving them breathing space. I hope they aren't taking advantage of it to mess themselves up. GL",
          "author": "CrazyTechq",
          "created": 1603225599,
          "upvotes": 5,
          "replies": {
            "g9h31yg": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h31yg/",
              "text": "I thought for sure ALL instructors were being told to be lenient.....",
              "author": "emarcomd",
              "created": 1603227721,
              "upvotes": 3,
              "replies": {
                "g9ij88f": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ij88f/",
                  "text": "We were told to accommodate everything and to stop taking attendance. Honestly I would be happy to end the semester now.",
                  "author": "Cuzcopete",
                  "created": 1603258076,
                  "upvotes": 3,
                  "replies": {}
                },
                "g9saybi": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9saybi/",
                  "text": "I wish that were the case for one of my classes. One of the most rigorous courses offered at my school and my professor sent us an email telling us that we were bad students and won't get far in our professional careers because we all took an exam the day it was due, even though we all finished within the deadline given. She was pissed off that she couldn't spend her week grading. She's been a total nightmare the whole semester with similar incidents, which has made this already hard semester even worse.",
                  "author": "rolesecure",
                  "created": 1603479284,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9gw6cs": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gw6cs/",
      "text": "In my summer class I had a professor who would give us 2hour long videos from youtube to watch then quiz us solely on the video, but then also quiz us on the actual class content. She said the 2 hour video was to make up for the class time we weren't attending. Why are we watching and being graded on videos that barely correlate with what we're actually doing? There was so mu h extra unneeded imfor being added to the work load for no reason. Why not just video tape yourself doing 2 lectures?",
      "author": "vness1213",
      "created": 1603224949,
      "upvotes": 2,
      "replies": {}
    },
    "g9gr3j2": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gr3j2/",
      "text": "Academic integrity is one of the two major reasons, alongside professors wanting their own lives to be easier, without concern for their students.\n\nIf someone is late, that’ll mean the professor will have to accommodate them, which means more work for them. They don’t want more work.\n\nSecondly, academic integrity is very important to schools because it reflects their reputation, and thus the money they’ll receive and all that.\n\nThere’s a reason why one of the few surefire ways tenured professors can be fired is academic dishonesty.",
      "author": "CalmingVisionary",
      "created": 1603222752,
      "upvotes": 1,
      "replies": {
        "g9ijo2v": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ijo2v/",
          "text": "As a professor I have a different perspective. I have concern for my students and I try to accommodate as I can. But if I offer extra time for one then I need to be fair and offer extra time for everyone. How much extra time? Days, weeks, months? Should everyone get a chance to revise every assignment? How many revisions? Should I expect academic integrity from my students?",
          "author": "Cuzcopete",
          "created": 1603258456,
          "upvotes": 2,
          "replies": {
            "g9ir1cm": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ir1cm/",
              "text": "That’s very true, and you should be impartial. However, there are many professors for whom they don’t want more work, particularly since for many teaching is merely a requirement for their jobs as researchers and scientific investigators.\n\nThen there are others who act as if class happens in a vacuum.\n\nNot every Professor is as considerate as you. If anything, the pandemic only made them more vicious or more apathetic.",
              "author": "CalmingVisionary",
              "created": 1603265493,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g9gqj2m": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gqj2m/",
      "text": "[deleted]",
      "author": null,
      "created": 1603222484,
      "upvotes": 25,
      "replies": {
        "g9ivk3w": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ivk3w/",
          "text": "What is pass/fail?",
          "author": "pavi2410",
          "created": 1603270560,
          "upvotes": 1,
          "replies": {
            "g9ivkhi": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ivkhi/",
              "text": "\"Pass/Fail\" is the fifteenth episode of the fourth season of the NBC science fiction drama series Heroes, and the seventy-fourth episode overall. The episode aired on January 18, 2010.\n\nMore details here: https://en.wikipedia.org/wiki/Pass/Fail \n\n\n\n*This comment was left automatically (by a bot). If something's wrong, please, report it.*\n\n*Really hope this was useful and relevant :D*\n\n*If I don't get this right, don't get mad at me, I'm still learning!*",
              "author": "wikipedia_answer_bot",
              "created": 1603270572,
              "upvotes": 12,
              "replies": {
                "g9ivnv6": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ivnv6/",
                  "text": "Good bot",
                  "author": "pavi2410",
                  "created": 1603270679,
                  "upvotes": 3,
                  "replies": {
                    "g9ivo8t": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ivo8t/",
                      "text": "Thank you, pavi2410, for voting on wikipedia_answer_bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                      "author": "B0tRank",
                      "created": 1603270692,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ga56xk6": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga56xk6/",
          "text": "And then you really hope you aren’t a student at that school trying to get into medical school, where even COVID related pass-fail grades are going to make you much less likely to get in than someone else at a school with letter grades. \n\nThere are pros and cons to everything.",
          "author": "Eigengrad",
          "created": 1603693015,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9gp2pa": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gp2pa/",
      "text": "I understand professors wanting students to attend class live but I think they should be recorded too. Professors could incentivize students to show up to class *and* accommodate for those that can't/don't by simply offering extra credit for attending.",
      "author": "msief",
      "created": 1603221808,
      "upvotes": 3,
      "replies": {
        "g9pw43m": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9pw43m/",
          "text": "yeah i think is the best option too. personally, my prof does live lectures and records them, but doesn’t do attendance. i go to them bc i learn/focus better watching something live than later, but i bet even more people would show with some incentive. the recorded part is really helpful bc even for me who tries hard to go to each one has had to go back and watch a few just bc of random events",
          "author": "Nuculu",
          "created": 1603419994,
          "upvotes": 2,
          "replies": {
            "g9rg0b8": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9rg0b8/",
              "text": "Yeah I lose focus sometimes and it can derail the rest of the lecture for me.",
              "author": "msief",
              "created": 1603463761,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9goaap": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9goaap/",
      "text": "Honestly I feel like I'm given too much slack. I'm terrible at self discipline when it comes to working and this has shown up in my classes. My teachers have reached out to me and given me a lot of grace and I don't want to abuse that.",
      "author": "PocketElephant150",
      "created": 1603221439,
      "upvotes": 3,
      "replies": {}
    },
    "g9gntot": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gntot/",
      "text": "My professors have been good about accepting late work and extending deadlines for major papers, and my uni has allowed students to take all of their fall 2020 courses pass/fail (up from a max of one course). I’m grateful for that because the online format, pandemic, economic crisis, and the upcoming U.S. election have taken a toll on my mental health. \n\nAt the same time, I wish they would understand that these are difficult times and that zoom class just isn’t the same. Like, I don’t think participation being a quarter of my grade in one course is a good idea, it’s hard to speak up during a zoom class (my uni is completely online during covid). We have to give professors plenty of flexibility, I would think that could be reciprocated.",
      "author": null,
      "created": 1603221220,
      "upvotes": 2,
      "replies": {}
    },
    "g9gnlys": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gnlys/",
      "text": "What is the real reason so many classes are online and university presidents are allowing profs and TAs to teach from home (though many just post videos, often not of their own teaching but YouTube etc)?\n\nIs it liability?\n\nBecause isn't there a big liability for students' mental health, too?",
      "author": "sunshinedayhere",
      "created": 1603221117,
      "upvotes": -2,
      "replies": {
        "g9gpb5m": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gpb5m/",
          "text": "Umm the real reason is idk... Maybe the pandemic??",
          "author": "CrazyTechq",
          "created": 1603221915,
          "upvotes": 8,
          "replies": {
            "g9h05hy": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h05hy/",
              "text": "Most campuses have close to zero hospitalizations. Profs are living in fear while Admins are afraid of getting sued, and students are paying for low quality schooling. I'm just saying, Admins should be afraid of the adverse effects of mental health, too. Then perhaps they will start running their universities properly.",
              "author": "sunshinedayhere",
              "created": 1603226566,
              "upvotes": -4,
              "replies": {
                "g9h2l3j": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h2l3j/",
                  "text": "Ahh you're one of those. Clearly you don't understand how virus' work",
                  "author": "CrazyTechq",
                  "created": 1603227535,
                  "upvotes": 6,
                  "replies": {
                    "g9hwdkf": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hwdkf/",
                      "text": "Judging from the reply they gave you, that seems to be the case.  I can find articles calling the \"viruses lose virulence\" statement into question without even trying.  Don't even need to touch the other part of it.",
                      "author": "LadyWolfshadow",
                      "created": 1603242852,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "g9h42z4": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h42z4/",
                      "text": "Oh, I do. Viruses lose virulence as they travel through a population. That's why the #deaths are declining...not to mention they were overstated. (if you believe the data, then you also believe that flu is down 95%).",
                      "author": "sunshinedayhere",
                      "created": 1603228144,
                      "upvotes": -3,
                      "replies": {}
                    }
                  }
                },
                "g9p6n2q": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9p6n2q/",
                  "text": "At my school, a medium size midwest university, we have had over 400 students test positive. You are fortunate to be at a school with zero cases. Where is that located?",
                  "author": "Cuzcopete",
                  "created": 1603406384,
                  "upvotes": 1,
                  "replies": {
                    "g9p7v21": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9p7v21/",
                      "text": "I did not say zero cases. I said zero hospitalizations.\nReading comprehension matters.",
                      "author": "sunshinedayhere",
                      "created": 1603407058,
                      "upvotes": 1,
                      "replies": {
                        "g9p87ri": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9p87ri/",
                          "text": "And so does truth.",
                          "author": "Cuzcopete",
                          "created": 1603407253,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9ijwry": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ijwry/",
          "text": "I keep wondering why more students don't come to class. Why are they allowed to learn from home? Maybe it's that pandemic thing,..",
          "author": "Cuzcopete",
          "created": 1603258663,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9gnbnw": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gnbnw/",
      "text": "Since Administration runs University as a business then why the hell am I not treated like a paying customer?? I have to accept a shitty Professor’s methods, no grading of assignments through out the semester so I know what I need to improve, short and almost non-existing office hours, plenty of attitude, no posting of vital class material on time, no recordings of zoom class meetings, no use of University Facilities, and paying to “apply” for graduation and For the actual diploma...This unique form of hell we PAY THOUSANDS PLUS INTEREST for. We give up our autonomy to these assholes to dictate their  most convenient and flexible terms FOR THEMSELVES not The STUDENT! They have guaranteed employment through tenor or union membership...so there’s no getting rid of them and the adjuncts are chomping at the bit for consistent employment and eventual possibility at tenor—-so they are more than willing to follow orders despite the lunacy of their policies towards students, we PAY to be in a dictatorship...(and you better say Thank you for the privilege)...Can you imagine this scenario outside of a University setting...EDUCATION benefits from the perception of respect and sanctity of enriching lives and uplifting humanity’s potential...Education now however has become a lucrative BUSINESS to line their pockets!!",
      "author": "RomanLion29",
      "created": 1603220974,
      "upvotes": -1,
      "replies": {
        "g9ik3i6": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ik3i6/",
          "text": "No one is required to go to college. Lots of folks learn their job without a college degree",
          "author": "Cuzcopete",
          "created": 1603258826,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g9gm90r": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gm90r/",
      "text": "This could have been an amazing opportunity to try something new and flip the script on some of the old education methods that just don't work now. But nope, most teachers and professors just decided to try to bring the pre-existing model online with lot more tests and deadlines because they think just because we are home, our productivity must have quadrupled.",
      "author": "reddituser20-08",
      "created": 1603220450,
      "upvotes": 5,
      "replies": {
        "g9hiwo6": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hiwo6/",
          "text": "ikr. my school is now cutting spring break and other free holidays because they think it's more productive to just do online class instead :(",
          "author": "Oro-Lavanda",
          "created": 1603235185,
          "upvotes": 2,
          "replies": {
            "g9i1o1o": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i1o1o/",
              "text": "Wtf kind of prison school do you go to? Satan’s University? That’s awful. I’m so sorry my dude. I was just scrolling through comments and getting more and more shocked at how awful everyone is getting treated. I got my associate’s in June and took a break and am so glad I did. This all seems terrible.",
              "author": "McSmashley",
              "created": 1603245934,
              "upvotes": 5,
              "replies": {}
            },
            "g9i2oo9": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i2oo9/",
              "text": "Yep. We'll also have no summer or winter breaks in our college too for the same reason.",
              "author": "reddituser20-08",
              "created": 1603246544,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g9ibw8i": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ibw8i/",
          "text": "I eliminated all my exams and quizzes and now just have small weekly projects alternating between watching a documentary & writing a response paper and reading an article & answering 5 questions. You would be surprised how many students dont turn in 1 or more of these. Out of the 6 weeks some students have submitted just one or two. Soon they will send an email asking if they will pass the course.",
          "author": "Cuzcopete",
          "created": 1603252411,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9gm78k": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gm78k/",
      "text": "Yea and they aren’t taking into account the toxic home situations many of us students have.",
      "author": "mathathon1234",
      "created": 1603220426,
      "upvotes": 19,
      "replies": {
        "g9je6wl": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9je6wl/",
          "text": "this! i’ve missed like six lectures and more parts of lectures because my mom thinks she can control when i have my laptop even though i have responsibilities i need to take care of",
          "author": "discther",
          "created": 1603286829,
          "upvotes": 4,
          "replies": {
            "g9k7eai": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k7eai/",
              "text": "Yes, i just moved out to my relatives house because I couldn’t deal with the situation anymore, Fell very far behind and now I have to work 110% harder to get caught up. Its very unfair and I wish I could have taken the semester off, but it wasnt an option for me, really sucks",
              "author": "mathathon1234",
              "created": 1603301588,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9gly1l": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gly1l/",
      "text": "I’m just here to complain about that one teacher who insists on having in-person meetings. Like, students actually have to LIVE on campus for your single class.",
      "author": "PaleoNimbus",
      "created": 1603220304,
      "upvotes": 7,
      "replies": {}
    },
    "g9gl47s": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gl47s/",
      "text": "Come check out r/newzealand I wish we had the chinse virus pandemic. I've been studying like crazy for finals.",
      "author": "Orthadondist_nothere",
      "created": 1603219903,
      "upvotes": -10,
      "replies": {
        "g9gll9b": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gll9b/",
          "text": "What a flex. Call it the american virus now",
          "author": "CrazyTechq",
          "created": 1603220133,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9ghayi": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ghayi/",
      "text": "“What’s that? There’s a pandemic? Let me just make life easier for everyone but students. Let me make classes harder, add much more work, make them stay up later to attend lectures, and raise tuition”",
      "author": "ElBarro69",
      "created": 1603218079,
      "upvotes": 8,
      "replies": {
        "ga57g8z": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga57g8z/",
          "text": "I mean, the flip side for faculty is that classes are harder, grading and managing courses are much more work, I’m having to be up at all hours, working weekends and teaching night classes to accommodate student schedules, and I got a huge pay cut on top of it all because of COVID. \n\nSo I would say things are hard all around.",
          "author": "Eigengrad",
          "created": 1603693536,
          "upvotes": 1,
          "replies": {
            "gbsynsw": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gbsynsw/",
              "text": "Yeah, but you’re doing all that and being paid. Students are doing that much work AND paying someone else to do it. Getting an education is hard work and you don’t even get paid to do it. You gotta pay someone else to facilitate the work. Can you imagine paying the university so you can stay up at all hours, work weekends, teach night classes to accommodate student schedules, grade papers and manage courses?",
              "author": "makeitdooz",
              "created": 1604989003,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9gezyo": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gezyo/",
      "text": "I also hate how there's typically no late grades now that all of the work is submitted online. It's so easy to miss a assignment and want to do it when you notice you missed it but you can't because the assignment deadline is locked and you can't submit anything. Even though it would've been graded by a fucking computer.",
      "author": "Apple_Chef",
      "created": 1603216974,
      "upvotes": 29,
      "replies": {
        "g9gud0a": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gud0a/",
          "text": "[deleted]",
          "author": null,
          "created": 1603224219,
          "upvotes": 10,
          "replies": {
            "g9i4ghb": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i4ghb/",
              "text": "The available and due by date system is instituted by Canvas and we have little control over that. The syllabus is your best calendar.",
              "author": "crimbuscarol",
              "created": 1603247612,
              "upvotes": 0,
              "replies": {
                "g9i4rgn": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i4rgn/",
                  "text": "None of the assignments are in the syllabus let alone when they'll be due, or in the actual calendar. One of my classes doesn't even have dates the exams will take place on the syllabus and told us when we'd have it three days beforehsnd. I'd just appreciate some warning.",
                  "author": "bubblegumpandabear",
                  "created": 1603247796,
                  "upvotes": 3,
                  "replies": {
                    "g9i4tg8": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i4tg8/",
                      "text": "Holy shit. You have bad, bad professors then. I’m sorry.",
                      "author": "crimbuscarol",
                      "created": 1603247830,
                      "upvotes": 0,
                      "replies": {
                        "g9i52n2": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i52n2/",
                          "text": "I honestly believe they're technologically inept. I had to send one of them a tutorial on breakout rooms for zoom on the first day of classes. I found out while talking to another professor that they generally don't understand how zoom looks on our end, so I think they're just confused. I'm define going to tell them about these issues in the end-of-semester-survey.",
                          "author": "bubblegumpandabear",
                          "created": 1603247985,
                          "upvotes": 2,
                          "replies": {
                            "g9i5fex": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i5fex/",
                              "text": "I help my 68 year old colleague with this stuff daily. She is using hours of her day trying to navigate canvas. It sucks. It’s her last year before retirement. I feel bad for these people but can also see how it’s hurting the students",
                              "author": "crimbuscarol",
                              "created": 1603248208,
                              "upvotes": 1,
                              "replies": {
                                "g9i5xcz": {
                                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i5xcz/",
                                  "text": "My mom is a teacher and she's been struggling to understand the new online program. She was working super hard to switch everything she had to an online version and could barely understand things like how to make a video through some video-makijg program that automatically uploaded your stuff to the pages of those who needed to see it. I really feel for my professors, it's really hard to get older and for things that should be simple to not be intuitive anymore. But like OP, I wish they'd give us some slack. I'm immunocompromised so I have barely left my apartment since covid hit the USA. Idk it's a stressful time and I hate that it's hurting my grades.",
                                  "author": "bubblegumpandabear",
                                  "created": 1603248519,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9i4btm": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i4btm/",
          "text": "Late assignments can be an absolute nightmare for professors. How late is acceptable? If one student turns it in 5 min late, no problem. I count it. But as soon as you give an inch, students will ask to turn assignments in 7, 10 days even a few weeks later. Instead of grading  an assignment all at once, I will have to consistently go back and check an assignment and regrade. It takes a ton of mental energy and time.",
          "author": "crimbuscarol",
          "created": 1603247536,
          "upvotes": 3,
          "replies": {
            "g9mpr4x": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9mpr4x/",
              "text": "it does suck especially if you don't have a TA or PL to help you but it's part of the job unfortunately. I commend you for accepting assignments 5 minutes late especially during this pandemic. As someone who has had to take on extra jobs just to get through school and also has to take care of my family it has been rough.  I have had several professors and teachers who would not and their defense was \"if it was a job you would be fired\". I now work at the university and I have been late on a few occasions based on my own incompetence or situations beyond my control and never once have I been threatened to be fired because I was honest about what happened and didn't make it a habit.",
              "author": "BecuzMDsaid",
              "created": 1603357135,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9gdrt8": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gdrt8/",
      "text": "My professor literally told us \"I honestly do not care about your feelings\" when some classmates and I were begging her for more assistance and a little slack.\nThe same professor didn't upload her lecture until 11pm due to an emergency, which kinda fucked everyone over.\nWhy they get slack and not us? Who knows",
      "author": "memento_vivere_1101",
      "created": 1603216393,
      "upvotes": 133,
      "replies": {
        "g9hignu": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hignu/",
          "text": "Dude you should report that professor wtf.",
          "author": "Oro-Lavanda",
          "created": 1603234929,
          "upvotes": 48,
          "replies": {
            "g9him3a": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9him3a/",
              "text": "Yea I have the recording of it, a classmate and I are in the process of figuring out how to get just that clip and who to send it to.",
              "author": "memento_vivere_1101",
              "created": 1603235015,
              "upvotes": 25,
              "replies": {
                "g9hkplk": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hkplk/",
                  "text": "Look up your school's ombudsman and contact them. That's basically what they are for. If there is no ombudsman, the head of the department will do. \n\nKeep in mind recording the class may be violating some part of your student agreement. That's why you want to keep it anonymous if you can. Look up your student agreement/code of conduct for any wordage about recording lectures. If it seems they disallow it, then do this anonymously.\n\nIf you are required to sign something to submit a complaint, don't. It most likely contains an agreement that you will not make the dispute public, which just gives them the opportunity to ignore you.\n\nIf you can't submit a complaint without agreeing to reveal your identity or sign an agreement, just drop it on social media anonymously and have your friends share it.\n\nKeep in mind that college administrations are not your ally. They are *at best* neutral and interested in keeping their image clean and their student body enrolled. Don't trust them to do the right thing or not retaliate against you. Instead, appeal to their desire to keep their image clean. Put it on social media and let the student body get riled up. They are more likely to respond to that.",
                  "author": "fullforce098",
                  "created": 1603236224,
                  "upvotes": 19,
                  "replies": {
                    "g9hksxu": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hksxu/",
                      "text": "Can't say I've ever heard of an ombudsman before haha guess I'll look into it and find them, thanks!",
                      "author": "memento_vivere_1101",
                      "created": 1603236276,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "g9hj56f": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hj56f/",
                  "text": "I would give it to two people: your academic advisor and the head of the department the professor is at. So like if your prof teaches history then send it to the head of the history depart, etc. Although id speak to your academic advisor first.  Something similar happened to me as well and my advisor told me to just report it to the head of the department here so good luck.",
                  "author": "Oro-Lavanda",
                  "created": 1603235322,
                  "upvotes": 7,
                  "replies": {
                    "g9hm6nn": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hm6nn/",
                      "text": "They need to double-check to make sure recording the professor isn't a violation of a student agreement before contacting anyone that works for the school.",
                      "author": "fullforce098",
                      "created": 1603237076,
                      "upvotes": 5,
                      "replies": {
                        "g9hoidr": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hoidr/",
                          "text": "It's a zoom recording, like she recorded it not me so I figured its fine",
                          "author": "memento_vivere_1101",
                          "created": 1603238409,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "g9hmtx5": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hmtx5/",
                          "text": "oh ok that makes sense u are right",
                          "author": "Oro-Lavanda",
                          "created": 1603237448,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g9hwp19": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hwp19/",
                  "text": "I work at a college. Department head and PROVOST. the provost is, essentially, over all the Dean's (who are over dept heads).",
                  "author": "ThaddeusJP",
                  "created": 1603243037,
                  "upvotes": 2,
                  "replies": {
                    "g9imioh": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9imioh/",
                      "text": "If a student tried to tell on a professor to the provost for having a one time emergency, I’m sure the provost would think that was absolutely ridiculous.",
                      "author": "Blackberries11",
                      "created": 1603261030,
                      "upvotes": 3,
                      "replies": {
                        "g9jdbud": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jdbud/",
                          "text": "Tbh, the provost would not even read the email— an assistant would.",
                          "author": "Just-a-Prof",
                          "created": 1603286311,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "g9lezo0": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lezo0/",
                          "text": "Thank you for saying this.  Fullforce098 and a few other users are dispensing terrible advice and don't seem to realize it.",
                          "author": "LimuEmuismydad",
                          "created": 1603322925,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9h551h": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h551h/",
          "text": "just reading this makes me angry. if you ever need to talk or vent, my PMs are open.",
          "author": "kazoogod420",
          "created": 1603228580,
          "upvotes": 11,
          "replies": {
            "g9hka7a": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hka7a/",
              "text": "Much love friend",
              "author": "memento_vivere_1101",
              "created": 1603235977,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "glsvzgo": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/glsvzgo/",
          "text": "As a professor I want to punch that professor in the face and then slash her tires",
          "author": "Aussie-of-Skellige",
          "created": 1612311587,
          "upvotes": 2,
          "replies": {}
        },
        "g9hmhbh": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hmhbh/",
          "text": "Who do you think is in change of “giving” professors “slack”? No one. It’s their class. They are in charge of it.",
          "author": "Blackberries11",
          "created": 1603237245,
          "upvotes": -1,
          "replies": {
            "g9imzgd": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9imzgd/",
              "text": "And telling students in their class that they don't care about their students makes them an asshole prof just the same, even if they're in charge of it.",
              "author": "FPSXpert",
              "created": 1603261471,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g9gd3i3": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gd3i3/",
      "text": "The important thing is, do they fix the problems as quickly as possible? If a technology problem is the fault of the instructor or institution you should be given more time for that assignment.",
      "author": "Piglet03",
      "created": 1603216064,
      "upvotes": 1,
      "replies": {}
    },
    "g9gbxt1": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbxt1/",
      "text": "I’ve been dealing with the same issues. My statistics professor is by far the worst professor I have ever had. It is like he doesn’t care and he’s not doing anything in the class. We entirely teach ourselves from the book, his half assed powerpoints that are riddled with errors, and links to short mylab video clips. I tried communicating multiple times with him, which he dismissed or ignored my emails.\n\nI finally contacted the dean of that department and after a couple of emails exchanges where I argued my point, as well as provided solutions, I got resolution. My professor uploaded lecture videos from another professor.\n\n\nThis is what worked for me. \n\n-Log EVERYTHING! \n-Think about what you NEED. (what is missing from the class that is important? ASK FOR IT!)\n-Communicate your needs or concerns with your professors. \n-Communicate with other classmates to see how they’re doing. (You might find people who can help you with the work or allies to go to the dean together.)\n-Utilize any student resources that you can. (Tutoring center, math lab, educational videos, many are available online now)\n-Contact your academic advisor for advice!\n\n(If none of these are working for you)\n\n-Contact the dean of the department or whoever is above your professor. \n——Make sure you provide your evidence(good thing you logged everything). \n——Argue your case (they may try to dismiss it, but DON’T let them if something is really wrong) \n——Provide your own solutions (these are people too and they can’t think of everything) \n\n\nIf you’re failing the class and there is no pulling your grade up, then withdraw and try again next semester with a different professor. IT IS OKAY TO WITHDRAW AND TRY AGAIN! \n\nThis entire situation sucks for everyone and unfortunately not all of us are able to adapt as well as others to the change (professor’s and students).",
      "author": "Ashleemashlee",
      "created": 1603215491,
      "upvotes": 9,
      "replies": {
        "g9h41rx": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h41rx/",
          "text": "Same thing with my calculus professor! For all I know a dog could be teaching this class. This professor just links youtube videos about subjects and expects us to teach ourselves. These aren't even his videos! I emailed him a question about some coursework content and he emailed me back \"Hi, please check out the free tutoring center\". I fucking hate college.",
          "author": "momofmoose",
          "created": 1603228130,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g9gbdl1": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbdl1/",
      "text": "[deleted]",
      "author": null,
      "created": 1603215211,
      "upvotes": 71,
      "replies": {
        "g9him4j": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9him4j/",
          "text": "Hey i think you need to report that professor. That's harassment and also the professor is assuming your social class and background.",
          "author": "Oro-Lavanda",
          "created": 1603235016,
          "upvotes": 32,
          "replies": {}
        },
        "g9hgbgw": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hgbgw/",
          "text": "That seems like legitimate harassment. I believe there are sanctions against professors copy-pasting emails a student sent to them in private and sending them out for a whole class to read, as it violates privacy. On top of that, he was attacking you personally, which is not only harassment but extremely unprofessional. Try bringing this issue up with your school and report the professor.",
          "author": "ThoughtCenter87",
          "created": 1603233739,
          "upvotes": 21,
          "replies": {
            "g9k00ik": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k00ik/",
              "text": "> I believe there are sanctions against professors copy-pasting emails a student sent to them in private and sending them out for a whole class to read, as it violates privacy.\n\nThere's no relevant privacy law or regulation, so it'd have to violate some specific university policy.",
              "author": "bl1y",
              "created": 1603298038,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g9hkdri": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hkdri/",
          "text": "Weighing in as a prof here. If he mentioned you by name, you can get him fired at almost any uni worldwide. If he didn't, then its school policy on the ethics of what he did. But usually he will get reprimanded at the very least if you report this. If you don't, he won't learn and just do it to the next kid.",
          "author": "RPSisBoring",
          "created": 1603236034,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "g9g9m3w": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g9m3w/",
      "text": "My Professor has told us he doesn’t know how to use Canvas..... just in general the entire website. However he will get mad if we have actual technical issues (WiFi going out, computer is too slow) and tells us to get better hardware. How can a grown ass man with a doctorate degree not understand how ridiculous that is?",
      "author": "QueenLatifahClone",
      "created": 1603214334,
      "upvotes": 68,
      "replies": {
        "g9iie0r": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iie0r/",
          "text": "I have students who dont know how to use Canvas. I put everything in there: pdf readings, links to films, instructions for assignments, syllabus, extra things for anyone who is curious about a topic. I do all the upfront work to make it easier for students. This week students wrote a paper over a film....oddly several did not use the assigned film which had the link in Canvas, but instead just went to YouTube and watched something else. How ridiculous is that?",
          "author": "Cuzcopete",
          "created": 1603257371,
          "upvotes": 5,
          "replies": {
            "g9lfabr": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lfabr/",
              "text": "This.\n\nI've had to spend sooooooooooooo time explaining how to click a link, how to find an email in your inbox, and how to search for things...to young people who are supposedly good at all this stuff.  COVID had made me question this whole \"digital natives\" idea.",
              "author": "LimuEmuismydad",
              "created": 1603323094,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g9g8i3l": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g8i3l/",
      "text": "I skipped one lecture for a class that meets 3 times a week cause I needed a mental health day and my professor emailed me reminding me that participation is a part of my grade. Feels bad man.",
      "author": "parkermod",
      "created": 1603213789,
      "upvotes": 11,
      "replies": {
        "g9gyazs": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gyazs/",
          "text": "I don't get why professors get so offended when you don't attend their class. It's not affecting then in any way besides maybe having to answer some questions, but is it really THAT much of an inconvenience? \n\nI remember spring semester I had a MWF class. However the second week of class I had an important 3day EEG I had to do for my epilepsy. With an \"at home EEG\" I have dozens of wires ATTACHED TO MY HEAD connected to a little device that's so expensive that the hospital only had 5 to lend out because they said it cost too much to get multiple machines. I literally had to WAIT to be able to get the EEG because someone else was using it. And I commuted from the city to a college town. So I obviously wasn't going to travel almost 2 hours on public transportation and attend multiple classes with an expensive heavy  machine attached to my head smelling like 3 day old chemicals. My professor was SO mad about it. She said I shouldn't have scheduled something that long during the school year. I told her that my neurologist decides when I can take the EEG (if you're still having seizures they're not gonna test you to see if you have seizures lol), and that I also had to wait to be able to use the machine, and she said either way it was irresponsible. What do you want me to do? I'm trying to get cleared to drive and this was the earliest I could get it done. The rest of the semester she treated me like shit. Wouldn't call on me in class if I raised my hand but when she had hard questions that no one knew the answer to she would call on me and I'd get it wrong and she'd embarrass me in front of everyone. For my final project she gave me a 95% then 4min later I got an update on my grade and saw that she lowered it to a 90% yet her feedback for that grade was the same as it had been when I had the 95%.",
          "author": "vness1213",
          "created": 1603225797,
          "upvotes": 12,
          "replies": {
            "g9h9buf": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h9buf/",
              "text": "Sounds like a straight cunt.",
              "author": "Big_Goosh",
              "created": 1603230363,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "g9jjhci": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jjhci/",
          "text": "What do you mean by mental health day? If you have a problem with logging into a class on a lecture day, you should email your professor. Also, a professor doing that is incredibly helpful, I wish I had classes that would count merely doing the bare minimum of participation as a factor in my grade. I don't mean to sound rude, but I have trouble sympathizing with you when you describe it as a mere \"mental health day,\" and it doesn't seem like you bothered to notify the professor when it should have been clear that it was a requirement. That professor sounds incredibly caring and attentive to notify you when it only occurred on a single occasion.",
          "author": null,
          "created": 1603289805,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g9g835f": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g835f/",
      "text": "It definitely depends on the school, but at least for me I think it just sucks for both. Online classes can be a mess, and I've felt the same thing about the workload, but I know some profs are putting in insanely high number of hours of work, up to three times their normal, since they have to prepare recorded lectures, hold in person class, and maintain a structured online classroom. There's definitely a ton of problems with distance learning, but often profs are accommodating if you explain your circumstance and ask them one on one for extensions or help with something. I think it really depends on the individual prof and class. (Middle management, on the other hand, seems to be a mess everywhere right now.) \n\nAfter reading some of your replies to comments, I 100% understand why you're frustrated. The lack of accommodation for international students is definitely one of the biggest shortcomings for profs and online learning in general across the board. Same thing at my school, classes are all marketed as being able to be done asynchronously, but students are graded on participation so 5-10% of points are lost for intl students who decide not to be nocturnal.",
      "author": "vn_quaker",
      "created": 1603213582,
      "upvotes": 9,
      "replies": {}
    },
    "g9g7lpj": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g7lpj/",
      "text": "This. \n\nI understand it is hard for everyone involved, including our professors, but everyday at the beginning of one of my classes, my professor gives a 20 minute speech about how difficult teaching through Zoom is, and how the in-person students are doing a better job at staying engaged and bantering with them. It totally wastes time and has left a lot of us struggling to understand the course material and not performing well on exams because they go off-topic so much in the middle of lessons to make Zoom-related comments. Ex: they start discussing a part of the lesson plan that they think we might find boring, and coincidentally someone shuts off their camera. They then pan to the in-person students and say “And there go the cameras!” We are additionally getting less points if we don’t speak up in class once a day, which I would TOTALLY be on board for if this was an in-person, post-Covid course, but some people might not be in a living situation where they feel comfortable speaking up in class. I guess I’m just tired of the “We’re all still navigating these crazy times.” type of comments from fairly younger professors who have been utilizing this type of technology beforehand. I don’t know. That was a bit of a ramble but I’m frustrated, as we all are, students and professors alike.",
      "author": null,
      "created": 1603213344,
      "upvotes": 9,
      "replies": {}
    },
    "g9g6mxn": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g6mxn/",
      "text": "During the first semester we had like 3 live lectures (still online, but an actual person talking to us). The rest were all reuploaded lectures from last year....\nFor the next semester we have about 1\nI get that professors are doing things they're not used to. But you could get me some actual interaction once or twice a week when I'm still paying for it.",
      "author": "couch_potato167",
      "created": 1603212884,
      "upvotes": 0,
      "replies": {}
    },
    "g9g6986": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g6986/",
      "text": "Because universities don't care about their students, they care about money.",
      "author": "mrpoolman",
      "created": 1603212702,
      "upvotes": 2,
      "replies": {
        "g9in750": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9in750/",
          "text": "The students are where the money comes from so how does that make sense?\n\nUniversities trip all over themselves trying to make students happy because $$",
          "author": "Blackberries11",
          "created": 1603261671,
          "upvotes": 2,
          "replies": {
            "g9jy2jk": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jy2jk/",
              "text": "Flat out wrong.",
              "author": "mrpoolman",
              "created": 1603297117,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g9g5sii": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g5sii/",
      "text": "Some profs aren’t getting slack either as well, my professor for my senior thesis has to lead a two year evaluation of the major and admin has refused to push it back to next year",
      "author": "sxenickyp42",
      "created": 1603212481,
      "upvotes": 4,
      "replies": {}
    },
    "g9g5dv1": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g5dv1/",
      "text": "Agreed. The school I go to gave us a lot of slack in March due to COVID (can change any class to pass/fail, professors were more lenient, etc.) but they’re giving us zero slack now.",
      "author": "RandomRedditor44",
      "created": 1603212289,
      "upvotes": 5,
      "replies": {}
    },
    "g9g4ooh": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g4ooh/",
      "text": "Yes, exactly.",
      "author": null,
      "created": 1603211955,
      "upvotes": 0,
      "replies": {}
    },
    "g9g4o57": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g4o57/",
      "text": "yeah, i have some classes where the professors won’t give us any material for a week and will just say life got busy, and this will happen multiple times. like i totally get it, things are crazy right now. everyone needs a break. but idk, multiple times a semester?? it’s midterms and in some classes i still don’t really know what’s going on and feel like i’ve learned nothing. idk i’m a senior and i feel like a lot of my major classes are being watered down and i’m not learning what i should be learning. of course i really don’t want a bigger workload because distance learning is hard and distracting but i also feel like i’m learning nothing sometimes",
      "author": "lasagnaisgreat57",
      "created": 1603211949,
      "upvotes": 6,
      "replies": {}
    },
    "g9g3hab": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g3hab/",
      "text": "[deleted]",
      "author": null,
      "created": 1603211376,
      "upvotes": 8,
      "replies": {
        "g9g420m": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g420m/",
          "text": "I definitely agree. I'm mad at those who use pandemic as an excuse for their laziness too. But there are definitely people who're working their asses off all day to succeed and are in super stressful situations that come with the pandemic. My problem is with the expectations from both sides(school and students). When there's an administrative/professor mistake, they use the pandemic excuse, but yet they don't seem to extend the same sort of courtesy to students (ofc this could be a specific case for me but seems like it's pretty common seeing the amount of upvotes this post has)",
          "author": "CrazyTechq",
          "created": 1603211654,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "g9g3avh": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g3avh/",
      "text": "Geez some of y’all have shite profs.",
      "author": null,
      "created": 1603211290,
      "upvotes": 20,
      "replies": {
        "g9gbdug": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbdug/",
          "text": "Right?  I have been giving out extensions like candy.  Technical difficulties?  Here's an extra hour on the exam!\n\nAnd still, my students email me at 10P and email the chair of my department at 8A the next morning because I haven't responded yet.  Like come on!",
          "author": "dontbothertoknock",
          "created": 1603215215,
          "upvotes": 15,
          "replies": {
            "g9i4nd8": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i4nd8/",
              "text": "I email my students back within 8 hours at all times. I have two babies, it’s my first semester, I’m completely overwhelmed. I still have students complaining that I don’t respond fast enough. Sorry that I’m not up at 3am bro",
              "author": "crimbuscarol",
              "created": 1603247727,
              "upvotes": 7,
              "replies": {
                "g9ljzsb": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ljzsb/",
                  "text": "Stop responding so fast.\n\nIt doesn't matter how fast you respond.  It won't be fast enough.  So give yourself more time.",
                  "author": "LimuEmuismydad",
                  "created": 1603325810,
                  "upvotes": 2,
                  "replies": {
                    "g9lk78d": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lk78d/",
                      "text": "I don’t respond on weekends anymore.",
                      "author": "crimbuscarol",
                      "created": 1603325929,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g9g4l77": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g4l77/",
          "text": "As much as I respect and like them, they really are doing some annoying things to make life harder.",
          "author": "CrazyTechq",
          "created": 1603211909,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "g9g2uv4": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2uv4/",
      "text": ">  I for one, spend all day sleeping and have to stay awake through the night because my professors want me to attend live classes and not just look at recorded ones.\n\nHave you talked to your professor and explained your situation?\n\nI think most professors would be understanding and make an exception if you asked for it.",
      "author": "lupineblue2600",
      "created": 1603211076,
      "upvotes": 11,
      "replies": {
        "g9g4gnq": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g4gnq/",
          "text": "Believe me I have. I'm asked to give up participation points that probably are only 5% of my overall grade, or give up extra credit opportunities. No teacher has told me they could create an exception where participation isn't part of the overall grade at all and my grades will be adjusted according to the rest of the syllabus(tests/hws etc). Losing 5% of my overall grade when you're required 90% for an A didn't seem like a risk I'm willing to take.",
          "author": "CrazyTechq",
          "created": 1603211850,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "g9g2f5p": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2f5p/",
      "text": "I have a couple professors that are bending over backwards to help us get through the material in spite of the shit we’re going through and others that are just kinda meh. It’s difficult though when we clearly have less say over how things play out.\n\nBe sure to communicate with your professors. I have f***ed up a couple of times and my professors have really worked with me to set me straight. I missed two labs that I won’t get a make up for, but my professor sat with me for 4 or 5 hours over a couple days to make sure I learned to work the software and knew the material. Another one consistently adjusts due dates and adds extra bonus assignments to help us understand things. \n\nOver the summer I tutored a few kids from a professor that was absolute shit. No online lectures, no explanations. He told them to go to the tutoring center if they needed help and didn’t respond to emails at all. I gave them the email address to the department head and encouraged them and their frustrated friends to email her about his class, and this semester he’s improved significantly. \n\nComplain on Reddit, I’ll totally validate your feelings on this. But also don’t limit your complaining to here.",
      "author": null,
      "created": 1603210867,
      "upvotes": 96,
      "replies": {
        "g9jzs5g": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jzs5g/",
          "text": "Send that first professor a very nice thank you letter if you haven't already.\n\nI'm only hired to work about 4.5 hours outside of class each week, so that'd be damn near impossible for me without basically dedicating a ton of my free time to it.",
          "author": "bl1y",
          "created": 1603297928,
          "upvotes": 4,
          "replies": {
            "g9s3pin": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9s3pin/",
              "text": "Thank you for that. I will send him some fruit and nut thing from Texas since he’s always eating snacks his turkish student sends him or peanuts during the break. \n\nCan you advise how I might get something to his office? Would it have a mailing address?",
              "author": null,
              "created": 1603475658,
              "upvotes": 1,
              "replies": {
                "g9t0bm9": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9t0bm9/",
                  "text": "Anything sent to the main office of his department with his name on it would get to him, but honestly, a heartfelt thank you letter is really all most profs would want.",
                  "author": "bl1y",
                  "created": 1603490097,
                  "upvotes": 1,
                  "replies": {
                    "g9tqx4a": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9tqx4a/",
                      "text": "I don’t like using words. :| I dunno, maybe it’s an autistic thing but I am not all that comfortable writing heartfelt anything.\n\nI will just send him some cookies.",
                      "author": null,
                      "created": 1603499776,
                      "upvotes": 1,
                      "replies": {
                        "g9uf3bh": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9uf3bh/",
                          "text": "Do what you think s best. Your prof will probably cry happy tears because they’re surely not paid to help you and do it anyway with what little time they have.",
                          "author": "raisecain",
                          "created": 1603509234,
                          "upvotes": 2,
                          "replies": {
                            "g9yirt9": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9yirt9/",
                              "text": "They will be very heartfelt cookies.",
                              "author": null,
                              "created": 1603576803,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9g2eij": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2eij/",
      "text": "I have covid and was unable to get out of bed for 2 days, and then had an additional 2 days where I was being shuffled between short-term and long-term quarantine housing on my campus. i had to BEG my one prof for a single day extension on an assignment. i shouldn’t have to beg to not be stressed and allow my self to rest and get better",
      "author": "rkrossi2013",
      "created": 1603210859,
      "upvotes": 87,
      "replies": {
        "g9hdfso": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hdfso/",
          "text": "Did your prof. know you had covid?",
          "author": "trident_zx",
          "created": 1603232171,
          "upvotes": 10,
          "replies": {
            "g9hdhqw": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hdhqw/",
              "text": "yup.",
              "author": "rkrossi2013",
              "created": 1603232200,
              "upvotes": 11,
              "replies": {
                "g9hdsnv": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hdsnv/",
                  "text": "What the heck!!! Were you allowed to get extended absence?",
                  "author": "trident_zx",
                  "created": 1603232365,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9ivgg7": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ivgg7/",
          "text": "My eyes are destroyed by keeping my eyes on screen for 6 hours straight 😣\n\nI have astigmatism\n\nAnd can't forget the frequent migraine attacks..",
          "author": "pavi2410",
          "created": 1603270442,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g9g2cua": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2cua/",
      "text": "I always thought it was dumb that colleges want to act like a business,  you're the customer,  but yet nothing is in the \"customer's\" favor. Its a pretty messed up business model but imagine if it was super easy to transfer and you could go to college anywhere, just like choosing a place to shop. Colleges would be a lot better with customer service because they'd lose money if they weren't.",
      "author": "thinkB4WeSpeak",
      "created": 1603210837,
      "upvotes": 50,
      "replies": {
        "g9k0inq": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k0inq/",
          "text": "There's a *lot* in the \"customers'\" favor these days, though YMMV.\n\nProfessors are often under a lot of pressure to be lenient when it comes to grading, due dates, absences, etc. I've had times when I've been encouraged by the school to turn obvious cases of plagiarism into \"learning opportunities,\" and nothing goes on the student's record so if they get caught again, it's another first offense with encouragement for more learning opportunities.\n\nOn top of that, my job more or less depends on my student evaluations, and the biggest factor there is what grades students expect to receive. You can figure out what that does to grading.",
          "author": "bl1y",
          "created": 1603298282,
          "upvotes": 3,
          "replies": {
            "ga9nr5n": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga9nr5n/",
              "text": "My school threatens to kick you out if you plagiarize your own work you've done in the current class youre taking. Its a great environment.",
              "author": "bretleg",
              "created": 1603803616,
              "upvotes": 1,
              "replies": {
                "ga9o772": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga9o772/",
                  "text": "That's pretty widely recognized as plagiarism unless the professor is allowing you to reuse your own work.",
                  "author": "bl1y",
                  "created": 1603803909,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9h3cju": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h3cju/",
          "text": ">but yet nothing is in the \"customer's\" favor\n\nThis is inaccurate. College over the years have became a lot more easier because of this transition to the business model.",
          "author": "AcademicDifficulty",
          "created": 1603227844,
          "upvotes": 0,
          "replies": {
            "g9ivpkw": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ivpkw/",
              "text": "Username checks out",
              "author": "pavi2410",
              "created": 1603270735,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9g1jl9": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g1jl9/",
      "text": "As a teacher, I keep asking my fellow teachers this same question. It’s so disheartening to watch students fail due to pressures well beyond the scope of school and education. Especially when teachers/professors sit up in their ivory towers, seemingly insulated from the stresses of the pandemic.",
      "author": "Proof_Volume",
      "created": 1603210448,
      "upvotes": 10,
      "replies": {
        "g9iiymu": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iiymu/",
          "text": "I dont know where you live but here in the middle of America there are no professors sitting in Ivory towers insulated from the stresses of the pandemic.",
          "author": "Cuzcopete",
          "created": 1603257853,
          "upvotes": 7,
          "replies": {
            "g9in4pp": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9in4pp/",
              "text": "There’s no way this commenter is a professor lol",
              "author": "Blackberries11",
              "created": 1603261608,
              "upvotes": 5,
              "replies": {
                "g9jbg5b": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jbg5b/",
                  "text": "No student or instructor uses the term \"ivory tower\" and since it's such an old expression I assume they are a grumpy senior citizen!",
                  "author": "Cuzcopete",
                  "created": 1603285136,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9g141f": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g141f/",
      "text": "Power differences are a bitch",
      "author": "desba3347",
      "created": 1603210237,
      "upvotes": 14,
      "replies": {}
    },
    "g9g03mh": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g03mh/",
      "text": "What a coincident! I am supposed to take a quiz in an hour and internet has been out all day. And guess what I can’t even make it up! So all the comments defending profs and blaming it all on the students are utter bullshit.",
      "author": "idkthoughso",
      "created": 1603209739,
      "upvotes": 40,
      "replies": {
        "g9g1md8": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g1md8/",
          "text": "Can you use a wifi hotspot? Is it possible to take the quiz on mobile? Is your local library open?",
          "author": "Sasmas1545",
          "created": 1603210485,
          "upvotes": -6,
          "replies": {
            "g9g32ty": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g32ty/",
              "text": "I need to be on zoom while I take the quiz and the hotspot couldn't handle that. libraries are closed, and I can't drive so it doesn't really matter. My neighbor has allowed me to be on his wifi to take the quiz.",
              "author": "idkthoughso",
              "created": 1603211183,
              "upvotes": 14,
              "replies": {
                "g9haxtx": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9haxtx/",
                  "text": "How'd you do on the quiz?",
                  "author": "devildocjames",
                  "created": 1603231047,
                  "upvotes": 1,
                  "replies": {
                    "g9hf95d": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hf95d/",
                      "text": "I did well!",
                      "author": "idkthoughso",
                      "created": 1603233153,
                      "upvotes": 3,
                      "replies": {
                        "g9lk4yz": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lk4yz/",
                          "text": "So, crisis averted?",
                          "author": "LimuEmuismydad",
                          "created": 1603325893,
                          "upvotes": 1,
                          "replies": {
                            "g9n5p2t": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9n5p2t/",
                              "text": "Yup luck was on my side",
                              "author": "idkthoughso",
                              "created": 1603371612,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "g9hfczk": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hfczk/",
                          "text": "Congratulations!   Now fix your shit!",
                          "author": "devildocjames",
                          "created": 1603233209,
                          "upvotes": -6,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g9g559x": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g559x/",
              "text": "Are libraries open? \n\nHe/she asked in the middle of a pandemic...",
              "author": "BecuzMDsaid",
              "created": 1603212176,
              "upvotes": 35,
              "replies": {
                "g9ga09k": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ga09k/",
                  "text": "Which is why it's a reasonable question. I had a mandatory student meeting that I wasn't going to be able to make. I checked a nearby library and they were open and I was able to use their wifi.  \n\nIf you want to find excuses for why you can't do things, you're bound to find them. It's more productive to search for solutions. I suggested some possibilities. The other commenter found another.",
                  "author": "Sasmas1545",
                  "created": 1603214528,
                  "upvotes": 11,
                  "replies": {
                    "g9gaozb": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gaozb/",
                      "text": "I agree. I have been privledged enough to stay on campus during this pandemic and have access to consistent wifi and there have been able to do all my assignments attend classes, etc. However if I was sent home (I would be homeless again) and won't have access to that I realize that other students are having these problems.",
                      "author": "BecuzMDsaid",
                      "created": 1603214873,
                      "upvotes": 3,
                      "replies": {
                        "g9gbasd": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbasd/",
                          "text": "Yeah, I'm not saying it's easy for everyone. I'm just saying that just assuming libraries are closed is stupid.",
                          "author": "Sasmas1545",
                          "created": 1603215173,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9g16pw": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g16pw/",
          "text": "There are a million and one ways you can do you assignment. Go to a  place that has wifi (library, starbucks etc. Tether from your phone's internet. Hell there are even services that let you rent internet by the hour or day. I did all of those at various points when I moved for work but was still taking graduate classes.",
          "author": "dade305305",
          "created": 1603210273,
          "upvotes": -27,
          "replies": {
            "g9g2m5d": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2m5d/",
              "text": "I can't drive, and parents are at work. Libraries are closed where I live.  My mobile hotspot can't handle a zoom call with 200 people and the quiz at the same time. I could take an Uber and go to Starbucks, which I will do if I run out options. But my point is that its not always the students fault and I shouldn't have to spend money to take a quiz. I am paying enough tuition. And if I am expected to check into Starbucks, if I have internet problems, then professors should be expected reciprocate that as well.",
              "author": "idkthoughso",
              "created": 1603210961,
              "upvotes": 30,
              "replies": {}
            },
            "g9g5q5n": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g5q5n/",
              "text": "I want you to think about what you just said for a moment. You just told OP to go to a public place most of which don't allow people to sit in them for more than five minutes and the others don't have indoor seating at all and are closed because of social distancing, go to a library when they are all closed during th pandemic, Most people can't afford phones that are doing what you ask (I know I can't) and not everyone can afford to spend extra money on the website/service that totally exists even though you didn't bother to say what iti is or link any sources.",
              "author": "BecuzMDsaid",
              "created": 1603212449,
              "upvotes": 21,
              "replies": {}
            },
            "g9g6vom": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g6vom/",
              "text": "Imagine being this fucking stupid....",
              "author": "mrpoolman",
              "created": 1603212999,
              "upvotes": 14,
              "replies": {
                "g9g7j1t": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g7j1t/",
                  "text": "Don't be so hard on yourself.",
                  "author": "dade305305",
                  "created": 1603213308,
                  "upvotes": -14,
                  "replies": {
                    "g9h9nin": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h9nin/",
                      "text": "LMAO",
                      "author": "Thrillkilled",
                      "created": 1603230498,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9fzfzx": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fzfzx/",
      "text": "Some of my professors said on the syllabus “no makeup exams. No extended time on assignments for any reason.” I had a mental break down yesterday about an assignment because I knew it would take forever and I started it late so I just never submitted it. My ADHD is getting worse and I had no health insurance so I’m struggling. I’d rather take the F than tell my professor I’m genuinely struggling in hopes that she would give me another day to do assignment I don’t understand.",
      "author": "denver_rose",
      "created": 1603209421,
      "upvotes": 49,
      "replies": {
        "g9g38tz": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g38tz/",
          "text": "Contact your school’s special accommodation office! If you don’t have your adhd on file get it on file ASAP and get those accommodations. My school gives you extra time for assignments with no penalty for students with ADHD but only if you request them. Good luck. My mental health has to be completely babied lately. :(",
          "author": null,
          "created": 1603211263,
          "upvotes": 27,
          "replies": {
            "g9gbv43": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbv43/",
              "text": "Rant: As someone who watches my girlfriend struggle through university due to ptsd and depression, I can say the special accommodations department at her school is raw unfiltered garbage. \n\nYou're right, and OP should definitely reach out for the accommodations, because it may end up helping. But in my own experience, academia doesn't give a single fuck about their students who need help. If you don't fit the mold of what they consider a normal student, you're shit out of luck, but thanks for paying thousands of dollars!!\n\nFuck you, Carleton.\n\nEnd rant.",
              "author": "Stubev",
              "created": 1603215454,
              "upvotes": 26,
              "replies": {
                "g9glcv9": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9glcv9/",
                  "text": "I totally agree. I have ADHD & major depression and I don’t have any accommodation. In high school they dropped my IEP plan because I was “too smart” so they didn’t understand the subjects I was taking. Even in college, you have to go through hurdles to PROVE your disability by being diagnosed and have updated information. That’s a privilege within itself. And then the solution they offer might not even work for me. It’s also so hard to get help when you’re in STEM and don’t want to seem “special” especially when you know everyone is struggling. I hate asking for help but I’m genuinely have never struggled this hard to just do simple thinks like completing assignments or watching a lecture.",
                  "author": "denver_rose",
                  "created": 1603220021,
                  "upvotes": 10,
                  "replies": {
                    "g9ioah9": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ioah9/",
                      "text": "Biggest mood. I also have ADHD and depression, but going to a psychiatrist for updated diagnoses and paperwork to get accommodations isn’t something I can afford. The reality is that *so* many students have disabilities that aren’t accounted for.",
                      "author": "TheConcerningEx",
                      "created": 1603262710,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "g9geqjb": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9geqjb/",
                  "text": "I’m sorry to hear that. I have also had great cooperation from my professors so I’ve been pretty lucky.",
                  "author": null,
                  "created": 1603216848,
                  "upvotes": 4,
                  "replies": {}
                },
                "g9i8p3u": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i8p3u/",
                  "text": "Bummer I have a physical disability that sometimes makes me take longer on test. My accommodations gives me time and a half and the ability to reschedule and take test if I’m having a “bad” day. \n\nHas really taken my education up a level as in highschool I sometimes really struggled with my issues",
                  "author": "zachattackp1",
                  "created": 1603250264,
                  "upvotes": 1,
                  "replies": {}
                },
                "g9i96eq": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i96eq/",
                  "text": "Even the good ones can only offer cookie cutter solutions that aren’t going to fit the diversity of the neuro-atypical nor the specific needs of your field of study. But you still go. Still get it on file.\n\nI teach studio art and design classes, and none of my ADHD students can get accommodations that actually meet their needs (more time on exams are useless when there are never exams). But, with the paperwork on file, I’m free to work with them one on one to make exceptions and alterations without opening myself up to claims of favoritism or inequities from the other students.",
                  "author": "Jooju",
                  "created": 1603250575,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g9gm8yy": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gm8yy/",
              "text": "As someone with special accommodations due to ADHD (extended time) my professors this semester has set up times to take exams usually 6am - 9am so we can make it to our 9:15am to 11:00am lecture still... It’s so embarrassing, their reasoning is so people don’t cheat and give questions out... We take our exams on camera on a lockdown browser, no ones cheating lol.",
              "author": "xxxSleepy",
              "created": 1603220449,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g9g3qqr": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g3qqr/",
          "text": "I am sorry you have to deal with ADHD and insurance issues during this time!   I think your choice to take the F is wrong.  It can't hurt to explain your situation to your professor and ask for an extension.  The worst thing they say is no.  I know I would be happy to work with any of my student's that are struggling, especially if they had medical issues that were exacerbated by the pandemic and pandemic stress. I tell them this routinely though I realize not all professors have this policy.",
          "author": "Amateur_professor",
          "created": 1603211502,
          "upvotes": 7,
          "replies": {
            "g9g85e8": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g85e8/",
              "text": "Part of the reason students are so stressed to contact professors is because of how unreasonable some of them are. One of my classes gives hours of homework, hours of videos to watch, weekly exams, weekly live sessions (attendance is taken), and at least 1-2 projects per week\n\nFor one of the projects, I emailed my professor 24-48 hours before the assignment was due about the difficulty submitting. No response \\~40 minutes before the 12 AM deadline, so I emailed my prof the assignment and went to bed. My professor gave me a 2 sentence response. \"Turn in is only accepted through proper channels. Late work is not accepted.\"\n\nThis kind of stuff makes it really difficult for students to want to contact *any* profs, even the one's who are understanding. Because, this guy gave the whole schmeel on how he was \"here to support\", but if he was, he would have accepted my assignment submitted BEFORE the deadline. (albeit not submitted on his website).",
              "author": "collegeappacc",
              "created": 1603213614,
              "upvotes": 15,
              "replies": {
                "g9gb9gt": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gb9gt/",
                  "text": "Exactly. And I’m afraid to go through all this work to get special accommodations because they might not be helpful. I don’t need extra time or a quiet room during exams for example.  In high school they said I was “too smart” so they didn’t understand what I was learning in classes and my IEP was dropped. It’s really hard for me to advocate for myself when I know that people just think I’m lazy. I told my mom yesterday during my mental breakdown that I wanted to get re-evaluated and she said that my ADHD was never “severe enough” and that “I shouldn’t have waited last minute” etc. The bottom line is I’m struggling and there’s not really anyone to help me. Sorry for the rant.",
                  "author": "denver_rose",
                  "created": 1603215155,
                  "upvotes": 6,
                  "replies": {
                    "g9gcdat": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gcdat/",
                      "text": "aww that really sucks :( \"not severe enough\" is total crap - 1. that's not for non medical professionals to decide, and 2. what is severe enough? \n\nI do hope you get the resolve to reach out to your professors and ask for help, even though it's daunting, as it could help big time in the long run.",
                      "author": "collegeappacc",
                      "created": 1603215704,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "g9nz1j1": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9nz1j1/",
                      "text": "I agree with collegeappacc - I hope you get the resolve to reach out to your professors during this.  I don't think students are lazy when they have diagnosed ADHD.  I do think they are lazy when they write me at 20 minutes until an assignment is due and want to complain/can't get it turned it/etc for an assignment that has been open for a long time and without a good reason.    \n\n\nHowever, I also realize that some professors, especially those not experienced with ADHD or those in Biology (like me) or Psychology, may not understand the complications that go into this disorder.  I know more than some because some of my grad students have it and many of my students do as well.    \n\n\nDon't listen to your mom about it not being \"severe enough\".  WTF?  That is total crap.",
                      "author": "Amateur_professor",
                      "created": 1603386802,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9fyuy0": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fyuy0/",
      "text": "This is why a lot of students are campaigning for pass/fail options and suing schools for their tuition back. This whole semester has been a hastily put together experience imho and most of my teachers have not lived up to the promises UML gave us",
      "author": "JadeShadow12",
      "created": 1603209139,
      "upvotes": 209,
      "replies": {
        "g9g1i0n": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g1i0n/",
          "text": "I'm a grad student at UML and have been surprised at how well this semester has been put together. It's not the shit show I expected.",
          "author": "Sasmas1545",
          "created": 1603210427,
          "upvotes": 37,
          "replies": {
            "g9h4yee": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h4yee/",
              "text": "I’m certainly not saying that it’s a shit show. And don’t get me wrong, i’m not attacking the teachers either. UML has certainly done better than a lot of colleges. However, as a state institution that’s charging me 5 figures a semester practically just to study on my own time, i was expecting more than Zoom classes and a campus-wide phishing scam.",
              "author": "JadeShadow12",
              "created": 1603228503,
              "upvotes": 14,
              "replies": {
                "g9h8hgs": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h8hgs/",
                  "text": "Oh man that phishing scam lmao. Yeah, I guess I'd be more upset if I was paying for this.",
                  "author": "Sasmas1545",
                  "created": 1603230005,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9h4ed7": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h4ed7/",
          "text": "Yeah my school tried the pass/fail thing last semester, but the class wasn't eligible for transfer. But you were not allowed to find out your letter grader before had. So you had to choose a letter grade, or a pass/fail.",
          "author": "eb86",
          "created": 1603228277,
          "upvotes": 9,
          "replies": {}
        },
        "g9h5nf2": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h5nf2/",
          "text": "You have to be careful with pass/fail grades as those classes might not transfer to different universities unless they are letter grades. Also, some master’s and PhD programs don’t accept prerequisite classes from your undergrad if they aren’t letter grade. Just warning everyone do your research before opting for a pass/fail grade.",
          "author": "apginge",
          "created": 1603228801,
          "upvotes": 7,
          "replies": {
            "g9hkh5g": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hkh5g/",
              "text": "I have to image they would make an exception if it's a pass/fall grade from 2020. It's not like they aren't aware of what's happening. Frankly, any school that doesn't give the grades from these two semesters a little leeway is not a school worth attending. All that means is they think luck is equivalent to effort.",
              "author": "fullforce098",
              "created": 1603236089,
              "upvotes": 9,
              "replies": {
                "g9hlcko": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hlcko/",
                  "text": "Like I said, i’d rather everyone do their research and contact their desired program to confirm whether a pass/fail grade would be acceptable for a particular class rather than just assume. In some cases it may even be better to take a C than a pass. Results may vary, do your research. Some schools are allowing students to pick whether they want pass/fail grades or letter grades. Just do some digging before you choose.",
                  "author": "apginge",
                  "created": 1603236591,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9fynmw": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fynmw/",
      "text": "I’ve had a teacher say that we shouldn’t be missing class this semester, even if we’re sick because “that shouldn’t be happing right now”...So in the middle of a pandemic, people shouldn’t be getting sick.",
      "author": "josamjaffa",
      "created": 1603209040,
      "upvotes": 404,
      "replies": {
        "g9g2ks7": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2ks7/",
          "text": "Oh good lord.",
          "author": null,
          "created": 1603210943,
          "upvotes": 102,
          "replies": {}
        },
        "g9g8nuh": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g8nuh/",
          "text": "He's right though. People need to stop getting sick so this pandemic can just end.",
          "author": "symmetrical_kettle",
          "created": 1603213868,
          "upvotes": 102,
          "replies": {
            "g9hayf5": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hayf5/",
              "text": "Yeah, also people should stop being hungry to solve world hunger, and people should stop fighting so that there's no more war.\n\nWow, that was easy.",
              "author": "Bigfrostynugs",
              "created": 1603231053,
              "upvotes": 38,
              "replies": {
                "g9jyd6r": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jyd6r/",
                  "text": "wowthanksimcured",
                  "author": "Murderous_squirrel",
                  "created": 1603297259,
                  "upvotes": 2,
                  "replies": {}
                },
                "g9iv8p8": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iv8p8/",
                  "text": "People should not even exist.. r/UnexpectedlyThanos",
                  "author": "pavi2410",
                  "created": 1603270191,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g9gzrhj": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gzrhj/",
              "text": "There is more than just typical flu type things though.\n\nFood poisoning is always a risk. We gotta eat. \nRandom medical issues like appendicitis happen.\nTooth surgery and you just want to lay around and watch jeopardy in a Vicodin haze for a day. Never mind sometimes you just need a mental health day, especially these days. \n\nThere’s all sorts of shit that can happen where someone could use a few days off.",
              "author": "Punchee",
              "created": 1603226402,
              "upvotes": 29,
              "replies": {
                "g9hi0rk": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hi0rk/",
                  "text": "Sure, but those aren't contagious. If contagious stuff could just stop for a moment, everything would be okay.",
                  "author": "symmetrical_kettle",
                  "created": 1603234685,
                  "upvotes": 1,
                  "replies": {
                    "g9hi834": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hi834/",
                      "text": "Obviously.\n\nJust saying requiring a sick day doesn’t have to be because of a contagion.",
                      "author": "Punchee",
                      "created": 1603234799,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g9gbio6": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbio6/",
          "text": "To be fair, people should really just stay home and wait this out... but I guess they’re just gonna keep fucking everyone over",
          "author": "AaltoSax",
          "created": 1603215281,
          "upvotes": 7,
          "replies": {
            "g9hb1li": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hb1li/",
              "text": "Unfortunately the majority of people have to work to stay alive and don't have the luxury of working remotely.",
              "author": "Bigfrostynugs",
              "created": 1603231090,
              "upvotes": 23,
              "replies": {
                "g9imupr": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9imupr/",
                  "text": "Exactly. I still have to go to work so I can eat and put gas in my car.",
                  "author": "FPSXpert",
                  "created": 1603261348,
                  "upvotes": 2,
                  "replies": {
                    "g9iotez": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iotez/",
                      "text": "Nothing irks me more than the people saying we all need to stay home while they do their cushy corporate job from home, eat food brought to them by DoorDash, and get all their household supplies from delivery drivers who have no choice in the matter.",
                      "author": "Bigfrostynugs",
                      "created": 1603263217,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g9lz127": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lz127/",
          "text": "Can you report them? That's not only insensitive, but they literally can't say that. You cannot stop yourself from getting sick; they can't penalize you for something like that.",
          "author": "Lady_Caticorn",
          "created": 1603334539,
          "upvotes": 1,
          "replies": {
            "g9m4lpt": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9m4lpt/",
              "text": "I’ve already given feedback and nothing really came of it. I’m at the point where it’s so far into the semester that I don’t care for the drama, and I have to take this teacher again. So I’d like to, but not worth my time.",
              "author": "josamjaffa",
              "created": 1603338104,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9fy6ca": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fy6ca/",
      "text": "[deleted]",
      "author": null,
      "created": 1603208805,
      "upvotes": 5,
      "replies": {
        "g9fzfby": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fzfby/",
          "text": "It takes so much longer to grade 50+ assignments than it does for one student to do one assignment.",
          "author": "Twolegging",
          "created": 1603209412,
          "upvotes": 13,
          "replies": {
            "g9g4mmg": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g4mmg/",
              "text": "Yeah not the same thing OP. You only have to do one the teachers have the grade multiple ones and if they don't have a TA or PL it makes it worse.",
              "author": "BecuzMDsaid",
              "created": 1603211928,
              "upvotes": 5,
              "replies": {}
            },
            "g9fzpf1": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fzpf1/",
              "text": "[deleted]",
              "author": null,
              "created": 1603209546,
              "upvotes": -2,
              "replies": {
                "g9g06s4": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g06s4/",
                  "text": "Yeah and then they have to mark 50 of all those assignments too.",
                  "author": "johnstewart37",
                  "created": 1603209783,
                  "upvotes": 2,
                  "replies": {
                    "g9g0ylm": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g0ylm/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1603210162,
                      "upvotes": 3,
                      "replies": {
                        "g9g50x1": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g50x1/",
                          "text": "Because not everyone is a good test taker and you're learning how to put your skills learned in the class to several uses?",
                          "author": "BecuzMDsaid",
                          "created": 1603212117,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "g9g9q63": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g9q63/",
                          "text": "Homework is used to maximize your skills, whether you see it that way or not. Furthermore, teachers most of the time teach multiple courses for a living, so it makes it difficult to “effectively and timely” grade things for students. Your definition of effective and timely grading with the feedback you want is going to be entirely different from someone who teaches the course.",
                          "author": "Twolegging",
                          "created": 1603214390,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "g9g4xmf": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g4xmf/",
                      "text": ">hence the backlog? point is why assign excessive amounts of assignments when you don't know how to effectively and timely grade and give feedback to students\n\nAnd don't forget when the grade online kicks them off for no reason....",
                      "author": "BecuzMDsaid",
                      "created": 1603212074,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9fxtf0": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fxtf0/",
      "text": "I'm an hs student but my teachers especially my ap teachers act tue same way there's no slack when it comes to grades in some classes and that makes getting reday to graduate so much harder",
      "author": "jawsthegreat777",
      "created": 1603208629,
      "upvotes": 1,
      "replies": {}
    },
    "g9fw29t": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fw29t/",
      "text": "I think every professor will tell you that our perception of the situation is diametrically opposed to yours.  We have been urged repeatedly by our administrations to be as lenient as possible WHILE maintaining the same academic standards (WUT??); in my institution, not to take attendance; to allow students who have not attended class to nonetheless evaluate us, which effects our job applications and opportunities for tenure/promotion; to decrease the amount of work students are responsible for; to be prepared to \"pivot\" from one mode of instruction to another, as needed, without warning; to retool classes we've taught successfully in person for years or decades to an online format; and finally to do the \"emotional labor\" of being strong and positive in front of students when many of us have childcare obligations, elderly parents to care for, etc.  Students can miss one or several class meetings without question or reprisal; we cannot. I can't speak for all of professordom, but I personally am feeling very squeezed by the demand to deliver high-quality instruction, each day, in an unfamiliar format, while it ever more difficult to demand anything of students due to the administration's fear that they'll jump ship and we'll lose much-needed revenue (insultingly little of which, by the way, goes into our pockets).  I also think it's worth mentioning that many of your instructors likely spent their summers, as I did, in endless \"professional development\" \"opportunities\" instructing us on how to teach you better online, time that we diverted from our scholarship (which is also vital to our advancement).  In my case, at least, these \"opportunities\" were expected but not compensated - i.e., I worked a job for free all summer to improve my students' experience in the fall.  So the idea that professors are being cut any slack, particularly as students who are dissatisfied in any way for in any reason (whether the fault of the instructor or not)  are able to head over to RMP to make their dissatisfaction very personal and very public, is not one I can agree with.\n\nI do sympathize with your situation, however, and I have several students in the same boat, three of whom Zoom into my class at 4:30 a.m. their time.  They are among my best students and it blows my mind how awesome they are. There is no denying how difficult this is, and actually it's my response when my local students complain about having to the work - if my student in Indonesia hasn't seen sunlight in months and is crushing it, then you can bring yourself to turn something in, Abigail.  I admire your resolve, and I hope you can push yourself through. It sucks.\n\nOne thing we can all agree on, though, is that administrators can get fucked.",
      "author": "Judythe8",
      "created": 1603207770,
      "upvotes": 167,
      "replies": {
        "g9g3602": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g3602/",
          "text": "I think I may have been thinking about the situation in a very student oriented manner. Yes, definitely teachers are also going through problems and having to deal with the pandemic as well, and believe me, I personally was very open in my thinking to give teachers the benefit of the doubt when any problems came up or just to cut some slack, and I still am, just to a lesser extent. The reason is because I expected students to get some slack too in the first month or so of the semester but I saw very very little forthcoming. I know it isn't a perfect society but I would've been more willing to cut some slack to teachers if we got the same in return. At this point it's just frustrating that I have to attend college in a pandemic as if these are normal times.\nI also am pissed at those students who are using the pandemic as an excuse for their laziness and hate for college. I know I can't judge not knowing the full picture but there are definitely some out there who're doing this, ruining the experience for others.\n\nAnd yes. Admin can get fucked.",
          "author": "CrazyTechq",
          "created": 1603211225,
          "upvotes": 44,
          "replies": {
            "g9gbj34": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbj34/",
              "text": "> At this point it's just frustrating that I have to attend college in a pandemic as if these are normal times.\n\nAs oppose to what? No one is forcing you to attend college. I have many students who are taking a year off.",
              "author": "EconMan",
              "created": 1603215287,
              "upvotes": -19,
              "replies": {
                "g9gbyig": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbyig/",
                  "text": "Okay first of all, you're cherry picking my comment and focusing on one specific thing that out of context of the rest of the comment sound different.\n\nSecond, not everyone can afford to take the year off, whether that be due to scholarships, other financial reasons, home/family reasons and I'm pretty sure some other reasons that I can't think of rn. If you are able to then sure do whatever you want, take a year off but don't think that everyone can do it",
                  "author": "CrazyTechq",
                  "created": 1603215501,
                  "upvotes": 32,
                  "replies": {}
                },
                "ga9o1nx": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga9o1nx/",
                  "text": "Thats not possible with many financial aid programs. Hell many colleges will force you to reapply if you take a year off.",
                  "author": "bretleg",
                  "created": 1603803807,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9gezz4": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gezz4/",
          "text": "This is incredibly interesting. My admin is taking a very different view of some of the things you mention with equally disastrous results. Our students are only required to attend a 3 hour, MWF course once or twice a week. We are expected to teach them all the same content as before the pandemic. What I have seen is a very sharp divide between students who make the effort and those who don't. Some (not all) of the students who decide not to attend have simply stopped turning in assignments. My failure rate is going to be ridiculous because the school wants students in F2F classes, but do not have any way to do it safely or effectively. Its all about the money and, as hard as they are trying to make the students happy, it's the students who are getting the short end od the stick.",
          "author": "Piglet03",
          "created": 1603216974,
          "upvotes": 11,
          "replies": {
            "g9gmfbc": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gmfbc/",
              "text": "No, I totally have this, too.  I teach a mid-level seminar for two hours, twice a week, at night (thanks again, admin!)  About 3/4 of my students are killing it despite the obstacles, while another 1/4 are dragging the ship down by showing up, turning their cameras off (despite language in the syllabus demanding that they leave cameras on) and failing to participate in any meaningful way.  When asked about their lack of engagement, they reliably invent some nameless \"emergency\" that I don't feel I can ask them to specify under the circumstances, or a sudden and improbably technical failure at the precise moment I call on them.  My fail rate isn't catastrophic, but I often feel that I am single-handedly dragging a half dozen thankless horses to the trough.  My inclination is to let them perish of thirst if that's their will, but I realize that in the current situation I'll be asked to explain the body count later.",
              "author": "Judythe8",
              "created": 1603220534,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "g9g4wxw": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g4wxw/",
          "text": "[deleted]",
          "author": null,
          "created": 1603212064,
          "upvotes": 54,
          "replies": {
            "g9gcn5j": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gcn5j/",
              "text": "I can speak to the number of assignments, at least in my case.  A big chunk of it is that we (professors) can no longer assign little stuff on the fly in lectures (like \"work on this example in small groups and then turn it in for a few points at the end of class\"), so all of our assignments need to be super structured and planned in advance.  \n\nIn addition, if we're not meeting with you in person, we don't see when an assignment is too big/tough the same way.  All we see is a problem that *we* think is reasonable that nobody turned in.  This makes us bitter that we're putting in all this work to rewrite these assignments to work better in a virtual format, but we're not seeing any effort on your part because we don't see you actually working on it, especially if you don't come to office hours and/or ask questions in class.  \n\nAnd as someone who was working from 8AM-10:30PM yesterday to write a \"virtual o-chem lab\" assignment while keeping up with my normal lecture prep (and with two young kids at home with me), this shit is hard.  Rewriting assignments is not easy. especially if you're in a field with certain nearly concrete expectations of what assignments need to be given.  The curriculum of organic chemistry doesn't care that there's a pandemic, I still need to figure out how my students can get the lab experience of conducting a distillation or recrystallization without resorting to the god-awful Labster simulations.",
              "author": "NielsBohron",
              "created": 1603215842,
              "upvotes": 32,
              "replies": {
                "g9geabl": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9geabl/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1603216638,
                  "upvotes": 19,
                  "replies": {
                    "g9gl3gz": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gl3gz/",
                      "text": "It's definitely a case of underestimating everyone else's workloads because we're all so swamped in our own difficulties.  \n\nI can also provide a little context to some of the other difficulties, even if they're not issues my classes have to deal with.\n\n* The not accepting emailed assignments, I totally understand even if it's not my stance.  I only have 12-48 students in classes, but in those 48-student classes, if I accepted emailed assignments, I would be totally overwhelmed by every student who tried to upload a PDF one time and then gave up and just emailed the assignments for the rest of the semester.  I'm not saying that's you, but  we're not not supposed to make exceptions for one student that we won't make for other students, and if word gets out that I accept emailed assignments, half the class will be emailing those assignments.  This is also a logistical nightmare, because now the assignment files aren't attached to your Canvas assignment, so I can't just use the grading functionality; I now have to separately download all 20 emailed assignments, keep them organized despite the fact that half of them don't have the names written on the PDF (why would they? it's attached to the email, right?), open them in the right order to grade alphabetically (which is its own nightmare, because grading alphabetically means I know who submitted what, and my own biases and favoritism creep in)... you see how this can open several other cans of worms, despite the fact that on the surface \"it's just one assignment and I couldn't get the uploader to work\"\n* As far as the watching videos outside of lecture and also attending lectures, this is usually done as part of a flipped classroom model where you do the assigned reading or watch a video before coming to lecture and then spend the lecture discussing the material or working through problem sets.  But even if it's not set up that way, the classical model of a college course is that you spend two hours outside of class for every hour in class, whether that's watching videos, reading the material, studying, or working on assignments.  So, while we frequently miss the mark (maybe the assignments take more time than we thought or maybe the reading is usually skimmed before class, etc.), that's what we're aiming for. \n* It is overwhelming to keep track of everything, but that's also going to be true in any situation where you're going to college full-time.  It's possible that a chunk of your struggles this semester is just that if you passed all your classes last year, you're now taking harder classes where we (professors) expect more of you and want to do less \"hand-holding.\"\n\nThis is not to excuse professors that are just blatantly ignoring student needs; however, the same way you usually have a reason for doing things, there is usually a reason for policies that professors have.",
                      "author": "NielsBohron",
                      "created": 1603219893,
                      "upvotes": 27,
                      "replies": {
                        "g9go732": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9go732/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1603221397,
                          "upvotes": 9,
                          "replies": {
                            "g9hwi5s": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hwi5s/",
                              "text": "Glad to help, even if it's just to remind people of both sides.  We professors frequently fall into the same trap as we get frustrated with the sheer number of repetitive emails, even if they're all valid questions.  My personal pet peeve is when students take a quiz, I know the auto-grader sucks and that I need to go back and assign partial/full credit where appropriate.  I warn the students about this, but every week I get emails with messages like \"I forgot to include units, can I get partial credit?\"  \n\nIt's totally a valid question, and I get being upset that you did almost everything right, but I'm not going to respond to that email after the first week, because it just bothers me.  That's my professor version of the common \"why can't my professor keep up with the grading?!?\" posts that I see around here.\n\nCheers, and keep on keeping on",
                              "author": "NielsBohron",
                              "created": 1603242927,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9fxku2": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fxku2/",
          "text": "What I wouldn't give for just one day where I say \"naw, I'm skipping class today\" and stay in bed! I'm feeling the squeeze for sure right now since someone has to teach my courses... And it's me.\n\nYeah, admin can go suck eggs!",
          "author": "yostreed",
          "created": 1603208514,
          "upvotes": 30,
          "replies": {}
        },
        "g9hmoth": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hmoth/",
          "text": "I know I can’t believe this post. When I first scanned the title I was sure it was a “why do students get slack but professors don’t” on r/professors",
          "author": "Blackberries11",
          "created": 1603237366,
          "upvotes": 9,
          "replies": {
            "g9ho8zq": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ho8zq/",
              "text": "same!",
              "author": "Judythe8",
              "created": 1603238260,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g9hkvkr": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hkvkr/",
          "text": "As a professor out of the us, I should mention that nobody at my school was even offered more than a 1 hr online meeting about how to prepare for online classes.  I am sure that if we had even a week long training over the summer, many of the profs would be better off.",
          "author": "RPSisBoring",
          "created": 1603236318,
          "upvotes": 6,
          "replies": {
            "g9ialo7": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ialo7/",
              "text": "I asked for training but IT informed me they were understaffed due to budget cuts and busy putting cameras in each classroom. They suggested I watch some YouTube videos on my own. I had never hosted a Zoom meeting in my life and am now expected to run them on my own with no help a dozen times each week.",
              "author": "Cuzcopete",
              "created": 1603251526,
              "upvotes": 1,
              "replies": {
                "g9ik5ko": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ik5ko/",
                  "text": "You can test zoom on your friends and family. That’s what I had to do when my dept decided that me having run zoom classes for a week meant I was qualified to run a zoom training for everyone.\n\nBut honestly students have a bizarre idea of how college and being a professor works.",
                  "author": "Blackberries11",
                  "created": 1603258877,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g9ik3aa": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ik3aa/",
              "text": "Most places were telling profs to prepare for in person classes for most of the summer",
              "author": "Blackberries11",
              "created": 1603258821,
              "upvotes": 1,
              "replies": {
                "g9izbpx": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9izbpx/",
                  "text": "Na.. my school has online until winter (at least)...",
                  "author": "RPSisBoring",
                  "created": 1603274819,
                  "upvotes": 1,
                  "replies": {
                    "g9li4ev": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9li4ev/",
                      "text": "Both things can be true.  A lot of schools that went online only did so after spending most of the summer planning to be face to face.  Professors at those schools got doubly screwed over.",
                      "author": "LimuEmuismydad",
                      "created": 1603324730,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "g9mf7st": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9mf7st/",
                      "text": "I think you misunderstood what I said.",
                      "author": "Blackberries11",
                      "created": 1603346369,
                      "upvotes": 1,
                      "replies": {
                        "g9ml63b": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ml63b/",
                          "text": "ya... someone else commented and I got it :P",
                          "author": "RPSisBoring",
                          "created": 1603352037,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9hh33p": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hh33p/",
          "text": "I agree that this situation is horrendous for both parties involved. Both students and professors are having to navigate an unfamiliar environment while being pressured to maintain the same experience, which is actually impossible. \n\nKeep trying to trek through this. This isn't easy for anybody.",
          "author": "ThoughtCenter87",
          "created": 1603234164,
          "upvotes": 6,
          "replies": {}
        },
        "g9i3i05": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i3i05/",
          "text": "I get many, many emails a day asking for accommodations and extensions and I normally grant them all (other than the students who are asking to turn in the midterm 10 days late). I work really hard to make my class flexible and I have students taking advantage of it left and right (eg they accidentally turn on their cameras and they are golfing). Nevertheless I try to give everyone the benefit of the doubt. Your professors are humans. Yeah, some of these profs sound like douches, but some of us are trying really hard.",
          "author": "crimbuscarol",
          "created": 1603247035,
          "upvotes": 4,
          "replies": {}
        },
        "g9g38dl": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g38dl/",
          "text": "Judythe8, you are now my personal hero.  You do speak for me.",
          "author": "Amateur_professor",
          "created": 1603211257,
          "upvotes": 7,
          "replies": {
            "g9gd49r": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gd49r/",
              "text": "I'm intoxicated on the appreciation, as I haven't had any in so long that I've lost my tolerance :)   \n\\[thank you\\]",
              "author": "Judythe8",
              "created": 1603216074,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "g9hv4hj": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hv4hj/",
          "text": ">One thing we can all agree on, though, is that administrators can get fucked.\n\nPreach my guy",
          "author": "LastSeenEverywhere",
          "created": 1603242126,
          "upvotes": 3,
          "replies": {}
        },
        "g9jz1km": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jz1km/",
          "text": "> urged repeatedly by our administrations to be as lenient as possible WHILE maintaining the same academic standards (WUT??)\n\nDude, we were told that we need to make participation a larger part of our grades to make sure students were participating in our Zoom sessions. And in almost the same breath told not to require students to participate because they might not be comfortable doing so on Zoom.",
          "author": "bl1y",
          "created": 1603297582,
          "upvotes": 3,
          "replies": {}
        },
        "g9inzuz": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9inzuz/",
          "text": "Thank you for shedding light on the prof-side of things. I definitely empathize with my profs right now, for the most part I see them working extremely hard to deliver the best classes they can despite the situation, and some have been more lenient with us students too. One of my profs has gone absolutely above and beyond by meeting with each of us over zoom in one on one meetings every two weeks, to answer any questions we have and update us on our performance.\n\nAt the same time, I see a lot of very different stories here on this sub. Some students seem to be granted little to no leniency by profs who don’t care, or are really poorly equipped to handle an online semester. I get it, it was unfair to suddenly expect profs to know how to teach online at the same quality as they usually do. It kinda sucks for most of us. The admin needs to be doing better, starting with fair compensation for profs to do trainings focused on online learning. In fact profs probably need to be paid more in general.\n\nI’ll admit I’m biased here because my uni generally has an incredible group of profs and an absolute shitshow of an administration.",
          "author": "TheConcerningEx",
          "created": 1603262424,
          "upvotes": 2,
          "replies": {}
        },
        "g9laf4d": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9laf4d/",
          "text": "No one said it’s not hard for you. We’re all struggling. Could you just, like, not give us a 0 when our WiFi goes out during a storm?\n\nFlunking a student for reasons beyond their control is not the same as getting a bad rating on something as trivial as RMP. You misunderstood the point of this post.",
          "author": "tbwcd64",
          "created": 1603320331,
          "upvotes": 0,
          "replies": {
            "g9lf9bf": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lf9bf/",
              "text": "I don’t think I did, actually.  You have misunderstood my post, perhaps voluntarily.  \n\nThe original post is, literally, asserting that professors get loads of slack.  We don’t.",
              "author": "Judythe8",
              "created": 1603323079,
              "upvotes": 2,
              "replies": {}
            },
            "g9lfchg": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lfchg/",
              "text": "Bad evaluations will lose you jobs.  That is worse than an F on your transcript.  But thanks for weighing in",
              "author": "Judythe8",
              "created": 1603323127,
              "upvotes": 2,
              "replies": {
                "g9lo044": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lo044/",
                  "text": "Lmao. A shitty review on a website that no one takes seriously is not worse than an F on your transcript. Not even close and you know it. Also, lets not pretend that you can easily get a job with Fs on your transcript. It goes both ways. So thanks for your utter lack of regard, since apparently your future is more important than anyone else’s\n\nThe original post is about students having to give professors slack and not getting it in return. Your post is complaining about how hard it is for you. Guess what, it’s hard for everyone. OP wasn’t trying to say otherwise. Students are giving profs the benefit of the doubt, and profs can do the same for students",
                  "author": "tbwcd64",
                  "created": 1603328099,
                  "upvotes": 1,
                  "replies": {
                    "g9lpgvn": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lpgvn/",
                      "text": "The original TITLE is \"WHY DO STUDENTS HAVE TO GIVE PROFESSORS AND ADMIN SLACK\"?  I answered that question: that you don't, and why you should.  You are not a thinker, so I'm not wasting any more time with you.  \n\nI wish you luck with your studies, and I hope you don't get any more of those [totally undeserved] Fs",
                      "author": "Judythe8",
                      "created": 1603328949,
                      "upvotes": 3,
                      "replies": {
                        "g9ls37y": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ls37y/",
                          "text": "You conveniently missed the second part of the title. The point is why do we have to give them slack WHEN WE DON’T GET IT IN RETURN. You largely talked about admin not giving profs slack (which has nothing to do with students), then tried to equate a bad student review on RMP with an unforgiving prof failing a student for bad Wifi.\n\nThanks for telling me what my intellectual capabilities are, but I can assure you they do not reflect your judgement. By the way, I don’t have any Fs, I read about that situation happening to someone on Reddit. But if we are going to stick with that logic, good luck with your [totally undeserved] bad reviews.",
                          "author": "tbwcd64",
                          "created": 1603330449,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "g9lp5so": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lp5so/",
                      "text": ">Lack of disregard\n\nOkay, fun talking to you",
                      "author": "Judythe8",
                      "created": 1603328771,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g9m8zui": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9m8zui/",
                  "text": "I’m sorry but who are you to say bad evaluations are worse than a professor failing someone for a Wifi problem? Aka, a professor messing up your GPA for the rest of your college career over something you couldn’t control, potentially affecting scholarships, grad school applications, job applications, etc? Please, why don’t you come down from your ivory tower... You’re not the only one with something at stake under these circumstances.",
                  "author": "pistachio098",
                  "created": 1603341229,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9gumqs": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gumqs/",
          "text": "The difference is that while you may have to adjust your approach to work life balance, hours kept, style of teaching, etc; students are paying thousands and thousands of dollars for a product that is not the same as in classroom learning. You point to performance reviews as unfair since some students may not be in class as required, but that really seems like you enforce attendance less for the sake of the education provided, and more for how it reflects on your record when it comes time to be reviewed for tenure. What about the students who struggle or are missing key skills when they graduated due to virtual learning? Their employer won't care if it was due to covid, suddenly their degree is worth less than what they were promised. I am kinda appalled that you try to get sympathy when you are literally being paid to adapt, they give you money and expect you to adapt to the conditions. Students can chose to either pay or leave, and while your pay stops if you leave the loans still stick around for students.",
          "author": "totallynotliamneeson",
          "created": 1603224335,
          "upvotes": -7,
          "replies": {
            "g9h69hh": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h69hh/",
              "text": "Student loans?  What are those? /s\n\nActually, if you read what I read, I was NOT paid to adapt to anything.  I was just expected to do it, and I did it, with grace.\n\nNobody is looking for \"sympathy,\" and I'm not the least bit worried about what \"appalls\" you; what I did was explain, gently, that the OP's impression that professors are beyond criticism is just untrue.  \n\nThere will always be students like you who will push the \"but I'm paying for this!!!\" line and who will be unable to see past that sense of entitlement.  It's unfortunate, because that is what will leave you \"missing key skills\" necessary to succeed in the workforce, more than the unfortunate but shared realities of virtual learning.",
              "author": "Judythe8",
              "created": 1603229070,
              "upvotes": 8,
              "replies": {
                "g9ktzm4": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ktzm4/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1603312341,
                  "upvotes": 0,
                  "replies": {
                    "g9kykos": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9kykos/",
                      "text": ">Sense of entitlement? For expecting that after paying thousands of dollars our degree will be worth something?\n\nWay to prove me wrong!!!",
                      "author": "Judythe8",
                      "created": 1603314590,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g9j3ywf": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9j3ywf/",
          "text": "[removed]",
          "author": null,
          "created": 1603279528,
          "upvotes": -2,
          "replies": {}
        },
        "g9fxtpc": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fxtpc/",
          "text": "[removed]",
          "author": null,
          "created": 1603208633,
          "upvotes": -25,
          "replies": {
            "g9g2btf": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2btf/",
              "text": "Why teach when you don't like students?",
              "author": "CrazyTechq",
              "created": 1603210823,
              "upvotes": 6,
              "replies": {
                "g9g2p1l": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2p1l/",
                  "text": "I *don't* but you're right about not liking students for the most part. That's because I've been one. \n\nI can't count how many times I've seen or heard directly somebody complaining about not having enough time to finish something or having too many assignment and not enough time and I'm like \"aint you the one I saw in the student lounge all week playing smash and madden\"?",
                  "author": "dade305305",
                  "created": 1603211000,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            },
            "g9jumaq": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jumaq/",
              "text": "and you can get fucked too",
              "author": "CrimeAt5Dollars",
              "created": 1603295427,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9fvz9s": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fvz9s/",
      "text": "That's just sad. Like, what are these teachers thinking?",
      "author": "whyrweyelling",
      "created": 1603207728,
      "upvotes": 1,
      "replies": {}
    },
    "g9fvusp": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fvusp/",
      "text": "Yeah it makes me mad that profs can have technical difficulties and they're like sorry but theres \"no excuses\" if something goes wrong on your end :/ Makes things pretty stressful.",
      "author": "MentionCharacter3205",
      "created": 1603207666,
      "upvotes": 512,
      "replies": {
        "g9g53xr": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g53xr/",
          "text": "I have a 0 for a paragraph-length quiz we took in one of my classes because I joined like 3 minutes late due to internet problems and I didn’t realize until 20 minutes or so in that there was a quiz. I did it and gave a pretty decent response I think, but still a 0. I emailed her yesterday about it so we’ll see lmao",
          "author": "xCaptainCookx",
          "created": 1603212158,
          "upvotes": 180,
          "replies": {
            "g9hehxx": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hehxx/",
              "text": "That's outrageous. I'd legitimately consider contacting the ombudsman or something if she doesn't reconsider. Professors that take tardiness as some unforgivable personal insult are the worst. College is hectic, and internet or software problems are uncontrollable and inevitable now, things are gonna go wrong. At most you can knock a point or two off but a complete 0? No, don't stand for that. You showed up, you did the work, you (presumably) understood the material, that's all that should matter. All that professor is teaching is that some people in authority are control freaks and you shouldn't tolerate them.",
              "author": "fullforce098",
              "created": 1603232741,
              "upvotes": 54,
              "replies": {}
            }
          }
        },
        "g9iry3b": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iry3b/",
          "text": "Also makes me mad that my profs keep posting material several days late but if I miss an assignment, there’s no excuse because I should have done it early",
          "author": "heartandliver",
          "created": 1603266482,
          "upvotes": 19,
          "replies": {}
        },
        "g9jzxhu": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jzxhu/",
          "text": "I had a professor in one semester say, “It is your responsibility to make sure you have technical backups or other plans if anything were to fail. Last minute or rushed arrangements are unacceptable. Failure to attend or turn in an assignment due to a technical difficulty will result in a 0 for that graded portion.”\n\n... I just saw him post on my Nextdoor app a month ago that he “suddenly” realized he needed a different kind of webcam setup for his Zoom class, and that he needed it “urgently” as he had already had to cancel a few classes due to it. What happened to those high expectations of attendance and having back up plans and preparations in place? Shouldn’t he have followed his own advice and had a backup camera in case his were to fail?",
          "author": "petiterunner",
          "created": 1603297999,
          "upvotes": 9,
          "replies": {}
        },
        "g9lyx9r": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9lyx9r/",
          "text": "I posted a test 6 minutes late because my Internet whacked out and my professor took off points for \"being late.\" He then told me I should be grateful that he accepted my test at all. I'm so over professors. So over them.",
          "author": "Lady_Caticorn",
          "created": 1603334475,
          "upvotes": 6,
          "replies": {}
        },
        "g9fy0e7": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fy0e7/",
          "text": "Usually professor’s technical difficulties occur when a class is due to happen - an event with a start time, while a student’s technical difficulties happen when they managed their time poorly and waited until the last minute to do something.\n\nNow, if it’s a legitimate issue, your professors should definitely be lenient. But blame the hundreds of students before you who cried wolf.",
          "author": "littleedge",
          "created": 1603208724,
          "upvotes": -36,
          "replies": {
            "g9g5dyp": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g5dyp/",
              "text": "Not really for me. For my chem class, we have tests that you need to start in a certain time window and if you can't due to technical difficulties, you're fucked.",
              "author": "sgoot",
              "created": 1603212290,
              "upvotes": 62,
              "replies": {
                "g9hxxwc": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hxxwc/",
                  "text": "Reasonable concern. I was downvoted to the depths of hell but this is a great example of a legitimate issue.",
                  "author": "littleedge",
                  "created": 1603243762,
                  "upvotes": 3,
                  "replies": {
                    "g9iezrj": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9iezrj/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1603254672,
                      "upvotes": 0,
                      "replies": {
                        "g9jeqd2": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jeqd2/",
                          "text": "You may be misunderstanding. Sgoot was talking about how if a student loses internet or experiences technical issues as they turn on their computer and prepare to take a test that is only available during a window of time, it’s a reasonable excuse for contacting your professor and asking for flexibility.\n\nCompared to most other requests.",
                          "author": "littleedge",
                          "created": 1603287147,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g9gdca3": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gdca3/",
                  "text": "Hmm. This seems odd. Is it so they can virtually proctor the exam for cheating?",
                  "author": "Piglet03",
                  "created": 1603216183,
                  "upvotes": 5,
                  "replies": {
                    "g9gq279": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gq279/",
                      "text": "Sometimes it's also to prevent spreading test questions / answers. If everyone takes it all at once it's harder to share the material that's on the test",
                      "author": "gurgle528",
                      "created": 1603222262,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g9fzoph": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fzoph/",
              "text": "THIS",
              "author": "dade305305",
              "created": 1603209536,
              "upvotes": -5,
              "replies": {}
            },
            "g9g996r": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g996r/",
              "text": ">while a student’s technical difficulties happen when they managed their time poorly and waited until the last minute to do something.\n\nTHIS.  This is why I rarely give extensions for assignments.  No matter whether I give students a week, a month, or the whole semester to do an assignment, 90% of them wait until the day it's due and then want special consideration when they can't get it done in time.  \n\nI can't tell you how many emails I've gotten requesting extensions because \"my internet went down at 11:58 PM just before the deadline and I couldn't submit my assignment.\"  My response: what about the rest of the week/month/semester that you had available to do and submit this assignment?  The fact that you waited til the last second to do the assignment is your fault and nobody else's.",
              "author": "ChemMJW",
              "created": 1603214159,
              "upvotes": -38,
              "replies": {
                "g9gis9q": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gis9q/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1603218785,
                  "upvotes": 26,
                  "replies": {
                    "g9gvk26": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gvk26/",
                      "text": "u/collegeappacc, I understand what you're saying, I really do. I was a college student not all that long ago myself, and I thought similarly to how you do. The problem, in all honestly, is that you simply have no idea what you're talking about, because you've never seen the other side of the coin. And I don't mean that as a criticism, it's simply reality. I can't hold you at fault for not knowing what you have no way to know. How could you? You're not a professor, and your overall experience with academia is very limited.\n\nSo, I'm going to address a couple of your points. I don't mean for anything I say to come across as harsh, and I absolutely do *not* mean any of it as a condemnation of you personally. But, I will be blunt so that the points are clear.\n\n>similar to professors, students have limited time. A lot of professors can't understand that - we have things due every day for so many classes.\n\nProfessors understand this perfectly. Do you think that once you become a professor, your memory of all your previous experiences is wiped? We know you have other things to do. But, the honest truth is that most college students will never have a less busy life than what they have now. Of course, some college students have to work full time to pay the electric bill and keep food on the table, some students have children, some students have to care for an adult family member, and so forth; those are challenging paths and I wish them well. But the vast, vast, overwhelming majority of college students, in the USA at least, do not work, have no private family care responsibilities, etc., and have in fact have almost no other actual obligations other than their studies. The average college student certainly has *nowhere near* the amount of obligations, professional or private, that the average professor does. So, the \"I'm really busy, cut me some slack\" argument is not very convincing. Everybody is busy. But the reality is that the average college student is the least busy by light years.\n\n>I don't understand what professors lose by showing a little leniency - I really don't. Professors are in full control. If students are struggling, professors won't get in trouble for extending some deadlines.\n\nUnfortunately, the blame for the fact that we are often loathe to cut you some slack lies with your fellow students. It can be summed up perfectly by that old expression \"If you give an inch, they'll take a mile.\" The reason is that, once we show leniency, the demands for *more* and *more* leniency in situations of greater and greater significance never end. *Ever*. If we extend the deadline by a day, then the person who was two days late complains about losing points and threatens to contact the dean or go to the media or some other nonsense. If we extend the deadline by a week, roughly the same number of students will *still* not turn in the work on time and then will request *another* week. If the only deadline is that all assignments must be turned in by the last day of class - i.e., i*f we litterally give students the entire semester to do their work at their own pace on any schedule they want*, guess what? Some will still not meet that deadline. And then can you guess what happens? They email begging for extensions even though the class is now done and the semester is now over. For some people, not even *the entire semester* is enough leniency.\n\nAnother thing you have no way of knowing, at least not to the degree of the average professor, is that many of your fellow students behave *horribly*. This was perhaps the single most shocking thing to me when I switched from being a student to the other side of the desk. The amount of outright lies, scams, schemes, deceits, and organized fraud we encounter from students on a weekly basis is mind boggling. I know, right now you're sitting there thinking that you don't believe me and that I'm exaggerating to make a point, because you're probably a decent human being and you assume that everybody else is decent too. They're not. Not at all. For every request for leniency or special treatment because of extenuating circumstances I receive that I really do think should be granted, I get 5 that I can prove to be frauds with minimal effort, and then another couple that are almost certainly bald-faced lies that I just can't prove. Amazing how often the internet seems to go down *in the student dorms* right at 11:58 PM, and yet campus IT has no evidence of any outage that night, and yet other students in the same dorm didn't have any trouble submitting on time. Amazing how often a student swears up and down that he submitted the assignment an hour before the deadline, yet the Learning Management System has no record of the student logging in at any point that day. Sometimes students undertake more work to fake an excuse for missing a deadline than it would have taken to just do the assignment and meet the deadline.\n\nI know, I know, this sounds crazy. I thought so too when I first started as faculty. But now these kinds of rampant lies and attempts at deception and cheating (the cheating, my god, don't even get me started on the cheating) are just another Tuesday to me.\n\nSo, why don't we just be lenient all the time? Because if we are, the requests for more and more and greater and greater leniency never stop, and because every time we do show leniency, we can't shake this nagging suspicion that we're being played.",
                      "author": "ChemMJW",
                      "created": 1603224702,
                      "upvotes": -13,
                      "replies": {
                        "g9h21n4": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h21n4/",
                          "text": ">> The vast, vast, overwhelming majority of college students do not work, have no private family care responsibilities, and in fact have almost no other actual obligations other than their studies.\n\nI thought you were an ass but it turns out you’re just delusional.",
                          "author": "pokemongofanboy",
                          "created": 1603227325,
                          "upvotes": 15,
                          "replies": {
                            "g9h2zsn": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h2zsn/",
                              "text": "> I thought you were an ass\n\nOf course you did.  When confronted with uncomfortable truths, for example the fact that your professors are not out to get you just for the fun of it, people always lash out at the message bearer.",
                              "author": "ChemMJW",
                              "created": 1603227697,
                              "upvotes": -10,
                              "replies": {}
                            }
                          }
                        },
                        "g9k11su": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k11su/",
                          "text": "> But the vast, vast, overwhelming majority of college students, in the USA at least, do not work, have no private family care responsibilities, etc., and have in fact have almost no other actual obligations other than their studies.\n\nWhat is your source on this claim? I looked it up as I was curious and here is what I found:\n\n“The Georgetown report found that 70 percent of full-time college students are working. About 40 percent of undergraduates and 76 percent of graduate students work at least 30 hours a week.”\n\nGenuinely more than happy to accept a source that evidences otherwise.",
                          "author": "petiterunner",
                          "created": 1603298536,
                          "upvotes": 3,
                          "replies": {
                            "g9k67ob": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9k67ob/",
                              "text": "I based that on a 2019 report from Inside Higher Education.  That report agrees with the data you found that 70% of full time college students work (as in greater than 0 hours), but the number who work full time was around 26% (having fallen steadily over the last decade).  At the time I wrote the post, I almost went back and edited it to make it clear that I was referring to undergrads who work full time (as I had specifically mentioned full time work in earlier parts of the post), but I didn't bother, because whoever it was who responded to me was in a rant and clearly not interested in any kind of actual discussion.  The point is that the vast majority of undergrads have no full time work - except college.  *College* is their full time job, but too many of them do not treat it as such and instead treat its deadlines and requirements as optional or mere suggestions.  They wouldn't do that (I presume) if they were at a regular job, so it is aggravating for professors who work with dozens or hundreds of students to continually have students who ignore their obligations and then have the gall to ask for special treatment.\n\nAs I already explicitly acknowledged, I clearly understand that some students have to work full time to keep food the table, etc.  When they work full time and go to school, they've accepted a very challenging situation, and it's very impressive when they manage to juggle both situations successfully.  But when you think of the millions of typical undergraduate students right out of high school who live an average college life in a dorm on an average college campus, comparatively few are in that situation.  Take a look at r/Professors sometime if you're interested in this topic.  Hardly a week goes by without a thread about excuses and requests for special treatment that the poster received.  Among the occasional legitimate reason for an exception to be made, you'll find everything from implausible excuses to excuses bordering on the outrageous to examples of students actually manufacturing fake evidence to support a request for special treatment.  The sheer volume of utter nonsense we face from students every week of every semester is enough to make the happiest, most bright-eyed person jaded.  It's why we have to be rigid most of the time.  As soon as you break and start granting exceptions, the tide overwhelms you.\n\nI make no claims one way or the other about graduate students, whose work relationships with their universities are of a completely different nature than undergrads.\n\nThanks for your inquiry.",
                              "author": "ChemMJW",
                              "created": 1603301023,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "g9h9kmu": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h9kmu/",
                          "text": "How are YOU teaching lmao",
                          "author": "CBRN66",
                          "created": 1603230464,
                          "upvotes": 4,
                          "replies": {
                            "g9hbsl1": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hbsl1/",
                              "text": "Very successfully for 20 years, thanks for asking. That actual experience is what qualifies me to speak about subjects few students in this thread actually have any knowledge of.\n\nOh, and now let me add lmao or a hashtag or something, because that definitely makes the post be taken more seriously.",
                              "author": "ChemMJW",
                              "created": 1603231416,
                              "upvotes": 0,
                              "replies": {
                                "g9hjnv4": {
                                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hjnv4/",
                                  "text": "You're in your 40s or older browsing a subreddit for college students? Yeah you're not a prof. You're clearly a TA who has a huge ego.\n\nAnd by the small chance you are an actual professor, congrats on teaching your entire life and not having any practical job experience. People like you make me laugh.",
                                  "author": "CBRN66",
                                  "created": 1603235621,
                                  "upvotes": 0,
                                  "replies": {
                                    "g9hp85f": {
                                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hp85f/",
                                      "text": "> And by the small chance you are an actual professor, congrats on teaching your entire life and not having any practical job experience. People like you make me laugh.\n\nJust stop.  You don't have the slightest clue what you're talking about.  That's the whole point of this thread.  But since I'm a professor and you're a student, let me teach you something you apparently don't know: almost no science professors at a major university are \"just teachers.\"  We all have years and decades of professional research experience, and our careers live and die by our continued research output, which determines our ability to win the grants that fund our work.  They don't give multi-million dollar research grants to people who don't have \"any practical job experience.\"  \n\nNow, just to be fair, there *are* some people at the university level who just teach, usually introductory classes, but these are not what people typically think of when they hear the word \"professor.\"  Even the non-tenure-track or instructional-track faculty have master's degrees or a Ph.D., and to earn that degree they had to do professional work in their field.  So, there is almost literally nobody at a university who has no practical job experience.  Keep that in mind the next time you think you know better than your instructor, who depending on their age likely has a decade or more of professional experience in the field.",
                                      "author": "ChemMJW",
                                      "created": 1603238821,
                                      "upvotes": 5,
                                      "replies": {}
                                    },
                                    "g9hk1xy": {
                                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hk1xy/",
                                      "text": "r/college \"The subreddit for discussion related to college. No admissions questions, cheating, memes, or illegal behavior/piracy.\"\n\nWhich part of that says that you have to be a college student to post here?\n\nHead on over to r/Professors if you like; undergrads post there too, and they're not professors.  It's almost as if humans are capable of discussing something without being something ...",
                                      "author": "ChemMJW",
                                      "created": 1603235844,
                                      "upvotes": 4,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g9gwqzo": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gwqzo/",
                          "text": "<continued from above>\n\n>maybe by dropping the lowest couple assignments (out of the 10-15 that are given), how does it hurt them\n\nMany classes do have policies of dropping the lowest test score or quiz score or HW score, etc.  Can you already guess where this goes?  If the policy is to drop one quiz score, we get emails asking us to drop two quiz scores, and if we refuse to drop the 2nd quiz score, the student will lose a scholarship and have to drop out of college and how will we sleep at night knowing we ruined his life, etc. \n\nIf a class has a policy of allowing three unexcused absences for any reason, you can guarantee there will be a student who skips three classes for no reason and then unexpectedly misses a fourth class due to oversleeping.  That student will then want an exception and demand to pass.\n\nBasically, there's no point in having class policies as a professor if you keep making exceptions, and once you start making exceptions, that door can never, ever be closed again.",
                          "author": "ChemMJW",
                          "created": 1603225174,
                          "upvotes": 2,
                          "replies": {
                            "g9hxnjm": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hxnjm/",
                              "text": "I was only a TA but I was solely responsible for a course a couple semesters and golly the number of people who asked to drop a second quiz is ASTOUNDING.",
                              "author": "littleedge",
                              "created": 1603243592,
                              "upvotes": 3,
                              "replies": {
                                "g9i0kdt": {
                                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i0kdt/",
                                  "text": "Thanks for your post and the independent confirmation that this stuff is as rampant as it is ridiculous.  It's almost as if all the examples of requests for special treatment I've given in this thread were completely true or something ...\n\nNow, I'll just finish this post by pointing out that if you didn't agree to drop that second quiz, you are an unempathetic monster who is literally worse than Hitler.  Or so a lot of the posters in this thread would say, probably.",
                                  "author": "ChemMJW",
                                  "created": 1603245289,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            },
                            "g9hj3c0": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hj3c0/",
                              "text": "Dropping lowest scores or allowing unexcused absences aren't even exceptions, they're just student-friendly policies (they apply to all students equally). I'm not sure why you're so aggressively against them; it just sounds like you don't like communicating with your students.",
                              "author": "kkoiso",
                              "created": 1603235292,
                              "upvotes": 4,
                              "replies": {
                                "g9hllo2": {
                                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hllo2/",
                                  "text": "Point to the part where I said I'm against these policies. I'll wait ...\n\nI already employ policies like these.  What I *am* against is students asking constantly for *exceptions* to policies.  I already drop one quiz score, or allow a certain number of absences, or whatever.  Should I drop two quiz scores?  If I drop two, why not three when the next person to ask comes along?  If I drop three quizzes, why bother having quizzes at all?  Why don't I just give everyone an A?  Would sure save me a lot of work.\n\nDo you see how that works?  If you give in to a request for an exception, there is NO END to the requests for additional exceptions.  It has nothing to do with being \"student-friendly\" or not.  The policy could be extremely strict OR extremely generous; that won't have any effect on the constant stream of requests for exceptions.  Can I miss a lab?  Can I miss two labs?  Can I miss the last lab so I can leave early for my family's Christmas ski trip? And so forth.  And yet when I can't let a student pass chemistry lab because they missed 6 out of the 15 lab sessions, somehow I'm the monster.",
                                  "author": "ChemMJW",
                                  "created": 1603236738,
                                  "upvotes": 3,
                                  "replies": {
                                    "g9i2foi": {
                                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i2foi/",
                                      "text": "Nobody's saying anyone should expand existing policies for select students. They're saying there should be leniency on a case-by-case basis for issues that might be unique to remote learning. If you already implement student-friendly policies then great.",
                                      "author": "kkoiso",
                                      "created": 1603246394,
                                      "upvotes": -1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g9gc9tz": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gc9tz/",
                  "text": "As someone with ADHD, I sympathize more with the students. Due to my disorder, I cannot simply self-motivate to do things on time. Most of my assignments are turned in late (thankfully, my professors are lenient with me) but they are done properly, indicating I have a proper grasp on the material. \n\nIn my opinion, mastering the material is more important more valuable than being timely.\n\nThis is also why I support pass/fail grading systems. Professors should gauge whether the student is ready to progress, rather than giving them a statistic that doesn't truly indicate that.",
                  "author": "CyrusReddick",
                  "created": 1603215656,
                  "upvotes": 22,
                  "replies": {}
                },
                "g9if39c": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9if39c/",
                  "text": "Assignments are fine, but what about exams?",
                  "author": "alannair",
                  "created": 1603254746,
                  "upvotes": 1,
                  "replies": {
                    "g9jhc88": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9jhc88/",
                      "text": "If a student is doing an exam remotely and makes the claim that the internet went down, I'm willing to give the student the benefit of the doubt.  Once.  Additional claims of internet problems will require actual evidence, for the simple reason that based on reliability statistics for most major US internet service providers, the probability is very low that the internet goes down for the same student on more than one occasion AND those occasions all just happen to be test times.  If the student lives in a very rural region or a place where the internet is known to be less reliable, that can be taken into account.  But for the demographics of my university, cases like that are the minority.\n\nSo, overall, if you claim the internet goes down during a test, you get the benefit of the doubt, but not an infinite number of times.\n\nEDIT: I should also point out that the above comment only applies to exams that are taken over the internet in real time.  If the exam is a take-home exam where, for example, students are given a whole week to complete the exam and simply have to submit it by a certain deadline, then the same policy as for regular assignments applies.  No special consideration for not being able to submit the exam a minute before it's due when the course system shows that you didn't even download the exam until 45 minutes before it was due.  If I see evidence that you've been diligently working on the exam the whole week but have trouble uploading it, then perhaps we can come to some kind of understanding.  But that is rarely the case.  Most of the ones who, mysteriously, have trouble uploading something a minute before it's due are also the ones who show no activity in the course system for 6 days and 23 hours before the weekly deadline.",
                      "author": "ChemMJW",
                      "created": 1603288633,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g9fxk3a": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fxk3a/",
          "text": "Not even close to the same thing. When a professor is having issues its usually something that happens live or within a short amount of time before its due / supposed to go live. \n\nStudents on the other hand usually wait until the last second to to turn stuff in (we see these \"I made it at 11:58\" posts all the time on here) and then when something goes wrong they are like \"go easy on me cause covid\".",
          "author": "dade305305",
          "created": 1603208504,
          "upvotes": -51,
          "replies": {
            "g9fye3i": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fye3i/",
              "text": "Did i mention anything about turning things in? No i said nothing about turning things in. Some of us live in rural areas and aren't graced with high speed internet that frequently has connection issues and our parent aren't willing to pay for better services. What exactly am i supposed to do when my zoom connection freezes during lecture because of internet connectivity issues luckily it hasn't happened during a test but when taking online tests I genenrally get less time per question because it takes ages to load each question. I wasn't going to delay a college education because of some shitty internet so I make do. My original comment had nothing to do with what you're talking about.",
              "author": "MentionCharacter3205",
              "created": 1603208911,
              "upvotes": 47,
              "replies": {
                "g9g08pv": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g08pv/",
                  "text": "Not that this is going to solve all of your problems, but have you tried calling into the audio on zoom. If your connection freezes the audio does not, so it is much easier to keep up with what is going on. I have to do this too and it is a lifesaver!",
                  "author": "cawcawmacaw",
                  "created": 1603209810,
                  "upvotes": 16,
                  "replies": {}
                },
                "g9fyrjy": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fyrjy/",
                  "text": "> I wasn't going to delay a college education because of some shitty internet \n\nAnd that's your choice. No professor should have to cut you any slack because of that. Hence the (100% justified imo) \"no excuses\".",
                  "author": "dade305305",
                  "created": 1603209094,
                  "upvotes": -53,
                  "replies": {
                    "g9g8elq": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g8elq/",
                      "text": "We also lose financial aid for skipping a semester.  So people on financial aid who aren't allowed to skip semesters will not be coming back after the pandemic if they decide to take a break.",
                      "author": "jackfrost2013",
                      "created": 1603213741,
                      "upvotes": 23,
                      "replies": {}
                    },
                    "g9fzocp": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fzocp/",
                      "text": "Yeah you left out that i said that i make do and I'm not saying i need someone to cut me slack, legit i also said nothing about wanting someone to cut me slack. Am i annoyed about the situation yes but my original comment is simply me saying its stressful that students get no excuses and profs get all the excuses. I said it was stressful and annoying that profs have the ability to be excused of any wrongdoing even when they are the ones not prepared. Its not about me getting slack its about profs being able to just brush off any issues and not see how those affect students.",
                      "author": "MentionCharacter3205",
                      "created": 1603209532,
                      "upvotes": 22,
                      "replies": {
                        "g9g0506": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g0506/",
                          "text": "And I'm telling you those are not the same thing as when professors have issues it typically happens in a small window before something is due. So if class is due to start at 1 and they go on at 12:30 to make sure things are running right and find that its not, it might take until 1:15 to get it fixed by IT or whoever. \n\nFor student's it usually a matter or things not working near the deadline when they had days or in some cases weeks to complete and submit something.",
                          "author": "dade305305",
                          "created": 1603209758,
                          "upvotes": -23,
                          "replies": {
                            "g9g1qu9": {
                              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g1qu9/",
                              "text": "Awesome glad we concluded we're talking about completely different things :)",
                              "author": "MentionCharacter3205",
                              "created": 1603210544,
                              "upvotes": 21,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "g9g3re3": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g3re3/",
                      "text": "Yes they should. For most financial aid you have to be enrolled every semester for four years. And no in my state the financial aid doesn't give a shit there is a pandemic going on.",
                      "author": "BecuzMDsaid",
                      "created": 1603211511,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "ga0x4dd": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga0x4dd/",
                      "text": "Lmfao next up u/dade305305 ‘s favorite book, Atlas Shrugged",
                      "author": "pokemongofanboy",
                      "created": 1603611363,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g9gwp1u": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gwp1u/",
              "text": "I've had a professor cancel class because his internet went out and he wasn't able to do online class. When I had the same issue a week later I got a 0 on my attendance even though I emailed him that I was having a problem. Why the fuck do I get punished for an issue that my teacher also dealt with. I'm generally not upset with the professors though. The administration are the real fuckers ruining education across the board.",
              "author": "buttlickerface",
              "created": 1603225152,
              "upvotes": 11,
              "replies": {
                "ga9mc4d": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga9mc4d/",
                  "text": "This needs to be upvoted 100 times more.",
                  "author": "bretleg",
                  "created": 1603802696,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9ft2m7": {
      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ft2m7/",
      "text": "I understand schools not wanting to making it easier for students since it’s not like last semester where u didn’t know half of it was going to be online. But schools really needed to tell teachers to be prepared to use technology. I’m so sick of hearing professors say they’re too old for technology. Like my school literally gave the teachers tons of training opportunity on how to use technology and free equipment to use, time to step it up and actually do your job.",
      "author": "Bored_Potato_69",
      "created": 1603206277,
      "upvotes": 1128,
      "replies": {
        "g9g2m9h": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2m9h/",
          "text": "On the other hand, the ability to teach well shouldn’t be gated by technology itself. Especially when it’s constantly changing and you cannot keep up. That’s how companies get control over industries as an unnecessary middle man.",
          "author": "pillbinge",
          "created": 1603210963,
          "upvotes": 113,
          "replies": {
            "g9gcv01": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gcv01/",
              "text": "I’m paying too university price for a university of phoenix experience.",
              "author": "YVX",
              "created": 1603215949,
              "upvotes": 65,
              "replies": {
                "g9horq5": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9horq5/",
                  "text": "University of Phoenix isn’t just bad because it’s online. It’s bad because it hires under qualified faculty, doesn’t provide the resources they need, doesn’t foster innovative curriculum, and incentivizes faculty to structure their courses and programs into something resembling a diploma mill. \n\nThe Art Institute isn’t online-only but also has earned the same bad reputation.",
                  "author": "Jooju",
                  "created": 1603238557,
                  "upvotes": 37,
                  "replies": {
                    "g9ioqyy": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ioqyy/",
                      "text": "True",
                      "author": "TheLivelyHuman",
                      "created": 1603263151,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gakcpg3": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gakcpg3/",
                      "text": "I just found that out a little while ago and it hurts. I wanted to go there.",
                      "author": "IChaos64",
                      "created": 1604027252,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g9g3v75": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g3v75/",
              "text": "No ur right technology shouldn’t be the main factor of teaching quality. Especially when the tech companies are trying to make huge profit on remote learning. It’s just when you’re forced to teach virtually and ur school offers you everything you need to succeed as a teacher, being stubborn towards technology and refuse to learn how to use it is only hurting students",
              "author": "Bored_Potato_69",
              "created": 1603211563,
              "upvotes": 21,
              "replies": {
                "g9ge71k": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ge71k/",
                  "text": "I get that but it isn't about being old. When you get older you realize that a lot of stuff is ephemeral and more often a pain. Technology as a boon or shortcut is something you believe earlier on but then you start to see it all normalized anyway. It's a pain to keep up for so long, not just a pain to learn or a pain for old minds somehow.\n\nIf we back up and look at just how many professors, even the ones who are great and simply don't voice their complaints, are struggling, it's not they who are hurting the students. I had professors some years back rely on slides they've used for *years* that they tweak. They aren't amazing with technology; other classes had to sit through other versions. To just change everything is bad and it does hurt the students who are the focus but it hurts teachers and professors too.",
                  "author": "pillbinge",
                  "created": 1603216594,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g9ilno8": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ilno8/",
              "text": "The simple fact is, if you cannot cope with fairly basic presentation technology when given access to training resources, during a pandemic that mandates learning via technology, then that’s just too bad. Students should not be expected to put up with people who can’t (or more commonly, won’t) move into the 21st century when the entire modality currently demands it.\n\nI have little patience for professors who refuse to provide their resources via the online end as it is (shockingly, some of us actually fare worse in person compared to online, but are forced to put up with in person teaching anyway). But when it’s mandatory to save lives? Too bad. Go retire with your fancy Corvette you keep bragging about every class.",
              "author": "HaloGuy381",
              "created": 1603260221,
              "upvotes": 7,
              "replies": {
                "g9nbtyf": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9nbtyf/",
                  "text": "Yet most students can't figure out how to cite properly or know how respond to email in a timely manner...",
                  "author": "veanell",
                  "created": 1603375225,
                  "upvotes": 5,
                  "replies": {
                    "g9ndco0": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9ndco0/",
                      "text": "Indeed they can’t. Annoys me to no end when my peers try to cite useless sources, actively plagiarize, or take days to respond to emails or messages, especially on team projects.\n\nThat said, I think it reasonable to hold a professor with decades of experience in their field to a modestly higher standard.",
                      "author": "HaloGuy381",
                      "created": 1603376058,
                      "upvotes": 2,
                      "replies": {
                        "g9nv93y": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9nv93y/",
                          "text": "Then you're not learning from the information presented; that model doesn't work and the expectations might be too much anyway. That or many people shouldn't be in higher ed. and higher ed. therefore shouldn't be as valued. Saying that professors and teachers need to completely revamp everything they do every other month isn't \"a modestly higher standard\".",
                          "author": "pillbinge",
                          "created": 1603384988,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ga2mtpp": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga2mtpp/",
                  "text": "Hmm...my VW is 19 years old. I've never know a colleague to drive a Corvette. \nAnd yes I have put all my resources on line since many students don't know how to order their books from Amazon.",
                  "author": "Cuzcopete",
                  "created": 1603644796,
                  "upvotes": 1,
                  "replies": {}
                },
                "g9nv4qt": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9nv4qt/",
                  "text": "Clearly it isn't a simple fact because you're not getting what you think you should be getting. The idea that teachers always need to be able to adapt to any brand or product is asinine. It's not \"adapting to technology\" in a general sense, it's specific programs. And those programs are constantly changing and updating and resetting program settings. We're cutting out a wealth of information teachers have by bottlenecking it through bad implementation, and that's just how it's probably going to be because of the pandemic anyway.\n\nYou can have little patience for professors who refuse to provide resources but I've worked with professors who genuinely try everything at their disposal and they're often worse off than professors who just plow through with everything they did before.\n\n>some of us actually fare worse in person compared to online\n\nSo work on that or, and \"the simple fact is\", tough shit.",
                  "author": "pillbinge",
                  "created": 1603384929,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9g17qq": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g17qq/",
          "text": "Regarding the point that students know what to expect now, it's also true that the situation in certain respects has worsened since spring 2020. For example there was (some of) a stimulus then, but the money has dried up now, and folks—including plenty of students and their families—are struggling to pay bills. It's likely to get worse, not better, especially since winter will contribute to a higher case rate.\n\nThe declining economic situation might suggest that some kind of slack is due.",
          "author": "jreed11",
          "created": 1603210287,
          "upvotes": 186,
          "replies": {
            "g9g37q8": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g37q8/",
              "text": "Oh that’s a good point I didn’t even think about the stimulus checks being gone. I do think teachers should be more understanding as long as the students are putting in the effort (and a lot of teachers are). It’s just we all need to keep moving forward bc at this rate most students won’t even get to be on campus in the spring",
              "author": "Bored_Potato_69",
              "created": 1603211248,
              "upvotes": 54,
              "replies": {}
            },
            "g9gbenc": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gbenc/",
              "text": "That and work study is mostly out at my school. Normally, I'd have some money for basic necessities from work study plus other odd jobs. But since everything is online, almost everyone I know was either made redundant from their work study job or was not even placed into one because there are almost no remote jobs. The worst part is I don't have it the worst at all. I know some classmates who work for really crappy companies with no choice over their schedules who work night shifts, double shifts, insecurity over hours, etc., plus have to manage a full time workload or they will lose financial aid. And then you have these professors who get so offended that a student cannot come to their \"non-mandatory\" synchronous class or because a student cannot complete a busy work assignment that was hidden on Canvas, never discussed, and added with a day to spare! It is ridiculous, these professors need to have a heart.",
              "author": null,
              "created": 1603215226,
              "upvotes": 32,
              "replies": {}
            },
            "g9hdj9y": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hdj9y/",
              "text": "Money didn't \"dry up\", it was stopped all together and not given an extension or a replacement, thanks to Republicans in the Senate and the lunatic in the White House stonewalling the stimulus packages. People are suffering because they're being left to suffer. Only hope is clearing them out in the next few weeks to unlock the stimulus.\n\nAlso, it's going to get worse in fall and winter (it already is) but lets not pretend like the current state needed to be this bad. If we had proper enforcement of distancing and masks, and leadership that wasn't willing to let a plague run unchecked to keep the stock market happy, we might have a better situation than we're in now.",
              "author": "fullforce098",
              "created": 1603232223,
              "upvotes": 23,
              "replies": {}
            }
          }
        },
        "g9gf9y2": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gf9y2/",
          "text": "I work in IT. It has come to my attention that just because you can show people how to use the computer doesn't mean they've actually learned a damn thing. I have to show people, mind you that have worked for the government for 25 years nearly all of that ON A COMPUTER, ok, I have to show this person how to open a web browser and search a site and then show them how to save it to favorites. Now, they have PCs, laptops at home, they own a smart phone and a tablet, but yet this is so fucking foreign to them. Same way with teaching older professors how to do classes thru the web. For us young whipper-snappers who were basically built on computers it's simple, but just 5 years older than me and half the people are like wtf is this? and wtf am I supposed to do with it? Granted OP and the rest of the college/school world should be getting the same treatment they are expected of from their professors. There's no reason why your exam failed to open but showed you took it, there should be no reason why you can't record a lecture and pin it to blackboard or what have you that way students who have to work extra now, who have to take care of sick family now, and have other slightly more important things to do than listen to a old as f man talking about English comp 1, or whatever. If the professors can't figure it out then they need to find someone who can show them how to do it.\n\nWhen I was in my last semester, it was Spring 2020 and one of my professors couldn't figure out how to do our SLES-12 Linux class virtually without us being able to run our virtual machines. So his plan was to just fail us all and start again in the new semester. I was not about to take this class over again. I was half way thru and this shit started. I told the department chair and she granted me a leave with another class to fulfill my requirement, but I had already taken 3 Linux classes so this one was just another linux class same things different operating system. So they were fine with it. My friends in that class had to do class over again Summer.\n\nIt's definitely harder now with the pandemic and it seems no end in sight. Professors CAN and SHOULD do better especially if they are expecting perfection out of their students. But just to say they've been given the opportunity to learn how to do virtual classes doesn't mean shit. I've seen some crazy shit in my just 9 weeks of working in IT.",
          "author": "Rubicon2020",
          "created": 1603217109,
          "upvotes": 20,
          "replies": {}
        },
        "g9h72fe": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h72fe/",
          "text": "One prof has a weekly discussion with a class of 45 in the main zoom room. It's just pure chaos, all because he wont learn how to do breakout rooms",
          "author": null,
          "created": 1603229405,
          "upvotes": 5,
          "replies": {}
        },
        "g9gyh2t": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9gyh2t/",
          "text": "[deleted]",
          "author": null,
          "created": 1603225866,
          "upvotes": 8,
          "replies": {
            "g9i0lkl": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i0lkl/",
              "text": "Don’t forget, that adjuncts didn’t get paid to learn new technologies, modify their course to 100% online, or attend any required zoom meetings discussing Fall semester. Most adjunct’s contracts ended with Spring 2020, and new contracts didn’t become active until the start of Fall 2020. So, all that work they did over the summer, they did for free.",
              "author": "DeeDeeZee",
              "created": 1603245308,
              "upvotes": 12,
              "replies": {
                "g9mgx5a": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9mgx5a/",
                  "text": "Yes, working for free and setting up modules and everything else online that used to be conveyed through words spoken in a classroom. Typing every single thing out--using every waking moment of the day and night to modify every course that's being taught.\n\nThen, on top of that, answering hundreds of emails from students who don't understand the technology, even though the instructions were meticulously typed out step by step.  I taught myself how to convert everything to online instruction, despite being \"old,\" and yet supposedly tech-savvy students get confused about following 3-step instructions on how to submit an assignment online.",
                  "author": "LadyChatterteeth",
                  "created": 1603347909,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "g9hpyv0": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hpyv0/",
              "text": "Plus the imperative to research and publish. This is a huge pressure that students basically never see.\n\nWhen a school hires an assistant professor, they have a set number of years to “make tenure.” If you don’t make tenure, then you’re done. Doesn’t matter how good of a teacher you are, you are fired. The qualifications for tenure vary, but generally requires making substantial contributions to your field.\n\nSo yeah, lots of stress there.\n\nUnder COVID, a lot of places have extended the tenure clock by a year, but if you honestly think you put your scholarly work down for 6-12 months and then just pick it back up like nothing happened, then you’ve been fooled.",
              "author": "Jooju",
              "created": 1603239238,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "g9hda4c": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hda4c/",
          "text": "Personal computers have been a thing for over 40 years now. Ubiquitous computing in the United States has been a thing for between 10-20 years (depending on how you look at it). Computers should have been a part of every curriculum for a long time now. Hell, even my acrylic/oil painting class 10 years ago involved creating a presentation on a computer and using one to present it in class. Profs not knowing how to use tech is a pathetic excuse.",
          "author": "felis_flatus",
          "created": 1603232087,
          "upvotes": 5,
          "replies": {
            "ga2mydi": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga2mydi/",
              "text": "Students not knowing how to read a book is also a pathetic excuse.",
              "author": "Cuzcopete",
              "created": 1603644863,
              "upvotes": 1,
              "replies": {
                "ga4w1cg": {
                  "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga4w1cg/",
                  "text": "I’m not really sure how that’s relevant. Neither OP nor I said anything about there being an issue with students reading capabilities. Reading comprehension is generally required to use computing devices anyway, so even the core of your statement is irrelevant.",
                  "author": "felis_flatus",
                  "created": 1603684206,
                  "upvotes": 1,
                  "replies": {
                    "ga5rdt1": {
                      "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga5rdt1/",
                      "text": "Actually it's right on point. You expect instructors to be capable of using technology to teach, yet student reading activity has dropped to almost nothing (with the exception of social media). There is more to education than just watching expertly run zoom sessions.",
                      "author": "Cuzcopete",
                      "created": 1603714604,
                      "upvotes": 1,
                      "replies": {
                        "ga6e55x": {
                          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/ga6e55x/",
                          "text": "It’s not even remotely on point. I can expect students to uphold a minimum reading comprehension level and also expect instructors to learn the basics of computing. They are not mutually exclusive, and I never said they were.\n\nYou’re absolutely right that there’s more to education than just watching a live stream or recorded video. There’s research, practice, failure, and much more. But if instruction is done poorly, they still suffer. And instructors not learning how to use technology when personal computers have existed for over 40 years, and modern computing technologies have existed for over a decade, is putting their students at a disadvantage.\n\nIt also puts the teachers at a potential disadvantage when they risk being replaced with teachers who are willing to learn to use modern tech. It’s a lose-lose situation.",
                          "author": "felis_flatus",
                          "created": 1603727862,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g9hzkgp": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hzkgp/",
          "text": ">I understand schools not wanting to making it easier for students since it’s not like last semester where u didn’t know half of it was going to be online. But schools really needed to tell teachers to be prepared to use technology. I’m so sick of hearing professors say they’re too old for technology. Like my school literally gave the teachers tons of training opportunity on how to use technology and free equipment to use, time to step it up and actually do your job.\n\nYeah my professor is just using my labs which while it's okay for use on homework I hate test on it",
          "author": "skymtf",
          "created": 1603244708,
          "upvotes": 2,
          "replies": {}
        },
        "g9fxvgc": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9fxvgc/",
          "text": "[removed]",
          "author": null,
          "created": 1603208657,
          "upvotes": 3,
          "replies": {
            "g9g2lf3": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9g2lf3/",
              "text": "r/ihadastroke",
              "author": "sogothimdead",
              "created": 1603210952,
              "upvotes": 15,
              "replies": {}
            },
            "g9hasdr": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hasdr/",
              "text": "It's a little early to be drinking, dude.",
              "author": "Bigfrostynugs",
              "created": 1603230984,
              "upvotes": 3,
              "replies": {}
            },
            "g9hs99y": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9hs99y/",
              "text": "agreed",
              "author": "TheMapKing",
              "created": 1603240514,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gd9do8l": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/gd9do8l/",
          "text": "Not just professors but students as well! Like can they shut tf up and stop saying they don't learn anything online and that it's hard?!! It the same thing as learning things on YouTube and there on their phone all day anyways!!! What's the difference?!!",
          "author": "GrapefruitOk4660",
          "created": 1606078350,
          "upvotes": 1,
          "replies": {}
        },
        "g9goark": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9goark/",
          "text": "Why shouldn't it be easier for students?",
          "author": null,
          "created": 1603221445,
          "upvotes": 1,
          "replies": {
            "g9i90ok": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9i90ok/",
              "text": "At least where I teach, our students are headed to nursing school & other professional programs next. They’re going to be annihilated there if they haven’t learned the basics. Also there’s a big concern that the nursing school admissions committees won’t accept applicants from our school if there’s a rumor going around that we were going easy on the students during the pandemic. Up till last week I’d been trying to give the students a break in various ways; as of Saturday I’ve been told I have to make my class much harder, & must ensure that grade distributions this year are identical to last year. :/",
              "author": "TotallyCaffeinated",
              "created": 1603250472,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g9h2v6g": {
          "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h2v6g/",
          "text": "Didn’t they have at least the summer to learn ? Don’t tell me they fucked around all summer ?",
          "author": null,
          "created": 1603227645,
          "upvotes": -5,
          "replies": {
            "g9h87v1": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h87v1/",
              "text": "At my workplace, everyone took multiple webinars and did their best to learn technology. However, most faculty work on a 9 month contract, so they did all of this work for free. Faculty usually are not paid/employed by the university over summer and spend time doing their research and other work instead.",
              "author": "badgersssss",
              "created": 1603229891,
              "upvotes": 10,
              "replies": {}
            },
            "g9h83s8": {
              "link": "/r/college/comments/jeqz5m/why_do_students_have_to_give_professors_and_admin/g9h83s8/",
              "text": "Most universities were saying how all classes were going to be in person over the summer, however many universities are now mostly or entirely online. It was a last minute switch for a lot of schools so many professors may have assumed it would be in person and so didn't plan for online.",
              "author": "samalina11",
              "created": 1603229843,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634057377
}