{
  "sid": "q01scp",
  "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/",
  "title:": "Is studying what you love (history for me) more important than what's most realistic?",
  "text": "Howdy.   \n\n\nAbout 3 years ago I was attending university and posted to this subreddit in a state of distress, expressing my desire to drop out because I was depressed and lost. I DID end up dropping out, and am now looking to go back and hopefully study a subject I like AND will set me up for a relatively comfortable future.\n\n&#x200B;\n\nThis is the problem. I realized I love learning about history. I worked a lot of manual labor jobs spending some days listening to a full 7-8 hours of history podcasts and audiobooks. It seems like the one thing I truly have an interest in that could potentially lead to a career in life, but that's sort of the problem. I don't really know how realistic it is to make a good well paying career out of studying history in college. I live in the US where teachers are pretty criminally underpaid otherwise I would consider it, but aside from that I'm not sure there really is a stable option unless I just went to law school or something after, but that isn't a strong interest of mine (at least at the moment).\n\n&#x200B;\n\nI have also been considering studying something related to computer science like programming, but I do consider this to be a large gamble. I took web design classes in high school and besides that have a very limited experience in programming or any other kinda computer science. I know with this sort of degree I could pretty easily find a well paying job in a field that's growing, but I have much less to justify pursuing it other than the fact that it pays well and I have a slight interest in it.\n\n&#x200B;\n\nI'm sure there are others with similar thought processes to myself. I'd like to hear from some others and their opinions on balancing doing what you love with realistic expectations and views of the world. Going to school and wasting a lot of money/time is something I want to avoid as much as possible, I want to give myself the best shot of succeeding right from the get go. Sorry for rambling.\n\n&#x200B;\n\n**TLDR**: Do you prioritize interest in a field/career? Or do you prioritize financial stability and other reasons pertaining to having realistic expectations about your future?",
  "author": "TheLogFather",
  "created": 1633203190,
  "updated": 1634089684,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.83,
  "comments": {
    "hf53w7x": {
      "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf53w7x/",
      "text": "I'm lucky enough to currently love my major and have it lead into what should be a fairly lucrative career, if I do my job well. However, I began my college career prioritizing financial stability. At the behest of my sincere, yet misled father, I began majoring in business without any real interest in the field at all. It was terrible and I hated it. While I have a head for business (the work was never necessarily difficult, just not interesting), I didn't enjoy it *at all*, so I was miserable. Once I changed to my current major, all of my work was infinitely more enjoyable and I'm thriving.\n\nHistory majors have other options than just teaching (you could focus on the research side of it and become a historian for some ancient culture, for example), and not all of them are underpaid. Further, if you feel like you could handle it, you could combine your history major with a second major or a minor in another related subject like anthropology or archeology or modern cultural studies, which would increase your specialization and possibly open up opportunities for making better money.\n\nAll of this to say, it's all about what you want to give up. Would you rather give up possibly more money in the future to work on something you enjoy, or give up something you enjoy for possibly more money in the future? Personally, even if I knew I wouldn't make much, I believe life is too short to grind to the grave and I would choose something I enjoy studying and working in.",
      "author": "ambitious-cactus",
      "created": 1633207615,
      "upvotes": 6,
      "replies": {
        "hf57g7v": {
          "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf57g7v/",
          "text": "Yeah ideally I would be in a situation like yourself and just have an interest in something that pays well. Did you switch to your current major because of some other class you took while majoring in business? Or was that something you always wanted to do in the first place? It's just tough not really knowing how much you are going to like something until you go into debt to try it out.\n\nThanks for the reply",
          "author": "TheLogFather",
          "created": 1633209150,
          "upvotes": 2,
          "replies": {
            "hf58uzs": {
              "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf58uzs/",
              "text": "I swapped to my current major due to another course I took while I was pursuing a business major, yes. I entered college without any idea of what I wanted to do, so again, I was incredibly lucky. I took that one course and just fell in love with the subject immediately, then switched majors.\n\nI will say that if you don't know what you want to do yet, I highly recommend taking classes that seem interesting that also satisfy general education requirements. That's how I found my current major: I needed a language and I took American Sign Language on a whim and *bam!*, I was hooked. It's probable that I won't make a ridiculous amount of money, but I don't think I'll be as woefully underpaid as US educators.  \nBut I digress; take some time to dabble. If you have a local community college, consider applying for financial aid and taking a few courses there. Depending on your financial situation, you may not have to pay out of pocket at all for part-time semesters.",
              "author": "ambitious-cactus",
              "created": 1633209777,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hf5orgq": {
      "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf5orgq/",
      "text": "Dude can I be really honest with you the degree market for history grads is pretty saturated saturated which means you're going to have difficulty finding a position however it's very common for people to pursue what they love in an undergraduate degree and then get a master's degree in something else entirely it's entirely business management Or something else that could be more of a lucrative career path I do know a few people that have like majored in medieval history Or theater or something and then going on to get a master's degree in business analytics or or economics or something it's good to have a broad undergraduate degree your graduate degree if you can afford to get a masters get the undergrad degree you want but get a master's degree in something that you can probably get a job relatively easily in Maybe you'll get lucky and be able to find a job in a field you love but if you can't you might be able to find a position in something you can enjoy but in general a job is something you do it's not something you draw fulfillment from you get your fulfillment and your joy from hobbies family friends so find something you can tolerate or moderately like to do if you can't find a job in history. And maybe make history your hobby write a jump write a book write a book about about a particular historical topic you're interested interested in or find a job you like it might not be your Passion but it will make you decent money and make history a hobby or just something you do on the side for fun if you can't find a position using your undergraduate history degree",
      "author": "pygmypuffonacid",
      "created": 1633216817,
      "upvotes": 3,
      "replies": {}
    },
    "hf6gtzv": {
      "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf6gtzv/",
      "text": "i’d say major in something that would be good for a career and throw in some history courses every semester. i like history so i added one to my course load",
      "author": "EdelwoodOil",
      "created": 1633229982,
      "upvotes": 2,
      "replies": {}
    },
    "hf50ol5": {
      "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf50ol5/",
      "text": " I mean college isn't just meant to prepare your for a career, some people go to college for enlightenment.\n\nHowever it's unlikely that you'll get a job directly in the field of history with only a bachelors.",
      "author": "malarkeyasian",
      "created": 1633206224,
      "upvotes": 1,
      "replies": {
        "hf57258": {
          "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf57258/",
          "text": "Thanks for the response, personally I'm not in a position where I can afford to go to college just for the experience so I definitely am looking to get more out of it. I don't really need much in life but financial stability is something I really do want for my future. And as you said, a history bachelors doesn't get you very far.",
          "author": "TheLogFather",
          "created": 1633208979,
          "upvotes": 2,
          "replies": {
            "hf57vd0": {
              "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf57vd0/",
              "text": "I'll suggest you major in CS but minor in history or take a couple classes on the side. You'll have to take gen-ed classes anyway and you can choose a history class for your gen-eds.",
              "author": "malarkeyasian",
              "created": 1633209338,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hf66nxe": {
      "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf66nxe/",
      "text": "You won't be able to pay those loans back",
      "author": "TragicalKingdom",
      "created": 1633224958,
      "upvotes": 1,
      "replies": {}
    },
    "hf66xdf": {
      "link": "/r/college/comments/q01scp/is_studying_what_you_love_history_for_me_more/hf66xdf/",
      "text": "Finance stability over everything else",
      "author": "speed700",
      "created": 1633225080,
      "upvotes": 1,
      "replies": {}
    }
  }
}