{"sid": "pwqozt", "link": "/r/college/comments/pwqozt/i_feel_like_my_friendships_in_college_are/", "title:": "I feel like my friendships in college are situational and not \"true\", so to speak. Am I the only one feeling this?", "text": "I have several friends in college, but none of them texted me or I did not text them during lockdown. I still talk to my middle school and high school friends, but when it comes to college, it sucks. The college started a week ago after lockdown. It's been 2 years in college and this time I also wanted to communicate with them on social media but heck no, they couldn't care less. It feels like at college we HAVE to be together because we don't want to be lonely and that's it. I think we won't ever talk once after we graduate. I wonder if I am the only one. Or, maybe I care too much and value people who are not worth it. What do you think?", "author": "PhilosopherActual893", "created": 1632777031, "retrieved": 1632800011, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"hejrltd": {"link": "/r/college/comments/pwqozt/i_feel_like_my_friendships_in_college_are/hejrltd/", "text": "I mean I feel the same way. I feel that I can get along with people and have nice conversations with people, however I feel that I can't really get a deep enough bond with anybody. As a result I have a bunch of friendly people and acquaintances but no real friends :(", "author": "malarkeyasian", "created": 1632796574, "upvotes": 1}, "hejqhjf": {"link": "/r/college/comments/pwqozt/i_feel_like_my_friendships_in_college_are/hejqhjf/", "text": "I mean, I don't have any friends of any type, so you're doing better than me.\n\nBut yeah, my high school friends were like this.", "author": "91p348", "created": 1632796034, "upvotes": 1}, "heiudbi": {"link": "/r/college/comments/pwqozt/i_feel_like_my_friendships_in_college_are/heiudbi/", "text": "Distance even a little bit makes a huge difference. There's a lot of friends I've made that I don't communicate with regularly, but if I was to go visit I can pick up wherever we left off. They'll come and go in terms of focus but might not forever lost as friends. As every gets busy with life it gets hard too.", "author": "NinjaLorian", "created": 1632780939, "upvotes": 3}, "heiotvq": {"link": "/r/college/comments/pwqozt/i_feel_like_my_friendships_in_college_are/heiotvq/", "text": "How old are you?", "author": "BarIntelligent9156", "created": 1632778255, "upvotes": 2}}}