{"sid": "hd5va6", "link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/", "title:": "I'm 26, and college is too hard. I feel like giving up.", "text": "I just registered for my fall 2020 classes, and am already overwhelmed.\n\nI'm still considered a SOPHOMORE at my age, and it's extremely frustrating when everyone else is graduating with their masters at 24!\n\nMy biggest issue is that I used to take two courses per semester because I have ADHD, and get side-tracked so easily. I go from studying to thinking about what I should eat for lunch, and my mind goes on an adventure. Next thing you know, two hours have passed, and I didn't get anything done.\n\nFull-time semesters are HELL for me, and I recently changed majors from nursing to software engineering. The only way I can get out of college on time is if I tackle full-time semesters instead of just two courses, but how on earth are people surviving 12+ credits when they're dealing with calculus and upper level programming/engineering classes?? How do you manage to not fail taking these overwhelming classes all at once?\n\n**EDIT: Seriously, I thank every one of you for your comments. Your thoughts and advice alone make me feel encouraged.\nI should add that I am not getting any professional help for my ADHD. For some reason, I feel shameful in asking for drugs like Adderall because I don’t want people thinking I’m just trying to boost my way through college with the help of stimulants. Another HUGE issue of mine is insomnia. It’s currently 4:18 AM, and I can’t sleep (this is the norm). I have constant racing thoughts, and it leads to day time drowsiness. Not sure if I’ll ever get a college degree. I guess it’s time I get some professional help for my health issues. But aside from that, THANK YOU FOR THE ENCOURAGEMENT. It’s so genuinely kind of you all.**", "author": "sophiebyherself", "created": 1592741117, "retrieved": 1632802123, "over_18": false, "upvotes": 1068, "upvote_ratio": 0.97, "comments": {"fw33v1v": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fw33v1v/", "text": "I'm 29 and just graduated with my bachelors degree. I went back to school at the same age you are now. Every semester I kept thinking to myself, What am I doing here? But I just kept showing up. And doing the work. Same as you, I started as a part-time student, and didn't ever think I could manage a full time schedule. But when the time came and I had to do full-time, I did. In fact, my final semester, I took 16 credits (6 classes) and graduated this spring. If I did it, so can you! Believe in yourself! Enjoy it! Do you best and forget about anything else.", "author": "bryanpm790", "created": 1593194739, "upvotes": 1}, "fvyn5j8": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvyn5j8/", "text": "Stick with it. There is no ''Time-line\". You'll pass your classes, you'll graduate, and you're going to get the job you want. You just have to be patient and not worry so much about the future or any external factors. I'm 26 right now and a Sophomore in college as well. My major is in Finance with a minor in Computer Science. When I'm done with this, I'm going to get my Masters in Accounting. I was just like you, comparing myself to others and letting things distract me. I have a wife, a 2 year old son, and we are all living in one bedroom at my wife's parent's house. My wife and I were both in the Air Force, but we got out and now we are full time students. I have plenty of distractions and worries, but what helped me is to really think about what it is that you want to do. What is it that you ACTUALLY want to do, not something that sounds cool or that makes you look smart, or that will make you the most money. When you focus your thinking inward and decide what YOU want for YOU, it makes focusing on whatever you need to do to achieve that much easier (i.e. studying). I'm currently carrying 16 hours per semester and I'm not taking breaks. I finished this past Spring semester with a 3.5 GPA, then went right into a Summer semester carrying 16 hours, got a 4.0, and next week I start the second module of the summer semester, carrying another 16 hours. After that, I'm going right into the Fall semester, and I plan on doing this until I'm finished with my college career. YOU can do this as well, just focus your thoughts, figure out the path that is really right for you, put it in your mind that you CAN and WILL do it, and the rest will fall in line. If you don't work out or exert yourself physically, start doing that, it'll help with sleep. I suffer from severe anxiety and would wake up 2-4 times a night, but I started running and now I sleep like a baby, it also helps with my thoughts. Build some mental toughness and focus. You can do it!", "author": "Bubb_Rub", "created": 1593098548, "upvotes": 1}, "fvow6e9": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvow6e9/", "text": "I feel your pain, I have ADHD too. I take a long lasting form of Ritalin called Concerta, which wouldn't even give someone without ADHD a  significant boost. You could try that. Because you have ADHD, Adderall won't work for you the way it does people that take for a boost or to get high, it has a totally different effect on someone without ADHD than it does on us. You wouldn't getting something to make life easier, you're getting something to make you healthier. Mental illness is called and illness for a reason.", "author": "moymeoy", "created": 1592870237, "upvotes": 1}, "fvo48z1": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvo48z1/", "text": "Get some adderal. So many college students use adderal to study, and honestly you can be at a disadvantage if you dont.  No one is going to shame you for using it.", "author": null, "created": 1592855558, "upvotes": 1}, "fvnu1u9": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvnu1u9/", "text": "Hey, 39 yr old undergrad with ADHD.  You changed from a really difficult major to a really difficult major. I burned out trying to do software engineering during my Jumore year back around the turn of the century. Went back after almost exactly 20 years, because manufacturing is ...well, manufacturing.  I'm taking business classes and I have to say it's quite a bit easier even with a full time load. You might want to try out accounting or economics. They both have enough complications at the higher levels to remain interesting. And the math is scaled way back. It feels like sandbagging a little, but it's kind of nice stressing over whether it's an A or A minus versus doing the same math problem 10 times because your brain decides to randomly check out. But, either way don't give up, in the current system you'll work your ass off making somebody else rich(unless your lucky or etc).", "author": null, "created": 1592850543, "upvotes": 1}, "fvndbxd": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvndbxd/", "text": "I have ADHD and anxiety, I’m also doing a double major in chemical engineering and chemistry, here my tips.\n\n\n1. Take advantage of your schools disability resources, they’re they’re for a reason and did wonder for me. My school didn’t give any extra time but gave me a private space to test so I didn’t get distracted. \n\n2.  Take more classes. This one sounds counterintuitive, but you want to graduate on time with minimal debt. Don’t jump from a part-time to full-time schedule right away, but work your way up. First, add a libed, then each semester add a few more classes. Keep in mind your liberal arts classes are *much* easier than your STEM classes, so they can be nice to add at first to ease into the idea of taking more credits. Just make sure not to anger the prof, since even though those subjects have really high grade inflation the professors impression of you affects your grade. \n\n3. Try to get a full 8 hours of sleep. I took sleep medication to help with this, but now I can do it most nights. It works *wonders.*\n\n4. Try to get habits. Go to the library to study at a set time, even if you’re not studying the whole time at first and get distracted. 15 minutes of studying out of 45 of being at the library is better than nothing! \n\n\nAnyways, that’s some of what I did. Lmk what you think. You can always take medication as well, but I tried to stay away from that, only using it the week leading up to finals season and during finals.", "author": "catfeinee", "created": 1592842260, "upvotes": 1}, "fvlxq2f": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlxq2f/", "text": "I feel you completely man. I’ve been in a similar boat. I’m 25, have ADHD and start my freshman year this fall. The anxiety has been killing me, especially with my age. I made the mistake of working right out of highschool. Thankfully I made pretty good money, but I worked between 60-80 hours a week. Life kinda took a hit and set me back about a year ago, but it gave me time to reprioritize schooling. \n\nStarting a doctorates programme at 25 is a nightmare. Doesn’t help I can’t use medicine like Adderall because it has some weird effects on my eyes. \n\nTry your best to keep your head high. I hope everything works the way you want them too 💜", "author": "killdai", "created": 1592802620, "upvotes": 1}, "fvlx4ck": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlx4ck/", "text": "I’m in the same boat, but there is no hope for me.  I am disabled and have a ton of medical problems.  I’m trying various treatments, but not having much luck and there is no clear cut answers to fix me.  I loose days at a time because of pain but don’t have any way to control it (and cannot find a doctor to prescribe me anything).  I’m with my school’s disability program and am successful in the classes I take, I just can’t take very many at a time.  I managed two last semester and was hoping for two over the summer, but one was super inaccessible and I had to drop it.  I’ve signed up for three classes in the fall but even that feels like a stretch.  I’m sort of in a limbo between my freshman and sophomore year and I have no idea how I’ll be able to finish college much less be successful and independent after.", "author": "simplysydney22", "created": 1592802155, "upvotes": 1}, "fvlw1uv": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlw1uv/", "text": "oh my god OP I have severe ADHD and while medicine doesn't fix everything, it still helps. It's a huge part of the answer to your problem and seeing you say that it you feel like it is a kind of workaround is extremely infuriating. Please go to a doctor and get a prescription", "author": null, "created": 1592801357, "upvotes": 1}, "fvlpgat": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlpgat/", "text": "Don’t feel bad bro ppl r finishing there associates at my age and I’m still stuck on gen ed! It’s tough but we will get thru it\n:)", "author": "chicityhopper", "created": 1592796680, "upvotes": 1}, "fvlm544": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlm544/", "text": "Find something you’re good at and interested ... not something hard and interesting", "author": null, "created": 1592794493, "upvotes": 1}, "fvljr6b": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvljr6b/", "text": "College is a lot harder than work, and a lot less boring. There are plenty of do nothing jobs out there that pay decent, if you can handle the mind numb", "author": "TheApricotCavalier", "created": 1592792932, "upvotes": 1}, "fvlicik": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlicik/", "text": "First thing is first. Be present! Don’t compare yourself to others! This is the biggest let down!\n\nEnjoy your journey baby", "author": "iloveyou1220", "created": 1592792031, "upvotes": 1}, "fvldyis": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvldyis/", "text": "Keep going, because when you get that degree, it doesn't have a date on it. Doesn't matter how long it takes as long as you keep pushing", "author": "mjbrown210", "created": 1592789229, "upvotes": 2}, "fvlcyn1": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlcyn1/", "text": "It’s college. It’s supposed to be hard.", "author": "Jarrrad", "created": 1592788593, "upvotes": 1}, "fvlcp6j": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlcp6j/", "text": "You should definitely see about getting some treatment for it. I had to get meditation for anxiety and depression and it’s the only way I’m able to actually enjoy college.", "author": "Mikaela963", "created": 1592788429, "upvotes": 1}, "fvlcikw": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlcikw/", "text": "Don't worry about your age. Everyone finishes at a different pace. I'm 37 and finishing pharmacy school.   Many finish at 24.  It's not a race to the finish.", "author": "swearingino", "created": 1592788313, "upvotes": 1}, "fvlcgo7": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvlcgo7/", "text": "Hey! So there's a lot of comments and tbh I didn't read all of them, but I have a really hard time with 12+ semesters as well. What I do is take 3 spring classes, 2 summer classes, and then 3 fall classes. If you could work around this kind of schedule, I think it's super helpful!", "author": "crazybreadsticks", "created": 1592788279, "upvotes": 1}, "fvl1l7y": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvl1l7y/", "text": "\nEveryone has their own pace for reasons unique to their life. Don’t compare yourself to others. There are people in their 50s that are just beginning their college education. If it takes you until you’re 30, it takes you until you’re 30. Deep breaths! \n\nI went to r/WGU for my masters degree because I saw the level of support that WGU provided students and the support that students provided each other. Before I even attended the school, I would go through the various WGU student pages on Facebook to read supportive messages between students and try to apply them to myself and my undergrad work. Seems weird, but it did help. \n\nNever hesitate to ask for help from tutors, writing centers, doctors, friends, family, peers, etc. I think you’d be surprised", "author": "mother_of_nerd", "created": 1592781564, "upvotes": 1}, "fvl0n0w": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvl0n0w/", "text": "Meditation, law of attraction, reality transurfing will help you. I am no expert enough to explain it but at least it released me from anxiety and depression. I encourage you to look it up.", "author": "antichrome69", "created": 1592780990, "upvotes": 1}, "fvkwf4z": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkwf4z/", "text": "1. As others mentioned, my school does accomodations for students with diagnosed ADHD. Things like class notes and a private room and longer time on tests.\n\n2. I went back to school at 26 and it was very hard. Your first semester you.will consider quitting, but don't. You'll get the hang of it. You will have to basically be a bulldozer for 2+ years but you can make it. Can't go to Master's till you get your Bachelor's so just do it! If now is too late, 30 will be even worse! Do it NOW!", "author": "Duckduckgosling", "created": 1592778510, "upvotes": 1}, "fvkw5vk": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkw5vk/", "text": "Man who cares what age people are graduating at? Don't worry about that", "author": "zarnonymous", "created": 1592778360, "upvotes": 1}, "fvkuipt": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkuipt/", "text": "Don’t give up! I just turned 24 a couple of days ago and graduated and got my AA degree along with transferring to a 4 year as a Junior! I was at a 1.5 GPA back in 2016 and was put on academic probation. In Fall 2017 I decided to come back to school, and now I’m at a 3.2 GPA :) if I can do it, you can too! Don’t give up 💪", "author": "DimplesofanAsian", "created": 1592777406, "upvotes": 1}, "fvku7n8": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvku7n8/", "text": "Whatever said and done, do not give up! Always always think of your younger self and the dreams you had for yourself when you were younger! That is not to say ofcourse that you must do something when you  cleary dont want to- but if you still have those same dreams for yourself, all you need to think about is yourself. It doesnt matter if people are graduating in 3 years or 15. It’s your journey and you’re the only one who has a say in it. And secondly, someone earlier mentioned that by taking pills like Adderall is not boosting yourself but leveling the playing ground and I totally agree. Seeking help for your mental health is not weakness or a boost but is instead a courageous and strong step and believe me, your brain will thank you! So enjoy your journey and take your time because whenever you are ready- all of us and the whole world will be waiting to welcome you with open arms! :)) Take care!", "author": "sunshinex_19", "created": 1592777229, "upvotes": 1}, "fvkn7lh": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkn7lh/", "text": "You need professional help, us Redditors aren't going to have any long term solutions for your insomnia and ADHD. I have ADHD, I've been prescribed Adderall for years, and I've only taken it a handful of time (maybe 6-7 times throughout all those years) I haven't taken it in the last 6 years or so. I took 19 credits and worked 20-30 hour weeks last semester and still got a 3.9 GPA. I'm 24 and this was my first semester back after taking a 3-year break. Yes, it sucks and I hate my life during school but I want you to know it's possible, even for someone with ADHD. Now, I'm sure my life differs from yours quite a bit, I focus on my health before I focus on anything else throughout my day to day, which includes my meal plan for the day, supplements, hygiene and set time to be in the gym in the evenings which work around my work schedule as well as a set time to run in the mornings. I believe that my overall physical health determines my mental health and keeps me in line throughout the semester. Again, this works for me, may not work for you. What I recommend is that you get some professional help asap.", "author": "enclavedzn", "created": 1592773343, "upvotes": 1}, "fvkk57u": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkk57u/", "text": "I can honestly say I understand this. I’m almost 24 and won’t be done with my AA until this upcoming spring. I also have ADD which makes focusing extremely hard. Best advice, take your time. College doesn’t test your intelligence, it tests your patience, commitment, and overall longevity. Navigation is crucial, make sure your taking the classes necessary to graduate. I’m right there with you man, it is weird. I switched programs after going to college for a full year. Commitment, longevity, and proper planning.", "author": "BrianWaters247", "created": 1592771637, "upvotes": 1}, "fvkk0ap": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkk0ap/", "text": "You're 26, and the longer you put it off the older you'll be when/if you finish. Graduating is not a race, and people go back to school much older than you. I'm 26 and a first semester junior in EE this Fall, so I know the struggle you go through. I used to not be able to deal with a packed schedule, but you have to push yourself. Take 2 classes in the Fall, 3 in the Spring, 4 next Fall, etc. and try to adapt. I did calc 1 and programming, then calc 2, physics, and programming 2, then calc 3, diff eq, physics 2, and econ. This Fall I'm trying 5. Just test yourself, keep your head up,  and you'll be done before you know it.", "author": "zosomagik", "created": 1592771561, "upvotes": 1}, "fvkj452": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkj452/", "text": "It’s hard alright, fuck it man.", "author": "My_Opinion_Man_", "created": 1592771065, "upvotes": 1}, "fvkgspl": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkgspl/", "text": "I know it can be difficult but do not compare your successes to others. I’m nearly 30 years old and will be starting my sophomore year this fall. Could I have made better choices to have been done with school by now? Absolutely, but then I would have missed out on some of the amazing things and people I met throughout my 20’s.", "author": "ConfundledBundle", "created": 1592769777, "upvotes": 1}, "fvkgo6k": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkgo6k/", "text": "I'm 28 years old and on my Junior year of college technically. Don't let yourself get down because of your age, you've got this.  Just think about when you graduate how proud you'll make yourself. Those people that laugh at you and point fingers struggle too and the point in laugh because they can't deal with their own stress. I'm cheering for you as well as the rest of us. From one lat 20's student to another, I'll meet you on the finish line.", "author": "maniacassassin", "created": 1592769709, "upvotes": 1}, "fvkgjbu": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkgjbu/", "text": "Don’t be bummed out about your age. I’m 26 and starting as a freshman and I’m actually pretty hyped! You can enrich your life any time you want and for any reason.", "author": "wonklestomp", "created": 1592769635, "upvotes": 1}, "fvkdy82": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvkdy82/", "text": "There's nothing wrong with taking drugs as long as they don't cause you to directly harm other people. You should feel no shame in wanting to pop an Addy so that studying for many hours at a time without stopping is not so bad.\n\nEdit: also I get double time on exams for having adhd. You should do everything you can to do that as well.", "author": "trent295", "created": 1592768233, "upvotes": 1}, "fvk9z4g": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk9z4g/", "text": "[deleted]", "author": null, "created": 1592766090, "upvotes": -2}, "fvk9210": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk9210/", "text": "They don't just give you Adderall. I know some people who have it and are given other things.", "author": "Odin16596", "created": 1592765598, "upvotes": 1}, "fvk790w": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk790w/", "text": "Here's some advice: \n\n* **Never go to class without studying ahead on that day's lesson.** You will understand a lot more when your professor talks about it and it will keep your interest when you're able to follow along. Otherwise, you're just wasting time going to class getting lost and not understand a thing. \n* **Review your notes and re-study after class.** This is to reinforce the information you gain so you won't forget it as easily. This way, you won't have to study nearly as much later on.\n* **Studying some everyday > cramming last minute.** The subject area you're pursuing is not something you can cram last minute and still do well. It requires constant and consistent practice over time to understand. Resting period in between is very important because it allows the information you absorb to settle down and become knowledge.\n* **Warm up to your activities.** There will be times where just don't feel like studying or practicing. But start with some easy stuff that you know you can solve just to give yourself a small confidence boost just to get things going. Then work your way up to the main stuff.\n* **Practice coding on your own.** This isn't something that you can read about and wing it when the time comes to get tested on it. Practice makes perfect. Practice also generates confidence.\n* **Practice math problems on your own.** Same thing as coding. Practice, practice, practice. \n* **Don't be ashamed about meds when you actually need them.** It's not an advantage when you're taking them to cancel out the disadvantage. Make sure to consult a medical profession first. Taking meds designated for somebody else is not a wise idea.", "author": "TenguShark", "created": 1592764637, "upvotes": 5}, "fvk78s5": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk78s5/", "text": "Please get help for your issues with ADHD/insomnia! There’s no shame in getting professional help or having to use medication. Also, I just graduated with my bachelors at 29. It did feel like a bummer throughout my 20s that I hadn’t finished my degree yet, but I got it and it isn’t worth any less because I was older!", "author": "sproutdogmom", "created": 1592764633, "upvotes": 1}, "fvk4l5i": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk4l5i/", "text": "I just went back to school at 28 and I have two years left. I’ve also only been able to take three classes at a time because of work. Don’t rush yourself! Get good grade first and foremost.", "author": null, "created": 1592763206, "upvotes": 1}, "fvk4cmb": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk4cmb/", "text": "First of all, you need to recognize that, regardless of your ADHD, math classes are going to be harder for you because of your age.  I am a college administrator who has done extensive analysis on student success, and I can tell you that students who take calculus 1 right after taking some kind of pre-calculus course in high school understand the material 2X - 3X better than those who didn’t, and of those students who take calculus 2 immediately after calculus 1 do 3X - 5X better.  \n\nMath is not like other subjects.  Think of it almost as a “workout” for your brain.  If you go years without working out, and then you pop on some 200lbs weights onto the bench press, you’re going to struggle, and the reps that you do put in aren’t going to be as effective as they would have been had you started with something more reasonable.  Also, just like the guy who spent years away from the gym, you might feel like giving up, but now is the worst time to do so.  The other guys at the gym aren’t “stronger” than him, and they aren’t “genetically superior” to him, they’ve simply been at it longer and more consistently.\n\nIt gets easier, trust me.  You have to put in effort every day though, and you can’t give up or take a break.  THAT’s the hard part.  Once you’ve gotten used to it, trust me, you’ll wonder how you ever managed to struggle.\n\nPS:  Have you ever looked into programming boot camps?  As someone with ADHD myself, that seems like the direction I’d go if I were you.  It’s super intensive, fast-paced, and no “BS”.  At the very least, I think it would be a great way to catch up quickly, and get yourself into a position where you could hop back into a traditional college program much better prepared.", "author": "nickhinojosa", "created": 1592763079, "upvotes": 1}, "fvk4aef": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk4aef/", "text": "Take your adderall. It doesn't feel good but teaches you how normies think. ADHD is very helpful in a work place environment as youre an excellent multi Tasker.", "author": "JohmasWitness", "created": 1592763046, "upvotes": 1}, "fvk3u6k": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk3u6k/", "text": "College Professor (and current Masters Student) and ADHDer.   \n\nI take Adderall.  No, it doesn't cure my ADHD.  It's still...there, loud and proud.  Tons of hours with a therapist, family therapist ect, with the help of Adderall.. at the age of 41, I've finally found my groove.  \n\nDaytime sleeplyness/drowsiness is common among us.  I'm the one person in my family hopping out of bed at 4 am (think Stan Smith, American Dad style) of a morning....and I'm needing a nap by 3, and crashed for the night around 8.\n\nAsk for help.  Ask.  Demand it.  Ask about medication.  Be willing to try different kinds/doses until you find the right combo.  Some ADHD folks swear by Ritalin, and for some (like me) Ritalin turns me into a hot mess.  Others swear by Adderall.  Figure out what kind of accommodations you need.\n\nThe only people who should know what drugs you are taking for your ADHD is you, your dr and any mental health professional you choose to work with. In other words, unless there is a reason someone needs to know what meds you are taking and why-there is no reason to tell them and let them think whatever the fuckity fuck they want to think.\n\nYou might want to have a frank talk with each professor at the start of each term and say I have ADHD, so I may need you to explain something to me again during office hours or a wee bit slower.  do you know of any study groups or tutors that can help sort of conversation.\n\nMake the tutoring dept your best friend.\n\nDon't take a major (like nursing or software whatever) just because \\*you should\\*  find the major that grabs your attention, and sustains your attention naturally, and yet challenges you.  If it's music, history or even art history.  Take that.  Calculus class?  Haha.  very funny.  I can't do that kind of math.  I can't.  My brain....no.  And thats okay (by the way, speaking of math, get tested for  Dyscalculia - a math based learning disorder that a ton of ADHD people have.  Not everyone is cut out for that kind of math, but then again, where one person struggles with history of art, they have a great talent for calculus.", "author": "soup_2_nuts", "created": 1592762804, "upvotes": 3}, "fvk3gir": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk3gir/", "text": "In addition to the previous comments, try to find out the specific of what bothers you. ‘College is too hard’ is very broad. Try to find out what is hard. Is it a math class?  Is it having different classes?  Is it taking responsibility for your own learning?  Only you know the answer. Once you have it, you can work it. \n\nI have been teaching college for 25+ years. I see the struggles. I had them myself. I have a PhD in engineering. My second year in college I flunked everything. Everything. Take advantage of the resources you have, mostly a learning center and ADA legislation. \n\nAlso, talk to us. Most of us are human and will work with you to help you succeed. Yiu will find a few who don’t give a shit about you, but don’t let those to stop talking to us. I didn’t become a college professor for the glory or the money.  What makes me happy is to see this students that struggled walking across stage to get their diplomas. That’s why I chose this path. \n\nYou can do it. Your journey may and will be different from your friends, but it is your own journey. Don’t compare yourself with anybody. Only yourself.", "author": "9alby9", "created": 1592762597, "upvotes": 2}, "fvk31kz": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk31kz/", "text": "I'm 32 and got diagnosed this year with ADHD and got prescribed medication. Let me tell you it has been life changer for me and wish I got treated earlier for it. Don't be stubborn like me and try to do it on your own because it will bite you in the end. Go see someone for your ADHD and insomnia. Also, I'm transferring out of CC finally after this year so don't worry about getting it done on time... everyone is at their own pace and has their own story.", "author": "GirthyBread", "created": 1592762372, "upvotes": 1}, "fvk2l4r": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk2l4r/", "text": "As another college student, I don't think you are somehow boosting your way through college. So don't worry about judgement from other people. \n\nThere's a big difference between academic dopers and people with ADHD.", "author": "mokoyo", "created": 1592762124, "upvotes": 1}, "fvk1l5b": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk1l5b/", "text": "Don't give up! The worst thing in the world is to quit and I know you are not one of them. I'm 27 and I will be 28 once I graduate with my BS. It will have taken me 11 years to finish my degree (it took me 4 years to finish my community college degree). Honestly, it doesn't matter if it takes you 4 or 11 years to graduate. I know people that graduated in 4 years and didn't take advantage of what the school has to offer. I have 4 years research experience as an undergraduate, most than any other undergraduate posseses after graduation. I work full time. I did the worst mistakes by taking full course load on being full time. It just doesn't cut my mental health. So take it step by step and make sure you take it easy but hit those classes hard! You can always graduate with a 4.0 at the end of college.\n\nRemember, life is not a race nor a competition. Why are you pushing yourself to fail? Push yourself to succeed instead.", "author": "redman1137", "created": 1592761581, "upvotes": 1}, "fvk13xg": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk13xg/", "text": "Hey! I too have ADHD and yeah, college can be freaking hard. I’ve learned 2 things that I hope can help you.\n1) MAKE TO DO LISTS!!! so helpful. Have due date. Have 3 calendars in your room. Seriously. Constantly remind yourself that school is something that needs to be taken seriously and finished. \n2) know that you can still do everything you want, even with school. When I get distracted during hw, i eventually have a click that’s like “fuck I’m wasting so much time by dicking off that I could be putting towards something I enjoy.” That mentality has helped me greatly. Not doing homework is the reward for doing the homework and staying focused, if that makes sense. Hope that helps!", "author": "Raymx3", "created": 1592761322, "upvotes": 1}, "fvk0yqj": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk0yqj/", "text": "I just graduated with a BS last Spring at 29.  I was diagnosed ADHD when I was younger, but have been untreated add an adult.  It wasn't easy, and I had my speedbumps, but you can do it", "author": "Khulric", "created": 1592761242, "upvotes": 1}, "fvk0ies": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk0ies/", "text": "I'm sorry you feel this way and I kind of understand. \n\nI graduated high school my junior year at 16 thinking I was some hot shit and super far ahead of my peers. Now I'm 21 and finishing my bachelor's. I essentially screwed away a year of earning potential because I couldn't stick with it. \n\nMy point is that everyone has setbacks to their plans and you cant let them keep you down. I had to change majors because the prerequisite requirements were gonna keep me in school for an extra 2 years so now I'm an extra year in and a different major. \n\nTry talking with a school counselor or a friend you trust because I think you could really benefit from stress relief/venting. And just remember that you got this bro!", "author": "PrinceIppolit", "created": 1592760994, "upvotes": 1}, "fvk01j6": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvk01j6/", "text": "I have rarely ever commented, just enjoy the subreddits most of the time, but this post feels too real to be true, i too have adhd and cannot focus on college at all, i have never been to the doctors cuz im sure adderals are going to be bad for the long run. Made me feel just a little bit better that there are people other than me going through this.", "author": "jewslover88", "created": 1592760740, "upvotes": 2}, "fvjzmxh": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjzmxh/", "text": "First, try to see if you can get some support! It will be helpful. I was able to get some based on my (mis)diagnosis. I believe all schools have a disabled student center. It can be helpful!  \nFor me, high school was hell, and college was even harder. I thought I'd never get through it. My GPA at its lowest was 1.6, and I graduated with a 3.5. But I do believe we all have our own time. You can't compare yourself to someone who was able to go to college and be successful straight out of high school. We all have our timeline. All that said, I will be 30 in a few months, and I just graduated last week. It took me a long time to recognize that the age thing didn't matter. Also, I think I was better prepared for college just being older. I have another friend who is 36, is almost done with her degree and plans to head into a master's program next. She gives herself so much grief for being older, but I think there is a lot of value in being an older student. \n\nYou might also try to take classes part-time. Check-in with disability student services, check-in with financial aid. There was one quarter I only took two classes. Several quarters I could only manage three. Four was hard as heck and I felt like I just completed assignments, but didn't really learn much. \n\nMost importantly, just take it one step at a time. You can do this. <3", "author": "writerose", "created": 1592760522, "upvotes": 1}, "fvjypdd": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjypdd/", "text": "I totally understand how you're feeling. I'm 25 and I'm in the same position. Take your time, it's your education, if that means taking 2 classes a semester then do it. Don't let anyone make you feel guilty for taking your time with school.", "author": "mrnacho69", "created": 1592760020, "upvotes": 2}, "fvjx45r": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjx45r/", "text": "Hey! I'm 26 and still in college as a junior. I dropped out when I was 19 and regret it everyday. I went back at 24 and been taking classes since. I don't struggle with ADHD but I do only take a couple of classes a semester. Full semesters scare me so I just take my time. \n\nDon't give up! Your half way done. Finish and you'll look back and be proud of yourself for graduating. It will be an accomplishment that no one can ever take away from you!\n\nIf you want to talk feel free to DM me. We can get through this together!", "author": "Jfelling12", "created": 1592759166, "upvotes": 2}, "fvjwp8p": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjwp8p/", "text": "Hi! I don’t have ADHD but I do have a really active imagination which is often the death of me because I’d rather live in my fictional world than in reality, which make focusing difficult at times. What I’ve found to help is to schedule out my work, and write it down in a planner or just on a piece of paper. Make sure the work is manageable and only a couple things per day. Personally, if I don’t finish everything that I scheduled to finish, I feel bad so I make sure that I finish it all, and experience the satisfaction of crossing it off when I’m done. The rule is that I can manage my time however I want during that day, but it has to be done by the time I go to bed. I hope this helps!!!", "author": "GP915", "created": 1592758944, "upvotes": 2}, "fvjw99h": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjw99h/", "text": "Your story sounds incredibly similar to mine. This shit is hard, and it just gets harder (for me at least)... But just keep reminding yourself about why you want to do it. \n\nI attempted college 3 times, eventually gave up and joined the army, got medically discharged, waited a few years to try college again and got back into it. It's sticking this time. What changed is that I found a career that I can feel passionate about. So at 30 I started all over... None of my previous credits transferred to what my major was. Chemistry made me want to quit... I failed it, but I knew I couldn't get to do what I wanted if I didn't just get through it... 2nd attempt I got an A. I made the dean's list 2 semesters. \n\nDuring this time I learned about ADD/ADHD (when I was a kid I was diagnosed, but my parents thought it was BS and hated the way the meds made me). So I got professional help, went to counseling every week for a year, got a proper prescription, and it turned my life around. Don't worry about what people think about it... If they want to think less of you for something you can't help they're not worth your time. \n\nTake challenges one step at a time. Even a little progress is still progress. Don't quit!", "author": "Rootebega", "created": 1592758705, "upvotes": 2}, "fvjvu71": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjvu71/", "text": "Try to get accommodations for ADHD I know medical help is expensive so if you can get diagnosis and a letter for your school it should help tremendously. You usually get extra time for stuff at least. Meds suck but I take Dexedrine and even though I hate the side effects it’s sometimes exactly what I need to power through and study or do work.", "author": "mokenz", "created": 1592758476, "upvotes": 1}, "fvjvdea": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjvdea/", "text": "My story is similar to yours, but I'm 27 and at community college. It's hard for me too, I feel like I'm doing something wrong. Everyone else is charging ahead, and I feel like a turtle. But I've also learned that it's okay to take your time. Your only on your own schedule. Stop comparing yourself to everyone else and do what's best for you.\n\nI just tried a full-time semester along with full time work, and it's not for me. Others can do it, and that's great for them, but not for me. I'll take a little longer to get my degree, but it's not worth the stress for me. However, I did learn a lot about myself and I'm very glad I attempted it.\n\nBottom line: don't be afraid to take your time. Do what's right for you and your brain. And don't set yourself up to fail just to fit in.", "author": "erivanla", "created": 1592758218, "upvotes": 2}, "fvjv7ql": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjv7ql/", "text": "Hey man, I know the exact feeling of not being able to sleep because you're so stressed about classes. I did that last semester up until we got sent home from covid. The best thing I can suggest you since you do have ADHD like myself is to get so accommodations from your school's office of student disabilities.That's going to be your best bet and I understand that you don't want to feel like you're trying to just get a boost but no one will really think of it that way I promise.", "author": "Allofthesame", "created": 1592758133, "upvotes": 2}, "fvjul0y": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjul0y/", "text": "I went back for my bachelor's at 31 I'll be 35 next month and graduating in December. Don't put a timeline on anything, work at a pace that's good for you. Asking for help is more than ok discuss some options with your doctor and its noones business about medications your taking. (I wouldnt advertise just to keep away those who will try to get you to sell them your meds.) Be healthy and do what you need to do for you, noone else. Stay strong friend!", "author": "Toast_face_killa", "created": 1592757791, "upvotes": 2}, "fvjuew5": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjuew5/", "text": "I finished my B.S at 28. Don’t sweat about what age you are right now. I graduated alongside 21 year olds. Age is just a number.", "author": "IGuessThisIsFine91", "created": 1592757699, "upvotes": 2}, "fvju9fv": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvju9fv/", "text": "PLEASE seek help for your ADHD. My brother has it and was almost kicked out of school after trying to go unmedicated. This generation is becoming much more welcoming of medication--and I promise that unless you tell someone, they won't know.\n\nGood on you for continuing at your age. So much respect for my older peers! (Makes you sound super old, but you get my drift.)", "author": "Welpmart", "created": 1592757616, "upvotes": 2}, "fvjty3z": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjty3z/", "text": "My school has something called “disabled student services” which is a program/building meant to help accommodate students with all kinds of struggles, I had a professor recommend that I go there once because she thought I have test anxiety because I kept failing my exams (I do have anxiety, but I’m just really bad at math lol) but I recommend you try to find out if your school has something like that, you might be surprised how much they can help you", "author": "daughterofkenobi", "created": 1592757452, "upvotes": 1}, "fvjtsmi": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjtsmi/", "text": "Sometimes you're just not ready for something, and it doesn't mean it's wrong - it means it's wrong for YOU. I was a hot mess my first go around in college because I was undiagnosed and unmedicated.  I didn't get on decent medication until 2016, when I finally went back and got my AA. Now I'm working on the last chunk of my BS and I'm 41. Everyone does things differently, but medication has made a world of difference in my focus and motivation. Good luck to you!", "author": "the8itch", "created": 1592757374, "upvotes": 2}, "fvjt5gg": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjt5gg/", "text": "I’m also 26 and going into my junior year. I was insecure about graduating at 28, but now I’m okay with that. Before I barely went to school, partied, and lived the life I felt I missed out on. Now, I know what I’m capable of and because of my early life experiences, I’m more comfortable with my major than many graduates before me. \n\nIf you don’t feel ready for school, reduce your hours, and take some general courses until you feel that you can commit your studying. Trust me, once you see how valuable school is, you’ll push through, no matter what.", "author": null, "created": 1592757013, "upvotes": 1}, "fvjry8y": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjry8y/", "text": "Medication for ADHD and disability intervention saved my life and enabled me to start doing better (like graduating with a really high gpa better).  I test alone in a quiet room with double time and just knowing I have that to look forward to has really helped me crack down. I’m getting my AA at 32. Would have been 22 if I had support and help like this back then. Don’t be ashamed, if you can’t make yourself pay attention, store bought is fine!", "author": "Drealjas", "created": 1592756347, "upvotes": 2}, "fvjrlcd": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjrlcd/", "text": "I’m 52m, my career added up to nothing before starting on meds in my mid-forties (I finally took the plunge because my second marriage was on the rocks). Here’s my take on the meds:\n\nIf a diabetic told you they were ashamed to take insulin because they “should” be able to manage their symptoms without it, and taking the insulin demonstrated a shameful lapse in character, what would your reaction be? Or if someone with a thyroid condition did the same?\n\nBefore I started on the meds, I felt it would be admitting failure — when I was already a failure — and I was worried that I “wouldn’t be me any more” if I took them. \n\nI guess it’s been about seven years since then. In that time, I have started a second career, and despite having no college degree (I couldn’t focus enough to fill out applications), I am now a pretty sought-after management consultant. I’ve created a ton of content for my firm and am working in a book and a side hustle that was profitable after a few weeks. I have an idea for a startup and am talking to engineers to begin validating my business plan.\n\nI’m still married. Partly that’s because I am *more* myself than pre-meds. I always had integrity at a deeper level, but would forget to go on appointments, not follow up with brilliant people who wanted to work with me, forget birthdays, anniversaries, etc. When we live from a place of integrity, we are more whole, and the potential we sense inside us can begin to connect to the world, provide value for others, and garner rewards for ourselves.\n\nWhat I’m trying to say is: I’ve walked the rocky road you’re on, and it sucked for decades on end, it’s a dark and dead-end street. I know I’m a stranger on the internet, but I get what you’re going through, I can feel the shame and confusion, the sense that you are somehow really smart and deeply broken at one and the same time. Step onto a different path, admit you have something like diabetes, a chronic neurotransmitter issue. Step up, be strong enough to admit that you haven’t “got this”, and become who you were always meant to be.", "author": "BoonFrancis", "created": 1592756147, "upvotes": 1}, "fvjrkpl": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjrkpl/", "text": "Don’t give up!!!!!! I’m 27 and a senior, bring in the military I’ve had to jump from different community colleges and FINALLY will graduate from an amazing school. I had to drop out of classes for being too hard, rush after work, take classes on deployment and have long nights. It fucking sucks but I cannot wait to cross that stage. Mental health things? GO GET HELP. You are worth feeling your best self and fuck stigma. I have dealt with it, my best friends have dealt with it and even with the stigma in the military I sought help with the support of great leadership and friends. You got this shit. Don’t stop", "author": "Stewart43", "created": 1592756137, "upvotes": 2}, "fvjqjg3": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjqjg3/", "text": "I went back for my masters at 27. I didn't finish for medical reasons (and the school was not helpful with that situation). I'm 32 this month and I start a doc program next month. I won't actually start my career until I'm 36. Be excited to be that future you. I'm so stoked about getting to do what I love after a long period of discovering all the things I like and am good at before realizing I can make a single career out of all those interests.", "author": "squeakim", "created": 1592755557, "upvotes": 1}, "fvjplxx": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjplxx/", "text": "Comparison is the thief of joy. I’m 22 and people my age are already on their masters. I’m still a sophomore with more classes to go. Take your time but more importantly your health should come first. Seek accommodations for your ADHD. Traditional school isn’t for everyone and that’s ok. If it still doesn’t work out then you can find other paths.", "author": "sadxtortion", "created": 1592755043, "upvotes": 1}, "fvjpcc6": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjpcc6/", "text": "Bud, you're not alone. We're all in this together! \nAnd please: don't feel like you're \"cheating\" just because you're getting help. Think about this: one of my friends fell and hurt her leg last fall, she insisted in not taking painkillers for a bit, but *the pain was so excruciating she couldn't concentrate*, she couldn't sleep at night and missed one of her deadlines. When she resolved to take the painkillers she was way better and *could study* way better. Same goes for you. If your leg hurt you'd bandage it and take medicines to get better, don't behave differently when it comes to your brain. It's fair help, not cheating.\n\nCollege, for how much we can love what we do, can be a bitch. I know from first hand experience that ye olde \"stop comparing yourself with others\" is actually a difficult advice to follow, but it's good advice. I'm 23 and an entire year behind (should be getting my MA degree this year, instead I'm still in the first year of the MA course) but, hey, I had stuff to solve along the way. Each of us have their pace and their stuff to deal with. Most importantly, if you're trying your best (and it looks like you do) you have nothing to blame yourself for.\n\nSticking together and getting help is the best we can do for ourselves and for the future we're building with these studies. \nWish you the best 💫", "author": "aplaceofshadows", "created": 1592754894, "upvotes": 2}, "fvjp82s": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjp82s/", "text": "I was diagnosed my senior year last semester. It's frustrating and the hardest thing you'll ever do, and you'll have no idea what to do with all your free time once you're done. The biggest thing for me was time management - I worked 2 jobs equating to about 50 hours a week, I had a whiteboard with all my weekly things I needed to get done, due dates, etc... Time management was everything for me to succeed.", "author": "GennaroIsGod", "created": 1592754827, "upvotes": 1}, "fvjp6b9": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjp6b9/", "text": "Don’t rush. Just turned 23 and barely finishing up community college. The rate I’m going probably not gonna Get my bachelors until I’m like 28", "author": "Mustangexpert1", "created": 1592754797, "upvotes": 4}, "fvjojrz": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjojrz/", "text": "Do not put unrealistic expectations upon yourself. If you are comfortable doing two classes per term, then that is your pace.", "author": null, "created": 1592754440, "upvotes": 2}, "fvjoj8f": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjoj8f/", "text": "I know that everyone else has said this but I still want to throw my hat in the ring. Firstly, seek professional help for your ADHD. There is no shame in doing so and not a single decent person will see that as a sign of weakness. Also, keep up the good fight at your own pace. Don’t rush this man it will only make you miserable. You’ve got this, bro!", "author": null, "created": 1592754431, "upvotes": 4}, "fvjo3jl": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjo3jl/", "text": "You wouldn’t have made this post if it wasn’t important to you. Don’t worry about your pace, just don’t give up. You’re right, it is hard af, and idk how some students make it look so easy. You have unique struggles on top of it, so try not to be hard on yourself. When you do graduate, you will feel so amazing about the accomplishment and what you’ll be able to do in the future because of your perseverance. You got this :) x", "author": "lolidkdontaskme", "created": 1592754179, "upvotes": 5}, "fvjo1za": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjo1za/", "text": "Im 28 and ill have my AA this time next year if i remain on track, but obviously im a very late bloomer for school. Just getting back in is whats important, not how old you are. Its tough cuz im also usually the oldest person in many of my classes and i feel some type of way hanging out with 18-20 year olds after class lol. \n\nAs far as software engineering goes, you dont necessarily need a degree for that field. I was a junior salesforce admin for a few years and i got in and hired via internship, no degree. While many of the people from India I worked with were extremely accredited and carried one or more degrees, I also worked with many Americans who had never gone to college for software engineering and were mostly self-taught. \n\nIf you could teach yourself, build a portfolio of all of your work, submit applications/resumes and attatch a portfolio of your work to the resume. Engineers are in extremely high demand right now (and probably always) so you should just spam all the applications you can and something is bound to stick. \n\nGood luck!!", "author": "thothpethific92", "created": 1592754154, "upvotes": 7}, "fvjnhxr": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjnhxr/", "text": "Stop comparing yourself.\nIf you can’t help it and need someone to compare yourself to you can compare yourself with me.\n\nI’m about to turn 31.\nI’m a computer engineering student.\nI’m unable to be a full time student because I can’t handle the workload, I limit myself to three classes a semester.\nI take summer classes. \nI am projected to finish in 4 semesters.\nThere are 3 more classmates I met that are older than me Doing CpE or Software Eng.\nWe are all working on our Bachelors.\nDon’t drop out of college, it’s an initiation, everyone has to go through some kind of hardship for that expensive piece of paper. Stick with it, slow down if you aren’t getting minimum B for your classes. Yeah, you’re racking up debt a bit faster prolonging your graduation but with the degree you can pay it off with your job in the future. You do not want to work at a dead end job wondering if this of the life meant for you.", "author": "th0m4svu", "created": 1592753831, "upvotes": 3}, "fvjnco1": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjnco1/", "text": "There are people who begin college at age 80. And older. Honor wherever you are on life's journey. If you want to go to college, then go and keep working at it until you finish - however long it takes. Too many stimulants isn't helpful either but a cup of coffee in the morning has been known to help people focus. It's amazing what Adderal can do for you and it's worth trying for a couple of weeks under the care of a doctor. More than 11% of teens and young adults have ADHD in the US so you're part of a big group that is known to benefit from Adderal. \n\nImagine what you could do if you knocked out the ADHD obstacle?! Knock out each obstacle - one at a time - and you will be on your way!", "author": "STEERus", "created": 1592753747, "upvotes": 2}, "fvjn0ek": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjn0ek/", "text": "Don’t give up. It’s hard, but worth it. Hang in there.", "author": "Randolph-", "created": 1592753548, "upvotes": 2}, "fvjmdga": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjmdga/", "text": "You are really hurting yourself not getting help for your adhd,I have adhd also you should not feel ashamed", "author": "eliandpizza", "created": 1592753174, "upvotes": 2}, "fvjmccv": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjmccv/", "text": "Hey, don’t let age get you down! There are many non-traditional students in uni. I’m 25 and will be a senior this year, and I’ll be 26 before I even get my diploma and apply to grad school. Everyone’s path is different and not everyone is able to complete a perfect four year plan. \n\nI returned to campus at 24 after taking two years off to work and save money, and the most valuable lesson I learned upon return is to always ask for help when you need it. Reach out to the professor and advocate for yourself if need be. I didn’t do this when I was a younger student, but it’s helped so much — especially as a non-traditional student. You can do this!", "author": null, "created": 1592753156, "upvotes": 2}, "fvjlv1h": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjlv1h/", "text": "I got an associates at 38. And I’m proud as hell. Other people’s timeline isn’t your timeline and that’s ok. Good luck to you.", "author": "AutomaticYak", "created": 1592752878, "upvotes": 11}, "fvjlr1a": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjlr1a/", "text": "I'm going to tell you exactly what I tell my husband - it doesn't matter how quickly other people are going through college. I know he takes the amount of classes he can handle and that he is doing his absolute best to reach his goals. That's what matters to me and what should matter to him. Everyone goes through college at their own pace. What's important to remember is you are working towards your goals and the people who care about you are so proud of you for doing that. Hell, I can't tell you how many times I wanted to quit because college was so hard for me. I had been in college since fall 2014 and graduated with my bachelor's this May. I attended four different colleges in that time, retaken quite a few classes, and struggled with anxiety. But I did it. And you will too. Be proud of how far you've come so far. Keep your goals in mind, you've got this :)", "author": "rinne64", "created": 1592752811, "upvotes": 3}, "fvjlqll": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjlqll/", "text": "Bro I’m 29 and I just signed up for community college again in the fall. I haven’t been to school since I was 24 and am now a single father with a 3 year old. School may feel overwhelming at times but just remember that your age means nothing in college. You can graduate at 21 or at 41 and it’s still a diploma. Hell, I’m making more money now than half my friends who actually completed college. But my job is over come March and I need to get back into something, and for me that means actually doing college right this time and getting that degree. As a single father I get tons in grant money to help me out, so that’s a bonus. Keep your head up kid and finish out your schooling.", "author": "toasterdees", "created": 1592752804, "upvotes": 13}, "fvjlqh8": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjlqh8/", "text": "I am 26 and I feel the same way but I have been in college for almost 7 years. Working full time job, I came to the US 8 years ago so I feel you. If you need any advice don’t hesitate to DM. Don’t give up!", "author": "Alert_Career", "created": 1592752802, "upvotes": 3}, "fvjl9jc": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjl9jc/", "text": "I really wanna point out that you’re going to college on hard mode. Being older than most of your peers, having less sleep, having more responsibility etc are all giant factors that play into the difficulty of college. I am extremely blessed to have parents that just expect me to study all day and even then I find difficulty in focusing and applying myself.\n\n\nI really do suggest looking into something that can help improve your focus and help you study more efficiently. \n\n20 min of active and difficult learning is better than 1 hour of passive easy learning.\n\nPomodoro technique is something nice to look into and also daily 3 minute mediation could help improve your focus.", "author": null, "created": 1592752526, "upvotes": 3}, "fvjk77s": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjk77s/", "text": "Just take it easy. Professors love older students who take it seriously and know how to pace themselves. Get accommodations and enjoy the ride!", "author": "conga78", "created": 1592751881, "upvotes": 3}, "fvjjkd7": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjjkd7/", "text": "I'm 25, have two kids and just graduated with a BA in 3 years from the start. You can do it, I promise! \n\nIf you feel overwhelmed don't be afaid to ask for help and press on.", "author": "tracileann", "created": 1592751495, "upvotes": 4}, "fvjiapy": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjiapy/", "text": "Hi there, I'm ADHD and managed 19 hours for a few semesters when I was in CS for awhile, then later in my math BS. The answer for me was a lotta drugs.\n\nThough I did also have ADA accommodations as people are recommending below. It really helped. I never struggled in high school so facing the reality that there really is something wrong with me and that I'm always going to be slower than others would've caused me to give up without that help.", "author": "metaltrite", "created": 1592750701, "upvotes": 4}, "fvjiaim": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjiaim/", "text": "Please know there is nothing shameful about getting help and medication. You wouldn’t feel bad about getting a bandage if you had a cut, right? So don’t feel bad about treating ADHD and insomnia. \n\nAnd there’s nothing wrong with taking two classes at a time. Do what you need to do in order to be successful and fuck everyone who has a problem with it (spoiler alert- nobody really cares). You’ve gotta stop comparing yourself to where everyone else is and learn to be cool with where you are. Source: I’m going to be 32 when I finish my undergrad. My life is awesome and it doesn’t matter at all that I didn’t graduate with my friends ten years ago.", "author": "Sassys88", "created": 1592750698, "upvotes": 3}, "fvjhkc4": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjhkc4/", "text": "The whole “freshman, sophomore etc” thing is bullshit in college, don’t worry about I’ve had people in my classes way older than you.", "author": "RapidRoastingHam", "created": 1592750239, "upvotes": 9}, "fvjhhp2": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjhhp2/", "text": "First, if you haven't seen someone for help with your ADHD, definitely do that. I had friends in college with ADHD and getting help with it was a key factor in their success.\n\nSecond, do what's best for you. If you think that's continuing and making it through the rest of your classes \"on time\", then do that. If you need to take time off, do it. Even if you feel quitting is what's best, do it. My wife spent 6 years getting a degree she hates and doesn't know how she'll use. She always says she wishes she took a short photography program instead of going to uni, but her mom pressured her that she HAD to go to college. Don't make snap decisions, but take some time, assess your options (continuing, going to a trade school or other college, staying but taking longer), consult people you trust, and do what is best for you.\n\nA final note on \"how do people take full time engineering courses and not fail?\" I graduated with mechanical engineering, and I failed at least 3 of my classes and had to retake them. It happens, look at what went wrong, and what you need to change to do better and succeed next time.\n\nSorry this post ran so long, but I wanted to get this out there since all the other posts I saw were just \"I did it, why can't you?\" And \"never give up, no matter the cost\". I hope this helps and I wish you the best.", "author": "atrolen", "created": 1592750194, "upvotes": 10}, "fvjh8r8": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjh8r8/", "text": "From a fellow ADHD fellow who just graduated. You're actively hurting yourself by not getting professional help for your ADHD. It's not \"Boosting your way\"  it's leveling the unfair hand you were given genetically.", "author": "Dr_Mike_Hunt_MD", "created": 1592750038, "upvotes": 70}, "fvjgt2w": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjgt2w/", "text": "I'll be downvoted for this, but I'm willing to risk it. \n\nThere is a job that you will get when you are done with college.  Either that job will require the level of focus you are stressed about in college, or it won't. \n\nIf the job you are going to get doesn't require the level of focus you need for college, the job won't require college experience.\n\nSo, consider finding a job, and if successful, drop out of college. Likely this will make you happier in the long run.", "author": "which_spartacus", "created": 1592749760, "upvotes": 2}, "fvjg4kd": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjg4kd/", "text": "Some people take 6 classes per semester, those people are crazy. I only take 4 classes a semester and that is my upper limit.", "author": "ENgLiSh-illiTeRAtE", "created": 1592749320, "upvotes": 9}, "fvjezm0": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjezm0/", "text": "I also have ADHD and i can tell you if you can find a reason to \"look away\" then you will. The best thing to do is contact your school's admin and see what kind of support they can offer you. I started college in 2009 at 28 and through one tumultuous marriage and 3 schools I still didn't complete my degree. Now 8 years after my last school I plan on going back and this time I'll be taking advantage of the support that i can because I now know what will happen if I don't. For me personally I need to do hands on stuff so I've gotta find classes that are either abstract in thought or allow me to physically do things so it keeps me focused. That's why I've thought about going back for my psychology/criminal justice degree or getting into computers but I can marry computers to criminal justice as well... Either way though i know I'm going to take a more proactive role in my education if I don't want a repeat of last time....", "author": "Jasona1121", "created": 1592748576, "upvotes": 3}, "fvjeryt": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjeryt/", "text": "I would not compare yourself to others. I went to a class with a 19 year old that was a senior graduating that semester. I graduated at 21 and got into a masters program at 21. I feel like I have to do my best because I’m the youngest in the program and won’t be taken seriously by the others. \n\nThere is a plus and a minus to every situation. I think it is best to focus on what is the best for you. You feel overwhelmed and that is okay. There isn’t like a competition to the suffering Olympics and it’s okay to need help. Have you sought out accommodations with the office of disabilities/special needs for your condition? They should have resources and guidance for you. There is also counseling from the counseling centers or look for help in finding healthy ways to cope. Unfortunately I knew many classmates that would drink to ease their stress and I wonder how many turned into alcoholics. That isn’t healthy. I hope you get help and I’m wishing you the best.\n\nPersonal advice. I took 6 classes my last semester of my undergrad, commuted over a hour, worked 15-25 hours a week, and applied to grad school while making the presidents list with a 4.0 GPA. How I managed? I asked for help. When I had questions for exams I would email or ask specific questions regarding the material. I make my own person study guides for each subject. I thankfully have my own study and would listen to music. If I got frustrated I hit the gym and loved Zumba for fun. I also had to study for the GRE and MAT at this time. I went to the library to get *free* prep books and practice questions. At work when I had free time I would look over questions and my personal study guides. Read your notes after each class. You can even ask to record your lectures? I commuted and listened to videos explaining topics so I used that time wisely. I knew others that would listen to lectures on their commutes. It’s challenging, but being creative helped a lot.", "author": "QueenLazuli", "created": 1592748435, "upvotes": 7}, "fvje4hx": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvje4hx/", "text": "Just a suggestion so take this lightly: \n\nIf you have the opportunity to transfer, you might consider a school with terms rather than semesters (4 terms/year). At my school, we take 3 classes per term, so 18 credits per semester, but only 9 credits at a time. The classes are faster paced obviously but you only have to learn the material of 3 classes at once vs 5-6 at a semester-based university.", "author": "itssonotjacky", "created": 1592747985, "upvotes": 47}, "fvjd2q1": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjd2q1/", "text": "Get disability help for adhd. There should be a disability office you go to.", "author": "favnh2011", "created": 1592747222, "upvotes": 74}, "fvjcwa3": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjcwa3/", "text": "I took full time classes while working full time. A lot of people managed it. If it’s really a struggle I suggest getting medication for your adhd", "author": "crystalliite", "created": 1592747097, "upvotes": 3}, "fvjashw": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvjashw/", "text": "I think the only thing is to never ever ever ever give up. I graduated nursing school recently. I had one semester where I felt like this. I failed a test pretty much every week because I was taking like 18 hours of classes in 8 week increments. I didnt think it would ever end or that I would ever pass and still ended up with all Bs evencafter failing several tests. DONT QUIT", "author": "Gottobooboo", "created": 1592745575, "upvotes": 13}, "fvja6we": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvja6we/", "text": "Stop comparing yourself to others,Comparison is the thief of joy", "author": "eliandpizza", "created": 1592745120, "upvotes": 101}, "fvj8c3s": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvj8c3s/", "text": "Listen, college isn't that hard. I know that this is a controversial thing to say especially given your diagnosis but if you budget your time and focus, you can get through a lot.\n\nHere's what I recommend you do: create an hour by hour breakdown of each day. First, start with your needs. You need to sleep (and yes, you should schedule 8 hours of sleep each night) and eat. Carve these blocks out as you can't study when you are sleeping or focus very well when you're eating (I like to watch youtube when I eat so I would generally carve out 30 minute blocks for breakfast and dinner and then an hour for lunch).\n\nNext, put your classes in the schedule. Also put anything that you need to do (e.g. work if you have a job). You will also need to commute to school. Time walking/driving isn't time you can study, so also etch these out in your schedule.\n\nNow, determine when you are going to study. If you need breaks, figure out when to schedule your breaks in a way so that you can stay focused during your study hours. Remember, for every 1 hour in class you should schedule 2 hours out of class. As a sidenote, I know that they say for STEM the ratio is 1:3. I did not find this to be the case as some courses were closer to a 1:1 and others were a 1:3. It averages out to about 1:2 in my experience.\n\nAs some background, I dual degreed in Computer Engineering and Applied Mathematics, minored in Physics, wrote two research publications, and still managed to play college Rugby and train 10 hours of MMA per week once I stopped playing Rugby. It **all** comes down to time management. You can be the most brilliant person in the world and you will still do poorly if you do not put in the work.\n\nI know I am probably going to get downvoted for this post, but I sincerely wish you luck and highly recommend that you create a timetable. College isn't that hard and I find my time in the Army to be much more draining emotionally and physically. Good luck!", "author": "foohydude5", "created": 1592743670, "upvotes": 12}, "fvj7agb": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvj7agb/", "text": "Please don’t rush the process! You have to take College one step at a time. Especially when you have ADHD. I understand how looking around, you may be discouraged that other people are progressing faster but it does not matter. You have decided to take an important step of going back to school. If being full time doesn’t not work for you, than take a class or 2 until you are able to handle a full load.\n\nLike someone mentioned, attend your disability center and get the necessary paperwork done so that when it comes to tests and quizzes, you have extra time to finish it. It’s time we started normalizing people starting their undergrads after 23! You can do it and I have faith in you OP. Best of luck!", "author": "thesocialstem", "created": 1592742810, "upvotes": 179}, "fvj63zh": {"link": "/r/college/comments/hd5va6/im_26_and_college_is_too_hard_i_feel_like_giving/fvj63zh/", "text": "Are you getting any kind of support or accommodations for ADHD?", "author": "wishingstarrs", "created": 1592741788, "upvotes": 447}}}