{"sid": "hklpuu", "link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/", "title:": "Who/How to Social Distance on Campus?", "text": "Hey everyone, I'm currently struggling with what I should do about this coming semester. I want to hang out with my friends, I want to run a club, I'd like to study at the library, and I want to work out at the gym. \n\nALL of these things are gonna be affected by social distancing. What friends should I hang out with? Should I cut a friend off for a couple weeks if they do something risky (party, go to a high risk area, etc)? \n\nWhat are your plans this semester? How should we do this?\n\n(PS:  a nerd that wants to run DnD every week.😅)", "author": "HeadlockKing", "created": 1593792376, "retrieved": 1632947847, "over_18": false, "upvotes": 753, "upvote_ratio": 0.97, "comments": {"fx01qqf": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fx01qqf/", "text": "I'm still trying to figure out what I should do for fall. I definitely do not want to take a whole semester online from my house. The conditions at home and the general environment here will definitely hamper my productivity and make me generally disinterested in everything. My two main options right now are deferring my admission to spring sem, or going on campus and attending hybrid lectures. I don't know a lot of people who are planning to defer their admission since it's a huge learning gap, so the best option for me right now seems to be to go to campus, set up a comfortable study environment in my dorm and attend classes cautiously. Of course, there'll still be some anxiety about irresponsible people and getting sick, but it looks like I'll just have to take that risk and be careful. I'd love some inputs on this, since I haven't taken a firm decision yet.", "author": "szplugz", "created": 1593959679, "upvotes": 2}, "fww64ok": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fww64ok/", "text": "ZORB BALLS", "author": "LamBxE", "created": 1593860362, "upvotes": 1}, "fwviiy2": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwviiy2/", "text": "I agree with everything that everyone said, but I also need to express my appreciation for you even asking this question. It's a necessary one that needs to be addressed for sure.", "author": "terrancethequeef", "created": 1593837629, "upvotes": 1}, "fwvei3x": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwvei3x/", "text": "I really don’t know who colleges are trying to fool. Students are going to get sick if in person classes come back. Given the nature of a college campus it just doesn’t seem at all realistic that these “precautions” that universities are taking will end up doing anything; everything on a college campus is communal and to expect colleges to disinfect every area or surface after it’s used is unrealistic.", "author": null, "created": 1593834663, "upvotes": 4}, "fwvbzf4": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwvbzf4/", "text": "Do virtual DND", "author": "writerovert", "created": 1593832895, "upvotes": 2}, "fwuzini": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwuzini/", "text": "You shiuldnt do the things you listed, take a gap year if your are able. Online school was terrible in my opinion", "author": "OldManNeteroInDaClub", "created": 1593824556, "upvotes": 0}, "fwuywya": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwuywya/", "text": "What’s the death rage of the virus", "author": "ineedfootballmoney", "created": 1593824169, "upvotes": 0}, "fwuwzq3": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwuwzq3/", "text": "I personally gave up on planning any outside school activities for this upcoming semester. xD I have a nice desk/office space, own place, computer, printer, etc and can function 100% at home. I keep in contact with the people who I care about and we know each other’s symptoms. If we want to get together we hang out at mine since I have my own place.", "author": "OtherWorldStar", "created": 1593822943, "upvotes": 2}, "fwuoo2v": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwuoo2v/", "text": "If school is online again i swear.  Im tryna FIND A SPOUSE.  WHY MUST GOD DO EVERYTHING IN HIS POWER TO STOP ME", "author": "FrenchReaper", "created": 1593817811, "upvotes": 18}, "fwul1l9": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwul1l9/", "text": "I'm going to wear a mask outside my dorm and just try to keep a little distance between myself and others. Definitely no handshakes/high fives/hugs/etc. I live in a suite luckily so I have a single bedroom with a shared common area. I'm going to avoid going to big parties on campus but (only if my roommates say its okay) have a couple of friends over here and there and stay only in the common area, while also disinfecting EVERYTHING once they're gone. Also going to make sure there's always soap in the bathroom in our suite, since my previous roommates weren't so great with hand washing 🤢.\n\nMy main concern is how the dining hall is going to work. My school has only said what they're considering doing, and everything seems good but they've said nothing about the dining hall. We have a buffet style one where you serve yourself, so my guess is that they're going to limit how many people can go in and also serve your food for you.\n\nNext semester is definitely going to be a big change and it will be stressful but we'll get through it! Stay safe.", "author": "Rbxyy", "created": 1593815708, "upvotes": 1}, "fwukvc2": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwukvc2/", "text": "Heads up, unless your college has explicitly announced you can have access to the library and gyms etc. those may be off limits. I know my school will only allow us into the library if we need to check something out or have an appointment with a library consultant. We aren’t allowed to study there. You should also check the news on how clubs will be handled because similarly we were told to hold things remotely. \n\nI think it’s safe to say any student going to school on campus this year will be spending a ton of time by themselves and in their dorm rooms as we probably won’t be allowed to have friends come over either.", "author": "nikkichew27", "created": 1593815607, "upvotes": 2}, "fwujcjr": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwujcjr/", "text": "I’m not going on campus at all in 2020. It’s not worth my life and I gotta say I’m really glad I have that option.", "author": "eilig", "created": 1593814745, "upvotes": 1}, "fwuign7": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwuign7/", "text": "I think I might skip going to the gym for this semester and stick to hiking and personal resistance band based workouts. It won't really matter anyway, since I already lost the 5 pounds of muscle I worked hard to gain last year, after getting covid. Lack of appetite + relapse when exercising was a recipe for muscle loss. at this point, easy strength training workouts will allow me to maintain what I currently have left without the gym. \n\nI'm also hesitant to go back to the gym because of the possible risk of reinfection. There isn't a clear answer on the issue, and how long antibodies last, but I still don't want to risk it. The gym seems like one of the easiest places to get covid on campus, and at my school, they might make people book gym sessions. It just seems so tedious, and something like weight training that requires consistence just cannot be done effectively under those circumstances.", "author": "ShyTurtle696", "created": 1593814246, "upvotes": 4}, "fwud1pl": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwud1pl/", "text": "Look I know I’m gonna get shit on but I honestly think not hanging out with someone who went to a party may harm you socially. Yes it’s risky and dumb but that’s the way it is. Wear a mask, but (yes dumb I know) don’t be the only one wearing a mask, people will probably (not definitely, not defending them either) think you’re weird for don’t so, even tho it’s smart and you should. \n\nSo in summary, don’t be the one kid who stays in his dorm all day terrified of it (even tho yes it is very dangerous I’m not claiming it’s not), just stay home where it’s safer", "author": "charlesdickinsideme", "created": 1593811206, "upvotes": -8}, "fwucxxg": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwucxxg/", "text": "Personally, I will not be hanging out with my best friend because I know she is not taking any of this seriously at all. It sucks.", "author": "heartandliver", "created": 1593811147, "upvotes": 5}, "fwuaujk": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwuaujk/", "text": "For a club, use virtual meetings or conference calls when possible. If it's not possible, use a larger room to try and maintain 6 ft distance amongst people.", "author": "LordGingy", "created": 1593809971, "upvotes": 1}, "fwu8gky": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu8gky/", "text": "I’d say listen to local health officials and use your judgment. It’s too hard to tell cuz it depends on how bad your area is.\n\nI’m in central California and we literally had a nearby hospital shut down non-corona activities because staff got infected so it was too dangerous to interact with non infected patients. We’ve been on the state’s watchlist for weeks now cuz it’s getting worse. My school is mostly online for the fall with very limited exceptions. So personally, I’m not hanging out with anyone or going anywhere unnecessarily. But other places, it’s not so bad, so healthy people can go out shopping and hanging out and stuff. It just depends.", "author": "Slothfulness69", "created": 1593808637, "upvotes": 5}, "fwu848s": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu848s/", "text": "Don't bother with this semester, honestly. Why pay a premium for a subpar experience? Just wait till it's over", "author": "NovelOutlandishness6", "created": 1593808448, "upvotes": 1}, "fwu7f02": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu7f02/", "text": "I’m in Philadelphia, classes already got moved online for me 😓", "author": "checkyblecky", "created": 1593808058, "upvotes": 0}, "fwu6l93": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu6l93/", "text": "Honestly, I’m not terribly worried about it. I kinda just want to get covid and get it over with. My thinking is that i am going to respect the wishes of my friends. If they don’t want to hang out because they’re concerned, I won’t pressure them to do that. If i have friends who aren’t worried about it, ill hang with them and make sure to distance with people who want to keep distanced. And always social distance with strangers. And wear a mask indoors.", "author": "McChickenFingers", "created": 1593807599, "upvotes": 0}, "fwu6gt6": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu6gt6/", "text": "I agree with most of what I’m seeing in the comments section, especially about not being afraid to tell people who are doing risky behavior to maintain their distance. However, I feel like it’s worth mentioning if people know you will be doing this they may lie to you which is something to consider (maybe this is just the cynic in me haha). But, I have seen people I know post on their insta stories about the importance of wearing masks and then posts of them attending large gatherings where no one is wearing masks in photos. Just thought I’d put my two cents in!", "author": "dogfanatic24", "created": 1593807529, "upvotes": 15}, "fwu4r1q": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu4r1q/", "text": "Your school will likely have rules/policies to share with you before you return to campus. Some have published theirs already.  If you look at Yale's it's quite robust and detailed-- students are required to submit to testing and contact tracing, to quarantine if exposed, they cannot have any guests from off campus (including parents), they can't leave the state of Connecticut without prior approval, and they must conform to a pledge that requires masks everywhere, distancing, no groups, etc. or will be sent home. So many of these questions will be answer for you, though it will vary a lot between campuses.\n\nOther schools are taking even more pro-active approaches, including things like housing students in groups according to major/class schedule, running meals in shifts, limiting residence halls to single occupancy, etc. In the most extreme cases there are plans to have students isolate in \"teams\" of 15-20 that live, eat, and study together exclusively. \n\nThe biggest risk to having campus reopen is student behavior. From what we've seen already this summer it's going to be a serious challenge to keep students from congregating in bars and parties, even is masks are mandated. I think it's very likely that most/all colleges in the US will be closed again by state order by mid-October.", "author": "SnowblindAlbino", "created": 1593806575, "upvotes": 15}, "fwu3nx2": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu3nx2/", "text": "Everybody wants to do all the things you listed. The problem is that even if we are *technically allowed* to do those things, that doesn't mean it's *safe* for ourselves and the people around us. We all have quarantine fatigue. The question is whether we're going to consider normal college life more important than health and safety. Because of the numbers of people being infected by this virus, and the extremely serious illness it can cause, I think college life really needs to take a backseat until we get a handle on this.\n\nWe should all try to keep the number of people we see face-to-face as small as possible. Hang out with the friends you're closest with. Now isn't the time to be seeing acquaintances. Ask the people you want to spend time with how many people they have been seeing and how they are practicing social distancing. Don't hang out with somebody who struts around town like the virus doesn't exist. That kind of behavior endangers that person, the people who spend time with them, and the broader social circles of all those people. If a friend does something risky because they have to, like getting on a plane to see family, they should be self-quarantining to the extent possible for 14 days. If they aren't doing that, we should encourage our friends to consider other people and self-quarantine. Obviously wear a mask any time you're in public, even outdoors if there are a lot of people.\n\nClubs are going to be better off holding virtual meetings or outdoor meetings. Club meetings, depending on their size, aren't really that different from parties. It's a bunch of people enclosed in a small space breathing each other's air and socializing.\n\nThe library will probably be a high-traffic area. It would be better to study in another building or a secluded space within the library. I'm planning to spend most of my study time at home, but sometimes I will study in my department's building. We have a large, open space on the ground floor that should allow for social distancing. Remember that even if everybody wears a face mask, the things you touch are going to be touched by many other people. Carry hand sanitizer and use it frequently.\n\nYou can play DnD virtually. I've been playing in a virtual group and it's going well. We use Discord for voice and video. There are some online tools we use to create the maps and move our players around. I can't remember what they're called, but I'm sure there are multiple platforms for this.\n\nI don't really know what to tell you about the gym. I understand people need to get exercise. I think you'll just have to judge on a case-by-base basis whether it's a good idea to do whatever workout you do, depending on how many people are there and if the equipment is being thoroughly cleaned between uses. Stuff like running is probably better to do outside.", "author": "Virtual-Aioli", "created": 1593805973, "upvotes": 48}, "fwu3a8m": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu3a8m/", "text": "Ain’t no social distancing bullshit goin on here", "author": "KING_COVID", "created": 1593805770, "upvotes": -7}, "fwu25di": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu25di/", "text": "If you can, hang out with people outside as much as possible as the outdoor spread is significantly less likely. Also well-ventilated rooms help with this as well. Keep your 6-feet distance when possible. Don't hang out with people that think this is a joke.", "author": "Nerobus", "created": 1593805149, "upvotes": 13}, "fwu1hu0": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu1hu0/", "text": "Just basically treat public spaces like danger areas where a killer virus can infect you and therefore also be passed on to those closest to you.\n\nYES - go ahead and go to clubs, class, coworking, whatever.\n\n-IT IS NOT RUDE TO TELL SOMEONE THEY NEED TO BACK UP. \n\n-IT IS NOT RUDE TO IMMEDIATELY SANITISE YOUR HANDS ONCE YOU TOUCH A SHARED SURFACE, even if you shared that surface with your friend.\n\n-IT IS NOT RUDE TO WEAR A MASK IF IT IS ONLY YOU AND ONE OR TWO OTHER PEOPLE ON A ROOM.\n\n-IT IS NOT RUDE TO NOT RECIPROCATE A HANDSHAKE, HUG, OR HIGH FIVE.\n\nthese are the biggest things I’ve observed since going back into public and seeing some friends and coworkers. I have people in my life who are immunocompromised, so I am very vocal and firm with how I communicate my boundaries in public. It works.\n\nAlso, just - you know - common sense stuff (don’t pick up litter without gloves, don’t share food, if someone you know gets exposed, you also need to get tested, etc.)", "author": "al_the_time", "created": 1593804794, "upvotes": 32}, "fwu0rld": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu0rld/", "text": "I'm spending a bit of money this summer on getting a good WFH setup, since I've always been one to study at libraries/coffee shops/computer labs, and I'm trying to avoid that for the next year. If I have a nice setup with a big desk and monitors, I feel like I'll be more likely to be productive at home.", "author": "Rockerblocker", "created": 1593804399, "upvotes": 39}, "fwu07jg": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwu07jg/", "text": "Honestly you can probably do most of that stuff. Just be smart and considerate and wear a mask!!! if you're headed to the library, find small table in a quiet corner rather than the large group tables on the first floor. Hanging out with friends is fine, just don't get super close and personal. Maybe don't go to their dorms in large groups. Stock your dorm with disinfectant wipes to keep surfaces clean. \n\nIt's gonna be really different and weird, but I think we'll all get used to it pretty quickly.\n\nAnd if you don't feel comfortable going out with friends because they aren't following guidelines as well as they should be then do. not. go. It's not worth it.", "author": "olivvia23", "created": 1593804091, "upvotes": 3}, "fwtzomf": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwtzomf/", "text": "I'm gonna try going to campus as little as possible. My school will be offering online alongside with in class instruction. Not sure how they plan to do this as an institution, but I don't really need to go to campus at all if all my classes are online.", "author": null, "created": 1593803804, "upvotes": 20}, "fwtz5gg": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwtz5gg/", "text": "Tbh I wouldn't be too worried as long as your smart about it, everything will be just fine. As long as someone isn't directly in my personal space, I'm not gonna mind them being close. I'm just really trying to make this semester feel somewhat normal.", "author": "Insomnimanic1", "created": 1593803516, "upvotes": 1}, "fwtvz7e": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwtvz7e/", "text": "I’d say make sure your friends have been distancing, I myself won’t even hang out with people that I’ve seen posting parties and stuff on social media. Just wear your mask, use hand sanitizer and wash your hands, and do things virtually if you can. You don’t know who’s been around what, even just one person not wearing a mask and going to the store then going to DnD can get all of you guys sick.\n\nI’m planning on only sticking to my two friends/roommates because I know they’ve been distancing and even then, I’m still gonna be super clean and wary of them. I’ve canceled my club meetings and instead we’re doing zoom calls and stuff like that.", "author": "lucysage", "created": 1593801817, "upvotes": 6}, "fwtup73": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwtup73/", "text": "Don't be afraid of small group interactions and make sure that if you feel like you're in a big crowd in a classroom you can bring your mask or up your vitamin c intake as well I'm sure professors would be really flexible with posting their classes for those that can't make it due to certain reasons so ask your professor see what they say as well!", "author": "Admissions_Geek", "created": 1593801135, "upvotes": 3}, "fwttmf0": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwttmf0/", "text": "I’m not even sure if I should go back up to campus for the fall semester or if I should just do remote for the whole semester.\n\nMy college will basically end in person classes after thanksgiving weekend", "author": "KojaCola", "created": 1593800562, "upvotes": 166}, "fwtr999": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwtr999/", "text": "I'm particularly struggling with how I'm going to work out. Having to book a time slot will be inconvenient...", "author": "favela4life", "created": 1593799322, "upvotes": 128}, "fwtq3k6": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwtq3k6/", "text": "There's Roll20 to play virtually if people aren't up for in person or the school gets salty about the gatherings", "author": "simplplan540", "created": 1593798720, "upvotes": 51}, "fwte9zz": {"link": "/r/college/comments/hklpuu/whohow_to_social_distance_on_campus/fwte9zz/", "text": "Just be smart about it. Wear a mask. If someone may have been exposed, stay away and get them tested.\n\nGo study and work out, but keep 6 feet or wear a mask.\n\nHave club/org meetings, but wear masks, keep 6 feet when you can, sanitize often, and keep sick people away.\n\nDon't run a (party) club. Some kids at Bama have already done so and gotten hundreds of people infected.", "author": "mrbmi513", "created": 1593792608, "upvotes": 571}}}