{
  "sid": "qc1wef",
  "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/",
  "title:": "Should I switch to Computer Science major?",
  "text": "I am currently a freshman in my first semester at college and am majoring in business currently with a minor in administration and management. I have found business far less interesting than I thought it would be and have started looking at other majors.\n\nI am pretty average at mathematics but am really good with logical thinking and problem solving, and computers have always interested me. I just want to know how difficult computer science is if I were to switch and how math intensive it is.",
  "author": "FatMommyMilkers69",
  "created": 1634739454,
  "updated": 1634750211,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhd4rl7": {
      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd4rl7/",
      "text": "Major for CS requires math up to calc 3 lol",
      "author": "schnozbanger69",
      "created": 1634739748,
      "upvotes": 3,
      "replies": {
        "hhd533y": {
          "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd533y/",
          "text": "The school I am at requires up to calculus 1 along with discrete mathematics but I am wondering how difficult calc is",
          "author": "FatMommyMilkers69",
          "created": 1634739884,
          "upvotes": 2,
          "replies": {
            "hhd57gs": {
              "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd57gs/",
              "text": "It’s trigonometry + college algebra, but on roids bruh",
              "author": "schnozbanger69",
              "created": 1634739939,
              "upvotes": 4,
              "replies": {
                "hhd5i3y": {
                  "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd5i3y/",
                  "text": "Okay, thank you for your feedback, for someone who is average at math do you think i would be able to do it if I put in the effort?",
                  "author": "FatMommyMilkers69",
                  "created": 1634740074,
                  "upvotes": 1,
                  "replies": {
                    "hhdixtb": {
                      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhdixtb/",
                      "text": "ignore the other comment, you can. It's just going to be an uphill battle, as with many upper level math classes, but it's not impossible.\n\ncheck out /r/learnmath for people in a similar boat",
                      "author": "Athragio",
                      "created": 1634745613,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hhd79wr": {
                      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd79wr/",
                      "text": "Nah",
                      "author": "schnozbanger69",
                      "created": 1634740840,
                      "upvotes": -7,
                      "replies": {
                        "hhdcsuy": {
                          "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhdcsuy/",
                          "text": "Don’t listen to this comment. I was probably below average at math when I started. I took up to calc 2, discrete math, discrete structures, linear algebra, probability and stat. Calc 1 was arguably easier for me than pre calculus. \n\nThe joke is, now that it’s said and done, the math requirements were the easy part of the major.",
                          "author": "nabeshima-",
                          "created": 1634743135,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhd8lw4": {
          "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd8lw4/",
          "text": "My CS major required Discrete Math. Calc 3 itself was not specifically required, but was part of a math grouping of \"take one to meet this requirement\".\n\nEdit to add: I only went up to associates because I'm old and have a full time career. Bachelor will require more math.",
          "author": "SouthernRhubarb",
          "created": 1634741394,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhd8j62": {
      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd8j62/",
      "text": "At least in the school I go to CS requires calc up to 3, probability and statistics, another harder class in probability and statistics, discrete maths, another harder class in discrete maths, and linear algebra. Those are the ones I heard my CS friends talk about, there might be more. If you don't like math or aren't good at it I'd definitely avoid SC",
      "author": "cowfishAreReal",
      "created": 1634741363,
      "upvotes": 5,
      "replies": {}
    },
    "hhd5gwf": {
      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd5gwf/",
      "text": "If you’re interested, go for it.\n\nI’m also a freshman in my first semester and made the switch to CS from pre-nursing.\n\nTo put into context  how much math is demanded, during my lower division courses I must take Calculus l, ll, and lll along with discrete mathematics.\n\nNow math and science are my weaker subjects, and I have no background in coding, but took the leap of faith anyways. Calculus l has been a pain in the ass but I’ve been practicing outside of class several hours a week to digest the content. \n\nYou should totally switch to CS if you’re interested in it. But you have to be willing to take on the challenge and put in the hard work to getting this degree because it’s not easy. Especially if you’re like me and don’t have prior knowledge of coding or computer systems.",
      "author": "kizeltine",
      "created": 1634740058,
      "upvotes": 1,
      "replies": {
        "hhd65m3": {
          "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd65m3/",
          "text": "Okay awesome, thank you so much for your feedback, ive just been worried about how hard the math will be but I also feel like I can definitely do it if I put in the effort",
          "author": "FatMommyMilkers69",
          "created": 1634740358,
          "upvotes": 1,
          "replies": {
            "hhd9e5j": {
              "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhd9e5j/",
              "text": "Discrete Math, incidentally, is probably going to be the hardest math course you take for the major. It was a washout course for many of my peers (they failed). I got As in all my math courses and I barely, barely, barely got a B in this one (was almost a C) by the absolute skin of my teeth because I managed to do well on the final. So if math is actually hard for you or if you're the kind of person to have a catastrophic meltdown if you get anything less than an A, you're going to be miserable in the major. Don't confuse it with being unable to do it though.\n\nThe algorithms class is also heavily math and logic based.\n\nComputer Science is essentially a math degree that teaches you programming. If there is a Computer Programming or a Software Development degree at your school, you'll probably be happier with that one.",
              "author": "SouthernRhubarb",
              "created": 1634741718,
              "upvotes": 1,
              "replies": {
                "hhdc1ih": {
                  "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhdc1ih/",
                  "text": "I am not bad at math but also not a genius at it. I got A’s and B’s in my mat courses in HS but I also didn’t work very hard in high school if I’m being honest, but I am more motivated to work hard in college",
                  "author": "FatMommyMilkers69",
                  "created": 1634742820,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhdeg3u": {
      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhdeg3u/",
      "text": "Math is just like any other subject. It’s going to be difficult, but if you put in the time and effort you’re gonna be just fine",
      "author": "No-Arrival-7380",
      "created": 1634743801,
      "upvotes": 1,
      "replies": {
        "hhdj53u": {
          "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhdj53u/",
          "text": "That’s kinda what I’m thinking",
          "author": "FatMommyMilkers69",
          "created": 1634745695,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhdp3gd": {
      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhdp3gd/",
      "text": "I'm a Cybersecurity major, which relies on a lot of Computer Science courses. I LOVE programming and working with logic problems but I hate doing complex math, that's why I picked Cybersecurity. I just have to take College Algebra Calculus I, and Intro to Statistics as for as math classes go and take most of the CS classes I want.\n\nIf you're the same as me, a Computer Science major may not be the best fit for you if you're not a fan of math. Computer Science itself is very broad, so if your school offers a specialization of CS that requires fewer math courses then that may be a better fit.",
      "author": "Leadjtime",
      "created": 1634748043,
      "upvotes": 1,
      "replies": {}
    },
    "hhdphel": {
      "link": "/r/college/comments/qc1wef/should_i_switch_to_computer_science_major/hhdphel/",
      "text": "If you’re in business and have an interest in computers, look into mis or cis (same program but go by different names)",
      "author": "checkyblecky",
      "created": 1634748191,
      "upvotes": 1,
      "replies": {}
    }
  }
}