{
  "sid": "fh6l6f",
  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/",
  "title:": "Some tips for online classes",
  "text": "I saw a lot of stuff on r/college lately from students who have not taken online classes before. Since I teach both online and face-to-face (and have for some time) I thought I'd share some of the tips (and other considerations) with regard to online classes.\n\nTips:\n\n1. First and foremost, it is WAY easier to skip the work when it's online. I plan on having asynchronous lectures for my switch over to online, but even for those faculty hosting live lectures, it will be much tougher to focus. Try to set up an environment where you can stay focused. Wear actual clothes, get your coffee, act like you would if you were in a face-to-face class so your brain doesn't try to switch into \"relax\" mode on you. Try to watch the videos/lectures around the same time your class would have met since you are already in the routine for it.\n\n2. Take notes like you would in a regular class. Again, when it's online (especially recorded) it might feel silly to take notes. But notes help you learn, face-to-face or otherwise.\n\n3. PARTICIPATE! You will not get to hear other students' questions as much (if at all, depending on the format). There is not really an easy way to do discussions so the more you make an effort to participate, the more everyone will get out of it. If you have questions on the material, for the love of God make sure you ask them because no one else is going to ask them for you as often happens in traditional classes.\n\n4. Exams are probably going to be different. You might get a prof that just throws the multiple choice exam online, but most are aware that it is so easy to cheat online that they will format online exams differently. You will see lots more randomization of questions, question order, and answer choice order. You might see online proctor services like Lockdown Browser or Respondus Monitor that literally lock you out of everything but the exam and then record you taking it via webcam. You might end up getting an open book exam that is much more difficult.\n\n5. Usually, you'd be in class about 2.5 hours a week and (hopefully) studying and doing some assignments on top of that. You should keep with that pattern. Assume it'll take you ~2.5 hours just to go through all the learning content. I think a lot of students just erase the class time from their brain and try to just rush through everything, which would not be possible in a face-to-face. This is another way that setting up a \"class time\" for yourself can really help.\n\n6. Editing to add this one: Every prof is going to do this differently. Some might livestream lectures, some might record them, some might not lecture at all. It is really important you keep an eye on your emails, check your notification settings on Canvas/Blackboard/whatever, and get comfortable with 4 or 5 slightly different versions of this.\n\nThe best way I can sum this up is that in a traditional class you are often or at least often can get away with being a passive consumer of the content. In an online class you have to be more of an active participant in your own learning. \n\nOther considerations:\n\n1. Many--MANY--of your professors hate teaching online and have no idea how to do it right. They have never had to before. It is not as simple or easy as it might seem to design a good online learning experience and many faculty have no experience with it and no time to learn. We are all dealing with this change, so try to be patient the best you can. \n\n2. Be open-minded. I teach a topic that can be put online pretty easily, but I have no clue how you would put a chem lab or an acting class online. And neither do a lot of faculty. This will be testing the creativity of many professors. Every course has learning objectives you are expected to be assessed on, and they will have to find a way to do that.\n\n3. Technical issues are going to be rampant, both because of the pressure put on the learning management systems and because of instructor incompetence + poor user interfaces. Don't start stuff at the last minute. It's not a good idea in general but you run the risk of technical issues preventing you from finishing. Your professors are not tech support either and chances are they have no clue what's wrong. You should probably contact your campus tech support folks for help, not your professor, unless you're sure it's something wrong on their end.\n\n4. Editing to add: Everything is going to be just fine. It's going to be weird. It's going to be an adjustment. But ultimately if you pay attention to your profs and keep up with the work this will just have been an inconvenience in the end.\n\nI'm sure others can chime in with more suggestions or comments. Good luck with the transition.",
  "author": "Dr_Pizzas",
  "created": 1583969193,
  "over_18": false,
  "upvotes": 1652,
  "upvote_ratio": 0.99,
  "comments": {
    "fljj308": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fljj308/",
      "text": "Do they take attendance?",
      "author": null,
      "created": 1585214742,
      "upvotes": 1,
      "replies": {}
    },
    "fl5xpem": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fl5xpem/",
      "text": "Guyss if yall don't know how to use the ZOOM online thing like me, my bud made a really nice video explaing how to use it! This should help out anyone about to go into the online courses soon!!\n\n Tutorial Vid: [https://youtu.be/ZlZLBr9on-I](https://youtu.be/ZlZLBr9on-I)",
      "author": "INeedLogicHelpPlz",
      "created": 1584848467,
      "upvotes": 1,
      "replies": {}
    },
    "fl1f8it": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fl1f8it/",
      "text": "For students taking online classes (Elementary school-High School), here are a few tips!\n\nCreate a schedule with breaks and all\n\nTry to spend a block of time on one class at a time\n\nMake time to relax or even take a nap....yes, that will help you power through\n\nCreate goals for your day\n\nCreate a to-do list\n\nMake sure you are doing things you love- (drawing, singing, biking)\n\nListen to a podcast instead of reading or watching a show\n\n\\*Don’t forget to make time for chores: Your family will need your help during this time.\\* ",
      "author": "A_College2",
      "created": 1584727818,
      "upvotes": 1,
      "replies": {}
    },
    "fkz6jss": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkz6jss/",
      "text": "Here are tips from a Finance tutor to help you stay ahead on your course material during this transition to online learning; [https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog](https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog)",
      "author": "carah1089",
      "created": 1584663896,
      "upvotes": 1,
      "replies": {}
    },
    "fkyb5n7": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkyb5n7/",
      "text": "Great tips! I also made a video to help people out with increasing productivity. 1) Change out of your pajamas, 2) keep a schedule, 3) Hide your phone, 4) use the Pomodoro technique, 5) listen to music. Check out the video if you’d like \n\n[How to Increase Productivity While Quarantined](https://youtu.be/ohHtC6qKsWI)",
      "author": null,
      "created": 1584645247,
      "upvotes": 1,
      "replies": {}
    },
    "fkvqkvk": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvqkvk/",
      "text": "I would just add that if you are getting an online lecture instead of an in-class lecture, prepare for it like you normally would. That means you do the reading before the class -- because you ALWAYS do the readings amiright ;-) -- and be prepared to ask/answer questions and take notes. \n\nIf you take notes with your laptop (you should do this by hand btw; you'll retain way more information), put the lecture on your phone so you can use your laptop as you normally do. \n\nFind out what method the instructor wants to use for you to contribute. Maybe there will be a discussion forum of some kind online. Take advantage of this! It's an opportunity to talk about what you're learning, which is a great way to actually learn! \n\nAlso, minimize distractions. If other people live with you, make sure they know when you are \"in class.\" They should leave you alone as much as they would leave you alone if you were sitting in the lecture hall.  \n\nIn short, don't take this as a chance to do less. In fact, plan to do more. Learning with less structure is an adjustment, but one you can handle if you prepare for it!",
      "author": "Robert_H_",
      "created": 1584574654,
      "upvotes": 1,
      "replies": {
        "fkw2v58": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkw2v58/",
          "text": "Unfortunately, just because you tell someone to leave you alone because you are in class does not mean they will listen. I'm all too familiar with my parents interrupting me when they know I'm doing something important like a meeting on video.",
          "author": "abnormallyme",
          "created": 1584582213,
          "upvotes": 1,
          "replies": {
            "fl7hvln": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fl7hvln/",
              "text": "Ain't that the truth! My partner does it ALL THE TIME! When he asks me for something and I'm working, I tell him I'll do it when I'm done work. Definitely not a perfect world, but we have to keep trying to set boundaries with people.",
              "author": "Robert_H_",
              "created": 1584902065,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkvpd3q": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvpd3q/",
      "text": "I’m a ResLife Staff member taking classes at a university. I spent a year learning Japanese on my own, and joined Japanese II this semester. It’s been a lot of fun, and in some aspects the students are ahead of me. In many others, they will hear me say something and have absolutely no clue what I’m on.\n\nJust before this all went down, I was planning out an extracurricular Japanese film club, to try and expose them to more Japanese culture that ISN’T anime (it’s as bad as you think, maybe worse). I have the movies on my iTunes account and I was going to meet with the students in a residence hall lounge or one of our lecture halls to have watch parties. We have a GroupMe together, a list of a movies, and finding time will be even easier now.\n\nWith that said: is there a way to stream films I own on my iTunes account in a way that everyone can see and hear it? A few years ago I dated someone long distance and we tried this, but my iTunes movies would never stream through the methods we tried. Now it’s 2020, though, and video communication seems to be the likely way of life for the next few months. Does anyone have suggestions here?\n\nThank you in advance!",
      "author": null,
      "created": 1584573930,
      "upvotes": 1,
      "replies": {}
    },
    "fkttcp8": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkttcp8/",
      "text": "2.5 hours a week??? Tf? I literally have 4 hours minimum a day besides Fridays",
      "author": "KroegKind",
      "created": 1584533968,
      "upvotes": 1,
      "replies": {
        "fkttjjq": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkttjjq/",
          "text": "That's per class.",
          "author": "Dr_Pizzas",
          "created": 1584534137,
          "upvotes": 1,
          "replies": {
            "fktto9m": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fktto9m/",
              "text": "Ahh",
              "author": "KroegKind",
              "created": 1584534252,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkm7dfn": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkm7dfn/",
      "text": "I deeply understand that it's a huge adjustment. Here are some tips to help students in the transition ; [https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog](https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog)\n\nAlso feel free to message me if you are taking Finance class and would like a little more help going over the class material. Stay safe everyone :)",
      "author": "carah1089",
      "created": 1584322578,
      "upvotes": 1,
      "replies": {}
    },
    "fkjk2dc": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjk2dc/",
      "text": "Thank you!",
      "author": "fxuk",
      "created": 1584248373,
      "upvotes": 1,
      "replies": {}
    },
    "fkjdnlo": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjdnlo/",
      "text": "If they do exams with monitoring, what if you don't have a webcam? My laptop is pretty lack luster, but had a webcam, and would hopefully run whatever it is I have to do.\n\nBut if not, my desktop doesn't have a webcam and I don't really have the means to buy a webcam unless I can find one really cheap?",
      "author": "SaeInsanity45",
      "created": 1584242934,
      "upvotes": 1,
      "replies": {
        "fkjfhpf": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjfhpf/",
          "text": "Well since it wasn't a requirement for the class I'd hope they'd cut you some slack. It's really dependent on your individual professor. Realistically I don't think most classes will require it.",
          "author": "Dr_Pizzas",
          "created": 1584244387,
          "upvotes": 1,
          "replies": {
            "fmlgxmb": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fmlgxmb/",
              "text": "The real issue for a lot of people is that there is a limited stock and everyone has to buy webcams rn because of this change. So many people are physically unable to get a hold of webcams and are just expected to “figure it out” -_-",
              "author": "TheMerryBerry",
              "created": 1586186195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkja9fp": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkja9fp/",
      "text": "i actually have questions about respondus: is it free? i really don’t have the money to pay for something else right now, especially something i’ll never use again\n2. i keep my webcam covered, is that going to be an issue and will i have to uncover it? ALSO i’m technically ccp student, so wouldn’t it technically be an invasion of privacy or something like that considering i’m under 18?",
      "author": "brit_666",
      "created": 1584240312,
      "upvotes": 1,
      "replies": {
        "fkjfcob": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjfcob/",
          "text": "It's free for you if they're using it.\n\n Yes you would have to uncover your camera during the exam.\n\nNo it would not be an invasion of privacy, it's not like you don't know it's recording.\n\nEither way I doubt most classes will use this. It is a thing, though.",
          "author": "Dr_Pizzas",
          "created": 1584244277,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkgvgpq": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkgvgpq/",
      "text": "[deleted]",
      "author": null,
      "created": 1584176291,
      "upvotes": 1,
      "replies": {
        "fkjfngs": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjfngs/",
          "text": "Almost all of this is going to vary a lot from class to class. We don't have any specific format requirements other than being fully online.",
          "author": "Dr_Pizzas",
          "created": 1584244517,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkgsmov": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkgsmov/",
      "text": "Thank you for this!!! It’s my freshman year(what a way to end my first year of college am I right lol) and I never had the opportunity to take online classes in high school. I will def keep this in mind and use it the best I can.",
      "author": "I_Am_Confusionn",
      "created": 1584172329,
      "upvotes": 3,
      "replies": {
        "fkha6bg": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkha6bg/",
          "text": "The biggest risk is just procrastinating or losing focus, particularly with all that is going on. Just keep up with the work and pay attention to what your profs say and you'll be totally fine.",
          "author": "Dr_Pizzas",
          "created": 1584193521,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fkg840h": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkg840h/",
      "text": "Thank you for posting this.  I just came here because all of my classes (including a microbiology lab) have been moved online and I am feeling lost.  I appreciate you being here to help me not freak out.",
      "author": "kimareth",
      "created": 1584152352,
      "upvotes": 1,
      "replies": {
        "fkg9uaz": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkg9uaz/",
          "text": "Everyone is worried. For the most part just be flexible and keep organized and you'll be totally fine. Most profs are freaking out right now too!",
          "author": "Dr_Pizzas",
          "created": 1584153657,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fke99xd": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fke99xd/",
      "text": "[deleted]",
      "author": null,
      "created": 1584108246,
      "upvotes": 1,
      "replies": {
        "fkeellr": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkeellr/",
          "text": "I don't think the chances of that are high. I have heard nothing about schools outright canceling. Schools can't afford it. Instead you will get some cobbled together online classes that are awkward and difficult for everyone involved and probably much less effective, unfortunately.",
          "author": "Dr_Pizzas",
          "created": 1584111557,
          "upvotes": 5,
          "replies": {}
        },
        "fkeoejc": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkeoejc/",
          "text": "Very unlikely",
          "author": "_KittyInTheCity",
          "created": 1584117355,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkd6gi1": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkd6gi1/",
      "text": "Any tips for online college algebra class? Im making a low B right now..the material is still a little hard to understand. I have never taken an online class.",
      "author": "gabmary79",
      "created": 1584069585,
      "upvotes": 1,
      "replies": {
        "fkef8ey": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkef8ey/",
          "text": "For college algebra, I'd say the internet is your friend. You can find lots of videos and website offering different explanations of concepts. It will be tougher to ask questions, so don't be afraid to e-mail your professor for help on specific things. You are going to have to be more self-reliant but the resources are out there.",
          "author": "Dr_Pizzas",
          "created": 1584111941,
          "upvotes": 2,
          "replies": {}
        },
        "fkeiv9a": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkeiv9a/",
          "text": "I am a math major, and even tho I am in more advanced math, I would say if you don’t understand, look up a video on YouTube. Even tho I am a traditional student right now, I took Calc 2 online in high school, and whenever I didn’t understand a concept, I looked up a video and it helped tremendously! Khan Academy is great! But for college algebra there is probably HUNDREDS of videos out there on your topics, so find a YouTuber that explains it in a way you can understand it. And, never be afraid to email your professor with questions, and, if any extra credit assignment is offered ever, always do it, it can be a difference between an A and B or a B and C down the line.",
          "author": "gabiimg333",
          "created": 1584114100,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkd54ef": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkd54ef/",
      "text": "common sense but online classes are not a break!!! you have to work insanely hard",
      "author": "Carl2011",
      "created": 1584068611,
      "upvotes": 3,
      "replies": {}
    },
    "fkat621": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkat621/",
      "text": "i'm wondering if labs are going to be online labs. i remember using a website in my high school physics class that had online labs",
      "author": "crankthatshane",
      "created": 1584018848,
      "upvotes": 1,
      "replies": {}
    },
    "fkaihtz": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaihtz/",
      "text": "Any idea what these colleges are doing about the students that paid for room and board? Will that money paid be transferred to next year?",
      "author": "superking75",
      "created": 1584009448,
      "upvotes": 2,
      "replies": {
        "fkallkv": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkallkv/",
          "text": "Honestly even the colleges don't know yet. They're trying to figure it out.",
          "author": "jessamina",
          "created": 1584012676,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fka5jgn": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka5jgn/",
      "text": "What I don’t get is online exams. Unless they’re gonna use video recorders(which is hard to set up for classes with hundreds/thousands of people in a few days), everyone will simply cheat. I can just have two PC’s and use the other PC to look up answers. A video recorder might not even solve that tbh.",
      "author": "nwi210",
      "created": 1583993304,
      "upvotes": 14,
      "replies": {
        "fkaa82m": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaa82m/",
          "text": "A lot of my online exams are on things you need more than just the answers to complete. That’s why they’re online or “open-book”, because you need to be able to do research to answer the question properly.\n\nBut yeah some science and math classes are going to make it very easy to cheat on exams",
          "author": "FatHarrison",
          "created": 1583998708,
          "upvotes": 10,
          "replies": {
            "fkaazx2": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaazx2/",
              "text": "Yeah I was referring to science and math classes.",
              "author": "nwi210",
              "created": 1583999669,
              "upvotes": 2,
              "replies": {}
            },
            "fkehsuv": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkehsuv/",
              "text": "I am a math major and all my math classes are proof-based. I’m interested do see how we would write out our mathematical proofs with all the symbols and everything on a computer? Very crazy. Haha",
              "author": "gabiimg333",
              "created": 1584113466,
              "upvotes": 1,
              "replies": {
                "fkjfio1": {
                  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjfio1/",
                  "text": "There’s software for that. I’m also a math major and we use LaTeX.",
                  "author": "dea-ex-macchiato",
                  "created": 1584244408,
                  "upvotes": 2,
                  "replies": {
                    "fkjiue8": {
                      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjiue8/",
                      "text": "Interesting! Is the software free? My school is very stingy with money, I doubt they would pay for something like that. Maybe for a larger program, but there are only 5 of us math majors at my school. We almost didn’t go online because they thought it was too expensive, and they are not refunding us housing or food either for the year... Maybe they would pay for it if it was for a larger program, but there are only 5 of us math majors at my school...",
                      "author": "gabiimg333",
                      "created": 1584247268,
                      "upvotes": 1,
                      "replies": {
                        "fksju3v": {
                          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fksju3v/",
                          "text": "I'm not the OP, but I take a maths course online because I am a 100% online student. I use LaTeX to turn in all my assignments. \n\nLaTeX is almost always free. It is however not a single piece of software. It is a document preparation system that is used by a plethora of software to create PDFs. I would peruse r/latex to see if it might interest you. I will warn you that LaTeX has a steep learning curve, especially if you have no programming background but once you learn it, you can get work done very quickly and it looks really nice.\n\n I'm not getting a degree in maths but I have heard that LaTeX is frequently used in graduate courses so it might be worth looking into if you see graduate work in your future.\n\nAs an aside, my maths course is introductory and online and the assignments we get are heavily focused on showing our work, which reduces the ability to 100% cheat. You can definitely plug the question into Wolfram and get *an* answer, but you also need to be able to show how you got there. It's not perfect, but this course has been around for years and it's largely considered effective.",
                          "author": "purr_pal",
                          "created": 1584491709,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fkaq19k": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaq19k/",
          "text": "In my actual online class my exams are open book and I write the questions. They are harder and the questions can't be Google. Some professors will just put their normal exams online and people will definitely cheat.",
          "author": "Dr_Pizzas",
          "created": 1584016521,
          "upvotes": 5,
          "replies": {
            "fkaqbn3": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaqbn3/",
              "text": "For very difficult classes I can see this. However, for introductory classes like we have, even if I can’t copy and paste the question, I can google similar problems and deduct how to solve it. It’s easier than you think, especially if you already have a somewhat solid grasp on the material. Also I could have a parent help me, a friend, etc.....",
              "author": "nwi210",
              "created": 1584016744,
              "upvotes": 5,
              "replies": {
                "fkar2h2": {
                  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkar2h2/",
                  "text": "I actually teach an intro class. I just make up some story and ask people to apply a concept. Maybe you can Google the concept, but you can't Google it's application to the story or the story itself.\n\nThe parent/friend thing might work depending on the content. I know people have done this to me so I also have a pretty strict timer and now use Webcam monitoring, which I HATE.",
                  "author": "Dr_Pizzas",
                  "created": 1584017311,
                  "upvotes": 7,
                  "replies": {
                    "fkarc1k": {
                      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkarc1k/",
                      "text": "I was thinking like Physics. Even if the problem isn’t on google(would be surprised), I can use concepts from books and use equations and example problems to solve it. \n\nSame with something like a Comp sci class, where I plug the code into a java visualized and I have my result.",
                      "author": "nwi210",
                      "created": 1584017507,
                      "upvotes": 5,
                      "replies": {
                        "fkarz3u": {
                          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkarz3u/",
                          "text": "Congratulations: your comment used all the letters in the alphabet!",
                          "author": "alphabotical",
                          "created": 1584017979,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "fkauauv": {
                          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkauauv/",
                          "text": "Ah yes, that could be an issue. Although... \n> I can use concepts from books and use equations and example problems to solve it.\n\nThat sounds suspiciously like learning how to actually do it to me.",
                          "author": "Dr_Pizzas",
                          "created": 1584019635,
                          "upvotes": 6,
                          "replies": {
                            "fkavnin": {
                              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkavnin/",
                              "text": "Lol true. That being said I do dozens of practice problems like this b4 tests, and I still fail tests when it’s not looking at the book. \n\nIt’s close to learning it, but not quite.",
                              "author": "nwi210",
                              "created": 1584020534,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fkx2ru6": {
                  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkx2ru6/",
                  "text": "If you can Google similar problems and deduct how to solve the one on the test... maybe you're just learning how to do the material?",
                  "author": "bl1y",
                  "created": 1584616613,
                  "upvotes": 1,
                  "replies": {
                    "fkxmhsz": {
                      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkxmhsz/",
                      "text": "If that was true I’d be getting 100% on all of my tests on every class.",
                      "author": "nwi210",
                      "created": 1584631212,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fkc4ufz": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkc4ufz/",
          "text": "I took a few online course in high school and college. Probably the best answer could be ProctorU, which essentially locks your screen, requires a webcam (so you can sweep the room to show there is nothing there to help you), as well as videotapes and records you for suspicious activity. Taking exams with it has always felt super weird, especially since little things can apparently trigger teachers, but they usually let the teacher decide, giving them a report of whether or not you cheated.",
          "author": "TI_89Titanium",
          "created": 1584045815,
          "upvotes": 3,
          "replies": {}
        },
        "fkbuy7y": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkbuy7y/",
          "text": "My classes we're already online this semester anyway. The exams are about 30 multiple choices, then ten or so essay questions. They expect us to use our books and the internet. The essay questions even say not to copy and paste from a website. Not everything is considered cheating. We are also given 3 hours to take it, and I find I use most of that time.",
          "author": "toomanygirls99",
          "created": 1584040370,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fka4m4u": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka4m4u/",
      "text": "Is this like video lectures? If so, are they captioned? I've done online schooling in high school through a program designed for disability so I don't know how other online programs work (except MVS which sucks ass).",
      "author": "arlomilano",
      "created": 1583992328,
      "upvotes": 4,
      "replies": {
        "fkapi1z": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkapi1z/",
          "text": "Yes. A trick profs use is YouTube will auto caption videos. If you need captions and your prof doesn't think about it, this is a common solution. But they have to know enough about YouTube to upload it there.",
          "author": "Dr_Pizzas",
          "created": 1584016092,
          "upvotes": 2,
          "replies": {
            "fkb3jww": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkb3jww/",
              "text": "Autocaptions are not sufficient. There are many videos on why autocaptions don't work.\n\nThis one is by a deaf youtuber: https://youtu.be/AizBOhsgpuY",
              "author": "arlomilano",
              "created": 1584025403,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fka1qtr": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka1qtr/",
      "text": "@Mods\n\nCan this get pinned please? 💙",
      "author": "_34_",
      "created": 1583989522,
      "upvotes": 5,
      "replies": {}
    },
    "fka1ert": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka1ert/",
      "text": "Wait so even taking an online class you still have to attend to campus?",
      "author": "_readyforww3",
      "created": 1583989220,
      "upvotes": 1,
      "replies": {
        "fkaqpdk": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaqpdk/",
          "text": "... No? Online classes are just online. There may be some exceptions at your school specifically but most people are not going in for anything.",
          "author": "Dr_Pizzas",
          "created": 1584017035,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fk9ziqc": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9ziqc/",
      "text": "I’m glad that my classes are going to be fine in an online format and that I did high school 100% online so I’m more used to online classes than face to face but I go to a community college and my school has technical degrees like wielding and I’m just like... how can you teach wielding online? Nursing? Any degree that requires hands on learning is going to be v fucked.",
      "author": "extrasmallbillie",
      "created": 1583987636,
      "upvotes": 4,
      "replies": {}
    },
    "fk9v0on": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9v0on/",
      "text": "Going off of all of the comments about non-lecture courses (labs, acting, art) we have to realize that it does not help to panic or stress about the classes as a student. Hundreds of universities are now moving online and many professors are going to have to figure out what will happen. Everyone is going through the same thing though so everyone will be understanding.",
      "author": "somecreativename101",
      "created": 1583984256,
      "upvotes": 43,
      "replies": {
        "fk9vf1v": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9vf1v/",
          "text": "Agreed. I wouldn't be too worried about it somehow affecting grades. It's going to be different and sub-optimal but no one should be holding it against students (as I hope they don't hold it against faculty who are struggling to adjust).",
          "author": "Dr_Pizzas",
          "created": 1583984537,
          "upvotes": 11,
          "replies": {
            "fk9vjwq": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9vjwq/",
              "text": "Yes. I have heard from some fellow students who said they were worried because online learning is difficult for them. I told them that this time will not be held against them at all.",
              "author": "somecreativename101",
              "created": 1583984631,
              "upvotes": 10,
              "replies": {}
            },
            "fkale4i": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkale4i/",
              "text": "Right. And honestly for the prerequisite courses if someone's progressing but a bit slowly I *can't* just pass them (because that will fuck them over in the next class) but I can certainly offer incompletes a lot more readily than I would in a regular semester. I'm also slashing the late penalties in the online homework for everything due after this week.",
              "author": "jessamina",
              "created": 1584012477,
              "upvotes": 5,
              "replies": {
                "fkx2neh": {
                  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkx2neh/",
                  "text": "Incompletes are going to be an important part of this process, but given how many faculty are adjuncts (like me)... ouch. I can't keep working weeks after the semester (and pay) ends.",
                  "author": "bl1y",
                  "created": 1584616477,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fk9uy4c": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9uy4c/",
      "text": "[deleted]",
      "author": null,
      "created": 1583984206,
      "upvotes": 23,
      "replies": {
        "fkvr7uv": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvr7uv/",
          "text": "Sounds like you're really well equipped to manage this transition! But ya, it does suck to miss out on the in-class discussion that will necessarily be hampered by the change to online. Are there other classmates you think might feel the same? Do you want to see about setting up a weekly online study group?",
          "author": "Robert_H_",
          "created": 1584575028,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fk9ufbr": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9ufbr/",
      "text": "My major is carpentry. All of my classes besides one are entirely lab time. I’ve got no idea how this is going to work as I do not have almost any of the tools at my disposal at home as I do at campus.",
      "author": "iamnotajeww",
      "created": 1583983852,
      "upvotes": 16,
      "replies": {
        "fkaljqx": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaljqx/",
          "text": "A lot of classes like that are getting exceptions and/or they're switching them around/splitting sections so that only half the class will be there at one time.",
          "author": "jessamina",
          "created": 1584012627,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fk9rt7v": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9rt7v/",
      "text": "I'm really concerned for my uni's upcoming switch to online classes as I go to an art university and ALL of our studio work is physical and done in class. How on earth are we supposed to showcase our massive module furniture assignment through skype??????????",
      "author": "nicoliravi0li",
      "created": 1583982143,
      "upvotes": 26,
      "replies": {
        "fk9sjlq": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9sjlq/",
          "text": "These are the tough ones. I literally just heard from our admin that exceptions will be granted for things like this on a case by case basis. But yeah, you might have to just show it via Skype or something if you're 100 percent online.",
          "author": "Dr_Pizzas",
          "created": 1583982612,
          "upvotes": 17,
          "replies": {}
        },
        "fk9u061": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9u061/",
          "text": "At UT Austin, they stated that labs and performing arts classes would still meet.",
          "author": "REVIGOR",
          "created": 1583983573,
          "upvotes": 5,
          "replies": {
            "fkeo5lr": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkeo5lr/",
              "text": "Here at TXST we’re switching to fully online for two weeks, even labs. Not sure how it’s going to work...",
              "author": "_KittyInTheCity",
              "created": 1584117209,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fkvqxlo": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvqxlo/",
          "text": "I would look at this as a chance to impress! How *will you* show your massive module furniture assignment in this new medium? You're a designer! Apply everything you've learned to this problem, find the tools to solve it and show your profs that you can take responsibility for managing this really challenging change! \n\nBest of luck!",
          "author": "Robert_H_",
          "created": 1584574862,
          "upvotes": 2,
          "replies": {
            "fkvw53w": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvw53w/",
              "text": "I figured i would find a way to make a cool render for it in maya, so I can solve the problem that way. our main complaint is that our painting/woodworking/laser-cutting/3d printing studios aren't available, yet we are still paying full tuition.  ¯\\\\\\_(ツ)\\_/¯.",
              "author": "nicoliravi0li",
              "created": 1584577988,
              "upvotes": 1,
              "replies": {
                "fl7i09n": {
                  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fl7i09n/",
                  "text": "Ya, I hope your student union is doing something to advocate for you. Maybe access post-semester or a special class when all this is done? Sounds incredibly frustrating!",
                  "author": "Robert_H_",
                  "created": 1584902142,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fk9q9zc": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9q9zc/",
      "text": "I'm taking my entire degree online, some from schools that are mostly traditional, so I can totally confirm the \"some professors have no idea how to teach online\" thing.\n\nThis is going to be a bit of a disaster for a lot of people because online school requires so much more self-control. Also, schools that suddenly switch to online-only are going to have problems with lack of online curriculum. I question how they are handling that.\n\nHow I handle school, even a full-time course load, is to do school in the morning and evening and leave the afternoon for my own stuff. Gives you a break and prevents burnout.",
      "author": "Kalsifur",
      "created": 1583981180,
      "upvotes": 65,
      "replies": {
        "fk9rf8u": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9rf8u/",
          "text": "Yes, many courses are going to be a disaster. My school is doing what it can to make online curriculum development tools and best practices available, but we simply don't have enough staff for such a massive switch. Folks without experience will likely try to hold their normal class via Zoom or something.",
          "author": "Dr_Pizzas",
          "created": 1583981895,
          "upvotes": 27,
          "replies": {
            "fka6r0b": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka6r0b/",
              "text": "I'm taking five courses this semester. Two of the professors have taught online classes before. Two of the professors don't even use the online gradebooks that the entire university is supposed to use. The two that have taught online already set everything up in a typical online course format with discussion boards, quizzes, etc. broken into weekly modules. The three that haven't taught online courses before are, indeed, planning to just do their regular classes via Zoom. We'll see if that changes at all after the first week or two.",
              "author": "agentp2319",
              "created": 1583994611,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "fk9gtxi": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9gtxi/",
      "text": "Thank you for posting this:)",
      "author": "Kouglove",
      "created": 1583975790,
      "upvotes": 6,
      "replies": {}
    },
    "fk9acvy": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9acvy/",
      "text": "although I am also currently experiencing this transition I have my fair share of experience with online classes as well, and I have a few suggestions to add. they may be common sense, but I'm hoping I can help some people out!\n\n1. many students may feel confined to their home after being on campus and being able to go to different study spots/locations/outdoor areas. don't let this limit you! go to your local coffee house, sit on your porch, find a quiet area at your local park, etc. just because you may not have that 'on-campus feel' doesn't mean you have to go stir crazy sitting in your house! \n2. from my experience, if you are a morning person log into your online classes first thing in the morning to check discussion posts and send out some replies or questions and if you are a night person sit down after dinner/before bed and crank out your schoolwork. you may not be in class, but sitting down with your usual cup of coffee, a snack, and your study materials will make you feel more inclined to focus just as you do in lectures.\n3. keep. a . calendar. whether it is a desk calendar, phone calendar, planner, etc. many people may already do this but they may feel a little more frazzled and unorganized due to the sudden transition. I personally use google calendar and a desk calendar. this will help you easily be able to map out your week. online classes usually have specific timed deadlines just like your in-person classes do so make sure to detail the times. set up reminders to notify you a day before a homework or paper is due, or if a bigger project is due set reminders up to a week in advance. check your due dates often as they could change due to the transition to online courses. \n4. lastly, just because you have online classes doesn't mean you can surf the web for half of the day while you should be doing your schoolwork. although online classes might make you more inclined to shift over to playing your favorite video game or shopping for clothes during your schoolwork, think of it as you would when you're attending lectures: if you spend your time surfing the web the whole class time, you're going to be completely lost when it comes to exams/quizzes/papers/general content. just as op says in #5, set aside some \"class time\" and the rest of the day  you can do whatever your heart desires. \n\nfrom one student to another, good luck everyone!",
      "author": "stephbisnette",
      "created": 1583971994,
      "upvotes": 145,
      "replies": {
        "fkedyg8": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkedyg8/",
          "text": "> go to your local coffee house\n\nI do love working from a coffeehouse, but this does go against the whole \"quarantine\" idea.",
          "author": "jpmrst",
          "created": 1584111168,
          "upvotes": 54,
          "replies": {}
        },
        "fk9bv1d": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9bv1d/",
          "text": "To be fair, some students do not have access to vehicles so leaving to go to say a park is easier said than done. But otherwise, you are absolutely right. Online classes should be held to the same standard as in class classes. Get the work done to the best of your ability.",
          "author": "abnormallyme",
          "created": 1583972883,
          "upvotes": 52,
          "replies": {
            "fk9hdul": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9hdul/",
              "text": "I completely agree with you and didn't even think of this! As someone who lives on the outskirts of my town away from these local areas transportation to these places can sometimes be difficult or impossible. For people with transportation this can be easy, but without I can suggest sitting in your yard, finding some shade under a tree, sitting on a deck/porch, or visiting a friends house to study/do work together (if transportation is available). Even switching rooms if your really are unable to do these things can help you feel less confined, i.e. working in the kitchen, living room, bedroom, etc.",
              "author": "stephbisnette",
              "created": 1583976107,
              "upvotes": 15,
              "replies": {}
            }
          }
        },
        "fktzdxa": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fktzdxa/",
          "text": "If you don't have your books and need online access to eTextbooks, you can visit the VitalSource website for free access as part of their \"VitalSource Helps\" program. https://support.vitalsource.com/hc/en-us/categories/360003328673 includes guidance if you are a student, instructor or assistant.\n\nEdit: RedShelf is also providing free eTextbooks during this time as part of their \"RedShelf Responds\" program. \nhttps://www.about.redshelf.com/redshelfresponds",
          "author": "vicemagnet",
          "created": 1584538699,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fk98pir": {
      "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk98pir/",
      "text": "This is very sensible advice.\n\nIf I might add, as your professors send out information of software you need and instructions you need to follow, don't wait till the last minute to see if it works.\n\nDon't just read the instructions on your phone as if it was a text from a friend.",
      "author": "PersephoneIsNotHome",
      "created": 1583971016,
      "upvotes": 297,
      "replies": {
        "fkeo0y0": {
          "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkeo0y0/",
          "text": "This is the exact reason one of my professors was testing out Zoom to teach class yesterday. We all figured out how it worked so we world know how to use it when it was time for classes to start again without all the confusion.",
          "author": "_KittyInTheCity",
          "created": 1584117133,
          "upvotes": 12,
          "replies": {
            "fklgefi": {
              "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fklgefi/",
              "text": "Hey there,\nMy classes are going to be moving to Zoom very soon and I'm trying to figure out how to use it. My main question is do I have to pay for it. Because I was seeing $150 a month and I'm out of work because of this as well so I can't afford that",
              "author": "Silver-sp00n",
              "created": 1584305744,
              "upvotes": 3,
              "replies": {
                "fklihl2": {
                  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fklihl2/",
                  "text": "If your institution uses Zoom, you can use it for free through them",
                  "author": "_KittyInTheCity",
                  "created": 1584307004,
                  "upvotes": 6,
                  "replies": {}
                },
                "fkvpqu3": {
                  "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvpqu3/",
                  "text": "Ya, if the institution pays for Zoom, they'll send you a link to the online class. Just download the software and you'll be good to go.",
                  "author": "Robert_H_",
                  "created": 1584574158,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051798
}