{
  "sid": "qi0hhn",
  "link": "/r/college/comments/qi0hhn/tricks_for_studying_after_a_day_of_classes_and/",
  "title:": "Tricks for studying after a day of classes and practice.",
  "text": "Hello fellow students.\n\nI have been having trouble with energy and motivation to study At night. My schedule usually goes as follows: I have classes from the morning until 3 pm. Then, I eat, go to soccer practice, and after eating, bathing, and organizing everything, I start to study late, let's say 8 pm. By this time, I feel like I have no energy or concentration to do challenging work. It is not that I fall asleep, or I am unable to work, it is just that most homework and studies are hard. After all the events I have just mentioned, I feel burned out. I have tried coffee, Redbull, but, although they sometimes work, I do not want to depend on them. \n\nI would really appreciate it if any of you guys could share your tricks with me? and for all of those who are reading this post too. \n\nThank you. \n\nBendiciones.",
  "author": "szechuantrex21",
  "created": 1635467319,
  "updated": 1635779880,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "higfuoa": {
      "link": "/r/college/comments/qi0hhn/tricks_for_studying_after_a_day_of_classes_and/higfuoa/",
      "text": "Is it feasible for you to study before classes every day instead of at the end? \nIf so, I’d switch up the order. If not, can you study between classes? Or make flash cards, shortened notes, or other tools for a quick review before going to bed?\nHope this helps or gives ideas for other remedies!",
      "author": "OutdoorGlitter16",
      "created": 1635470086,
      "upvotes": 3,
      "replies": {}
    },
    "hij2c2p": {
      "link": "/r/college/comments/qi0hhn/tricks_for_studying_after_a_day_of_classes_and/hij2c2p/",
      "text": "How do you have classes from the morning until 3pm every day?",
      "author": "when-words-fail",
      "created": 1635524325,
      "upvotes": 1,
      "replies": {
        "hijl3qd": {
          "link": "/r/college/comments/qi0hhn/tricks_for_studying_after_a_day_of_classes_and/hijl3qd/",
          "text": "they are long and spread out. I have time between but not enough to get everything done.",
          "author": "szechuantrex21",
          "created": 1635531590,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiqh5ci": {
      "link": "/r/college/comments/qi0hhn/tricks_for_studying_after_a_day_of_classes_and/hiqh5ci/",
      "text": "When I studied, it was of great help to have frequent after-class-appointments with fellow students where we met and studied together, usually before some exam.\n\nHaving people around you who share the same goal -- learn stuff and ace that exam -- boosts motivation a lot.\n\n(Anecdotical evidence from personal experience, but maybe just give it a try. Profs even recommended this way to us, and it seemed to work out pretty well.)",
      "author": "QM_Engineer",
      "created": 1635660106,
      "upvotes": 1,
      "replies": {}
    }
  }
}