{
  "sid": "qapr6x",
  "link": "/r/college/comments/qapr6x/teacher_really_believes_in_me_but_im_really/",
  "title:": "Teacher really believes in me but I'm really struggling to live up to said expectation. How should I proceed?",
  "text": "So, I'm in a UX class, and I \"made the mistake\" I guess of doing really well in our assignments where we need to show examples of site pages that follow certain UX rules and why. I do have fun doing that, and my passion for UX showed. Teacher is always singing my praises there like \"You have all of this interesting stuf to say / have passion for this!\" (paraphrasing). But when it comes to our big midterm project, I didn't do so well.\n\nI am not actually, good at coming up with designs. Even if I'm sitting there copying a design and making tweaks to make it work better, I still apparently fail in the aesthetic department / failed to use a grid properly (I didn't use it, that's on me, couldn't see how you could make a design while adhering to a grid so I, didn't , that was my fault). But also, I still put a lot of time into the assignment (mostly due to my undiagnosed ADHD making it take longer for me to just get shit on paper (I'm not even distracted, my brain always feels tired from burnout through pushing myself to get work done despite undiagnosed until recently ADHD)). So yes, I can show I have good ideas and understanding, but fucking fail in the execution of my project due to being tired. Teacher was nice enough to offer me to \"fix\" my design and resubmit for a regrade, but with my other classes and this class moving on, I can't really afford to potentially double the time spent on this project, trying to readjust it to fit a grid.\n\n&#x200B;\n\nI'll hopefully be starting proper medication for what I'm dealing with, if not soon, by December. But how should I deal with this situation now? I don't feel right explaining my mental health issues to a teacher (because it's unprofessional) but due to said mental health issues, I'm fine with getting a C+ on my midterm as is, but a part of me, people pleaser feels bad letting my prof down, making him dissapointed.\n\nCould this impact the bias he has when grading my stuff in the future? What would you do in this situation? Do nothing or something else? Thank you.\n\n&#x200B;\n\nEDIT: Also there's the fact that I showed pat of my work to him, he said it looked like B+/A- work but then hits me with the C+ final grade, not telling me anything bout the grid, so take that as you willl.",
  "author": "StardustNyako",
  "created": 1634573196,
  "updated": 1634654749,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hh6gsbl": {
      "link": "/r/college/comments/qapr6x/teacher_really_believes_in_me_but_im_really/hh6gsbl/",
      "text": "Just talk to your teacher. He’s a human being too. You don’t have to explain your mental health. But you can say that you don’t know if you really have the time to fix it and stay on top of the current work so you’ll be okay with the grade as is. That is, if you’re committed to not fixing it.\n\nEqually, you could ask for an extension if you do want to fix it but don’t think you’ll have time by his deadline.\n\nThe prof might be a little disappointed. But it’s not going to effect his grading. Obviously he did not grant you a bias on your project, I doubt he actually grants you any significant bias when he grades but that he is just satisfied with your work most of the time.\n\nAlso, when he looked at your earlier work and said he thought you would receive x grade, he also assumed that it wasn’t the final product. He did not know whether you were going to add the grid after or not. If it’s in the instructions then maybe he thought you knew and had it handled. Next time, ask if you’re missing anything in addition to evaluating how it looks. Yeah it’s frustrating that he didn’t mention it, but now you know you need to fish for more answers next time.",
      "author": "milk1tea",
      "created": 1634605882,
      "upvotes": 1,
      "replies": {
        "hh6h2i4": {
          "link": "/r/college/comments/qapr6x/teacher_really_believes_in_me_but_im_really/hh6h2i4/",
          "text": "Thank you for this insight. Really reasonable",
          "author": "StardustNyako",
          "created": 1634606017,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}