{"sid": "puoa88", "link": "/r/college/comments/puoa88/is_my_professor_unreasonable_or_am_i_overreacting/", "title:": "Is my professor unreasonable or am I overreacting?", "text": "So I just started going back to college to get a degree in computer science at Bunker Hill Community College. This is my first semester taking intro to computer science, and my professor's \"teaching\" style is very lazy I think. Along with reading the C++ book, she has MOUNTAINS of handouts on a website that is very unorganized and she expects you to read all of that line by line. The way it is organized is very poor and riddled with hyperlinks that lead to other pages with hyperlinks that lead to other pages with hyperlinks and so on and so forth. There's no cohesion or flow. On that note, she's also one of those teachers who if you ask her a question she answers it by saying \"it's in the handout you should have read the handout.\" The handouts were not even available for us to view until the end of the add/drop period(should have been a red flag) Not to mention what should have another red flag was her syllabus was 43 pages long! We literally haven't even had any assignments yet because for the last 2 weeks we have been going over the syllabus. She also wants you to write the codes in a very very specific way, but will not show any examples of how she wants it done. She expects you to read her mind or something, and she doesn't do detailed corrections she just says what's wrong with no feedback on how to improve. She expects classmates to correct each other's work, a.k.a. do her job for her. Now I have been out of school for a little bit and this is my first time heading back, so IDK if this is expected. I had the opportunity to take this class online but I wanted to go in person so if I had questions I could get them answered, clarify things, you know learn lol. Had I known she would be like this, I would've just taken the class online. Being in class with her has honestly been a waste of time being scolded for being behind(when we didn't have access to the class matireral until last Wednesday, but that's our fault?). Am I being unreasonable or is this just a bad teacher?\n\nEdit: So I was able to email the head of the department and explained in detail like I did here what was going on. Luckily given the circumstances they were able to transfer me to a different class! This one is much more manageable and because i was at least reading the book I'm not behind at all, and the syllabus is only 13 pages long🤣. The lesson for me here is do a little better research on my professors. Ratemyprofessor is a must to know about. And a strongly worded \"karen\" email can really work wonders! 🤣.", "author": "southiest", "created": 1632503702, "retrieved": 1632800338, "over_18": false, "upvotes": 20, "upvote_ratio": 0.96, "comments": {"he4bry3": {"link": "/r/college/comments/puoa88/is_my_professor_unreasonable_or_am_i_overreacting/he4bry3/", "text": "One thing with computer science is, a good number of those who are decent at it go into the private sector. Almost nobody major in computer science think \"one day I'll teach students how to code in a community college\".\n\nPerhaps you'll have better luck at an actual university.", "author": "AcademicDifficulty", "created": 1632507103, "upvotes": 2}, "he45wot": {"link": "/r/college/comments/puoa88/is_my_professor_unreasonable_or_am_i_overreacting/he45wot/", "text": "Any one of those things alone really wouldn't be a big deal on its own, but when you put it all together it's clear that she just probably isn't good at her job. I think you have a right to be annoyed. I'm not sure there's much you can do about it though, because even though she sounds like a bad teacher, she's not so bad that anyone is going to give a crap about it. When they survey students about your professors, definitely write all of this down, because usually if students explain what a professor is doing badly professors will adjust for future semesters. Not that this will help you in your present situation, but it's still a valuable thing you can and should do. \n\nAlso, a 43 page syllabus? Wtf?", "author": "HumanDrinkingTea", "created": 1632504641, "upvotes": 12}, "he44j58": {"link": "/r/college/comments/puoa88/is_my_professor_unreasonable_or_am_i_overreacting/he44j58/", "text": "You can talk to her Dean and see what they say. \n\nOr you can form a study group or go to tutoring for help.", "author": "AceyAceyAcey", "created": 1632504062, "upvotes": 0}, "he4445v": {"link": "/r/college/comments/puoa88/is_my_professor_unreasonable_or_am_i_overreacting/he4445v/", "text": "I bet you can find her on r/professors complaining about students, and no you are not over reacting", "author": "Foxyboi_", "created": 1632503889, "upvotes": 4}}}