{"sid": "ht9wpj", "link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/", "title:": "Safety Tips for college women", "text": "I am reposting from a list made by girls at my school. \n\n1. Share location with good friends. I understand you don’t want your parents tracking you but it is a good idea for your friends to know where you are or your last location in the event you go missing or need help sent to you. If you have a date that night let someone know. \n\n2. Be very cautious when meeting anyone from online for the first time including tinder, bumble etc. when meeting someone for the first time meet them in public or in your housing. Do not go alone to a strangers house. You could be assaulted by the person your meeting or worse walk into a set up. \n\n3. Have your own alcohol (I would include drugs in this too) Do not take random drinks from anyone including other women. Bring your own alcohol to parties or stick to sealed beverages such as cans or drinks being served to everyone such as beer from a keg. Avoid any random concoctions. \n\n4. Drink among friends. Do not go out alone always have at least one friend with you. Be aware of each other’s where abouts throughout the party. \n\n5. Make sure everyone is accounted for. Everyone who came together leaves together. (I personally have seen this problem happen) While going out in a large group of friends may seem safer but it is not. The more girls, the easier it is to lose someone without realizing. If two girls go out they are unlikely to leave each other during the party and you would notice immediately if the only person you know is missing. In a group of friends it can be easy to lose someone because of diffusion of responsibly, everyone is talking to someone else, someone must know where she is mentality. It is easy to lose one girl when party or bar hopping throughout the night in a group. Keep track of your friends. \n\n6. Do not go to the bathroom alone. (I personally know of a girl who was followed into a bathroom and raped while at a house party) This one is more so for house parties than bars as bar bathrooms aren’t single stall so many women are in there at once also bar staff tends to keep an eye on bathrooms for all sorts of reasons. Bring a friend into the bathroom with you or at least to stand outside. It is very easy at a party for a predator to follow a girl into a bathroom and for bystanders to assume they are a couple looking for privacy. Never use a bathroom in a secluded part of the house alone.  If you are followed into a bathroom scream your head off for help. People will care I promise. \n\n7. Make sure your phone is charged before you go anywhere. You do not want to be in a situation where you are unable to call 911 or a friend or an Uber. Keep your phone on you as much as possible. \n\n8. Always have a healthy level of caution in a professional or educational setting. Meet professors before class instead of after. Schedule one on one meetings in less secluded places if the option is given to you. Such as meeting a tutor in a library instead of dorm room. Bring a friend along if the matter is not confidential when meeting a professor or other college staff member. \n\n9. Have a healthy level of caution among friends. Predators are stereotyped as strangers who hide in bushes but many sex crimes are committed by a person who knows the victim such as a friend of a friend, friends boyfriend or brother or even a friend themself. Be careful where you sleep. Always sleep in your own bed whenever possible. Do not sleep on a friends couch in a house with many people in the house. \nBe selective about who sleeps in your house as well. \n\n10. Just because someone attends the same school as you does not mean you “know them”. Many girls who would never dream going back to a strangers house think it’s safe to go back to the room or house of someone they just met simply because they are also a student at that school. This person is still a stranger. \n\n11. Other women are not always friends. (This one applies mostly to sex trafficking and abductions) Many girls are lured by other women into being victimized. Predators are often smart and realize women are much less suspicious of other women. Be wary of anyone who randomly approaches you with a “job offer” like modeling or photography. A random woman in social media trying to get you to meet her somewhere is another one. \n\n12. Stay away from the worst. In college do not let a little youthful rebellion or college partying make you think there is anything glamorous about a life of crime. You may feel invincible but you are not. There is a very big difference between college kids experimenting with drugs or making fake ids and being a career criminal. Practice good common sense. College aged women are very vulnerable to being manipulated into sex work by drug addict boyfriends or pimps. College is a time for taking risks and having fun but do not take it too far. \n\n13. Educate yourself on the signs and behaviors of an abusive boyfriend. This will allow you to educate yourself before potentially entering an abusive relationship that will ruin your college years.\n\n14. Do not go home with anyone you met that night. You can give your phone number and agree to meet another day. If you really want to see more of them that night bring them back to your housing. This will you to be in control of the situation and your safety. If they refuse to go to your housing instead of theirs that is a major read flag. Going home with a stranger after drinking leaves you vulnerable to many potential problems or high risk behaviors. Ranging from assault from the person you went home with or his roommates, to impulsive consensual unprotected sex.\n\n15. If you see something not right happening get involved. Be a friend to a girl who needs it. Do not let your school be a place where violence against women is tolerated.", "author": "blueeyedbeauty123", "created": 1595043120, "retrieved": 1632801787, "over_18": false, "upvotes": 1782, "upvote_ratio": 0.96, "comments": {"fzi19wb": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fzi19wb/", "text": "Commenting to save. Thanks for the tips!", "author": "fuji-fisticuffs", "created": 1595933469, "upvotes": 2}, "fyuuv3g": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyuuv3g/", "text": " [Select School Tutor](https://www.fruition.com.au/services/) for your child -  https://www.fruition.com.au/services/", "author": "fruitiontuition2", "created": 1595410382, "upvotes": 1}, "fyk9lke": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyk9lke/", "text": "Useful tips, thank you.", "author": "chicadesign", "created": 1595170478, "upvotes": 1}, "fyjlh70": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyjlh70/", "text": "Good list, but some of it is excessive.  Don't go to a bathroom alone? Bring a friend along when meeting with a professor?  Sorry, but that is ridiculous.  There's a difference between careful and paranoid.", "author": "cld8", "created": 1595149991, "upvotes": 1}, "fyioxc0": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyioxc0/", "text": "How the fuck can I find this useful if I have no friends or a body friend? Not to mention going to parties... next.", "author": null, "created": 1595123047, "upvotes": 1}, "fyif8wd": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyif8wd/", "text": "[removed]", "author": null, "created": 1595116828, "upvotes": 1}, "fyib69m": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyib69m/", "text": "Especially #8. I was sexually assaulted by a male professor. Don't automatically trust them, even if they seem super nice and friendly.", "author": "Alone_card", "created": 1595114360, "upvotes": 2}, "fyhqfzo": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyhqfzo/", "text": "thank you for this", "author": "s_lu_c", "created": 1595102608, "upvotes": 0}, "fyhqae1": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyhqae1/", "text": "The drunk thing is really important, in my experience we hear abt it a lot when we’re going into HS but then we don’t talk abt it that much in college, free alcohol is nice, but my freshman year I got roofied, it was terrifying. Luckily I had a good friend with me who kept an eye on me and took me back to my dorm, but I thought I was going to die, I had no control over my body, and not everyone will be so lucky to have a good friend. Please be careful, especially w jungle juice (also frat parties are way overhyped they suck, find a club that throws parties, at my school marching band is wild??? Those types of parties are usually safer and not as grody)", "author": "bitch-patrol", "created": 1595102519, "upvotes": 1}, "fyhmqj1": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyhmqj1/", "text": "This is something small to add, but also be smart about having safe sex! Many schools have on campus testing and access to free condom/lube/mouth dams/etc. Don’t let people pressure you into having sex without protection.", "author": "Taybae_xo", "created": 1595100529, "upvotes": 2}, "fyhaq6h": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyhaq6h/", "text": "Another two I would say is 1) set a curfew for yourself because the later into the night the more dangerous it can get 2) carry pepper spray or a small knife on you if you’re allowed.", "author": "bambiartistic", "created": 1595093989, "upvotes": 2}, "fyh9ayq": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh9ayq/", "text": "Carry a gun if your state allows it.  Sometimes even people who take every safety precaution possible end up in a bad situation.\n\nEdit: wanted to add that prevention of the sexual assault of you or another person is considered a valid reason to use lethal force in most states.  Always research your own state’s self defense laws.", "author": null, "created": 1595093206, "upvotes": 2}, "fyh7ehy": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh7ehy/", "text": "Good advice, except do NOT meet anyone for the first time at your housing. This can give stalkers easy access to all your information.", "author": "northphotograph", "created": 1595092162, "upvotes": 5}, "fyh6icj": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh6icj/", "text": "I would also add that date rape drugs are often carried in eye drop like bottles. Be very weary if you see someone messing around near a drink with \"eye drops\". Don't think you are immune to having your drink spiked because you're not having alcohol. There's nothing stopping a rapist from putting roofies in your orange juice. Typical date rape drugs aren't the only thing you have to watch out for. Sometimes, rapist will just add extra shots of vodka to your drink instead. \n\nBe carful about guy friends. It's ok to have them, but be careful about drinking around them, especially if you are the only woman present or if they've brought male friends you don't know well. \n\nBe extra careful if you have a family history of alcoholism. Especially if you already have issues with stuff like self control, overeating, video game, smartphone or porn additions, smoking or addictive, impulsive behavior. You might think it won't happen to you, but that just pride and arrogance talking. I have watched far too many people ruin their lives with alcohol. \n\nLastly, read up on situational awareness. It's very helpful in preventing bad stuff before it happens.", "author": "imgonnawingit", "created": 1595091668, "upvotes": 4}, "fyh59h0": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh59h0/", "text": "Frankly I wouldn’t want to take someone I just met to my dorm...", "author": "DerpyArtist", "created": 1595090977, "upvotes": 3}, "fyh4gs7": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh4gs7/", "text": "Don't do stupid things with stupid people at stupid times at stupid places.", "author": "TheeEmperor", "created": 1595090533, "upvotes": 6}, "fyh3492": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh3492/", "text": "Glad to know I'm a rapist for being a man in college.", "author": "GennaroIsGod", "created": 1595089795, "upvotes": -4}, "fyh2ux6": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh2ux6/", "text": "Also make sure to bring your own needles, spoons, and torches...", "author": "Nick_ThePrick_Diaz", "created": 1595089655, "upvotes": -4}, "fyh1fcw": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh1fcw/", "text": "get a few rubber doorstops to put under your apartment door / bedroom door / dorm door", "author": null, "created": 1595088864, "upvotes": 4}, "fyh0lwf": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyh0lwf/", "text": "A good way to avoid most of these is just not to go out and party. You go to college for an education not to learn how to shotgun beers.", "author": "Tamilan1999", "created": 1595088402, "upvotes": 5}, "fygztpn": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygztpn/", "text": "Dear college men, please don't rape women.", "author": "3rdtimeischarmy", "created": 1595087964, "upvotes": 18}, "fygu5k8": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygu5k8/", "text": "This is so helpful!!! Thank you SO MUCH.", "author": null, "created": 1595084666, "upvotes": 3}, "fygs3cu": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygs3cu/", "text": "Good tips.", "author": "Darren_NH", "created": 1595083426, "upvotes": 1}, "fygrb6a": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygrb6a/", "text": "See signs of an abusive girlfriend too. I know some friends who have had their gf take advantage of them.", "author": "emmathatsme123", "created": 1595082944, "upvotes": 0}, "fygrawa": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygrawa/", "text": "See signs of an abusive girlfriend too. I know some friends who have had their gf take advantage of them.", "author": "emmathatsme123", "created": 1595082940, "upvotes": 6}, "fygqehr": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygqehr/", "text": "College campuses are literally one of the safest places for women full stop.\n\nThis is like a beyond paranoia post. It's like the assumption all men are predators..I mean ffs most of these dudes are still pretty dumb.", "author": null, "created": 1595082376, "upvotes": -4}, "fygofbv": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygofbv/", "text": "These are great tips (for guys and gals) but I just wanted to add that if something does happen just remember it is not the fault of the survivor, it is always the fault of the perpetrator. So whether something happens to you or a friend, keep that in mind and don’t let self doubt or victim blaming stop you from getting help or helping someone else. These tips are done just to kinda keep everyone aware of the dangers out there but it doesn’t mean that the survivor of an assault is at fault if they didn’t follow these rules! So just keep that in mind. It’s always helpful to look up your college’s sexual assault resources, such as a title IX office, a women’s resource center, or counseling center, for yourself or in case you need to help a friend!", "author": "IncredibleCoo", "created": 1595081124, "upvotes": 14}, "fygodsy": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygodsy/", "text": "This is dystopian", "author": null, "created": 1595081098, "upvotes": -7}, "fygnrom": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygnrom/", "text": "#11 is scary", "author": "guyanese1997", "created": 1595080697, "upvotes": 1}, "fygn87m": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygn87m/", "text": "Honestly, these are pretty good universal rules. People can't be trusted. For 5, you really need somebody who is good at leading to be there and count every few blocks you go or it is very very easy to lose someone.", "author": "smartymarty1234", "created": 1595080335, "upvotes": 3}, "fygmboq": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygmboq/", "text": "[deleted]", "author": null, "created": 1595079732, "upvotes": 4}, "fyghn7s": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyghn7s/", "text": "Not a girl, but I also viewed this post.", "author": "Nullveer", "created": 1595076202, "upvotes": -3}, "fygfmk7": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygfmk7/", "text": "I would add to number 2, that when you're meeting someone new for the first time, yes meet in public, but don't meet somewhere you regularly frequent. Meaning - don't meet in a place where this person might hang around trying to bump into you again - like your fave coffee shop. Meet them somewhere a little bit out of your way that isn't a part of your normal routine.", "author": null, "created": 1595074466, "upvotes": 3}, "fygdq8t": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygdq8t/", "text": "Women... she doesn't have to be your friend! If you are going on a date with someone you don't know well, let a roommate or any woman that seems kind. I guarantee you, I don't need to be your friend to be happy to make sure you get to your location. \n\nIf you tell me that you don't know this person well, I will happily call you while you are on your date and pretend to make plans after your date or for the morning. \n\nWe can face time for a minute while you introduce your date to me (your good friend). This way they know your friend knows them and is expecting you. \n\nAbsolutely never worry about asking a fellow woman to look out for your safety.", "author": "NervousPraline", "created": 1595072717, "upvotes": 13}, "fygdpc4": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygdpc4/", "text": "You left off the most important thing you can do to protect yourself: Understand your own limits with alcohol.\n\nYour odds of being roofied are exceptionally low. Studies of patients admitted to hospitals claiming to have been roofied have found that the actual drug that got them feeling to messed up was, of course, alcohol.\n\nLots of people don't understand how alcohol works, what their tolerances are, how fast it can hit you, and how difficult it can be to keep track of your consumption (especially if party hopping).\n\nIf you don't want to get drugged at a party, the first person you can to watch is yourself.", "author": "bl1y", "created": 1595072693, "upvotes": 6}, "fygbcvq": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fygbcvq/", "text": "[deleted]", "author": null, "created": 1595070423, "upvotes": 0}, "fyg9uzz": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyg9uzz/", "text": "IDK I wouldn't want a stranger knowing my address either, public location at daytime seems like the best option.", "author": "AkwardlyAlive", "created": 1595068935, "upvotes": 5}, "fyg9q6k": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyg9q6k/", "text": "6 expanded be cautious at the school as well. Personally have gotten an alert that said someone was raped at noon in a school bathroom. Busy building and still happened. \n\nAnother tip if your in a city University and they have transportation options especially at night take those instead of waiting on a bus for example or taking a train. Do not walk alone as much as possible either sex. Also no earphones and texting especially at night. The more people you have the better when your walking. \n\n\nMy school is in the city so some of this may not apply.", "author": "ChangingChance", "created": 1595068788, "upvotes": 9}, "fyg73u7": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyg73u7/", "text": "This is really good info to see, but also just makes me so so sad. Its so upsetting we have to prep ourselves, and educate ourselves for a night out :(", "author": "BeanIsOnline", "created": 1595065893, "upvotes": 7}, "fyg4k2v": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyg4k2v/", "text": "Great tips but please don’t go out to bars... masks are great convo starters in A Dublin Donuts as well lol", "author": "TheJazmineRose", "created": 1595063057, "upvotes": 2}, "fyfzi5o": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfzi5o/", "text": "Hang out with your fellow girls!", "author": "HiddenInferno", "created": 1595057638, "upvotes": 2}, "fyfxlh1": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfxlh1/", "text": "Absolutely don’t let someone you just met take you friends home. Guy or girl. Always keep an eye on your friends, and be overly cautious of the situation. As a freshman in college my friend and I got drunk at a small party. We met up with a guy who was a mutual acquaintance. We were both tired, and when the guy offered to help get my drunk friend to bed, I let him. He ending up raping her. We later found out he had raped multiple girls on campus. The school knew but did nothing about it. I will never not regret not making sure she got home myself and for letting that guy around her. \n\nIt’s not embarrassing to get drunk at parties. It happens in college. But that is the time when most women get raped. When they’re drunk and out of it, and don’t really know what’s going on. So if you want to go out drinking, put as many plans in place as you can to protect yourself and your friends. Make a pack with your friends to not leave each other alone with a guy. Even guys you consider friends. Especially guys you consider friends. Don’t let them go home with someone they just met. Sometimes guys are drunk too, and aren’t aware that the girl they’re with isn’t conscious / able to consent. Do everything you can to prevent that situation. Rape and sexual assault in college is so so common, and I would give anything I could to prevent it from happening to more young women.", "author": "Snoo_11057", "created": 1595055709, "upvotes": 8}, "fyfvm0q": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfvm0q/", "text": "What about me", "author": "MinuteMadeLemonade2", "created": 1595053811, "upvotes": -16}, "fyfusuw": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfusuw/", "text": "Also if you feel unsafe walking somewhere, you can get the app Noonlight. You press on the button the entire time you're walking to your destination and if you let go of it and don't enter your PIN in the allotted time it will notify the authorities of your location and I believe it will also notify your emergency contacts if you set that up in the app.\n\nI honestly didn't use it too much this last year but it was still nice to have, since my dorm was pretty far from the central area of campus and there wasn't a lot of lighting.\n\nAnd look into if your school has any sort of free/discounted ride service! Mine had a student run service where they would pick you up and drop you off anywhere on/near campus for free from 9pm-2am. They also had a deal with Lyft for off campus housing.", "author": "idunnobroseph", "created": 1595053060, "upvotes": 20}, "fyfucxx": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfucxx/", "text": "Thank you for these tips!! I have taken some crazy ass risks as a college girl who parties and goes on Tinder dates and I constantly think about how lucky I am to be alive. I never even thought about #6 or #9 but it's so true that young women in particular should always exercise caution even around friends and use the buddy system when drinking and going out. I hope incoming freshmen read this and are smarter than I was.\n\nAnother tip: if you're going away to college in an area with high COVID-19 cases, the partying, meeting up with strangers, and packing into spaces with lots of unmasked people is NOT FUCKING WORTH IT. I know it's exciting to be on your own, maybe for the first time, but I promise you that you will have the rest of your late teens, 20s, and your life to make new friends and party! It's not worth having to be out sick during the education you're paying for, or bringing it home to roommates or parents and having to live with the guilt. You're gonna want to be healthy so you can have the rest of your life to have fun.", "author": "cosmicworm", "created": 1595052649, "upvotes": 19}, "fyftbes": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyftbes/", "text": "Another answer is to just not drink.... (for many of these points) I realize people think that everyone drinks in college but they absolutely do not. The best way to keep yourself safe is to stay sober. At the very least have a sober friend with you. You can party and go to clubs without alcohol. Other than that these tips are good for most people regardless of gender", "author": "kora_nika", "created": 1595051709, "upvotes": -10}, "fyfsxjq": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfsxjq/", "text": "so sorry for the girls that these kinds of posts are necessary, please stay safe!!", "author": null, "created": 1595051368, "upvotes": 27}, "fyfssoi": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfssoi/", "text": "To add to #3. (This should be obvious) but don’t leave your drink unattended. Even if you need to go to the bathroom, bring it with you!", "author": "18dwhyte", "created": 1595051249, "upvotes": 38}, "fyfskop": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfskop/", "text": "That's some excellent advice and stands true for boys too. Every student should exercise caution.", "author": "Mybaresoul", "created": 1595051056, "upvotes": 16}, "fyfscbr": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfscbr/", "text": "Some of the tips are a bit over the top... I'm a man, but my girlfriend follows maybe one or two of these and doesn't have a problem with predators", "author": "InverseLink", "created": 1595050859, "upvotes": -27}, "fyfrogv": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfrogv/", "text": "Optional: get yourself a self defense tool like a stun gun or pepper spray. Nowadays there are some that pretty discreet and compact!\nAlso learn a few self defense moves. Doesn’t hurt to know a few moves in case you ever find yourself in a tricky situation.\n\nEdit: I would to add that most if not all colleges have various safety phone lines. Add them in your contacts or see if college give them out onto a freebie item (ex: my university gave out these phone pockets that have a list of some safety hotlines)", "author": "jao812", "created": 1595050300, "upvotes": 63}, "fyfrn59": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfrn59/", "text": "I want to add about meeting someone from a dating app or website, just meet in public somewhere on campus. Whether it’s the local coffee shop or a park, it’s better than your housing because someone can still take advantage of you in that situation, especially if you are alone. It happened to someone on my campus last semester, they met someone online in their dorm room and were assaulted. Please stay safe.", "author": "bridgetbauhard", "created": 1595050270, "upvotes": 63}, "fyfrn4o": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfrn4o/", "text": "Not a girl, but thought I would also chime in on one key rule of thumb. \n\n\\-Trust your intuition. If something doesn't feel right with you, your location, and you feel you should get out...do it. Many times people go to a frame of mind thinking something can not or will not happen to them so they disregard that feeling in their stomach or the thought that passed their mind. It is best to listen to it and see why that feeling happened. This applies to men and women. \n\nGreat list, and one that should be given to every individual!", "author": "Chris_NYU", "created": 1595050270, "upvotes": 159}, "fyfrhcr": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfrhcr/", "text": "These tips apply to everyone(and for people of any gender. Females are heavily targeted, but not the only ones who suffer), but you've missed some good ones. Bring pepper spray or some kind of emergency alert system with you wherever you go. You can buy a high pitched alert keychain, pepper spray, and other similar items. If you're in a pinch and need to get somewhere, it gives you enough time to cause a distraction or some harm and find a safe spot. Plus, if you're out around others, loud noises will draw attention and can create a safer situation. \n\nAnother good tip is to learn some basic self defense tips. Weak points include groin(especially for males), eyes, and the back of the knee to take someone down easily. If you feel/are being threatened, deal enough damage to take down your predator. If you can't escape and you're caught in something worse, make marks to the best of your ability. Not only does it help leave physical evidence, but DNA can also be collected from fingernails and other small areas to help catch a criminal. \n\nThese things can happen to anyone, not just women and it isn't only caused by males! And remember, just because you're in public doesn't mean you're safe. Practice safety and caution wherever you go, especially in new areas, and follow general rules of safety and gut instinct when you go out.", "author": "vanessa857", "created": 1595050133, "upvotes": 16}, "fyfr20q": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfr20q/", "text": "You make it seem like women going to college are soldiers going to war.\n\nEdit: By the way you've got it backwards on 15. Society tolerates women when they abuse and become violent with men.", "author": null, "created": 1595049775, "upvotes": -26}, "fyfr1gi": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfr1gi/", "text": "Not a female, but make a specific phrase for your phone to start recording audio and/or track phone location and movement, and maybe also call the police or help. \n\nThis was something I found of recently being voice activable, but could be extremely useful and life-saving.\n\nHad a situation recently where a female student was being followed during holiday, when security was minimal. Student shared Apple ID with boyfriend and he was able to use find my phone (iPhone) to pick her up.\n\nEdit: My apologies for not linking articles on how to set these up.\n\nFor IOS, here is a good The Verge article on what to do: https://www.theverge.com/2020/6/17/21293996/siri-iphone-shortcut-pulled-over-police-starts-recording-video\n\n\nFor Android, this Reddit post shows how to set a similar shortcut using Google Home app: https://www.reddit.com/r/GooglePixel/comments/harhoy/hey_google_im_being_pulled_over/\nFor Android, a more in-depth guide: https://www.androidcentral.com/how-get-google-assistant-watch-your-back-if-you-get-pulled-over", "author": "iPiglet", "created": 1595049762, "upvotes": 208}, "fyfqwen": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfqwen/", "text": "I know you mean well, but we live in one of the safest places - and definitely the safest times - for women. College campuses are safer than the world outside them for women.\n\nYet young women today seem to be paranoid about victimization in a way their mothers and grandmothers weren't. I'm not sure that's a healthy approach to life.", "author": "ViskerRatio", "created": 1595049645, "upvotes": -39}, "fyfqmaq": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfqmaq/", "text": "Thank you for the tips. Stay Safe ❤️😊", "author": null, "created": 1595049410, "upvotes": 1}, "fyfpsmi": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfpsmi/", "text": "Number two should ideally be “Don’t be alone with a stranger period”. I don’t feel particularly safer if I am alone, even in the confines of my own home or apartment. \n\nAssaults can happen anywhere, and even innocuous gestures may be taken as an invitation to activities that one isn’t interested in.", "author": "CalmingVisionary", "created": 1595048738, "upvotes": 154}, "fyfpbjz": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfpbjz/", "text": "Am I the only one who thinks these tips should be for everyone and not just women exclusively..?", "author": "GennaroIsGod", "created": 1595048362, "upvotes": 13}, "fyfp929": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfp929/", "text": "\\*abusive boyfriend or girlfriend", "author": "GrendelNightmares", "created": 1595048307, "upvotes": 27}, "fyfp2iq": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfp2iq/", "text": "Another tip: Always bring a drink with you in a plastic bottle that you can close. (I always did a low sugar Gatorade with some liquor to keep me hydrated and hangover free.) Also, at a bar you can take a napkin and put a straw through it to cover your drink- you may think it looks dumb, but it is always better to be safe than sorry. Many girls have come up to me and told me it was such a great idea. \n\nStay safe, it is fucking ridiculous that girls need to do all this.", "author": "bad-and-bluecheese", "created": 1595048164, "upvotes": 64}, "fyfo9n4": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfo9n4/", "text": "[deleted]", "author": null, "created": 1595047546, "upvotes": 224}, "fyfn2od": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfn2od/", "text": "Another tip - **Do not be afraid** to reach out to campus security - their job is to protect the campus, faculty, staff and most importantly the students. If **anything** happens - you see something suspicious (Campus police are all over that shit (or should be anyways)) - report it and document it **immediately**.\n\nIf you are not comfortable talking to campus security - talk to a trusted professor. They will help you.\n\nAlso, if you're scared to go somewhere - your car, class, dorm etc. - ask campus security to escort you (Not sure if every campus offers this but it is worth asking - they should do it everywhere) or go with a friend.", "author": "BottledH2O", "created": 1595046658, "upvotes": 42}, "fyfk2j3": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfk2j3/", "text": "The way fall semester is looking #2 might be the only one applicable", "author": "blueeyedbeauty123", "created": 1595044492, "upvotes": 205}, "fyfipqb": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfipqb/", "text": "Great tips. Stay safe everyone ❤️", "author": "crystalliite", "created": 1595043560, "upvotes": 14}, "fyfin10": {"link": "/r/college/comments/ht9wpj/safety_tips_for_college_women/fyfin10/", "text": "[deleted]", "author": null, "created": 1595043510, "upvotes": 9}}}