{
  "sid": "pumk0e",
  "link": "/r/college/comments/pumk0e/feeling_pressured_to_go_into_stem_because_i_feel/",
  "title:": "feeling pressured to go into stem because i feel like it’s the only way i’ll make money",
  "text": "I can barely do math and science but i’m honestly debating majoring in stem because i don’t want to be poor. I genuinely thought political science and getting a job as an analyst would be easy making decent money but now i don’t think so. I don’t know what to do",
  "author": "reputaylena",
  "created": 1632498587,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "he44od6": {
      "link": "/r/college/comments/pumk0e/feeling_pressured_to_go_into_stem_because_i_feel/he44od6/",
      "text": "There are good paying jobs outside of those in STEM fields, especially in business and healthcare. \n\nPolitical science is not a particularly in-demand degree, so I don't think it's necessarily easy to find a political science analyst job right out of college unless you are attending a particularly prestigious college or have personal connections that will help you find an entry-level job.",
      "author": "clearwaterrev",
      "created": 1632504122,
      "upvotes": 1,
      "replies": {
        "he6pji9": {
          "link": "/r/college/comments/pumk0e/feeling_pressured_to_go_into_stem_because_i_feel/he6pji9/",
          "text": "Healthcare IS STEM",
          "author": "TragicalKingdom",
          "created": 1632546591,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "he3taaw": {
      "link": "/r/college/comments/pumk0e/feeling_pressured_to_go_into_stem_because_i_feel/he3taaw/",
      "text": "I'm a professional scientist, and I love my career in STEM.  However, I can absolutely assure you that you do not need a STEM degree or a STEM job to have a fulfilling career or make decent money.  There are thousands of jobs out there that have nothing to do with STEM, so if you're not actually interested in STEM subjects, then find a different path in life.  STEM material and STEM degrees are challenging on their own, but they'll be doubly challenging for someone who isn't really interested in the material.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1632499374,
      "upvotes": 3,
      "replies": {}
    },
    "he3szbz": {
      "link": "/r/college/comments/pumk0e/feeling_pressured_to_go_into_stem_because_i_feel/he3szbz/",
      "text": "You can actually make good money as an analyst for a political campaign. My roommate worked for a political campaign, and they always needed analysts and they get paid really well.",
      "author": "Missmaniequinn",
      "created": 1632499248,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634051947
}