{
  "sid": "9yycdr",
  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/",
  "title:": "Anyone else feel like things just aren’t the same when visiting home during breaks?",
  "text": "I remember last year I was so excited and a little homesick to fly back home and it just felt really good and comfortable being with my family. But this year\nit just sort of feels like I’m an outsider at times. My younger sibling is already getting ready for college and my parents are low key getting old which sort of makes me sad. Even little shit like moving random boxes in my old room or forgetting where the new spot where they put the car keys makes me feel strange. \n\nEven when i go to certain local spots I used to go to all the time, home in general, just feels like another place....i told my dad how i felt and he just said it’s part of growing up and finding yourself but idk how to feel rn lol. \n\n***edit*** : i didn’t know so people could relate lol. Thanks y’all...bless up 🙏",
  "author": "fuzzydunlop1234",
  "created": 1542761968,
  "over_18": false,
  "upvotes": 3005,
  "upvote_ratio": 0.95,
  "comments": {
    "efs2564": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/efs2564/",
      "text": "That’s sad as shit",
      "author": "schweenlad",
      "created": 1549345626,
      "upvotes": 1,
      "replies": {}
    },
    "ea8o9qx": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea8o9qx/",
      "text": "Just wait until you get into your 30s. The feeling is never going to go the other way.\n\nAs you form new relationships and new places become home to you, your childhood home becomes less and less of a home. \n\nIn the last 10 years or so mine has gone from a place where I wanted to go back for a week at a time, to a place to visit on the weekend, to a place that’s really best for a day trip.\n\nAs another poster said, you’ll feel this way about college eventually as well. What you think is nostalgia for a place is actually nostalgia for a place in time that you can never go back to. I’m not nostalgic for my college apartment, I’m nostalgic for the time I spent there with three close friends and my girlfriend in 2006.",
      "author": "thecw",
      "created": 1542902192,
      "upvotes": 2,
      "replies": {}
    },
    "ea7hpyg": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea7hpyg/",
      "text": "Yes it sucks. Went home almost every weekend my first semester of college because I hated my roomates lol, but the next year I rarely returned home and when I did I realized just how much I disliked it.\n\nMy good friends from home all went to another college, or are doing the same shit they always have and it just feels like I have no reason to spend time there anymore.",
      "author": "MollyMartian",
      "created": 1542855372,
      "upvotes": 1,
      "replies": {}
    },
    "ea75jo9": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea75jo9/",
      "text": "I'm a freshman in college. I'm home for Thanksgiving and already when I hear my parents talk I hear how much they sound like my grandparents. It's just making me sad now",
      "author": "yaissio",
      "created": 1542843584,
      "upvotes": 1,
      "replies": {}
    },
    "ea74pjt": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea74pjt/",
      "text": "Even worse when you're in the military and you come home excited to talk about your experiences and no one knows wtf you're talking about. No one can relate . Then suddenly you become the outsider completely uncomfortable being home.  Not what it use to be..",
      "author": "benditlikebecca",
      "created": 1542842789,
      "upvotes": 1,
      "replies": {}
    },
    "ea6zxs8": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6zxs8/",
      "text": "I would recommend not looking at the happy moments of the past in a way that frames the present or your potential future as undesirable.\n\nGood times in the past create happy memories that we can’t always return to, but today we can create new ones.",
      "author": "NicholasPW",
      "created": 1542838497,
      "upvotes": 6,
      "replies": {}
    },
    "ea6uoje": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6uoje/",
      "text": "My parents split pretty much right after I left for college so things have been weird and tense ever since :/ \nHard when you want to be there for them but home is so utterly different ",
      "author": "annoyed_koifish",
      "created": 1542834077,
      "upvotes": 1,
      "replies": {}
    },
    "ea6ul7t": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ul7t/",
      "text": "I (and most people) legit feel like being in college makes the relationship between you and your parents a lot stronger. \n\nEvery time I'm in college (or not home), I can talk to my parents for ages about literally nothing in particular over the phone. I get back home, and I'm immediately chewed out over every little thing I do or say. It's really weird, now that I think about it. ",
      "author": null,
      "created": 1542834001,
      "upvotes": 1,
      "replies": {}
    },
    "ea6qw4m": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6qw4m/",
      "text": "Going home makes me feel like my parents are hoarders.",
      "author": "Insanitychick",
      "created": 1542831037,
      "upvotes": 2,
      "replies": {}
    },
    "ea6oll6": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6oll6/",
      "text": "YES!!!",
      "author": "DBrickashaw12",
      "created": 1542829224,
      "upvotes": 1,
      "replies": {}
    },
    "ea6ku6l": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ku6l/",
      "text": "Your parents are moving on.  It hurts just as much on our end to keep holding on tightly.  It is a slow death of your child, turning into this adult, whom you don't really know.  You have secrets we will never be fully aware of and it is painful that we cannot help you or share things you might be keeping from us as embarrassing or deeply troubling.  You are growing old to us, too.",
      "author": null,
      "created": 1542826277,
      "upvotes": 3,
      "replies": {}
    },
    "ea6ku12": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ku12/",
      "text": "\"You can't truly go back to a place you once lived because so much will have changed since you left that it's not he same place\" -Thomas Wolfe (?)",
      "author": "egamerif",
      "created": 1542826273,
      "upvotes": 1,
      "replies": {}
    },
    "ea6i80e": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6i80e/",
      "text": "The day I moved to college my brother took over the room we shared. When I visited I had to sleep on the couch. Super felt like an outsider. ",
      "author": "Pongoid",
      "created": 1542824234,
      "upvotes": 1,
      "replies": {}
    },
    "ea6hkyo": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6hkyo/",
      "text": "The day I moved to college my brother took over the room we shared. When I visited I had to sleep on the couch. Super felt like an outsider. ",
      "author": "Pongoid",
      "created": 1542823740,
      "upvotes": 2,
      "replies": {}
    },
    "ea6fr44": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6fr44/",
      "text": "If you moved home then that feeling would subside.",
      "author": "jobdone01",
      "created": 1542822310,
      "upvotes": 1,
      "replies": {}
    },
    "ea6fec6": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6fec6/",
      "text": "It ia part of growing up, though i guess my experience is different from mab in that I grew up as a military brat, so the homes of my parents that I visit now are not the houses I grew up in.  Once you establish yourself and get your circle of friends, where you currently living becomes your home, rather than where you grew up.   This will probably become an even stronger feeling for you if you get married and settile down some where.",
      "author": "starfreeek",
      "created": 1542822030,
      "upvotes": 1,
      "replies": {}
    },
    "ea6ek32": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ek32/",
      "text": "Iv travelled alot for work. Iv seen most of the us. Many cities many hotel rooms and many faces. Its something you will come to terms with. I remember returning home to MY house and feeling distant from it. It wasn't cozy or a place for me to relax and spend time with my wife. It became another place o would visit for a while and leave. ",
      "author": "dfhsevd",
      "created": 1542821397,
      "upvotes": 1,
      "replies": {}
    },
    "ea6eciz": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6eciz/",
      "text": "Welcome to real life.  The only constant is change. ",
      "author": "tobizrg1991",
      "created": 1542821243,
      "upvotes": 1,
      "replies": {}
    },
    "ea6ecbp": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ecbp/",
      "text": "Yeah I’ve noticed that, it’s my senior year of college now. I think it’s the contrast. Before coming to school, your life revolves around you coming home to your parents and immediate family. Over the span of 3-4 years you’re away from all of that, so the few times you come home, you start to realize the change as if it happened abruptly. I just drove home last night from my university, and you can see this mall from the highway when I’m a few miles out from my neighborhood. They changed the sign that was visible to oncoming traffic, after it literally being there since the mall was built. It made me reflect like hell, all of a sudden with no warning this personal landmark of me being home was demolished and replaced with something new and a bit bizarre looking. We’re getting old, our family and friends are too. It’s just life lmao.",
      "author": "BearBlaq",
      "created": 1542821238,
      "upvotes": 1,
      "replies": {}
    },
    "ea6e3mx": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6e3mx/",
      "text": "It only gets worse (imo). ",
      "author": "longestboie",
      "created": 1542821057,
      "upvotes": 1,
      "replies": {}
    },
    "ea6dq6e": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6dq6e/",
      "text": "Hug your family. They will be the only constant amongst lots of change.",
      "author": "cabbage_morphs",
      "created": 1542820784,
      "upvotes": 1,
      "replies": {}
    },
    "ea6dnvg": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6dnvg/",
      "text": "Tbh I don’t feel this at all. My parents are getting older but they still go fucking hard with parties lol. I’m lucky af ",
      "author": null,
      "created": 1542820735,
      "upvotes": 1,
      "replies": {}
    },
    "ea6d88f": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6d88f/",
      "text": "Howdy, friend.\n\nI remember the first time I came back from college.  The shocking reality was that everyone had moved on with their lives without me.  When I lived at home I was central to all the plans and when I came back they were happy to have me, but everyone understood that I was just there for a little bit.  \n\nIt hurt.  It really hurt.  My cousin that I was really close to was now really close with my younger brother and they were out doing the stuff that we used to do.\n\nLife changes and the people there don't love you any less; they just had to move on with their lives too.\n\nThe only constant in life is that it changes.  Learn to embrace it and live life in the moment.  That's the best advice I have for you, bro or broette.",
      "author": "Nasty_Ned",
      "created": 1542820409,
      "upvotes": 1,
      "replies": {}
    },
    "ea6cxnr": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6cxnr/",
      "text": "Wait until after college, it gets worse (better? ).",
      "author": "MrBulldopes",
      "created": 1542820186,
      "upvotes": 1,
      "replies": {}
    },
    "ea6cxck": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6cxck/",
      "text": "Yeah, things change. Enjoy it while you can but keep looking forward. \nIn my case my family and almost all of my friends moved from my home town by the time I was in my teens. I still go back occasionally but can only see the houses I lived in and hung out in from the outside. At this point it's just a good reminder that I could have been stuck there. I'm glad left even though I liked it when I was there.",
      "author": "Hurrikraken",
      "created": 1542820179,
      "upvotes": 1,
      "replies": {}
    },
    "ea6cw2f": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6cw2f/",
      "text": "*nostalgia* - nostos (going home) + aganos (pain) \n\nNostalgia means the pain of going home. It happens to us all. \n\nUse it as a time to examine how you feel you've changed and then ask yourself if you're happy with those changes. Would 10 year old you look up to you? \n\n",
      "author": "1RedOne",
      "created": 1542820152,
      "upvotes": 1,
      "replies": {}
    },
    "ea6cpp1": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6cpp1/",
      "text": "You cant go home again",
      "author": "MicroDigitalAwaker",
      "created": 1542820015,
      "upvotes": 1,
      "replies": {}
    },
    "ea6cga6": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6cga6/",
      "text": "I also feel like that because the longer I stay away at a school, the more I am making that my new home.",
      "author": "titanvariable",
      "created": 1542819813,
      "upvotes": 1,
      "replies": {}
    },
    "ea6ccvl": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ccvl/",
      "text": "I feel you. I wish time stood still when going to college. You seem to miss out on so many things. I remember coming home one day to my parents house and they changed the silverware  drawer  and  the  type of bags they use. And I was like omg this place is changing! Lol  Those are little things, but it's the little things that make you realize you aren't there for. Just think of those holiday times as trying to catch up. To figure out exactly what you have missed. And I know it's hard to keep in contact with people because our lives can be so distracting and busy. But a phone call a week will keep that bond closer and help to feel less disconnected. Because a home isn't just a place, it's where your loved ones are. ",
      "author": "Toupees",
      "created": 1542819742,
      "upvotes": 1,
      "replies": {}
    },
    "ea6ccnr": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ccnr/",
      "text": "Ummmm... Yeah, when my room is disappeared, and a storage pop up in my house.",
      "author": null,
      "created": 1542819738,
      "upvotes": 1,
      "replies": {}
    },
    "ea6c8c3": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6c8c3/",
      "text": "Home is the only place I can relax and be myself because of how little the academic drive at my school is and how much I hate it there lol",
      "author": "HitchHikr",
      "created": 1542819648,
      "upvotes": 1,
      "replies": {}
    },
    "ea6c7lq": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6c7lq/",
      "text": "You can never really go home..",
      "author": "rj_macready1982",
      "created": 1542819632,
      "upvotes": 1,
      "replies": {}
    },
    "ea6c3n6": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6c3n6/",
      "text": "I’m not in collage yet, but i have the same feeling whenever i come back from a friend’s house. I feel like i did something wrong and I’m not accepted anymore. Like so much happened in the 14h i was away",
      "author": "imadethisaccforpewds",
      "created": 1542819547,
      "upvotes": 1,
      "replies": {}
    },
    "ea6c2vr": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6c2vr/",
      "text": "You start seeing things differently. Flaws of relatives and other ugly things in your hometown start to come up. Then you understand that your parents have lived with that for so long and you never noticed. ",
      "author": "_g550_",
      "created": 1542819530,
      "upvotes": 3,
      "replies": {}
    },
    "ea6c1m6": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6c1m6/",
      "text": "I feel this. I just got home for the first time for fall break and my parents painted my room and put a different blanket on my bed... I underestimated how much of a difference a single blanket could make but it doesn't feel like my room hahah",
      "author": "CUmaximus",
      "created": 1542819504,
      "upvotes": 3,
      "replies": {}
    },
    "ea6bzbw": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6bzbw/",
      "text": "I have learned to accept these feelings and I view it as \"wherever I am currently; that is home\"",
      "author": "beanBea",
      "created": 1542819454,
      "upvotes": 3,
      "replies": {}
    },
    "ea6bqlp": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6bqlp/",
      "text": "Time doesn't stop back home when you leave, so you'll have to adjust and live with the fact that you've missed moments back home. I learned this when I came home from my first deployment.",
      "author": "Zapablast05",
      "created": 1542819267,
      "upvotes": 1,
      "replies": {}
    },
    "ea6bqlb": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6bqlb/",
      "text": "It's normal. Life usually changes in slow increments. It's hard to notice until you're gone for a while. Those spots you used to hang out aren't usually going to overnight change clientele. It's more like, the first time you went back, maybe a few regulars aren't there like they used to, but enough are there so it still feels familiar. Then another year goes by and the rest of the people you know have moved on. It took two years to happen, but because you weren't there, the change seems drastic. Also, if you hadn't left town and kept going to that place, you'd have just befriended the new regulars and it would still feel comfortable.\n\nAlso something you'll notice at your age is, you are still evolving as a person. You'll start to find that when you spend time with people from an earlier era, you'll kind of slip back into your old persona when you're with them. Part of it is that our roles change depending on the social situation anyway, and part of it is, people are really resistant to their friends changing and unintentionally force you into your old role.",
      "author": "Adrenalchrome",
      "created": 1542819267,
      "upvotes": 1,
      "replies": {}
    },
    "ea6b4wh": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6b4wh/",
      "text": "I just visited my old college campus, which was not in the city that I grew up in. I graduated 10 years ago and moved back home until I had the opportunity to go back while traveling. \n\n&#x200B;\n\nI was simply blown away by all the memories that came back, but at the same time... everything was different and it was no longer my home. \n\n&#x200B;\n\nThe good news is that the more you visit home the more it will transition to a new reality of not being your home, but your home away from home. Also, your parents will love you for visiting. ",
      "author": "Ahahaha__10",
      "created": 1542818835,
      "upvotes": 1,
      "replies": {}
    },
    "ea6am3t": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6am3t/",
      "text": "You should play a Night in the Woods. The main character struggles with this feeling too. It puts into words very nicely the feeling of life moving on and leaving the comfort of childhood behind. ",
      "author": "NaveTVG",
      "created": 1542818448,
      "upvotes": 1,
      "replies": {}
    },
    "ea6aioh": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6aioh/",
      "text": "Honestly, I’m just kinda realizing how boring home is and how much I hate my friends from hiighschool. They’re still in high school too, so I can’t help but feel like I’ve just moved past them. I’m just bored and missing my girlfriend, I can’t wait for break to end. ",
      "author": "Sir_Tandeath",
      "created": 1542818378,
      "upvotes": 1,
      "replies": {}
    },
    "ea6ahyb": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ahyb/",
      "text": "There's an old saying, \"you can't go home again.\"",
      "author": "deIIort",
      "created": 1542818364,
      "upvotes": 1,
      "replies": {}
    },
    "ea69g4o": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea69g4o/",
      "text": "Just wait until you're out of college and your parents get rid of your bedroom, then it's really weird.",
      "author": "Equipoisonous",
      "created": 1542817581,
      "upvotes": 1,
      "replies": {}
    },
    "ea698sn": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea698sn/",
      "text": "They took over my room lol. And I don't know where everything is it feels so weird ",
      "author": "Sam_567",
      "created": 1542817425,
      "upvotes": 1,
      "replies": {}
    },
    "ea6984r": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6984r/",
      "text": "You will probably feel this way for the rest of your life when you visit places that you once lived: your parents house, your first college dorm, your first appartment, your first house, etc.\n\nPlaces and people seem change rapidly when you are absent, but while you are there everyday it feels like nothing changes. Home will feel more and more different until you realize it's not really your home anymore, or your room, it's your parents. But by that time, you'll have your own place (dorm, rented with friends, etc) that will become home. Eventually, I came to realize that home is where you spend your time the most and where you feel loved. And that you can make your home anywhere you choose. Things will never be the same, but that's life. It's all part of that beautiful, melancholic transition into full on adulthood.",
      "author": "M0thM0nst3r",
      "created": 1542817411,
      "upvotes": 3,
      "replies": {}
    },
    "ea68ycu": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea68ycu/",
      "text": "My street in my college town has been empty since Friday night with people going home. My fiance and I are planning to drive to our hometown after work tonight. I know people have different relationships with their families, but our little apartment with the dog and the cat are truly what I consider home, and I hate having to drive 2 hours to my mothers house and deal with all the holiday nonsense. I just dont get people that are so ready to get back home that quickly.",
      "author": "soggybutter",
      "created": 1542817200,
      "upvotes": 1,
      "replies": {}
    },
    "ea68o9g": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea68o9g/",
      "text": "Everything does feel extremely different coming back from college.",
      "author": "CLTalbot",
      "created": 1542816993,
      "upvotes": 1,
      "replies": {}
    },
    "ea68k0y": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea68k0y/",
      "text": "As Thomas Wolffe said, \"You can't go home again.\" The place is there but *you* have changed, even if the people around you have not. Give it time. What's really wierd is going back when you're quite a bit older and no longer know anyone in town...say for a 25th high school reunion, as an example. When I did that it was very strange to see all the homes I had been in as a child/teen, and all the places with very intense memories, but to know that I could never step inside them again, that nobody there knew or cared who I was, and that all the people I had once associated with the place (like my high school) had moved on. You can never go home again, but you can always make a *new* home somewhere else.",
      "author": "SnowblindAlbino",
      "created": 1542816908,
      "upvotes": 1,
      "replies": {}
    },
    "ea68djl": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea68djl/",
      "text": "I lived at home all 4 years of college as I went to a school 20 minutes away from my parents house. I recently moved into my first apartment, for sure it feels like that. Going back and things are in different places, the *smell* is different than you remember, little things like cutlery is in a different spot than you're used to. I get it.",
      "author": null,
      "created": 1542816773,
      "upvotes": 1,
      "replies": {}
    },
    "ea685ts": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea685ts/",
      "text": "You can't go home again, kid. ",
      "author": null,
      "created": 1542816614,
      "upvotes": 1,
      "replies": {}
    },
    "ea67h5s": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea67h5s/",
      "text": "Yes, and it's perfectly normal.   I'm 51 and remember feeling this way when I came home from school. I'm also conscience of this from the parent's perspective now and empathetic for how my child feels when she comes home. BTW, it's weird for the parents too, having someone else in the house disrupting the (new) routine so try to be aware of that while you're home. ",
      "author": "Stackfault67",
      "created": 1542816116,
      "upvotes": 1,
      "replies": {}
    },
    "ea66swg": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea66swg/",
      "text": "Why wouldn’t it feel different?  I ask this kindly.  College is so hugely transformative. You are the different one this time. It’s supposed to feel different. Also, thank you for saying what many others identify with here. ",
      "author": "StaceysDad",
      "created": 1542815622,
      "upvotes": 1,
      "replies": {}
    },
    "ea66qe1": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea66qe1/",
      "text": "Oh boy. If you’re having these feeling now wait for your 30s. I’m getting all those feels. ",
      "author": "RedditorNo3837475839",
      "created": 1542815570,
      "upvotes": 1,
      "replies": {}
    },
    "ea66nf3": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea66nf3/",
      "text": "This was over 20 years ago, but the memory stuck with me. The first time I came home from school, I was struck by just how *poor* my town was. How many pairs of sneakers were hanging from power lines. How run down it was.\n\nI'd never seen it with eyes that knew any different. It was wildly disorienting.\n\nIt will fade, in time. Keep moving, keep seeing the world, keep growing. You'll change as much as the places you visit do.\n\nBe well!",
      "author": null,
      "created": 1542815509,
      "upvotes": 4,
      "replies": {}
    },
    "ea66lm4": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea66lm4/",
      "text": "Welcome to adulting, kid.  It's not ever going to be the same. Sadly, I know this from my own experience.   Try and enjoy the changes. ",
      "author": "TNEngineer",
      "created": 1542815473,
      "upvotes": 1,
      "replies": {}
    },
    "ea66l2n": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea66l2n/",
      "text": "I went into the Navy out of high school and didn't get many opportunities to go home. First time back was three years in, I felt like a total stranger.",
      "author": "netvor0",
      "created": 1542815461,
      "upvotes": 1,
      "replies": {}
    },
    "ea66gqw": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea66gqw/",
      "text": "Ya you have freedom now, sometimes you don’t realize how independent you’ve become. Now “home is where you make it”... ",
      "author": "manchuriancanidate",
      "created": 1542815373,
      "upvotes": 1,
      "replies": {}
    },
    "ea662q6": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea662q6/",
      "text": "The worst is when they stop buying all the food you like. You practically starve to death on visits",
      "author": "Jakob_the_Great",
      "created": 1542815070,
      "upvotes": 1,
      "replies": {}
    },
    "ea65t0j": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea65t0j/",
      "text": "Home is where you spend your downtime, and nuclear family is who you spend your down time with.\n\nUsually, the rift begins forming in you mid teens.\n\nIf you want the distance to stay small, then you have to spend more time with them.\n\nIf you cannot make that happen, then you have to accept that your real wishes are for something else.  School, work, life events, even wanderlust fit in here.\n\nIt’s all normal, and the tug at your heart strings is a reminder of the closeness in the past.\n\nThere will be many other such pulls and realizations.  Grown ups don’t tell you all of it because a lot of it is about change or loss.  Most friends from high school will drift away.  Same with college friends.  \n\nOne day, you meet someone, and whoa, they went to your school.  “Wait, Dave?  Holy cow, I didn’t even recognize you.”\n\nBut, you’ll accumulate a few really close friends who are part of your forever family.  You’ll have new fun times, challenges, and maybe make your own family.  You’ll re-make friendships, and you’ll have solid friends you see once a decade, and it’s like you never missed a beat.\n\nAnyway, rambly.  My eldest son is a Senior in HS, with friends in college.  We’re going through the transition for him and remembering how it was for us.\n\nI promise you, it is 100 times more intense for your parents.  Give them an extra hug every day.  A written letter telling about what this year has been like for you and how you miss them, etc.  Get photos with the family, and print one out for them and for you.",
      "author": "xaminmo",
      "created": 1542814860,
      "upvotes": 6,
      "replies": {}
    },
    "ea65rc0": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea65rc0/",
      "text": "The world that you used to be a part of is still moving but you're not moving with it, you're just visiting.",
      "author": "mobiusdisco",
      "created": 1542814822,
      "upvotes": 1,
      "replies": {}
    },
    "ea65q01": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea65q01/",
      "text": "So I am not sure what year you are in school, but I am senior, I remember my freshman and sophomore year I didn’t want to go home. I had a new home full of new friends and “family”. Then I remember junior year I was like huh I kinda miss home, it would be nice to go back. Now as a senior I long for breaks so I can hangout with my family, I also know this is the last time for a long time we probably will live in the same state so it could be unique ",
      "author": "mickeyf47",
      "created": 1542814790,
      "upvotes": 1,
      "replies": {}
    },
    "ea64zt2": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64zt2/",
      "text": "I feel this hardcore, mostly because my parents moved so I can't actually go back to my old home or be in my old room. Its just so strange knowing I will never be able to be in that room ever again after spending a decade and a half in it.",
      "author": "KobaldJ",
      "created": 1542814188,
      "upvotes": 1,
      "replies": {}
    },
    "ea64rql": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64rql/",
      "text": "Here's the book version:\n\nhttps://en.wikipedia.org/wiki/Look_Homeward,_Angel",
      "author": "podkayne3000",
      "created": 1542814004,
      "upvotes": 1,
      "replies": {
        "ea64s4y": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64s4y/",
          "text": "Look Homeward, Angel: A Story of the Buried Life is a 1929 novel by Thomas Wolfe. It is Wolfe's first novel, and is considered a highly autobiographical American coming-of-age story. The character of Eugene Gant is generally believed to be a depiction of Wolfe himself. The novel covers the span of time from Eugene's birth to the age of 19. The setting is the fictional town and state of Altamont, Catawba, a fictionalization of his home town, Asheville, North Carolina. Playwright Ketti Frings wrote a theatrical adaptation of Wolfe's work in a 1957 play of the same title.",
          "author": "FunCicada",
          "created": 1542814012,
          "upvotes": 2,
          "replies": {
            "ea6jllr": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6jllr/",
              "text": "Another (very simplistic) way to look at it is that it's about a guy from a small town who goes to the University of North Carolina, comes back home, and is totally shocked by how strange everything he seems when he comes back.",
              "author": "podkayne3000",
              "created": 1542825306,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ea64r9v": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64r9v/",
      "text": "For people that grow up in the same household, you spend 18 years in the same place. Most people don't reach that same level of familiarity with a place until they are *at least* 36. If you only go to undergrad, move that to 40. Grad school, move that to 45. And that's assuming your career allows you to hold down a position in the same place for a long period of time.\n\nMy parents sold my childhood home shortly after I finished undergrad. The trick is to make home a state of mind, rather than a physical location. It's easier if you find a partner.",
      "author": "NarcyPurpleKitty",
      "created": 1542813993,
      "upvotes": 1,
      "replies": {}
    },
    "ea64owk": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64owk/",
      "text": "Home hasn't changed, well your family is aging but they are still the same. You have changed. You're seeing those old spots with new eyes that have seen much more now. Going off to college marks the start of huge internal changes. 18-21 are big growth years and time itself will seem to speed up at some point during those years.",
      "author": "Docster87",
      "created": 1542813937,
      "upvotes": 1,
      "replies": {}
    },
    "ea64ian": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64ian/",
      "text": "Never felt like I had a home really, moved out a bit after high school and decided not to go to university and for the last couple years just been moving around a lot trying to get by. Never bin home since and don't ever really want to or ever go for holidays or anything like that. I'm considering going to University now but  one reason I'm postponing is I really want to pick a city that I can make my home. Since I will never go back to where I'm from I'll need to make the best decision with where I go to university. Feeling like you have nowhere to go and no familiarity with anything can really suck sometimes.\n\nThis also made me think I will have to go to a university were a lot of students are local, I don't want to make friendships and then everyone goes home away from the city the school is in for holidays or people leaving after they graduate.",
      "author": "repozez",
      "created": 1542813783,
      "upvotes": 1,
      "replies": {}
    },
    "ea64fqv": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64fqv/",
      "text": "GAYYYYYYY grow up, your fam isn’t around forever, appreciate this time with them",
      "author": null,
      "created": 1542813725,
      "upvotes": 0,
      "replies": {}
    },
    "ea64d6g": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64d6g/",
      "text": "I agree with your dad completely. I feel like you are just dealing with the nostalgia that comes along with growing older.\n\nPlaces go from spots you hang out to spots you “used to” hang out at.\n\nPeople go from being your immediate friend circle to what “used to” be your friend circle.\n\nEven with family it happens even though I’m sure you stay in contact with them.\n\nI think a big part of it is when you grow up somewhere, it feels like nothing ever changes. When in reality it does, just slowly. So when you go away for awhile and then come back it’s really sobering to see that what used to be your whole world is moving on and progressing even when you aren’t there.\n\nLove the post and get ready for most nostalgia, gets to be more often every year in my experience.",
      "author": "SpecialSauce92",
      "created": 1542813667,
      "upvotes": 1,
      "replies": {}
    },
    "ea63ml5": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea63ml5/",
      "text": "The only thing constant in life is change.",
      "author": "sanjuhunk",
      "created": 1542813050,
      "upvotes": 1,
      "replies": {}
    },
    "ea63csg": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea63csg/",
      "text": "Your Dad is right. \n\nYou’ve entered a new phase in your life. You’ve moved out and now live without your parents for the first time in your life. It’s not your home anymore. \n\nLikewise your parents, who raised you for 18 years, have seen you move out and it’s a major change for them. \n\nIf you want to make sense of it all find your former HS classmates that are still living at home, not working, and not going to school. You’ll see the people who aren’t mature enough to venture into the world and find their own way. It will make more sense to you and you’ll wonder how the hell they can still live at home. \n\nThen wait 20 years when you’re a full fledged adult and some of those people are still in the same situation. Then you’ll truly understand how at this time you’ve left your comfort zone and it’s for the best. ",
      "author": "-mostlyharmless1",
      "created": 1542812817,
      "upvotes": 1,
      "replies": {}
    },
    "ea627vw": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea627vw/",
      "text": "Nowadays I miss family, but I'd rather be at home with my dog most of the time. I can finally say I have a life of my own rather than it just being family. ",
      "author": "knodel12",
      "created": 1542811846,
      "upvotes": 1,
      "replies": {}
    },
    "ea627ks": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea627ks/",
      "text": "My parents are divorcing and I only go hole to take care of the animals when my mom and sister had to be somewhere. Not very fun, even before things got messy as they wanted me there but then ignored me",
      "author": "Assaucein",
      "created": 1542811838,
      "upvotes": 1,
      "replies": {}
    },
    "ea61nzg": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea61nzg/",
      "text": "When you are in a place for a long time, you don't notice gradual changes nearly as much as when you leave, miss a whole bunch of them, and then come back.  It can be jarring, and can lead to questions about \"where do I really want to be for the rest of my life\", and understanding the consequences of that kind of choice.",
      "author": "arvy_p",
      "created": 1542811361,
      "upvotes": 1,
      "replies": {}
    },
    "ea61di0": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea61di0/",
      "text": "“Well I guess this is growing up - da na na, da na na, da na na.”",
      "author": "tonygenius",
      "created": 1542811103,
      "upvotes": 1,
      "replies": {}
    },
    "ea60vyd": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea60vyd/",
      "text": "Yes.  I’m a guest in my own home and I don’t live in my tiny hometown.  But to be fair, I’ve got three factors to exacerbate that issue. \n\n1. My parents and I moved into a new house the summer before I started college, albeit my grandmother’s old house but still not the house I grew up in. I lived in ‘my room’ for 6 weeks before I left for college.  \n\n2. A family member recently moved into my parents’ house and into my largely unused bedroom to pursue education for a year locally. So when I come home, I don’t stay in my room. (For the record, they did ask me and I said yes) \n\n3. I moved in with my SO now fiancé in 2016 and we’ve made more of a home there.   Home is where he is. Which is usually not my parents’. ",
      "author": "Baker221",
      "created": 1542810668,
      "upvotes": 1,
      "replies": {}
    },
    "ea60rau": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea60rau/",
      "text": "Idk I've always felt that time just makes you bolder and even though the children get older, I've gotten older too. I think sometimes I'm afraid of changing but that's mostly because I've built my life around someone else now.\n\n\n",
      "author": "jamarsh2015",
      "created": 1542810552,
      "upvotes": 5,
      "replies": {}
    },
    "ea60pru": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea60pru/",
      "text": "I remember that. It happened when I moved out of my parent's house when I was 19. Every time I came by, I felt like a stranger. Spots that used to bring me joy as a teen are just another space that is no different than another. You'll eventually get used to it and learn to cherish the memories and feelings you had. Cheers!",
      "author": "Spider4Hire",
      "created": 1542810515,
      "upvotes": 1,
      "replies": {}
    },
    "ea60n80": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea60n80/",
      "text": "Home is where you built your memories. As you spend more time building new memories elsewhere, you start to realise that your memories of home are frozen in time and you aren't going to be making new ones there anymore.",
      "author": null,
      "created": 1542810448,
      "upvotes": 1,
      "replies": {}
    },
    "ea60f8w": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea60f8w/",
      "text": "You can never go back\n",
      "author": "dumbcomputerguy",
      "created": 1542810249,
      "upvotes": 1,
      "replies": {}
    },
    "ea608cj": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea608cj/",
      "text": "My mom got married and moved to a new city two hours from where I was born and raised when I went to college. The marriage was unexpected and it was really strange not being able to go to my childhood home anymore. It made me quite depressed for a while.",
      "author": null,
      "created": 1542810073,
      "upvotes": 1,
      "replies": {}
    },
    "ea5zcj9": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5zcj9/",
      "text": "My parents just renovated our kitchen which was definitely needed but I can't help but feel like \"Fuck, I'll never again get the time to have the same familiarity with this kitchen than the last\"\n\nI think for me that's what it all boils down to.\nChange is fine but my inability to become as familiar with that new thing or process as I was before is what differentiates going 'home' and going to the place where you grew up.\n\nNo matter how change is just a part of living and you should never expect your home to be some sort of museum memorial to your memories it still totally fucking sucks sometimes.",
      "author": "Aranthos-Faroth",
      "created": 1542809241,
      "upvotes": 1,
      "replies": {}
    },
    "ea5z5wm": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5z5wm/",
      "text": "It's cool that you can talk to your dad about it. He's right too. It's part of life. People move, things change, and loved ones pass away. It's OK though! It's up to you to define your life. All these changes open up a new world of experiences. Change doesn't always mean for the worst...it can just be different.",
      "author": "Booty_Poppin",
      "created": 1542809063,
      "upvotes": 1,
      "replies": {}
    },
    "ea5ywmw": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ywmw/",
      "text": "“You can never go home again”",
      "author": null,
      "created": 1542808809,
      "upvotes": 2,
      "replies": {}
    },
    "ea5ya8c": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ya8c/",
      "text": "I have a bit of a different take, I'm older now but went to college when I was 17.  Living in the dorm for a month or so.  Came back for a weekend (Ann Arbor is only 45-60 minutes away depending on construction), came home at like 1am after partying with friends.  \n\nThe next day my mom tried to tell me my curfew hasn't changed.  I said, haha, at school sometimes I stay out all night.  Well here, you come home at midnight.  I said, OK fine then, I guess I won't be coming home on weekends.  She apparently never thought of that, and it shook her, and she said you're right, be safe, you're on your own at school so just be reasonable when your home.",
      "author": "fizgigtiznalkie",
      "created": 1542808194,
      "upvotes": 1,
      "replies": {}
    },
    "ea5xunn": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5xunn/",
      "text": "You can't step in the same river twice.",
      "author": "kleosnostos",
      "created": 1542807749,
      "upvotes": 3,
      "replies": {}
    },
    "ea5xkdy": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5xkdy/",
      "text": "Life, my friend, life. I'm 28 and I've lived out of my home town for the better part of 7 years and everytime I visit it gets more lonely. People have lives too just like you and separation causes you to have all these experiences you don't share with friends and family back home. It's just a part of life and like all the rest of it you just get used to it. Call them more to stay in touch, tell them you love them, that's about all you can do.",
      "author": "nollie_shuv",
      "created": 1542807458,
      "upvotes": 1,
      "replies": {}
    },
    "ea5wd4q": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5wd4q/",
      "text": "Yep. The first time I moved out for college five years ago and then came home for the holiday breaks my hometown friendships went downhill. It's the circle of life.\n\nI only visit family and shop at Wal-Mart at home every other weekend. lol",
      "author": "DammieIsAwesome",
      "created": 1542806165,
      "upvotes": 1,
      "replies": {}
    },
    "ea5wbpb": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5wbpb/",
      "text": "This is the first year since I left in ‘08 that I’m staying away for thanksgiving. I was raised to believe every year would be the same. So much has changed that to be a part of it is more stressful and emotional than I can stand.  ",
      "author": "chevalienne",
      "created": 1542806118,
      "upvotes": 0,
      "replies": {}
    },
    "ea5w95w": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5w95w/",
      "text": "There is a reason for the famous saying (book title): You can't go home again.",
      "author": "spicylongjohns",
      "created": 1542806031,
      "upvotes": 1,
      "replies": {}
    },
    "ea5w89x": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5w89x/",
      "text": "“You can’t go home again” Thomas Wolfe. It’s not that you can’t physically go back, but it’s not home anymore. It’s like...visiting a river. You can go to the same riverbank, but the water flowing past is not the same as before. ",
      "author": "women-seem-wicked",
      "created": 1542806001,
      "upvotes": 9,
      "replies": {
        "ea64vfy": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea64vfy/",
          "text": "I posted the link to the Wikipedia article about \"Look Homeward, Angel\" before I saw this post. Wolfe is definitely a good source on this subject.",
          "author": "podkayne3000",
          "created": 1542814088,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ea5w0or": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5w0or/",
      "text": "I failed out of college in 8 months or so, so nah, it wasnt all that different. ",
      "author": "RegretKills0",
      "created": 1542805748,
      "upvotes": 2,
      "replies": {}
    },
    "ea5vfde": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5vfde/",
      "text": "Blues Traveler has a great song about exactly this called Back In The Day. Give it a listen sometime. You’re definitely not alone in feeling like this. ",
      "author": "Hertzagobeanja",
      "created": 1542804989,
      "upvotes": 3,
      "replies": {}
    },
    "ea5uxpc": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5uxpc/",
      "text": "It's called growing up.",
      "author": "Mononym_Music",
      "created": 1542804326,
      "upvotes": 1,
      "replies": {}
    },
    "ea5uc9k": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5uc9k/",
      "text": "You can go back to a time and you can go back to a place but you can not go back to a time and a place.",
      "author": "DadJokesAndMore",
      "created": 1542803493,
      "upvotes": 3,
      "replies": {}
    },
    "ea5u1a6": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5u1a6/",
      "text": "Totally normal. Not college for me but the Marine Corps instead. This affected me so much that I very rarely travel back to my hometown although bad family relationships caused that as well. It's totally normal and will most likely go away if you move back home after college. ",
      "author": "WarheadOnForehead",
      "created": 1542803039,
      "upvotes": 1,
      "replies": {}
    },
    "ea5tvvi": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5tvvi/",
      "text": "Yep. You're definitely not alone OP, I relate to this so much :( ",
      "author": "PotatoRL",
      "created": 1542802808,
      "upvotes": 1,
      "replies": {}
    },
    "ea5t5dw": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5t5dw/",
      "text": "YES. Especially true when you live in a different country and go back “home” for vacation. Everything is different.. \n\nIt’s like you don’t know where you belong anymore 🙂",
      "author": "amiweirdorryou",
      "created": 1542801653,
      "upvotes": 2,
      "replies": {}
    },
    "ea5sj3i": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5sj3i/",
      "text": "I went home for Christmas last year and never felt so uncomfortable, like in a way it didn't feel like home anymore and I just wanted to go back to University straight away.\n\nWhich is why I'm not going back this year.",
      "author": "ElephantWarrior98",
      "created": 1542800633,
      "upvotes": 1,
      "replies": {}
    },
    "ea5q93u": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5q93u/",
      "text": "It's part of life. Going back to campus after having graduated feels the same way. As a college instructor, I always think about how my students are in the middle of this exciting time and that everything is changing for them. ",
      "author": "bandersna7ch",
      "created": 1542796895,
      "upvotes": 1,
      "replies": {}
    },
    "ea5q854": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5q854/",
      "text": "I feel the same way, I am not so much thrilled anymore when going home because it is so much different. Also I am scared how it will look like after I finish college. What to expect later? I am proud to be agrown up person who is independent but also sometimes I wish to go back to childhood and use my time better. ",
      "author": "monzter7",
      "created": 1542796852,
      "upvotes": 1,
      "replies": {}
    },
    "ea5oj0o": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5oj0o/",
      "text": "Yeah, becuase their not...  It's not that complicated.",
      "author": "TheButtMan123",
      "created": 1542793507,
      "upvotes": 0,
      "replies": {}
    },
    "ea5no4q": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5no4q/",
      "text": "I don't enjoy going home anymore. I can tell it puts a lot of stress on my parents which kinda kills the mood of visiting and stresses me out too. my mom always goes into some kind of panic when it comes to packing/leaving on a trip. Dad sees it as a chance to take a personal vacation and dump all the house work on me, and they save projects for when I get home too. ",
      "author": "Badjokechip",
      "created": 1542791798,
      "upvotes": 1,
      "replies": {}
    },
    "ea5ncs7": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ncs7/",
      "text": "I live pretty close to home so I can visit pretty regularly. My main issue with college is the food. It's hard to not live with my moms legendary cooking skills. Whenever I eat I always think about how my mom could do better. But other than that I think college life isn't too bad. I like the quiet and just being able to be by myself. My siblings are so loud and full of energy and I am just dead half the time ",
      "author": "congealedplatypus",
      "created": 1542791196,
      "upvotes": 1,
      "replies": {}
    },
    "ea5nca8": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5nca8/",
      "text": "I always *think* I'm missing home until I'm actually home on breaks. Weirdly, I actually kind of like the feeling you're describing, because it makes me feel independent and gives me a wake up call on how far I've come. \nMy parents were pretty controlling through high school, and even just little things like getting to determine my own schedule at school feel like a blessing. No one to say \"you are doing this tomorrow night\" without regard to my prior plans. No one to harass me about my homework grades if I'm struggling with something.\n\nWeek long breaks like Thanksgiving and Spring Break are the easiest for me to cope with, because it's short lived and everything stays relatively amicable. Winter break is volatile, as it's just long enough for their old tendencies of treating me like a high schooler start to pop back up. Summer breaks can be pretty hellish for me, because they reinstate those controlling rules like an early curfew (that's like 4 hours before times I come home at college lmao) and wanting to know where I am and who I am with at ALL times and how much money I'm 'wasting' and why I'm friends with certain people that are 'going nowhere in life'.",
      "author": "nerdyginger27",
      "created": 1542791170,
      "upvotes": 3,
      "replies": {
        "ea67w7a": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea67w7a/",
          "text": "This is probably the one that’s the most accurate that I’ve read so far. I have a friend who’s had a bit of a hard life(his mom passed a few years ago, his dad isn’t home a lot due to his job) that my mom doesn’t like me hanging out with due to a one time incident that we resolved the next day, but he’s like one of maybe 3 people from high school that I actually enjoy spending time with at home.",
          "author": "swimmerboy29",
          "created": 1542816421,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ea5n7rv": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5n7rv/",
      "text": "I’m feeling this right now, second year of college and my home town feels less and less like my home. Hope you find peace with yourself and know that it will all work out once you make some new memories. ",
      "author": "Broncopolo14",
      "created": 1542790935,
      "upvotes": 1,
      "replies": {}
    },
    "ea5mgof": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5mgof/",
      "text": "I literally just posted this on my finsta account: \nlast year, when I was in school, I missed my parents house and counted down the days until 8 could go back. now, when I'm at my parents house, I miss my house and my friends and concerts and the cats and drugs and my bed and the couch and roommate netflix sessions and even watching sports with Lucas. it's strange how these things happen\nI get it man...I do",
      "author": "sophonaroap",
      "created": 1542789549,
      "upvotes": 1,
      "replies": {}
    },
    "ea5lvgv": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5lvgv/",
      "text": "[deleted]",
      "author": null,
      "created": 1542788484,
      "upvotes": 8,
      "replies": {
        "ea5yi8m": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5yi8m/",
          "text": "Metallica... where I lay my head is home.",
          "author": "oldfatsosack",
          "created": 1542808415,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ea5lp9o": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5lp9o/",
      "text": "You never really 'go home again'....you just go to where home used to be.  Home was at your parent's house....five years ago.  Now it's somewhere else.",
      "author": "VisaEchoed",
      "created": 1542788185,
      "upvotes": 0,
      "replies": {}
    },
    "ea5l4gd": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5l4gd/",
      "text": "I lived with my parents for about 6 years before moving out again. It has been nearly two months and I when I visited last weekend, they have already packed all my stuffs away and knocked down my wall, pull all the windows out to reconstruct my room for a new puppy they are adopting.",
      "author": "Reyox",
      "created": 1542787203,
      "upvotes": 2,
      "replies": {}
    },
    "ea5l3ht": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5l3ht/",
      "text": "I don't think this is unique to the college experience. It seems to be common in everyone when they move away from home for the first time. ",
      "author": null,
      "created": 1542787158,
      "upvotes": 1,
      "replies": {}
    },
    "ea5kv2l": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5kv2l/",
      "text": "Things change, that's what they do.",
      "author": "Wdf1987",
      "created": 1542786772,
      "upvotes": 0,
      "replies": {}
    },
    "ea5ktni": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ktni/",
      "text": "It’s only downhill from here ",
      "author": "shown_spenser",
      "created": 1542786706,
      "upvotes": 0,
      "replies": {
        "ea651zn": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea651zn/",
          "text": "In a way, the whole point of a university is to try to create a conversation that lasts for hundreds, or thousands of years, and where we can, in effect, interact with people who are long gone as if they were still young.",
          "author": "podkayne3000",
          "created": 1542814237,
          "upvotes": 0,
          "replies": {
            "ea65sxs": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea65sxs/",
              "text": "Lol no",
              "author": "shown_spenser",
              "created": 1542814859,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ea5jzhd": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5jzhd/",
      "text": "Been in the military for over 6 years now. I've got a fully established life away from home and this is how I feel every time I go back. I'm the youngest of 3 and my 2 older siblings still see me as the baby meanwhile I am in charge of about 5 people and coordinate them to solve issues on multi million dollar Jets.\n\nIt won't change and you should just be thankful that at least your dad understands it. Best of luck!",
      "author": "annoyingTF",
      "created": 1542785323,
      "upvotes": 1,
      "replies": {}
    },
    "ea5jryc": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5jryc/",
      "text": "Well my parents got a new house and shifted there while I was away so when I went back it low key just felt like a stranger's house. I didn't know where my stuff was. Had to keep asking mom. I didn't know the neighborhood. Or anyone there either. Honestly the only thing that kept me there was hey I got to meet my parents. ",
      "author": "DaoLordSubha",
      "created": 1542784992,
      "upvotes": 1,
      "replies": {}
    },
    "ea5ipf3": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ipf3/",
      "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/purdue] [Anyone else getting this feeling?](https://www.reddit.com/r/Purdue/comments/9z0uhr/anyone_else_getting_this_feeling/)\n\n- [/r/u_sohaibka] [Anyone else feel like things just aren’t the same when visiting home during breaks?](https://www.reddit.com/r/u_sohaibka/comments/aia9cx/anyone_else_feel_like_things_just_arent_the_same/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "author": "TotesMessenger",
      "created": 1542783308,
      "upvotes": 1,
      "replies": {}
    },
    "ea5ik0y": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ik0y/",
      "text": "Really feeling this thread",
      "author": "NRUCSGO",
      "created": 1542783076,
      "upvotes": 2,
      "replies": {}
    },
    "ea5hzox": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5hzox/",
      "text": "Same lol. Just this year, but I also just moved farther away ",
      "author": "Trowawaycausebanned4",
      "created": 1542782235,
      "upvotes": 1,
      "replies": {}
    },
    "ea5hs5n": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5hs5n/",
      "text": "For sure my dude. I even wrote a song about this after one of those trips back. Hopefully this helps: https://youtu.be/OxNDsYkD-8c",
      "author": "flippymusic",
      "created": 1542781921,
      "upvotes": 0,
      "replies": {}
    },
    "ea5hj1a": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5hj1a/",
      "text": "Visiting home again feels *amazing*. I have appreciated my house so much more since I have left for college. After this school year however, I will basically be moved out of parents house since ill be bouncing around from internship-school-post graduation life. I never really felt that comfortable at my current school so I guess that's why I appreciate my home alot more than others.",
      "author": null,
      "created": 1542781556,
      "upvotes": 6,
      "replies": {}
    },
    "ea5hcez": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5hcez/",
      "text": "Not in college but can relate. My father got sick and died while I was in boot camp for the navy.  My father was a large influence in my life and as a retired Air Force Msgt guided my decision to join. I went home for his death and funeral and then again after boot camp before moving to the east coast (family in Kansas).  Haven’t been back since to visit my mother and sister. It’s been 8 years. I find I hard emotionally to consider going back to my childhood home without him there. ",
      "author": "DarthFatz82",
      "created": 1542781298,
      "upvotes": 18,
      "replies": {
        "ea63jp1": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea63jp1/",
          "text": "Found this via /popular and just wanted to thank you for your service.\n\nYou can really honor your dad in whatever you devote your life to, I know what that's like having lost my own dad early on.",
          "author": "scooterdog",
          "created": 1542812982,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ea5gzv1": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5gzv1/",
      "text": "This is intensified when you go off to college. Even more so with gradschool. \n\nYou are growing, maturing, learning, becoming a different (hopefully better) version of yourself. But when you go back you're faced with your old life, but also the prospect that no-one else is changing, growing, or becoming anything other than what they were a year ago, two years ago, ten years ago. \n\nThere are times when I have returned \"home,\" and notice I might fall into an old habit or old way of thinking and then catch myself and all I can think is how disgusted I am by everything.\n\nThese days I can only put on the mask so long with my family that I usually burn out after 3 days.\n\nI once tried hanging out with my old friend from highschool and it was just like highschool. The contrast made me realize how different I had become, and how much better my friendships were in gradschool. I actually hung out with people I liked, and who were nice to me, and liked the same activities I did. I realized that what my old friend thought were \"friendly jabs\" was just him being an asshole, and sorry bro but no I don't want to sit around smoking cigarettes and getting drunk playing cards against and listen to your racist jokes -- I have a literal mountain to go climb and a Geeks Who Drink quiz night with nice people.\n\nThey thought I went to college and left the community. \n\nI did.\n\nRight now I'm trying to figure out how to convince my mom to leave too, because I don't want to return anymore, but I don't want her stuck there either.",
      "author": "Prof_Acorn",
      "created": 1542780809,
      "upvotes": 14,
      "replies": {}
    },
    "ea5gylh": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5gylh/",
      "text": "It's my senior year of undergrad, and I just got as a server. It will be my first year not going home for the holidays - the feelings are mixed. Mostly content and excited for a relaxing (but work filled) week to myself, but also sad I'm missing the chance to eat the food my family makes and see them. ",
      "author": "HanIndividual",
      "created": 1542780761,
      "upvotes": 1,
      "replies": {}
    },
    "ea5geqx": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5geqx/",
      "text": "I've not been home since 6 months now. I was due to go home next month after exams but our College decided to admit us in an electronics training camp. I'm missing home, at the same time I can't miss that vital training. ",
      "author": null,
      "created": 1542780016,
      "upvotes": 1,
      "replies": {}
    },
    "ea5gbw7": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5gbw7/",
      "text": "I'm in a similar spot. I'm still within the mindset of referring to my parent's house as \"home\" and my college as \"school\" but it's slowly but surely shifting away from that. My sister is a senior in high school and it's weird hearing her talk about college applications. I can physically see my parents getting older every time I see them and my dad is getting closer and closer to retirement.  \n\nI think what really gets me though is the lack of good friends around. I've drifted from my high school friends a bit. I've been home for break since Saturday and I haven't made plans to hang out with anyone. At college I have many friends within a mile radius: In my dorm, in my classes, at clubs, at dining halls, all within a short walk away but now we're scattered about. This is somewhat my own fault, but I feel isolated whenever I'm home.  \n\nIf your hometown doesn't feel like home to you anymore, does your campus feel like your new home? ",
      "author": "rabbitoli",
      "created": 1542779907,
      "upvotes": 3,
      "replies": {}
    },
    "ea5fjxj": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5fjxj/",
      "text": "When the hugs just don’t feel the same anything...feels bad man",
      "author": "ii_too_toasty",
      "created": 1542778874,
      "upvotes": 1,
      "replies": {}
    },
    "ea5fi1w": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5fi1w/",
      "text": "Home is now a place you visit.",
      "author": "sacris5",
      "created": 1542778805,
      "upvotes": 1,
      "replies": {}
    },
    "ea5fbtg": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5fbtg/",
      "text": "I'm nearly 23 now and left home at 17. Going back and seeing my old bedroom exactly how I left it 5 years ago is always very weird, but I'm never there long enough for it to be mine again. \n\nThey're still treating it as though it's mine, and I'm treating it as though it's theirs. \n\nI was a very different person at 17. Going to my parents' house means going to my hometown, and it all just dredges up memories of who I used to be. Going back throws you midway between the two. I don't know anyone else who has gone to university where I'm from, so they couldn't even understand my life now if they tried. ",
      "author": "NoxiousQuadrumvirate",
      "created": 1542778584,
      "upvotes": 5,
      "replies": {}
    },
    "ea5e5kv": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5e5kv/",
      "text": "Fuck I’m a freshman going home tomorrow and  now I’m sad...",
      "author": "lukethefur",
      "created": 1542777108,
      "upvotes": 18,
      "replies": {
        "ea5kkz8": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5kkz8/",
          "text": "[deleted]",
          "author": null,
          "created": 1542786300,
          "upvotes": 25,
          "replies": {
            "ea6bwar": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6bwar/",
              "text": "Lived at college my first year. Realized how much better I like it at home so I commuted 45 minutes the rest of the years.\n\nDon't regret it at all",
              "author": "mody_bird_s",
              "created": 1542819389,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "ea5e467": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5e467/",
      "text": "Yep. After class I tell myself \"Imma go home and watch some Netflix\". Home = Dorm",
      "author": "ckoisj",
      "created": 1542777062,
      "upvotes": 14,
      "replies": {
        "ea5prj2": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5prj2/",
          "text": "It seems really small but I'm a first year and said this exact thing for the first time today. Never described my dorm as home before as I've found it hard moving away from my childhood 'home'. Shows I'm moving on I guess",
          "author": "LordOfPieces",
          "created": 1542795996,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ea5dct4": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5dct4/",
      "text": "This is the first year I've really felt like that.  I feel more at home in my own apartment.  My parents took over my room six days after I moved out for grad school and it still irks me.  Now I don't have anywhere to put my stuff and I have to share sink space with my mom, who took my bathroom! I feel like a guest in my own house!",
      "author": "sugarandmermaids",
      "created": 1542776159,
      "upvotes": 1,
      "replies": {}
    },
    "ea5d4wo": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5d4wo/",
      "text": "I don't feel this way at all, but I also fucking hate my school so my perspective is a little different. ",
      "author": null,
      "created": 1542775906,
      "upvotes": 6,
      "replies": {}
    },
    "ea5cxbl": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5cxbl/",
      "text": "Im a freshman going to school across the country from my home town. I couldn't be more excited to come home from break to see my friends and family and it honestly really put into perspective how important all these people are to me \n\n&#x200B;",
      "author": null,
      "created": 1542775665,
      "upvotes": 11,
      "replies": {}
    },
    "ea5ceu8": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ceu8/",
      "text": "It did for me until I dropped out of college to start a business. For a few years (I started college at 17 so had some time) I was at home and within a year it was back to normal. Managed to get the house to myself after helping my parents get rich and get to move somewhere nicer. ",
      "author": null,
      "created": 1542775079,
      "upvotes": 0,
      "replies": {}
    },
    "ea5c6df": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5c6df/",
      "text": "It is a weird feeling for sure. It's like, I feel that \"I am home again\" feeling but I also kind of feel guilty because I feel like I should be getting life and work together and like home is kind of holding me back a bit. It's that reminiscing vacation that feels familiar but knowing that you will have to leave for an extended period of time is something that clashes with that familiarity. I guess \"home\" is a concept that changes with time.",
      "author": "monzano00",
      "created": 1542774809,
      "upvotes": 22,
      "replies": {}
    },
    "ea5c3qb": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5c3qb/",
      "text": "The first weekend I returned home from college, it had been about 6-7 weeks since I’d been home and I couldn’t stop crying, I guess because it just hit me that I don’t live here anymore, even though it is my home. It really hurts and I miss my old life a lot ",
      "author": null,
      "created": 1542774724,
      "upvotes": 43,
      "replies": {
        "eab41xq": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/eab41xq/",
          "text": "[deleted]",
          "author": null,
          "created": 1542993573,
          "upvotes": 3,
          "replies": {
            "eab5xmj": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/eab5xmj/",
              "text": "Omg same here, I try not to think about that but it still crosses my mind once in a while :(",
              "author": null,
              "created": 1542995051,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ea5bozj": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5bozj/",
      "text": "Go to community college so everything is just always the same XD",
      "author": "WaddleD",
      "created": 1542774266,
      "upvotes": 0,
      "replies": {}
    },
    "ea5b9ia": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5b9ia/",
      "text": "To give you the flip side of what a lot of people are saying here, I still feel really connected to my old home. I talk to all my old friends there, and I'm making plans with them for when all of us are out of school, and that's great, but there's a consequence there too. I don't feel connected to my school. The place I'm going to be spending most of my time for the next 4 years doesn't feel like home to me. Maybe it'll be different when I transfer (I was optioned to a satellite campus in a tiny little town, my main campus which has my major at it is in a big city), but right now it just means that even though I have friends and a social life here, I just feel lonely and homesick all the time. What I'm saying is there's two sides to every coin. To agree with what most everyone else is saying, this is part of life. You'll be ok.",
      "author": "RocketCheetah",
      "created": 1542773783,
      "upvotes": 35,
      "replies": {}
    },
    "ea5b31z": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5b31z/",
      "text": "Home is really a space in time\n\n\n\nFor the first 18-20 years is when you are making your \"home\"\n\n\n\nAfter that, you're just returning to the same place with a new face ",
      "author": "ocean365",
      "created": 1542773585,
      "upvotes": 88,
      "replies": {}
    },
    "ea5alld": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5alld/",
      "text": "Nothing worse then realizing your parents are actually getting old ...",
      "author": "zeramy1",
      "created": 1542773051,
      "upvotes": 362,
      "replies": {
        "ea5dhsh": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5dhsh/",
          "text": "I am in my senior year of highschool and starting to see how old my parents are getting too. My dad is 56 and my mom is 54. My dad works as a petroleum mechanic (works on large equipment, digger, cranes, ships) and it is very hard on his body. He comes home everyday absolutely exhausted. After he eats he watches a little tv and heads for bed, we barely talk anymore and that makes me sad. ",
          "author": "MaroonKrunch",
          "created": 1542776322,
          "upvotes": 146,
          "replies": {
            "ea5til4": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5til4/",
              "text": "And he is dreaming of the day he doesn’t have to go and do that shit, he wants to talk to you and his family more than anything. \n",
              "author": "whatisgoingon3690",
              "created": 1542802246,
              "upvotes": 92,
              "replies": {}
            }
          }
        },
        "ea5dwde": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5dwde/",
          "text": "Yeah, thank god my mom is just gracefully aging but my dad is starting to look pretty old now. Even though I’m happy that he’s become more calm and is more secure with work, i sort of miss those days of him waking up at 4am, working until 6pm and still having tons of energy when getting home, even if it was to yell at us for the dumbest reasons.  Little things like forgetting where he put his keys, or letting out a big sigh when he sits down makes me real sad. It’s like you blink and all of a sudden the whole world seemed to just move in fast forward. ",
          "author": "fuzzydunlop1234",
          "created": 1542776804,
          "upvotes": 67,
          "replies": {
            "eac2tir": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/eac2tir/",
              "text": "Yeah. I remember the first thing I said to my parents after trying on new glasses was, \"Wow! You guys are much older than I thought.\" Can't shake the feeling that I did that to them.",
              "author": "VoyagerQs",
              "created": 1543024333,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ea69unm": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea69unm/",
          "text": "Try being the parent getting old. ",
          "author": "FountainofR",
          "created": 1542817887,
          "upvotes": 19,
          "replies": {}
        },
        "ea6ugau": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6ugau/",
          "text": "When you come home and your younger brother than was up to your elbow is now up to your shoulder...\n\n",
          "author": null,
          "created": 1542833892,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ea5ad3i": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ad3i/",
      "text": "It's definitely is a culture shock going back in forth from home and school. I'm a junior and I'm finally to the point to where I prefer college life. Not becuase I have a huge social life there, but becuase that's where my \"work\" life is I guess. It seems like I only get seconds of free time at school, then I come home and I'm sitting around bored. I of course spend time with my family but whenever I'm not I feel guilty for not socializing with them or studying. Like I technically live at home (especially on breaks) but I feel like I have to play guest. It's quite a conundrum for people like us. ",
      "author": "Sham129",
      "created": 1542772795,
      "upvotes": 6,
      "replies": {}
    },
    "ea59oiz": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea59oiz/",
      "text": "Yeah. Completely normal unfortunately.  Found this browsing \"popular\"\n\nWait until no one lives there anymore. Am 35. Everytime I go home to see parents, it's less and less home. Schools get torn town, old favs close, etc. It's surreal, and kinda sad.",
      "author": "sintmk",
      "created": 1542772057,
      "upvotes": 88,
      "replies": {}
    },
    "ea58x93": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea58x93/",
      "text": "It happen mans. I'm an international student in the USA so my situation is even more complicated when I go back to my home country during break lol.",
      "author": "BrNetz",
      "created": 1542771256,
      "upvotes": 3,
      "replies": {}
    },
    "ea58vi1": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea58vi1/",
      "text": "Cuz things are different, but your memory is still stuck with the old time when you were there. ",
      "author": "CornHellUniversity",
      "created": 1542771204,
      "upvotes": 3,
      "replies": {}
    },
    "ea56i95": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea56i95/",
      "text": "I actually felt this same way when I came home today too. Didn't know how to put it in words but you got it. My house is rearranged w new furniture, stuff moved around my room, etc. Except my brothers are 4 and 6. My dad yells a lot more and my stepmom is nuts as always so I mean at least one thing is the same. Lol. Also found out I don't work at my job anymore because my boss doesn't like that I go to college. Petty. Oh well! Hope it gets better for ya",
      "author": null,
      "created": 1542768741,
      "upvotes": 91,
      "replies": {
        "ea57h2a": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea57h2a/",
          "text": "LOL. I can relate to having a dad that yells a lot. He was always moody, and just super strict but even he changed too. All of sudden he’s really nice and understanding and makes stupid dad jokes and I’m just like, who tf are you and where’s my dad? ...sorry about your job, some bosses really suck. ",
          "author": "fuzzydunlop1234",
          "created": 1542769729,
          "upvotes": 30,
          "replies": {
            "ea57xlf": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea57xlf/",
              "text": "Ugh mine used to be nice but then got remarried and had two more kids lol. My childhood was a mess. Oh well that's why I get to make my own life soon yeah? Haha that's great though! And yeah I agree about bosses, retail bosses never seem too happy ",
              "author": null,
              "created": 1542770211,
              "upvotes": 7,
              "replies": {}
            },
            "ea6bjz8": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6bjz8/",
              "text": "Your dad misses you",
              "author": "adriennemonster",
              "created": 1542819133,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ea571ck": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea571ck/",
          "text": "You know what...this comment made me realize how much I missed my crazy ass dad. Ur right, something's never change 😂",
          "author": "vr1252",
          "created": 1542769277,
          "upvotes": 6,
          "replies": {
            "ea5744x": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5744x/",
              "text": "Lol. Truth, but unfortunately I got yelled at from the second I got home today so that's enough fam time for the next month haha",
              "author": null,
              "created": 1542769357,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "ea56bbe": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea56bbe/",
      "text": "I’m facing my first break soon and I fear this. My parents have started making career changes and are travelling a lot more as a result, so if I do return it would be to an empty apartment. I intend to travel this break so I won’t have to deal with the sadness. :)) ",
      "author": "deadsadbaby",
      "created": 1542768553,
      "upvotes": 18,
      "replies": {}
    },
    "ea55yfs": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea55yfs/",
      "text": "Eventually, you're going to revisit the campus as an alumni (or even just be a senior and realize that most familiar faces are gone and you don't recognize many of the first years) and find that college won't feel like home anymore. Life changes, people grow and move on, and the world keeps turning.",
      "author": null,
      "created": 1542768201,
      "upvotes": 1220,
      "replies": {
        "ea5hdre": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5hdre/",
          "text": "As a senior this hit hard. Fuck",
          "author": "nash-hole",
          "created": 1542781351,
          "upvotes": 380,
          "replies": {
            "ea6byiv": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6byiv/",
              "text": "[deleted]",
              "author": null,
              "created": 1542819438,
              "upvotes": 85,
              "replies": {
                "ea6f8nr": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6f8nr/",
                  "text": "I work for my university in the u.k in helping disadvantaged college students (16-18) apply for university and maaaaaan im just so jealous of them. They have a fantastic 3 or 4 years ahead of them and they aren't even excited. It's crazy! ",
                  "author": "Chazzarules",
                  "created": 1542821909,
                  "upvotes": 25,
                  "replies": {}
                },
                "ea6f5dk": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6f5dk/",
                  "text": "You're making me tear up and I'm only half way through college. stahp",
                  "author": "MidoriKing27",
                  "created": 1542821842,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            },
            "ea6gfxc": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6gfxc/",
              "text": "Whenever I go back to college for football tailgates, it’s a surreal feeling being back on campus and not having to worry about any school related shit. Like when you walk down a quad you used to always walk, you’ll think “wow the last time I did this walk I was freaking out about an exam” or something. \n\nCollege is seriously the best time of your life. Enjoy the fuck out of your senior year because you probably will never have a year like it again. ",
              "author": null,
              "created": 1542822851,
              "upvotes": 8,
              "replies": {}
            },
            "ea6hk1z": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6hk1z/",
              "text": "As a first year grad student I can’t wait.",
              "author": "TanknSwank",
              "created": 1542823721,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ea60nle": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea60nle/",
          "text": "[deleted]",
          "author": null,
          "created": 1542810458,
          "upvotes": 60,
          "replies": {
            "ea6mirm": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6mirm/",
              "text": "Same happened to me, group of 5 of us as freshmen were best friends.  2 dropped out and 1 graduated.  Just me and one other guy left, Friday nights just aren’t the same anymore.  ",
              "author": "igot200phones",
              "created": 1542827599,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "ea63rej": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea63rej/",
          "text": "I recently had to go back to my old college for something, which meant making a six hour road trip that was really out of the way into the pine forests of east Texas. I love those pine forests, and for five years I felt like I would never want to leave. When I got to campus, I parked at my old student ministry building where I made the most friends and spent quite a lot of my time (even before I lived there as a resident). \n\nWalking into that building after so long felt equal parts overwhelmingly nostalgic and unnaturally foreign; every chair, tile, and kitchen utensil was in its place, but mixed in with the pictures on the wall that were taken while I was a student were all these new pictures of people I had never seen before in my life. Nobody I recognized. \n\nI then went across to the music building where the other half of my time was spent, and while the layout of the main building hadn’t changed, the people were all new, and seeing my old professors was great, but it didn’t have that same “I’m home” (or occasionally “oh fuck there’s a test today”) feeling it had while I was in college. \n\nI like being my own person and having a job and my own hobbies as an adult now, but damn if I don’t miss college sometimes, or at the very least the notion of certain places feeling like home. ",
          "author": "Arcalithe",
          "created": 1542813165,
          "upvotes": 29,
          "replies": {
            "ea6zjm3": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6zjm3/",
              "text": "SFA?",
              "author": "Texasgal12",
              "created": 1542838152,
              "upvotes": 2,
              "replies": {
                "ea769w4": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea769w4/",
                  "text": "Yeah buddy! Good ol’ lumberjacks!",
                  "author": "Arcalithe",
                  "created": 1542844272,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ea5nlem": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5nlem/",
          "text": "The odd thing is that for me right now, I feel like my home is truly the campus, not so much the people. Maybe that's just my introverted side.\n\nI have my one table I *always* sit at in the dining hall, the same room to go back to every night for years now, the same radio station I volunteer DJ at every semester.\nIt's gotten very comfortable spacially, and I feel a real connection to the location and the city. I hope I can still feel some semblance of that as an alumnus one day by visiting some of the same specific spots.",
          "author": "nerdyginger27",
          "created": 1542791650,
          "upvotes": 40,
          "replies": {}
        },
        "ea6e2u1": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6e2u1/",
          "text": "Go ahead and call me a dick for pointing this out, but:\n\n*alumni* is plural, as is *alumnae* (the latter being for a group comprising solely female former students)\n\n*alumnus* (male) and *alumna* are singular\n\nAgain, sorry. Pet peeve, innit. \"An alumni\" looks to me like nails on a chalkboard might sound to you. \n\nThey should really teach that in college, come to think of it. ",
          "author": "DrWinstonOBoogie1980",
          "created": 1542821040,
          "upvotes": 10,
          "replies": {
            "ea6u2vq": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6u2vq/",
              "text": "Ok, so I'll admit that it's like nails on a chalkboard for me too. But I can't logically justify it to myself (like a lot of prescriptive grammar rules) that I should consider it wrong when I'm totally fine with the singular \"they\" used as a gender neutral pronoun.",
              "author": "_woof_meow_",
              "created": 1542833589,
              "upvotes": 1,
              "replies": {
                "ea7n2z0": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea7n2z0/",
                  "text": "But a commonly agreed-upon gender-neutral alternative already exists in this case: *alum* and *alums*. ",
                  "author": "DrWinstonOBoogie1980",
                  "created": 1542860659,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ea67qda": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea67qda/",
          "text": "Do you recognize most people as it is? That seems crazy there’s so many people ",
          "author": "Trowawaycausebanned4",
          "created": 1542816304,
          "upvotes": 5,
          "replies": {
            "ea6f061": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6f061/",
              "text": "My school has about 20k people but I don't go a day without recognizing someone on campus",
              "author": "BACON_BATTLE",
              "created": 1542821733,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "ea6dcy9": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6dcy9/",
          "text": "Not only that but time will just keep moving.  Still feel like I just got out of a crammed little car with half a dozen friends to go to some dumb thing a town over but bruh...that was ten years ago now. \n\n",
          "author": "DiabloCanyon01",
          "created": 1542820506,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ea55qhx": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea55qhx/",
      "text": "I feel the same way. I’m in my second year of undergrad and although my parents miss me and I sort of miss home, it still doesn’t feel the same. A lot has changed since I’ve moved out, including my parents getting another dog and my sister officially moving out. I think my apartment at college with my friends feels more like home now. ",
      "author": "_claireity_",
      "created": 1542767987,
      "upvotes": 11,
      "replies": {}
    },
    "ea55c3m": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea55c3m/",
      "text": "Yes ,I also have this feelings.It means you have grown up.",
      "author": "JudyQAQ",
      "created": 1542767594,
      "upvotes": 12,
      "replies": {}
    },
    "ea5591g": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5591g/",
      "text": "I’m with you there. I used to be a ski instructor part-time in high school and would be at the hill 3-4 times a week (both weekend days and some weeknights), and I would spend the summers mountain biking. I still try to get out to the mountains when I can but it’s just not the same anymore. I’m now in grad school and love what I do, but can’t help but miss my old life sometimes.",
      "author": "bike0121",
      "created": 1542767508,
      "upvotes": 27,
      "replies": {}
    },
    "ea54u1t": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea54u1t/",
      "text": "I even stopped referring to my previous home as a home",
      "author": "Hellrox",
      "created": 1542767099,
      "upvotes": 141,
      "replies": {
        "ea56hyp": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea56hyp/",
          "text": "That's one way I knew I was growing up. Once I got my apartment my junior year I started referring to \"home\" as my apartment and no longer my childhood home. That became my parents house. ",
          "author": null,
          "created": 1542768733,
          "upvotes": 121,
          "replies": {
            "ea67u2f": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea67u2f/",
              "text": "I didn't even realize I did this and now reading it, it makes me sad.",
              "author": "suckyninja",
              "created": 1542816379,
              "upvotes": 26,
              "replies": {}
            }
          }
        },
        "ea582vi": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea582vi/",
          "text": "Yeah, now it's my parents' house. Makes me kinda sad.",
          "author": "chowder138",
          "created": 1542770367,
          "upvotes": 42,
          "replies": {}
        },
        "ea5dyyw": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5dyyw/",
          "text": "Yeah i noticed I’ve been telling my friends I’m gonna go visit my parents over break instead of “going back home”’now. ",
          "author": "fuzzydunlop1234",
          "created": 1542776888,
          "upvotes": 40,
          "replies": {}
        },
        "ea5hbux": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5hbux/",
          "text": "I'm realizing that I've had experiences with friends that have felt more like a home than my literal \"home\" ever did. I'm currently near where I grew up and where my family mostly lives, and it feels like I'm spending another Thanksgiving and Christmas away from home. I just don't vibe here. It's where I existed for a time, but it isn't home.",
          "author": "Prof_Acorn",
          "created": 1542781275,
          "upvotes": 10,
          "replies": {}
        },
        "ea5nens": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5nens/",
          "text": "This. I even changed where I 'live' on Facebook to my college town haha",
          "author": "nerdyginger27",
          "created": 1542791294,
          "upvotes": 6,
          "replies": {}
        },
        "ea677ia": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea677ia/",
          "text": "I remember when I was in college and I said to my mom \"I guess I'm going to head back home now\" when referring to going back to campus. I could see some hurt in her expression but also she was happy that after a rough first 2 years I had found my people and space enough my junior year to think of it as home.",
          "author": "LuckyCatastrophe",
          "created": 1542815922,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ea54efg": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea54efg/",
      "text": "This is how I felt after enlisting. ",
      "author": "Not_A_Greenhouse",
      "created": 1542766673,
      "upvotes": 5,
      "replies": {}
    },
    "ea53gli": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea53gli/",
      "text": "It helped me a lot to go to college. Never was the social type bc I was sheltered hard core by my single mother. 🤷🏻‍♂️",
      "author": "MommaSayd71",
      "created": 1542765772,
      "upvotes": 50,
      "replies": {}
    },
    "ea52xxu": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea52xxu/",
      "text": "Yes. My Thanksgiving break in freshman year made me realize how much I preferred college life over home life. Sure, college has a LOT of flaws but for me it provides an escape from all the problems my family faces.",
      "author": "Nelroth",
      "created": 1542765261,
      "upvotes": 886,
      "replies": {
        "ea54v85": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea54v85/",
          "text": "YES OMG YES. I feel the same way, college allowed me to just be myself, I feel like I always have to wear a mask around my family ",
          "author": "Firewave480",
          "created": 1542767131,
          "upvotes": 316,
          "replies": {
            "ea59iui": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea59iui/",
              "text": "Damn- for me it’s the opposite. I always felt like my family was more important, especially considering they’re with you your whole life as opposed to the finicky nature of friends. They’re the only people I truly open up to.",
              "author": "dhesswfb26",
              "created": 1542771891,
              "upvotes": 140,
              "replies": {
                "ea59ofc": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea59ofc/",
                  "text": "I’m glad you can have that type of relationship, it sounds lovely. Hold on to that mess. My perspective comes from a very... unfortunate background with my family. ",
                  "author": "Firewave480",
                  "created": 1542772055,
                  "upvotes": 70,
                  "replies": {
                    "ea5aqwx": {
                      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5aqwx/",
                      "text": "Damn I’m sorry, and I totally get why that’d change your perspective. To be fair being in college completely changed my family dynamic and I am much closer with them (especially my siblings) now. Distance truly did make the heart grow fonder for me",
                      "author": "dhesswfb26",
                      "created": 1542773212,
                      "upvotes": 22,
                      "replies": {
                        "ea5b3qt": {
                          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5b3qt/",
                          "text": "College is wonderful for reasons like that! I feel like that growth in a dynamic through distance is an essential part of growing up ",
                          "author": "Firewave480",
                          "created": 1542773607,
                          "upvotes": 14,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ea59qgv": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea59qgv/",
                  "text": "Family is great but it really depends. I would love to be with my dad all the time but i really need some distance from my mom.",
                  "author": "Oof101Oof",
                  "created": 1542772113,
                  "upvotes": 16,
                  "replies": {}
                },
                "ea5hi1g": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5hi1g/",
                  "text": "You're either ahead of the curve or come from more of a \"normal/traditional\" upbringing. Most other people who've had traditional upbringing will catch up with you over the next decade. Congrats and don't take things for granted. Aging of parents is one of these things that happens so quickly and people just don't notice it until it's kinda late. ",
                  "author": "OUJPSMD",
                  "created": 1542781517,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            },
            "ea58od8": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea58od8/",
              "text": "Facts",
              "author": "Brownie_McBrown_Face",
              "created": 1542770996,
              "upvotes": 9,
              "replies": {
                "ea58yy4": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea58yy4/",
                  "text": "THESE BE STRAIGHT FACTS",
                  "author": "Firewave480",
                  "created": 1542771306,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "ea5ntja": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ntja/",
              "text": "Either stop being ashamed of who you are or change who you are. I have no sympathy for any other position.",
              "author": "brucejennerleftovers",
              "created": 1542792093,
              "upvotes": -7,
              "replies": {
                "ea68jbe": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea68jbe/",
                  "text": "My dude what are you even talking about ?",
                  "author": "Firewave480",
                  "created": 1542816892,
                  "upvotes": 1,
                  "replies": {}
                },
                "ea5pboy": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5pboy/",
                  "text": "Why not? ",
                  "author": "McSkillet2323",
                  "created": 1542795112,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ea5js89": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5js89/",
          "text": "Damn going away for college sounds nice. Fuck being poor. ",
          "author": "pro_zach_007",
          "created": 1542785005,
          "upvotes": 9,
          "replies": {}
        },
        "ea8hmu6": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea8hmu6/",
          "text": "Same, since I love my family, but thanksgiving usually turns into an argument or a drama. Even before thanksgiving there’s one huge fight where we don’t talk to each other until thanksgiving. I kinda considered not going back home. I have a pile of work to do, and while I am lazy, I feel more motivated to do it at college. At home I just lay in my room and do nothing, or go out and find no time to do it. ",
          "author": "CapriciousSalmon",
          "created": 1542897556,
          "upvotes": 2,
          "replies": {}
        },
        "ea5rpe3": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5rpe3/",
          "text": "And endless dicks to suck! :))",
          "author": "Sooner_Shitbag",
          "created": 1542799184,
          "upvotes": -11,
          "replies": {}
        }
      }
    },
    "ea51q6j": {
      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea51q6j/",
      "text": "It's completely normal! I think this is one of the sadder parts about growing up, cause I feel the same way. I would try to keep in touch more with your family during the school year so you aren't only speaking to them at breaks and such. Hang in there!",
      "author": "s0mevietgirl",
      "created": 1542764067,
      "upvotes": 551,
      "replies": {
        "ea5e4dj": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5e4dj/",
          "text": "Yeah, I guess it just felt like life went by way too fast before college, especially when we as a family went through a lot when I was a teenager and all of a sudden I blink and the memories I thought I hated or just forgot about with my family are the ones i now cherish the most because of lost time...but I guess that’s just life ",
          "author": "fuzzydunlop1234",
          "created": 1542777069,
          "upvotes": 126,
          "replies": {
            "ea5gjxg": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5gjxg/",
              "text": "Bottle this up and write the next catcher in the rye",
              "author": "upboat_allgoals",
              "created": 1542780207,
              "upvotes": 35,
              "replies": {}
            },
            "ea5jafv": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5jafv/",
              "text": "It almost like loosing your childhood innocence and you finally realise you’ve become an adult. And when you realise it, it hits you hard, home won’t be home anymore. That feeling unfortunately doesn’t come back. As  you grew older you will make your own home just like your parents did and hopefully you’ll have new memories and feelings. \n\nIt’s incredibly weird that feeling when your at dorms for a few weeks you go back home and everything has changed. Even your community has changed, you notice so much more and you realise how fast life is moving. ",
              "author": "1zeewarburton",
              "created": 1542784212,
              "upvotes": 31,
              "replies": {
                "ea8hphr": {
                  "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea8hphr/",
                  "text": "Ikr. I notice that now I don’t even call my home home. My home is my dorm.",
                  "author": "CapriciousSalmon",
                  "created": 1542897614,
                  "upvotes": 1,
                  "replies": {
                    "ea8l93l": {
                      "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea8l93l/",
                      "text": "One of the most bitter sweet moments of your life.",
                      "author": "1zeewarburton",
                      "created": 1542900148,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ea5s3al": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5s3al/",
              "text": "Aw man, seriously your dad is right, it's kind of melancholy I know, but it really is a part of growth.  The old adage, \"you can never go home\", resonates for a reason.  Anyway, it's really a positive thing, life is supposed to be lived moving forward, not reliving the past, everything is change.  I know the feels though, I remember going through it, and every now and again that feeling still finds a way to come back.",
              "author": "maldio",
              "created": 1542799858,
              "upvotes": 13,
              "replies": {}
            },
            "ea5ppg9": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5ppg9/",
              "text": "I think you’re taking the right steps by learning to appreciate what you have, because life only gets faster and faster. Years will feel shorter and shorter as you get older and it’s important to remember to take a breath, lift your head up, and look around you. ",
              "author": "electrons_only",
              "created": 1542795884,
              "upvotes": 3,
              "replies": {}
            },
            "ea5vzrd": {
              "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5vzrd/",
              "text": "If you think time is going fast now, wait 10 years. I sometimes feel like I barely remember anything between 26 and 31 because it's all been such a blur. But at the same time, I also remember everything as if it just happened yesterday, because the days just blend together.",
              "author": "2livecrewnecktshirt",
              "created": 1542805718,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ea5usb4": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea5usb4/",
          "text": "For me the growing up part was realizing that my parents were just people.  They aren't special just because they created or raised you.  They have problems and flaws just like you do. In fact your parents and siblings might not even be people you would want to spend time with if they weren't your family.  College gives you a great opportunity to really choose a peer group.  Going home that first time, for some, you may realize that you would much rather spend time with those new friends than your family.\n\nI hear some people have normal families full of normal people.  I'm not sure what that is like, but I bet their Thanksgiving arent dreadful.  \n",
          "author": "southwick",
          "created": 1542804120,
          "upvotes": 17,
          "replies": {}
        },
        "ea6e343": {
          "link": "/r/college/comments/9yycdr/anyone_else_feel_like_things_just_arent_the_same/ea6e343/",
          "text": "The parts of growing up are all sad, and sadder. ",
          "author": "thegoldengoober",
          "created": 1542821046,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054456
}