{
  "sid": "qmwsmx",
  "link": "/r/college/comments/qmwsmx/what_to_do_with_professors_that_are_difficult_to/",
  "title:": "What to do with Professors that are difficult to Understand. And why are they even hired in the first place?",
  "text": "So me and my friends have taken 2 classes in a row with Professors who aren't good at teaching. We've gotten through these courses using Youtube/Other Internet Resources/the Textbook.\n\nBoth of these professors are very smart in their field (based on research papers they have published and other impressive stuff they've done in their careers), so I guess they help the University by doing great research...but they are just not good communicators.\n\n1. Does the University just hire them because they are good researchers?  Did no one try to judge their teaching skills before hiring them?\n2. Why would they hire someone based solely on half of the job (research)?\n3. Can they not find people who are good at both (research and teaching)?",
  "author": "OkPea2542",
  "created": 1636065810,
  "updated": 1636137332,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjcfxxy": {
      "link": "/r/college/comments/qmwsmx/what_to_do_with_professors_that_are_difficult_to/hjcfxxy/",
      "text": "1) yes, most university money is research grants and us students (undergrad in particular ) go fuck our selves \n2) $$$\n3) they hire for your research first and foremost, being a good teacher who cares is just a plus. They just care about money.\nIf you noticed the trend, university’s care more about making money and prestige (which gets them more money) than actually teaching",
      "author": "harry01772",
      "created": 1636066676,
      "upvotes": 3,
      "replies": {}
    },
    "hjdnd8b": {
      "link": "/r/college/comments/qmwsmx/what_to_do_with_professors_that_are_difficult_to/hjdnd8b/",
      "text": "Most universities don’t include teaching education/training in their PhD programs, and many universities don’t care how good someone is at teaching. Research matters way more than being a good vs a mediocre (or even poor) teacher.",
      "author": "PhDapper",
      "created": 1636087208,
      "upvotes": 2,
      "replies": {
        "hjfxbyl": {
          "link": "/r/college/comments/qmwsmx/what_to_do_with_professors_that_are_difficult_to/hjfxbyl/",
          "text": "Okay understood. \n\nLike in football as a running back, your running skills are the most important.  Receiving skills are less important as an RB.  But...if you could have both, you grab it.  Then you end up with Christian McAffrey (he's good at running AND receiving, and is possibly the best RB in the NFL overall).\n\nSo why not find someone with both skills (research AND teaching)?  Is it that hard?",
          "author": "OkPea2542",
          "created": 1636134263,
          "upvotes": 1,
          "replies": {
            "hjfzkqg": {
              "link": "/r/college/comments/qmwsmx/what_to_do_with_professors_that_are_difficult_to/hjfzkqg/",
              "text": "I mean, there are some of us who are good at both, but often, it’s a trade-off, and there aren’t many who are super passionate about excelling at both, nor do many have the time to really be great at both. For example, to be an outstanding researcher, you typically don’t have the time to invest in lots of prep and pedagogical improvements.",
              "author": "PhDapper",
              "created": 1636135144,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjeatc9": {
      "link": "/r/college/comments/qmwsmx/what_to_do_with_professors_that_are_difficult_to/hjeatc9/",
      "text": "In short, research is all that matters. Everything else is an afterthought.",
      "author": "TheProfessorsCat",
      "created": 1636106574,
      "upvotes": 1,
      "replies": {}
    }
  }
}