{"sid": "osvg0l", "link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/", "title:": "What’s the worst icebreaker/activity you’ve ever had to do?", "text": "I’ve had some bad ones when I was a student…", "author": "catscience247", "created": 1627420663, "retrieved": 1632947980, "over_18": false, "upvotes": 612, "upvote_ratio": 0.99, "comments": {"h6x8c0e": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6x8c0e/", "text": "During college orientation we had to play the game where you evolve from an egg to a chicken to a dinosaur to a human based on your performance in rock paper scissors. Don't even know why we did it because we didn't learn each other's names any better.", "author": "Longjumping-Math9685", "created": 1627535681, "upvotes": 1}, "h6x14f6": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6x14f6/", "text": "Spelling your name out with your ass in front of everybody at camp. Who tf thought of that shit nobody wants to sit through shaking butts for 30 minutes.", "author": "Dimsum_Boi", "created": 1627531140, "upvotes": 1}, "h6vjhfl": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vjhfl/", "text": "In church youth group while I was in middle school we played a game where the objective was to pass a dog treat to the mouth of the person to the right using only your teeth until it got to the other side of the room. Luckily they split guys and girls but still extraordinarily awkward nevertheless.", "author": "TwistedCube49", "created": 1627505231, "upvotes": 1}, "h6vj84h": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6vj84h/", "text": "There was one where we had to stand in a line and start with the person saying their names and a object that starts with the beginning letter of their name. (ex Alex Apple). When it got to you, you were to recite from the beginning to you each persons name along with the object. And then say your name with a object until it gets to the last person who repeats everyone’s name and object. Someone who is terrible with remembering names this was an absolute stuttering nightmare.", "author": "TelevisionOk8974", "created": 1627505121, "upvotes": 1}, "h6v25me": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6v25me/", "text": "Do a \"simple\" cheerleading pose. \n\n1. Stand on 2 of your friends thighs while they kneel with one knee on the ground \n\nOr \n\n2. Let a cheerleader carry you and stand on his shoulders. \n\nWent to the toilet... never came back for 2 hours. Wtf", "author": "junglelady2", "created": 1627497917, "upvotes": 3}, "h6uzvsw": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uzvsw/", "text": "Form a giant 50+ person circle by laying on the lap of the person next to you and then have someone else lay on top of your lap. Absolute worst thing ever.", "author": "bnb5296", "created": 1627496976, "upvotes": 1}, "h6usk9j": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6usk9j/", "text": "Honestly any ice breaker in general. Introverts worst nightmare", "author": "strawberry_2703", "created": 1627493931, "upvotes": 1}, "h6ur93v": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ur93v/", "text": "This might not qualify as an icebreaker but the worst intro activity we had to do was my freshmen year during welcome week. I went to a Catholic college my freshmen year. Because they had to explain title IX, instead of just telling us what counts as rape or sexual assault, they had kids from the state school come and put on a play about a girl who gets sexually assaulted by a friend and then did character Q&A after. The acting was surprisingly good, but the lines were so cringy, I had to keep myself from laughing. \n\nThe professors said if anything wanted to leave they could but idk if people left because they found it cringey or if they were legitimately triggered. \n\nI transferred to the state school my second year and when it came time for them to explain title IX, we literally just got a brochure and were told where to get condoms if we needed any. For reference, the Catholic school didn’t give out condoms and you weren’t allowed to have opposite sex overnight visits. they could refer us to a health organization, albeit a lot of the ones on the list they gave were crisis pregnancy centers.", "author": "CapriciousSalmon", "created": 1627493393, "upvotes": 3}, "h6ubuti": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ubuti/", "text": "This isn't as awful as some on here, but any icebreaker that requires us to stand in a circle and hold hands. My hands got clammy really fast.", "author": "Quiet-Use989", "created": 1627487094, "upvotes": 4}, "h6uapro": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6uapro/", "text": "I was an Orientation Team Leader and some of the activities we were instructed to do were pretty bad, but the worst was the ***circle sit***. \n\nWe gathered several groups together (maybe 30 people), got in a circle shoulder-to-shoulder, turned to the left so that we were all facing the same direction, stepped in toward the center of the circle to get closer (because it wasn't awkward enough already), ***sit down on the person's knees behind you*** (while the person in front sits on yours), and then take steps forward....I mean, it broke the ice and *instantly* united all of the incoming students against the Orientation Team leaders!", "author": "Esmereldista", "created": 1627486623, "upvotes": 5}, "h6ua1io": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ua1io/", "text": "We had to write three things we liked. Crumpled the paper and threw it somewhere in the class. Then we had to pick up a random paper, read it and guess who the person was based on the three things they liked. So we had to “meet” our classmates. Except most people threw their own paper 3 feet from their desk and grabbed their own and some assholes threw the papers at girls heads but they were “aCcidEnTs”.\n\nEdit: also some people wrote their likes as “I like cats. I like dogs. I like my mom” so it sort of became impossible to even find people based on such a generic list. It was a disaster and so embarrassing.", "author": "localscreamqueen", "created": 1627486344, "upvotes": 4}, "h6u5caw": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u5caw/", "text": "I still have nightmares about this. \n\nIt's a group game that teaches communication. You all stand in a circle, grab the hand of the person in front of you, then grab the hand of the person next to you, and you have to untangle yourself. \n\nYou just met this group of strangers and now your ass is in their face is in someone else's crotch. You're trying not to fart or kick someone in the head while you straddle two complete strangers' arms. You're SWEATING. So. Much. Sweat. All because you wanted to join a leadership club to add to your resume. \n\nFuck this game.", "author": "The-J-StandsForJiant", "created": 1627484331, "upvotes": 6}, "h6u2ydl": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6u2ydl/", "text": "We had to go around the circle and sing a verse of Twinkle Twinkle Little Star. Some people, including myself, refused and got roasted by the professor", "author": "coldaloe", "created": 1627483302, "upvotes": 2}, "h6tzdgd": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tzdgd/", "text": "“Introduce yourselves”", "author": "IndependentAd2522", "created": 1627481726, "upvotes": 2}, "h6ttwwx": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ttwwx/", "text": "Any time I have to come up with three interesting facts about my boring life", "author": "sgRNACas9", "created": 1627479163, "upvotes": 9}, "h6trd7o": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6trd7o/", "text": "One time we had to all sit in a circle. Basically we’d go around the circle, and say our name and what we ate for breakfast. Once we got through the whole circle, you had to go through it AGAIN. The only difference was that the person starting off the circle again had to go around the circle, list everyone’s name, then what they ate. Then the second person in the circle would do the same thing and so on and so fourth. \n\nI hated this game so bad because if you forgot someone’s name or what they ate everyone just stared at you. It was like a memorization game. And I feel like that puts you on the spot when you’re just learning everybody.", "author": "bluarrow7", "created": 1627477872, "upvotes": 9}, "h6tqb1a": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tqb1a/", "text": "We had to sing a few lines of whatever song we chose in front of the room and explain how that represents us. If you don't want to sing though, you're free to dance. It was just embarrassing.", "author": "iceketball27", "created": 1627477317, "upvotes": 6}, "h6tpmev": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tpmev/", "text": "we were doing icebreakers and a girl told me that her cat has aids", "author": "cacklinrooster", "created": 1627476951, "upvotes": 6}, "h6tgdnv": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6tgdnv/", "text": "Dance while repeating a single line from a movie for a whole minute.......solo........on stage......infront of the whole college.", "author": "SmellsLikeTeenSweat", "created": 1627471233, "upvotes": 11}, "h6t0xx6": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6t0xx6/", "text": "[deleted]", "author": null, "created": 1627458064, "upvotes": 9}, "h6t0fvm": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6t0fvm/", "text": "The human knot where we have to untangle our arms & legs. Never successfully completed it!", "author": "jt1818", "created": 1627457637, "upvotes": 6}, "h6syf3p": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6syf3p/", "text": "we had to go up in front of a class of about 40 people and perform an interpretive dance that we came up with that represented our major and hobbies and people had to guess what they were\n\nif it didn't look enough like a dance and more like acting out movements, the professor would make you start over", "author": "SleighBellss", "created": 1627455909, "upvotes": 7}, "h6sxkq0": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sxkq0/", "text": "Spell my name out using my fucking ass in the air and it was the most embarrassing shit because my name has nine letters 😭💀🥴", "author": "theneighbourhoodthot", "created": 1627455212, "upvotes": 16}, "h6ssfiu": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ssfiu/", "text": "The one where we had to stand in a circle and hold hands... and I ended up having to hold 2 sweaty dudes' sweaty hands because we were supposed to be passing messages like that. Ueugh!", "author": "imsorryifellasleep", "created": 1627451256, "upvotes": 10}, "h6spytp": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6spytp/", "text": "The whole use an adjective to describe yourself game. Then you went around the circle and repeated everyone's adjective plus their name before saying yours. Just... blegh. Very corny lol", "author": "Competitive-Course45", "created": 1627449530, "upvotes": 5}, "h6sox7w": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sox7w/", "text": "Anyone who's taken a lot of math courses will understand this...\n\nI forgot the name of this course but we were called randomly, had to go up to the board, introduce ourselves and what our major is, than had to solve a proof in front of everyone. \n\nI had no fu****g idea how to even start it and felt so embarrassed because the 2 people in front of me did it in seconds. It still gets my anxiety up thinking about it.", "author": "kluda06", "created": 1627448825, "upvotes": 24}, "h6sot76": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sot76/", "text": "I know this is the exact opposite of what you asked for lmfao BUT the BEST icebreaker I ever did was move-in day of freshman year at the dorms because I met my now-fiancé!! They put the building’s residents into 2 big lines and shouted a question, then you had a minute to discuss it with the person opposite from you and then you shifted over to the next person. We got paired up and the rest is history!", "author": "more-asbestos", "created": 1627448754, "upvotes": 13}, "h6snli4": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6snli4/", "text": "This wasn't an icebreaker but an in-class assignment. We had to publicly rate our own attractiveness and intelligence. To exactly nobodies surprise, everyone overrated themselves.", "author": "Ben__Diesel", "created": 1627447978, "upvotes": 31}, "h6sm2uh": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sm2uh/", "text": "This particular icebreaker happened quite frequently in high school where we started with one end of the room and had to say our name and the next person would say their own and all the ones prior to them. It was alright if you went first, but awful if you were last.\n\nSome teachers even had us say our name and something we like that begins with the same letter as our first name (i.e. “Sierra, sour patch kids”)\n\nNot fun because you were nervous the whole time that you were going to mess up someone’s name and this ice breaker took way too long.\n\nOn top of that, if you went to a large high school like me, a lot of people did not know one another, so it wouldn’t make things easier 😂", "author": "coolchickstar", "created": 1627447013, "upvotes": 6}, "h6sln6g": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sln6g/", "text": "Anything that involves singing is automatically terrible.", "author": "K3yB0ard5eizur3", "created": 1627446745, "upvotes": 8}, "h6skxeh": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6skxeh/", "text": "Go to church. I'm not religious, I've gone to church with 2 different ex girlfriends and it was so uncomfortable. I knew they wanted me to go because the experience meant a lot to them, and I understand why people like to or feel they need to go to church, but it's just not for me.", "author": "WhatABlake", "created": 1627446307, "upvotes": 4}, "h6sjeas": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sjeas/", "text": "During my freshman welcome week, I remember the worst one being an activity that involved toilet paper.\n\nThey told us to grab as much as we wanted, and once everyone got their piece, they explained to us that for each square, we would have to tell one 'interesting fact' about ourselves. It was...very, very difficult to make up 15 things on the spot.\n\nThe other usual yet awful icebreakers are the 'name, major/minor, year, and 1 interesting fact.' The only relatively interesting thing about me is that I have 6 birds, but I'm usually met with weird stares. Fun stuff.", "author": "Greasy_Panic", "created": 1627445396, "upvotes": 21}, "h6sandy": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6sandy/", "text": "I hate anything that has to do with remembering people’s name. It’s embarrassing for both parties.", "author": "YesCoconutWater", "created": 1627440579, "upvotes": 18}, "h6s5t2u": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s5t2u/", "text": "Literally made us sit in a kindergarten circle and dance in front of the people in our split up groups.\n\nWe were just freshman\n\nIt was the freshman welcoming party at night\n\n\nI can't dance\n\n\nNeither could many others\n\n\nLord make me forget the cringe", "author": "peyott100", "created": 1627438121, "upvotes": 43}, "h6s3713": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s3713/", "text": "Name, pronouns, major, where you're from, fun fact about yourself and open up your camera in an online zoom class of 40 people. Almost took the entire class time", "author": "GoldRequest", "created": 1627436819, "upvotes": 34}, "h6s2w3p": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s2w3p/", "text": "I hate the telephone game. I always get someone who says something gross or makes no sense and then I have to repeat it.", "author": "Kirbylover16", "created": 1627436667, "upvotes": 31}, "h6s2les": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s2les/", "text": "All of them 😂🤷🏻‍♀️", "author": "Throwawayaccounttt__", "created": 1627436520, "upvotes": 6}, "h6s0mcg": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6s0mcg/", "text": "I sit near the back of the class so I can leave fast if they tell us to do these", "author": "KING_COVID", "created": 1627435535, "upvotes": 13}, "h6rzt1b": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rzt1b/", "text": "Once when I was about 16 I went to a college acting workshop to learn the Meisner technique... We had to choose a partner (a stranger), sit crosslegged with our knees touching, and stare deeply into each other's eyes for about 25 minutes (no laughing or talking allowed). Then we had to take turns complimenting each other. There was some other stuff that I think I've blocked out due to the trauma.\n\nIt certainly broke the ice, but it also broke me a little bit.", "author": "SnooMaps460", "created": 1627435133, "upvotes": 57}, "h6rz4z3": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rz4z3/", "text": "hug the person next to me for three minutes. like what the fuck was that", "author": "babylainey1", "created": 1627434803, "upvotes": 589}, "h6rwz33": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rwz33/", "text": "Had to tell people our favorite color….", "author": "willbio", "created": 1627433736, "upvotes": 4}, "h6rwdlp": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rwdlp/", "text": "It was in high school but the teacher literally made us pick a rock out of a tub and introduce our pet rock to the class. I was cringing the whole time.", "author": "gtrman571", "created": 1627433436, "upvotes": 32}, "h6rw32h": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rw32h/", "text": "Tied between “what type of instrument are you?” and “what type of cheese are you?”", "author": "TheStockMeerkat", "created": 1627433293, "upvotes": 33}, "h6rv5yt": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rv5yt/", "text": "Step up to the line\n\nWe all stood in a loose circle with a smaller circle in the middle. Whenever you agreed with or identified with a phrase, you were supposed to step to the smaller circle. Then you would step back.\n\nThese ranged from \"I identify as famale\" to \"I follow liberal politics most closely\" to \"people of the GRSM deserve to have the same rights\" to \"I don't get along with my parents\". It was awkward as Hell and people refused to look at others because some of the questions were really personal.", "author": "SnapdragonPBlack", "created": 1627432831, "upvotes": 24}, "h6rv2hj": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rv2hj/", "text": "we were given a random object and had to make noises imitating it and everyone else had to guess what it was. except they weren't things that made noises, it was stuff like \"fire hydrant\"", "author": "ekwater", "created": 1627432783, "upvotes": 20}, "h6ruqfm": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ruqfm/", "text": "well  I mean I once used the introduction Hi I'm (my name here) and I'm going to buy you drinks until you find me attractive ( this was intended as a joke I was a little tipsy already). But the guy laughed and told me then I would be buying a lot of bottle water.  That made me laugh and well... his name was David he was cute and we hooked up ... it was a good weekend...  I didnt  really register the cringe of that particular line untill the following Monday in the middle of my  Circuits lab...lol\n\n Never saw David again after that we didn't exchange numbers or social media just a brief bit of fun and a fond slightly fun memory now", "author": "pygmypuffonacid", "created": 1627432617, "upvotes": -1}, "h6rudtr": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rudtr/", "text": "This didn’t happen in college thankfully, but when I was in middle school at a church event we did an icebreaker where you had to pass a carrot from person to person holding it between your knees. It was SO AWKWARD", "author": "mkrae2000", "created": 1627432447, "upvotes": 81}, "h6ru84j": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6ru84j/", "text": "Well, a good one I had was a professor who just asked what our favorite show was. He was like, \"I need reccomendatuons lol.\" Honestly I felt like a lot of the student personalities were reflected in each show they picked.", "author": null, "created": 1627432367, "upvotes": 249}, "h6rsokp": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rsokp/", "text": "The classic fun fact. I swear I feel like the most boring person in the room.", "author": "RealIntel", "created": 1627431607, "upvotes": 52}, "h6rrsup": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rrsup/", "text": "There was one where we went around in a circle and we had to state our name and an interesting fact, then the next person had to repeat our name and interesting fact and add on their own name & fact. So it was a long chain of remembering names and facts and this was all on the first day.", "author": "bing-no", "created": 1627431173, "upvotes": 109}, "h6rrbbs": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rrbbs/", "text": "Make up a handshake together.\n\nThis kid was really into doing this one handshake and we had the most lit handshake but it didn't break the ice between us two lmao (Plus tha handshake was kinda sus, looked like we were doing a gang sign lol). Plus his hands were really really rough and sweaty and I was like yeeesshh\n\nTo add to this, in middle school I did an ice breaker where we had to introduce ourselves to the class and add a word that describes us with the same letter of our name in front of our own name. and I thought the word 'eerie' was intellectually smart LOL,  So I went by Eerie (insert name) for a whole fucking year. The teacher said \"wow, I like that one\" YEAH MRS. PETERS i'M SURE YA DID ALRIGHT!\n\nOnce I learned the meaning of the word Eerie I asked to change it lol. That was another bad ice breaker", "author": "Lelricaa", "created": 1627430932, "upvotes": 50}, "h6rqvlf": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rqvlf/", "text": "Would like to ask tho...what would actually be something yall would want to do?\n\nI've done shitty activities, but have lowkey come to the conclusion that there isn't rlly an activity that ppl actually would want to do.", "author": "ItzN0tMe", "created": 1627430716, "upvotes": 75}, "h6rq1to": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rq1to/", "text": "we all had to share our pronouns, that's it. Nothing else", "author": "ahbearcat", "created": 1627430309, "upvotes": 30}, "h6rowh1": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rowh1/", "text": "ahhh yes, almost every college class had introductions with the classic “sAy yOuR nAMe, yOuR mAjOr, aNd aN inTeReStiNg fAct aBouT yOu” \n\ni would always have to wrack my brain to think of something remotely unique for the fact haha", "author": "SnaccAttack12", "created": 1627429743, "upvotes": 99}, "h6rnkqj": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rnkqj/", "text": "this wasn’t in a college class but it’s the one ice breaker i hate the most. i don’t know what it’s called but basically the group stands in a circle and you go around saying your name. the leader picks someone to stand in the middle and they point to someone on the outside. the person crouches down and the 2 people on their right and left have to guess each other’s name. the person who didn’t guess the other persons name fast enough switches with the person in the middle and they repeat with picking people on the outside and switching back and forth. as someone who is horrible with names this was such an anxiety inducing game that i wish i could never do it again", "author": "ewephantsc", "created": 1627429102, "upvotes": 308}, "h6rmj09": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rmj09/", "text": "During my freshman orientation they ran an activity called “Trivia Race”. We were split into two teams and our orientation leaders would read off random questions about the school, city, pop culture, etc. We’d then have to run to the other side of the room, and whoever arrived first would try and answer the question. If they got it right, their team got a point. If not, someone on the other team could try and answer.\n\nProbably would’ve been relatively fun, but one guy who took it way too seriously shoved a girl in one of the early rounds. She wound up taking a nasty spill and breaking her wrist. \n\nDefinitely killed the mood.", "author": "bakedpotatowcheezpls", "created": 1627428595, "upvotes": 141}, "h6rm0fw": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rm0fw/", "text": "I hate all of them. The really bad ones are the \"name, major, career goal\" especially when its for like a 400 level class where everyone has the same major and similar career goals.", "author": "Nosleep_9764", "created": 1627428347, "upvotes": 394}, "h6rlw2w": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rlw2w/", "text": "I’d say just a basic “fun fact” because you get boring stuff about “I’m the youngest of 3” and then someone goes “my dad killed someone” and makes it awkward for everyone", "author": "KeiraBearStella", "created": 1627428292, "upvotes": 449}, "h6rlvgl": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rlvgl/", "text": "We all had to stand in a circle and the teach er began: \"I'm the creative Carolin\", while doing some kind of over the top movement of swinging a pen or brush of some kind. Next person had to repeat (\"She is the creative Carolin\"), including the exaggerated movement (!) and adding her own alliteration of Adjektive, Name and corresponding movement.\nIf it was deemed to timid by the teach er, the Person had to try again until he/she got it \"right\". \nWe were 50 People.\nPeople tried to say no, but were harshly beratend by the teacher, telling them that they had to, because it was needed that every body had to learn everybody\"s Name. It Was a class on adult education...", "author": "Maraakis", "created": 1627428284, "upvotes": 422}, "h6rhe0h": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rhe0h/", "text": "Painting T-Shirts with positive sayings never felt more like a cuck in my life.", "author": "TG721", "created": 1627426162, "upvotes": 16}, "h6rfjgm": {"link": "/r/college/comments/osvg0l/whats_the_worst_icebreakeractivity_youve_ever_had/h6rfjgm/", "text": "Two truths and a lie is always so boring. Always the same, I have 2 brothers, etc.", "author": "bumfuzzle179", "created": 1627425297, "upvotes": 504}}}