{"sid": "pwow2i", "link": "/r/college/comments/pwow2i/college_charging_for_covid_tests/", "title:": "College Charging for COVID Tests", "text": "Hey everyone. I just wanted to share this and find out if this is common in other colleges now. I am a freshman at a small, private college. The college’s current Covid policy is that unvaccinated students must get Covid tested twice a week, at $6 a test. I was under the assumption that these charges were made to our tuition accounts. I just got fully vaccinated, but when I came to school I had only had my first dose and I was still required to get tested. This college is known for providing on-campus jobs for all students, and I should have made $54 from the few hours I had worked the past 2 weeks. I was paid $11 because the college took out the cost for all of my last Covid tests. \n\nI understand that this college is trying to keep the campus safe and they are pushing for all students to get vaccinated. I just find it really frustrating to have the little bit of money I made taken because of the Covid testing. Does anyone else’s college do this?", "author": "aquaderbian", "created": 1632771928, "retrieved": 1632945521, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"hel9puq": {"link": "/r/college/comments/pwow2i/college_charging_for_covid_tests/hel9puq/", "text": "They’re charging us 200 dollars...it’s almost like they don’t want us to get a test...", "author": "Missmaniequinn", "created": 1632834244, "upvotes": 2}, "hejqb4i": {"link": "/r/college/comments/pwow2i/college_charging_for_covid_tests/hejqb4i/", "text": "My school doesn't charge, but it's also required for everybody even if you're fully vaccinated (which is also required). So there's no element of financial incentive (if that is what's going on).\n\nBut also, COVID tests do cost the school money, and doing it for hundreds or thousands of students a week could add up quickly. It kind of makes sense to charge if the school doesn't have a big endowment.\n\nThat definitely seems really frustrating though.", "author": "91p348", "created": 1632795950, "upvotes": 2}, "hejk9cq": {"link": "/r/college/comments/pwow2i/college_charging_for_covid_tests/hejk9cq/", "text": "$6? They charged my roommate $500. I’m jealous.", "author": "Paxiet", "created": 1632793139, "upvotes": 2}, "heikhrw": {"link": "/r/college/comments/pwow2i/college_charging_for_covid_tests/heikhrw/", "text": "Many colleges are charging for testing.  The choice is get a free vaccine or pay to be tested. You could have gotten vaccinated prior to starting school and you chose to wait. Why should colleges pay for testing?", "author": "Significant-Equal-12", "created": 1632776256, "upvotes": 2}, "heiccyp": {"link": "/r/college/comments/pwow2i/college_charging_for_covid_tests/heiccyp/", "text": "That’s insane.  What kind of college do you go to? A for-profit-one?", "author": "jolygoestoschool", "created": 1632772607, "upvotes": 3}}}