{
  "sid": "qwajrz",
  "link": "/r/college/comments/qwajrz/looking_for_opinions_re_online_communication/",
  "title:": "Looking for Opinions RE: Online Communication Platforms for Colleges and Universities",
  "text": "I'm currently doing a research project on the advantages / disadvantages of various different communication platforms within the post secondary educational setting. I've chosen to focus on why colleges and universities **should** consider adopting Discord as a preferred communication technology, especially within the scope of the Covid-19 pandemic and most classes going online. \n\nI was hoping to get some first hand opinions from folks on here.\n\n**Do you think that Discord is a communication platform that post-secondary educational institutions should adopt for internal and external communication between students, faculty and administrators?** If the answer is yes, why do you think Discord is a good (or the best) option for the internal and external communication needs of colleges and universities? If the answer is no, then why not? What do you see as the biggest shortcomings of the platform being used for this purpose?\n\n**Do you feel that Discord is a better option for facilitating online classrooms than other commonly used platforms (such as Zoom, Big Blue Button, Blackboard, Microsoft Teams, etc.)?**  \nIf your answer is yes, what is your reasoning? If no, then why not? \n\nI understand that this is a Zoom related Reddit Server but, I thought that folks here would be able to provide invaluable input. \n\nIf you have any resources, that support your opinion or that help provide a basis for your opinion, and you are willing to share links to those resources or the titles so I can search for them, that would be really useful for further research.\n\nThank you for your time and consideration! I really appreciate it!",
  "author": "PrintPunk",
  "created": 1637187741,
  "updated": 1637354203,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}