{"sid": "n465vj", "link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/", "title:": "Just got the worst call of my college career, not sure who else to talk to.", "text": "So my graduation date is this Saturday May 8th, I got a job lined up and I start Monday. I just got a call from my advisor saying he made a mistake and I’m somehow missing a core business class I need to graduate. I’ll still get to walk but have to take a 10 week online class over the summer. Don’t really have many people to talk to about this so thought I’d turn to Reddit. Just disappointed I was sitting here thinking I was studying for my last exam, I feel defeated and unaccomplished.", "author": "DemonsInsid3", "created": 1620073044, "retrieved": 1632946843, "over_18": false, "upvotes": 1936, "upvote_ratio": 0.98, "comments": {"gwxvxb1": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwxvxb1/", "text": "You should see if you can double check this. The same thing happened to me when I graduated and they told me a course that was supposed to count for my degree wouldn’t. I ended up talking to the head of the department and explaining what happened and everything worked out, so maybe you can start there?", "author": "buonatalie", "created": 1620158157, "upvotes": 1}, "gwxcnio": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwxcnio/", "text": "So here’s the thing: college administrators are very malleable and very stupid. Raise hell with them.", "author": null, "created": 1620146756, "upvotes": 2}, "gwwqqk0": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwwqqk0/", "text": "[deleted]", "author": null, "created": 1620137837, "upvotes": 1}, "gwwpmvj": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwwpmvj/", "text": "In the bad old days before computers this happened all the time.  You needed to do a “degree check” which had a huge wait list.  I skipped it.  Was short one credit.  I got a job that was an overnighter. I lived near a different university that my school took transfer credits from.  I signed up and got an ID and everything for one credit.  I took “weightlifting” which was a “pass/fail”.  I worked my overnight shift (Television Operations) and went to the 8:30AM class after work.  Half the time I snoozed on the bench press.  My diploma is a year later than my friends, but the school still counts me in the earlier class.\nEnjoy being a student a little longer.  Get over it.", "author": "D33NIL3", "created": 1620137362, "upvotes": 1}, "gwwlbvy": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwwlbvy/", "text": "Na na na you good boss. You worked hard, it was a mistake. Explain it to your job that you have lined up. Do the 10 weeks, done. Life wouldn’t be fun if everything is easy, curveballs means you doing something right", "author": "Frenchdu", "created": 1620135445, "upvotes": 2}, "gwwg0a1": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwwg0a1/", "text": "See if the dean is willing to waive that requirement.  I was able to write a letter for my mom on a similar situation, and they let her slide on a foreign language core course because it wasn’t pertinent to her degree and the catalog had some vague wording.", "author": "Cruiser5139", "created": 1620132758, "upvotes": 1}, "gww7mlj": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gww7mlj/", "text": "Bro it's just one class more u went through so many classes and got a job in these times chill boi everything will be fine and tell ur employer so no confusion afterwards", "author": "parekhdhairya007", "created": 1620127754, "upvotes": 2}, "gww6ehe": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gww6ehe/", "text": "I had basically had same experience 30 years ago when I was graduating. It was a detail about how a course was classified that could be interpreted two different ways based on the way a couple different places in the catalog were phrased. Anyway, I got a professor I knew well (obviously not the advisor who failed me) to help. They ended up letting me graduate after he talked to the Dean, but the prof was willing to make my job an “independent study” with him to satisfy the requirement if we had to. Not sure if something like that might apply in your case but worth considering. Maybe the advisor who screwed up would do it with you and fix his error in a sense. \n\nThe funny part was that I graduated a semester early in December and the prof told me they had bragged about me in the end-of-semester faculty meeting how I had landed an impressive job. Then, after the holidays during my first week on that job I got call I hadn’t really graduated.", "author": "EWagnonR", "created": 1620126896, "upvotes": 3}, "gww51j9": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gww51j9/", "text": "Definitely go talk to someone on campus. I majored in graphic design and had to take a bunch of these art foundation classes. Somehow I never took this drawing class and when it came time to graduate, I was told that I might need to take it over the summer. \n\nWent to go see the dean, he saw and laughed and signed some paper work to sign off on me having taken it.", "author": "_heisenberg__", "created": 1620125901, "upvotes": 2}, "gwvwmqi": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvwmqi/", "text": "One course is nothing compared to what you have already accomplished, don't let this demotivate you! Be patient for just a little more time, the biggest part is over so, good job and good luck!", "author": "Free_Overthinking", "created": 1620118674, "upvotes": 3}, "gwvwaj8": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvwaj8/", "text": "Hey man 10 week online class? You got this! Nah get in the way w work but I’m sure once you’re done you’ll feel like a god! Good shit!", "author": "Own-Maximum-2087", "created": 1620118365, "upvotes": 1}, "gwvojn7": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvojn7/", "text": "I'd make that advisor's life unpleasant if I lost a job offer and had to delay entry into working life by months over a  technicality.\n\nYou need to stand your ground here, especially if the job is a good opportunity. You've probably paid tens of thousands of dollars to this institution over the last couple of years. For them to upend your plans on a whim with no consideration for _your_ well-being would be ridiculous. \n\nMake it evident to them the cost they'd be imposing on you by being obstinate. Talk to the advisor. Talk to the advisor's boss. Talk to the dean. I seriously doubt anyone would actually want to own hamstringing a student on the cusp of success.", "author": "lordorwell7", "created": 1620111322, "upvotes": 3}, "gwvoeiw": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvoeiw/", "text": "You will get through this. It fucking sucks, but one day you will be able to look back and laugh at this BS. So sorry that this happened to you. Hopefully this is the worst thing to happen to you for a long time and your next several years are super successful!", "author": null, "created": 1620111200, "upvotes": 1}, "gwvlot3": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvlot3/", "text": "I did a transfer guarantee program when I was in community college. Fucking consular missed the deadline to mail it in.", "author": "herr_leutnant", "created": 1620108870, "upvotes": 1}, "gwvlop7": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvlop7/", "text": "Keep your chin up, I am in a very similar situation where I ended up needing one more elective so I had to call my job and tell them. They let me push back my start date and everything is gonna work out. Remember if they gave you the offer than they are willing to invest in you. Good luck!", "author": "rs20_", "created": 1620108867, "upvotes": 1}, "gwvll30": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvll30/", "text": "I'm so sorry that happened to you! I'd be disappointed as well but I'm very proud of you and you shouldn't discredit yourself for it! As much as your last class might be very dreadful to take after feeling release of not having anymore I believe that you can do it!", "author": "Fitznfaith", "created": 1620108783, "upvotes": 1}, "gwvkhw7": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvkhw7/", "text": "You got this bro, if you already got a job offer you obviously have what it takes to make it out there. I have no idea about your college or anything, but I bet they can figure something out for you I mean for fucks sake it can’t be that necessary if you completed every other course and also received a job offer. Like the point of college is not about completing courses and getting grades it’s about learning how to learn, making connections, and preparing for the work force. If you already received a job offer that should be evidence enough that you successfully completed those three goals and you should not only feel accomplished, but also tell your university to blow you because they’re losing sight of what their original purpose was.", "author": "UniqueUsernamedotcom", "created": 1620107904, "upvotes": 1}, "gwvjfnm": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvjfnm/", "text": "I'll be done with my sophomore year now and this post made me anxious already. This is actually one of my biggest nightmares...", "author": "owlwaves", "created": 1620107069, "upvotes": 1}, "gwviokv": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwviokv/", "text": "Lol sad part is, most businesses dont even check your degree status. You can kinda just write whatever you want on a resume", "author": "SegmentedMoss", "created": 1620106494, "upvotes": 1}, "gwvh6kw": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvh6kw/", "text": "It sucks but there is a clear path around this obstacle. You're nearly done with college and you have/had a job lined up which you can definitely get again if you lose this one. Why would you feel unaccomplished?", "author": "z1lard", "created": 1620105375, "upvotes": 1}, "gwvdqdm": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvdqdm/", "text": "I know it seems like theres no hope cuz of your upcoming exam and all that. But im sure theres something that can be done. I know for sure that one of the classes in my degree was excused if you just told the school that you had a job lined up.", "author": "bukake_69", "created": 1620103020, "upvotes": 1}, "gwvdpjs": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvdpjs/", "text": "Not a huge deal, take the class real quick and enjoy the rest of your life.", "author": "QuitaQuites", "created": 1620103006, "upvotes": 1}, "gwvcnl9": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvcnl9/", "text": "This happened to Zack Morris. He was able to bribe a nerd to drop out of the school play so he could fill in and get credit", "author": "nuyiwanski", "created": 1620102322, "upvotes": 1}, "gwvclwb": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvclwb/", "text": "This happened to me and I was completely crushed. Do the class and keep going. Everything happens for a reason and one day this will all be in the past. I believe in you. \nI’m now headed to dental school after all the work I did in undergrad. I look back and i don’t even care that I had to be in school a little longer. Good luck !", "author": "spacedmoon", "created": 1620102292, "upvotes": 1}, "gwvbnb9": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvbnb9/", "text": "The dean once said this but I calculated my own credits and I had more credits than he had counted... so it could be a simple math mistake or in a worst case scenario you take summer school... but look at it on the bright side, it will be online, meaning you can probably still take that job... tell them it's getting delayed and if you must just blame it on Covid... one class during the summer, online doesn't sound so bad. Try to make the most of this experience if it turns out that's what happens but seriously 10 weeks will go by sooo fast!", "author": "sonofkrypton66", "created": 1620101690, "upvotes": 1}, "gwvb3gg": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvb3gg/", "text": "I had the same issue. Explained it to my job, took the class and it all worked out fine.", "author": "Nerobus", "created": 1620101344, "upvotes": 1}, "gwvae2s": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvae2s/", "text": "There's a special place in hell for advisors who do this shit. What an asshole.\n\nE: Uh oh, I found the advisor.", "author": "highpl4insdrftr", "created": 1620100910, "upvotes": 0}, "gwvada3": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwvada3/", "text": "i would highly recommend asking your employer to push back your start date to fall", "author": "Anish-is-a-god", "created": 1620100896, "upvotes": 1}, "gwva2qr": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwva2qr/", "text": "Do you opt have degree audits at your school? That’s the most appropriate way to account for your credits. You should know where you’re at", "author": "likemikelikemike", "created": 1620100715, "upvotes": 1}, "gwv9x62": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv9x62/", "text": "That’s not on you. Congrats on making it this far and good luck. :)", "author": "JasonT613", "created": 1620100618, "upvotes": 1}, "gwv8ouw": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv8ouw/", "text": "Before you go any further, make absolutely certain the advisor is correct. You were assigned an academic catalog based on when you attended your first semester or, perhaps, when you changed your major (if you did). This catalog spells out what courses you need to take to graduate. At my university, catalogs are written in stone, and they'll only change your catalog if you agree to it.\n\nIf your catalog does not specify that this course the advisor tells you to take is a requirement, maybe contact your school's academic advising office.", "author": "Comprehensive-Ad3963", "created": 1620099880, "upvotes": 1}, "gwv8co1": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv8co1/", "text": "Your advisor or dean can 100% override this. I had something similar happen to me and I made a huge stink with the dean and they put it through without it.", "author": "tcosta2009-", "created": 1620099681, "upvotes": 1}, "gwv6jtw": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv6jtw/", "text": "That sucks, but really doesn't diminish anything. I had to take two PE classes at a community College to get my HS diploma (PE requirement for graduation is stupid). 10 weeks will fly by and you'll be done forever.", "author": "pfroo40", "created": 1620098645, "upvotes": 1}, "gwv5e3p": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv5e3p/", "text": "You should talk to the dean and tell them what happened. At the very least they should give you an override to get into the course even if it’s full. I’m a professor and once I made a mistake like this. I went to my dean and the dean was able to give an override to count another class instead and the student graduated on time", "author": "anabaena1", "created": 1620097997, "upvotes": 1}, "gwv3mbw": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv3mbw/", "text": "Am advisor. This is my nightmare.  I haven't had it happen yet (knock on wood), but I am **relentless** about making sure my students understand their degreeworks and what they need to do to complete the degree because it's on both of us to ensure things are tracking the way they're supposed to. I check it every time we meet. You did mention you noticed one class wasn't counting but figured your advisor knew better than you - for others reading - even if you think that's the case, ask the question when you notice it!  \n\n\nI would tell your job about the situation. It may not be a big deal, especially if you're able to enroll in the class online over the summer - and see if people can advocate for a capacity override if the class is full given that you're in the situation because your advisor made a mistake. You mentioned you're back and forth about telling your employer - if you choose not to tell them, that's a risk. If they find out, they're likely going to be far more upset that you withheld information from them than they would have been if you explain the situation and what you are doing to remedy it.\n\nSome institutions use faculty advisors, who are already stretched so thin with their research, service, and teaching commitments.  Some faculty advisors are great, but I generally find that they have good career advice, good advice about selecting courses in their major, but most tend to be woefully underprepared to manage university requirements, especially if they change frequently. I'm a professional academic advisor, which means this kind of stuff is my full-time job.  My college regularly surveys students about advisor satisfaction and we consistently do well on those surveys, so for our population, what we're doing seems to work. However, advisors are sometimes put in terrible, untenable positions (like advising 1000+ students) and we're human; we make mistakes. Plus, like any field, there are good advisors and bad advisors.  I don't know the whole story so I won't make a judgment on your particular advisor, just wanted to provide some insight.", "author": "trustmeiknowthings", "created": 1620097034, "upvotes": 2}, "gwv3gih": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv3gih/", "text": "Stay up!\n\nIm only in hs and im sure classes are hard as hell but everything happens for a reason and anything that happens in your past is meant to mold you into the great person you're becoming!", "author": "wooski29", "created": 1620096949, "upvotes": 1}, "gwv1qe8": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwv1qe8/", "text": "super sucks but this sounds very fixable. try to breathe and once you get started/finished with that class you’ll be laughing :)", "author": "eminemondrugs", "created": 1620096048, "upvotes": 1}, "gwuz55u": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuz55u/", "text": "I've come to the realization that Advisors don't actually advise. If you have a question, they're just going to direct you to someone else. I had to fight with my advisor over nine credits because he thought I had taken the classes, but I am actually set to take them this summer.\n\nI'm sorry this happened, especially when you were so close to being done. But ten weeks are going to fly by, and you will get your diploma right after...I'm not sure if you should explain the situation with your job or not if you think that'll interfere or not, but it'll fly quickly...I noticed that you mentioned that the business classes are full, email the head of the department and explain that you need this one last class so you can graduate at the end of the summer. Most of the time, they aren't heartless and will let you in.\n\nGood luck!", "author": "Nerdyxwitch", "created": 1620094718, "upvotes": 1}, "gwuxcg6": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuxcg6/", "text": "My wife had the same thing happen. She just never mentioned it to her job since she had already accepted the official job offer and it went just fine.  Sucks either way though. Sorry. Stupid college. They pull this stuff ALL the time.", "author": "leigh621", "created": 1620093799, "upvotes": 3}, "gwuwrpf": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuwrpf/", "text": "OP, I was a music major in undergrad. There were several points during that degree I had to get an override for class capacity/other reason because of the nature of my schedule. At my institution, it was an online form that just got sent to the deans office. They approved it, I could register for the course I needed. See if you can get a capacity override for the online class. This still might be a salvageable situation!", "author": "bills165", "created": 1620093506, "upvotes": 4}, "gwuwqkx": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuwqkx/", "text": "Look at it like this least your graduation wasn’t delayed", "author": "Isometimeswrite98", "created": 1620093491, "upvotes": 1}, "gwuv95r": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuv95r/", "text": "Run the limit on the internet class up the chain of command. Prof So-n-so doesn't want to teach a summer class with one more student? Get the dean to push that door open a little wider!", "author": "CindsSurprise", "created": 1620092767, "upvotes": 2}, "gwuuveq": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuuveq/", "text": "Why not just work while taking the 1 class? Doesn’t seem too bad to me but I’m not sure your entire situation. good luck", "author": "FinisherReZ", "created": 1620092582, "upvotes": 1}, "gwuudtq": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuudtq/", "text": "Worst call to far!", "author": "clicly-clack_blue", "created": 1620092345, "upvotes": 1}, "gwutjhe": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwutjhe/", "text": "I understand - it sucks! Do take the job, though! I doubt your employer will care. It was a mistake, an accident, and you are so excited to get that diploma, so you should still walk at graduation.", "author": "SWettergren", "created": 1620091944, "upvotes": 5}, "gwut373": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwut373/", "text": "I’ve only messed up like this twice as a professor/advisor. Both times I made it work, begging the Registrar to find a loophole and making it very clear it was my fault. I find this so common and absolutely abhorrent.", "author": "angelinuta", "created": 1620091726, "upvotes": 4}, "gwusfox": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwusfox/", "text": "I dont think college could get more retarded", "author": "Jay_Babs", "created": 1620091407, "upvotes": -1}, "gwus19w": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwus19w/", "text": "Did they tell you last time you saw your advisor that you would graduate? I would raise hell man. \n\nThey tried to do the same thing to me for a class that I was enrolled in but they dropped because there wasn’t enough students. I said when am I supposed to take it and they said it would be available again in the fall and I said I’m graduating this spring so figure it out. They ended up rolling one of my credits to cover that credit and then another one to cover the one they moved\n\nEdit to add: basically everyone I talked to at my university had been screwed at one time or another by an advisor. They don’t know what the hell they’re doing. If you put enough pressure on them they’ll snap", "author": "uglybutterfly025", "created": 1620091210, "upvotes": 10}, "gwuqa4f": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuqa4f/", "text": "How tf does an advisor make that kind of mistake? Doesn't your school have degree audits that can be used to check degree progress. Nevertheless, congratulations on a successful 4 years. Do not let a summer course ruin the moment when you still get to walk and keep your upcoming job. 10 weeks will be over before you know it.", "author": "RisingSunofJapan", "created": 1620090355, "upvotes": 23}, "gwuot9p": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuot9p/", "text": "Honestly what is the point of having advisors. At least in my university, I feel like their advice isn’t really that helpful and then they screw up with basically the most important part of their job which is making sure students graduate. Why does this profession need to exist?", "author": "thejman1208", "created": 1620089648, "upvotes": 3}, "gwunzvp": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwunzvp/", "text": "Some college advisors are so incompetent for some reason", "author": "shl05", "created": 1620089249, "upvotes": 8}, "gwumiv5": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwumiv5/", "text": "Honestly you may wanna try and stand your ground. Go in and say “look I know this was an accident but you screwed this up. If I’d known about this class over the last 4 years I would’ve knocked it out in time but there’s not a lot I can do about it when you drop it on me in my final semester a week before graduation. It’s ridiculous that I’ve paid a lot for this education and your office screwed this up. You need to make it right and let me graduate.” \n\nIt’s big bullshit that they did that to you.", "author": "Ironman870", "created": 1620088530, "upvotes": 102}, "gwulok6": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwulok6/", "text": "This exact thing happened to me but I got my advisor to count another course I took as a substitute for the one I needed.  I don't know if you can do that with a core course but it's worth asking.  What BS.", "author": "poop_on_you", "created": 1620088116, "upvotes": 51}, "gwuk6xa": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuk6xa/", "text": "Your advisor sucks I finally found a good one and I’m trying to find a good one for University. Not all advisors care about the student I had a couple I questioned whether they knew what they were talking about. I would see if you really have to take the class be for sure go to someone trusted. Also if so I know it sucks but you’ll make it through that summer.", "author": "OnceUpnASuit43", "created": 1620087402, "upvotes": 1}, "gwujxyh": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwujxyh/", "text": "I’m sorry OP. Sadly, if you want something done right, you have to do it yourself. I always have double checked everything my advisor says and emailed other people like department heads about credit questions too if my advisor was ever unclear about something. I hope you get this straightened out and can still take your job.", "author": "spencerschmudde", "created": 1620087283, "upvotes": 18}, "gwujx51": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwujx51/", "text": "Man I’m sorry that sucks. This is why you do your own research as well.", "author": "NoSpaceAlien", "created": 1620087272, "upvotes": 2}, "gwujpr4": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwujpr4/", "text": "I’d keep my lip zipped with your employer. You’ve already been hired, and you’ll finish the degree.", "author": "dalej42", "created": 1620087173, "upvotes": 4}, "gwuddk5": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwuddk5/", "text": "[deleted]", "author": null, "created": 1620084131, "upvotes": 6}, "gwubvc3": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwubvc3/", "text": "if the mentioned class if full at your university, are you able to take it at a community college and then transfer those credits? Lots of community colleges offer online classes and usually have tons of seats open", "author": "gia477", "created": 1620083422, "upvotes": 68}, "gwubt7u": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwubt7u/", "text": "Check your Degreework, if you have that. It tells you the % completed of core classes. Just do it to verify what the advisor said.", "author": "ImportantGreen", "created": 1620083393, "upvotes": 43}, "gwu0a9n": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwu0a9n/", "text": "First off, this ain't your fault. This is your advisor's fault. Your advisor should feel unaccomplished, not you.", "author": "Jew_Brooooo", "created": 1620078025, "upvotes": 175}, "gwtxge8": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwtxge8/", "text": "I've seen things like this happen a few times over the years.  Unhappily, even though it was an honest error you will probably still have to take the summer course.  At least they are letting you walk and there is a ready fix by taking the summer course.  Its a bummer, but there is no reason for you to feel defeated over it.  Edited to add: I agree with the answers which say to see if they will make an exception to the size limit of the online course.", "author": "taxref", "created": 1620076766, "upvotes": 17}, "gwtvxez": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwtvxez/", "text": "First things first, head to the counseling office to see if there’s a class or experience that can be ‘double counted’. \n\nFind out what you need to do to get those credits.\n\nNext, let your job know (if a degree is mandatory) most will let it go if you have a plan in place or are working on the final few credits. \n\nDeep breath, this will be fine. \n\nBest of luck to ya!", "author": "MomfromAlderaan", "created": 1620076091, "upvotes": 1320}, "gwtstiq": {"link": "/r/college/comments/n465vj/just_got_the_worst_call_of_my_college_career_not/gwtstiq/", "text": "Dude I'm so sorry. That sucks. It won't interfere with your new job will it?", "author": "hoopyloop3008", "created": 1620074742, "upvotes": 222}}}