{
  "sid": "qnbwql",
  "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/",
  "title:": "How to go to college/university in America?",
  "text": "From the UK and I understand that it can be very difficult to get into a university in a place like America. I understand that you need to do *very* well in everything to even stand a chance of going there, right? Is it better to go to a uni here that'll just send me over to America for a year?\n\nDoing my A-Levels and I plan on taking one or two years out of education so I can work and earn some money afterwards. Any advice?",
  "author": "HoldEquivalent",
  "created": 1636121232,
  "updated": 1636186096,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjf7wvc": {
      "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjf7wvc/",
      "text": "Stay in the UK. American college is VERY expensive and not worth it if you want to end up living in the UK.",
      "author": "beepbopboopbop69",
      "created": 1636124425,
      "upvotes": 9,
      "replies": {
        "hjffw2q": {
          "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjffw2q/",
          "text": "I honestly do want to live in America when I finish with education, I'm still unsure on how to go about doing that as well.",
          "author": "HoldEquivalent",
          "created": 1636127556,
          "upvotes": 1,
          "replies": {
            "hjflo9h": {
              "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjflo9h/",
              "text": "What's your motivation?\n\nCanada, New Zealand, Australia, and the US are the four western countries that are a pain in the \\*\\*\\* to immigrate to. Going to school here on an F-1 visa won't necessarily give you the right to work or live here after you graduate.\n\nThe pay is higher than the UK but you might also have more living expenses like a car. You'd also be ditching stuff like your minimum 28 PTO days per year because there is no legal minimum in the US. From my understanding it would make more sense, to me at least, to work for a US company but live somewhere else.",
              "author": "darniforgotmypwd",
              "created": 1636129788,
              "upvotes": 1,
              "replies": {
                "hjgg7e5": {
                  "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjgg7e5/",
                  "text": "I just hate living in England. Nowhere makes me more depressed than this place. I've been to practically every town and everywhere is miserable and I just hate it here and America seemed like the best bet in turns of being similar but less miserable. My other idea was going to Canada.",
                  "author": "HoldEquivalent",
                  "created": 1636141433,
                  "upvotes": 3,
                  "replies": {
                    "hjgjrjx": {
                      "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjgjrjx/",
                      "text": "I'm not sure going to a place you've never been to is the best choice, then. Especially if you can't identify why you like or dislike places.\n\nYou would be better off visiting a few cities before making any big choices.\n\nWhat about Germany, Belgium, the Netherlands, or another nordic country?",
                      "author": "darniforgotmypwd",
                      "created": 1636142762,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjfkx2i": {
      "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjfkx2i/",
      "text": "It's not competitive compared to general European standards. You don't need to do very well and it's probably easier to get accepted into a US university than your domestic counterpart.\n\nThe barrier is higher tuition cost. That and the visa requirements, which really aren't that difficult to navigate for F-1 papers but the process is bureaucratic.",
      "author": "darniforgotmypwd",
      "created": 1636129496,
      "upvotes": 4,
      "replies": {}
    },
    "hjfht6t": {
      "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjfht6t/",
      "text": "So I did this but I had a massive help bc I have dual citizenship with the UK and US. If you don't have US citizenship you will first need to look into getting a visa. College costs are VERY expensive, especially if you don't have a SSN, since you will be paying international fees. Some collages are better than others and they all range in fees, just do your research. If you have any family over here then start by looking close to them. Another starting point is just googling what Colleges have your major or looking at specialised colleges specifically for your subject area. To get into any College you have to have take the SAT or ACT. You are able to take them in the UK (I did), again just do your research. Get good Alevels but the main thing is the SAT or ACT. Another thing to think about is loans for tuition and housing. Honestly is much more complicated than it looks.",
      "author": "edgy_hedgy_",
      "created": 1636128299,
      "upvotes": 1,
      "replies": {}
    },
    "hjg2ugq": {
      "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hjg2ugq/",
      "text": "It's really a pain to immigrate, and colleges are expensive. How hard it is to get in depends on the institution. I would go to a college in the UK, with the aim of studying abroad in the US. That way you can figure out if you like the US and in particular the area you study in, if you want to move to the US later.",
      "author": "ctrldwrdns",
      "created": 1636136388,
      "upvotes": 1,
      "replies": {}
    },
    "hji2iq5": {
      "link": "/r/college/comments/qnbwql/how_to_go_to_collegeuniversity_in_america/hji2iq5/",
      "text": "OP, what would you like to study? What kinds of things are you looking for in a university, regardless of location? What is your budget? What makes a city/place \"fun\" to you?\n\nAs another user said, obtaining a student visa in the US (Canada, too) and being able to stay to get a job is not as easy as one would think. Also, cost of living and tuition in the US may be more than England, especially in larger \"exciting\" American cities, such as New York City or Los Angeles. \n\nIf I were you, I'd complete uni in England and then maybe apply for a job in the USA and come over if it works out. You'll save a lot of money, trust me.",
      "author": "beepbopboopbop69",
      "created": 1636165634,
      "upvotes": 1,
      "replies": {}
    }
  }
}