{
  "sid": "hyz81o",
  "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/",
  "title:": "UPDATE: Prof has COVID and disappeared after the first week of class...",
  "text": "Some of you asked so here it is .... the big update!\n\nFirst - if you end up in a situation as I did in my [original post](https://www.reddit.com/r/college/comments/gzw2lb/prof_has_covid_and_disappeared_after_the_first/ftioerr/?context=3), this may be helpful info. Maybe not. \n\nSo my professor ended up contracting COVID-19 and disappeared. With about 2 weeks left in our accelerated 6-week summer course, Prof slowly started coming back online. We ended up dropping a lot of labs and quizzes altogether from the syllabus and focused on the important shit. Also, prof made it clear he would be generous with grades since we were left to our own defenses to learn 6 chapters. We wrapped up on time and I got a solid A so I was happy to just wait for the prof to come back in the end. However, I did not learn what I would have had we had a normal class and so that is a little concerning. I am following up with the second part of this subject in the fall ( I took class A1 and now need to take class A2) so I may struggle but only time will tell. Prof did video lectures remainder of class - even being clearly sick he made a solid effort, and I really appreciate that. I thought he was strange for using a cell phone but turns out he was teaching from a hospital while in isolation - which is crazy and I have no idea how Prof did that but they did. \n\nSo here is my advice to any student who ends up in a similar situation. First, start reading the textbook and plan on teaching yourself - while making sure to follow the schedule unless it changes. Message your classmates (even if its 100% online and you don't know them personally), because odds are they have the same questions and will respond to you asap). If you get to the point where you haven't heard anything in over a week first email the Prof, then if no response then email your advisement consular who can help too. If all fails come back here and let us know because we have a LOT of awesome people in this sub that have really good advice. \n\nLife happens. Stay committed and on task. and this too shall pass. \n\nPS: fuck you COVID ...you are really screwing up my graduation timeline and everyone hates you",
  "author": "yUmmmmmie",
  "created": 1595878735,
  "over_18": false,
  "upvotes": 1303,
  "upvote_ratio": 0.99,
  "comments": {
    "fzj5j8n": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzj5j8n/",
      "text": "I guess your professor won't be using 5G anymore",
      "author": "jlin02",
      "created": 1595957049,
      "upvotes": 1,
      "replies": {}
    },
    "fziuonm": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fziuonm/",
      "text": "So glad to hear that your professor is all right now and that you did well in the class. \n\nFWIW, the advice you give is good even in a non-COVID life. If you read the textbook and communicate with your classmates, you'll get a much better understanding with the class notes as the supplement. \n\nI hope that the second part of the class goes well for you and hope that your professor makes a full recovery.",
      "author": "Esmereldista",
      "created": 1595951841,
      "upvotes": 2,
      "replies": {}
    },
    "fzij1jh": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzij1jh/",
      "text": "> and plan on teaching yourself - while making sure to follow the schedule \n\nThis is necessary for college in general.  The prof will present the material, then it's up to each student to consume/understand it however they require.",
      "author": "lupineblue2600",
      "created": 1595945887,
      "upvotes": 4,
      "replies": {}
    },
    "fzh5vo4": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzh5vo4/",
      "text": "Yeesh, yea. I pushed my expected graduation date a year forward because of all this.",
      "author": "SoftwareUpdateFile",
      "created": 1595906219,
      "upvotes": 3,
      "replies": {}
    },
    "fzgy1fg": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgy1fg/",
      "text": "Also it seems like your prof recovered since they came back and appeared? That’s cool",
      "author": "chennin1",
      "created": 1595901554,
      "upvotes": 4,
      "replies": {
        "fziuskl": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fziuskl/",
          "text": "Looks like the prof was teaching from their cell phone while in isolation at the hospital. =(",
          "author": "Esmereldista",
          "created": 1595951895,
          "upvotes": 5,
          "replies": {
            "fzjb53x": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjb53x/",
              "text": "Gosh... so sorry that they had to teach and deal with that!!",
              "author": "chennin1",
              "created": 1595959678,
              "upvotes": 5,
              "replies": {
                "fzjrznk": {
                  "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjrznk/",
                  "text": "Same!",
                  "author": "Esmereldista",
                  "created": 1595967737,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fzgxp85": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgxp85/",
      "text": "[deleted]",
      "author": null,
      "created": 1595901361,
      "upvotes": -1,
      "replies": {
        "fzgz8z8": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgz8z8/",
          "text": "Sometimes people cope with humor. I thought it was funny.",
          "author": "SquigglyHamster",
          "created": 1595902261,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzgt39a": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgt39a/",
      "text": "Your prof deserves all the reddit awards in the world",
      "author": "puffymustash",
      "created": 1595898708,
      "upvotes": 15,
      "replies": {
        "fzjr29n": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjr29n/",
          "text": "Stop giving reddit money",
          "author": "spore1234",
          "created": 1595967296,
          "upvotes": 1,
          "replies": {
            "fzjvtd3": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjvtd3/",
              "text": "Actually, I agree. I only give awards with coins I got from getting awards",
              "author": "puffymustash",
              "created": 1595969594,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fzgsdlk": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgsdlk/",
      "text": "That's pretty solid for a professor. That's crazy. I'm glad he pulled through and everything got situated for you.",
      "author": "FBI_Open_Up_Now",
      "created": 1595898304,
      "upvotes": 52,
      "replies": {
        "fzgz5xo": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgz5xo/",
          "text": "I honestly think it's above and beyond solid. He deserve a medal or something. I wouldn't give a heck about my class if I were a professor and got COVID19. I'd tell everyone to do whatever, read whatever, but I would not film from my phone. Everyone gets A's or B's. \n\nThis is probably why I should never be a professor, but still. The guy's got to get some acknowledgement for being so awesome.",
          "author": "SquigglyHamster",
          "created": 1595902212,
          "upvotes": 32,
          "replies": {}
        }
      }
    },
    "fzgrd1t": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgrd1t/",
      "text": "Tbf graduating in the next year is gonna be shitty and probably worse than a longer time in school",
      "author": "Featherfy",
      "created": 1595897729,
      "upvotes": 21,
      "replies": {}
    },
    "fzgq8av": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgq8av/",
      "text": "Yikes, it’s good you got a solid grade still and he was kind with grading.\n\nWhat class was it? Was it something critical to your major that you’re gonna have to know later?",
      "author": null,
      "created": 1595897083,
      "upvotes": 11,
      "replies": {}
    },
    "fzgo6g8": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgo6g8/",
      "text": "Your professor is a goddamn legend! No one should have to do what they did, but they did it for you.",
      "author": "FurretsOotersMinks",
      "created": 1595895921,
      "upvotes": 64,
      "replies": {}
    },
    "fzgipke": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgipke/",
      "text": "Stay strong, hope it all works out!",
      "author": "aaden08",
      "created": 1595892909,
      "upvotes": 6,
      "replies": {}
    },
    "fzfsm8s": {
      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzfsm8s/",
      "text": "Did you ever contact the department chair? it just seems so odd and inappropriate to me that they left this instructor to fend for himself while sick in the hospital, and to leave the students in the lurch as well. There's a point where the department should have sent in a substitute or at least other support.\n\n\nBut glad it worked out for you grade wise, at least.",
      "author": "Violet_Plum_Tea",
      "created": 1595879823,
      "upvotes": 498,
      "replies": {
        "fzgjhrl": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgjhrl/",
          "text": "> original post\n\nThis is what professors fear is going to happen in the Fall. There's no solid plan for if you contract COVID and can't teach, except to have lesson plans ready for a sub... but who is going to teach your class? Other instructors in your department that already have their own course load and know nothing about your subject? It's a bad situation for everyone.",
          "author": "badgersssss",
          "created": 1595893331,
          "upvotes": 247,
          "replies": {}
        },
        "fzgnfbh": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgnfbh/",
          "text": ">so odd and inappropriate\n\nYou mean common and what institutions are banking on for this fall.\n\nCollege instructor of 10 years here. Most of the institutions I work at don't have any kind of formal subbing system in place. You just teach through illness or cancel class and don't tell anyone. Only the CC where I worked had strict guidelines around subs and offered high hourly pay to sub in for someone's classes.\n\nAlso, there's a good chance your prof is an adjunct, or a part-time teacher, and would have been fired if it had become known he was sick. Adjuncts often piece together teaching classes at several colleges or other part-time jobs to make ends meet. Your prof could've been out thousands of much-needed dollars if he'd let anyone know he was sick.\n\nI agree it's a fucked up system. Colleges have been broke-ass since the '90s at least.",
          "author": "brownidegurl",
          "created": 1595895495,
          "upvotes": 167,
          "replies": {
            "fzgnobg": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgnobg/",
              "text": "Why would he have been fired if he was sick as an adjunct?",
              "author": "nintendollparts",
              "created": 1595895634,
              "upvotes": 26,
              "replies": {
                "fzgohyv": {
                  "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgohyv/",
                  "text": "Adjuncts are essentially contract employees who get hired (and paid) by the class. They generally have no benefits, health insurance, or other employment guarantees.\n\nThus, if you can't teach a large part of the class you signed up for, it'll be given to another adjunct (or full-time employee) and you won't be paid. Getting assigned classes every term is up to the whims of the department and enrollment. If you're seen as someone too \"unreliable\" to teach or make back-up plans if you fall ill, it's unlikely you'll receive future class assignments.\n\nIf this seems crazy to you, it's quite common. Over sixty percent of your college classes are taught by adjuncts nationwide. \n\nI was in a faculty meeting recently where our HR director was answering questions. An adjunct asked her directly if adjuncts would still receive full compensation for their courses if they got COVID. After a massive pause, the HR director said, \n\n\"I expect we'll be able to do that.\"\n\nThe adjunct said, \"You expect to, or you will?\"\n\nShe eventually capitulated and said that they would \"honor the contracts,\" but that raised even more red flags to me--those contracts haven't gone out yet, so it would be all too easy for them to add a cute clause exempting adjuncts from pay in the event of COVID.",
                  "author": "brownidegurl",
                  "created": 1595896100,
                  "upvotes": 92,
                  "replies": {
                    "fzgssq0": {
                      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgssq0/",
                      "text": "This is a lot of interesting information that I never knew or considered. That's really an interesting perspective on exactly how unfair some professors have it over the tenured staff.",
                      "author": "FBI_Open_Up_Now",
                      "created": 1595898541,
                      "upvotes": 29,
                      "replies": {
                        "fzgtiac": {
                          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgtiac/",
                          "text": "Yup! I make an effort to ask every class if they know what adjuncts are, and I'd say 1/20 does (for each class).\n\nThe college hierarchy works like this:\n\nAdjunct (part-time instructor; the following positions are full-time, with benefits, insurance, etc.)\n\nNTT (non-tenure track) professor (also often called a lecturer)\n\nTT (tenure-track) ~~Associate~~ Assistant professor\n\nTenured (Associate and later full) professor\n\nIn a nutshell, tenure is an application process that used to guarantee profs job security and intellectual freedom--the ability to throw their weight around in the department without fearing retribution like non-tenured teachers have to worry about (because they're all trying to seek tenure). Anymore, though, tenured faculty don't have it much better off than NTT, and tenured jobs are extremely hard to come by and even more difficult to get. We're talking some of the most competitive jobs on the planet.\n\nThere's a lot more to say, but here's a start. I suppose I wish more college students were simply aware of this system, and that since adjuncts receive such shit compensation, they're often more devoted to teaching and students than \\*tenured faculty are since there's not much reason to adjunct aside from the love of teaching, and tenured faculty have other reasons for working at a university (namely, research and publishing.) Appreciate your adjuncts, advocate for them if you can, and for the love of god, do not make petty complaints to the department about them without just cause.\n\n\\*I'll add that lecturers, too, are primarily hired for teaching, and are more likely to be skilled and devoted teachers. \n\nEdits for correcting the academic hierarchy and clarity",
                          "author": "brownidegurl",
                          "created": 1595898943,
                          "upvotes": 30,
                          "replies": {
                            "fzholw2": {
                              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzholw2/",
                              "text": "Just FYI, you’ve got the order wrong on tenure-track for the US. \n\nTenure track faculty start out as non-tenure assistant professors, and tenure is usually granted along with promotion to associate. Both associate and full professors are typically tenured.\n\nI’d also be careful about telling your students that adjuncts care more about teaching. I’ve personally notes no correlation between position (adjunct, NTT, TT) and how much a colleague cares. I have tenured colleagues that go far above and beyond, and adjunct colleagues who don’t even want to know students names. I think it’s sad that anyone in such a position doesn’t care about teaching, although we don’t reward it much in how we assess higher ed faculty in the US at least.",
                              "author": "Eigengrad",
                              "created": 1595920601,
                              "upvotes": 5,
                              "replies": {
                                "fzioypu": {
                                  "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzioypu/",
                                  "text": "Whoops! That's what I get for writing in haste. Thank you for the correction. \n\nI'll own that my instinct about adjuncts and teaching is anecdotal. At the same time, there truly is no reason to adjunct aside from a love of teaching, whereas TT faculty have more varied demands on their time, more personal reasons for working (research, the expectation of promotion), and receive better pay and benefits. I think, on the whole, the academic system produces more experienced and devoted teachers among adjuncts. My opinion.\n\nI've certainly met FT faculty that \"had it all,\" but I find them uncommon. Because that's hard work!\n\nI like to impress upon students that an instructor's level (adjunct, NTT, TT) has little bearing upon their teaching skill. Students come from high schools where teachers are employed to teach and must have the requisite education credentials, so I think they're surprised to find that colleges function differently and don't require any kind of formal teaching training. I've worked at one school for 4 years and have never been officially observed (they actually refuse to observe), and the other 3 schools I've worked at have required similarly minimal classroom observations--once a year, optimistically. These are well-known R1 and R2 state and private institutions. \n\nI often joke with the students that professors could be teaching them to make meth and no one would ever know. The lack of regular oversight with regards to teaching quality is absurd. The institution where I work full-time is gearing up for reaccreditation (that's like renewing your license for a college, for students reading this) and I discovered that many teured instructors don't know the difference between a prompt and a rubric and have never used a rubric. Students say that they turn in papers and never receive written feedback on them, just grades at the end of the term. I work in the college writing center and collaborate closely with these professors, and have seen this behavior first-hand. \n\nI'd ask, \"What are students paying for, if not the opportunity to learn through a skilled instructor?\" but we already know the answer. \n\nSince faculty are often hired for their research chops, not teaching skill, and especially when there's uneven teaching requirements for any academic position across universities, I regret when students are upset that the famous Professor X at Y R1 school turns out to be a less-than-passionate teacher. I want them to understand the college education system and how to navigate teacher bios and take classes with the instructors that fit their needs. Maybe they work with Prof X in a lab, but take their lecture with another instructor. Maybe they set their schedule to take a tough organic chemistry class with the better of two lecturers and then pick randomly among instructors for a language requirement because they're already a native Spanish speaker. This is the kind of intentional thinking I rarely see students use when it comes to shaping their college experience because they generally can't pick their high school teachers and assume things will be the same in college.\n\nI wish colleges could be a de facto supportive learning environment, but they're not. With a bit of savvy, though, I think students can still manage to have a worthwhile experience.\n\nThis discussion entirely excludes community colleges, which are a different (and awesome) beast altogether.",
                                  "author": "brownidegurl",
                                  "created": 1595948987,
                                  "upvotes": 2,
                                  "replies": {
                                    "fzj3f8b": {
                                      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzj3f8b/",
                                      "text": "I don’t disagree with the whole of what you’re saying, but I will say that many adjuncts are not doing it because they love teaching. Some are, just like some NTT/TT faculty are. \n\nMany are doing it because it’s the only job they can get, and many are doing it because they hope it will lead them to a TT job where they don’t have to teach as much. I’ve also seen the conditions turn a lot of adjuncts bitter who were originally devoted teachers but have decided the best way to deal is with checking out and doing the minimum, and I don’t blame them for that. \n\nI’d also say it seems like you’re basing your observations off of primarily R1 and R2 institutions, which are research intensive schools and among a minority of colleges and universities. State comprehensive schools (predominantly undergrad) and liberal arts colleges are very different than what you describe. There are around 4500 colleges and universities in the US, only around 250 of those are R1 and R2 schools.",
                                      "author": "Eigengrad",
                                      "created": 1595956056,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "fzhqfjk": {
                              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzhqfjk/",
                              "text": "On netflix show \"patriot act\" they did a great explaintion on this and how universities hire TAs and adjunct prof and basically take advantage of them, making them do more work sometimes more than tenured professors and underpay them. Opened my eyes to how cruel universities are",
                              "author": "ellison12345",
                              "created": 1595922386,
                              "upvotes": 8,
                              "replies": {}
                            },
                            "fzimi0e": {
                              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzimi0e/",
                              "text": ">Anymore, though, tenured faculty don't have it much better off than NTT, and tenured jobs are extremely hard to come by and even more difficult to get. We're talking some of the most competitive jobs on the planet.\n\nThis seems so insane to me, outside of the US. A lot of other countries don't have tenure because they don't have \"at will\" employment. It is literally illegal to fire someone without a lot of documentation, numerous warnings, a legitimate cause, and advance notice of their last day. The first full-time equivalent to NTT in many other countries is a permanent job with roughly the same protections as tenure.",
                              "author": null,
                              "created": 1595947708,
                              "upvotes": 2,
                              "replies": {
                                "fziptko": {
                                  "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fziptko/",
                                  "text": "> It is literally illegal to fire someone without a lot of documentation, numerous warnings, a legitimate cause, and advance notice of their last day.\n\nI'd say this is still true of tenured faculty in the US, although economic conditions are making that less so. Whenever there's a budget cut (or now, because of COVID) the administration likes to remind faculty that there are \"emergency provisions\" in contract language that allow faculty to be fired at-will for the good of the college. What defines an \"emergency\" seems up to the whims of admin. \n\n>  The first full-time equivalent to NTT in many other countries is a permanent job with roughly the same protections as tenure.\n\nHere, I've seen most NTT faculty work on a contract basis. They work for 3-4 years and then have to in effect \"reapply\" for their job. Most often it's assumed the contract will be renewed (unless you've messed up in some way) but I've seen more and more of my colleagues kicked out suddenly due to budget constraints. It's not truly a permanent position. \n\nYeah. It's all insane. I'm not trying to be strident about it, but I'm also tired of pretending this system is justifiable. It's been broken for decades and needs to change.",
                                  "author": "brownidegurl",
                                  "created": 1595949425,
                                  "upvotes": 1,
                                  "replies": {
                                    "fzjl23u": {
                                      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjl23u/",
                                      "text": ">Here, I've seen most NTT faculty work on a contract basis.\n\nNTT contracts at one university I teach at only last one year, and no one knows if they're getting reappointed until the contract is issued. Contracts typically have exploitative flaws in them too, so if the NTT instructor doesn't go over it with a fine-toothed comb, they can really get screwed over.\n\nSince students are reading this, I'm also going to take the opportunity to say that at some universities, tenured people make over triple what NTT instructors make for the same workload.",
                                      "author": "cheeruphamlet",
                                      "created": 1595964433,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fzisp1z": {
                      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzisp1z/",
                      "text": "> Over sixty percent of your college classes are taught by adjuncts nationwide\n\nI don't think that number checks out. Nationally, about 25% of all professors are adjuncts.\n\nIt's hard to get a read on how many courses are taught by adjuncts since you can have someone only teaching every other year, someone teaching 3 courses a year, and someone teaching at 3 different universities with 10 courses per semester.",
                      "author": "bl1y",
                      "created": 1595950862,
                      "upvotes": 3,
                      "replies": {
                        "fzjd6gf": {
                          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjd6gf/",
                          "text": "According to the AAUP, amongst many other reports, the figures are roughly 75% adjunct vs. 25% TT, at least in the U.S.",
                          "author": "Luciferonvacation",
                          "created": 1595960650,
                          "upvotes": 2,
                          "replies": {
                            "fznkljr": {
                              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fznkljr/",
                              "text": "Thank you for jumping in. I was about to cite the same source. I know I'm not making that 60% number up (or thereabouts), but I can't seem to find the article it came from.\n\nI know adjuncts are doing more than 25% of the teaching, even by the logic that 75% of hires are not TT or even NTT (even if you combined those.)",
                              "author": "brownidegurl",
                              "created": 1596052686,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "fzjdp99": {
                              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjdp99/",
                              "text": "Do you happen to have the source handy on that?\n\nLast I'd seen it was roughly 50% TT, 25% term and 25% adjunct.\n\nAnd please don't read that as \"I think you're full of shit, give me a source!\" but rather \"I'd really like to be able to cite that myself in similar conversations.\"",
                              "author": "bl1y",
                              "created": 1595960897,
                              "upvotes": 1,
                              "replies": {
                                "fzjx4ac": {
                                  "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjx4ac/",
                                  "text": "No worries!  \n\n[https://www.insidehighered.com/news/2018/10/12/about-three-quarters-all-faculty-positions-are-tenure-track-according-new-aaup](https://www.insidehighered.com/news/2018/10/12/about-three-quarters-all-faculty-positions-are-tenure-track-according-new-aaup)",
                                  "author": "Luciferonvacation",
                                  "created": 1595970235,
                                  "upvotes": 1,
                                  "replies": {
                                    "fzjxdov": {
                                      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjxdov/",
                                      "text": "No fault of mine, but I just noticed the link itself fails to insert the 'are off tenure track' even though that's the focus of the article ...so don't shoot the messenger!",
                                      "author": "Luciferonvacation",
                                      "created": 1595970366,
                                      "upvotes": 1,
                                      "replies": {}
                                    },
                                    "fzjxq1s": {
                                      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzjxq1s/",
                                      "text": "Thanks for the link, this is a bit more recent that the last data I'd seen.\n\nTwo things to note though:\n\n(1) There's a third category, not just TT and adjunct. There's also term faculty who are full-time employees generally on year-long or multi-year contracts and different from adjuncts.\n\n(2) Number of faculty isn't the same as number of classes taught. For instance, in my department adjuncts are capped at 3 courses per year, while full-time faculty teach 6, so even if half the faculty were adjuncts (they are in our department), only a third of classes are taught by adjuncts.\n\n...Also, if the article did talk about classes, not just number of faculty, I missed it because f'in happy hour right now.",
                                      "author": "bl1y",
                                      "created": 1595970538,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fzksb9p": {
                      "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzksb9p/",
                      "text": "Wait, if they don’t have health insurance, how do they pay for COVID stuff like the professor in the post?",
                      "author": "Strawberries53",
                      "created": 1595986914,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fzh3pcl": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzh3pcl/",
              "text": "We don't fire adjuncts for being sick. When they need a sub, we dock their pay to pay for it, though.",
              "author": "acm2033",
              "created": 1595904880,
              "upvotes": 4,
              "replies": {}
            },
            "fzisquh": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzisquh/",
              "text": "> cancel class and don't tell anyone\n\nBingo. Tell the students, but not the administration.",
              "author": "bl1y",
              "created": 1595950887,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fzgvaxi": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgvaxi/",
          "text": "My department just had a meeting. Someone asked, what do we do if someone gets sick or dies? Answer: uhhhh we don’t know.",
          "author": "crimbuscarol",
          "created": 1595899979,
          "upvotes": 18,
          "replies": {
            "fzh0zse": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzh0zse/",
              "text": "The sad part is that even without the threat of Covid, a department (and/or its administration) should have at least a general game plan for what to do if an instructor becomes unavailable to teach mid-semester. Stuff happens.",
              "author": "Violet_Plum_Tea",
              "created": 1595903269,
              "upvotes": 13,
              "replies": {
                "fzhgv2k": {
                  "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzhgv2k/",
                  "text": "You’d think. \n\nI used to be an adjunct in a program generally ranked 1-3 in the world. I wasn’t teaching one semester then all of a sudden my inbox starts getting flooded with emails from students that found my email on some materials from when I’d taught the class the previous semester asking for help because the assigned instructor (also an adjunct) never appeared by the first day, didn’t answer any emails, and they also couldn’t get into touch with the head of the program (an executive masters degree). I finally was able to get into touch with her and after she also couldn’t get into touch with the other teacher asked me if I could step in because she didn’t know what else to do.\n\nI also had a similar situation in grad school (same school and program) where the full professor went to China after week 3 and said he would not be returning (before the days of zoom) and not even the provost cared because there was a TA. But the TA was new and didn’t know any of the curriculum because she similarly had not received any instruction.",
                  "author": "nolathrowthisaway",
                  "created": 1595913795,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            },
            "fzgzbzg": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgzbzg/",
              "text": "Yikes.",
              "author": "SquigglyHamster",
              "created": 1595902309,
              "upvotes": 3,
              "replies": {}
            },
            "fzh3ud5": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzh3ud5/",
              "text": "Can confirm, we don't know.",
              "author": "acm2033",
              "created": 1595904967,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fzgnxco": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzgnxco/",
          "text": "Agreed, unless it's some super niche and advanced grad class, some other professor in the department should've been able to step in and teach",
          "author": "thatLifeVibe",
          "created": 1595895777,
          "upvotes": 6,
          "replies": {
            "fzh5whu": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzh5whu/",
              "text": "Some entire departments at smaller schools consist of one or two faculty. In those situations, asking someone else to step in and cover courses for another instructor might literally involve expecting someone who teaches horticulture to cover courses in microbiology, or a welding instructor to cover 3D printing courses. It's not always feasible.",
              "author": "blue_arrow_comment",
              "created": 1595906233,
              "upvotes": 8,
              "replies": {}
            },
            "fznlklk": {
              "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fznlklk/",
              "text": "Well... when I got my first adjunct gig in 2015, I let my department know literally 10 months ahead of time that I'd be getting married and taking a week-long honeymoon, and would need a sub for that week of classes. Two FT faculty members joyfully volunteered. I provided them with all printed materials and detailed lesson plans.\n\nWhen I got back, my students were in uproar. Neither of the subs had touched my lesson plans. Apparently they'd just come into the room and talked for an hour and sort of made it up? My carefully copied materials had even been returned to my mailbox, untouched.\n\nIn my 10 years of experience of college teaching, subs have never worked out well.",
              "author": "brownidegurl",
              "created": 1596053154,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fzh5ghx": {
          "link": "/r/college/comments/hyz81o/update_prof_has_covid_and_disappeared_after_the/fzh5ghx/",
          "text": "Instructor and the equivalent of a department chair here. My \"department\" consists of myself and one other instructor. We both teach 4-6 unique courses and a similar number of hours per week, often falling during the same timeslots. I've taught most of the courses he teaches, but he hasn't taught any I teach. If he falls ill I'll do my best to keep the students on track, but I can't ask him to do the same for me. As a college, the general plan if an instructor falls ill is either to have another faculty member lend a hand if possible, or just expect the sick faculty to teach remotely through their illness. I've confirmed that this may mean cancelling a week or two of class before the instructor is well enough to resume instruction remotely. There's really nothing else that can be done in some cases; colleges refuse to hire enough faculty to even comfortably cover normal course loads, let alone having enough to help substitute under circumstances like this.",
          "author": "blue_arrow_comment",
          "created": 1595905956,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054971
}