{
  "sid": "qi3lok",
  "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/",
  "title:": "I’m in my first semester of college and considering a drop, not sure whether to do it",
  "text": "I am taking Art Appreciation and have failed the first two exams. The class is historically tough, so much that they have an expansive tutoring program.\n\nDespite attending tutoring and using student support programs, it just isn’t working out. Even with my studying, I’m not producing the way I’m expecting.\n\nI currently have a 60 in the course, which means that for the next two exams, I’d need two 90s to pass.\n\nI don’t feel like it’s realistic, and I feel like a failure for even considering it. Other than this class though, I’m literally doing perfect, with all satisfactory and As across three other classes.\n\nFor those of you who had to drop a class, how did it make you feel?",
  "author": "jazzhands_7",
  "created": 1635477891,
  "updated": 1635779892,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiie94d": {
      "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hiie94d/",
      "text": "I’m withdrawing my four credits biology class soon as a freshman. I’m gunna change my major so that class isn’t important. I’ll have got take 2 extra electives to recover the four credits I’ll be losing cuz I need 120 credits to graduate. I’ll just say it’s not a nice feeling for me bc I feel dumb for withdrawing. The fact I’m struggling in a lvl 2 class means I’ll struggle even more in higher level classes.",
      "author": "hibius",
      "created": 1635514454,
      "upvotes": 3,
      "replies": {
        "hijrt39": {
          "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hijrt39/",
          "text": "What made you change your mind about your major?\n\nAlso, I’m sure you did your best, maybe there’s a different result ahead :D",
          "author": "jazzhands_7",
          "created": 1635534250,
          "upvotes": 1,
          "replies": {
            "hijsfmk": {
              "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hijsfmk/",
              "text": "I really wanted to do something related to science and to help people but also felt pressured by my parents expectations. However I had to accept the fact I do better in liberal arts so I decided to change. I do wish I was a math/science person but that wasn’t me lmao",
              "author": "hibius",
              "created": 1635534505,
              "upvotes": 2,
              "replies": {
                "hijssgc": {
                  "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hijssgc/",
                  "text": "STEM careers are intensive.\n\nGreat choice. Liberal Arts is lovely!",
                  "author": "jazzhands_7",
                  "created": 1635534648,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hihmn87": {
      "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hihmn87/",
      "text": "The first time I felt terrible because I haven’t failed a class in my entire life. It’s not technically failing but it’s pretty much the same thing. After that, I kinda just brush it off. If you drop the same class more than once, THEN you should worry, or if you drop too many classes. For every 2 semesters you should really only have like 1 W",
      "author": "evasiveshag",
      "created": 1635496208,
      "upvotes": 2,
      "replies": {
        "hijs1dd": {
          "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hijs1dd/",
          "text": "Are Ws that common? I was well under the notion that they’d be something looked down on.\n\nEither way, it feels like it’s a security blanket, thank you for this",
          "author": "jazzhands_7",
          "created": 1635534343,
          "upvotes": 1,
          "replies": {
            "hikawj6": {
              "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hikawj6/",
              "text": "That’s more for like STEM majors. If you exclude math and science classes, then 1 W every 2 semesters is probably too much",
              "author": "evasiveshag",
              "created": 1635541811,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hiih38z": {
      "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hiih38z/",
      "text": "Also a freshman who took a W, I joined the class late and missed an exam bc I should’ve emailed him beforehand whatever the fuck that means and then missed another exam bc it was due at 5 instead of 11:59. \n\nI’m glad I took the withdrawal, it would have been hard to bring up my gpa. one w across a bunch of A’s and a couple B’s is literally nothing",
      "author": "roachincalzone",
      "created": 1635515712,
      "upvotes": 2,
      "replies": {
        "hijrg4j": {
          "link": "/r/college/comments/qi3lok/im_in_my_first_semester_of_college_and/hijrg4j/",
          "text": "This is reasonable.\n\nI’ll remember this, thank you",
          "author": "jazzhands_7",
          "created": 1635534109,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}