{
  "sid": "q27fem",
  "link": "/r/college/comments/q27fem/can_you_go_through_college_online_only/",
  "title:": "Can you go through college online only?",
  "text": "I have went back to college recently at 23 and really enjoying it. I am currently taking 3 classes at my community college and all online. My question is can you go through college and to universities online? I'm on the autism spectrum and I have bad social anxiety. I dropped out at 18 cause I could not control the panic attacks in class and I would have to leave. I am currently taking kinesiology, abnormal psychology, and anthropology and have 95% or higher in all three. I feel though as soon as I have to be in a classroom I will start having panic attacks again. My attacks are illogical but I can't help the irrational thoughts in the moment. I am gonna pursue a kin, anatomy, or bio degree. Prob kin cause I'd like to be a physical therapist.",
  "author": "Small_Courage_2096",
  "created": 1633473541,
  "updated": 1634083789,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfjbew3": {
      "link": "/r/college/comments/q27fem/can_you_go_through_college_online_only/hfjbew3/",
      "text": "Yes - there are many programs and degrees offered totally online.  You just need to do your research and find an accredited university program. In the past, some for profit schools are just that - recruiting students to make money.",
      "author": "suzeycue",
      "created": 1633473666,
      "upvotes": 3,
      "replies": {}
    },
    "hfk226q": {
      "link": "/r/college/comments/q27fem/can_you_go_through_college_online_only/hfk226q/",
      "text": "My University has an all-online options for degrees. I am currently in an all online degree as I am living abroad.",
      "author": "tillD2t",
      "created": 1633486817,
      "upvotes": 1,
      "replies": {}
    },
    "hfnx6ad": {
      "link": "/r/college/comments/q27fem/can_you_go_through_college_online_only/hfnx6ad/",
      "text": "Yes, [Study.com](https://Study.com) is a great resource to get college credits all online. I would just speak with your current advisor and the [study.com](https://study.com) advisors to see what best fits your needs and what courses you have left. [Study.com](https://Study.com) is only $199 a month and allows you to finish classes at your own pace. I wish someone told me about this sooner as I have social anxiety and online just works better for my lifestyle. I just received my Bachelor's going through S[tudy.com](https://study.com) so I would definitely recommend it. I have a referral code for 30% off your first 3 months as well which is: JeniaMurguia\n\nLet me know if you have any additional questions.",
      "author": "jmurguia1100",
      "created": 1633562000,
      "upvotes": 1,
      "replies": {}
    }
  }
}