{"sid": "ptxn2j", "link": "/r/college/comments/ptxn2j/want_to_quit_my_job_any_advice/", "title:": "Want to quit my job any advice", "text": "I’m in college. Really bad ADHD, but I got medicine recently \n\n\nI barely passed high school. School has been a struggle for me for a LONG time \n\n\n\nSince I’m working part time I’m only taking 2 classes. But work is making me SUPER depressed \n\n\n\nYeah I’m medicated but I’m hella bad at time management. The medicine helps a ton but it’s obv not a cure. \n\n\n\nI feel like working , even though it’s part time, \nis holding my back SO MUCH and I feel like a failure for it. \n\n\n\nI want to quit, and pick up another class, to manage 3 classes at once. Or maybe even 4 to be full time \n\n\n\nNext semester I can work for my school 10-15 hours a week instead of working somewhere else. \n\n\nWhat should I do? I feel like if I quit my job I won’t have anything of value going for me.", "author": "disnynewaccount321", "created": 1632410772, "retrieved": 1632946170, "over_18": false, "upvotes": 1, "upvote_ratio": 0.6, "comments": {"hdzor5y": {"link": "/r/college/comments/ptxn2j/want_to_quit_my_job_any_advice/hdzor5y/", "text": "I'm in the same boat :/ Not sure if I have ADHD, but in high school I had so many problems with finishing work, time management, procrastination...I almost didn't graduate too. Now I'm taking 3 classes and working 20 hours/week in retail. My job isn't too bad honestly, but it's really affecting my mental health and increasing my anxiety...Plus with my bad time management skills, it's already caused me to turn in some assignments late. I really don't want that to be a trend this quarter.\n\nHonestly, if it's only your first semester of college and you have the financial means to do so -- it's perfectly okay to quit your job. It's just a part time job, it won't have any effect on the rest of your career. Or, see if you can get your hours reduced if you don't want to quit completely. Working and being a student at the same time is *hard* -- you don't have to feel bad for not being able to do both right now, especially when you're still getting used to a college work load. \n\nBest of luck, friend~", "author": "foureleven130", "created": 1632419805, "upvotes": 1}, "hdzchtp": {"link": "/r/college/comments/ptxn2j/want_to_quit_my_job_any_advice/hdzchtp/", "text": "If you can manage it financially, then quit your job. If it is not serving you, there is no need to stay there. Having a job is not how you have value. You have value regardless of work. Spend that time doing something that helps your mental health instead, that makes you happy. Or find another job where your mental health is not negatively effected. Your free time and your mental health are valuable. Do what you need to do for yourself. Your job wouldn't think twice about letting you go if it made more sense to them financially, no reason to stick around if it's making you depressed or feel like a failure.", "author": "thehelpfulprof", "created": 1632414795, "upvotes": 1}, "hdzbl6u": {"link": "/r/college/comments/ptxn2j/want_to_quit_my_job_any_advice/hdzbl6u/", "text": "I'm in the same situation. Horrible unmedicated ADHD and taking one course this semester while I get my shit together, but I'm also working 30ish hours a week at a grocery store.\n\nHow many hours are you working and do those shifts kinda vary in what time they are? How many days off do you have per week, and are they specific days or just whenever?\n\nThe most important thing is consistency. Talk to your manager and say that you can no longer work on specific days (it helps if they're consecutive) or you can only work during certain hours. For instance, I work Friday-Monday and have Tuesdays, Wednesdays, and Thursdays off, and when I do work, I usually work 7am-3pm (sometimes that changes, but not by a lot).\n\nThis will help schedule your time FOR you by having designated time for work and designated time for anything else, especially school work. Having consecutive days off helps me with energy and motivation for school work, if lacking energy is also a problem for you.", "author": "Gestice", "created": 1632414423, "upvotes": 1}}}