{"sid": "pvy9ad", "link": "/r/college/comments/pvy9ad/ill_be_moving_to_a_different_continent_for/", "title:": "I'll be moving to a different continent for college and having some trouble.", "text": "I'll be moving to Europe for college and it's giving me a lot of anxiety. I've lived away from my family before but never for more than a month. Although I am very excited to live away but sometimes I get a sudden wave of anxiety about leaving my parents my brother my friends here. It won't be too easy to visit as well. Also would I be able to settle before the first exams start. \n\nAre there any things I can do before moving and after moving to ease the process. \n\nAlso I thought it would be a more common question but can't seem to find any good post related to this.", "author": "DexterWeed", "created": 1632677223, "retrieved": 1632945932, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hedce6x": {"link": "/r/college/comments/pvy9ad/ill_be_moving_to_a_different_continent_for/hedce6x/", "text": "Hey! I moved from Europe to the US. I actually went almost two years without seeing my family because of covid. It’s not easy. I’m not the type to get homesick but sometimes I really miss a hug from my parents. I call home every week and keep in touch daily through messages. I talk to my best friends every day. I say once you find really good friends at your new place, it becomes so much easier. The hard part is that you feel like you need to do everything yourself, but this actually made me very organised and independent, I can solve any problem on my own, and help others too, so I look at it as a blessing. My best advice is to try to find great friends, and that will really make a big change. I’m not sure where you are going in Europe, but I’m sure there is a lot to explore, the city the culture the history, so try to go on as many adventures as you can! I also find that eating in a restaurant from my country and hearing my own native language once in a while helps a lot.", "author": "Dry-Razzmatazz8352", "created": 1632677716, "upvotes": 2}, "hedbl3x": {"link": "/r/college/comments/pvy9ad/ill_be_moving_to_a_different_continent_for/hedbl3x/", "text": "I moved to LA for a few months when I was living half way across the country. By the second day I was crying and feeling lower than I ever had in my entire life and was considering going back home. Literally five days later I was feeling on top of the world so my only advice is push through the adversity at the beginning because it will be worth it.", "author": "xnnyboi", "created": 1632677409, "upvotes": 3}}}