{"sid": "df0kh0", "link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/", "title:": "I overslept through my 8AM Chemistry", "text": "I hope this doesn’t sound too stupid, but this morning I overslept through my chemistry class that starts at 8. I’ve never had a problem with this in the past, but this morning I woke up at 8:45 and the class ends at 9:15. I felt that it was not worth going, as by the time I had gotten to the class it would’ve been over. \n\nI thought it would be best to email her and apologize for missing lecture, and that I look forward to next class. However, I’m worried that this will look worse on me, considering I didn’t miss a test or a quiz. I have also already gotten the notes from class today.\n\nMy professors attendance policy is that there are no make-up quizzes, make up tests for excused absences, and that regular attendance is expected.\n\nIs it worth emailing my professor at this point, or should I just move on?", "author": null, "created": 1570544213, "retrieved": 1632802760, "over_18": false, "upvotes": 613, "upvote_ratio": 0.96, "comments": {"f3tmyvg": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f3tmyvg/", "text": "Honestly, I've never emailed a professor about missing class unless I knew I was going to ahead of time. It's really not worth it in my eyes. You're an adult. It happens. Your professor isn't gonna fire you from university for missing a class. You've got what you need, now just don't let it become a habit.", "author": "J_rtx", "created": 1571140354, "upvotes": 1}, "f325lt3": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f325lt3/", "text": "I can't imagine caring this much about missing class.", "author": "lullaby876", "created": 1570594339, "upvotes": 1}, "f31ky4g": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31ky4g/", "text": "You’ll learn to not take early classes", "author": "knipdaddy", "created": 1570578033, "upvotes": 1}, "f31kl5j": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31kl5j/", "text": "Unless your class is really small don't worry about it.  Stuff happens and it really doesn't matter in the end.  Usually saying attendance is expected is a pretty standard thing because nobody can say \"yeah just show up if you want, I don't care\".  If it doesn't hurt your grade and attendance isn't mandatory it's not a big deal.   \n\n\nMaybe if it helps too, I've had many classes where I missed a good 25% of lectures due to it being in the morning and having to deal with stuff like working nights or just studying too late.  I still did well and the professors still really liked me and would often be happy to talk to me after class.  Granted for some I ended up explaining my situation when it got really bad but it was still not a big deal as long as I kept up.", "author": "SatanicSlugrifice", "created": 1570577775, "upvotes": 1}, "f31i2jo": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31i2jo/", "text": "I don't think it's necessary. I \"attend\" lectures that have 300+ people signed up, but on most days around 80-100 people are there at most. It's impossible to not have at least two classes/week at the same time at my uni, so noone really cares, because most students just have another class at the same time and they attend that one instead. Even if it's a class where there is a paper you have to sign that you are there, you can probably still miss some classes without it being a problem.", "author": "Danamanoo", "created": 1570575940, "upvotes": 1}, "f31dsxi": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31dsxi/", "text": "I missed my psych class because I overslept and also skipped my Orgo class because I misremembered the time it started today so that’s how my day’s going \n\nYou’ll be fine don’t bother with the email if it’s a fairly large lecture hall which I would assume chemistry is", "author": "God-of-Ass-Destroyer", "created": 1570573194, "upvotes": 1}, "f31ddpc": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31ddpc/", "text": "As a former chem professor, your professor doesn't care. You're obviously a conscientious student. The only time we really care about students missing class is when they're failing or doing really poorly but never show up to class. \n\nI'll even let you in on a secret, I use to skip class *all* the time as a junior/senior/grad student. I found lectures to be a big waste of time as I got more busy, but that's just how I learn. Some people learning better by listening to lectures", "author": "stathicus", "created": 1570572899, "upvotes": 1}, "f31cpts": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31cpts/", "text": "Your chemistry time schedule is the same as mine, are you at WVU by any chance?", "author": "TheCrazyCroco", "created": 1570572435, "upvotes": 1}, "f31bwr8": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31bwr8/", "text": "Is this your first year? Sometimes I see people ive never seen show up to the exam, attendance isn’t that serious", "author": "Bigthom63", "created": 1570571884, "upvotes": 1}, "f31b2ym": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f31b2ym/", "text": "We have a 75% attendance system and somehow i have attendance below 75% , so in order to keep up, we go to a doctor for some reason and ask him to give us medical certificate stating that he needs rest for x days. And prof. Has to consider it", "author": "KUSHtoGADBADhai", "created": 1570571430, "upvotes": 1}, "f3190gn": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f3190gn/", "text": "Nah, this kinda thing happens and profs usually understand. As lomg as it doesnt become a regular thing you're fine.", "author": "f1r3k33p3r", "created": 1570570305, "upvotes": 1}, "f316had": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f316had/", "text": "If ur in a lecture hall, no one cares if you're absent or attending. They don't normally take attendance in large lecture halls; however, if there's a participation percentage measured by iclicker activity, then u might miss one point for that day. It's no big deal as long as you didn't miss an exam.", "author": "ahemorrhoid", "created": 1570568942, "upvotes": 1}, "f3158mj": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f3158mj/", "text": "Do you have attendence? In University? Where are you from?", "author": "Stokbakko", "created": 1570568287, "upvotes": 1}, "f314vge": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f314vge/", "text": "It'll make you look better to email her. Your professors understand that you make mistakes and oversleep. It's not as strict as high school.", "author": "arlomilano", "created": 1570568093, "upvotes": 1}, "f30zt23": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30zt23/", "text": "Unless your professor has a crazy attendance policy, there's absolutely no need to send an email if you didn't miss a test. People miss class all the time, it happens to everyone. You don't need to explain what happened.", "author": "numberthangold", "created": 1570565404, "upvotes": 1}, "f30zmee": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30zmee/", "text": "How big is the class? If the professor is just lecturing to 50+ students, they probably didn't even notice. If it's more like 20 people with a lot of discussion, it might be worth apologizing", "author": "SkiMonkey98", "created": 1570565310, "upvotes": 1}, "f30yffi": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30yffi/", "text": "I guarantee you she doesn’t care or think less of you..we are adults and sometimes we miss stuff", "author": "saveme-shinigami", "created": 1570564661, "upvotes": 1}, "f30v7gv": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30v7gv/", "text": "One time my sister slept through both her 8am class and her 9am class LOL \n\nMy class started at 11 so I was up at about 9:30 starting to get ready and I noticed she was still asleep in her room. \n\nIt wasn’t funny for her at the time, but looking back on it... hilarious.", "author": "sflo97", "created": 1570562982, "upvotes": 2}, "f30v3w4": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30v3w4/", "text": "absolutely apologize and do it in person. next class or office hours. get in front of your professor as much as you can. go to office hours, get to know them. read their research, ask questions in office hours. you might notice at some point the topics relate to their research. kiss ass without seeming like it, be sincere. gotta be something interesting about chem for the teacher to get a phd in it. after the class, you may approach him or her about a volunteer lit review  for them and their research, could be a job later, could be a letter of recommendation. you will def get the \"subjectivity points\" if you have rapport. do it. get ahead. kick ass in class.", "author": "FLUFFYBUNNY2019", "created": 1570562938, "upvotes": 0}, "f30tw31": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30tw31/", "text": "It wouldn't be an excused absence so I'd just let it slide. I usually only email my professors if I have an excuse, otherwise there is no point.", "author": null, "created": 1570562341, "upvotes": 1}, "f30ta3g": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30ta3g/", "text": "If you aren't graded for attendance you probably never need to justify missing a lecture. As long as there's no test or quiz, most profs aren't fussed about a couple missed classes. I haven't been to my 9am computer architecture class since the first week since I don't need the lectures to do the material. I know people who almost never go to class outside of tests and do just fine. Most people can't get away with this and fall behind but missing one or two classes here and there isn't a big deal.", "author": "Epicsauce1234", "created": 1570561988, "upvotes": 1}, "f30syg9": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30syg9/", "text": "I can assure you your teacher did not know that you weren't there", "author": "MostShift", "created": 1570561769, "upvotes": 1}, "f30s4nx": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30s4nx/", "text": "Regular attendance is expected. Aka one miss isn't to kill you. You're fine. Don't worry about it.", "author": "maybehun", "created": 1570561217, "upvotes": 1}, "f30paoi": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30paoi/", "text": "Lmao I missed 3 classes today by oversleeping. It happens yo. If the class is big the professor probably doesn’t care, just make sure to stay on top of missed lectures so you don’t get behind.", "author": null, "created": 1570559420, "upvotes": 2}, "f30of9r": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30of9r/", "text": "Is attendance on a normal class day mandatory? If not, then there's no need to worry about it. This really depends on both the university and the professor though.", "author": "HJSDGCE", "created": 1570558862, "upvotes": 1}, "f30ms43": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30ms43/", "text": "How big is your class that it takes attendance? My uni only does attendance for labs and mandatory tutorials", "author": "hintersly", "created": 1570557804, "upvotes": 2}, "f30mrwm": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30mrwm/", "text": "If you don't have a minimum attendance criteria, don't bother emailing. I don't think any professor cares about missed classes, don't worry about it.", "author": "CoolJoey99", "created": 1570557801, "upvotes": 1}, "f30lch0": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30lch0/", "text": "At a small school, you need to send an email. My classes are so small, the professor will often reach out to absent students first.", "author": "MythicalWhistle", "created": 1570556894, "upvotes": 1}, "f30kyja": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30kyja/", "text": "I'd say not emailing her is fine. You could talk to her in person. I overslept for my chemistry class too once except I did have an exam that day. Needless to say, I was going through a lot during that time. But yeah, I just talked to my professor in person instead of email.", "author": "mysticrogue17", "created": 1570556655, "upvotes": 1}, "f30kinp": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30kinp/", "text": "[deleted]", "author": null, "created": 1570556383, "upvotes": 14}, "f30k37x": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30k37x/", "text": "Don't even bother if you didn't miss a quiz or exam. I know you're probably a wide-eyed freshman that missed just your first class, but just know it's not that big of a deal. As a senior, I can tell you that I show up to my courses whenever I feel like it. As long as you are able to keep up with the material, you should be alright. There have been classes where I've only shown up 3 times the entire semester and I still do fine.", "author": "AceHunter98", "created": 1570556115, "upvotes": 5}, "f30j5y3": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30j5y3/", "text": "Most professors do not want you to email them for missing a class unless you have a good reason. Emailing them because you overslept is not a good reason and that is on you if you miss anything. That's why it helps to have a study group in each class in a group text so they can catch you up if this happens. Put yourself in the Professor's shoes. They have multiple classes to teach with a lot of students, they could not care less if you overslept.", "author": "Nullveer", "created": 1570555543, "upvotes": 7}, "f30j4ks": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30j4ks/", "text": "Unless you're in a class with 12 people, the professor isn't going to really care whether or not you show up. This isn't high school. Look around the class during a lecture vs. on test day, and you'll realize just how lenient college attendance is. \n\nObviously you should attend lecture, but only a minority of professors are actually going to care if you don't.", "author": "Dj_White_Gold", "created": 1570555518, "upvotes": 164}, "f30id80": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30id80/", "text": "lol my Design 2 class (2 PM) this coming Thursday is tiring and im planning on cutting.\n\nIf you dont have any friends in class, just tell em youre home sick with a fever. Lie. \nThen make up your work, easy.", "author": "sonicbillymays", "created": 1570555047, "upvotes": -4}, "f30ad66": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30ad66/", "text": "I think some syllabuses allow for 1-3 misses. Id read that.", "author": "MiraniaTLS", "created": 1570549999, "upvotes": 2}, "f30a2sm": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30a2sm/", "text": "Missing one class is fine. Chemistry courses are so large that they probably didnt even notice. I skip class all the time when I can get away with it and Ive never talked to a prof about why, just dont miss anything important (quizzes or tests) and make sure they dont have a specific attendence policy in their syllabus (e.g. only allowing 3 absences or something like that)", "author": null, "created": 1570549818, "upvotes": 14}, "f30a1ss": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30a1ss/", "text": "If you had a reason for missing class like \"I got stuck in traffic because of a bad accident\" or something out of your control, then I would email, but just for oversleeping I wouldn't because they \\*loathe\\* hearing that.", "author": "the_lazy_introvert", "created": 1570549801, "upvotes": 3}, "f308t60": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f308t60/", "text": "I’ve missed 8am calc 4 times. I just ask somebody for the HW problems and we’re good. Don’t worry about it", "author": "fireandlifeincarnate", "created": 1570549016, "upvotes": 41}, "f307yrr": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f307yrr/", "text": "Bro no one gives a shit if you missed class. You don't need to email anyone. Your professor won't give a shit. Ask a classmate about the material you missed and book it.", "author": "DieSchungel1234", "created": 1570548472, "upvotes": 220}, "f305yf8": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f305yf8/", "text": "It’s fine, same thing happened to me yesterday, for some reason I forgot to set my alarm for my morning class. Just don’t get into a habit and you’re all good", "author": "f_ckupsomecommas", "created": 1570547161, "upvotes": 69}, "f30556a": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f30556a/", "text": "If this is a mid to large sized lecture, I don’t think there’s any need to talk to the professor. I have the same attendance policy in my chem lecture and the only time the room is full is on exam day.", "author": "immobilyzed", "created": 1570546633, "upvotes": 384}, "f3021f9": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f3021f9/", "text": "I'd send her an email and if you can go by office hours to ask what you missed and show you've looked over the notes a bit. \nThis does change a bit depending on class size. If your class is small 25 or so people, then you need to.\nIf your larger, over 100, then you could slip by but it wouldn't hurt to send, and could help make you stick out.", "author": "some_random_nonsense", "created": 1570544580, "upvotes": 8}, "f301s2o": {"link": "/r/college/comments/df0kh0/i_overslept_through_my_8am_chemistry/f301s2o/", "text": "If you didn't miss any assignments and have the notes, there's no need for an email. Instructors already have to deal with plenty of emails about course material along with people asking for makeups and rescheduling, so it's best not to email your instructor unless it's necessary.", "author": "VNVDVI", "created": 1570544403, "upvotes": 651}}}