{
  "sid": "q6w0w1",
  "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/",
  "title:": "Undecided in college. Feeling discouraged.",
  "text": "Hi guys. Im 19. I am an undecided student currently enrolled in community college. I've changed my major 3 times already. Majority being healthcare fields. Now I'm going for the general liberal arts and science degree aka as undecided. I realized I didn't want to go through with healthcare, not because It doesn't interest me but solely because of how stressful and hectic the healthcare field is. It's just not something I could see myself doing for the rest of my life. I found that I like techy stuff and have somewhat been good with computers. I've been computer savvy ever since I was nine. However, I'm so conflicted with the career choices tech has to offer. I'm big on stability and it worries me that I won't be secure or fit for the job as many tech jobs require constant learning and credentials. One example would be in cybersecurity. I was thinking about getting an associates in cybersecurity but as I researched the field so many people debated different things as to if an associates is useless or not and that it's best to get x amount of certificates. I don't find this useful for someone who just wants a stable career right out of school. I was considering computer science as well but I hate hate hate math and I really don't look forward to the course load. English was another one my options. I love reading and occasionally writing but it still doesn't feel promiseable. I hear too many people say drop out if you don't know what to do but I'm nearly halfway through the first semester. I don't want to feel like I wasted my time.\n\nWith all that being said, I'm at the point where I really just don't know what to do. I feel like I have too any interests but they don't equate to a career, if that makes sense. I would really like some advice so I can get out of this rut.",
  "author": "spectacularkay",
  "created": 1634073750,
  "updated": 1634589348,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgemuhb": {
      "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgemuhb/",
      "text": "Wait, when you say halfway through the first semester do you mean halfway of your first ever semester of community college? If so then what are you worrying about? Youre only 19 and making a huge career decision that could decide your job for the rest of your life with such little exposure doesnt make sense.\n\nI would just stay in community college and get the basic classes done while youre there, english and other classes that you may need to transfer or get done there.\n\nAs you exposed to more and more ideas and subjects then slowly the decision will be easier to make. Also sometimes you just have to throw yourself into some classes, like why not take a computer science class to REALLY see how you like it. If the class doesnt interest you after all then drop it (before the w deadline hopefully) or at least finish the class and then you can at least say to yourself that you explored that field.",
      "author": "Chaz_Delicious",
      "created": 1634074712,
      "upvotes": 1,
      "replies": {
        "hgendga": {
          "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgendga/",
          "text": "Thank you so much for this. And yes I'm a freshman. I do worry quite a lot for my age and that's something I'm working on.",
          "author": "spectacularkay",
          "created": 1634074934,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgey9ry": {
      "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgey9ry/",
      "text": "If you’re interested in computer science but hate math, find an information technology/information systems program. It’s basically CS lite, with the hard math classes being replaced by business courses. I have to take statistics, applied/business calculus 1, and discrete math. Much better than calc 1-3, linear algebra, physics/chem, etc. \n\nYes, the tech industry requires constant certs and learning, but it’s not bad if you actually enjoy technology. It’s only every 2-3 years to renew certifications as well and sometimes the new certs you get are so good that they just completely overshadow your old certs(meaning you won’t even need to renew old certs unless a job requires it).",
      "author": "evasiveshag",
      "created": 1634079699,
      "upvotes": 1,
      "replies": {
        "hgf43l3": {
          "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgf43l3/",
          "text": "May I ask what's your concentration? I really want to go into cybersecurity but I'm curious about the others as well.",
          "author": "spectacularkay",
          "created": 1634082386,
          "upvotes": 1,
          "replies": {
            "hgffrrn": {
              "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgffrrn/",
              "text": "My concentration is database technology and programming. The other concentrations at my university are: information security, cloud computing, networking and telecommunications, health information technology, and web development.\n\nThe best ones are information security, database + programming, and cloud. Networking is good too but I find that stuff MEGA boring. Web development and health IT are pretty terrible imho\n\nThe best entry level cert for cyber is security+ but CISSP is the gold standard for people with experience and skill.\n\nYou can definitely get into IT as a whole with just an associates degree *and* certs, but it’ll be a start from the bottom kind of thing\n\nI should also add that cybersecurity is not an entry level job at all. Unless you’ve had a few relevant security internships, you’ll likely have to start at the bottom working help desk for a couple years, but most IT people start here anyways unless you’re a software engineer.",
              "author": "evasiveshag",
              "created": 1634087812,
              "upvotes": 1,
              "replies": {
                "hgfvqlp": {
                  "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgfvqlp/",
                  "text": "okay. wow this really opened my eyes. Thank you!",
                  "author": "spectacularkay",
                  "created": 1634095508,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hgfbj47": {
      "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgfbj47/",
      "text": "This is incredibly funny to me because I was in the same boat as you. Couldn’t decide what to do ended up settling in an associates degree for cyber security, and I couldn’t be happier. Cyber security is full of jobs and money, and the teachers at my community college are nice and understanding because I got lucky. I know that it’s an extremely stressful time of your life but please know that you were doing your best and that you were going to be OK. It is extremely normal to take time to figure things out.",
      "author": "miasmicivyphsyc",
      "created": 1634085871,
      "upvotes": 2,
      "replies": {
        "hgfwa3p": {
          "link": "/r/college/comments/q6w0w1/undecided_in_college_feeling_discouraged/hgfwa3p/",
          "text": "Wow. I'm pleased to know I'm not the only going through this. I'm happy to know that your experience went smooth, made me feel a lot better. So thank you ! :)",
          "author": "spectacularkay",
          "created": 1634095789,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}