{
  "sid": "q0vvvj",
  "link": "/r/college/comments/q0vvvj/i_think_my_professor_thinks_i_cheated_maybe/",
  "title:": "I think my professor thinks I cheated maybe?",
  "text": "Hi there. I am trying to ask for advice as to what I should do. I'm a film student, and I was working on a paper regarding analyzing a scene of a film and using class vocabulary to explain my reasonings. I was having some trouble understanding the vocabulary, so I went into the class group chat to explain my answer to ask my classmates if what I said was \"on the right track\" or if I was missing the point completely. I got assurance from my classmates that I was on the right track. a few of us discussed further what the terms meant to us, and our interpretations of the scene.   \nToday, a few days after submitting my homework I get the results back: 65% saying I didn't understand the terms, I wasn't using terms correctly, I didn't properly argue my analyzation, and I needed to see the professor tomorrow after class.   \nI don't know what to do! I don't know if maybe someone copied my uncertain answer from the chat into their own homework, or if maybe I truly didn't understand the lesson for the paper. What should I do? I mean, I only thought that maybe he questioned plagiarism after my partner mentioned me posting in the class chat. I have never cheated before, nor even thought of this as cheating rather than getting assurance from my classmates that I was understanding the assignment properly. I've never been in trouble before. Also, why did I still get 65%? Do you think he believes I cheated or maybe something else? Any advice would be so appreciated. thank you",
  "author": "nyltiacm",
  "created": 1633312541,
  "updated": 1634084257,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfaxa09": {
      "link": "/r/college/comments/q0vvvj/i_think_my_professor_thinks_i_cheated_maybe/hfaxa09/",
      "text": "That doesn’t sound like he’s concerned about cheating, most arts professors (film, language, some psych, etc) want you to talk w your peers when you’re not sure! The fact that you got some credit and not an automatic zero also leads me to believe he’s more worried that you didn’t grasp the terms or communicate you grasped terms well enough and that’s why he wants to talk with you. I’d definitely wait and see and ask for feedback about what you can do to improve your scores/understanding of the material.\n\nGood luck!",
      "author": "RollingScone93",
      "created": 1633313265,
      "upvotes": 1,
      "replies": {
        "hfb13e9": {
          "link": "/r/college/comments/q0vvvj/i_think_my_professor_thinks_i_cheated_maybe/hfb13e9/",
          "text": "Your reply brings me so much more comfort, thank you so so so much. I get afraid of  plagiarism/cheating, because I tend to be really gullible and people take advantage of that. So me helping others can be a blurry transition from helping to accidentally cheating.   \nI will definitely wait and see what he says, thank you",
          "author": "nyltiacm",
          "created": 1633315179,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfdfn1p": {
      "link": "/r/college/comments/q0vvvj/i_think_my_professor_thinks_i_cheated_maybe/hfdfn1p/",
      "text": "I've done this when I've had a student that doesn't seem to understand terms. Usually its because they're using words in incorrect ways because they are clearly unfamiliar with them. I want to meet with them to talk and get used to using words correctly. I've noticed a lot of people can use words and make arguments verbally, but struggle when putting them to paper. Talking things out and then writing down what you said is a a common teaching technique.",
      "author": "hdorsettcase",
      "created": 1633367738,
      "upvotes": 1,
      "replies": {}
    }
  }
}