{
  "sid": "eal8ly",
  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/",
  "title:": "Not judging. I just need to know. Why would someone turn in nothing all semester and show up to the final?",
  "text": "I want to understand. I don’t like failing people. But I am honestly shocked at who showed up to my final this week. People I have not seen in months and who have less than a 30 in the course. You could score 400/100 on the test and still fail. \n\nWhy are you here? Why didn’t you write any papers? What would better motivate you?\n\n\nEdit: was not expecting this large of a response!\n\nAll I want to say is, thanks. I understand college is hard. It was for me at times. Very much so. I’ve been through the mental health ringer, health events, family crises, and had it derail school. I failed classes, hit academic probation, but eventually bounced back and am now a professor. \n\nIt’s not perfect, but I do encourage you to reach out to your profs when things go south. Some are more receptive than others. I generally accommodate these things. The counseling/mental health centers and academic advisers can sometimes be helpful advocates too. The earlier you reach out the better. \n\nAlso, if you have ideas, let me know what we can do better. I hate knowing students are flying under the radar with this, when I’m more than willing to help.",
  "author": "KaleMunoz",
  "created": 1576338474,
  "over_18": false,
  "upvotes": 1422,
  "upvote_ratio": 0.99,
  "comments": {
    "fjdz7fo": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fjdz7fo/",
      "text": "I don't know why this student showed up but I feel like no matter how much effort I put in, I have never been able to get help so I just show up for exams and say fuck it. I've tried sending emails explaining how I'm struggling with my mental health and that my medication is not helping. Literally 1 professor responded. I have a gastrointestinal condition and I've had to get accommodations for them but it's only applicable to testing. I'm not going to come to your class when I'm struggling to focus because I'm trying not to shit my pants. I'm sorry that I'm a fuck up but I have no control over this. If I'm leaving every 10 minutes to use the bathroom, how am I learning? A lot of professors, especially engineering professors at my school, treat students like robots. I wish they'd realize their treatment just makes things worse but it is what it is.",
      "author": "dedazzdeadinside",
      "created": 1583262093,
      "upvotes": 1,
      "replies": {}
    },
    "fbyibb6": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fbyibb6/",
      "text": "i was that student. some unexpected family issues made me miss an assignment. from that, i felt so much shame and anxiety for not turning it in, i stopped showing up to class bc i didn’t want to face my professor. i eventually told her about it and she gave me the chance to turn it in late for partial credit but i was not able to shake the mindset plus my family issue was ongoing which further weighed on my mental health on top of my existing depression and anxiety. i missed a lot of other major assignments and class. i caused so much stress and anxiety for myself for no reason. after that i realized i really need to get help for my mental health. no normal functioning human would have let this happen to themselves.",
      "author": "_exieris_",
      "created": 1577217603,
      "upvotes": 1,
      "replies": {}
    },
    "fbwqdzq": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fbwqdzq/",
      "text": "Just now seeing this, but want to comment.\n\nIn my situation, it was mental health issues due to a two-year long traumatic situation that I had only just gotten out of the summer before the semester started. Things were great in the beginning because of the thrill of it being over, but at the time I didn't realize how badly what I had gone through had affected me. One professor wrote me off as a complete failure and waste of time, which didn't help. It wasn't until two years later when I started counseling that I was diagnosed with PTSD from what had happened that had gone untreated for a long time. I ended up dropping out of school completely at the end of that year because of some other things that ended up happening, but for me I felt a sense of \"justice\" (I guess you could call it that?) when I ended up going to that teacher to explain what happened when I'd taken his class three years earlier and he apologized for making the judgment that he had.",
      "author": "Sapphira45",
      "created": 1577156665,
      "upvotes": 1,
      "replies": {}
    },
    "fbtqtxz": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fbtqtxz/",
      "text": "I know I’m wayy too late but I just need to put my feelings out there. \n\nI used to do this last semester. I’ve gotten slightly better but still nowhere near good enough.\n\nHonestly I do care about Uni and my major and I want to be better but I don’t know how. I just spend the semester being a lazy piece of shit and then try to salvage my grades the final week.",
      "author": "Havinci",
      "created": 1577090926,
      "upvotes": 1,
      "replies": {}
    },
    "fba1lk2": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fba1lk2/",
      "text": "Extra post cause I gave it some thought. What you could do better is tell any retired or “working from home,” friends that your job sucks now cause of all the punk ass kids running amuck and on xanex",
      "author": "isthatagoat",
      "created": 1576659702,
      "upvotes": 1,
      "replies": {}
    },
    "fb197fd": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb197fd/",
      "text": "for me its a matter of procrastination hitting all semester then it all kicks in at the end and I go for it lol",
      "author": "BraveUnion",
      "created": 1576433670,
      "upvotes": 1,
      "replies": {}
    },
    "fb08su9": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb08su9/",
      "text": "No longer a student (student support administrator now), but from my experience as a student (and it was a long and rocky road), the reason I would do this was out of a defiant dysfunctional pride.  \n\nBasically, if I could pass the final without having participated in the class, then I could tell myself the class was stupid and I didn't need it anyway.  Great way to put off confronting my own attitude, mental health, approach to life, etc.",
      "author": "lucianbelew",
      "created": 1576423715,
      "upvotes": 2,
      "replies": {}
    },
    "faztvxq": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faztvxq/",
      "text": "I'm really curious about this too. I would ask them.\n\nI always thought a college had certain criteria you have to meet in order to earn credits/pass a class.  Especially if you are on any kind of Financial Aid. Perhaps these people think they can get Financial Aid indefinitely. Not so. The usual requirement is that you must maintain at least a 2.0 GPA.\n\nNot only would I ask, but I'd also hand him or her a piece of paper with something like: \"You did not fulfill the requirements of this class. Your final grade is F\\[U\\].\"  .......... (that's an actual grade term for \"Fail, Unearned\")\n\nGoing to college is **hard work.** If you're not motivated or want to keep making excuses, don't waste yours or everyone else's time.",
      "author": "djustice5773",
      "created": 1576419619,
      "upvotes": 1,
      "replies": {}
    },
    "fayn6n1": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fayn6n1/",
      "text": "I lost two friends in the Central Valley of California again so I said fuck school all 1/4 for the millionth time of my life. College isn’t hard with screens everywhere and low staff numbers",
      "author": "isthatagoat",
      "created": 1576403552,
      "upvotes": 1,
      "replies": {}
    },
    "fay3twx": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fay3twx/",
      "text": "Sometimes you never know honestly. Had a professor last semester that was adamant that she would not curve no matter how bad the grades were. Turns out they were quite below average when compared to previous years. Went to the final needing above an 80 to get a C, answered 3 questions out of 7 and got a B+. Also not going to the final, at least in my school, gives you an INC or an incomplete which doesn't allow you to enroll for the class the next semester. Better to go to the final, get that F and try again than waste a semester.",
      "author": "DjSzymek",
      "created": 1576394395,
      "upvotes": 1,
      "replies": {}
    },
    "faxx782": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxx782/",
      "text": "I remember a science class I had in college, for the lectures their were five of us that attended regularly. On test days almost forty people would show up.",
      "author": "Kozileck9876",
      "created": 1576391443,
      "upvotes": 1,
      "replies": {}
    },
    "faxuuj4": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxuuj4/",
      "text": "Honestly I didn’t show the entire semester for my class, but then again I did show up for the exams (75% of my grade). The thing is I just hate commuting back and forward to my university, and especially since the class was from 6:30 pm - 10:30 pm Wednesday’s only. Anyhow, I also really dislike listening to a professor (he had a strong accent, also adding that) reading powerpoints. I mean... I can just do that myself during my spare time. Lastly there was a 20 page research paper due at the end of the semester (25%). I wrote that overnight, and studied for all my exams in less than 2 hours and ended up passing with an 83%. I spoke with some students that literally went to every class, and were flunking. So...Could I have done better?  Possibly, but I just don’t care enough to put the effort in it. That’s just me dude, idk about other people. I feel restricted/ force when having to make myself show up to unnecessary lectures / stuff.",
      "author": "BlueForte",
      "created": 1576390225,
      "upvotes": 1,
      "replies": {}
    },
    "faxnvlc": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxnvlc/",
      "text": "Agreed. I would never do such a thing.",
      "author": "RandomRedditor44",
      "created": 1576386757,
      "upvotes": 1,
      "replies": {}
    },
    "faxh1bx": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxh1bx/",
      "text": "My childhood best friend died the first day of my (original) senior year in a freak accident. I found out in my first class of the semester, via Facebook. The rest of that semester was a fog of depression, and to this day I don’t recall a lot of what happened during those months. My mom at least finally got the hint and stopped asking me questions about that semester. A lot of what I did that semester did not make logical sense. Why did I turn in some assignments and not others? Attended certain classes and then skipped the next? Or would go for weeks and then not go for weeks? Why did I take finals for classes I knew I was going to fail? Honestly, it was all due to severe depression. It’s not an excuse, it’s just how it was. I paid the price academically that semester, and while I did not ask for mental or educational help during those months, I did take the following semester off of school and got the help I needed. It didn’t ease the shame, or help me regain that time lost, but I did get myself back on track. Obviously everyone’s story is different, but I think there are way more students struggling with mental health issues in college than we even begin to realize, and for some of your students, that might be why they have behaved this way.",
      "author": "salarkin",
      "created": 1576383781,
      "upvotes": 1,
      "replies": {
        "faxh66s": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxh66s/",
          "text": "I think so too. I try to reach out, but with mixed results. Anything else we can do to help?",
          "author": "KaleMunoz",
          "created": 1576383835,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "faxf6ud": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxf6ud/",
      "text": "I'd like to add that some schools have academic penalties if you skip a final",
      "author": "Lordminigunf",
      "created": 1576383023,
      "upvotes": 1,
      "replies": {}
    },
    "faxc9aq": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxc9aq/",
      "text": "I'm grading finals now and totally agree. I don't understand students who either consistently miss assignments and then take the final. Or the other way around students who were doing well but miss the final and therefore fail because it's 30% of their grade.",
      "author": "johonnamarie",
      "created": 1576381779,
      "upvotes": 2,
      "replies": {}
    },
    "fax8eb3": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax8eb3/",
      "text": "Soo much of what we learn in a social work program isn't applicable for mc tests.",
      "author": "milyball",
      "created": 1576380197,
      "upvotes": 1,
      "replies": {}
    },
    "fax82g6": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax82g6/",
      "text": "Drove an hour Friday to take a final that I would have a \"B\" in the class whether I skipped it altogether OR made a perfect score. I'm not sure what I'm doing anymore.",
      "author": "milyball",
      "created": 1576380056,
      "upvotes": 1,
      "replies": {}
    },
    "fax3jsn": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax3jsn/",
      "text": "You realize early on you aren't going to pass but it's passed the withdraw deadline. You could take the W/F or you could show up to the final, fail spectacularly, bitch about it to all your friends, and now next semester/year when you retake it you might have an idea of what's on the final.",
      "author": "george76904",
      "created": 1576378309,
      "upvotes": 1,
      "replies": {}
    },
    "fax2w48": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax2w48/",
      "text": "I suppose if you’ve missed all your classes you probably missed the memo on what % finals account for the grade",
      "author": "zingzangzolf",
      "created": 1576378165,
      "upvotes": 1,
      "replies": {}
    },
    "fax1m3e": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax1m3e/",
      "text": "God I just freaking *haaaaated school*. Like I saw it as paying for a little piece of paper at the end and felt like around 85% of my classes were bullshit and I was not going to be pursuing any further education after my bachelor’s. With that in mind, I did the absolute bare minimum in order to scrape by enough to pass most of the time. If there was an attendance policy, I would typically drop a class because I’m great at exams and papers and didn’t want to waste my time filling a seat. \n\nI’d typically feel out the first week to see if attending the course would actually matter (in liberal arts.... it really typically doesn’t as long as you can comprehend whatever source material is going on in the class) and drop in from time to time (just important days and when things were due if I could get away with it). I took finals where I didn’t have a midterm grade or paper grades back where in all reality I may have been failing or on the cusp of it but didn’t know better. Probably wouldn’t have wasted the time taking the test otherwise though. \n\nAnd unlike anyone citing people doing it out of embarrassment, that was never my reasoning. If a prof called me out at the time and told me it was a waste of time to take the test, I would have been happy about it because I found college a very expensive waste of time in general. (And just to add: I love learning & don’t think college is a waste for everyone!!!! Just didn’t feel like I got a lot out of it, which was probably as much my own doing as anything else!)",
      "author": "krantzer",
      "created": 1576377762,
      "upvotes": 2,
      "replies": {}
    },
    "fax0ogo": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax0ogo/",
      "text": "Honestly, that is me and I would like to know the same thing.",
      "author": "A_Steen97",
      "created": 1576377399,
      "upvotes": 1,
      "replies": {}
    },
    "fawm1lz": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawm1lz/",
      "text": "When I taught college kids, I had some do this. Idk if they were telling the truth or making excuses, but the most common thing said was that they thought if they did indeed ace the final they could actually pass the class. \n\nLike they hadn’t done the math (which means they probably were not gonna ace a physics final lol), to know nothing could save them. I think they truly believed it though. Maybe because friends talked about how a final could make or break your grade.",
      "author": "FalalaLlamas",
      "created": 1576372941,
      "upvotes": 1,
      "replies": {}
    },
    "fawis2x": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawis2x/",
      "text": "One of my classes require you to turn up to the final. If though my Professor will give you an F if you hand in a blank final. If ypu skip the final you get an incomplete",
      "author": "goingclassic",
      "created": 1576371932,
      "upvotes": 2,
      "replies": {}
    },
    "fawidz8": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawidz8/",
      "text": "Teacher posts all lectures and practice tests online so i memorize that the day before the test and pass. Good enough, why waste time in class when the final is 75% of your grade and the midterms are 25%?",
      "author": "kshebdhdbr",
      "created": 1576371737,
      "upvotes": 2,
      "replies": {}
    },
    "fawialy": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawialy/",
      "text": "To not have information being withheld until the very last second or misled",
      "author": "forhisheart",
      "created": 1576371693,
      "upvotes": 1,
      "replies": {}
    },
    "fawgul7": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawgul7/",
      "text": "What level class? When I first started college I wasn't really prepared and committed. In high school I got away by not doing homework but being good at tests. Throughout high school we were told that most of your grade was through tests in college and high school has homework to help bump your grade up. Learned pretty quickly that wasn't the case in college and took me a while to get my shit together.",
      "author": "Xeroll",
      "created": 1576371019,
      "upvotes": 2,
      "replies": {}
    },
    "fawaqnt": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawaqnt/",
      "text": "Sometimes there's a rare case when something starts medically. I remember skipping a bunch of classes due to being constantly sick, and profs with three hour chunk classes didn't mesh but were the only options available to take. Only a few years after leaving college did I find out why I was sick all the time, but that doesn't make up for my crappy grades. :\\^)",
      "author": "cyanste",
      "created": 1576368310,
      "upvotes": 1,
      "replies": {}
    },
    "faw7dlu": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw7dlu/",
      "text": "He is entitled to pass. Because is breathing.",
      "author": "SoNic67",
      "created": 1576366970,
      "upvotes": 1,
      "replies": {}
    },
    "faw527k": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw527k/",
      "text": "Unfounded confidence accompanied by inexperience and shear panic",
      "author": "Emanresu_euqinu_2",
      "created": 1576366050,
      "upvotes": 1,
      "replies": {}
    },
    "faw39en": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw39en/",
      "text": "I took a couple of classes last spring just to have a lighter course load for this year and in two of the three classes were exactly like that. One instructor even had 10% of your mark based on attendance. But even that didn't help with people showing up. They showed for the first 2 days then the mid term and then they showed for the final.",
      "author": "legot83592",
      "created": 1576365346,
      "upvotes": 1,
      "replies": {}
    },
    "faw271g": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw271g/",
      "text": "Just did this and didn’t show up to the final.... mid quarter I knew I wouldn’t pass so I quit putting in the effort and shifted my focus to my job. I really find no point in trying if a professor won’t give you a second chance.",
      "author": "Rugrratt",
      "created": 1576364942,
      "upvotes": 2,
      "replies": {}
    },
    "favyuew": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favyuew/",
      "text": "I know for some schools, it's a financial aid thing. My school doesn't do it the same way, if you miss more than a number of classes (usually it's around 3-6 depending on how frequent the class is and reasoning for absence) you get a 'FA' or failure to attend, so it doesn't matter if you miss or take the final. \n\nFor some of them, it could be a chronic illness or mental illness thing. I missed a lot of classes because of my Chronic Illness which would require an ER visit to bring me back to normal, it flared up pretty bad with stress, although I managed to not miss too many, mine only happened 3-4 times a semester (where I had to miss class, sometimes it flares up mildly). And I have a friend who wound up turning to online school because she had such severe agoraphobia that she'd have breakdowns going to class. Both our problems were low occurrence issues, but for some of them, that could be it. \n\nAlso, I think some people just feel so bad and wretched by the end of the semester that doing a final, regardless of the impact on their grade, alleviates some guilt.",
      "author": "EffervescentFlower",
      "created": 1576363757,
      "upvotes": 1,
      "replies": {}
    },
    "favy4yi": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favy4yi/",
      "text": "I was talking to a friend recently whom I told that i didn’t show up to my stats final and he basically told me he wouldn’t skip a final even knowing that he was gonna fail because there’s always a chance you pass lol. I did my assignments for that class, did (but failed) my two midterms and figured i’m gonna fail anyways so i’m not gonna suffer through the final for it to be an F in the end.",
      "author": "throwawayyy670",
      "created": 1576363521,
      "upvotes": 1,
      "replies": {}
    },
    "favvka9": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favvka9/",
      "text": "Fooling yourself into the idea that you tried.",
      "author": "garuraa",
      "created": 1576362651,
      "upvotes": 1,
      "replies": {}
    },
    "favrkul": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favrkul/",
      "text": "I had a semester where I turned everything in late, it was all just as late as possible (my university has a two week limit for late assignments with growing penalties). Part of it is because it feels like the least you can do, but in that case I had been hit with a major depressive episode I was coming out of near the end of the semester and the sense of urgency hit at once. It feels a lot like after being a pain in the butt all semester, the least you can do for a class is show up and take the final.",
      "author": "gingersnapped99",
      "created": 1576361539,
      "upvotes": 1,
      "replies": {}
    },
    "favpq3n": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favpq3n/",
      "text": "I did this for a few of my classes the first time I tried going to college. At the time, I had severe anxiety and depression that made going to lecture nearly, and on some days, 100% unbearable. The anxiety also crippled my ability to write, and the depression made trying insurmountably burdensome and pointless besides. Not turning in assignments and missing lecture was NOT due to a lack of motivation, it was because I had so overburdened myself with expectations they were crushing me. My family was pretty clueless about mental health, and I was too humiliated at my own struggles to ask my teachers for help. \n\nHowever, I still showed up for exams because they were a small, finite (vs a paper that can always be turned in 1 day later), low-interaction thing I could do to prove to myself I was at least a tiny percent capable of facing the work, that I wasn’t fully and hopelessly paralyzed. \n\nSince then I’ve gotten a lot of help for my mental health problems, and am back at college getting mostly As/Bs. But it was a really long road. Having teachers like you that genuinely wanted to understand my struggles and offered empathy, instead of being mad at me for being “irresponsible” and confirming my then-held belief I was garbage, made a world of difference. Thank you for wanting to better understand your struggling students.",
      "author": "twopurplecats",
      "created": 1576361091,
      "upvotes": 5,
      "replies": {}
    },
    "favohmb": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favohmb/",
      "text": "I have severe anxiety and depression (finally diagnosed, with help I can now deal with it) that leads to suicidal thoughts. A lot was caused by when I asked university for a new tutor and they didn’t give me one. I said I was struggling and I received no help. I was freezing in my flat, not eating well and hardly sleeping. Eventually you feel so out of control that you miss every deadline but still feel the anxiety of missing that deadline. At least turning up to an exam I achieved something.\n\nMaybe it’s not up to the lecturer to help. But if it’s happening to multiple people and you really can’t get your head around it, you could ask them. If you really care, you could find a way to help. We’re not all just wastemen goofing off. Some of us develop drinking problems we can’t handle to get over the self loathing.",
      "author": "SenorPoontang",
      "created": 1576360797,
      "upvotes": 1,
      "replies": {
        "fax9bmu": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax9bmu/",
          "text": "Yeah I understand. I did reach out to several students. Sometimes heard nothing back. I feel for them. I’ve been there too. I’m trying.",
          "author": "KaleMunoz",
          "created": 1576380581,
          "upvotes": 1,
          "replies": {
            "faz4rk2": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faz4rk2/",
              "text": "You’re a good person. You change people‘s lives for the better. I just wish there were people like you at UCL.",
              "author": "SenorPoontang",
              "created": 1576411698,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "favn3w2": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favn3w2/",
      "text": "I realize that this is real life and shit and obviously just not showing up isn't studious behavior, but that being said, if he can go the entire quarter without attending any classes and still pass the final, you should consider passing him. Isn't the point of a final examination to test a student's knowledge of the course material, to see if he was able to learn what you taught him? If he passes the final, he learned the course material, and therefore deserves to pass. Maybe assign him an essay on the value of hard work or something to make up for the other stuff.\n\nNow, I know you won't even consider it because it isn't fair to your other students, but seriously, think about what the whole point of a final exam is for the future. Saying this as a student myself.",
      "author": "GuessImScrewed",
      "created": 1576360334,
      "upvotes": 5,
      "replies": {
        "fax9iwv": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax9iwv/",
          "text": "I do get that. They usually don’t do well on the final. \n\nI leave makeup work open, for a significantly reduced score. That’ll usually at least get them passing.",
          "author": "KaleMunoz",
          "created": 1576380665,
          "upvotes": 2,
          "replies": {
            "fay3szd": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fay3szd/",
              "text": "Yeah, if someone pops in for the final and fails it, I'd be just as lost as you figuring out why they even came. But I've seen people ace em blind before, so I thought I'd bring up the possibility.",
              "author": "GuessImScrewed",
              "created": 1576394383,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "favjut4": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favjut4/",
      "text": "Attendance so they don't have to repay financial aid for nonattendance?",
      "author": "-firead-",
      "created": 1576359479,
      "upvotes": 1,
      "replies": {}
    },
    "favj1mp": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favj1mp/",
      "text": "One time I missed class during a day that the professor was assigning everyone to groups for the 'big, evil capstone project' that was well known and dreaded by everyone in my major. Being the odd one out, I was placed in a group by myself and I knew I had no chance of getting anywhere with it and that I was going to need to take the class again. I still showed up for the final knowing several things:\n   *I didn't want to give up on myself too easily, even though I knew the final wouldn't make a difference and I would still fail\n   *I didn't want to be asked by other classmates why I missed the final\n   *I took it as a way to study for taking the class again, and also would know what the final looks like next time around so that I am ready to prepare.",
      "author": "OrbDeceptionist",
      "created": 1576359307,
      "upvotes": 3,
      "replies": {}
    },
    "favh5od": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favh5od/",
      "text": "I did that for a class once. It was mostly depression, personally",
      "author": "DerpFalcon12",
      "created": 1576358857,
      "upvotes": 1,
      "replies": {
        "fax9l9b": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax9l9b/",
          "text": "Is there anything we can do when that happens?",
          "author": "KaleMunoz",
          "created": 1576380689,
          "upvotes": 1,
          "replies": {
            "faxack9": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxack9/",
              "text": "Reach out to your school’s counseling department if you can, and talk to your professors. I was depressed the last week of one of my writing classes and didn’t show up to turn in my work. I reached out to my professor and he was super understanding, and let me turn it in slightly late. Also, sometimes having a friend you can confide to when times are rough is super helpful.",
              "author": "DerpFalcon12",
              "created": 1576380998,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "favem57": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favem57/",
      "text": "I have seen a few other students like this. I think that some students do it to save face but maybe they do it for the scholarship. I know my friend's university had a policy where you can retake a class if you do not pass, but that only meant a C- or less. But, an absolute 0, or less than 20% could lose your scholarship or grant.",
      "author": "PasstheySoysauce",
      "created": 1576358198,
      "upvotes": 1,
      "replies": {
        "faxa8ej": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxa8ej/",
          "text": "I have seen the retake thing. A girl asked a friend to fail her so she could retake for an A. A C or D was worse for her.",
          "author": "KaleMunoz",
          "created": 1576380949,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "favbu2d": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favbu2d/",
      "text": "I was in a similar situation this semester as a student. I’m a bartender and I close nights before my 10:30 class Mondays and Wednesdays. Attendance only counted for 3% of the final grade so I figured I wouldn’t kill myself getting home at 4 and going to class at 10. Sometimes I would make it but really didn’t go to class in the second half of the semester. Showed up for the final and ended the class with a C",
      "author": "cameron_cs",
      "created": 1576357456,
      "upvotes": 1,
      "replies": {}
    },
    "fav91ru": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav91ru/",
      "text": "I taught college for one year and met 5 of my students for the first time on the day of the final. They were shocked to find out that passing the final wouldn’t mean they pass the course.",
      "author": "hexables",
      "created": 1576356707,
      "upvotes": 2,
      "replies": {}
    },
    "fav915i": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav915i/",
      "text": "Someone who hasn't turned in anything in two months probably also hasn't looked at the gradebook in two months.",
      "author": null,
      "created": 1576356701,
      "upvotes": 4,
      "replies": {}
    },
    "fav8hyk": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav8hyk/",
      "text": "As someone who did shit all for calc but showed up to the final:\nMy teacher has a special policy where if your final is higher than the passing cutoff and you're failing, as long as you've demonstrated effort on your part he'll replace your average with your final. I stopped coming to class/doing hw because of a lot of personal reasons (none of which are valid excuses in all honesty but what's done is done) and while I doubt I'll actually get bumped up, I *did* study quite a bit for the final and I *was* putting in quite a bit of effort in the beginning, so its a gamble I have no reason not to take.\n\nThat being said, go to class kids.",
      "author": "Khalolz6557",
      "created": 1576356580,
      "upvotes": 5,
      "replies": {
        "fav97yh": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav97yh/",
          "text": "Hope you pass!",
          "author": "KaleMunoz",
          "created": 1576356764,
          "upvotes": 3,
          "replies": {
            "fava3sr": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fava3sr/",
              "text": "Lol thanks. I actually feel like I did alright on the final so fi gers crossed",
              "author": "Khalolz6557",
              "created": 1576356945,
              "upvotes": 1,
              "replies": {
                "fshxukf": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fshxukf/",
                  "text": "did you pass?",
                  "author": "RenatoGallifaQ",
                  "created": 1590988419,
                  "upvotes": 1,
                  "replies": {
                    "fshy6rx": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fshy6rx/",
                      "text": "Definitely not, but I tried lmao",
                      "author": "Khalolz6557",
                      "created": 1590988672,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fav8926": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav8926/",
      "text": "Because I want to see what the final is like and what kind of questions there are, for the next time.",
      "author": "purplelovely",
      "created": 1576356498,
      "upvotes": 3,
      "replies": {
        "fav9arn": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav9arn/",
          "text": "They might change it! I switch mine up. Not completely though.",
          "author": "KaleMunoz",
          "created": 1576356787,
          "upvotes": 2,
          "replies": {
            "favadt1": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favadt1/",
              "text": "I have enough experience retaking exams (successfully) to know that a trial run can really help. Going to an exam when you know you're failing can be really helpful. Professors don't really change the difficulty, types of questions, etc. A shocking number of professors just recycle questions.",
              "author": "purplelovely",
              "created": 1576357034,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fav4omx": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav4omx/",
      "text": "You can lose financial aid and have to repay grants to attend if you drop classes. It’s better to just fail.",
      "author": null,
      "created": 1576355648,
      "upvotes": 6,
      "replies": {
        "fav9f33": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav9f33/",
          "text": "But my other students said if they don’t get an A instead of a B+ they’ll make financial aid 🤔",
          "author": "KaleMunoz",
          "created": 1576356822,
          "upvotes": 1,
          "replies": {
            "fax6jek": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax6jek/",
              "text": "Those are merit scholarship.",
              "author": "blades318",
              "created": 1576379421,
              "upvotes": 1,
              "replies": {}
            },
            "fax7lhg": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax7lhg/",
              "text": "I’m talking about grants based on financials.  Example; I enrolled in a piano class. I’m a musician and read music poorly. I figured I could make it through with what I know.  I was swamped with all the other classes and did not practice enough.  I have a hard time sight reading after years of playing by ear.  I was thoroughly embarrassed. If I didn’t show up and bomb the final I would have been given an incomplete. I’d rather take a fail and rely on my other classes to lift my gpa up to continue using the financial aid.",
              "author": null,
              "created": 1576379858,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fauyrw4": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauyrw4/",
      "text": "[deleted]",
      "author": null,
      "created": 1576354092,
      "upvotes": 4,
      "replies": {
        "fava33g": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fava33g/",
          "text": "I’m the prof :-). But yes, I know some classes don’t require attendance in any way, shape, or form. \n\nMy class is not like that.",
          "author": "KaleMunoz",
          "created": 1576356939,
          "upvotes": 3,
          "replies": {
            "favfi6t": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favfi6t/",
              "text": "[deleted]",
              "author": null,
              "created": 1576358389,
              "upvotes": 3,
              "replies": {
                "fax9zoj": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax9zoj/",
                  "text": "My teaching style. Participation is apart of the grade. We have graded group work in class.  We have in class quizzes. These take up enough of the grade that it’s nearly impossible to pass not showing up. \n\nOver half the exam material comes from in class slides and discussions. Sometimes even a powerful student contribution. If you’re not there, you’re probably not getting the question right. \n\nIt’s not punitive for the sake of being punitive. It’s just the result of years of reading educational science and taking courses on teaching for designing the best learning experience I can.",
                  "author": "KaleMunoz",
                  "created": 1576380851,
                  "upvotes": 7,
                  "replies": {
                    "faz1os2": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faz1os2/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1576410354,
                      "upvotes": 3,
                      "replies": {
                        "fb0k52h": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0k52h/",
                          "text": ">Was really quite silly.\n\nYes, that's high school silly: seat time does not mean learning. But by the same token, it's the responsibility of faculty to make the class time meaningful (like OP here seems to be doing). I have nothing but contempt for faculty that \"teach\" classes where they simply go over or repeat what was in the homework, or design them so students can simply watch some videos online, skip the class, and still pass. That's not teaching, it's simply charging money for the final exam.",
                          "author": "SnowblindAlbino",
                          "created": 1576426757,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fauxuht": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauxuht/",
      "text": "Sometimes its a financial aid thing.\n\nI had a lot going on this semester, knew at the halfway mark I would not pass the classes but I had no choice but to go to as many classes as I could, including the final. \n\nI mean I failed half of my classes and my GPA is 1.8, meaning I wont graduate ( this was my last semester) but also...I couldn't afford to pay back 10 grand for dropping out.",
      "author": "cierachamere",
      "created": 1576353880,
      "upvotes": 1,
      "replies": {}
    },
    "fauuep0": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauuep0/",
      "text": "There are people that genuinely believe passing the final is all you need to pass the class.",
      "author": "brybrythekickassguy",
      "created": 1576352839,
      "upvotes": 1,
      "replies": {}
    },
    "fauue5x": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauue5x/",
      "text": "I attend most of my classes pretty much all the time. Unless I oversleep, which happens about twice a semester, I’ll go to all classes. Except: I had a class last semester wherein it was made clear that the exam would be a multiple choice exam (first MC exam in my life — not even in school!) and that the material would be uploaded to Moodle (online Platform and most of my profs don’t do this usually). \n\nThe class was so boring and I doodled more than took notes. It was at an odd time and was basically about how sociology influences architecture. I read all the coursework and more... that was just more interesting than how the professor presented it. Went to maybe five lectures in total. Not proud of it, but honestly, the prof could have made it a little more interesting. Even his joked seemed rehearsed.",
      "author": "S_pline",
      "created": 1576352838,
      "upvotes": 2,
      "replies": {}
    },
    "fauu87r": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauu87r/",
      "text": "Honestly I have no idea. My roommate does this all the time skips class doesn’t do homework and just parties. I’ve asked him about it and he just super laid back saying it’ll all work out. I mean I guess maybe it with but you could do the same thing without spending thousands of dollars",
      "author": "UnsoughtDawn",
      "created": 1576352796,
      "upvotes": 11,
      "replies": {}
    },
    "fautttl": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fautttl/",
      "text": "As a professor, I would say \"because then it gives you some reason to argue with the department head that you deserve a passing grade, or an extension, or an aegrotat grade.\"\n\nEven though they don't. Ever.",
      "author": "CatheterZetaJones",
      "created": 1576352598,
      "upvotes": 2,
      "replies": {
        "fautyb8": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fautyb8/",
          "text": "Can’t wait!",
          "author": "KaleMunoz",
          "created": 1576352665,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fautocx": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fautocx/",
      "text": "There is a difference for purposes of financial aid between F-stopped attending and just an F if your school tracks that way. Not attending or discontinuing attendance may be worse if your school requires that type of reporting. My school just started it this semester.",
      "author": "kittycatblues",
      "created": 1576352519,
      "upvotes": 14,
      "replies": {
        "fautwvv": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fautwvv/",
          "text": "There’s no way this is true. Other students were very clear that financial aid is totally dependent on the difference between a B+ and an A!",
          "author": "KaleMunoz",
          "created": 1576352644,
          "upvotes": 5,
          "replies": {
            "fauu06f": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauu06f/",
              "text": "I work at a major public research University and I can assure you this is true.",
              "author": "kittycatblues",
              "created": 1576352693,
              "upvotes": 8,
              "replies": {
                "favabef": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favabef/",
                  "text": "Unless they are on a 4.0 only scholarship, my class isn’t the problem. \n\nThe last student who told me he’d never be able to come to school again over this has since walked passed me on campus.",
                  "author": "KaleMunoz",
                  "created": 1576357012,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "fauy03k": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauy03k/",
              "text": "There are different types of financial aid you know....",
              "author": "cierachamere",
              "created": 1576353926,
              "upvotes": 8,
              "replies": {
                "favag5z": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favag5z/",
                  "text": "That’s true. But unless it’s a 4.0 only scholarship, my class isn’t the deal breaker. It’s a collection of things. \n\nLast student to tell me this said he’d have to quit school. It was awkward when we ran into each other.",
                  "author": "KaleMunoz",
                  "created": 1576357056,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "faw81kw": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw81kw/",
              "text": "That’s probably a merit scholarship, not actual financial aid. Financial aid is usually need/income-based, not grade based. Financial aid still usually has GPA requirements, but it’s typically much more lenient than what is required of merit scholarships. Financial aid often has attendance requirements and registered course hour requirements, too.",
              "author": "Snow_Wonder",
              "created": 1576367235,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fausixc": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fausixc/",
      "text": "I've never done this but I know a few people who have. Their reason was that they were just having a rough time in their personal life, some tragic event happened, and they were in a bad place.\n\nThat said, this person said the exact same thing about previous terms and at the start of this term said they were better now.\n\nMy suspicion is that they do not deal with stress well and fall into depressive habits that make them lose the will to attend classes and think about stressful things like assignments and tests.\n\nI've seen a pattern that people who miss school, assignments, and projects because of \"tragedies\" and \"rough patches\" in their lives tend to miss classes *every* *term* for the same or similar reasons and always have some excuse or another for why they are not doing well. The reality I think is mental health and the fact that they aren't taking good care of it, probably because they were not taught how to (i.e. recognizing the signs, meeting with professionals, getting medicated if necessary) because they are all on their own now.\n\nThey aren't admitting to themselves yet which is why they continue to use these excuses rather than getting help, so I'm not sure that they'll have the self-realization to tell you in this thread why they are doing what they are doing.",
      "author": "peregrin5",
      "created": 1576352195,
      "upvotes": 1,
      "replies": {
        "fauu27q": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauu27q/",
          "text": "This is hard. I really feel for these people, because I’ve been there. Have you seen any effective ways for professors to get the students to start talking about it? That’s at least a starting point for us to start working with them.",
          "author": "KaleMunoz",
          "created": 1576352720,
          "upvotes": 1,
          "replies": {
            "fay7qet": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fay7qet/",
              "text": "In my opinion, all a professor can do in these situations is refer them to a specialist unless the professor is a licensed psychiatrist themselves. I don't think most professors have close enough relationships with their students that they would be a mental health confidant for most students. \n\nAll you can really do is tell them that you're willing to listen if they're going through a tough time but also be clear that there is a limit to how much you can accommodate. Like I said some of these students have a \"tragedy\" every term and I see these students passed on even when they fail classes because the professors feel bad or don't want to be the one to be a hard ass if it turned out to be real.",
              "author": "peregrin5",
              "created": 1576396202,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fausedu": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fausedu/",
      "text": "Do you actually know if they are failing though? Just because they never go to class doesn't mean they haven't been turning in and doing well on the assignments \n\nBut also, honestly, even if they didn't turn anything in all semester they might have begged the professor to let them make up the work and the professor might have agreed. I can personally tell you, as someone who has TA'ed for a few years, this kind of stuff happens. I've had students who should have failed no question but ended up passing because the professor overseeing the class let them retake the exam or make up all bunch of work last min (which I had to grade...) or gave them extra credit. Sometimes these kind of students have legitimate excuses. Sometimes their excuse is something like \"I didn't have the textbook\" (an actual excuse I was given by a student who only handed in 1/12 assignments all semester...Edit: the professor let this student make up the work and the student passed)",
      "author": "stathicus",
      "created": 1576352127,
      "upvotes": 8,
      "replies": {
        "fazyf2l": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fazyf2l/",
          "text": "OP is a professor, so would know that their students have failing grades going into the final.",
          "author": "GrandmaMabelGrey",
          "created": 1576420793,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fauqy0r": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauqy0r/",
      "text": "Lol. In my calculus class, the last class before the final was a review session. This guy who hasn’t been in the class since September shows up and the professor says “why are you here?”",
      "author": "whirlwindwaves",
      "created": 1576351539,
      "upvotes": 2,
      "replies": {}
    },
    "fauqjr4": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauqjr4/",
      "text": "There's a guy who's been in all my classes since freshman year who shows up on the first day of class and then never again, not even to the final. I really wanna know how this guy is still in my classes...",
      "author": null,
      "created": 1576351332,
      "upvotes": 2,
      "replies": {}
    },
    "fauqalf": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauqalf/",
      "text": "This happened in one of my classes. The teacher was like \"I'm glad you decided to come!\" to which he responded \"i didnt want to fail\". I was like wth i havent seen this guy at all, and he didnt even do the final presentation. This was at USC, and i never expected such laziness. It was funny tho",
      "author": "fernthegreat",
      "created": 1576351194,
      "upvotes": 2,
      "replies": {}
    },
    "fauplvr": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauplvr/",
      "text": "When I took my statistics Final this week, a guy I had never seen in my life sat next to me (we all mostly sat in the same seats every week). He didn't have a scantron or a pencil, so I let him borrow a pencil and gave him a scantron.\n\nTeacher passes out the test, and he \"finishes\" it before she's done passing it out.\n\nI'm a fast test taker and it still took me an hour, so I'm guessing he just wrote him name and maybe bubbled a few in. I kinda doubt he could've bubbled them all in that fast.\n\nWhy bother coming to the final at all?",
      "author": "DreadPiratesRobert",
      "created": 1576350829,
      "upvotes": 4,
      "replies": {}
    },
    "fauon2o": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauon2o/",
      "text": "I did this in all of my classes before realizing I needed to take time off to deal with the family/mental health issues that were plaguing me at the time. \n\nI experienced a pretty severe depressive episode and didn't show up to anything for maybe a month and a half, or turn in any assignments. A week before the finals I got pretty manic and although I couldn't bring myself to talk to the professors, I went to the finals. Still failed, but there's really no one explanation. \n\nCould be a lazy frat kid who doesn't want to be in school in the first place. It could be traumatic stuff is going on in a person's life. Could be anything really, but the big thing is it's almost never on the professor, and there's little you can do besides maybe reaching out. \\[which is unfeasible for professors to do as it's not really their responsibility especially in larger classes\\] \n\nI'd say just keep on keeping on and do what you can if someone reaches out for help.",
      "author": "judgeshandiwork",
      "created": 1576350383,
      "upvotes": 8,
      "replies": {}
    },
    "faumvwk": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faumvwk/",
      "text": "Some classes place such a high percentage on finals you can get away with it... I had a math class I got a D in just for passing the final and doing half my homework I know the situation you mentioned was different.",
      "author": "redwallchronicles",
      "created": 1576349782,
      "upvotes": 7,
      "replies": {}
    },
    "faum98j": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faum98j/",
      "text": "As a prof, I want to know the opposite. Why come every day, do all required work, then not show up for the final exam and not turn in the final paper?",
      "author": "chasimlev",
      "created": 1576349561,
      "upvotes": 19,
      "replies": {
        "favp9ns": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favp9ns/",
          "text": "Could be anxiety or stress. You're so overwhelmed and think you're not going to pass or make a fool out of yourself on the final. That final paper and exam is really  mentally taxing for many students. We just get in our heads and convince ourselves that we won't be able to process all the information and that going to the exam will be useless and a waste of time.",
          "author": "jodecicry4u",
          "created": 1576361017,
          "upvotes": 23,
          "replies": {}
        },
        "fausppq": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fausppq/",
          "text": "Listen Prof, one in a million chance happened..  my grandma got struck by a meteor and my goldfish was so upset it ate my laptop.",
          "author": "Punchee",
          "created": 1576352281,
          "upvotes": 19,
          "replies": {}
        },
        "faxekrd": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxekrd/",
          "text": "I got depressed, lost all motivation, and I honestly don't even like my major.",
          "author": "39_33__138",
          "created": 1576382759,
          "upvotes": 5,
          "replies": {}
        },
        "faw3wb4": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw3wb4/",
          "text": "Well I didn’t have exams this semester but I had my final year project presentation.  \n\nSo I‘ve been feeling crap for the past few weeks but since I’ve been managing to keep myself together (barely), I didn’t talk to my profs about it. However, I did talk with my advisor at the beginning of the year about some mental heath issues I had last semester. \n\nAnyway, the day of the presentation comes, I have an awful breakdown and just don’t show up. I submitted all my other assignments this semester and the only reason I didn’t show up was because I spent the entire morning crying.   \n\nMy advisor contacted me and I was honestly surprised that she was more worried about me being okay than having missed the presentation.  The point of this is that I didn’t intentionally miss the presentation, I just had no idea that I could’ve avoided all this mess if I had talked to her sooner.",
          "author": "aha98",
          "created": 1576365594,
          "upvotes": 3,
          "replies": {}
        },
        "fazzyxe": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fazzyxe/",
          "text": "Somewhat related, I had a class that I was doing really well in (was easily going to get an A) and I almost missed the final because I marked it down as the wrong time in my calendar. The final was at 1PM and I had it marked as 3PM. The only reason I didn’t miss the final entirely was because I showed up at 2 thinking I would study for another hour before the exam.\n\nFortunately the professor believed me and he gave me an extra 15 minutes on the exam and I was able to do well enough to get an A- in the class.",
          "author": "Saetia_V_Neck",
          "created": 1576421217,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "faujxbo": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faujxbo/",
      "text": "If they pass the final that means they should have known the material and should receive a passing grade regardless imo.",
      "author": "JagsHaveBestD4021",
      "created": 1576348774,
      "upvotes": -2,
      "replies": {
        "fauphim": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauphim/",
          "text": "Testing doesn't prove or display knowledge or understanding of a subject. It only identifies their ability to test and study for a set goal. If they are unable to manage their time to turn in the assignments, or do not understand the material enough to complete assignments, then they need to look for tutoring or accept that failing grade. If they score well on assignments and quizzes, but fail on tests then I agree with you they deserve a pass.",
          "author": "Gigistasia",
          "created": 1576350766,
          "upvotes": 4,
          "replies": {
            "fav7it5": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav7it5/",
              "text": "Some classes only test are applied to the grade. And the assignments a lot of the time arent that different then a test. And most assignments are to prepare them for said test.",
              "author": "JagsHaveBestD4021",
              "created": 1576356366,
              "upvotes": 2,
              "replies": {
                "fav7qqp": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav7qqp/",
                  "text": "Doesn't change that tests do not verify understanding or knowledge",
                  "author": "Gigistasia",
                  "created": 1576356429,
                  "upvotes": 2,
                  "replies": {
                    "favbtv4": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favbtv4/",
                      "text": "Kinda implies they show just as much as most assignments do. Why do they weigh the test so much higher then ?!",
                      "author": "JagsHaveBestD4021",
                      "created": 1576357454,
                      "upvotes": 1,
                      "replies": {
                        "fave1to": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fave1to/",
                          "text": "Because we've used it as a standard for so long, change doesn't happen over night, and the government uses testing to determine funding. But if you are in college you will find many teachers who have backed away from testing, some who do open note testing, and some who still test regularly. So the times are changing, and hopefully we will get to the point that we end the testing process for grade determination.",
                          "author": "Gigistasia",
                          "created": 1576358019,
                          "upvotes": 1,
                          "replies": {
                            "faview8": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faview8/",
                              "text": "Well until its changed seems my point is valid",
                              "author": "JagsHaveBestD4021",
                              "created": 1576359111,
                              "upvotes": 1,
                              "replies": {
                                "favj5xm": {
                                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favj5xm/",
                                  "text": "That's not really how that works. Tests still don't determine knowledge or understanding. So basing on that fact, we cannot determine a passing grade (which is used to verify understanding) on a tool that doesn't determine understanding.",
                                  "author": "Gigistasia",
                                  "created": 1576359345,
                                  "upvotes": 1,
                                  "replies": {
                                    "faw5bjc": {
                                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw5bjc/",
                                      "text": "But you will totally fail the student if they miss said final right ?",
                                      "author": "JagsHaveBestD4021",
                                      "created": 1576366153,
                                      "upvotes": 1,
                                      "replies": {
                                        "faw61m7": {
                                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw61m7/",
                                          "text": "In this hypothetical scenario, where I am a teacher and teaching students. I would probably assign a final assignment a research paper or an application of information obtained through the text/teachings. I would forgo the test entirely. But if you are taking the idea that I had a final exam I would make it optional and use it to replace a previous quiz/test. As I have stated my view, and the views of most professionals, is testing does not prove knowledge so I wouldn't put much weight into said exam. Now if said student had a failing grade going into this exam yes that student would fail the course, there are consequences for our actions, or lack of action. So passing a single exam/assignment is not reason enough to recieve a passing grade.",
                                          "author": "Gigistasia",
                                          "created": 1576366450,
                                          "upvotes": 1,
                                          "replies": {
                                            "faw79cm": {
                                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw79cm/",
                                              "text": "I agree with you mostly that testing doesnt prove knowledge.\n\nHowever as you've stated that's how the system is set up. Its usually set up so you dont pass the class without passing the final. \n\nTake computer programming. Usually theres a bunch of mini assignments and at the end theres a final project that takes all the mini assignments and ask you to create something using all of the concepts. I think that does prove said scenerio. \n\nOr for pharmacy. You usually take test asking if you've retained a bunch of knowledge that you'll most likely never use and will google the answers when you need to know. \n\nIn both of these scenarios passing the final is proving the knowledge.",
                                              "author": "JagsHaveBestD4021",
                                              "created": 1576366928,
                                              "upvotes": 1,
                                              "replies": {
                                                "faw88ep": {
                                                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw88ep/",
                                                  "text": "It doesn't prove knowledge, it proves you can retain information long enough to pass a test. That is not knowledge. Creating scenarios that demonstrate reasoning for testing does not prove they test knowledge.\n\nAlso I have never met a teacher who puts that much power on a final. Most finals are weighed to the course at most 40% of a total grade, and in most instances on a 4.0 scale a D is a passing grade. Granted there are times when a 70% or C is required to pass a course. I have also been in courses that a 95% was considered a B, and a 65% was a fail. That determination has no effect of a test. The facts still point to tests/exams are not good ways test or verify knowledge. They are purely a way to test your ability to test.",
                                                  "author": "Gigistasia",
                                                  "created": 1576367309,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fauhx63": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauhx63/",
      "text": "Obviously not OP's course, but in a lot of classes, if you ace the final you can get away with doing nothing all semester but taking midterms and finals",
      "author": "thatLifeVibe",
      "created": 1576348126,
      "upvotes": 2,
      "replies": {}
    },
    "faud0nc": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faud0nc/",
      "text": "My first semester when I was lazy I did something along these lines. I didnt show up to any classes after the first couple weeks, but showed up for the exams. I suppose this isnt a good answer to your specific instance because I was doing the assignments online and there were no papers. Attendance was only 10% of the grade and I had taken the class in high school so I thought I could breeze by without showing up. Ended up with Cs on the exams and a D for the course because material was different. I later learned to show up at least some of the time to boost my attendance and grade. Hopefully your students learn the same. I dont think they are evene necessaripy a bad person for doing this, because I told myself I would start going back but it becomes a snowball of bad attendance and it becomes harder to go back after missing a couple sessions due to just general anxiousness",
      "author": "Kobe_AYEEEEE",
      "created": 1576346913,
      "upvotes": 3,
      "replies": {}
    },
    "faucf4l": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faucf4l/",
      "text": "They know they'll have to retake the class but they want to see what type of questions will be asked on the final, what to focus on when studying and what the degree of difficulty",
      "author": "jodecicry4u",
      "created": 1576346807,
      "upvotes": 9,
      "replies": {}
    },
    "faubwps": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faubwps/",
      "text": "i was a person who actually did show up for a majority of the classes, but going into the final i knew there was no mathematical way for me to pass\n\nthe reason i did show up however was because i knew i had to retake the class next semester, and wanted to see if i could see what this year's final looked like to get a leg up next year",
      "author": "takkun22",
      "created": 1576346661,
      "upvotes": 285,
      "replies": {
        "fawihuw": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawihuw/",
          "text": "Fantastic effort in your part. Did you pass the next time you took it?",
          "author": "Hortondamon22",
          "created": 1576371790,
          "upvotes": 58,
          "replies": {
            "fax44ki": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax44ki/",
              "text": "sorry to disappoint you, but I don't think i did. I think I dropped it before the deadline, and found a different way to get around the requirement. looking back, i think i had some sort of learning disability",
              "author": "takkun22",
              "created": 1576378526,
              "upvotes": 57,
              "replies": {
                "faxhy8v": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxhy8v/",
                  "text": "mah dude, don't be sorry. even if you did have a disability, you had more initiative than most, I respect that massively",
                  "author": "RocketSquidFPV",
                  "created": 1576384164,
                  "upvotes": 18,
                  "replies": {}
                },
                "faxzjiz": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxzjiz/",
                  "text": "What did you do to get around it?",
                  "author": "kr0zz",
                  "created": 1576392493,
                  "upvotes": 4,
                  "replies": {
                    "faxzzxm": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxzzxm/",
                      "text": "i think i took the class at another university, it was easier there",
                      "author": "takkun22",
                      "created": 1576392686,
                      "upvotes": 7,
                      "replies": {
                        "fay4hw1": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fay4hw1/",
                          "text": "So you full on transferred or... \n\n\nMy University only lets us retake classes at that same University/:",
                          "author": "kr0zz",
                          "created": 1576394709,
                          "upvotes": 4,
                          "replies": {
                            "fb0jept": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0jept/",
                              "text": "well, my university didn't have that policy, and were willing to let me transfer the credit/requirement",
                              "author": "takkun22",
                              "created": 1576426588,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fb03isr": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb03isr/",
                  "text": "What class was it if you're comfortable sharing? I think I might be in a similar situation",
                  "author": null,
                  "created": 1576422256,
                  "upvotes": 1,
                  "replies": {
                    "fb0jhuh": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0jhuh/",
                      "text": "calc 2 i believe",
                      "author": "takkun22",
                      "created": 1576426603,
                      "upvotes": 2,
                      "replies": {
                        "fb0xhdj": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0xhdj/",
                          "text": "What made you believe you had some kind of disability? And what major were you going for? Do you use that kind of math in your career today?",
                          "author": null,
                          "created": 1576430184,
                          "upvotes": 2,
                          "replies": {
                            "fb2dcvz": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb2dcvz/",
                              "text": "1. i'm not sure, just a feeling \n2. math based ecnoomics\n3. no",
                              "author": "takkun22",
                              "created": 1576448998,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fauaa40": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauaa40/",
      "text": "school kinda just sucks ass sometimes",
      "author": "Thedailyer",
      "created": 1576346223,
      "upvotes": 7,
      "replies": {}
    },
    "fau7n6e": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau7n6e/",
      "text": ".",
      "author": "TD123TD",
      "created": 1576345332,
      "upvotes": -2,
      "replies": {
        "faujpuj": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faujpuj/",
          "text": "That’s not what the post is asking about though...",
          "author": "okayfoxisout",
          "created": 1576348700,
          "upvotes": 2,
          "replies": {
            "fav1dq0": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav1dq0/",
              "text": "Having been this person in the past, in my mind at the time I thought if I score well at the end they'd see I tried and take pitty, also a kind of fear of I have to be able to say I tried. Even if I fail I at least finished it. Hard to try to get into that mindset having just come out of finals week myself, and now understanding the importance of homework, quizzes, and attendance.",
              "author": "Gigistasia",
              "created": 1576354765,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fau79jr": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau79jr/",
      "text": "Happens with at least one person every semester in most classes. I don't give exams, but the equivalent just happened to me-- an honors student skipped four papers this semester (40% of the grade) but turned in the final paper (15% of the grade). She'll still fail. So why bother?\n\nThis after, of course, my reaching out repeatedly about the missing assignments and then advising her to withdraw rather than fail.",
      "author": "SnowblindAlbino",
      "created": 1576345195,
      "upvotes": 26,
      "replies": {
        "faxbqyx": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxbqyx/",
          "text": " Doing something means something when you've had mental health issues, or personal problems, so maybe that was her case and she recovered just enough energy towards the end to be angry at herself, or force herself to submit something. I, personally, was stuck in a horrible program and even though I knew I was gonna fail could not accept that I was gonna do nothing. And while she probably should have withdrawn, in that state you have energy to do nothing. I was waking up, eating, sleeping. Equally, if a student's grades drop mid semester, they stop showing up, or dont do basic things that would give them points it could be the same thing.\n\nOfc some ppl are just lazy but this is my experience with this and ive seen friends have the same problem.",
          "author": "FrozenAppleYogurt",
          "created": 1576381577,
          "upvotes": 7,
          "replies": {
            "fb0ivlc": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0ivlc/",
              "text": ">Doing something means something when you've had mental health issues, or personal problems, so maybe that was her case and she recovered just enough energy towards the end to be angry at herself, or force herself to submit something. \n\nPerhaps, but she's attended every class, does the readings, does the group work, is engaged, etc. Just doesn't seem to want to write the papers.",
              "author": "SnowblindAlbino",
              "created": 1576426422,
              "upvotes": 2,
              "replies": {
                "fb1718i": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb1718i/",
                  "text": "Yeah, idk. Bad time management? Maybe she plans to do the papers but always ends up overwhelmed. Other than that, I don't really know why she would do everything except handing in the papers.",
                  "author": "FrozenAppleYogurt",
                  "created": 1576432998,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fau74kh": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau74kh/",
      "text": "Many funding agencies (including military and some state funds) require profs to report attendance rates for F students. We have to indicate the last day a student was “active” in the course and penalties for failing courses are different if you ghost versus show up and fail. So if you attend final, prof has to indicate that you were “active” for the duration of the semester, even if that’s the only class you ever attended. It’s a nice idea (less penalty for students who tried but failed) but as with anything, some people use it as a loop hole to game the system.",
      "author": "PhDreaming",
      "created": 1576345145,
      "upvotes": 34,
      "replies": {
        "faubmdq": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faubmdq/",
          "text": "If the student can prove attendance after a certain date they are not required  to return their financial aid for that semester.",
          "author": "zvbxrpo",
          "created": 1576346564,
          "upvotes": 9,
          "replies": {}
        },
        "faz8cv7": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faz8cv7/",
          "text": "This is a very common occurrence. I think what can happen is if you stop showing up the university can withdraw you from the class, and then can drop students below full-time status, which has implications for financial aid, housing, insurance, etc.",
          "author": "bl1y",
          "created": 1576413201,
          "upvotes": 2,
          "replies": {}
        },
        "fb0imm0": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0imm0/",
          "text": ">Many funding agencies (including military and some state funds) require profs to report attendance rates for F students.\n\nThis must be handled differently from campus to campus-- I've been teaching 25+ years and have never taken attendance. Only a tiny handful of my colleagues do so either.  We simply fail anyone who earns <60% for the course, regardless of reason.",
          "author": "SnowblindAlbino",
          "created": 1576426338,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fau5jh9": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau5jh9/",
      "text": "Sounds like your weighting is different than my experience, but I definitely tutored/taught calc 3 to someone who didn't go to class for a few months straight.  \n  \nThis is the mindset: if I can get a B (or a C) and not spend all that time in class, then that's good enough for me.  \n  \nBackground: 1st semester sophomore year in engineering we had 3 classes (statics, calc 3, and physics 2) that all dealt heavily with vectors.  After the third hour covering the same material, a number of us decided to take a week off of some of the classes because it was too redundant.  The problem is, once you get into a new schedule for a week, it's hard to break it.  And then you pop in for one class and it all still seems pretty easy, so you take another week off.  Next thing you know it's the end of the semester and you're gulping energy drinks asking that friend who loves calculus to catch you up.\n\nI'm not better than my friend in this case either.  I skipped physics 2 and favored calc 3 and statics, while he skipped calc 3.  Our GPAs ended up worse than they should've been because we couldn't find the time to put into the classes.  College was an expensive way to learn time management, but the overall story ended well as we're now both doing pretty well in our fields.",
      "author": "Arrrugula",
      "created": 1576344583,
      "upvotes": 5,
      "replies": {}
    },
    "fau5j4j": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau5j4j/",
      "text": "Since you know, you won't pass, you might as well come to have a look a the exam to be able to prepare better for the next attempt.  \nYou could realize how easy or how hard the exam really is and adapt your effort accordingly and structure your next semester accordingly.",
      "author": "Tuomas90",
      "created": 1576344579,
      "upvotes": 79,
      "replies": {
        "fau79u8": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau79u8/",
          "text": "Except that many of us deliberately change up the material on our exams every semester...",
          "author": "GrandmaMabelGrey",
          "created": 1576345198,
          "upvotes": 15,
          "replies": {
            "faud7ps": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faud7ps/",
              "text": "Understandably so but there's a pattern of questioning that the student can take into account. Multiple choice or essay questions? Exact data or just general descriptions of things. Stuff like that which makes a huge difference while studying. Asking a lot of questions on one subject and asking a few on the others, meaning that subject is probably really important.",
              "author": "jodecicry4u",
              "created": 1576346973,
              "upvotes": 35,
              "replies": {}
            },
            "fawnelu": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawnelu/",
              "text": "Every professor I've ever had has a unique \"test style\". Whether they're the type to focus on the nitty-gritty or big picture, have more multiple choice or written answer questions, or tend to focus on specific topics, they have a preference for how they test students and that rarely changes. So if you go to the final, you at least know approximately how many pages it will be, topic focus, and whether or not you need to focus on EVERYTHING next time or a few core topics. Even if every single test question is changed, you at least have a general idea of what to expect and that does affect how you would study.",
              "author": "siouxwhatever",
              "created": 1576373351,
              "upvotes": 7,
              "replies": {
                "fawqboe": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawqboe/",
                  "text": "I agree 100%, every professor I’ve ever had gave test in different ways. That’s why I always know if I can score above an 80 on first exam I’m good.",
                  "author": "collegedriper",
                  "created": 1576374261,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fauah2z": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauah2z/",
              "text": "Hahah...many instructors/professors make small changes or operate on a cycle with exams and classwork. That's why file rooms are so effective.",
              "author": "monkeyman88956",
              "created": 1576346291,
              "upvotes": 15,
              "replies": {}
            },
            "favtl0g": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favtl0g/",
              "text": "It's about knowing how similar the question are to the exercises and how well you can predict what kind of questions will be asked in the exam.  \nIt's really about being able to gauge how well you are prepared for the exam.  \nIt's not about the actual questions, it's about their style and depth.",
              "author": "Tuomas90",
              "created": 1576362031,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fau3e3p": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau3e3p/",
      "text": "In my calc 3 class, one of the students stopped showing up halfway through. When he showed up for the final, teacher called him out: \"Why are you here? You have a 20%, there's nothing you can do to pass. You haven't showed up to class in months, it's too late for you. You should just leave.\"\n\n&#x200B;\n\nWas very surprising, he was a super chill dude who was generally very nice",
      "author": "temsik1587againtwo",
      "created": 1576343986,
      "upvotes": 482,
      "replies": {
        "fau6xgh": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau6xgh/",
          "text": "Wow that is so rude, I would never speak that way to a student (although I definitely have those thoughts!).\n\nThe frustration is real though, it's so confusing. I had a student this semester who stopped coming to class after the first month. Then recently they started submitting late assignments (I give 50% credit for late assignments). Still wasn't coming to class, but they showed up to the final. Totally bombed it and of course failed the class. I really don't get why they would bother, it was such a waste of their time and money.",
          "author": "GrandmaMabelGrey",
          "created": 1576345076,
          "upvotes": 314,
          "replies": {
            "fau7llk": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau7llk/",
              "text": ">I would never speak that way to a student\n\nI might well do so privately, but doing it in front of the class is a FERPA violation in the US-- grade information is confidential and \"outing\" a failing student like that is beyond unprofessional.",
              "author": "SnowblindAlbino",
              "created": 1576345316,
              "upvotes": 296,
              "replies": {
                "faubn4t": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faubn4t/",
                  "text": "ferpa violation?",
                  "author": "takkun22",
                  "created": 1576346570,
                  "upvotes": 47,
                  "replies": {
                    "faud4n8": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faud4n8/",
                      "text": "federal educational rights and protections act. makes it illegal for professors or other faculty to share info like students grades and other personal identifying info like addresses",
                      "author": "plaanet",
                      "created": 1576346947,
                      "upvotes": 116,
                      "replies": {
                        "fautp6h": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fautp6h/",
                          "text": "Family* educational rights and privacy act. Fwiw. \n\nQuick Q, though. Anybody ever had a class where the professor laid out graded work with scores on them on a table at the front of class for everyone to just go sort through and pick up? That's illegal, right? I wasn't too phased by it, but if my scores had been bad I would have been embarrassed...",
                          "author": "throwaway99112211",
                          "created": 1576352530,
                          "upvotes": 46,
                          "replies": {
                            "fav4qi8": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav4qi8/",
                              "text": "My physics professor has done that with every assignment this semester. The only thing he handed directly were exams.",
                              "author": "Dont_Blink__",
                              "created": 1576355662,
                              "upvotes": 10,
                              "replies": {}
                            },
                            "fav7uiy": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav7uiy/",
                              "text": "I don’t know about illegality, but it certainly is discouraged at my school for Ferpa reasons. I used to write the score on the back. Now I don’t hand back anything that way.",
                              "author": "ILoveCreatures",
                              "created": 1576356451,
                              "upvotes": 8,
                              "replies": {}
                            },
                            "favnsdn": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favnsdn/",
                              "text": "It's happened all the time in my classes. The worst though was when a professor handed back the midterms in order of worst grade to best :/",
                              "author": "twentyoneastronauts",
                              "created": 1576360554,
                              "upvotes": 5,
                              "replies": {}
                            },
                            "fb0degf": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0degf/",
                              "text": ">Anybody ever had a class where the professor laid out graded work with scores on them on a table at the front of class for everyone to just go sort through and pick up?\n\nI do that all the time-- but the grades are on the last page so not visible. Technically even *enrollment status* is protected (we're not supposed to let anyone see a roster, for example) but since my classes are all <25 there's no anonymity there. Posting or making grades public is certainly a violation, but it's simply enough to put them on the back of papers before you lay them out on the table like this.",
                              "author": "SnowblindAlbino",
                              "created": 1576425047,
                              "upvotes": 1,
                              "replies": {
                                "fb0ypw1": {
                                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0ypw1/",
                                  "text": "Enrollment status sounds like a thing that's just university policy, since things like date of attendance at a university aren't protected under FERPA.",
                                  "author": "bl1y",
                                  "created": 1576430529,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "fb0vjij": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0vjij/",
                              "text": "It's not \"illegal.\"\n\nBut the question for FERPA is whether this practice would constitute a disclosure, and that's going to be somewhat borderline. It'd be very fact-specific and come down mostly to how easy is it to read other people's grades.",
                              "author": "bl1y",
                              "created": 1576429643,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "favrkk3": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favrkk3/",
                          "text": "It's not just faculty. I run a student org where we review semester gpa and we have to follow FERPA too.",
                          "author": null,
                          "created": 1576361536,
                          "upvotes": 2,
                          "replies": {
                            "fb0ujh8": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0ujh8/",
                              "text": "That's pretty odd. Schools can share information among school officials, but it'd be weird for a student organization to count. Instead, you'd need to get a waiver from the student, though at that point the org wouldn't have to follow FERPA.",
                              "author": "bl1y",
                              "created": 1576429408,
                              "upvotes": 1,
                              "replies": {
                                "fb1f0gi": {
                                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb1f0gi/",
                                  "text": "We have a waiver but it's specific to where only certain org leadership can view and discuss member grades. We have to contain the viewing of them to those people because of FERPA.",
                                  "author": null,
                                  "created": 1576435968,
                                  "upvotes": 1,
                                  "replies": {
                                    "fb1gli8": {
                                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb1gli8/",
                                      "text": "More likely just school policies.\n\nIf you sign a waiver letting me see your grades and I shout them from the rafters... I'm just an asshole. The government doesn't care though.",
                                      "author": "bl1y",
                                      "created": 1576436640,
                                      "upvotes": 1,
                                      "replies": {
                                        "fb1opt4": {
                                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb1opt4/",
                                          "text": "Hmm. I'll have to check on this.",
                                          "author": null,
                                          "created": 1576439161,
                                          "upvotes": 1,
                                          "replies": {
                                            "fb1pkb4": {
                                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb1pkb4/",
                                              "text": "FERPA only regulates what policies schools need to get federal funding. When you give your info to someone else, not FERPA's business.",
                                              "author": "bl1y",
                                              "created": 1576439410,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "faz7vb0": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faz7vb0/",
                          "text": "> makes it illegal for professors or other faculty to share info like students grades and other personal identifying info like addresses\n\nNot quite. It makes it illegal for the federal government to give funding to a school that allows its professors to release student records.\n\nIt also does allow information like addresses to be disclosed.",
                          "author": "bl1y",
                          "created": 1576412995,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "fax27uu": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax27uu/",
                      "text": "> ferpa violation?\n\nThe [US student privacy law,](https://studentprivacy.ed.gov/faq/what-ferpa) which protects all personally identifiable info for students, including grades, ID numbers, course registration, transcripts, etc.",
                      "author": "SnowblindAlbino",
                      "created": 1576377891,
                      "upvotes": 6,
                      "replies": {
                        "faz7x97": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faz7x97/",
                          "text": "It protects student records, not personally identifiable information.",
                          "author": "bl1y",
                          "created": 1576413018,
                          "upvotes": 0,
                          "replies": {
                            "fazs0ru": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fazs0ru/",
                              "text": "It's interpreted differently at different schools, but grade information in particular is covered.",
                              "author": "SnowblindAlbino",
                              "created": 1576419036,
                              "upvotes": 1,
                              "replies": {
                                "fb0u17k": {
                                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0u17k/",
                                  "text": "Of course grade information is protected, I was talking about the other stuff. On this sub lots of people get FERPA wrong and most seem to just be guessing at it. Doesn't help that schools also get lots of it wrong -- my department chair thinks only bad grades are confidential FFS.\n\nYour ID and course registration wouldn't be protected.",
                                  "author": "bl1y",
                                  "created": 1576429244,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fb097uq": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb097uq/",
                  "text": "Yesssssss! As soon as I read that “20%” my immediate thought was: “Oh noooooo! FERPA violation!”",
                  "author": "Bonfire0fTheManatees",
                  "created": 1576423874,
                  "upvotes": 3,
                  "replies": {}
                },
                "faz82jf": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faz82jf/",
                  "text": "The specific 20% number would be a problem for FERPA, but other than that, the professor would probably be okay.",
                  "author": "bl1y",
                  "created": 1576413082,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "faupnjn": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faupnjn/",
              "text": "> Wow that is so rude, I would never speak that way to a student (although I definitely have those thoughts!).\n\nI guess maybe not in front of other students, but I feel like this is actually a necessary conversation.  If someone shows up for a final when they are clearly going to fail, even with a perfect score, I need to know if they've misunderstood something the entire semester, or perhaps they had a death in the family that they didn't tell anyone about, etc.  If nothing like that occurs, I feel like it'd behoove me to let them know that they are going to have a rough time in life if they don't change some things up.",
              "author": null,
              "created": 1576350853,
              "upvotes": 34,
              "replies": {}
            },
            "fauk8x4": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauk8x4/",
              "text": "Is that because they wanted to take the final so they'd know how it would be for the next time they took the class?",
              "author": "lacrimosa122",
              "created": 1576348885,
              "upvotes": 15,
              "replies": {}
            },
            "favlvce": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favlvce/",
              "text": "I've been this student admittedly. I know it's a waste of time (mine and yours) and money. I feel bad about it. I keep putting myself into that position because I want to change things, but ultimately end up falling back into the same routine. I know I've messed up, and all the fault is my own. I'm fine with making stupid mistakes but it's kinda gotten so deep that I'm not entirely sure how to fix everything with school. Which is too bad, I really do enjoy learning new things, I loved a lot of my teachers/professors, and I don't want to always be doing the same work I'm doing now.  \n\nIt sucks, I'm really stuck somewhere between wanting change and not caring about myself enough to care.",
              "author": "klassykitty",
              "created": 1576360035,
              "upvotes": 13,
              "replies": {
                "fax6uyu": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax6uyu/",
                  "text": "That sounds like me when I was in college. Learning disabilities, anxiety, depression and adhd here. Maybe get evaluated for some stuff if you haven’t because once I had my diagnoses, college was a lot better and I was able to change those patterns with proper help.",
                  "author": "sml09",
                  "created": 1576379557,
                  "upvotes": 3,
                  "replies": {}
                },
                "fb0ahz6": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0ahz6/",
                  "text": "If you haven’t tried talking to your professors, I really recommend it. We’re on Team Student! College can be overwhelming, especially for students today who often work several jobs in addition to taking classes, and often the combination of overwhelming work and huge life changes ends up bringing mental health issues to the surface. It’s easy to get caught in a shame spiral (“I’m too behind to talk to them! I’ll go to office hours after I’ve made up the last assignment!”) that results in not seeking the help you need. But we really are here to help!",
                  "author": "Bonfire0fTheManatees",
                  "created": 1576424234,
                  "upvotes": 2,
                  "replies": {
                    "fb43uwj": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb43uwj/",
                      "text": "Thank you for the advice and encouragement, it really means a lot to me. I think I will try talking to someone again about what I can do once the holidays are over. \n\nthings don't look pretty, but wish me luck lol. Hope everything is going well for you.",
                      "author": "klassykitty",
                      "created": 1576500824,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "fazwk56": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fazwk56/",
                  "text": "Have you tried meeting with your professors about it? I think sometimes students get into cycles where they feel bad about it so they don't want to talk to me... but I'm very available (and kind) when they do.",
                  "author": "GrandmaMabelGrey",
                  "created": 1576420292,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "favqd9l": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favqd9l/",
              "text": "I was that student last semester. In my case the reason was severe depression. Wasn’t getting out of bed most days past the first couple weeks of class. I got help too late, but still tried to salvage things in the last month and a half.",
              "author": "Millibyte_",
              "created": 1576361295,
              "upvotes": 10,
              "replies": {}
            },
            "faxul58": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxul58/",
              "text": "Depression finally lifted?",
              "author": "Kisua",
              "created": 1576390091,
              "upvotes": 2,
              "replies": {}
            },
            "favnp3s": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favnp3s/",
              "text": "They do that because they aren't paying with their own money",
              "author": "Petsweaters",
              "created": 1576360524,
              "upvotes": 1,
              "replies": {}
            },
            "fav1gfn": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav1gfn/",
              "text": "I only did that to classes I knew I could get a C in and the teacher either had a rough accent or couldn't teach me better than the book",
              "author": "AverageInternetUser",
              "created": 1576354792,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "favuyrc": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favuyrc/",
          "text": "My Cal 1 teacher, on the day of our second exam said to a student: \"Are you in the righr room?\"\n\nStudent: \"Yes.\"\n\nTeacher: \"Weird cause I've never seen you before in my life\"",
          "author": null,
          "created": 1576362495,
          "upvotes": 24,
          "replies": {}
        },
        "faujxnj": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faujxnj/",
          "text": "Pretty sure that goes against FERPA",
          "author": "toms47",
          "created": 1576348777,
          "upvotes": 26,
          "replies": {}
        },
        "fav3g7r": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav3g7r/",
          "text": "What a fucking savage lmao",
          "author": "WhatTheFuckDude420",
          "created": 1576355356,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fau0cn8": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau0cn8/",
      "text": "I was one of those students last year. Long story short I fell very behind in my classes due to a combination of extenuating circumstances, mental health issues and just sheer laziness.\n\nI still showed up to my finals because, although it may not make much sense, I wanted to make myself take responsibility for what had happened even though I knew I didn’t have much hope of passing. I made myself go to my finals because giving up completely and skipping finals seemed too much like a cop-out, and I thought that maybe the embarrassment of showing up at the final after being M.I.A most of the semester would motivate me to take better care of myself and stay on top of things next semester. Looking back, it didn’t really make any difference but it made sense in my head at the time.\n\nBut I would be willing to bet that some of those students may not realize they’re failing as badly as they are, don’t know how or are too lazy to calculate the grade they would need to pass, or have somehow convinced themselves that they might get a curve or extra credit that will help them pass. Sounds ridiculous, but some people are just that dumb/entitled.",
      "author": "dixiecup3",
      "created": 1576343211,
      "upvotes": 165,
      "replies": {
        "fau0s5k": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau0s5k/",
          "text": "Not ridiculous. I’m just trying to understand. \n\nDid you reach out to the professor(s) during the event? Not everyone will, but I have some students I’ve given extensions due to the reasons you listed. I suspect that’s happening with some of the other students. I let the class know they can talk to me. Have you had this message effectively communicated? If so, how?\n\nI had mental health crises in college too. Definitely willing to help.",
          "author": "KaleMunoz",
          "created": 1576343346,
          "upvotes": 67,
          "replies": {
            "favgnso": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favgnso/",
              "text": "For me, I missed most classes due to a disability which my parents convinced me wasn’t a disability. So I spent the whole time being embarrassed that I couldn’t make my classes, I would have anxiety before classes and worry about my peers or profs calling me out on my absences. So I missed even more. \nI was good at studying and exams so I would always show up for those knowing no one would speak to me. I would quickly finish the exam and leave before most of my classmates were done and usually get a decent mark. \n\nMy disability is migraines, which were amplified by the completely irregular schedule of college. My profs were understanding in the beginning, but then they just thought I didn’t care. \n\nTo end on a positive note, I actually paid off my student loans today. Even though I was never able to make it to graduation. At least I’m debt free now!",
              "author": "freedandelions",
              "created": 1576358702,
              "upvotes": 19,
              "replies": {
                "faw1pao": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faw1pao/",
                  "text": "It’s my first semester in college rn and I have migraines to the extent where it’s almost chronic. I am trying my best, and I should pass everything but it is so much harder",
                  "author": "luxcsia",
                  "created": 1576364747,
                  "upvotes": 4,
                  "replies": {
                    "fax4bdd": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax4bdd/",
                      "text": "It is definitely harder, ask for a note taker for the classes you will miss. You’re in the first semester so don’t give up yet. Speak to all your profs ahead of time in the beginning of each semester. Try not to miss labs or things that can’t be done outside of class (I know it’s not always in your control). Please pm me if you feel despair or just need a morale boost. :) I know what you’re going through.",
                      "author": "freedandelions",
                      "created": 1576378601,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "fb0epfh": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0epfh/",
                  "text": ">My disability is migraines, which were amplified by the completely irregular schedule of college. My profs were understanding in the beginning, but then they just thought I didn’t care.\n\nDid you tell them? I have had many students subject to migraines and it's been relatively easy to work with them-- if they are having an episode I just excuse them from the class/assignments as with any other medical condition, and then I meet with them when they are able to go over what they missed.",
                  "author": "SnowblindAlbino",
                  "created": 1576425399,
                  "upvotes": 1,
                  "replies": {
                    "fb3ih9m": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb3ih9m/",
                      "text": "I did, I think my profs were overworked. They didn’t answer emails consistently and never had time to meet after class. Most of them had a second job too.",
                      "author": "freedandelions",
                      "created": 1576474241,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fb916qi": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb916qi/",
              "text": "No, I didn't reach out to my professors even though I knew I could have. I knew that most of my professors would try to help, but I'm just one of those people who doesn't like to reach out for help, which is my own issue that i need to work on. I didn't want to come across as one of those excuse-making \"sob story\" students. I'm not really sure if there's anything my professors could have done to help with that, it's kind of just a personal thing.\n\nI'm also far too used to the attitude that my high school teachers had, which was something along the lines of \"I've heard every excuse under the sun; if it's not on my desk by the start of class then it's a 0 no matter what your reason is.\" I know they were just trying to teach us responsibility, which I appreciate, but it kind of conditioned me to think that if I fall behind then it's no use trying to catch up. As I'm getting older, though, I'm realizing that the real world is typically more understanding than that. Obviously deadlines are extremely important, but most of the time people will try to accommodate if you have extenuating circumstances as long as you communicate what's going on. I know most of my professors would be understanding, I just haven't got to the point where I can be understanding towards myself, if that makes sense.\n\nI think next semester I'm going to register my mental health diagnoses through the university, whatever that looks like, and if it works out I'm going to encourage my friends with similar issues to do that same. I know that my professors can't help me unless I tell them what's going on, and since I'm really bad about telling them then going the official route might make things easier on everyone.",
              "author": "dixiecup3",
              "created": 1576626765,
              "upvotes": 3,
              "replies": {
                "fb9czef": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb9czef/",
                  "text": "Yes, do that. Take every accommodation you can. \nI’m currently reaching out to students to offer an incomplete. Less than half took me up on the offer, but I’m glad for those who did. \n\nProfessors are not all understanding, but a lot are. We’re notoriously late in our professional life. We joke that being a professor means starting every email with “sorry for the late response.” Very few journals have a quick turnaround time, but they usually have quick deadlines. I just can’t in good conscience say “on time or 0.” Some professors agree with me, other don’t.",
                  "author": "KaleMunoz",
                  "created": 1576635392,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "faxvmae": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxvmae/",
              "text": "I didn't miss a singly class, turned in the homework I could, and will probably end up with all D's. Maybe a b and one c. Took too many tough classes in one term, realized the focus of my degree isn't within my skill set, and had depression + back to back colds. I communicated with all my teachers, and got extensions, but still couldn't turn things around. I was so close to passing (a C) that I kept trying even though I knew my capacity wouldn't change. I even dropped a day of work, and still didn't have enough time to get 50-70 hrs of school work done in a week with work and sleep.",
              "author": "Kisua",
              "created": 1576390639,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fauiq7d": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauiq7d/",
          "text": "Your last point is a good one, there's not much grade transparency in college, I can easily see how a student knows they're on the verge of failing, but not know that it's beyond hopeless",
          "author": "thatLifeVibe",
          "created": 1576348392,
          "upvotes": 9,
          "replies": {}
        },
        "fawm1gh": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawm1gh/",
          "text": "This 100x. I had the same thing happen to me. I have struggled with depression for a very long time. It has its up and downs, but now it almost seems as though I have a completely different version than what I have dealt with in the past. I am incredibly unmotivated to go to class, complete assignments, anything. I can’t get out of bed in the morning.\n\nEven though I know my grades are terrible, I still hold myself accountable for showing up to exams and finals. I don’t know why. \n\nI know it frustrates my professors and I wish I could tell them, but it just feels pointless the more time that passes. Hoping to get some mental health help next semester so something can change. \n\nWhile this may not be a student’s reason for not showing up all semester, it certainly could be, so I understand.",
          "author": "cha_charealsmooth",
          "created": 1576372939,
          "upvotes": 5,
          "replies": {
            "fb0h5nx": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0h5nx/",
              "text": ">I know it frustrates my professors and I wish I could tell them,\n\nTell them!  We can't help if we don't know. I've had quite a few students struggle with depression on their own, isolation, until they finally brought it up in a one-on-one with me.  Often I've been able to convince them to get help-- and I've even walked them to the counseling center to make an appointment. You can't just tough your way through depression; getting help is the first step to getting better. If telling a trusted professor is the first step in that, good. If not, talk to an RA or go to your campus counseling center.",
              "author": "SnowblindAlbino",
              "created": 1576425982,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fau044a": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau044a/",
      "text": "I have the same questions.\n\nSometimes maybe it's a financial aid thing? If they fail the class but show up to the final then the penalties are different? I really don't know, just something I have heard at my university.",
      "author": "GrandmaMabelGrey",
      "created": 1576343137,
      "upvotes": 139,
      "replies": {
        "fau8yr7": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau8yr7/",
          "text": "Yeah, at my college, students who don't attend classes the entire semester may have to give back financial aid based on when they stopped coming to class. If they show up to the final, their last day of attendance is the same as everyone else's.",
          "author": "BewareTheSphere",
          "created": 1576345787,
          "upvotes": 92,
          "replies": {
            "favovij": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favovij/",
              "text": "Interesting. At my college they only took attendance for the first two weeks. After that it didn't matter for financial aid. I never would have thought it would be different at other colleges.",
              "author": "I_goofed",
              "created": 1576360921,
              "upvotes": 9,
              "replies": {
                "fawjfxx": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawjfxx/",
                  "text": "At my university I have to enter every student's final date of attendance when I enter their final grades. It's exactly because of people taking financial aid and never going to class.",
                  "author": "KiltedLady",
                  "created": 1576372228,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "favusc4": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favusc4/",
              "text": "That seems stupid to me. Unless the school also gives back the tuition for the portion of the class that wasn't attended, which probably isn't the case.",
              "author": "ArcadeStallman",
              "created": 1576362436,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fau0v40": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fau0v40/",
          "text": "Interesting.",
          "author": "KaleMunoz",
          "created": 1576343368,
          "upvotes": 29,
          "replies": {
            "faua2kw": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faua2kw/",
              "text": "At my university we give UF and EF ( = unearned F and earned F). If we give an UF, this means that the student disappeared early in the semester and just didn't complete the class, we have to note the date of their last recorded activity. If we give EF, that means they were active throughout the semester but still got an F score.\n\nOn student transcripts it just shows up as F, but it has something to do with financial aid requirements and university reporting.",
              "author": "GrandmaMabelGrey",
              "created": 1576346161,
              "upvotes": 31,
              "replies": {
                "fav5a06": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav5a06/",
                  "text": "Wdym by “Complete the class”?",
                  "author": "steplaser",
                  "created": 1576355750,
                  "upvotes": 2,
                  "replies": {
                    "fav9vy9": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav9vy9/",
                      "text": "They didn’t complete assignments, take exams, including the final exam",
                      "author": "ILoveCreatures",
                      "created": 1576356904,
                      "upvotes": 4,
                      "replies": {
                        "fava84k": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fava84k/",
                          "text": "All assignments, most assignments? Where do you draw the line?",
                          "author": "steplaser",
                          "created": 1576356983,
                          "upvotes": 1,
                          "replies": {
                            "fawiub0": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawiub0/",
                              "text": "If they turned in the last assignment or took the final exam, they completed the class. All the rest is missed assignments that probably get zeros. Then it is an “earned” F instead of an “unearned” F (when the student stops coming)",
                              "author": "ILoveCreatures",
                              "created": 1576371961,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "fb0l7e4": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0l7e4/",
                              "text": "It's subjective and up to the professor's discretion, but we do have to include the date of their last activity in the course if we checked that it was an UF. For me I would give a UF if someone disappeared at some point in the first half of the semester (so prior to midterm time). I give an EF if they continued on past that point, even if they didn't take the final and/or stopped showing up for the last two or three weeks.",
                              "author": "GrandmaMabelGrey",
                              "created": 1576427006,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fav9bf4": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav9bf4/",
          "text": "Yes, this is really the answer. At my school we need to record the last day of attendance for what are called “unearned” F’s, when a student stops coming at some point in the semester. There is also a “did not attend” option for those who never appeared. As a result, they may have to return some or all of their financial aid. \n\nSome students register for classes in order to have credits they need for financial aid but they never intend to take the class.",
          "author": "ILoveCreatures",
          "created": 1576356792,
          "upvotes": 2,
          "replies": {
            "favk83o": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favk83o/",
              "text": "At my school if a student is recieving finance aid they periodically email their professors and ask if they've been attending class.",
              "author": "Bomcom",
              "created": 1576359599,
              "upvotes": 3,
              "replies": {}
            },
            "fb0i241": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb0i241/",
              "text": ">At my school we need to record the last day of attendance for what are called “unearned” F’s,\n\nThat's interesting to me, as we don't take attendance at all. Or, rather, it's up to the instructor. I don't because it seems too high school to me; students are adults and can make their own choices about attending.  We are asked to note students who are not attending at all so they can withdraw, but I've had a few students who just disappear after a month or so and don't respond to my inquiries-- they just get the grade they earned at the end of the semester.",
              "author": "SnowblindAlbino",
              "created": 1576426184,
              "upvotes": 1,
              "replies": {
                "fb1b2jn": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb1b2jn/",
                  "text": "Yes, I don’t take attendance either. If you don’t take attendance, you go by the last exam or assignment that they did.",
                  "author": "ILoveCreatures",
                  "created": 1576434343,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fb081e2": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb081e2/",
          "text": "Yes and no. In the school I attended if you were absent 3 days then you were dropped. If you didn’t attend the first day of class you were dropped. If you were failing the class then you were dropped. Depending on when it happened and the circumstances of it, you may have to pay back financial aid or not. I had to pay back close to $1300 in financial aid because I dropped a class late and got dropped from a class. Luckily I had that money but it taught me to never spend my financial money in case something like that happened again. Also you won’t owe money if a class is canceled but you may lose funding if you don’t find a replacement one fast. You get funding for halftime and full time status only.",
          "author": "sadxtortion",
          "created": 1576423521,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fatkosn": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fatkosn/",
      "text": "Unfortunately people don’t know how to manage their time or just don’t care. It’s funny cause I had my bio final yesterday and the room was jam packed with people that I hadn’t even seen for the whole semester. I don’t think I’ll understand the logic behind that, but hey, it is what it is.",
      "author": "fl4kz",
      "created": 1576339152,
      "upvotes": 289,
      "replies": {
        "fauqmxa": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauqmxa/",
          "text": "I'm not sure if that's the case \n\nIn my medical cohort not many people show up to lectures at all but do all the coursework and compulsory classes (Dissections) \n\nPeople have different ways of learning and they find success in that hence when exams come up I feel like I'm in the wrong exam hall because so many people idk show up\n\nBut yh while most do the work a lot just do the bare minimum",
          "author": "MeMER-425",
          "created": 1576351377,
          "upvotes": 92,
          "replies": {
            "faurcal": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faurcal/",
              "text": "Yeah you’re right. I suppose many of those people might have a specific way of doing things and have access to notes/other means of learning. As long as they succeed in their own respect and are happy with themselves, I try to pass no judgement",
              "author": "fl4kz",
              "created": 1576351755,
              "upvotes": 21,
              "replies": {
                "fav0q1d": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav0q1d/",
                  "text": "Yeah my econ professor is trash, I haven't shown up to lecture since the first midterm, but got 97 on the first midterm, 100 on the second, and my estimate is somewhere in the 85-95 range for the final I took yesterday (there were various pieces of trivia we were for some reason meant to know; anyways, I think I only need an 83 to keep my A so I'm good). I still did all my work.\n\nFor me, the cost of going to lecture (asking up for a 9am lecture three days a week, and sitting there bored as hell for an hour) was greater than the benefit (the potential that she might say something relevant), so I didn't show.",
                  "author": "TrekkiMonstr",
                  "created": 1576354622,
                  "upvotes": 27,
                  "replies": {}
                }
              }
            }
          }
        },
        "fausdfi": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fausdfi/",
          "text": "I walked in early to one of my finals and I had to ask people if I was in the right place because none of the faces seemed familiar. (Professor hadn’t arrived yet). I literally freaked out I missed my final exam",
          "author": "microfsxpilot",
          "created": 1576352113,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "fatkfvs": {
      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fatkfvs/",
      "text": "• Gotta have something to argue that you tried your hardest when confronting your parents\n\n• Gotta keep up appearances to friends \"oh yeah this final is gunna kill me too, dude.\"",
      "author": "simplplan540",
      "created": 1576339059,
      "upvotes": 1428,
      "replies": {
        "fatl8k6": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fatl8k6/",
          "text": "That actually makes a ton of sense.",
          "author": "KaleMunoz",
          "created": 1576339317,
          "upvotes": 587,
          "replies": {
            "fauopoe": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauopoe/",
              "text": "I recently had a final and I heard the person in front of me say \"theres literally no way I can pass this class. I'm drawing a flower and leaving.\" Dont know why he came, but he left in 5 minutes so I believe him",
              "author": null,
              "created": 1576350409,
              "upvotes": 313,
              "replies": {
                "fauyt1n": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauyt1n/",
                  "text": "This is like when I straight up write “ I don’t know”  on some quizzes.",
                  "author": "vr1252",
                  "created": 1576354103,
                  "upvotes": 148,
                  "replies": {
                    "favvh2k": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favvh2k/",
                      "text": "I write \"you wrote this question, you should know the answer \"",
                      "author": null,
                      "created": 1576362622,
                      "upvotes": 95,
                      "replies": {
                        "favytuq": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favytuq/",
                          "text": "That’s really fucking funny",
                          "author": null,
                          "created": 1576363752,
                          "upvotes": 36,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "faxvmek": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxvmek/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1576390640,
                  "upvotes": 11,
                  "replies": {}
                },
                "favt8p5": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favt8p5/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1576361983,
                  "upvotes": -90,
                  "replies": {
                    "favu5f9": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favu5f9/",
                      "text": "Oh cool a new troll account to block, Nice.",
                      "author": null,
                      "created": 1576362221,
                      "upvotes": 33,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "favejyh": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favejyh/",
              "text": "Additionally some financial aid requires the last date of attendance if the student fails. They don’t always have to pay the aid back for failure, but will require the last date of attendance to prove they tried in the course. If they fail, they may also have the option of retaking it later for a grade forgiveness. I’m assuming they realized they were struggling after the drop date or they would become part time by dropping the course and have to repay money for that. The GI Bill uses these rules due to some vets struggling with college or certain courses",
              "author": "huskeya4",
              "created": 1576358179,
              "upvotes": 80,
              "replies": {
                "fazw4ia": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fazw4ia/",
                  "text": " The guy didn't go to class. He didn't bother to take any tests or turn in any papers. What college do you know of that would allow that?  Plus Financial Aid only lasts so long. I got grants for 2 years, after that I was on my own. Fortunately, I won scholarships, but I still had to take out loans. If I had failed too many classes Financial Aid would have dropped me altogether. They wouldn't have extended the money. I know someone who tried that. She got away with dropping 2 classes, and they hauled her into the office and told her she'd be cut off if she did it again.\n\nIf you know of a college like that let me know. I wont even go there but take a bunch of free courses to get a more advanced job position.",
                  "author": "djustice5773",
                  "created": 1576420189,
                  "upvotes": 3,
                  "replies": {
                    "fb503k8": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fb503k8/",
                      "text": "He didn’t turn in any papers or got to class for one of his classes. He could have attended all of his others and gotten great grades in those but decided he was better off pursuing those classes. He could have overloaded his schedule and not realized until it was too late to withdraw. Or he could just be partying it up like a dumb kid. I just have a different perspective on why he may have chosen a failing grade. Additionally if this is the only class he’s done that with and he wasn’t a freshman, he probably didn’t lose his financial aid  because his pass/fail rate and gpa could have been high enough to keep it",
                      "author": "huskeya4",
                      "created": 1576518481,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fatlwca": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fatlwca/",
              "text": "Yeah I realize you were ranting, but those are the honest reasons I see that person I haven't seen in 2 months show up lol",
              "author": "simplplan540",
              "created": 1576339437,
              "upvotes": 167,
              "replies": {
                "fauu3dm": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauu3dm/",
                  "text": "Not a professor, but I’ve also seen those kind of classmates lol. Shows up for a couple first week, and shows up the day before final. Like what the fuck?",
                  "author": "IllegalAlcoholic",
                  "created": 1576352735,
                  "upvotes": 58,
                  "replies": {
                    "favq6t3": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favq6t3/",
                      "text": "Justify spending mommy and daddy's money?",
                      "author": "G9ers",
                      "created": 1576361246,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fax5x5k": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fax5x5k/",
              "text": "There also class that are so easy that you don't have to show up. I have a class where I can for the first two week and then I skip the rest but keep doing the homework. I took the final and got an 80.",
              "author": "blades318",
              "created": 1576379208,
              "upvotes": 8,
              "replies": {}
            },
            "fawe0qf": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawe0qf/",
              "text": "What’s the goal of a course? To learn the material. If a person shows up and scores an A, then they either were smart enough to learn it on their own, cheated, or it’s a subject they already had stellar knowledge in and taking it for some bureaucratic(?) reason. I don’t see a problem in giving them a high grade, unless it’s a course in which the in-class participation was of major value. \n\nWhy would you consider failing someone who you felt knew the material enough to receive an A on the Final? Isn’t the entire purpose of the curriculum to prepare you for a final examination that determines your fundamental understanding of said material? BTW, never had the brains or balls to pull this move, but genuinely curious",
              "author": "wavetoyou",
              "created": 1576369717,
              "upvotes": 8,
              "replies": {
                "faxao2d": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxao2d/",
                  "text": "I give a final out of pressure to conform. \n\nI’m not convinced at all it’s the best assessment of how well they know the material. I don’t even give cumulative finals. \n\nThe collective result of the benchmark essays, in class quizzes, and collaborative projects tell me what they’re learning and not learning. If that’s all 0 percent, and an exam worth 15 percent is high (it usually isn’t in these cases), it really does represent about 15 percent of learning in the course.",
                  "author": "KaleMunoz",
                  "created": 1576381134,
                  "upvotes": 10,
                  "replies": {
                    "faxvtbf": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxvtbf/",
                      "text": "damn my exams are worth 40%. fml",
                      "author": "khaleesi_onthatbeat",
                      "created": 1576390744,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fauysos": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fauysos/",
              "text": "Not really, though.\n\nIt is college, not middle school. We are talking adults, so who cares what the parents think. \n\nSimilarly, who cares about the friends.\n\nIt's possible they were going through a really tough time, and think that if they do exceptionally well on the final, you will have empathy and pass them,  which is understandable.\n\nDespite what college tries to brainwash into profs and students, it is a business and they are paying for training for a future career. That's it. So do not sound so hurt that someone didnt attend your lectures. Youre not special in their eyes, nor should you be.",
              "author": "GtechWTest843",
              "created": 1576354099,
              "upvotes": -20,
              "replies": {
                "fav0nhp": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav0nhp/",
                  "text": "A lot of college students are in some way dependent on their parents though.\n\nI can also imagine that plenty of people still care about what their parents think of them, even when they're already adults.",
                  "author": "Han_without_Genes",
                  "created": 1576354607,
                  "upvotes": 43,
                  "replies": {
                    "fav33bh": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav33bh/",
                      "text": "But the dinner table discussions that you had  in high school about your grades is common in college?",
                      "author": "steplaser",
                      "created": 1576355235,
                      "upvotes": -3,
                      "replies": {
                        "fav45h5": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav45h5/",
                          "text": "I'm 39. I have a house with a mortgage, a full-time job, and haven't lived at home since I was 19. I still talk to my parents about my grades.",
                          "author": "Dont_Blink__",
                          "created": 1576355481,
                          "upvotes": 20,
                          "replies": {
                            "fawq71b": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawq71b/",
                              "text": "Same here. I called my mom after I got my final grades Friday.",
                              "author": "ParamedicSnooki",
                              "created": 1576374207,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "fav8958": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav8958/",
                              "text": "So you are a student...still?",
                              "author": "steplaser",
                              "created": 1576356499,
                              "upvotes": -9,
                              "replies": {
                                "fav8c5a": {
                                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav8c5a/",
                                  "text": "No, I am a student...again.",
                                  "author": "Dont_Blink__",
                                  "created": 1576356526,
                                  "upvotes": 17,
                                  "replies": {}
                                }
                              }
                            },
                            "favfeyh": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favfeyh/",
                              "text": "Well perhaps you're looking for affirmation or a pat on the back.",
                              "author": "GtechWTest843",
                              "created": 1576358358,
                              "upvotes": -11,
                              "replies": {
                                "favqikm": {
                                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favqikm/",
                                  "text": "Or, I was demonstrating that it's normal to talk about your life with your parents; of which school and grades are a major part, regardless of your dependance on your parents.",
                                  "author": "Dont_Blink__",
                                  "created": 1576361338,
                                  "upvotes": 8,
                                  "replies": {
                                    "favv9wi": {
                                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favv9wi/",
                                      "text": "Well only you know your particular case.\n\nDo you only discuss good grades?\n\nIf the answer is yes, then my original comment stands",
                                      "author": "GtechWTest843",
                                      "created": 1576362600,
                                      "upvotes": -3,
                                      "replies": {
                                        "favw694": {
                                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favw694/",
                                          "text": "Nope, quite the opposite actually. I'm sorry if my comment triggered your insecurity about your relationship with your parents.",
                                          "author": "Dont_Blink__",
                                          "created": 1576362858,
                                          "upvotes": 6,
                                          "replies": {
                                            "fawdxkt": {
                                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawdxkt/",
                                              "text": "Drink the koolaid buddy. GPA is everything! Write home about it!\n\nOr better yet,\n\nGo encourage some child abuse by letting 5 year olds transition their sex",
                                              "author": "GtechWTest843",
                                              "created": 1576369680,
                                              "upvotes": -4,
                                              "replies": {}
                                            }
                                          }
                                        },
                                        "fawaali": {
                                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fawaali/",
                                          "text": "I always had open conversations with my parents about grades. They are great people to talk to, extremely wise, and offer great advice when Im struggling.  Obviously i love to share my good grades, because I still want to make them proud. I also discussed my grades with them when I was failing a class. I think it’s normal to discuss these kinds of things with your parents and many people care (at least somewhat) about what their parents think during college.",
                                          "author": "hmore6251",
                                          "created": 1576368122,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fav9qo7": {
                  "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav9qo7/",
                  "text": "College isn’t always so utilitarian, but point taken.",
                  "author": "KaleMunoz",
                  "created": 1576356891,
                  "upvotes": 5,
                  "replies": {
                    "favehnw": {
                      "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favehnw/",
                      "text": "But you would agree it should be, I assume.",
                      "author": "GtechWTest843",
                      "created": 1576358159,
                      "upvotes": -5,
                      "replies": {
                        "favj9ag": {
                          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favj9ag/",
                          "text": "> I have an opinion\n>> I don't think your opinion is right\n>>> But you agree it should be, right?",
                          "author": "FatWollump",
                          "created": 1576359360,
                          "upvotes": 8,
                          "replies": {
                            "favmhwr": {
                              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/favmhwr/",
                              "text": "That's not what I said at all.\n\nI'm asking them a question to see if they feel college should be focused on practicality, as they said they got my point.\n\nThem saying it isnt always utilitarian  struck me as them agreeing, given the context (you know, where they said point taken)\n\n\"Always SO utilitarian\" could mean\n\nA) relax man. It doesnt need to be practical at all times. Sot back and enjoy some lectures not directly related to your interest\n\nOr\n\nB) yeah, you're right. Sometimes things are ass backwards and we get lost In the shuffle. Things should tighten up, and perhaps college should be based strictly on practicality.\n\nYou know. That's like saying \"people arent always so logical\", or something else. Phrasing something that way is a figure of speech.\n\n\nBasically, I interpreted their reply as B and you interpreted it as A.\n\n\nSince I've demonstrably shown you how confusion can arise, hopefully your peabrain can ser why I posed the follow up.\n\nExcuse me for trying to get clarification.",
                              "author": "GtechWTest843",
                              "created": 1576360226,
                              "upvotes": -2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "faukzoz": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faukzoz/",
          "text": "Before I dropped out of engineering, I did this a lot. I knew I wasn't going to pass, but not going to the final would raise suspicions & all of my friends were going anyway. \nI think peer pressure plays a big role when it comes to class (& exam) attendance.",
          "author": "favmyheart",
          "created": 1576349129,
          "upvotes": 96,
          "replies": {
            "fazx0nq": {
              "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fazx0nq/",
              "text": "I had not considered that peer pressure would factor into whether or not people take their exams. Makes sense though.",
              "author": "GrandmaMabelGrey",
              "created": 1576420452,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fav16qz": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fav16qz/",
          "text": "That and if planning to take it again next semester, they'll have a really good idea of the class structure etc. This happened to me once where i was failing one class and gave up on it to focus on other classes, but still \"audited\" it so i could do well on it the following semester.",
          "author": "MindAlchemist",
          "created": 1576354695,
          "upvotes": 32,
          "replies": {}
        },
        "faxmru6": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/faxmru6/",
          "text": "Oh fuck. You just attacked me",
          "author": null,
          "created": 1576386263,
          "upvotes": 1,
          "replies": {}
        },
        "fhzpd3d": {
          "link": "/r/college/comments/eal8ly/not_judging_i_just_need_to_know_why_would_someone/fhzpd3d/",
          "text": "Yup a lot of people in college just figure hey it’s better than a full time job and it’s my parents money",
          "author": null,
          "created": 1582006489,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050781
}